
&После("ОпределитьОбъектыСКомандамиОтчетов")
Процедура Лико_ОпределитьОбъектыСКомандамиОтчетов(Объекты)
		Объекты.Добавить(Метаданные.Документы.Лико_ПодготовкаМатериалов);
        Объекты.Добавить(Метаданные.Документы.ЛикоРаспределениеРасходовПоЭтапам);
		Объекты.Добавить(Метаданные.Документы.Лико_ПодготовкаМатериалов);
        Объекты.Добавить(Метаданные.Документы.Лико_ЗаказНаРаскрой);
        Объекты.Добавить(Метаданные.Документы.Лико_ЗакрытиеЗаказа);


КонецПроцедуры

&После("ОпределитьРазделыСВариантамиОтчетов")
Процедура Лико_ОпределитьРазделыСВариантамиОтчетов(Разделы)
		Разделы.Добавить(Метаданные.Подсистемы.Лико_Склад,
			НСтр("ru= 'Отчеты по лк складу'"));

КонецПроцедуры
