
Процедура Лико_ПроведениеДокументовАсинхронноОбработчик(Источник) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Источник)=Тип("ДокументОбъект.ПриходныйОрдерНаТовары") И Источник.Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ Тогда
		
		НаборЗаписей = РегистрыСведений.Лико_АсинхронныеВызовыВПроведенииДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Источник.Ссылка);
		Запись=НаборЗаписей.Добавить();
		Запись.Документ=Источник.Ссылка;
		Запись.ДатаНачала=ТекущаяДата();
		НаборЗаписей.Записать();
		НаборПараметров= Новый Массив;
		мОрдеров=Новый Массив;
		мОрдеров.Добавить(Источник.Ссылка);
		НаборПараметров.Добавить(мОрдеров);
		Задание = ФоновыеЗадания.Выполнить("Лико_АсинхронныеПроцедуры.УстановкаДокументаПриходаВОбъектахНоменклатуры", НаборПараметров); 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановкаДокументаПриходаВОбъектахНоменклатуры(мПриходныеОрдера) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ПриходныйОрдер Из мПриходныеОрдера Цикл		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		мОбъектовНоменклатуры=ПолучитьТзОбъектовНоменклатуры(ПриходныйОрдер);
		Для каждого ОбъектНоменклатуры Из мОбъектовНоменклатуры Цикл
			ОбъектНоменклатурыОбъект=ОбъектНоменклатуры.ПолучитьОбъект();
			ОбъектНоменклатурыОбъект.ПриходныйОрдер=ПриходныйОрдер;
			ОбъектНоменклатурыОбъект.Записать();
		КонецЦикла; 	 	
		НаборЗаписей = РегистрыСведений.Лико_АсинхронныеВызовыВПроведенииДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ПриходныйОрдер);
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьТзОбъектовНоменклатуры(ПриходныйОрдер)
	УстановитьПривилегированныйРежим(Истина);
	Массив = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка = &ПриходныйОрдер
	|	И ПриходныйОрдерНаТоварыТовары.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный";
	Запрос.УстановитьПараметр("ПриходныйОрдер",ПриходныйОрдер );
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектНоменклатуры"); 	
КонецФункции



Процедура ПроведениеВыполнить(МассивСсылок,ИмяОперации="",Параметр="")Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			Объект=Ссылка.ПолучитьОбъект();
			Объект.Записать(РежимЗаписиДокумента.Проведение); 
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022



Процедура ДляПересчетаВыполнить(МассивСсылок,ИмяОперации="",Параметр="") Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			Лико_Планирование.ЗаполнениеПараметровВыпуска(Ссылка, Ложь);

			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022


  


Процедура ЗаписьВыполнить(МассивСсылок,ИмяОперации="",Параметр="")Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			Объект=Ссылка.ПолучитьОбъект();
			Объект.Записать(); 
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022

