
&Вместо("ТекстЗапросаТаблицаДвиженияЛико_ЗакрытиеБланка")
Функция Лико_ТекстЗапросаТаблицаДвиженияЛико_ЗакрытиеБланка(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Лико_ЗакрытиеБланка";

	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаРасход", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРасход(Запрос, ТекстыЗапроса);
	КонецЕсли;



	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	&ЗаказКлиента КАК ЗаказКлиента,
	|	&Ссылка КАК Распоряжение,
	|	&НомерПроката КАК НомерПроката,
	|	&ВидОперацииПриход КАК ВидОперации,
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДВижения,
	|	СУММА(ТаблицаТовары.Количество) КАК КоличествоЭтап,
	|	СУММА(ТаблицаТовары.Количество) КАК КоличествоДвижение,
	|	&ЭтапПроизводства КАК ЭтапПроизводства,
	|	ЛОЖЬ КАК Оснастка
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	(&НомерПроката <> 0
	|			ИЛИ &ЭтоПеремотка)
	|	И НЕ &ЭтоСборка
	|	И НЕ &СписаниеНаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоварыРасход.Номенклатура,
	|	ТаблицаТоварыРасход.Характеристика,
	|	&ЗаказКлиента,
	|	&Ссылка,
	|	&НомерПроката,
	|	&ВидОперацииРасход,
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	СУММА(ТаблицаТоварыРасход.Количество),
	|	СУММА(ТаблицаТоварыРасход.Количество),
	|	&ЭтапПроизводства,
	|	ТаблицаТоварыРасход.ДопРасход
	|ИЗ
	|	ВтТаблицаРасход КАК ТаблицаТоварыРасход
	|ГДЕ
	|	(&НомерПроката <> 0
	|			ИЛИ &ЭтоПеремотка)
	|	И НЕ &ЭтоСборка
	|	И ТаблицаТоварыРасход.МожноСписать
	|	И НЕ &СписаниеНаРасходы
	|	И ВЫБОР
	|			КОГДА &СписаниеКраскиЧерезЦеховуюКладовую
	//|				ТОГДА ТаблицаТоварыРасход.Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыКраска
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоварыРасход.Номенклатура,
	|	ТаблицаТоварыРасход.Характеристика,
	|	ТаблицаТоварыРасход.ДопРасход";



	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;


КонецФункции
