
&НаСервере
Процедура ПриоритетВверхНаСервере(Правило)
Справочники.Лико_ПараметрыРасчетаРаскрояМатериалов.ПереместитьПоПриоритету(Правило,-1);
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетВверх(Команда)
	ПриоритетВверхНаСервере(Элементы.Список.ТекущаяСтрока);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриоритетВнизНаСервере(Правило)
	Справочники.Лико_ПараметрыРасчетаРаскрояМатериалов.ПереместитьПоПриоритету(Правило,1);
  
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетВниз(Команда)
	
	ПриоритетВнизНаСервере(Элементы.Список.ТекущаяСтрока);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	ОткрытьФорму("Справочник.Лико_ПараметрыРасчетаРаскрояМатериалов.Форма.ПроверкаНоменклатуры");
КонецПроцедуры
