
&Вместо("УдалитьИзЗаказовСвязанныеСтроки")
Процедура Лико_УдалитьИзЗаказовСвязанныеСтроки(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.ИзготовлениеФорм.ОтчетФормногоУчастка = &ОтчетФормногоУчастка";

	Запрос.УстановитьПараметр("ОтчетФормногоУчастка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//Для каждого ТЧ Из Метаданные().ТабличныеЧасти Цикл
			НайденныеСтроки = ЗаказОбъект.ИзготовлениеФорм.НайтиСтроки(Новый Структура("ОтчетФормногоУчастка", Ссылка));
			Для каждого Строка из НайденныеСтроки Цикл
				ЗаказОбъект.ИзготовлениеФорм.Удалить(Строка);
			КонецЦикла;
		//КонецЦикла;
		Попытка
			ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			Отказ = Истина;
			Сообщить("Не удалось удалить строки из документа """ + Выборка.Ссылка + """: " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
