
#Область ОбработчикиСобытийФормы


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонтрольНаличияФотоБиркиРулонногоМатериалаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.КонтрольНаличияФотоБиркиРулонногоМатериала Тогда
		
		Элементы.ДатаНачалаКонтроляНаличияФотоБиркиРулонногоМатериала.Доступность = Истина;
		
	Иначе
		
		Элементы.ДатаНачалаКонтроляНаличияФотоБиркиРулонногоМатериала.Доступность = Ложь;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти