Функция ТекстЗапросаОстаткаКоробокСПризнакомДоступности() Экспорт

	Возврат 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(
		|			,
		|			Ячейка = &Ячейка
		|				И ВЫБОР
		|					КОГДА &РодительОбъектаНоменклатуры = НЕОПРЕДЕЛЕНО
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Серия.ЯССМ_ОбъектНоменклатуры.РодительОбъектаНоменклатуры = &РодительОбъектаНоменклатуры
		|				КОНЕЦ
		|				И Номенклатура.ДополнительныеРеквизиты.Свойство.Имя = ""ЗапчастиОснасткаВид_c52ae7cc4a5241f59cbbab22becfdcd8""
		|				И Номенклатура.ДополнительныеРеквизиты.Значение = &ЗначениеСвойстваПолимер) КАК ТоварыВЯчейкахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстатки.Ячейка,
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Серия,
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ячейка КАК Ячейка,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Серия КАК Серия,
		|	ВТ.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
		|	ВТ.Количество КАК Количество,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Лико_ДлинаОснастки""
		|				ТОГДА ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК ЧИСЛО(13, 1))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Длина,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Лико_ШиринаОснастки""
		|				ТОГДА ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК ЧИСЛО(13, 1))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Ширина,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Лико_ВидПолимера""
		|				ТОГДА ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.Лико_ВидыПолимеров)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВидПолимера,
		|	ВТ.ОбъектНоменклатуры.Длина КАК ДлинаОстатка,
		|	ВТ.ОбъектНоменклатуры.Ширина КАК ШиринаОстатка,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектНоменклатуры.РодительОбъектаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
		|				ИЛИ ВТ.ОбъектНоменклатуры.Длина <> 0
		|			ТОГДА NULL
		|		ИНАЧЕ ВТ.ОбъектНоменклатуры
		|	КОНЕЦ КАК ОткрытаяКоробка,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектНоменклатуры.Длина = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоОстаток
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО ВТ.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Лико_ДлинаОснастки""
		|				ИЛИ НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Лико_ШиринаОснастки""
		|				ИЛИ НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Лико_ВидПолимера"")
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Ячейка,
		|	ВТ.Номенклатура,
		|	ВТ.Серия,
		|	ВТ.Количество,
		|	ВТ.ОбъектНоменклатуры,
		|	ВТ.ОбъектНоменклатуры.Длина,
		|	ВТ.ОбъектНоменклатуры.Ширина,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектНоменклатуры.РодительОбъектаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
		|				ИЛИ ВТ.ОбъектНоменклатуры.Длина <> 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
		|		ИНАЧЕ ВТ.ОбъектНоменклатуры
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектНоменклатуры.РодительОбъектаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
		|				ИЛИ ВТ.ОбъектНоменклатуры.Длина <> 0
		|			ТОГДА NULL
		|		ИНАЧЕ ВТ.ОбъектНоменклатуры
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.Длина КАК Длина,
		|	ВТ2.Ширина КАК Ширина,
		|	ВТ2.ВидПолимера КАК ВидПолимера,
		|	МАКСИМУМ(ВТ2.ОткрытаяКоробка) КАК ОткрытаяКоробка
		|ПОМЕСТИТЬ ВТ_СПризнакомОткрытойКоробки
		|ИЗ
		|	ВТ2 КАК ВТ2
		|ГДЕ
		|	НЕ ВТ2.ОткрытаяКоробка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ2.Длина,
		|	ВТ2.Ширина,
		|	ВТ2.ВидПолимера
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.Ячейка КАК Ячейка,
		|	ВТ2.Номенклатура КАК Номенклатура,
		|	ВТ2.Серия КАК Серия,
		|	ВТ2.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
		|	ВТ2.Количество КАК Количество,
		|	ВТ2.Длина КАК Длина,
		|	ВТ2.Ширина КАК Ширина,
		|	ВТ2.ВидПолимера КАК ВидПолимера,
		|	ВТ2.ДлинаОстатка КАК ДлинаОстатка,
		|	ВТ2.ШиринаОстатка КАК ШиринаОстатка,
		|	ВЫБОР
		|		КОГДА ВТ2.ОткрытаяКоробка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоОткрытаяКоробка,
		|	ЕСТЬNULL(ВТ_СПризнакомОткрытойКоробки.ОткрытаяКоробка, ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)) КАК ДругаяОткрытаяКоробка
		|ИЗ
		|	ВТ2 КАК ВТ2
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СПризнакомОткрытойКоробки КАК ВТ_СПризнакомОткрытойКоробки
		|		ПО ВТ2.Длина = ВТ_СПризнакомОткрытойКоробки.Длина
		|			И ВТ2.Ширина = ВТ_СПризнакомОткрытойКоробки.Ширина
		|			И ВТ2.ВидПолимера = ВТ_СПризнакомОткрытойКоробки.ВидПолимера
		|			И ВТ2.ОбъектНоменклатуры <> ВТ_СПризнакомОткрытойКоробки.ОткрытаяКоробка
		|			И (НЕ ВТ2.ЭтоОстаток)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоОткрытаяКоробка УБЫВ,
		|	ДругаяОткрытаяКоробка,
		|	ОбъектНоменклатуры";

КонецФункции
