
&Вместо("Установить")
Процедура Лико_Установить(ЦеноваяГруппа, Знач Период, АвтоРасчет)

	
	Если Не ЗначениеЗаполнено(ЦеноваяГруппа) Тогда
		Возврат;
	КонецЕсли;
	
	
	Для каждого Организация Из ОрганизацииАвтоРасчета() Цикл

		Период = ?(Период=Неопределено,ТекущаяДата(),Период);


		Если АвтоРасчет = Установлен(Организация, ЦеноваяГруппа, Период) Тогда

			Продолжить;

		КонецЕсли;


		УстановитьПривилегированныйРежим(Истина);

		НаборЗаписей = РегистрыСведений.Лико_АвтоРасчетЦенЦГ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.ЦеноваяГруппа.Установить(ЦеноваяГруппа);
		НаборЗаписей.Отбор.Период.Установить(Период); 

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.ЦеноваяГруппа = ЦеноваяГруппа;
		НоваяЗапись.Период = Период;
		НоваяЗапись.АвтоРасчет = АвтоРасчет;

		НаборЗаписей.Записать(Истина);

	КонецЦикла;

КонецПроцедуры
