
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
НаборЗаписей = РегистрыСведений.Лико_ПодписанныеДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Документ);
		НаборЗаписей.Отбор.Правило.Установить(Правило);
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Документ=Документ;
		НоваяЗапись.Правило=Правило;
		НоваяЗапись.Подписан=Истина;
		НоваяЗапись.Комментарий=Комментарий;
		НоваяЗапись.ОтветственноеЛицо=ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.Дата=ТекущаяДата();
		НоваяЗапись.Комментарий=Комментарий;		
		НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Правило=Параметры.Правило;
	Документ=Параметры.Документ;

КонецПроцедуры
