&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.ОбъектыНазначения = Неопределено Тогда 
		Объект.Заказ = Параметры.ОбъектыНазначения[0];
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере()
	//МассивДокументов = Параметры.ОбъектыНазначения;
	ЭтотОбъектОбработка = РеквизитФормыВЗначение("Объект");

   // ТабДок =ЭтотОбъектОбработка.Печать(МассивДокументов);
   ТабДок =ЭтотОбъектОбработка.ПечатьПриложениеВБЗ();
   
    Возврат ТабДок;	
КонецФункции
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.НомерБланка = 1;
	Объект.НомерПриложения= 1;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок =ПечатьНаСервере();
	ТабДок.Показать();

	Если Не Объект.НеЗакрыватьФорму Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СразуНаПринтер(Команда)	
	ТабДок =ПечатьНаСервере();
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ЭкземпляровНаСтранице=1;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	ТабДок.Напечатать(Истина);
	Если Не Объект.НеЗакрыватьФорму Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры



