#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ПризнакПредметаРасчета Из Перечисления.ПризнакиПредметаРасчета Цикл 
		Если ПризнакПредметаРасчета <> Перечисления.ПризнакиПредметаРасчета.КурортныйСбор Тогда
			ДанныеВыбора.Добавить(ПризнакПредметаРасчета);
		КонецЕсли;
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти