

&Вместо("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиСправочника(
		ЭтотОбъект,
		Перечисления.СтатусыСоглашенийСКлиентами.НеСогласовано);
	
	Если Типовое Тогда
		Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		Партнер    = Справочники.Партнеры.ПустаяСсылка();
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		СегментПартнеров = Справочники.СегментыПартнеров.ПустаяСсылка();
	КонецЕсли;
	
	НастройкиПродажДляПользователейСервер.ОчиститьНеиспользуемыеПравилаПродаж(ЭтотОбъект);
	
	Если ИспользуютсяДоговорыКонтрагентов Тогда
		ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПустаяСсылка();
	КонецЕсли;
	
	ЗаполнитьВариантРасчетаЦен();
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
		ВозвращатьМногооборотнуюТару = Ложь;
		ТребуетсяЗалогЗаТару = Ложь;
	КонецЕсли;	
	
	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	Справочники.СоглашенияСКлиентами.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ХозяйственнаяОперация,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
		ЭтотОбъект,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	Если СценарийПланирования.Пустая()
		И НЕ ВидПлана.Пустая() Тогда
		ВидПлана = Справочники.ВидыПланов.ПустаяСсылка();
	КонецЕсли;
	
	ЗаполнитьСлужебныеРеквизитыДляОграниченияДоступа();
	
	// --> Начало Лико Ефимов ЕВВ 19.02.2019
	Если НЕ Типовое Тогда
		Наименование = "";
		Если Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			НаименованиеВалюты = "RUB";
		ИначеЕсли НЕ ЗначениеЗаполнено(Валюта) Тогда
			НаименованиеВалюты = "Валюта не заполнена";
		Иначе
			НаименованиеВалюты = Валюта.Наименование;
		КонецЕсли;
		Наименование = НаименованиеВалюты;
		Если ЭтапыГрафикаОплаты.Количество() = 1 Тогда
			Строка = ЭтапыГрафикаОплаты[0];
			Если Строка.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения ИЛИ Строка.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки Тогда
				Наименование = Наименование + ", аванс (100%)";
			Иначе
				Наименование = Наименование + ", отсрочка " + Строка.Сдвиг + " дн.";
			КонецЕсли;
		ИначеЕсли ЭтапыГрафикаОплаты.Количество() = 0 Тогда
			Наименование = Наименование + ", этапы оплаты не заполнены";	
		Иначе
			СтрокиАванс = Новый Массив;
			СтрокиОтсрочка = Новый Массив;
			Для каждого Строка из ЭтапыГрафикаОплаты Цикл
				Если Строка.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения ИЛИ Строка.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки Тогда
					СтрокиАванс.Добавить(Строка);
				Иначе
					СтрокиОтсрочка.Добавить(Строка);
				КонецЕсли;
			КонецЦикла;
			Для каждого Строка из СтрокиАванс Цикл
				Наименование = Наименование + ", аванс (" + Строка.ПроцентПлатежа + "%)";
			КонецЦикла;
			Для каждого Строка из СтрокиОтсрочка Цикл
				Наименование = Наименование + ", отсрочка " + Строка.Сдвиг + " дн. (" + Строка.ПроцентПлатежа + "%)";
			КонецЦикла; 
						
		КонецЕсли; 
		Если ЗначениеЗаполнено(Лико_ПроцентФакторинга) Тогда 
			Наименование = Наименование + " Факторинг";
		КонецЕсли;

		
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ТЗЭтапыГрафикаОплатыДоСохранения = Ссылка.ЭтапыГрафикаОплаты.Выгрузить();
			ТЗЭтапыГрафикаОплатыСейчас = ЭтапыГрафикаОплаты.Выгрузить();
			ГрафикиОплатРазличаются = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТЗЭтапыГрафикаОплатыДоСохранения, ТЗЭтапыГрафикаОплатыСейчас, Истина);
			Если ГрафикиОплатРазличаются ИЛИ Валюта <> Ссылка.Валюта Тогда
				// Проверим, были ли реализации по данному соглашению
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					|ГДЕ
					|	РеализацияТоваровУслуг.Соглашение = &Соглашение
					|	И РеализацияТоваровУслуг.Проведен";
				Запрос.УстановитьПараметр("Соглашение", Ссылка);
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда
					// Реализаций не было
				Иначе
					Отказ = Истина;
					Сообщить("По данному соглашению уже были отгрузки, поэтому менять " + ?(ГрафикиОплатРазличаются, "этапы оплаты", "валюту") + " запрещено. Создайте новое соглашение");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	// <-- Конец Лико Ефимов ЕВВ 19.02.2019
	// --> Начало Лико Ефимов ЕВВ 13.11.2019
	Если Типовое И НЕ РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;
		Сообщить("У вас нет доступа к созданию/редактированию типовых соглашений");
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 13.11.2019
КонецПроцедуры



