#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДатаОтбораДляУдаления(Периодичность) Экспорт
	
	Дата = ТекущаяДатаСеанса();
	
	Если Периодичность = Через1День Тогда
		Дата = Дата - 24 * 60 * 60;
	ИначеЕсли Периодичность = Через1Неделю Тогда
		Дата = Дата - 24 * 60 * 60 * 7;
	ИначеЕсли Периодичность = Через1Месяц Тогда
		Дата = ДобавитьМесяц(Дата, -1);
	ИначеЕсли Периодичность = Через3Месяца Тогда
		Дата = ДобавитьМесяц(Дата, -3);
	ИначеЕсли Периодичность = Через6Месяцев Тогда
		Дата = ДобавитьМесяц(Дата, -6);
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

#КонецОбласти

#КонецЕсли