
&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	
	Если НЕ (Элемент.ТекущийЭлемент.Имя = "ДеревоВыбранныеСтроки" ИЛИ Элемент.ТекущийЭлемент.Имя = "ДеревоКоличество") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	ОбновитьДеревоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоНаСервере()
	
	Дерево.ПолучитьЭлементы().Очистить();
	
	Если ТипПодбора <> "ПоСпискуЗаказов" И НЕ ЗначениеЗаполнено(ОтборСклад) тогда
		Сообщить("Не заполнено поле ""Склад"".");
		Возврат;
	КонецЕсли;
	
	Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда
		СтрокаСортировки = "
		|Номенклатура,
		|Характеристика,
		|ЗаказКлиента";
	Иначе
		СтрокаСортировки = "
		|НомерЗаказа,
		|Номенклатура,
		|Характеристика";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ТипПодбора = "ПоСпискуЗаказов" Тогда
		Запрос.Текст = Документы.Лико_ЗаявкаНаОтгрузку.ПолучитьТекстЗапросаДляДереваЗаказы(СтрокаСортировки);
		// Последние полгода
		Запрос.УстановитьПараметр("Дата", ДатаНачалаЗаказов);
		Запрос.УстановитьПараметр("ОтборНеПоказыватьЗаказыВСостоянииСоздан", Элементы.НеПоказыватьЗаказыВСостоянииСоздан.Видимость И ОтборНеПоказыватьЗаказыВСостоянииСоздан);
		Элементы.ОтборСклад.Видимость = Ложь;
	Иначе
		Запрос.Текст = Документы.Лико_ЗаявкаНаОтгрузку.ПолучитьТекстЗапросаДляДереваОстатки(СтрокаСортировки, ОтборСклад.ИспользоватьАдресноеХранение);
		МассивСкладов = Новый Массив;
		Если ЗначениеЗаполнено(ОтборСклад) Тогда
			МассивСкладов.Добавить(ОтборСклад);
			Если ЗначениеЗаполнено(ДополнительныйСклад) Тогда
				МассивСкладов.Добавить(ДополнительныйСклад);
			КонецЕсли;
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады", МассивСкладов);
		Запрос.УстановитьПараметр("ОтборПоСкладуУстановлен", МассивСкладов.Количество() > 0);
		МассивЯчеек = Новый Массив;
		Для каждого ТекСклад из МассивСкладов Цикл 
			МассивЯчеек.Добавить(Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТекСклад, "ЯчейкаРастарка", Справочники.СкладскиеЯчейки.ПустаяСсылка()));
			Если НЕ Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТекСклад, "ПодбиратьОстаткиИзЯчейкиУпаковки_ea01b5f3f4a1470cbcb8a690e7aaf194", Ложь) Тогда
				МассивЯчеек.Добавить(Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТекСклад, "ЯчейкаУпаковка", Справочники.СкладскиеЯчейки.ПустаяСсылка()));
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ЯчейкаРастарка", МассивЯчеек);
		Запрос.УстановитьПараметр("ОтборПоЗаказам", Ложь);
		Запрос.УстановитьПараметр("МассивЗаказов", Неопределено);
		Элементы.ДатаНачалаЗаказов.Видимость = Ложь;
		Элементы.НеПоказыватьЗаказыВСостоянииСоздан.Видимость = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Партнер", ?(ЗначениеЗаполнено(ОтборПартнер), ОтборПартнер, Неопределено));
	Запрос.УстановитьПараметр("Менеджер", ?(ЗначениеЗаполнено(ОтборМенеджер), ОтборМенеджер, Неопределено));
	
	РезЗапроса = Запрос.Выполнить();
	
	Выборка = РезЗапроса.Выбрать();
	
	Если Выборка <> Неопределено Тогда
		
		ТекРодитель = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда
				Если ТекРодитель <> Выборка.Номенклатура Тогда
					ТекРодитель	= Выборка.Номенклатура;
					ТекСтрокаРодитель = ДобавитьСтрокуРодителя(Выборка); 				 
				КонецЕсли;
			Иначе
				Если ТекРодитель <> Выборка.ЗаказКлиента Тогда
					ТекРодитель	= Выборка.ЗаказКлиента;
					ТекСтрокаРодитель = ДобавитьСтрокуРодителя(Выборка); 				 
				КонецЕсли;
			КонецЕсли;
			ДобавитьСтрокуПодчиненную(ТекСтрокаРодитель, Выборка);
			
		КонецЦикла;
		
		//Дерево.ПолучитьЭлементы().Сортировать("Наименование");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуРодителя(Строкаданных)

	СтрокаДерева = Дерево.ПолучитьЭлементы().Добавить();
	Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда
		СтрокаДерева.Наименование = Строкаданных.ПредставлениеНоменклатуры;
	Иначе
		СтрокаДерева.Наименование = Строкаданных.НомерЗаказа;
		СтрокаДерева.Контрагент = Строкаданных.Контрагент;
	КонецЕсли;
	
	//СтрокаДерева.Город = Строкаданных.Город;
	//СтрокаДерева.Намотка = Строкаданных.Намотка;
		
	Возврат СтрокаДерева;
	
КонецФункции

&НаСервере
Функция ДобавитьСтрокуПодчиненную(СтрокаРодитель,Строкаданных)

   	СтрокаДерева = СтрокаРодитель.ПолучитьЭлементы().Добавить();
	
	Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда	
		СтрокаДерева.Наименование  = Строкаданных.НомерЗаказа;
	Иначе
		СтрокаДерева.Наименование = Строкаданных.ПредставлениеНоменклатуры;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаДерева, Строкаданных);
	СтрокаРодитель.Количество	   = СтрокаРодитель.Количество+Строкаданных.Количество;

	Возврат СтрокаДерева;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Склад", ОтборСклад); 
	Параметры.Свойство("Дата", Дата);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Сообщить("Необходимо заполнить дату отгрузки");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Параметры.Свойство("Документ", Документ); 
	Параметры.Свойство("Партнер", ОтборПартнер); 
	Параметры.Свойство("Менеджер", ОтборМенеджер);
	Параметры.Свойство("ТипОтгрузки", ТипОтгрузки);
	ТипПодбора = Параметры.ТипПодбора;
	Если ТипПодбора = "ПоСпискуЗаказов" Тогда
		ЭтаФорма.Заголовок = "Подбор по списку заказов";
		ДатаНачалаЗаказов = ДобавитьМесяц(ТекущаяДата(), -3);
	Иначе
		ЭтаФорма.Заголовок = "Подбор по остаткам";
	КонецЕсли;
	
	ЗаполнитьДопСклад();
		
	ОбновитьДеревоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопСклад()
	
	Элементы.ДополнительныйСклад.Видимость = Ложь;
	ДополнительныйСклад = Неопределено;
	Если ЗначениеЗаполнено(ОтборСклад) И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки Тогда
		СвязанныйСкладОтвХранения = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ОтборСклад, "СвязанныйСкладОтвХранения_3c139bc2b738468bb14bc188eb15a0d0");
		Если ЗначениеЗаполнено(СвязанныйСкладОтвХранения) Тогда
			ДополнительныйСклад = СвязанныйСкладОтвХранения;
			Сообщить("Добавлены остатки по складу """ + ДополнительныйСклад + """");
			Элементы.ДополнительныйСклад.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриИзменении(Элемент)
	
	//Изменяется в дереве только колонка ВыбранныеСтроки 
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоВыбранныеСтроки" Тогда
		Для каждого СтрокаДерева из Элемент.ТекущиеДанные.ПолучитьЭлементы() Цикл
			СтрокаДерева.ВыбранныеСтроки = Элемент.ТекущиеДанные.ВыбранныеСтроки;
			ТекПорядок = ТекПорядок + 1;
			СтрокаДерева.Порядок = ТекПорядок;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ТаблицаДляПереноса.Очистить();
	Для каждого Строка из Дерево.ПолучитьЭлементы() Цикл
		Для каждого ПодчиненнаяСтрока из Строка.ПолучитьЭлементы() Цикл
			Если ПодчиненнаяСтрока.ВыбранныеСтроки Тогда
				НоваяСтрока = ТаблицаДляПереноса.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодчиненнаяСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ТаблицаДляПереноса.Сортировать("Порядок");
	ЭтаФорма.Закрыть(ТаблицаДляПереноса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	Если Элемент.Имя = "ОтборСклад" Тогда
		ЗаполнитьДопСклад();
	КонецЕсли;
	
	ОбновитьДеревоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискВДереве(Команда)
	
	Если ЭтаФорма.ВводДоступен() Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ДеревоНаименование;
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("^{f}");
		WSHShell.SendKeys("^{а}");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
   СвернутьРекурсия(Дерево.ПолучитьЭлементы()); 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРекурсия(тЭлементы)
   Для Каждого тСтр Из тЭлементы Цикл
      СвернутьРекурсия(тСтр.ПолучитьЭлементы());
      Элементы.Дерево.Свернуть(тСтр.ПолучитьИдентификатор());
   КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
	Для Каждого тСтр Из Дерево.ПолучитьЭлементы() Цикл
		Элементы.Дерево.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметитьВсе(Команда)
	Отметка = Команда.Имя = "ОтметитьВсе";
	Для каждого Строка из Дерево.ПолучитьЭлементы() Цикл
		Строка.ВыбранныеСтроки = Отметка;
		Для каждого ПодСтрока из Строка.ПолучитьЭлементы() Цикл
			ПодСтрока.ВыбранныеСтроки = Отметка;
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйСкладПриИзменении(Элемент)
	
	ОбновитьДеревоНаСервере();
	
КонецПроцедуры
