
&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для каждого Строка из ТаблицаКоробок Цикл
		Строка.Отметка = Истина;
	КОнецЦикла;
	ПересчитататьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтметки(Команда)
	Для каждого Строка из ТаблицаКоробок Цикл
		Строка.Отметка = Ложь;
	КОнецЦикла;
	ПересчитататьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитататьКоличество()
	КоличествоПодобрано = 0;
	Для каждого Строка из ТаблицаКоробок Цикл
		Если Строка.Отметка Тогда
			КоличествоПодобрано = КоличествоПодобрано + Строка.Количество;
		КонецЕсли;
	КонецЦикла;
	КоличествоОсталось = КоличествоЗатребовано - КоличествоПодобрано;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоробокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоробокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоробокПриИзменении(Элемент)
	ПересчитататьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	МассивСтрок = Новый Массив;
	Для каждого Строка из ТаблицаКоробок Цикл
		Если Строка.Отметка Тогда
			Структура = Новый Структура("Серия,Паллет,Ячейка,Количество");
			ЗаполнитьЗначенияСвойств(Структура, Строка);
			МассивСтрок.Добавить(Структура);
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Закрыть(МассивСтрок);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеТипаТЗ = Новый ОписаниеТипов("ТаблицаЗначений");
	ТаблицаКоробокКопия = ТаблицаКоробок.Выгрузить();
	МассивДобавляемыхРеквизитов = Новый Массив;
	ИмяТаблицы = "ТаблицаКоробокВсеОстатки";
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, ОписаниеТипаТЗ));
	Для каждого Колонка из ТаблицаКоробокКопия.Колонки Цикл
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТаблицы));
	КонецЦикла;
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.СтруктураПодбора);
	КоличествоЗатребовано = Параметры.СтруктураПодбора.Количество;
	Для каждого Структура из Параметры.ТаблицаКоробок Цикл
		НоваяСтрока = ЭтаФорма[ИмяТаблицы].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Структура);
		НоваяСтрока.Количество = Структура.КоличествоВУпаковке;
		НоваяСтрока.НомерКоробки = НоваяСтрока.Серия.Лико_НомерКоробки;
	КонецЦикла;
	
	ОтборПоГороду = Истина;
	ОтборПоКодуЭтикеткиЗаказчика = Истина;
	ОтборПоНамотке = Истина;
	ОтборПоНомеруПоставки = Истина;
	ОтборПоЧестномуЗнаку = Истина;
	
	Если Параметры.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения Тогда
		Элементы.ТаблицаКоробокКонтрагент.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоГородуПриИзменении(Элемент)
	УстановитьФильтры();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтры()
	
	ТаблицаКоробок.Очистить();
	
	ОтборСтруктура = Новый Структура;
	Если ОтборПоГороду Тогда
		ОтборСтруктура.Вставить("Город", Город);
	КонецЕсли;
	Если ОтборПоКодуЭтикеткиЗаказчика Тогда
		ОтборСтруктура.Вставить("КодЭтикеткиЗаказчика", КодЭтикеткиЗаказчика);
	КонецЕсли;
	Если ОтборПоЧестномуЗнаку Тогда
		ОтборСтруктура.Вставить("ЧестныйЗнак", ЧестныйЗнак);
	КонецЕсли;
	Если ОтборПоНамотке Тогда
		ОтборСтруктура.Вставить("Намотка", Намотка);
	КонецЕсли;
	Если ОтборПоНомеруПоставки Тогда
		ОтборСтруктура.Вставить("НомерПоставки", НомерПоставки);
	КонецЕсли;
	
	МассивНужныхСтрок = ЭтаФорма["ТаблицаКоробокВсеОстатки"].НайтиСтроки(ОтборСтруктура);
	Для каждого Строка из МассивНужныхСтрок Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаКоробок.Добавить(), Строка);
	КонецЦикла;
	
	ТаблицаКоробок.Сортировать("Количество УБЫВ,НомерКоробки");
	ПересчитататьКоличество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКодуЭтикеткиЗаказчикаПриИзменении(Элемент)
	УстановитьФильтры();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНамоткеПриИзменении(Элемент)
	УстановитьФильтры();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНомеруПоставкиПриИзменении(Элемент)
	УстановитьФильтры();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьФильтры();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЧестномуЗнакуПриИзменении(Элемент)
	УстановитьФильтры();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВесьПаллет(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаКоробок.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Для каждого Строка из ТаблицаКоробок Цикл
			Если Строка.Паллет = ТекущаяСтрока.Паллет Тогда
				Строка.Отметка = Истина;
			КонецЕсли;
		КонецЦикла;
		ПересчитататьКоличество();
	КонецЕсли;
	
КонецПроцедуры
