#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс 

Процедура Проведение(ДокументОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументОбъект.Движения.Лико_ВыпускГППоБланкуОбороты.Записывать = Истина;
	Движения = Неопределено;
	ПолучитьДвиженияПоДокументу(ДокументОбъект.Ссылка, Движения);
	
	Если Движения = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	ПроверкаНаОшибки(Движения, ДокументОбъект);
	
	ДокументОбъект.Движения.Лико_ВыпускГППоБланкуОбороты.Загрузить(Движения);
	
КонецПроцедуры 


Процедура СформироватьДвижения(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыНакопления.Лико_ВыпускГППоБланкуОбороты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Движения = Новый ТаблицаЗначений;
	ПолучитьДвиженияПоДокументу(ДокументСсылка, Движения);
	
	ПроверкаНаОшибки(Движения, ДокументСсылка);

	
	НаборЗаписей.Загрузить(Движения);
	
	НаборЗаписей.Записать(Истина); 	
	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Процедура ПолучитьДвиженияПоДокументу(Ссылка, Движения)
	
	ПолучитьДвиженияПоДокументуЛико_БланкЭтапа(Ссылка, Движения);
		
КонецПроцедуры 


Процедура ПолучитьДвиженияПоДокументуЛико_БланкЭтапа(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.Лико_БланкЭтапа") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка.СтатусВыпуска) Тогда
		Возврат;
	КонецЕсли;

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_БланкЭтапаТовары.КоличествоШт КАК КоличествоУпаковано,
	|	NULL КАК КоличествоПеремотано
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Ссылка.СтатусВыпуска = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыВыпуска.Упаковка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_БланкЭтапаВыпуск.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_БланкЭтапаВыпуск.Серия,
	|	Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры,
	|	NULL,
	|	Лико_БланкЭтапаВыпуск.КоличествоШт
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаВыпуск.Ссылка.СтатусВыпуска = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыВыпуска.Перемотка)";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 

	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 




Процедура ПроверкаНаОшибки(Движения, Документ)
	
	Если Движения = Неопределено Тогда
		
		//ВызватьИсключение(СтрШаблон("Документ: %1 не может отражать движения по регистру накопления: ""лк Выпуск ГППо бланку""!",Документ)) ;
		
	КонецЕсли;
	
 КонецПроцедуры
 
 

#КонецОбласти

#КонецЕсли