
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоОтветственныйЗаРекламации =  ?(ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(Пользователи.ТекущийПользователь(), ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Ответственный за рекламации"))), Истина, Ложь);

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Состояние = Перечисления.Лико_СостоянияНесоответствийЗаказу.ВРаботе;
		Объект.СотрудникОбнаружившийБрак = Лико_Планирование.НайтиСотрудникаПоПользователю(Пользователи.ТекущийПользователь());	
		
		Если  ЭтоОтветственныйЗаРекламации Тогда 
			Объект.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента;
		Иначе 
			Если РольДоступна("Лико_ЗаказыКлиентов") ТОгда 
				Объект.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.Прочее;
			КонецЕсли;
		КонецЕсли;
		Объект.Ответственный = ПОльзователи.ТекущийПользователь();

	КонецЕсли;
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ЗначениеЗаполнено(Объект.Файлы) Тогда 
		Файлы = "Добавьте каталог";
	Иначе
		Файлы = Объект.Файлы;
		
	КонецЕсли;
	Если Объект.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.Прочее Тогда 
		 УстановитьВидимостьЭлементов(Ложь);
	ИначеЕсли  Объект.видоперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента Тогда 
		Если Не (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_НесоответстветствующаяПродукция"))  Тогда 
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;		
    КонецЕсли;	
 	ОбновитьВидимостьЭлементовДляИксПака();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементовДляИксПака()
	
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак И Объект.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента Тогда
		Элементы.ВидПретензии.Видимость = Истина;
		Элементы.ТоварыКатегорияПретензии.Видимость = Истина;
	Иначе 
		Элементы.ВидПретензии.Видимость = Ложь;
		Элементы.ТоварыКатегорияПретензии.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументОтгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	текстр = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.ЗаказКлиента) Тогда
		СтандартнаяОбработка = Ложь;
		ДопПараметры = Новый Структура("Заказ", текстр.ЗаказКлиента);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПОслеВыбораОтгрузки", ЭтаФорма);
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаВыбораДокументаОтгрузки", ДопПараметры, ЭтаФорма, ,,,ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура  ПОслеВыбораОтгрузки(Результат, Параметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		стр = Элементы.ТОвары.текущиеданные;
		стр.документотгрузки = результат;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция РассчитатьМетраж(Тираж, Заказ)
	Если ЗначениеЗаполнено(Заказ.ШтКВМ) Тогда 
		Возврат Тираж*1000/ Заказ.ШтКВМ;
	Иначе 
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоЗабракованныхПриИзменении(Элемент)
	текстр = элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.ЗаказКлиента) Тогда
		текстр.МетражКВЗабракованных =  РассчитатьМетраж(текстр.КоличествоЗабракованных, текстр.ЗаказКлиента);
	КонецЕсли;	

КонецПроцедуры


&НаСервере
Процедура ТоварыЗаказКлиентаПриИзмененииНаСервере(Идентификатор, заказ)
	
	Объект.Партнер = Заказ.Партнер;
	Объект.Менеджер = Заказ.Менеджер;
	Объект.Организация = Заказ.Организация;
	Объект.Площадка = Заказ.Площадка;
	текстр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	текстр.ЗаказКлиента = Заказ;
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокументОбъект.ЗаполнитьСтрокуПоЗаказу(текстр); 
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЗаказКлиентаПриИзменении(Элемент)
	текстр = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.ЗаказКлиента) ТОгда 
		ТоварыЗаказКлиентаПриИзмененииНаСервере(текстр.ПолучитьИдентификатор() , текстр.ЗаказКлиента);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	текстр = Элементы.ТОвары.ТекущиеДанные;
	Если НоваяСтрока Тогда
		КлючСтроки = Новый УникальныйИдентификатор;
		текстр.КлючСтроки = КлючСтроки;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Ключстроки = Элементы.Товары.ТекущиеДанные.КлючСтроки;
	МассивСтрок =Объект.Сотрудники.НайтиСтроки(Новый Структура("КлючСтроки",  КлючСтроки));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект.Сотрудники.Удалить(ЭлементМассива);
	КонецЦикла;	

КонецПроцедуры




&НаКлиенте
Процедура СотрудникиКоличествоПриИзменении(Элемент)
	стр = Элементы.Товары.текущиеДанные;
	Если ЗначениеЗаполнено(Стр.ЗаказКлиента) Тогда 
		текстр = элементы.Сотрудники.ТекущиеДанные;
		текстр.МетражКВМ =  РассчитатьМетраж(текстр.Количество, стр.ЗаказКлиента)
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	стр = Элементы.ТОвары.ТекущиеДанные;
	Если стр<>Неопределено Тогда 
		КлючСтроки =стр.КлючСтроки;
		Элементы.Сотрудники.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", КлючСтроки); 
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	текстр = Элементы.Товары.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		Элемент.ТекущиеДанные.КлючСтроки = текстр.ключстроки;
		Элементы.Сотрудники.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", текстр.ключстроки); 
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура  УстановитьВидимостьЭлементов(Видимость)
		Элементы.Сотрудники.видимость 				= Видимость;
		Элементы.ТоварыНомерБланка.Видимость 		= Видимость;
		Элементы.ТоварыНомерПриложения.Видимость 	= Видимость;
		Элементы.ТоварыДефект.Видимость 			= Видимость;
		Элементы.ТоварыДатаЗапроса.Видимость 		= Видимость;
		Элементы.ТоварыСутьЗапроса.Видимость 		= Видимость;
		Элементы.ТоварыДатаОтвета.Видимость 		= Видимость;
		Элементы.ТоварыРешение.Видимость 			= Видимость;
		Элементы.ТоварыСработаноЗаказчиком.Видимость 			= Видимость;
		Элементы.ТоварыУтилизированоЗаказчиком.Видимость 		= Видимость;
		Элементы.ТоварыУтилизированоНаПредприятии.Видимость 	= Видимость;
		Элементы.ТоварыУпакованоБезИсправления.Видимость 		= Видимость;
		Элементы.ТоварыУпакованоПослеИсправления.Видимость 		= Видимость;
		Элементы.ТоварыПричинаВозникновения.Видимость 			= Видимость;
		Элементы.ТоварыНомерАктаБухгалтерии.Видимость 			= Видимость;
		Элементы.ТоварыКоррекция.Видимость 						= Видимость;
		Элементы.ТоварыКорректирующиеДействия.Видимость 		= Видимость;
		Элементы.ЗаполнитьКД.Видимость 							= Видимость;
		Элементы.ЗаполнитьКД.Видимость 							= Видимость;
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента") Тогда
			Элементы.ВидПретензии.Видимость 					= Истина
		Иначе
			Элементы.ВидПретензии.Видимость 					= Ложь;			
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если  Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийНесоответствияЗаказу.Прочее") Тогда 
		УстановитьВидимостьЭлементов(Ложь);
	Иначе 
		УстановитьВидимостьЭлементов(Истина);
	КонецЕсли;
	ОбновитьВидимостьЭлементовДляИксПака();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЭлементы(Команда)
	УстановитьВидимостьЭлементов(Истина) ;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборКаталога(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда 
		Возврат
	КонецЕсли;
	Файлы = ВыбранноеИмяФайла;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не Файлы<>"Добавьте каталог" Тогда 
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
		ДиалогВыбораФайла.ПолноеИмяФайла = "";
		ДиалогВыбораФайла.Фильтр = "(*.*)|*.*";
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
		ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	
		Если ДиалогВыбораФайла.Выбрать() Тогда
			Файлы = ДиалогВыбораФайла.Каталог;
		КонецЕсли;

		
	Иначе
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.Run("Explorer "+Файлы);

	КонецЕсли;

КонецПроцедуры

Процедура ОповещениеОткрытие(Результат, ДополнительныеПараметры)
	
КонецПроцедуры

Процедура ОткрытьНаСервере()
	WshShell = Новый COMОбъект("WScript.Shell");
	WshShell.Run("Explorer "+Файлы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Файлы<>"Добавьте каталог" Тогда 
		Объект.Файлы =  Файлы;
	Иначе
		Объект.Файлы = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПутьКФайлам(Команда)
	Файлы = "Добавьте каталог";
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	текстр = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.заказклиента) Тогда 
		СтандартнаяОбработка = Ложь;
		СписокЭтикеток = ПолучитьСписокЭтикетокНаСервере(текстр.заказклиента); 		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЭтикеткаВыборИзСпискаЗавершение", ЭтотОбъект); 		
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокЭтикеток, Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЭтикетокНаСервере(Заказ)
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	ТЗ = Запрос.Выполнить().Выгрузить();
	СП = Новый СписокЗначений;
	СП.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Номенклатура"));
	Возврат СП;
КонецФункции

&НаКлиенте
Процедура ЭтикеткаВыборИзСпискаЗавершение(Знач ВыбранныйЭлемент, Параметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		Текстр = Элементы.ТОвары.ТекущиеДанные;
		Текстр.Номенклатура = ВыбранныйЭлемент.Значение;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКД(Команда)
	Текстр = Элементы.ТОвары.ТекущиеДанные;
	Текстр.ПричинаВозникновения  = ПредопределенноеЗначение("Справочник.Лико_ПричинаНесоответствияЗаказу.ЧеловеческийФактор");
	Текстр.Коррекция =	"снижение премии за качество"; 
	Текстр.КорректирующиеДействия = "ознакомление с образцами брака";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМетражВСотрудниках(Команда)
	Текстр = Элементы.ТОвары.ТекущиеДанные;
	стр = Элементы.Сотрудники.ТекущиеДанные;
	Если стр<> Неопределено Тогда 
		стр.Количество = текстр.количествоЗабракованных;
		стр.МетражКВМ = Текстр.МетражКВЗабракованных;
		стр.Дефект = текстр.дефект;
		стр.СостояниеРешенияПоСотруднику = ПредопределенноеЗначение("Перечисление.Лико_СостоянияРешенийПоСотрудникамДопустившимБрак.ВРаботе")
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ДобавитьЗаказПереборкиНаСервере(Идентификатор, ВидПовтора)
	
	стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	ИсходныйЗаказ = стр.ЗаказКлиента;
	// <-- Начало Лико Яцун С. В. 15.06.2023 
	//НовыйЗаказ =ИсходныйЗаказ.скопировать();
	Если ВидПовтора = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка Тогда
		ОбъектИсходныйЗаказ = ИсходныйЗаказ.ПолучитьОбъект();
		ОбъектИсходныйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка;
		НовыйЗаказ = ОбъектИсходныйЗаказ.Скопировать();
	Иначе	
		НовыйЗаказ = ИсходныйЗаказ.Скопировать();
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 15.06.2023
	НовыйЗаказ.Версия = 0;
	НовыйЗаказ.ВидЗаказа =  ВидПовтора;
	//Если Регион<>Неопределено Тогда 
	//	НовыйЗаказ.Регион = Регион;
	//КонецЕсли;
	Если НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПричинаРекламация Тогда
		НовыйЗаказ.Номер = Лев(ИсходныйЗаказ.Номер, 6)+"7"+Прав(ИсходныйЗаказ.Номер, 4);
	ИначеЕсли НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка Тогда
		НовыйЗаказ.Номер = Лев(ИсходныйЗаказ.Номер, 6)+"8"+Прав(ИсходныйЗаказ.Номер, 4);
		НовыйЗаказ.Цвета.Очистить();
		НовыйЗаказ.ВидыРабот.Очистить();
		НовыйЗаказ.Формы.Очистить();
		стрработа = НовыйЗаказ.ВидыРабот.Добавить();
		стрработа.ВидРабот = Справочники.ВидыРаботСотрудников.Перемотка;
		стрработа.рабочийЦентр = Справочники.РабочиеЦентры.НайтиПоНаименованию("Перемотка", Истина);
		стрработа.номерпроката = 1;
		стрработа.номерварианта = 1;
		стрработа.ключстроки =  Новый УникальныйИдентификатор;
		// <-- Начало Лико Яцун С. В. 22.08.2023
		стрцветаработа = НовыйЗаказ.Цвета.Добавить();
		стрцветаработа.ВидСекции = Справочники.Лико_ВидыСекций.Перемотка;
		стрцветаработа.рабочийЦентр = Справочники.РабочиеЦентры.НайтиПоНаименованию("Перемотка", Истина);
		стрцветаработа.номерпроката = 1;
		стрцветаработа.номерварианта = 1;
		стрцветаработа.ключстроки =  Новый УникальныйИдентификатор;
		// <-- Конец Лико Яцун С. В. 22.08.2023
		// --> Начало Лико Митюшин МФМ 05.08.2021
		НовыйЗаказ.ШтампВырубной = Справочники.Номенклатура.ПустаяСсылка();
		Если ЗначениеЗаполнено(ИсходныйЗаказ.ДлинаПечати) И ЗначениеЗаполнено(ИсходныйЗаказ.ЭтикетокНаЛистеПечати) Тогда 
			НовыйЗаказ.ДлинаПечати 				= ИсходныйЗаказ.ДлинаПечати;
			НовыйЗаказ.ЭтикетокНаЛистеПечати 	= ИсходныйЗаказ.ЭтикетокНаЛистеПечати;
		ИначеЕсли ЗначениеЗаполнено(ИсходныйЗаказ.ШагПечати) И ЗначениеЗаполнено(ИсходныйЗаказ.ЭтикетокНаЛисте) Тогда
			НовыйЗаказ.ДлинаПечати 				= ИсходныйЗаказ.ШагПечати;
			НовыйЗаказ.ЭтикетокНаЛистеПечати 	= ИсходныйЗаказ.ЭтикетокНаЛисте;
		ИначеЕсли ЗначениеЗаполнено(ИсходныйЗаказ.ДлинаПечатиИндиго) И ЗначениеЗаполнено(ИсходныйЗаказ.ЭтикетокНаЛистеИндиго) Тогда
			НовыйЗаказ.ДлинаПечати 				= ИсходныйЗаказ.ДлинаПечатиИндиго;
			НовыйЗаказ.ЭтикетокНаЛистеПечати 	= ИсходныйЗаказ.ЭтикетокНаЛистеИндиго;
		КонецЕсли;	
		// <-- Конец Лико Митюшин МФМ 05.08.2021
	КонецЕсли;	
	//Проверим наличие заказа с указанным номером
	// --> Начало Лико Ефимов ЕВВ 18.03.2020
	//Если Документы.ЗаказКлиента.НайтиПоНомеру(НовыйЗаказ.Номер)<>Документы.ЗаказКлиента.ПустаяСсылка() Тогда 
	//	НовыйЗаказ.Номер = "";
	//КонецЕсли;
	Если ЗначениеЗаполнено(Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса", Прав(НовыйЗаказ.Номер, Метаданные.Документы.ЗаказКлиента.Реквизиты.НомерБезПрефикса.Тип.КвалификаторыСтроки.Длина))) Тогда
		// Документ с таким номером уже есть, присвоим просто следующий номер, без префикса переборки/перепечатки (согласованно с Анной 20200318)
		НовыйЗаказ.Номер = Лико_Планирование.ПолучитьНомерДляЗаказа(ИсходныйЗаказ.Организация, ИсходныйЗаказ.ТипЗаказа, ИсходныйЗаказ.ВидЗаказа, ИсходныйЗаказ.Регион);
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 18.03.2020
	
	
	НовыйЗаказ.Менеджер = ИсходныйЗаказ.Менеджер;
	НовыйЗаказ.ИсходныйЗаказ = ИсходныйЗаказ.Ссылка;

	НовыйЗаказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	НовыйЗаказ.способдоставки = Перечисления.СпособыДоставки.Самовывоз;
	Если Не ЗначениеЗаполнено(НовыйЗаказ.НалогообложениеНДС) Тогда 
		НовыйЗаказ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	КонецЕсли;	
	НовыйЗаказ.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
	НовыйЗаказ.ЦенаВключаетНДС = Истина;
	//Если Не ЗначениеЗаполнено(НовыйЗаказ.ПорядокОплаты) Тогда 
	//	НовыйЗаказ.ПорядокОплаты =  Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях;
	//КонецЕсли;
	Если   НовыйЗаказ.Соглашение.Типовое Тогда 
	    НовыйЗаказ.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
	КонецЕсли;

	НовыйЗаказ.ДатаУтвержденияЦветов = '0001.01.01';
	НовыйЗаказ.УтвердилЦвета = Справочники.Пользователи.ПустаяСсылка();	
	НовыйЗаказ.ДатаУтвержденияРабот = '0001.01.01';
	НовыйЗаказ.УтвердилРаботы = Справочники.Пользователи.ПустаяСсылка();	

	НовыйЗаказ.Дата = ТекущаяДата();
	НовыйЗаказ.Валюта = Справочники.Валюты.НайтиПоКоду("978");
	НовыйЗаказ.Ответственный = ПОльзователи.ТекущийПользователь();
	НовыйЗаказ.Заблокирован = Ложь;
	НовыйЗаказ.ДатаОтправкиВРаботу = '0001.01.01';
	НовыйЗаказ.ДатаЗакрытия =  '0001.01.01';
	НовыйЗаказ.Состояние = Перечисления.Лико_СостоянияЗаказов.Создан;
	НовыйЗаказ.СрочноеЦветоделение = ЛОжь;
	НовыйЗаказ.КоличествоРоликов = 0;
	НовыйЗаказ.КоличествоКоробок = 0;
	НовыйЗаказ.ОписаниеИзменений = "";
	НовыйЗаказ.ОсновнойМатериалФакт = Справочники.ЦеновыеГруппы.ПустаяСсылка();
	НовыйЗаказ.НарезкаФакт = Справочники.ЯССМ_Нарезки.ПустаяСсылка();
	Для каждого стр из НовыйЗаказ.ВидыРабот Цикл
		стр.материалфакт = Справочники.ЦеновыеГруппы.ПустаяСсылка();
		//стр.клейфакт = Справочники.ЦеновыеГруппы.ПустаяСсылка();
	КонецЦикла;
	Для каждого стр из НовыйЗаказ.Цвета Цикл
		стр.Цветоделение = ЛОжь;
		стр.Перегравировка = Ложь;
	КонецЦикла;	
	НовыйЗаказ.КоличествоПоУпаковке = 0;
	НовыйЗаказ.КомментарийОУ = "";
	НовыйЗаказ.ОтветственныйОУ = Справочники.Пользователи.ПустаяСсылка();
	НовыйЗаказ.ПечатьВПрисутствииТехнолога = Ложь;

	НовыйЗаказ.Цветоделение.Очистить();
	НовыйЗаказ.Отгрузки.Очистить();
	НовыйЗаказ.Нормативы.Очистить();
	НовыйЗаказ.КартаПерерасхода.Очистить();
	НовыйЗаказ.КартаСнятия.Очистить();
	НовыйЗаказ.Перемотка.Очистить();
	НовыйЗаказ.ИзготовлениеФорм.Очистить();
	Если НовыйЗаказ.Товары.Количество()>0 Тогда 
		Для каждого стр из НовыйЗаказ.Товары Цикл
			стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
			// --> Начало Лико Митюшин МФМ 05.08.2021
			Если НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка Тогда
				стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				стр.Цена = 0;
				стр.сумма = 0;
				стр.суммаСНДС = 0;
				стр.СуммаНДС = 0;
				Стр.ЦенаДляДокументов = 0;
			Иначе
			// <-- Конец Лико Митюшин МФМ 05.08.2021
				СтавкаЧислом = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(стр.СтавкаНДС);
				Если СтавкаЧислом= 18 Тогда 
					стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
					стр.Цена = (стр.цена/1.18)*1.20;
					стр.сумма = стр.количество*стр.цена;
					стр.суммаСНДС = стр.сумма;
					стр.СуммаНДС = стр.сумма*СтавкаЧислом/(100+СтавкаЧислом);
					Если НовыйЗаказ.ЦенаДляДокументовВключаетНДС Тогда 
						Стр.ЦенаДляДокументов = (Стр.ЦенаДляДокументов/1.18)*1.20;
					КонецЕсли;	
				КонецЕсли;
			// <-- Начало Лико Митюшин МФМ 05.08.2021
			КонецЕсли;
			// <-- Конец Лико Митюшин МФМ 05.08.2021
		КонецЦикла;
		НовыйЗаказ.СуммаДокумента = НовыйЗаказ.Товары.Итог("СуммаСНДС")+НовыйЗаказ.СтоимостьОснастки;
	КонецЕсли;
	Если НовыйЗаказ.Цвета.Количество()>0 Тогда 
		Для каждого стр из НовыйЗаказ.Цвета Цикл
			стр.Цветоделение = Ложь;
			стр.Перегравировка = Ложь;
		КонецЦикла;
	КонецЕсли;
	НовыйЗаказ.ДатаОтгрузки = ТекущаяДата()+604800;
	НовыйЗаказ.ЖелаемаяДатаОтгрузки = ТекущаяДата()+604800;	
	НовыйЗаказ.Записать();
	НовыйЗаказ.ВидВырубки = Лико_ТиражМетраж.ПолучитьВидВырубки(НовыйЗаказ.ссылка);
	НовыйЗаказ.НомерБезПрефикса = Прав(НовыйЗаказ.Номер,7);
	НовыйЗаказ.Записать();
	Возврат НовыйЗаказ.ссылка;
	
КонецФункции



&НаКлиенте
Процедура ДобавитьЗаказПереборки(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	Если текстр <> Неопределено Тогда 
		текстр.ЗаказПереборки =ДобавитьЗаказПереборкиНаСервере(ТекСтр.ПолучитьИдентификатор(), ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка"));
		// --> Начало Лико Ефимов ЕВВ 13.09.2021
		Записать();
		// <-- Конец Лико Ефимов ЕВВ 13.09.2021
		ПараметрыФормы    = новый Структура("Ключ", текстр.ЗаказПереборки);
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаказПерепечатки(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	Если текстр <> Неопределено Тогда 
		текстр.ЗаказПерепечатки =ДобавитьЗаказПереборкиНаСервере(ТекСтр.ПолучитьИдентификатор(), ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПричинаРекламация"));
		// --> Начало Лико Ефимов ЕВВ 13.09.2021
		Записать();
		// <-- Конец Лико Ефимов ЕВВ 13.09.2021
		ПараметрыФормы    = новый Структура("Ключ", текстр.ЗаказПерепечатки);
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);	
	КонецЕсли;	

КонецПроцедуры

&НаСервере  
Функция НайтиДолжностьСотрудника(Сотрудник, дата) 
	Возврат Лико_Планирование.НайтиДолжностьСотрудника(Сотрудник, дата) ;
КонецФункции

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	текстр = Элементы.Сотрудники.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.сотрудник) Тогда 
		стртовары = Элементы.ТОвары.ТекущиеДанные;
		Если ЗначениеЗаполнено(стртовары.датаработы) Тогда 
			текстр.Должность = НайтиДолжностьСотрудника(текстр.Сотрудник,стртовары.датаработы );
		Иначе
			текстр.Должность = НайтиДолжностьСотрудника(текстр.Сотрудник,объект.дата );
		КонецЕсли;	

		текстр.Дата = НайтиДатуРаботы(текстр.Сотрудник, стртовары.заказклиента);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция НайтиДатуРаботы(Сотрудник, заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказКлиентаПроизводство.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ЗаказКлиента.Производство КАК ЗаказКлиентаПроизводство
	|ГДЕ
	|	ЗаказКлиентаПроизводство.Ссылка = &Заказ
	|	И ЗаказКлиентаПроизводство.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказКлиентаПеремотка.Дата)
	|ИЗ
	|	Документ.ЗаказКлиента.Перемотка КАК ЗаказКлиентаПеремотка
	|ГДЕ
	|	ЗаказКлиентаПеремотка.Ссылка = &Заказ
	|	И ЗаказКлиентаПеремотка.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ.Дата) КАК Дата
	|ИЗ
	|	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Возврат Результат.Дата;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_Лико_НесоответствующаяПродукция", Неопределено, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция ПечатьНППоСотрудникуНаСервере(номерстрокизаказа, номерстрокисотрудника)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатная форма ""Расследование причин дефекта""");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ВПФ);
	ВнешняяОбработкаОбъект.НомерСтрокиЗаказа = НомерСтрокиЗаказа;
	ВнешняяОбработкаОбъект.НомерСтрокиСотрудника = НомерСтрокиСотрудника;
	Массив = Новый Массив();
	Массив.Добавить(Объект.Ссылка);
	
	ТабДокумент = ВнешняяОбработкаОбъект.ПечатьРасследованиеПричинДефекта(Массив);
	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура ПечатьНППоСотруднику(Команда)
	текстр = Элементы.ТОвары.ТекущиеДанные;
	текстрсотрудник = Элементы.Сотрудники.текущиеданные;
	Если текстр<>Неопределено И текстрсотрудник <>Неопределено ТОгда	
		МассивТабДок = ПечатьНППоСотрудникуНаСервере(текстр.номерстроки, текстрсотрудник.НомерСтроки);
		Если  МассивТабДок.Количество() >0 Тогда 
			ТабДокумент =  МассивТабДок[0].ТабДок;
			ТабДокумент.ТолькоПросмотр = Истина;
			ТабДокумент.АвтоМасштаб=Истина;
			ТабДокумент.ЭкземпляровНаСтранице=1;
			ТабДокумент.ОтображатьЗаголовки = Ложь;
			ТабДокумент.Показать();		
		КонецЕсли;	
	КонецЕсли;	
	
	
КонецПроцедуры

&НаСервере
Функция ПечатьОбразецБракаПоЗаказуСервере(номерстрокизаказа)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатная форма ""Образец брака""");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ВПФ);
	ВнешняяОбработкаОбъект.НомерСтрокиЗаказа = НомерСтрокиЗаказа;
	Массив = Новый Массив();
	Массив.Добавить(Объект.Ссылка);
	
	ТабДокумент = ВнешняяОбработкаОбъект.ПечатьОбразецБрака(Массив);
	Возврат ТабДокумент;
	
КонецФункции


&НаКлиенте
Процедура ПечатьОбразецБракаПоЗаказу(Команда)
	текстр = Элементы.ТОвары.ТекущиеДанные;
	Если текстр<>Неопределено ТОгда	
		МассивТабДок = ПечатьОбразецБракаПоЗаказуСервере(текстр.номерстроки);
		Если  МассивТабДок.Количество() >0 Тогда 
			ТабДокумент =  МассивТабДок[0].ТабДок;
			ТабДокумент.ТолькоПросмотр = Истина;
			ТабДокумент.АвтоМасштаб=Истина;
			ТабДокумент.ЭкземпляровНаСтранице=1;
			ТабДокумент.ОтображатьЗаголовки = Ложь;
			ТабДокумент.Показать();		
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция НайтиВПФ(Наименование)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование);
	Возврат ВПФ;

КонецФункции


&НаКлиенте
Процедура ОтправитьПисьмо(Команда)

	ВПФ = НайтиВПФ("Печатная форма ""Ответ на претензию""");

	Если ВПФ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВПФ);
	ОбъектыНазначения = Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОбъектыНазначения", ОбъектыНазначения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПОслеОтправкиПисьма", ЭтаФорма);

	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыОткрытия, ЭтаФорма, ,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура  ПОслеОтправкиПисьма(Результат, Параметры)  Экспорт
	ЭтаФорма.Прочитать(); // 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаключенияДляПечатников(Команда)
	
	текстр = Элементы.Товары.ТекущиеДанные;
	текстрсотрудник = Элементы.Сотрудники.ТекущиеДанные;
	Если текстр <> Неопределено И текстрсотрудник <> Неопределено Тогда	
		ТабДокумент = ПечатьЗаключенияПоАктуОБракеНаСервере(текстр.НомерСтроки, текстрсотрудник.НомерСтроки, Истина);
		ТабДокумент.Показать();		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаключенияДляПеремотчиков(Команда)
	
	текстр = Элементы.Товары.ТекущиеДанные;
	текстрсотрудник = Элементы.Сотрудники.ТекущиеДанные;
	Если текстр <> Неопределено И текстрсотрудник <> Неопределено Тогда	
		ТабДокумент = ПечатьЗаключенияПоАктуОБракеНаСервере(текстр.НомерСтроки, текстрсотрудник.НомерСтроки);
		ТабДокумент.Показать();		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция  ПечатьЗаключенияПоАктуОБракеНаСервере(номерстрокизаказа, номерстрокисотрудника, ДляПечатников = Ложь)
	
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатная форма ""лк Заключение по акту о браке""");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ВПФ);
	ВнешняяОбработкаОбъект.НомерСтрокиЗаказа 		= НомерСтрокиЗаказа;
	ВнешняяОбработкаОбъект.НомерСтрокиСотрудника 	= НомерСтрокиСотрудника;
	ВнешняяОбработкаОбъект.ДляПечатников 			= ДляПечатников;
	Массив = Новый Массив();
	Массив.Добавить(Объект.Ссылка);
	
	ТабДокумент = ВнешняяОбработкаОбъект.ПечатьВнешнейПечатнойФормы(Массив);
	
	ТабДокумент.ТолькоПросмотр 			= Истина;
	ТабДокумент.АвтоМасштаб 			= Истина;
	ТабДокумент.ЭкземпляровНаСтранице 	= 1;
	ТабДокумент.ОтображатьЗаголовки 	= Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура ИзвеститьОНачалеРаботыСПретензиейРекламацией(Команда)
	
	ОтправитьИзвещениеНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОтправитьИзвещениеНаСервере()
	
	ТекстПисьма = "";
	Кому = "";
	АдресаМенеджеров = "";
	Тема = "В работу принята претензия # " + Объект.Номер;
	ТекстПисьма = "Ваша рекламация адресованная ООО «ОКИЛ-САТО Икс-Пак» зарегистрирована. Ответ будет отправлен отдельным письмом после проведения расследования." + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "<table border><th>Параметр</th><th>Значение</th>";
	ТекстПисьма = ТекстПисьма + "<tr>";
	ТекстПисьма = ТекстПисьма + "<td>" + "Дата регистрации" + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ТекущаяДата() + "</td>";
	ТекстПисьма = ТекстПисьма + "</tr>";
	ТекстПисьма = ТекстПисьма + "<tr>";
	ТекстПисьма = ТекстПисьма + "<td>" + "Входящий номер рекламации" + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Объект.Номер + "</td>";
	ТекстПисьма = ТекстПисьма + "</tr>";
	Для каждого Стр Из Объект.Товары Цикл
		ТекстПисьма = ТекстПисьма + "<tr>";
		ТекстПисьма = ТекстПисьма + "<td>" + "Номер заказа" + "</td>";
		ТекстПисьма = ТекстПисьма + "<td>" + Стр.ЗаказКлиента.НомерБезПрефикса + "</td>";
		ТекстПисьма = ТекстПисьма + "</tr>";
		ТекстПисьма = ТекстПисьма + "<tr>";
		ТекстПисьма = ТекстПисьма + "<td>" + "Номенклатура" + "</td>";
		ТекстПисьма = ТекстПисьма + "<td>" + Стр.Номенклатура + "</td>";
		ТекстПисьма = ТекстПисьма + "</tr>";
		ТекстПисьма = ТекстПисьма + "<tr>";
		ТекстПисьма = ТекстПисьма + "<td>" + "Дефект" + "</td>";
		ТекстПисьма = ТекстПисьма + "<td>" + Стр.Дефект + "</td>";
		ТекстПисьма = ТекстПисьма + "</tr>";
		ТекстПисьма = ТекстПисьма + "<tr>";
		ТекстПисьма = ТекстПисьма + "<td>" + "Категория претензии" + "</td>";
		ТекстПисьма = ТекстПисьма + "<td>" + Стр.КатегорияПретензии + "</td>";
		ТекстПисьма = ТекстПисьма + "</tr>";
		ТекстПисьма = ТекстПисьма + "<tr>";
		ТекстПисьма = ТекстПисьма + "<td>" + "Количество" + "</td>";
		ТекстПисьма = ТекстПисьма + "<td>" + Стр.КоличествоЗабракованных + "</td>";
		ТекстПисьма = ТекстПисьма + "</tr>";
		АдресаМенеджеров = АдресаМенеджеров + Стр.ЗаказКлиента.Менеджер.КонтактнаяИнформация[0].АдресЭП + ";";
	КонецЦикла;
	ТекстПисьма = ТекстПисьма + "</table>";
	Кому = "D.Ivanushkin@okil.ru;PSolodky@okil-sato.ru;vplaksin@okil-sato.ru;EShalaginova@okil-sato.ru;jprokofieva@okil-sato.ru";
	Кому = Кому + АдресаМенеджеров;
	Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, Тема, Кому);
	Док = Объект.Ссылка.ПолучитьОбъект();
	Док.ДатаОтправкиИзвещения = ТекущаяДата();
	Док.ОбменДанными.Загрузка=Истина;
	Док.Записать(РежимЗаписиДокумента.Запись,);	

КонецПроцедуры


&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементовДляИксПака();
КонецПроцедуры









