#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если Параметры.Свойство("ТипПодключения") И Параметры.ТипПодключения = Перечисления.ТипыПодключенияОборудования.ОбщийДоступ Тогда
		ДанныеВыбора.ЗагрузитьЗначения(МенеджерОборудования.ДоступныеТипыОбщедоступногоОборудования());
	Иначе
		ДанныеВыбора.ЗагрузитьЗначения(МенеджерОборудования.ДоступныеТипыОборудования());
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти