
&Вместо("ОбработкаПроведения")
Процедура Лико_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Лико_НесоответствияЗаказу.Записывать = Истина;
	Движения.Лико_ВозвратыКлиентов.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка.ВидОперации КАК ВидОперации,
	|	Лико_НесоответствующаяПродукцияТовары.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_НесоответствующаяПродукцияТовары.Номенклатура КАК Номенклатура,
	|	Лико_НесоответствующаяПродукцияТовары.ДокументОтгрузки КАК ДокументОтгрузки,
	|	Лико_НесоответствующаяПродукцияТовары.Дефект КАК Дефект,
	|	Лико_НесоответствующаяПродукцияТовары.Возврат КАК Возврат,
	|	Лико_НесоответствующаяПродукцияТовары.Решение КАК Решение,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.КоличествоЗабракованных) КАК КоличествоЗабракованных,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.МетражКВЗабракованных) КАК МетражКВЗабракованных,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.УпакованоБезИсправления) КАК УпакованоБезИсправления,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.УтилизированоЗаказчиком) КАК УтилизированоЗаказчиком,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.УтилизированоНаПредприятии) КАК УтилизированоНаПредприятии,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.УпакованоПослеИсправления) КАК УпакованоПослеИсправления,
	|	Лико_НесоответствующаяПродукцияТовары.ОписаниеДефекта КАК ОписаниеДефекта,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаЗапроса КАК ДатаЗапроса,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаОтвета КАК ДатаОтвета,
	|	Лико_НесоответствующаяПродукцияТовары.НомерАктаБухгалтерии КАК НомерАктаБухгалтерии,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.СработаноЗаказчиком) КАК СработаноЗаказчиком,
	|	Лико_НесоответствующаяПродукцияТовары.ПричинаВозникновения КАК ПричинаВозникновения
	|ИЗ
	|	Документ.Лико_НесоответствующаяПродукция.Товары КАК Лико_НесоответствующаяПродукцияТовары
	|ГДЕ
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка.ВидОперации,
	|	Лико_НесоответствующаяПродукцияТовары.ЗаказКлиента,
	|	Лико_НесоответствующаяПродукцияТовары.Номенклатура,
	|	Лико_НесоответствующаяПродукцияТовары.ДокументОтгрузки,
	|	Лико_НесоответствующаяПродукцияТовары.Дефект,
	|	Лико_НесоответствующаяПродукцияТовары.Возврат,
	|	Лико_НесоответствующаяПродукцияТовары.Решение,
	|	Лико_НесоответствующаяПродукцияТовары.ОписаниеДефекта,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаЗапроса,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаОтвета,
	|	Лико_НесоответствующаяПродукцияТовары.НомерАктаБухгалтерии,
	|	Лико_НесоответствующаяПродукцияТовары.ПричинаВозникновения";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ПОка Выборка.Следующий() Цикл
		Запись 	=Движения.Лико_НесоответствияЗаказу.Добавить();
		Запись.Период 			= Дата;
		Запись.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	"ВЫБРАТЬ
	|	Лико_НесоответствующаяПродукцияТовары.ЗаказКлиента КАК Заказ,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаОтвета КАК Дата,
	|	Лико_НесоответствующаяПродукцияТовары.ДокументОтгрузки КАК ДокументОтгрузки,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.УтилизированоЗаказчиком + Лико_НесоответствующаяПродукцияТовары.УтилизированоНаПредприятии) КАК Количество,
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка КАК Регистратор,
	|	Лико_НесоответствующаяПродукцияТовары.РабочийЦентр КАК РабочийЦентр,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_ТехнологическиеКоды.ЛиквидацияПоРекламации)) КАК КодОперации
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_НесоответствующаяПродукция.Товары КАК Лико_НесоответствующаяПродукцияТовары
	|ГДЕ
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка = &Ссылка
	|	И Лико_НесоответствующаяПродукцияТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияНесоответствийЗаказу.Отработано)
	|	И (Лико_НесоответствующаяПродукцияТовары.УтилизированоЗаказчиком <> 0
	|			ИЛИ Лико_НесоответствующаяПродукцияТовары.УтилизированоНаПредприятии <> 0)
	|	И Лико_НесоответствующаяПродукцияТовары.ДатаОтвета <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И Лико_НесоответствующаяПродукцияТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_НесоответствующаяПродукцияТовары.ЗаказКлиента,
	|	Лико_НесоответствующаяПродукцияТовары.ДокументОтгрузки,
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка,
	|	Лико_НесоответствующаяПродукцияТовары.РабочийЦентр,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаОтвета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_НесоответствующаяПродукцияТовары.ЗаказКлиента,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаОтвета,
	|	Лико_НесоответствующаяПродукцияТовары.ДокументОтгрузки,
	|	СУММА(Лико_НесоответствующаяПродукцияТовары.УпакованоБезИсправления + Лико_НесоответствующаяПродукцияТовары.УпакованоПослеИсправления),
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка,
	|	Лико_НесоответствующаяПродукцияТовары.РабочийЦентр,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_ТехнологическиеКоды.ВозвратОтЗаказчика))
	|ИЗ
	|	Документ.Лико_НесоответствующаяПродукция.Товары КАК Лико_НесоответствующаяПродукцияТовары
	|ГДЕ
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка = &Ссылка
	|	И Лико_НесоответствующаяПродукцияТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияНесоответствийЗаказу.Отработано)
	|	И (Лико_НесоответствующаяПродукцияТовары.УпакованоБезИсправления <> 0
	|			ИЛИ Лико_НесоответствующаяПродукцияТовары.УпакованоПослеИсправления <> 0)
	|	И Лико_НесоответствующаяПродукцияТовары.ДатаОтвета <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И Лико_НесоответствующаяПродукцияТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_НесоответствующаяПродукцияТовары.ЗаказКлиента,
	|	Лико_НесоответствующаяПродукцияТовары.ДокументОтгрузки,
	|	Лико_НесоответствующаяПродукцияТовары.Ссылка,
	|	Лико_НесоответствующаяПродукцияТовары.РабочийЦентр,
	|	Лико_НесоответствующаяПродукцияТовары.ДатаОтвета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Заказ КАК Заказ,
	|	ВТ.КодОперации КАК КодОперации,
	|	ВТ.Дата КАК Дата,
	|	ВТ.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВТ.Регистратор КАК Регистратор,
	|	ВТ.Количество КАК Количество,
	|	СУММА(Лико_Отгрузки.МетражКВМ) КАК МетражКВМ,
	|	СУММА(Лико_Отгрузки.МетражПМ) КАК МетражПМ,
	|	СУММА(Лико_Отгрузки.Количество) КАК КоличествоОтгрузки,
	|	ВТ.РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТОтгрузки
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_Отгрузки КАК Лико_Отгрузки
	|		ПО ВТ.Заказ = Лико_Отгрузки.Заказ
	|			И ВТ.ДокументОтгрузки = Лико_Отгрузки.Отгрузка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Дата,
	|	ВТ.ДокументОтгрузки,
	|	ВТ.Заказ,
	|	ВТ.Регистратор,
	|	ВТ.Количество,
	|	ВТ.РабочийЦентр,
	|	ВТ.КодОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.Заказ,
	|	ВТ.КодОперации,
	|	ВТ.Дата,
	|	ВТ.ДокументОтгрузки,
	|	ВТ.Регистратор,
	|	ВТ.Количество,
	|	СУММА(Лико_Отгрузки2.МетражКВМ),
	|	СУММА(Лико_Отгрузки2.МетражПМ),
	|	СУММА(Лико_Отгрузки2.Количество),
	|	ВТ.РабочийЦентр
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_Отгрузки2 КАК Лико_Отгрузки2
	|		ПО ВТ.Заказ = Лико_Отгрузки2.Заказ
	|			И ВТ.ДокументОтгрузки = Лико_Отгрузки2.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Дата,
	|	ВТ.ДокументОтгрузки,
	|	ВТ.Заказ,
	|	ВТ.Регистратор,
	|	ВТ.Количество,
	|	ВТ.РабочийЦентр,
	|	ВТ.КодОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОтгрузки.Заказ КАК Заказ,
	|	ВТОтгрузки.КодОперации КАК КодОперации,
	|	ВТОтгрузки.Дата КАК Период,
	|	ВТОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВТОтгрузки.Регистратор КАК Регистратор,
	|	ВТОтгрузки.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВТОтгрузки.Количество = ВТОтгрузки.КоличествоОтгрузки
	|				И ВТОтгрузки.МетражПМ <> 0
	|			ТОГДА ВТОтгрузки.МетражПМ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОтгрузки.Заказ.ШтКВМ > 0
	|						И ВТОтгрузки.Заказ.Нарезка.Размер > 0
	|					ТОГДА ВТОтгрузки.Количество * 1000 * 1000 / ВТОтгрузки.Заказ.ШтКВМ / ВТОтгрузки.Заказ.Нарезка.Размер
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК МетражПМ,
	|	ВЫБОР
	|		КОГДА ВТОтгрузки.Количество = ВТОтгрузки.КоличествоОтгрузки
	|			ТОГДА ВТОтгрузки.МетражКВМ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОтгрузки.Заказ.ШтКВМ > 0
	|					ТОГДА ВТОтгрузки.Количество * 1000 / ВТОтгрузки.Заказ.ШтКВМ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК МетражКВМ,
	|	ВТОтгрузки.РабочийЦентр КАК РабочийЦентр
	|ИЗ
	|	ВТОтгрузки КАК ВТОтгрузки";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись =Движения.Лико_ВозвратыКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(запись, выборка);
	КонецЦикла;
	
	Движения.Записать();

КонецПроцедуры
