//&Вместо("ТекстЗапросаВтВидыЗапасовРаботыДавальцу")
//Функция Лико_ТекстЗапросаВтВидыЗапасовРаботыДавальцу()
//	
//	Возврат
//	"ВЫБРАТЬ
//	|	ИСТИНА																					КАК ДополнениеДляДавальца,
//	|	НЕОПРЕДЕЛЕНО																		КАК ВидЗапасовВладельца,
//	|	ЛОЖЬ																							КАК РеализацияЗапасовДругойОрганизации,
//	|	НЕОПРЕДЕЛЕНО																		КАК ВидЗапасов,
//	|	ВидыЗапасов.ВидЗапасов														КАК КорВидЗапасов,
//	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)	КАК НомерГТД,
//	|	Аналитика.КлючАналитики													КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики						КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|	Аналитика.Номенклатура														КАК Номенклатура,
//	|	Аналитика.Характеристика													КАК Характеристика,
//	|	ВидыЗапасов.Количество														КАК Количество,
//	|	ВидыЗапасов.ХозяйственнаяОперация								КАК ХозяйственнаяОперация,
//	|	ЛОЖЬ																							КАК СписатьНаРасходы,
//	|	ВидыЗапасов.АналитикаУчетаНоменклатуры					КАК КорАналитикаУчетаНоменклатуры,
//	|	КорАналитикаБезНазначения.КлючАналитики				КАК КорАналитикаУчетаНоменклатурыБезНазначения,
//	|	ВидыЗапасов.ДатаОперации												КАК ДатаОперации,
//	|	НЕОПРЕДЕЛЕНО																		КАК Подразделение,
//	|	НЕОПРЕДЕЛЕНО																		КАК СтатьяРасходов,
//	|	НЕОПРЕДЕЛЕНО																		КАК АналитикаРасходов,
//	|	НЕОПРЕДЕЛЕНО																		КАК АналитикаАктивовПассивов,
//	|	ВЫБОР
//	|		КОГДА ВидыЗапасов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
//	|			И &ФИФОСкользящаяОценка
//	|			ТОГДА ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий
//	|		ИНАЧЕ &АналитикаУчетаПартийТоваров
//	|	КОНЕЦ																						КАК АналитикаУчетаПартий,
//	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)	КАК РазделУчета,
//	|	НЕОПРЕДЕЛЕНО																		КАК КорРазделУчета,
//	|	0																									КАК Сумма,
//	|	0																									КАК СуммаЗабалансовая,
//	|	ВидыЗапасов.ИдентификаторСтроки								КАК ИдентификаторСтроки,
//	|	ВЫБОР
//	|		КОГДА &АналитическийУчетПоГруппамПродукции
//	|				И НЕ ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета =
//	|							ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ																						КАК АналитикаФинансовогоУчета,
//	|	НЕОПРЕДЕЛЕНО																		КАК КорАналитикаФинансовогоУчета
//	|ИЗ
//	|	Документ.ЭтапПроизводства2_2.ВидыЗапасовИзделия КАК ВидыЗапасов
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
//	|	ПО Аналитика.Номенклатура = ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура
//	|	И Аналитика.Характеристика = ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика
//	|	И Аналитика.Назначение = ВидыЗапасов.АналитикаУчетаНоменклатуры.Назначение
//	|	И Аналитика.Серия = &ПустаяСсылкаСерия
//	|	И Аналитика.МестоХранения = ВидыЗапасов.АналитикаУчетаНоменклатуры.Назначение.Заказ.Подразделение
//	|	И Аналитика.СтатьяКалькуляции = ВидыЗапасов.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО АналитикаБезНазначения.Номенклатура = ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура
//	|	И АналитикаБезНазначения.Характеристика = ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика
//	|	И АналитикаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//	|	И АналитикаБезНазначения.Серия = &ПустаяСсылкаСерия
//	|	И АналитикаБезНазначения.МестоХранения = ВидыЗапасов.АналитикаУчетаНоменклатуры.Назначение.Заказ.Подразделение
//	|	И АналитикаБезНазначения.СтатьяКалькуляции = ВидыЗапасов.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КорАналитикаБезНазначения
//	|	ПО КорАналитикаБезНазначения.Номенклатура = ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура
//	|	И КорАналитикаБезНазначения.Характеристика = ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика
//	|	И КорАналитикаБезНазначения.Назначение = &ПустаяСсылкаНазначение
//	|	И КорАналитикаБезНазначения.Серия = ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия
//	|	И КорАналитикаБезНазначения.МестоХранения = ВидыЗапасов.АналитикаУчетаНоменклатуры.МестоХранения
//	|	И КорАналитикаБезНазначения.СтатьяКалькуляции = ВидыЗапасов.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
//	|	
//	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
//	|	ПО ТаблицаАналитикУчетаПартий.КодСтроки = ВидыЗапасов.КодСтроки
//	|	И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти = ""ВыходныеИзделия""
//	|	И ВидыЗапасов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
//	|	
//	|ГДЕ
//	|	ВидыЗапасов.Ссылка = &Ссылка
//	|	И &Статус В (
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
//	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
//	|	И ВидыЗапасов.ПередатьДавальцу
//	|";
//	
//КонецФункции