
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Состояние = Перечисления.Лико_СостоянияДокументаКартаПерерасхода.Создан;	
	КонецЕсли;
	
	Если Параметры.Свойство("ИзПланирования") Тогда
		ИзПланирования = Истина;	
	КонецЕсли;
	
	Если Объект.Состояние = Перечисления.Лико_СостоянияДокументаКартаПерерасхода.Создан И ИзПланирования Тогда
		Объект.КоличествоПодтверждено = Объект.КоличествоЗаявлено;
	КонецЕсли;
	
	Если Объект.Состояние = Перечисления.Лико_СостоянияДокументаКартаПерерасхода.Подтвержден И НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Подтвердить.Доступность = Ложь;
		Элементы.Отклонить.Доступность = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// СтандартныеПодсистемы.РаботаСФайлами 
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры  

#КонецОбласти
 
#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Отклонить(Команда)
	
	Если ЕстьПравоНаПодтверждениеСервер() Тогда
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияДокументаКартаПерерасхода.Отклонен");
		Объект.КоличествоПодтверждено = 0;
		Объект.Проверил = ПользователиКлиентСервер.ТекущийПользователь();
		Объект.ДатаПроверки = ТекущаяДата(); 
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи,", РежимЗаписиДокумента.Проведение));
		Если ИзПланирования Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Сообщить("Недостаточно прав для отклонения");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если ЕстьПравоНаПодтверждениеСервер() Тогда
		Если Объект.КоличествоПодтверждено = 0 Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросОПодтверждении", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Нет подтвержденных метров, карта будет Отклонена. Вы уверены?",РежимДиалогаВопрос.ДаНет);			
			Возврат;
		КонецЕсли;
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияДокументаКартаПерерасхода.Подтвержден");
		Объект.Проверил = ПользователиКлиентСервер.ТекущийПользователь();
		Объект.ДатаПроверки = ТекущаяДата(); 
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи,", РежимЗаписиДокумента.Проведение));
		Если ИзПланирования Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Сообщить("Недостаточно прав для подтверждения");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОПодтверждении(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Отклонить(Неопределено);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьПравоНаПодтверждениеСервер() //+Лико m.shenderov 02.07.2025

	Возврат Документы.Лико_КартаПерерасхода.ЕстьПравоНаПодтверждение();
	
КонецФункции //-Лико m.shenderov 02.07.2025 

 
&НаСервере
Процедура УстановитьУсловноеОформление()
	//
	УсловноеОформление.Элементы.Очистить(); 	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЗаявлено.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТССтатусыЗаказов.Печать;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьПравоНаПодтверждениеСервер() Тогда
		Если Объект.КоличествоПодтверждено = 0 И Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияДокументаКартаПерерасхода.Подтвержден") Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросОПодтверждении", ЭтотОбъект, Отказ);
			ПоказатьВопрос(ОписаниеОповещения, "Нет подтвержденных метров, карта будет Отклонена. Вы уверены?",РежимДиалогаВопрос.ДаНет);			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры




// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 


// СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	 РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	 РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

