
Процедура ПередЗаписью(Отказ)
	
	Наименование = СокрЛП(Имя) + ?(ЗначениеЗаполнено(Толщина)," " + Строка(Толщина),"");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЛицевойМатериал.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ЛицевойМатериал КАК Лико_ЛицевойМатериал
	|ГДЕ
	|	Лико_ЛицевойМатериал.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка = ЭтотОбъект.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Отказ = Истина;
		Сообщить("Элемент """ + Наименование + """ уже существует");
	КонецЦикла;
	
КонецПроцедуры
