

&Вместо("ОстаткиСерийПоБух")
Функция Лико_ОстаткиСерийПоБух(Дата,Организация,МассивСерий)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыНаСкладахОстатки.Серия КАК Серия
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			Склад.Лико_Площадка.Организация = &Организация
	|				И Серия В (&МассивСерий)) КАК ТоварыНаСкладахОстатки";
	Запрос.УстановитьПараметр("Дата",Дата );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("МассивСерий",МассивСерий );

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");
КонецФункции
 