
&Вместо("Лико_СоздатьРедактироватьПрочееОприходование")
Процедура Лико_Лико_СоздатьРедактироватьПрочееОприходование(ДанныеЗаполнения, РежимЗаписи, Отказ)

	Если Не (ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки и Перегравировка)  Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 	

	ИмяНакладной="ПрочееОприходованиеТоваров";
	ДокументСсылка=Лико_ОбщегоНазначенияСервер.НайтиДокумент(ИмяНакладной,"Лико_Документ",Ссылка);		

	Если  ЗначениеЗаполнено(ДокументСсылка) Тогда
		НовоеПоступление=ДокументСсылка.ПолучитьОбъект();			
	Иначе			
		НовоеПоступление=Документы.ПрочееОприходованиеТоваров.СоздатьДокумент();	
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(НовоеПоступление,ДанныеЗаполнения);
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();

	НовоеПоступление.Организация=Организация; 
	НовоеПоступление.Валюта =ВалютаРуб;	
	НовоеПоступление.Склад = Склад;	
	НовоеПоступление.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОприходованиеЗаСчетРасходов;	
	НовоеПоступление.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
	НовоеПоступление.Комментарий = "" + НовоеПоступление.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";


	НовоеПоступление.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;

	Тз=Товары.Выгрузить(,ПоляТыблицыТоваров());



	МассивСерий=Товары.Выгрузить().ВыгрузитьКолонку("Серия");
	ОстаткиСерийНаСкладе=Документы.Лико_ВозвратТоваров.ОстаткиСерийПоБух(Дата,Ссылка.Организация ,МассивСерий);

	Для каждого Серия Из ОстаткиСерийНаСкладе Цикл

		НайденныеСтроки=Тз.НайтиСтроки(Новый Структура("Серия",Серия));

		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл 

			Тз.Удалить(НайденнаяСтрока);

		КонецЦикла; 

	КонецЦикла;


	Тз.Свернуть("Номенклатура","Количество");

	Если Тз.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	НовоеПоступление.Товары.Очистить();	
	Для каждого Услуга Из Тз Цикл

		Товар=НовоеПоступление.Товары.Добавить();
		Товар.СтатьяРасходовДоходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяДоходовПерегравировки.ЗначениеПараметра;
		ТОвар.АналитикаРасходов=НовоеПоступление.Подразделение;
		Товар.Номенклатура=Услуга.Номенклатура;

		Товар.Цена =1;
		Товар.Количество=Услуга.Количество;
		Товар.КоличествоУпаковок=Услуга.Количество;
		Товар.Сумма=Товар.Цена*Товар.Количество;

	КонецЦикла;

	Если ДополнительныеСвойства.ЭтоНовый Тогда
		НовоеПоступление.Лико_Документ=ДополнительныеСвойства.НоваяСсылкаСсылка;
	Иначе
		НовоеПоступление.Лико_Документ=Ссылка; 
	КонецЕсли;


	Попытка 				
		НовоеПоступление.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовоеПоступление + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());		
	КонецПопытки;

	ЕСли Не Отказ Тогда
		Распоряжение=НовоеПоступление.Ссылка;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
