
&НаКлиенте
Процедура КодНаРельсеПриИзменении(Элемент)
	НомерЗаказа = КодНаРельсе;

КонецПроцедуры

&НаКлиенте
Процедура ТипЦветаФормы01ПриИзменении(Элемент)
	ЕстьФорма=ЭтаФорма["ЕстьФорма"+Прав(Элемент.Имя,2)];
	ТипЦветаФормы=ЭтаФорма["ТипЦветаФормы"+Прав(Элемент.Имя,2)];
	ДополнениеФорма=ЭтаФорма["ДополнениеФорма"+Прав(Элемент.Имя,2)];
    

	
	Если Лев(Элемент.Имя,15)="ДополнениеФорма" Тогда
		ЕстьФорма = Истина;
	КонецЕсли;
	Если Лев(Элемент.Имя,13)="ТипЦветаФормы" Тогда
		ЕстьФорма = Истина;
	КонецЕсли;
	ЭтаФорма["ПредставлениеФорма"+Прав(Элемент.Имя,2)]= ?(ЕстьФорма, ""+ТипЦветаФормы+" "+ДополнениеФорма, "");
ОбновлениеОтображенияУПП();
	

КонецПроцедуры


&НаКлиенте
Процедура ОбновлениеОтображенияУПП() //+Лико m.shenderov 21.01.2018
Элементы.НадписьТекущийКонверт.Заголовок = ?(Не ЗначениеЗаполнено(ТекущийКонверт), "<Конверт не выбран! Отсканируйте его штрих-код>", " В конверте сейчас "+КоличествоФормВКонверте(ТекущийКонверт)+" форм.");
	
	Элементы.ПанельПечатьКонвертов.Доступность = ЗначениеЗаполнено(Объект.Организация);
	Элементы.ПанельСозданиеФорм.Доступность = ЗначениеЗаполнено(Объект.Организация);
	
	Элементы.НадписьВыбраноФорм.Заголовок = ""
										+ (ЕстьФорма01+ЕстьФорма02+ЕстьФорма03+ЕстьФорма04+ЕстьФорма05+ЕстьФорма06+ЕстьФорма07+ЕстьФорма08+ЕстьФорма09+ЕстьФорма10
										+ ЕстьФорма11+ЕстьФорма12+ЕстьФорма13+ЕстьФорма14+ЕстьФорма15+ЕстьФорма16+ЕстьФорма17+ЕстьФорма18+ЕстьФорма19+ЕстьФорма20)
										+" шт.";
										
Если ТолькоКонверты Тогда
	
	Элементы.ПанельСозданиеФорм.Видимость = Ложь; 
	
КонецЕсли;
										
	
КонецПроцедуры //-Лико m.shenderov 21.01.2018


Функция КоличествоФормВКонверте(ТекущийКонверт) Экспорт
	
	КоличествоФорм = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.Форма) КАК КоличествоФорм
	|ИЗ
	|	(ВЫБРАТЬ
	|		Лико_ИсторияДвиженийФормСрезПоследних.Период КАК Период,
	|		Лико_ИсторияДвиженийФормСрезПоследних.Регистратор КАК Регистратор,
	|		Лико_ИсторияДвиженийФормСрезПоследних.НомерСтроки КАК НомерСтроки,
	|		Лико_ИсторияДвиженийФормСрезПоследних.Активность КАК Активность,
	|		Лико_ИсторияДвиженийФормСрезПоследних.Организация КАК Организация,
	|		Лико_ИсторияДвиженийФормСрезПоследних.Форма КАК Форма,
	|		Лико_ИсторияДвиженийФормСрезПоследних.Расположение КАК Расположение,
	|		Лико_ИсторияДвиженийФормСрезПоследних.Ответственный КАК Ответственный
	|	ИЗ
	|		РегистрСведений.Лико_ИсторияДвиженийФорм.СрезПоследних КАК Лико_ИсторияДвиженийФормСрезПоследних
	|	ГДЕ
	|		Лико_ИсторияДвиженийФормСрезПоследних.Расположение = &Конверт) КАК ВложенныйЗапрос";
	Запрос.УстановитьПараметр("Конверт", ТекущийКонверт);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		
		КоличествоФорм = ВыборкаЗапроса.КоличествоФорм;
	Иначе 	//запрос пуст!
	КонецЕсли;
	
	
	Возврат КоличествоФорм;
	
КонецФункции //КоличествоФормВКонверте Экспорт

&НаКлиенте
Процедура СоздатьИИлиРаспечататьКонвертыНажатиеНаСервере()
	
	Для Инд=НомерКонвертаС По НомерКонвертаПо Цикл
	     ТабличныДокумент=Новый ТабличныйДокумент;
		СоздатьРаспечататьКонверт(ГруппаКонвертов, ТипКонверта, Инд, СразуНаПринтер,ТабличныДокумент);
		Если СразуНаПринтер Тогда
			ТабличныДокумент.Напечатать();
		Иначе
			ТабличныДокумент.Показать();
		КонецЕсли; 	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИИлиРаспечататьКонвертыНажатие(Команда)
	
	//Если Не ЗначениеЗаполнено(ГруппаКонвертов) Тогда
	//	Сообщить("Не задана группа конвертов!",СтатусСообщения.Информация);
	//	Возврат;
	//КонецЕсли;
	Если Не ЗначениеЗаполнено(ТипКонверта) Тогда
		Сообщить("Не задана тип конверта!",СтатусСообщения.Информация);
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерКонвертаС) Тогда
		Сообщить("Не задано начало интервала!",СтатусСообщения.Информация);
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерКонвертаПо) Тогда
		Сообщить("Не задано конец интервала!",СтатусСообщения.Информация);
		Возврат;
	КонецЕсли;
	Если НомерКонвертаПо<НомерКонвертаС Тогда
		Сообщить("Неправильно задан интервал!",СтатусСообщения.Информация);
		Возврат;
	КонецЕсли;
	

	
	СоздатьИИлиРаспечататьКонвертыНажатиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура СоздатьРаспечататьКонверт(ГруппаКонвертов, Тип, Индекс, НаПечать,ТабличныйДокумент) Экспорт
	
	Префикс = ГруппаКонвертов.ПрефиксГруппы;
	
	ПолныйКод = "" + СокрЛП(Префикс) + Формат(Индекс, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0") + "/" + Формат(Тип, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	
	Конверт = Справочники.Лико_Конверты.НайтиПоКоду(ПолныйКод);
	
	Если Не ЗначениеЗаполнено(Конверт) Тогда
		НовыйКонверт = Справочники.Лико_Конверты.СоздатьЭлемент();
		НовыйКонверт.Код = ПолныйКод;
		НовыйКонверт.Наименование = ПолучитьБезПрефикса(ПолныйКод);
		НовыйКонверт.ТипКонверта = Тип;
		НовыйКонверт.Родитель = ГруппаКонвертов;
		НовыйКонверт.Организация = Объект.Организация;
		НовыйКонверт.Площадка = Объект.Площадка;
		НовыйКонверт.Записать();
		
		КонвертОбъект = НовыйКонверт;
		Конверт = НовыйКонверт.Ссылка;
		
	Иначе
		
		КонвертОбъект = Конверт.ПолучитьОбъект();
		
	КонецЕсли;
	
	КоличествоКопий = 1;
	ПечатьКонверта(Конверт, ТабличныйДокумент);
	
	
	
КонецПроцедуры //СоздатьРаспечататьКонверт


Процедура ПечатьКонверта(Конверт,ТабличныйДокумент)
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;

	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	
	
	
	ТабличныйДокумент.ИмяПараметровПечати = "Лико_ПАРАМЕТРЫ_ПЕЧАТИ_Конверт";
	
		
	Макет = Справочники.Лико_Конверты.ПолучитьМакет("ПФ_MXL_СтикерКонверта");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	
	//ПервыйДокумент = Истина;	
	//Для Каждого Объект Из МассивОбъектов Цикл 		
	//	Если Не ПервыйДокумент Тогда
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли; 		
	//	ПервыйДокумент = Ложь;
	//	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
	ШКСТрокой = "";
	
	
	ШК = Справочники.Лико_Конверты.ПолучитьШтрихКод(Конверт,ШКСтрокой); //длина штрихкода - 13 (Расшифровка символов в ОбработкаШК)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Наименование", Конверт.Наименование);
	
	
	// Выводим шапку
	
	ОбластьШапка.Параметры.ШтрихКодСтрокой = ШКСТрокой;
	
	
		Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(ОбластьШапка.Рисунки.КартинкаШтрихкода.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(ОбластьШапка.Рисунки.КартинкаШтрихкода.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШК));
	ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    6);
	
	ОбластьШапка.Рисунки.КартинкаШтрихкода.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	

	
	
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
	ТабличныйДокумент.Вывести(ОбластьШапка);
 	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ПолеСлева 	= 1;
	ТабличныйДокумент.ПолеСправа	= 0;
	ТабличныйДокумент.ПолеСнизу 	= 0;
	ТабличныйДокумент.ПолеСверху 	= 1;
	
	ИмяПринтера = СокрЛП(Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераЭтикеток", ""));
	ТабличныйДокумент.ИмяПринтера = ИмяПринтера; 	
	ТабличныйДокумент.АвтоМасштаб = Истина; 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБезПрефикса(Знач КодНомер, УдалятьВедущиеНули=Истина) Экспорт
	
	КодНомер = СокрЛП(КодНомер);
	
	// удаление ведущих букв
	Завершили = Ложь;
	Пока Не Завершили Цикл
		
		Если СтрДлина(КодНомер)=0 Тогда
			Завершили = Истина;
		КонецЕсли;
		
		Символ1 = Лев(КодНомер, 1);
		Если Символ1="0" Или Символ1="1" Или Символ1="2" Или Символ1="3" Или Символ1="4"
			Или Символ1="5"Или Символ1="6" Или Символ1="7" Или Символ1="8" Или Символ1="9" Тогда
			Завершили = Истина;
		КонецЕсли;
		
		Если Не Завершили Тогда
			КодНомер = Сред(КодНомер, 2);
		КонецЕсли;
		
	КонецЦикла;
	
	// удаление ведущих нулей
	Если УдалятьВедущиеНули Тогда
		
		Пока Лев(КодНомер, 1)="0" Цикл
			КодНомер = Сред(КодНомер, 2);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КодНомер;

КонецФункции // ПолучитьБезПрефиксов()

&НаСервере
Процедура СоздатьФормыИВнестиИхВКонвертНажатиеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФормыИВнестиИхВКонвертНажатие(Команда)
		Если Не ЗначениеЗаполнено(ГлЛико_Оператор)Тогда
		ОчиститьСообщения(); 	
		ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
       КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодНаРельсе) Тогда
		Предупреждение("Заполните код на рельсе!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
		Предупреждение("Заполните номер заказа!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийКонверт) Тогда
		Предупреждение("Отсканируйте штрих-код конверта!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГруппаКонвертов) Тогда
		Предупреждение("Не выбрана группа конвертов!");
		Возврат;
	КонецЕсли;
	
	Если ЕстьФорма01 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа,  ПредставлениеФорма01, ТипЦветаФормы01, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма02 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма02, ТипЦветаФормы02, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма03 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма03, ТипЦветаФормы03, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма04 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма04, ТипЦветаФормы04, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма05 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма05, ТипЦветаФормы05, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма06 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма06, ТипЦветаФормы06, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма07 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма07, ТипЦветаФормы07, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма08 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма08, ТипЦветаФормы08, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма09 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма09, ТипЦветаФормы09, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма10 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма10, ТипЦветаФормы10, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма11 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма11, ТипЦветаФормы11, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма12 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма12, ТипЦветаФормы12, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма13 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма13, ТипЦветаФормы13, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма14 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма14, ТипЦветаФормы14, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма15 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма15, ТипЦветаФормы15, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма16 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма16, ТипЦветаФормы16, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма17 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма17, ТипЦветаФормы17, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма18 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма18, ТипЦветаФормы18, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма19 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма19, ТипЦветаФормы19, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	Если ЕстьФорма20 Тогда
		НоваяФорма = СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФорма20, ТипЦветаФормы20, ТекущийКонверт,ГлЛико_Оператор);
		Сообщить("Создана форма "+НоваяФорма+" (код "+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоваяФорма,"Код")+") и привязана к конверту "+ТекущийКонверт);
	КонецЕсли;
	
	Сообщить("------------------------------------------------------",СтатусСообщения.Информация);
	
	УстановитьУмолчания();

	
	
	
	СоздатьФормыИВнестиИхВКонвертНажатиеНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьФормуСПривязкойККонверту(КодНаРельсе, НомерЗаказа, ПредставлениеФормы, ТипЦвета, Конверт,АвторДокумента) Экспорт
	
	
	
	Если Не ЗначениеЗаполнено(Объект.ДокументВвода) Тогда
		
		ОбъектДокументаВвода = Документы.Лико_ВозвратТоваров.СоздатьДокумент();
		ОбъектДокументаВвода.Дата = ТекущаяДата();
		ОбъектДокументаВвода.ВидОперации = Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм;
		ОбъектДокументаВвода.Дата          = ТекущаяДатаСеанса();
		//ОбъектДокументаВвода.Ответственный = Пользователи.ТекущийПользователь();
		Структура = Новый Структура;
		Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
		ЗаполнитьЗначенияСвойств(ОбъектДокументаВвода,Структура);
        ОбъектДокументаВвода.АвторДокумента=АвторДокумента;
		
		//ОбъектДокументаВвода.Заполнить(Неопределено);
		//ОбъектДокументаВвода.АвторДокумента = ЯС_Общие.ПолучитьОбщееЗначение("ЯС_Оператор");
		//ОбъектДокументаВвода.РабочееМесто = ЯС_Общие.ПолучитьРабочееМесто();
		
		//ОбъектДокументаВвода.Организация = Организация;
		ОбъектДокументаВвода.Записать(РежимЗаписиДокумента.Запись);
		Объект.ДокументВвода = ОбъектДокументаВвода.Ссылка;
	Иначе
		ОбъектДокументаВвода = Объект.ДокументВвода.ПолучитьОбъект();
	КонецЕсли;
	
	КодНового = ОпределитьКодДляНового(КодНаРельсе);
	
	НоваяФорма = Справочники.Лико_Формы.СоздатьЭлемент();
	НоваяФорма.Код = КодНового;
	НоваяФорма.ВидПечати = Перечисления.Лико_ВидыПечати.Флексо;
	
	НоваяФорма.Заказ = Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",НомерЗаказа);
	
	//Если Не ЗначениеЗаполнено(НоваяФорма.Заказ) Тогда
	//	НоваяФорма.Заказ = Лико_Общее.ПроверитьЗаполнитьЗаказ(НомерЗаказа);
	//КонецЕсли;
	
	
	НоваяФорма.Контрагент = НоваяФорма.Заказ.Контрагент;
	НоваяФорма.Наименование = ПредставлениеФормы;
	
	ТЧТовары = НоваяФорма.Заказ.Товары.Выгрузить();
	ТЧТовары.Свернуть("Номенклатура");
	Если ТЧТовары.Количество()=1 Тогда
		НоваяФорма.Номенклатура = ТЧТовары[0].Номенклатура;
	КонецЕсли;
	  НоваяФорма.Этикетки.Загрузить(НоваяФорма.Заказ.Товары.Выгрузить());
	
		
	//НоваяФорма.ТипКраски =  // это ценовые группы
	НоваяФорма.ТипЦвета = ТипЦвета;
	
	НоваяФорма.Записать();
	
	НоваяСтрока = ОбъектДокументаВвода.Формы.Добавить();
	НоваяСтрока.Конверт = Конверт;
	НоваяСтрока.Форма = НоваяФорма.Ссылка;
	
	ОбъектДокументаВвода.Записать(РежимЗаписиДокумента.Проведение);
	
	//МЗ = РегистрыСведений.Лико_ИсторияДвиженийФорм.СоздатьМенеджерЗаписи();
	//МЗ.Организация = Организация;
	//МЗ.Период = ТекущаяДата();
	//МЗ.Расположение = Конверт;
	//МЗ.Форма = НоваяФорма.Ссылка;
	//МЗ.Записать();
	
	Возврат НоваяФорма.Ссылка;
	
КонецФункции //СоздатьФормуСПривязкойККонверту Экспорт

&НаСервере 
Функция ОпределитьКодДляНового(КодНаРельсе)
	
	ЗапросКод = Новый Запрос;
	ЗапросКод.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_Формы.Код) КАК Код
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|ГДЕ
	|	Лико_Формы.Код ПОДОБНО &Код";
	ЗапросКод.УстановитьПараметр("Код", ""+КодНаРельсе+"%");
	РезультатЗапросаКод = ЗапросКод.Выполнить();
	Если Не РезультатЗапросаКод.Пустой() Тогда
		ВыборкаЗапросаКод = РезультатЗапросаКод.Выбрать();
		ВыборкаЗапросаКод.Следующий();
		
		Если ВыборкаЗапросаКод.Код<>NULL Тогда
			Код = Формат(Число(ВыборкаЗапросаКод.Код)+1, "ЧГ=0");
		Иначе
			Код = ""+КодНаРельсе+"01";
		КонецЕсли;
		
	Иначе 	//запрос пуст!
		Код = ""+КодНаРельсе+"01";
	КонецЕсли;
	
	Возврат Код;
	
КонецФункции //ОпределитьКодДляНового

&НаКлиенте  
Процедура УстановитьУмолчания() Экспорт
	
	КодНаРельсе = "";
	НомерЗаказа = "";
	ТекущийКонверт = Неопределено;
	
	ТипЦветаФормы01 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.C");
	ТипЦветаФормы02 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.M");
	ТипЦветаФормы03 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.Y");
	ТипЦветаФормы04 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.K");
	ТипЦветаФормы05 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.Pmc");
	ТипЦветаФормы06 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.PmcПоОбразцу");
	ТипЦветаФормы07 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ОснЦвет"); //ТипЦветаФормы07 = Перечисления.Лико_ТипыЦвета.PmcПоФотону;
	ТипЦветаФормы08 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ОснЦвет");
	ТипЦветаФормы09 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ОснЦветБелила");
	ТипЦветаФормы10 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ОснЦветБелила"); //ТипЦветаФормы10 = Перечисления.Лико_ТипыЦвета.ЛакБезОкна;
	
	ТипЦветаФормы11 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ЛакСОкном");
	ТипЦветаФормы12 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ВыборочныйЛак");
	ТипЦветаФормы13 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ХолодноеТиснение");
	ТипЦветаФормы14 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.РотационныйКонгрев"); //ТипЦветаФормы14 = Перечисления.Лико_ТипыЦвета.РотационныйКонгрев;
	ТипЦветаФормы15 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ЛакРазделительный");
	ТипЦветаФормы16 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ЛакГлубокойПечати");
	ТипЦветаФормы17 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ПустаяСсылка"); //ТипЦветаФормы17 = Перечисления.Лико_ТипыЦвета.БесцветнаяМасса;
	ТипЦветаФормы18 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ПустаяСсылка"); //ТипЦветаФормы18 = Перечисления.Лико_ТипыЦвета.Ламинирование;
	ТипЦветаФормы19 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ПустаяСсылка"); //ТипЦветаФормы19 = Перечисления.Лико_ТипыЦвета.Неопределенно;
	ТипЦветаФормы20 = ПредопределенноеЗначение("Перечисление.Лико_ТипыЦвета.ПустаяСсылка");
	
	ЕстьФорма01 = Ложь;
	ЕстьФорма02 = Ложь;
	ЕстьФорма03 = Ложь;
	ЕстьФорма04 = Ложь;
	ЕстьФорма05 = Ложь;
	ЕстьФорма06 = Ложь;
	ЕстьФорма07 = Ложь;
	ЕстьФорма08 = Ложь;
	ЕстьФорма09 = Ложь;
	ЕстьФорма10 = Ложь;
	
	ЕстьФорма11 = Ложь;
	ЕстьФорма12 = Ложь;
	ЕстьФорма13 = Ложь;
	ЕстьФорма14 = Ложь;
	ЕстьФорма15 = Ложь;
	ЕстьФорма16 = Ложь;
	ЕстьФорма17 = Ложь;
	ЕстьФорма18 = Ложь;
	ЕстьФорма19 = Ложь;
	ЕстьФорма20 = Ложь;
	
	ДополнениеФорма01 = "";
	ДополнениеФорма02 = "";
	ДополнениеФорма03 = "";
	ДополнениеФорма04 = "";
	ДополнениеФорма05 = "";
	ДополнениеФорма06 = "";
	ДополнениеФорма07 = "";
	ДополнениеФорма08 = "";
	ДополнениеФорма09 = "";
	ДополнениеФорма10 = "";
	
	ДополнениеФорма11 = "";
	ДополнениеФорма12 = "";
	ДополнениеФорма13 = "";
	ДополнениеФорма14 = "";
	ДополнениеФорма15 = "";
	ДополнениеФорма16 = "";
	ДополнениеФорма17 = "Лак глянцевый";
	ДополнениеФорма18 = "Лак матовый";
	ДополнениеФорма19 = "";
	ДополнениеФорма20 = "";
	
	ПредставлениеФорма01 = "";
	ПредставлениеФорма02 = "";
	ПредставлениеФорма03 = "";
	ПредставлениеФорма04 = "";
	ПредставлениеФорма05 = "";
	ПредставлениеФорма06 = "";
	ПредставлениеФорма07 = "";
	ПредставлениеФорма08 = "";
	ПредставлениеФорма09 = "";
	ПредставлениеФорма10 = "";
	
	ПредставлениеФорма11 = "";
	ПредставлениеФорма12 = "";
	ПредставлениеФорма13 = "";
	ПредставлениеФорма14 = "";
	ПредставлениеФорма15 = "";
	ПредставлениеФорма16 = "";
	ПредставлениеФорма17 = "";
	ПредставлениеФорма18 = "";
	ПредставлениеФорма19 = "";
	ПредставлениеФорма20 = "";

	
КонецПроцедуры //УстановитьУмолчания Экспорт

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если Параметры.Свойство("ЛикоЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЛикоЗначенияЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.ЛикоЗначенияЗаполнения); 
		ПлощадкаПриИзмененииНаСервере();
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
УстановитьУмолчания();
	СразуНаПринтер = Истина;
ОбновлениеОтображенияУПП();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если  ИмяСобытия="АвторизацияОператора" Тогда
		Оператор=ГлЛико_Оператор;   
	КонецЕсли;
	
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Конверта") Тогда
			//Это физ. лицо  			
			Конверт= Результат.Конверт;
			Если ЗначениеЗаполнено(Конверт) Тогда
				ТекущийКонверт = Конверт;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	     ОбновлениеОтображенияУПП();

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗапросКонверты = Новый Запрос;
	ЗапросКонверты.Текст = 
	"ВЫБРАТЬ
	|	Лико_Конверты.Ссылка
	|ИЗ
	|	Справочник.Лико_Конверты КАК Лико_Конверты
	|ГДЕ
	|	Лико_Конверты.ЭтоГруппа
	|	И Лико_Конверты.ОрганизацияГруппы = &Организация ";
	ЗапросКонверты.УстановитьПараметр("Организация",Объект.Организация);
	РезультатЗапросаКонверты = ЗапросКонверты.Выполнить();
	Если Не РезультатЗапросаКонверты.Пустой() Тогда
		ВыборкаЗапросаКонверты = РезультатЗапросаКонверты.Выбрать();
		ВыборкаЗапросаКонверты.Следующий();
		
		ГруппаКонвертов = ВыборкаЗапросаКонверты.Ссылка;
		
	Иначе 	//запрос пуст!
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
	
	ОбновлениеОтображенияУПП();
	
КонецПроцедуры


&НаСервере
Процедура ПлощадкаПриИзмененииНаСервере()
	ОБъект.Организация = Объект.Площадка.Организация;
	ЗапросКонверты = Новый Запрос;
	ЗапросКонверты.Текст = 
	"ВЫБРАТЬ
	|	Лико_Конверты.Ссылка
	|ИЗ
	|	Справочник.Лико_Конверты КАК Лико_Конверты
	|ГДЕ
	|	Лико_Конверты.ЭтоГруппа
	|	И Лико_Конверты.ПлощадкаГруппы = &Площадка ";
	ЗапросКонверты.УстановитьПараметр("Площадка",Объект.Площадка);
	РезультатЗапросаКонверты = ЗапросКонверты.Выполнить();
	Если Не РезультатЗапросаКонверты.Пустой() Тогда
		ВыборкаЗапросаКонверты = РезультатЗапросаКонверты.Выбрать();
		ВыборкаЗапросаКонверты.Следующий();
		
		ГруппаКонвертов = ВыборкаЗапросаКонверты.Ссылка;
		
	Иначе 	//запрос пуст!
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	ПлощадкаПриИзмененииНаСервере();
	
	ОбновлениеОтображенияУПП();

КонецПроцедуры



