
//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	html= ПолучитьQRCode();
//    Если ЗначениеЗаполнено(html) Тогда
//	 QRCode=html;
//    КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Функция ПолучитьQRCode() //+Лико m.shenderov 04.04.2021
//КодРабочегоМеста=ПолучитьКодРабочегоМеста();
//Если Не ЗначениеЗаполнено(КодРабочегоМеста) Тогда 
//	  Возврат Неопределено;
//  КонецЕсли;
//  
//КодРабочегоМеста="ERP_mobile_"+КодРабочегоМеста;
//	
//Возврат	"<!DOCTYPE html>
//	|<html lang='en'>
//	|<head>
//	|<meta charset='UTF-8'>
//	|<meta name='viewport' content='width=device-width, initial-scale=1.0'>
//	|</head>
//	|<body>
//	|<div id='app'>
//	|   <div id='qrCodeOutput' class='text-center'>
//	|   </div>
//	|</div>
//	//|<script src='http://cosmic.mearie.org/2011/01/qrjs/qr.js'></script>
//	|<script src='http://it-mshenderov/js/qr.js'></script> 
//	|<script>
//	|        qrCodeOutput.append(QRCode.generateHTML('"
//	+КодРабочегоМеста +"', {}))
//	|</script>
//	|</body>
//	|</html>";
//	
//	
//КонецФункции  //-Лико m.shenderov 04.04.2021

Функция ПолучитьКодРабочегоМеста() //+Лико m.shenderov 05.04.2021
РМ=ПараметрыСеанса.Лико_РабочееМесто;
	Если ЗначениеЗаполнено(РМ.ИмяКомпьютера) ТОгда
	Возврат ПараметрыСеанса.Лико_РабочееМесто.Наименование;
КонецЕсли;

	
КонецФункции //-Лико m.shenderov 05.04.2021 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Лико_СерверВзаимодействияСервер.ВывестиUserQRCode(ЭтаФорма);
	//Подсистема WebSocket
	ПоказыватьQRCode=Истина;
	WebSocketСервер.Инициализация(ЭтаФорма,ПоказыватьQRCode);
	// Подсистема WebSocket
	
КонецПроцедуры



// Подсистема WebSocket
&НаКлиенте
Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	//WebSocketКлиент.СоздатьОбсуждение(ЭтаФорма,ДанныеСобытия);

	Если ВводДоступен() Тогда
	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);
	КонецЕсли; 
КонецПроцедуры
&НаКлиенте
Процедура  WebSocketДокументСформирован(Элемент)
	//WebSocketКлиент.СоздатьОбсуждение(ЭтаФорма); 
КонецПроцедуры

//4. В модуль формы добавить процедуру обработки штрих-кода(если надо): 	 
&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
	//ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;
КонецПроцедуры 

