
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.Наименование = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Наименование");
	Объект.Код = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Код");
	
КонецПроцедуры

&НаКлиенте
Процедура ПокрытиеРулонногоМатериалаПриИзменении(Элемент)
	
	Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ПокрытиеРулонногоМатериала,"Наименование") = "Без покрытия" Тогда
		Объект.КлейДляЛаминации = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Наименование") И Параметры.Свойство("СозданиеНовогоМатериала") И Параметры.СозданиеНовогоМатериала Тогда
		Элементы.Номенклатура.ТолькоПросмотр = Истина;
		Элементы.Псевдоним.ТолькоПросмотр = Истина;
		Объект.Наименование = Параметры.Наименование;
		НеПроверено = Справочники.Лико_РазрешеноНеПроверено.НеПроверено;
		Объект.КольеИлиМаленькийРадиус = НеПроверено;
		Объект.Этикетка = НеПроверено;
		Объект.ПЕФлакон = НеПроверено;
		Объект.ПослеЗаморозки = НеПроверено;
		Объект.ЧестныйЗнак = НеПроверено;
		СозданиеНовогоМатериала = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если СозданиеНовогоМатериала Тогда
		Закрыть(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Наименование = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Наименование");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Код = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Код");	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ГруппаМатериалов) И НЕ ЗначениеЗаполнено(Объект.Псевдоним) Тогда
		Объект.Псевдоним = СоздатьПсевдоним(Объект.ГруппаМатериалов);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПсевдоним(ГруппаМатериалов)

	ПсевдонимОбъект = Справочники.Лико_Псевдонимы.СоздатьЭлемент();
	ПсевдонимОбъект.ГруппаМатериала = ГруппаМатериалов;
	ПсевдонимОбъект.Записать();
	
	Возврат ПсевдонимОбъект.Ссылка;
	
КонецФункции
