
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура Лико_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	  СписокОбъектов.Добавить(Документы.Лико_ПодготовкаМатериалов);
	  СписокОбъектов.Добавить(Документы.Лико_ЗаказНаРаскрой);
      СписокОбъектов.Добавить(Документы.Лико_УстановкаВидаНастроечногоМатериала);
      СписокОбъектов.Добавить(Документы.Лико_ЗаявкаНаИзготовлениеФорм);
	   СписокОбъектов.Добавить(Документы.Лико_ФормированиеПаллета2_0);

	  //СписокОбъектов.Добавить(Документы.ЛикоРаспределениеРасходовПоЭтапам);
КонецПроцедуры
