
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Площадка=ПараметрыСеанса.ТекущийПользователь.Лико_Площадки.ВыгрузитьКолонку("Площадка");	
	УстановитьТекстЗапросаПланированиеЗаказов();
	
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("РабочийЦентр",РабочийЦентр);
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("НФ",Ложь);
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ФильтрПоВидуЗаказа",ЗначениеЗаполнено(ВидЗаказа));
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ВидЗаказа",ВидЗаказа);
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("Площадка",Площадка);
	
	
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("СВОДНО",Ложь);
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("СводноВсеРЦ",СводноВсеРЦ);	
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("РабочийЦентр",РабочийЦентр);
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("НФ",Ложь);
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ДатаКонтроляМатериала",ТекущаяДата()-48*3600);
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ФильтрПоВидуЗаказа",ЗначениеЗаполнено(ВидЗаказа));
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ВидЗаказа",ВидЗаказа);
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("Площадка",Площадка);
	
	
	
	Если  Параметры.Свойство("ПотребностиМатериалов") Тогда 
		НовыеЗаказы.ТекстЗапроса=НовыеЗаказыТекстЗапросаПотребностиМатериалов();
		ПланированиеЗаказов.ТекстЗапроса=ПланированиеЗаказовТекстЗапросаПотребностиМатериалов();
		ПотребностиМатериалов=Истина;
		
		//НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ПотребностиМатериалов"			,Истина);
		НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ПотребностьНоменклатура"			,Параметры.ПотребностьНоменклатура); 
		НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ПотребностьНарезка"				,Параметры.ПотребностьНарезка);
		НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ПотребностьЕстьНарезка"			,Параметры.ПотребностьЕстьНарезка);
		НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("Организация"				        ,Параметры.Организация);		
		
		//ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ПотребностиМатериалов"	,Истина);
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ПотребностьНоменклатура"			,Параметры.ПотребностьНоменклатура); 
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ПотребностьНарезка"				,Параметры.ПотребностьНарезка);
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ПотребностьЕстьНарезка"			,Параметры.ПотребностьЕстьНарезка);
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("Организация"				        ,Параметры.Организация); 		
	КонецЕсли;
	ПолучитьРабочиеЦентры();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРабочиеЦентры() //+Лико m.shenderov 19.12.2017
	УстановитьПривилегированныйРежим(Истина);
	Если ПотребностиМатериалов Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(Лико_ОтображениеРабочихЦентровРабочиеЦентры.НомерСтроки) КАК НомерСтроки,
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр.ПорядковыйНомер КАК Номер
	|ИЗ
	|	Справочник.Лико_ОтображениеРабочихЦентров.РабочиеЦентры КАК Лико_ОтображениеРабочихЦентровРабочиеЦентры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ОтображениеРабочихЦентров КАК Лико_ОтображениеРабочихЦентров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	|			ПО Лико_ОтображениеРабочихЦентров.Ссылка = ПользователиДополнительныеРеквизиты.Значение
	|				И (ПользователиДополнительныеРеквизиты.Свойство = &ПредопределенноеСвойство)
	|		ПО Лико_ОтображениеРабочихЦентровРабочиеЦентры.Ссылка = Лико_ОтображениеРабочихЦентров.Ссылка
	|ГДЕ
	|	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр,
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр.ПорядковыйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь );
	Запрос.УстановитьПараметр("ПредопределенноеСвойство",Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитПользователяОтображениеРабочихЦентров.ЗначениеПараметра );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивРЦ=Новый СписокЗначений;
	МассивКнопок=Новый СписокЗначений;
	
	ИмяРЦ="РЦСВОДНО";
	КомандаФормы  = Команды.Добавить(ИмяРЦ);
	КомандаФормы.Действие = "ПроцедураОбработкиНажатия";
	Элементы.Добавить(ИмяРЦ,Тип("КнопкаФормы"), Элементы.ГруппаРЦ);
	Элементы[ИмяРЦ].Заголовок =  "СВОДНО";
	Элементы[ИмяРЦ].ИмяКоманды = ИмяРЦ;
	Элементы[ИмяРЦ].Ширина = 19;
	Элементы[ИмяРЦ].Высота = 2;
	
	Н=0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.NewFoil Тогда
			Продолжить;
		КонецЕсли;
		Н=Н+1;	
		ИмяРЦ="РЦ"+Формат(Выборка.Номер,"ЧГ=0");
		КомандаФормы  = Команды.Добавить(ИмяРЦ);
		КомандаФормы.Действие = "ПроцедураОбработкиНажатия";
		Если Н<15 Тогда	
			Элементы.Добавить(ИмяРЦ,Тип("КнопкаФормы"), Элементы.ГруппаРЦ);
		Иначе
			Элементы.Добавить(ИмяРЦ,Тип("КнопкаФормы"), Элементы.ГруппаРЦ2);
			
		КонецЕсли;
		
		Элементы[ИмяРЦ].Заголовок =  Строка(Выборка.Номер);
		Элементы[ИмяРЦ].ИмяКоманды = ИмяРЦ;
		Элементы[ИмяРЦ].Ширина = 8;
		Элементы[ИмяРЦ].Высота = 2;
		//Если ПоступившиеРц.Свойство(ИмяРЦ) Тогда
		//	Количество= ПоступившиеРц[ИмяРЦ];
		//	Если Количество>0 Тогда
		//		
		//		
		//		Элементы[ИмяРЦ].Шрифт=Новый Шрифт(Элементы[ИмяРЦ].Шрифт,,,Истина); 
		//		Элементы[ИмяРЦ].ЦветТекста= WebЦвета.Красный;		
		//		
		//		//	Элементы[ИмяРЦ].Шрифт=Новый Шрифт(Кнопка.Шрифт,,,Истина); 
		//		//Элементы[ИмяРЦ].ЦветТекстаКнопки= WebЦвета.Красный;		
		//		
		//		
		//	КонецЕсли;
		//	
		//	
		//КонецЕсли;
		
		
		МассивРЦ.Добавить(Выборка.РабочийЦентр);
		МассивКнопок.Добавить(ИмяРЦ);
		
		
		
	КонецЦикла;
	
	ИмяРЦ="РЦNF";
	КомандаФормы  = Команды.Добавить(ИмяРЦ);
	КомандаФормы.Действие = "ПроцедураОбработкиНажатия";
	Элементы.Добавить(ИмяРЦ,Тип("КнопкаФормы"), Элементы.ГруппаРЦ);
	Элементы[ИмяРЦ].Заголовок =  "NF";
	Элементы[ИмяРЦ].ИмяКоманды = ИмяРЦ;
	Элементы[ИмяРЦ].Ширина = 8;
	Элементы[ИмяРЦ].Высота = 2;
	МассивКнопок.Добавить(ИмяРЦ);
	
	
	
	МассивРабочихЦентров=МассивРЦ;
	МассивКнопокРЦ=МассивКнопок;
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("РабочиеЦентры",МассивРабочихЦентров);	
	
КонецПроцедуры  //-Лико m.shenderov 19.12.2017

&НаКлиенте
Процедура УстановкаЦветаКнопокРЦ() //+Лико m.shenderov 22.12.2017
	Если ПотребностиМатериалов Тогда
		Возврат;
	КонецЕсли;
	
	ПоступившиеРц=ПоступившиеЗаказыПоРЦ();
	Для каждого ИмяРЦ Из МассивКнопокРЦ Цикл
		Заголовок=  Сред(ИмяРЦ,3,СтрДлина(ИмяРЦ));
		
		
		Если ПоступившиеРц.Свойство(Строка(ИмяРЦ)) Тогда
			Количество= ПоступившиеРц[Строка(ИмяРЦ)];
			Если Количество>0 Тогда 				
				
				Элементы[Строка(ИмяРЦ)].Шрифт=Новый Шрифт(Элементы[Строка(ИмяРЦ)].Шрифт,,,ложь); 
				Элементы[Строка(ИмяРЦ)].ЦветТекста= WebЦвета.Красный;		
				Элементы[Строка(ИмяРЦ)].Заголовок= Заголовок+"("+Строка(Количество)+")";
			КонецЕсли;
			
		Иначе
			Элементы[Строка(ИмяРЦ)].Шрифт=Новый Шрифт(Элементы[Строка(ИмяРЦ)].Шрифт,,,Ложь);
			Элементы[Строка(ИмяРЦ)].ЦветТекста= WebЦвета.Черный;
			Элементы[Строка(ИмяРЦ)].Заголовок= Заголовок;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //-Лико m.shenderov 22.12.2017



&НаКлиенте
Процедура ПроцедураОбработкиНажатия(Элемент)
	Если ЗначениеЗаполнено(ТекущаяКнопка) Тогда
		Элементы[ТекущаяКнопка].ЦветФона=	Элементы[Элемент.Имя].ЦветФона;
	КонецЕсли;
	ТекущаяКнопка=Элемент.Имя;
	Заголовок=  Сред(Элемент.Имя,3,СтрДлина(Элемент.Имя));
	Элементы[Элемент.Имя].ЦветФона =   Новый Цвет(200, 200, 255);
	Если Заголовок="СВОДНО" Тогда
		
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("СВОДНО",Истина);
		Сводно=Истина;
		//Элементы.ПланированиеЗаказовМетрыТиснения.Видимость=Истина;
		
	ИначеЕсли Заголовок="NF" Тогда
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("СВОДНО",Ложь);
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("НФ",Истина);
		НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("НФ",Истина);
		Сводно=Ложь;
		//Элементы.ПланированиеЗаказовМетрыТиснения.Видимость=Истина;
		РабочийЦентр=Неопределено;
	Иначе
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("СВОДНО",Ложь);
		ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("НФ",Ложь);
		НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("НФ",Ложь);
		//Элементы.ПланированиеЗаказовМетрыТиснения.Видимость=Ложь;
		
		Сводно=Ложь;	
		
		РабочийЦентр=ПолучитьСсылкуСправочника(Заголовок);
	КонецЕсли;
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("РабочийЦентр",РабочийЦентр);
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("РабочийЦентр",РабочийЦентр);
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ДатаКонтроляМатериала",ТекущаяДата()-48*3600);
	
	Элементы.НовыеЗаказы.Видимость= Не Сводно;
	// <-- Начало Лико Яцун С. В. 20.02.2024
	ДобавитьУсловноеОформлениеНарезка();
	// <-- Конец Лико Яцун С. В. 20.02.2024
КонецПроцедуры

&НаСервереБезКонтекста
ФУнкция ПолучитьСсылкуСправочника (Имя)
	Возврат Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер", Число(Имя));
	
КонецФункции

&НаКлиенте
Процедура НовыеЗаказыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Ааа=1;                    
	
КонецПроцедуры

&НаКлиенте
Процедура НовыеЗаказыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Ааа=1;
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеЗаказовПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПоступившиеЗаказыПоРЦ() //+Лико m.shenderov 22.12.2017
	НФ_Количество=0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
	|	ПооперационноеРасписание2_2.Этап КАК Этап,
	|	ПооперационноеРасписание2_2.Этап.Распоряжение КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
	|		ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
	|	КОНЕЦ КАК ЗаказКлиента,
	|	ПооперационноеРасписание2_2.Этап.НомерПроката КАК НомерПроката,
	|	ПооперационноеРасписание2_2.Начало КАК Начало,
	|	ПооперационноеРасписание2_2.Этап.ВидЭтапа КАК ВидЭтапа,
	|	ПооперационноеРасписание2_2.Окончание КАК Окончание,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.Выполняется = 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НаПроизводстве
	|ПОМЕСТИТЬ ВТ_ЗагрузкаРЦ
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Выполнено = 0
	|	И НЕ ПооперационноеРасписание2_2.Моделирование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(1) КАК Количество,
	|	ВТ_ЗагрузкаРЦ.РабочийЦентр.ПорядковыйНомер КАК РабочийЦентр,
	|	ВТ_ЗагрузкаРЦ.РабочийЦентр КАК РЦ
	|ИЗ
	|	ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Заказ
	|		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Заказ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПодготовленныеМатериалы КАК Лико_ПодготовленныеМатериалы
	|		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ПодготовленныеМатериалы.ЗаказКлиента
	|			И ВТ_ЗагрузкаРЦ.НомерПроката = Лико_ПодготовленныеМатериалы.НомерПроката
	|ГДЕ
	|	Лико_ПодготовленныеМатериалы.Регистратор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗагрузкаРЦ.РабочийЦентр.ПорядковыйНомер,
	|	ВТ_ЗагрузкаРЦ.РабочийЦентр";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Структура = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.РЦ.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.NewFoil Тогда
			НФ_Количество=  НФ_Количество+Выборка.Количество;
		Иначе
			Структура.Вставить("РЦ"+Формат(Выборка.РабочийЦентр,"ЧГ=0"),Выборка.Количество);
		КонецЕсли;
	КонецЦикла; 
	Если НФ_Количество>0 Тогда
		Структура.Вставить("РЦNF",НФ_Количество);
	КонецЕсли;
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 22.12.2017

&НаКлиенте
Процедура ПланированиеЗаказовОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	ААА=1;
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеЗаказовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для каждого СторкаЗаказа Из Элементы.НовыеЗаказы.ВыделенныеСтроки Цикл
		Данные=Элементы.НовыеЗаказы.ДанныеСтроки(СторкаЗаказа);
		Структура = Новый Структура;
		Структура.Вставить("ЗаказКлиента",Данные.Заказ);
		Структура.Вставить("НомерПроката",Данные.НомерПроката);
		Структура.Вставить("РабочийЦентр",Данные.РабочийЦентр);
		СоздатьРедактироватьДокументПодготовки(Структура);
		//Элементы.НовыеЗаказы.Обновить();
		//Элементы.ПланированиеЗаказов.Обновить();
		
	КонецЦикла;
	
	Элементы.НовыеЗаказы.Обновить();
	Элементы.ПланированиеЗаказов.Обновить();
	УстановкаЦветаКнопокРЦ() ;
	// <-- Начало Лико Яцун С. В. 20.02.2024
	ДобавитьУсловноеОформлениеНарезка(); 
	// <-- Конец Лико Яцун С. В. 20.02.2024
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьРедактироватьДокументПодготовки(Знач Структура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента
	|	И Лико_ПодготовкаМатериалов.НомерПроката = &НомерПроката";
	Запрос.УстановитьПараметр("ЗаказКлиента",Структура.ЗаказКлиента );
	Запрос.УстановитьПараметр("НомерПроката",Структура.НомерПроката );
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Документ=Документы.Лико_ПодготовкаМатериалов.СоздатьДокумент();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 		
		Документ=Выборка.Ссылка.ПолучитьОбъект();
		Документ.ПометкаУдаления=Ложь;  
	КонецЕсли;  
	
	
	
	Документ.Дата=ТекущаяДата();
	Документ.Заполнить(Структура);
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыеЗаказыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для каждого СторкаЗаказа Из Элементы.ПланированиеЗаказов.ВыделенныеСтроки Цикл
		Документ=СторкаЗаказа;
		УдалитьДокументНаСервере(Документ);
		//Элементы.НовыеЗаказы.Обновить();
		//Элементы.ПланированиеЗаказов.Обновить();
		УстановкаЦветаКнопокРЦ() 
	КонецЦикла;
	Элементы.НовыеЗаказы.Обновить();
	Элементы.ПланированиеЗаказов.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста

Процедура УдалитьДокументНаСервере(Документ) //+Лико m.shenderov 22.12.2017
	ДокументОбъект=Документ.ПолучитьОбъект();
	ДокументОбъект.СнятиеРезерва=Истина;
	ДокументОбъект.ПометкаУдаления=Истина;
	ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры  //-Лико m.shenderov 22.12.2017

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановкаЦветаКнопокРЦ() ;
КонецПроцедуры

&НаКлиенте
Процедура КопироватьОсновнойМатериал(Команда)
	КопированиеМатериала											=Истина;
	КопированиеДопМатериала											=Ложь;
	ПодготовкаМатериалаСсылка										=Элементы.ПланированиеЗаказов.ТекущаяСтрока;
	Элементы.ПланированиеЗаказовКопироватьОсновнойМатериал.Видимость=Ложь;
	Элементы.ПланированиеЗаказовКонтекстноеМенюКопироватьДопМатериал.Видимость=Ложь;
	
	Элементы.ПланированиеЗаказовВставить.Видимость					=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Вставить(Команда)
	Элементы.ПланированиеЗаказовКопироватьОсновнойМатериал.Видимость=Истина;
	Элементы.ПланированиеЗаказовВставить.Видимость=Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("КопированиеЗавершение", ЭтотОбъект);
	
	ТекстВопроса=?(КопированиеМатериала,"Копировать основной материал?" , "Копировать дополнительный материал?");
	
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса,РежимДиалогаВопрос.ДаНет, 60);
	
	
	
КонецПроцедуры

//Вынести в отдельную процедуру
&НаКлиенте
Процедура КопированиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Для каждого Данные Из Элементы.ПланированиеЗаказов.ВыделенныеСтроки Цикл 		
			СкопироватьРезервСервер(ПодготовкаМатериалаСсылка,Данные,КопированиеМатериала);
		КонецЦикла;
	КонецЕсли; 
	Элементы.ПланированиеЗаказов.ТекущаяСтрока=ПодготовкаМатериалаСсылка;
	КопированиеМатериала		=Ложь;
	КопированиеДопМатериала		=Ложь;
	
	Элементы.ПланированиеЗаказовКопироватьОсновнойМатериал.Видимость=Истина;
	Элементы.ПланированиеЗаказовКонтекстноеМенюКопироватьДопМатериал.Видимость=Истина;
	
	Элементы.ПланированиеЗаказовВставить.Видимость					=Ложь;
	Элементы.ПланированиеЗаказов.Обновить();	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СкопироватьРезервСервер(База,Приемник,Знач Основнойматериал) //+Лико m.shenderov 22.12.2017
	ДокументОбъект=Приемник.ПолучитьОбъект();
	Структура = Новый Структура;
	
	Если Основнойматериал Тогда
		Структура.Вставить("СтатьяЗатрат",Справочники.Лико_СтатьиЗатрат.ОсновнойМатериал);
	Иначе
		Структура.Вставить("СтатьяЗатрат",Справочники.Лико_СтатьиЗатрат.ДополнительныеМатериалы);
	КонецЕсли;
	
	НайденныеСтроки=База.Резервирование.НайтиСтроки(Структура);
	
	
	//ДокументОбъект.Резервирование.Загрузить(База.Резервирование.Выгрузить(НайденныеСтроки));
	
	Для каждого Стр Из НайденныеСтроки Цикл
		НоваяСтрокаРезервирования=ДокументОбъект.Резервирование.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРезервирования,Стр);
		
		
		НайденныеСтроки=Приемник.Материалы.НайтиСтроки(Структура);
		Количество=0;
		КоличествоУпаковок=0;
		Если НайденныеСтроки.Количество()>0 Тогда
			Количество=НайденныеСтроки[0].Количество;
			КоличествоУпаковок=НайденныеСтроки[0].КоличествоУпаковок;			
			НоваяСтрокаРезервирования.Количество= Количество;			
			НоваяСтрокаРезервирования.КоличествоУпаковок= КоличествоУпаковок;
			
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры  //-Лико m.shenderov 22.12.2017


&НаКлиенте
Процедура ПланированиеЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Ключ=Поле.Имя;
	Если Поле.Имя="ПланированиеЗаказовНаличиеМатериала" Или Поле.Имя="ПланированиеЗаказовДатаПриходаМатериала"  Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Ключ); 
		Если    Поле.Имя="ПланированиеЗаказовНаличиеМатериала" Тогда
			Реквизит="НаличиеМатериала";
			Подсказака="Введите наличие материала."
		ИначеЕсли   Поле.Имя="ПланированиеЗаказовДатаПриходаМатериала"  Тогда
			Реквизит="ДатаПриходаМатериалаТекст";
			Подсказака="Введите дату прихода материала."
			
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Реквизит); 
		
		ТекущееЗначение=ПолучитьЗначениеСервер(Элементы.ПланированиеЗаказов.ТекущаяСтрока,Реквизит); 
		
		ОписаниеОповещения= Новый ОписаниеОповещения("РедактированиеРеквизитаЗавершение",ЭтаФорма,Структура);
		ПоказатьВводСтроки(ОписаниеОповещения,ТекущееЗначение,Подсказака);
	ИначеЕсли Поле.Имя="ПланированиеЗаказовНомерЗаказа" Тогда
		
		//+ Лико m.shenderov 07.05.2018
		//СтандартнаяОбработка = Ложь;
		
		//ПараметрыОткрытия = СформироватьПараметрыОткрытияДляПечатнойФормыОБЗ(Элементы.ПланированиеЗаказов.ТекущиеДанные.Заказ);
		ПараметрыОткрытия = СформироватьПараметрыОткрытияДляПечатнойФормыВБЗ(Элементы.ПланированиеЗаказов.ТекущиеДанные.Заказ);

		
		Если ПараметрыОткрытия = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
		
		//- Лико m.shenderov 07.05.2018
		
		
		//
		//Структура = Новый Структура;
		//Структура.Вставить("Ключ",Элементы.ПланированиеЗаказов.ТекущиеДанные.Заказ);
		//
		//ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта",СТруктура,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Поле.Имя="ПланированиеЗаказовЕстьФормы" 	Тогда
		
		ЕстьФорма(Элементы.ПланированиеЗаказов.ТекущаяСтрока);
		Элементы.ПланированиеЗаказов.Обновить();
		
		
	Иначе
		
		ОписаниеОповещения= Новый ОписаниеОповещения("ПланированиеЗаказовВыборЗавершение",ЭтаФорма);
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Элементы.ПланированиеЗаказов.ТекущаяСтрока);
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.ФормаОбъекта",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЗначениеСервер(Док,Реквизит) //+Лико m.shenderov 12.01.2018
	
	Возврат Док[Реквизит];	
	
КонецФункции  //-Лико m.shenderov 12.01.2018
&НаКлиенте
Процедура РедактированиеРеквизитаЗавершение(РезультатФормы,ПараметрФормы) Экспорт//+Лико m.shenderov 12.01.2018
	Если РезультатФормы=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	РедактироватьРеквизитСервер(Элементы.ПланированиеЗаказов.ТекущаяСтрока,ПараметрФормы.Ключ,РезультатФормы);
	
	Элементы.ПланированиеЗаказов.Обновить();
	
КонецПроцедуры //-Лико m.shenderov 12.01.2018

&НаСервере
Процедура РедактироватьРеквизитСервер(Док,Реквизит,Значение) //+Лико m.shenderov 12.01.2018
	ДОкОбъект=Док.ПолучитьОбъект();
	ДокОбъект[Реквизит]=Значение;
	ДОкОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры  //-Лико m.shenderov 12.01.2018




&НаКлиенте
Процедура ПланированиеЗаказовВыборЗавершение(РезультатФормы,ПараметрыФормы)Экспорт //+Лико m.shenderov 24.12.2017
	Элементы.ПланированиеЗаказов.ТекущаяСтрока=Неопределено;	
КонецПроцедуры //-Лико m.shenderov 24.12.2017


&НаКлиенте
Процедура КопироватьДопМатериал(Команда)
	КопированиеМатериала											=Ложь;
	КопированиеДопМатериала											=Истина;
	ПодготовкаМатериалаСсылка										=Элементы.ПланированиеЗаказов.ТекущаяСтрока;
	Элементы.ПланированиеЗаказовКопироватьОсновнойМатериал.Видимость=Ложь;
	Элементы.ПланированиеЗаказовКонтекстноеМенюКопироватьДопМатериал.Видимость=Ложь;
	
	Элементы.ПланированиеЗаказовВставить.Видимость					=Истина;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВидОкна(Команда)
	//ЭтаФорма.Ввар	ВариантМасштабаФормКлиентскогоПриложения
КонецПроцедуры


&НаКлиенте
Процедура ВставитьНаличиеМатериала(Команда)
	Наличие = ПолучитьТекстИзБуфераОбмена();
	Для Каждого Док Из Элементы.ПланированиеЗаказов.ВыделенныеСтроки Цикл		
		ЗаписатьНаСервереНаличие(Док,Наличие);
	КонецЦикла;
	Элементы.ПланированиеЗаказов.Обновить();	
	Элементы.ПланированиеЗаказов.ТекущаяСтрока=Неопределено;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервереНаличие(Док,Наличие) //+Лико m.shenderov 24.12.2017
	ДокументОбъект=Док.ПолучитьОбъект();
	ДокументОбъект.НаличиеМатериала=Наличие;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры  //-Лико m.shenderov 24.12.2017


&НаКлиенте 
Функция ПолучитьТекстИзБуфераОбмена() Экспорт
	#Если Клиент Тогда
		мОбъект = Новый COMОбъект("htmlfile");
		Возврат мОбъект.ParentWindow.ClipboardData.Getdata("Text");
	#КонецЕсли
КонецФункции

&НаКлиенте
Процедура ВосстановитьИнформацию(Команда)
	
	Для Каждого Док Из Элементы.ПланированиеЗаказов.ВыделенныеСтроки Цикл		
		ЗаписатьНаСервереВосстановление(Док);
	КонецЦикла;
	Элементы.ПланированиеЗаказов.Обновить();	
	Элементы.ПланированиеЗаказов.ТекущаяСтрока=Неопределено;	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьНаСервереВосстановление(Док) //+Лико m.shenderov 24.12.2017
	ДокументОбъект=Док.ПолучитьОбъект();
	ДокументОбъект.НаличиеМатериала = ""; 
	ДокументОбъект.ДатаПриходаМатериалаТекст = "";
	ДокументОбъект.ДатаПроверкиНаличияМатериала = '00010101000000';
	ДокументОбъект.МатериалЗамена = "";
	ДокументОбъект.ЗаменаНарезки = "";
	ДокументОбъект.ДополнительныеМатериалыСтрокойЗамена = "";
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры  //-Лико m.shenderov 24.12.2017


&НаКлиенте
Процедура ВставитьДатуПрихода(Команда)
	ДатаПрихода = ПолучитьТекстИзБуфераОбмена();
	Для Каждого Док Из Элементы.ПланированиеЗаказов.ВыделенныеСтроки Цикл		
		ЗаписатьНаСервереДатауПрихода(Док,ДатаПрихода);
	КонецЦикла;
	Элементы.ПланированиеЗаказов.Обновить();	
	Элементы.ПланированиеЗаказов.ТекущаяСтрока=Неопределено;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервереДатауПрихода(Док,ДатаПрихода) //+Лико m.shenderov 24.12.2017
	ДокументОбъект=Док.ПолучитьОбъект();
	ДокументОбъект.ДатаПриходаМатериалаТекст=ДатаПрихода;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры  //-Лико m.shenderov 24.12.2017


&НаКлиенте
Процедура ПланированиеЗаказовПриАктивизацииПоля(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПланированиеЗаказовПриАктивизацииСтроки(Элемент)
	Метраж=0;
	МетражОбщий=0;
	Для каждого СтрокаЗаказа Из Элементы.ПланированиеЗаказов.ВыделенныеСтроки Цикл
		Данные= Элементы.ПланированиеЗаказов.ДанныеСтроки(СтрокаЗаказа);
		Метраж=Метраж+Данные.МетражПМ;
		МетражОбщий=МетражОбщий+Данные.МетражОбщий;
	КонецЦикла;
	ТекСтрока=Элементы.ПланированиеЗаказов.ТекущиеДанные;
	Если  ТекСтрока<>Неопределено Тогда
		Комментарий=ПолучитьКомментарийПоЗаказу(ТекСтрока.Заказ);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТребованиеНакладная(Команда)
	ВыполняемаяОбработка=НайтиПФ("Печатная форма документа ""Требование накладная подготовка""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Элементы.ПланированиеЗаказов.ТекущаяСтрока);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ТребованиеНакладная_Подготовка";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура РезервПодЗаказ(Команда)
	ВыполняемаяОбработка=НайтиПФ("Печатная форма документа ""Резерв материалов под заказ""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Элементы.ПланированиеЗаказов.ТекущаяСтрока);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="РезервМатериаловПодЗаказ";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиПФ(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции

&НаКлиенте
Процедура КомандаРазмер(Команда)
	Элементы.ПланированиеЗаказовВремяНачала.Ширина=1;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОстаткам(Команда)
	Лико_СкладыКлиент.ОткрытьОтчетПоОстаткам(Элементы.ПланированиеЗаказов.ТекущиеДанные);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКомпановщик() //+Лико m.shenderov 26.12.2017
	СхемаКомпоновкиДанных = Отчеты.ЛикоОстаткиТоваров.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Возврат КомпоновщикНастроек;
	
КонецФункции  //-Лико m.shenderov 26.12.2017

&НаКлиенте
Процедура ОстаткиСводный(Команда)
	ОткрытьФорму("Отчет.ОстаткиСводный.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	Элементы.ПланированиеЗаказов.Обновить();
		Элементы.НовыеЗаказы.Обновить();

	УстановкаЦветаКнопокРЦ();
	// <-- Начало Лико Яцун С. В. 20.02.2024 0
	ДобавитьУсловноеОформлениеНарезка();
	// <-- Конец Лико Яцун С. В. 20.02.2024	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьКомментарийПоЗаказу(Заказ) //+Лико m.shenderov 20.01.2018
	
	Возврат Заказ.Комментарий;
	
КонецФункции  //-Лико m.shenderov 20.01.2018

&НаКлиенте
Процедура НовыеЗаказыПриАктивизацииСтроки(Элемент)
	ТекСтрока=Элементы.НовыеЗаказы.ТекущиеДанные;
	Если  ТекСтрока<>Неопределено Тогда
		Комментарий=ПолучитьКомментарийПоЗаказу(ТекСтрока.Заказ);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПодготовкаЗаказПоВсемМашинамНаСервере(ТабличныйДокумент,РЦ=Неопределено)
	Если Рц=Неопределено Тогда
		РЦ=Справочники.РабочиеЦентры.ПустаяСсылка();
	КонецЕсли;
	
	ТабДокумент = ТабличныйДокумент;
	
	Макет = ОБработки.Лико_ПодготовкаЗаказов.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
	|	ПооперационноеРасписание2_2.Этап КАК Этап,
	|	ПооперационноеРасписание2_2.Этап.Распоряжение КАК ЗаказНаПроизводство,
	|	ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование КАК ЗаказКлиента,
	|	ПооперационноеРасписание2_2.Этап.НомерПроката КАК НомерПроката,
	|	ПооперационноеРасписание2_2.Начало КАК Начало,
	|	ПооперационноеРасписание2_2.Этап.ВидЭтапа КАК ВидЭтапа,
	|	ПооперационноеРасписание2_2.Окончание КАК Окончание,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.Выполняется > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НаПроизводстве
	|ПОМЕСТИТЬ ВТ_ЗагрузкаРЦ
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Выполнено = 0
	|	И НЕ ПооперационноеРасписание2_2.Моделирование
	|	И ВЫБОР
	|			КОГДА &РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|				ТОГДА НЕ ПооперационноеРасписание2_2.РабочийЦентр.ВидРабочегоЦентра В (&Индиго, &Омега, &НьюФ)
	|			ИНАЧЕ ПооперационноеРасписание2_2.РабочийЦентр = &РабочийЦентр
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЗагрузкаРЦ.ЗаказКлиента КАК Заказ,
	|	ЗаказКл.НомерБезПрефикса КАК НомерЗаказа,
	|	ВТ_ЗагрузкаРЦ.НомерПроката КАК НомерПроката,
	|	ВТ_ЗагрузкаРЦ.ЗаказКлиента.Партнер КАК Заказчик,
	|	ЗаказКл.Этикетки КАК Этикетки,
	|	ЗаказКл.МетражКВМ КАК МетражКВМ,
	|	ЗаказКл.МетражПМ КАК МетражПМ,
	|	ЗаказКл.Z КАК Z,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.МатериалЗамена, """") = """"
	|			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.МатериалЗамена
	|	КОНЕЦ КАК Материал,
	|	ЗаказКл.ПоставщикМатериалаЛюбой КАК ПоставщикЛюбой,
	|	ЗаказКл.ШтампыСтрокой КАК ШтампыСтрокой,
	|	ЗаказКл.ШтампВырубной КАК ШтампВырубной,
	|	ЗаказКл.ЦветаСтрокой КАК ЦветаСтрокой,
	|	ЗаказКл.Регион КАК Регион,
	|	ВТ_ЗагрузкаРЦ.Начало КАК ВремяНачала,
	|	ВТ_ЗагрузкаРЦ.РабочийЦентр КАК РабочийЦентр,
	|	ЗаказКл.ДатаОтгрузки КАК СрокСдачи,
	|	ВТ_ЗагрузкаРЦ.Окончание КАК ВремяОкончания,
	|	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ.Начало, ВТ_ЗагрузкаРЦ.Окончание, ЧАС) КАК ВремяВыполнения,
	|	ВТ_ЗагрузкаРЦ.НаПроизводстве КАК Выполняется,
	|	ЗаказКл.ВидЗаказа КАК ВидЗаказа,
	|	ЗаказКл.ФормыСтрокой КАК ФормыСтрокой,
	|	ЗаказКл.Ручьи КАК Ручьи,
	|	ЗаказКл.ШагПечати КАК ШагПечати,
	|	ЗаказКл.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	ЗаказКл.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	ЗаказКл.ПлощадьКлише КАК ПлощадьКлише,
	|	ЗаказКл.СрочноеЦветоделение КАК СрочноеЦветоделение,
	|	ЗаказКл.Тираж КАК Тираж,
	|	ЗаказКл.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
	|	ЗаказКл.БезЛака КАК БезЛака,
	|	ВТ_ЗагрузкаРЦ.Этап КАК Этап,
	|	ВТ_ЗагрузкаРЦ.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВТ_ЗагрузкаРЦ.ВидЭтапа КАК ВидЭтапа,
	|	ЗаказКл.Площадка КАК Площадка,
	|	Лико_ПодготовленныеМатериалы.ДатаПроверкиНаличияМатериала КАК ДатаПроверкиНаличияМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаМатериала КАК ЗаменаМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаНарезки КАК ЗаменаНарезки,
	|	Лико_ПодготовленныеМатериалы.ЗаменаДопМатериалов КАК ЗаменаДопМатериалов,
	|	Лико_ПодготовленныеМатериалы.НаличиеМатериала КАК НаличиеМатериала,
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК МетражОбщий,
	|	ВЫБОР
	|		КОГДА ЗаказКл.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЗаказКл.ОсновнойМатериал.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Артикул,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.НарезкаЗамена, """") = """"
	|			ТОГДА Лико_ПодготовкаМатериалов.Нарезка
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.НарезкаЗамена
	|	КОНЕЦ КАК Нарезка,
	|	Лико_ПодготовкаМатериалов.ДатаПриходаМатериалаТекст КАК ДатаПриходаМатериала,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена, """") = """"
	|			ТОГДА ЗаказКл.ДопМатериалыСтрокой
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена
	|	КОНЕЦ КАК ДопМатериалы,
	|	СУММА(ЕСТЬNULL(Лико_МатериалыВРезерве.Количество, 0)) КАК КоличествоВРезерве,
	|	ВЫРАЗИТЬ(&ДатаКонтроляМатериала КАК ДАТА) КАК ДатаКонтроляМатериала,
	|	Лико_ПодготовкаМатериалов.СнятиеРезерва КАК СнятиеРезерва,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НФ,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал.ОсновнаяНоменклатура
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ЭтапыЗаказа.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.Производство)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НаПроизводстве,
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКл
	|		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = ЗаказКл.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПодготовленныеМатериалы КАК Лико_ПодготовленныеМатериалы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве КАК Лико_МатериалыВРезерве
	|				ПО Лико_ПодготовкаМатериалов.Ссылка = Лико_МатериалыВРезерве.Регистратор
	|			ПО Лико_ПодготовленныеМатериалы.Регистратор = Лико_ПодготовкаМатериалов.Ссылка
	|		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ПодготовленныеМатериалы.ЗаказКлиента
	|			И ВТ_ЗагрузкаРЦ.НомерПроката = Лико_ПодготовленныеМатериалы.НомерПроката
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ПО ВТ_ЗагрузкаРЦ.РабочийЦентр = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр
	|			И ВТ_ЗагрузкаРЦ.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	|			И ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ПараметрыПроизводстваЗаказа.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
	|		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ЭтапыЗаказа.Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ОтображениеРабочихЦентров.РабочиеЦентры КАК Лико_ОтображениеРабочихЦентровРабочиеЦентры
	|		ПО ВТ_ЗагрузкаРЦ.РабочийЦентр = Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Сводно
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &НФ
	|						ТОГДА ВТ_ЗагрузкаРЦ.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|					ИНАЧЕ ВТ_ЗагрузкаРЦ.РабочийЦентр = &РабочийЦентр
	|				КОНЕЦ
	|		КОНЕЦ
	|	И Лико_ОтображениеРабочихЦентровРабочиеЦентры.Ссылка = &ОтображениеРабочегоЦентра
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗагрузкаРЦ.ЗаказКлиента,
	|	ЗаказКл.НомерБезПрефикса,
	|	ВТ_ЗагрузкаРЦ.НомерПроката,
	|	ВТ_ЗагрузкаРЦ.ЗаказКлиента.Партнер,
	|	ЗаказКл.Этикетки,
	|	ЗаказКл.МетражКВМ,
	|	ЗаказКл.МетражПМ,
	|	ЗаказКл.Z,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.МатериалЗамена, """") = """"
	|			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.МатериалЗамена
	|	КОНЕЦ,
	|	ЗаказКл.ПоставщикМатериалаЛюбой,
	|	ЗаказКл.ШтампыСтрокой,
	|	ЗаказКл.ШтампВырубной,
	|	ЗаказКл.ЦветаСтрокой,
	|	ЗаказКл.Регион,
	|	ВТ_ЗагрузкаРЦ.Начало,
	|	ВТ_ЗагрузкаРЦ.РабочийЦентр,
	|	ЗаказКл.ДатаОтгрузки,
	|	ВТ_ЗагрузкаРЦ.Окончание,
	|	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ.Начало, ВТ_ЗагрузкаРЦ.Окончание, ЧАС),
	|	ВТ_ЗагрузкаРЦ.НаПроизводстве,
	|	ЗаказКл.ВидЗаказа,
	|	ЗаказКл.ФормыСтрокой,
	|	ЗаказКл.Ручьи,
	|	ЗаказКл.ШагПечати,
	|	ЗаказКл.ДлинаЭтикетки,
	|	ЗаказКл.ШиринаЭтикетки,
	|	ЗаказКл.ПлощадьКлише,
	|	ЗаказКл.СрочноеЦветоделение,
	|	ЗаказКл.Тираж,
	|	ЗаказКл.ДатаУтвержденияРабот,
	|	ЗаказКл.БезЛака,
	|	ВТ_ЗагрузкаРЦ.Этап,
	|	ВТ_ЗагрузкаРЦ.ЗаказНаПроизводство,
	|	ВТ_ЗагрузкаРЦ.ВидЭтапа,
	|	ЗаказКл.Площадка,
	|	Лико_ПодготовленныеМатериалы.ДатаПроверкиНаличияМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаНарезки,
	|	Лико_ПодготовленныеМатериалы.ЗаменаДопМатериалов,
	|	Лико_ПодготовленныеМатериалы.НаличиеМатериала,
	|	Лико_ПодготовкаМатериалов.Ссылка,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКл.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЗаказКл.ОсновнойМатериал.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.НарезкаЗамена, """") = """"
	|			ТОГДА Лико_ПодготовкаМатериалов.Нарезка
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.НарезкаЗамена
	|	КОНЕЦ,
	|	Лико_ПодготовкаМатериалов.ДатаПриходаМатериалаТекст,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена, """") = """"
	|			ТОГДА ЗаказКл.ДопМатериалыСтрокой
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена
	|	КОНЕЦ,
	|	Лико_ПодготовкаМатериалов.СнятиеРезерва,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал.ОсновнаяНоменклатура
	|	КОНЕЦ,
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_ОтображениеРабочихЦентровРабочиеЦентры.НомерСтроки,
	|	ВремяНачала
	|ИТОГИ ПО
	|	РабочийЦентр";
	Запрос.УстановитьПараметр("СВОДНО",Истина);		
	Запрос.УстановитьПараметр("РабочийЦентр",РЦ);	
	Запрос.УстановитьПараметр("ДатаКонтроляМатериала",ТекущаяДата()-48*3600);
	Запрос.УстановитьПараметр("НФ",Ложь);
	Запрос.УстановитьПараметр("Индиго",Справочники.ВидыРабочихЦентров.Indigo);
	Запрос.УстановитьПараметр("Омега",Справочники.ВидыРабочихЦентров.Omega);
	Запрос.УстановитьПараметр("НьюФ",Справочники.ВидыРабочихЦентров.NewFoil);
	Запрос.УстановитьПараметр("ОтображениеРабочегоЦентра",
	Справочники.Лико_ОтображениеРабочихЦентров.НайтиПоНаименованию(УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,
	Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитПользователяОтображениеРабочихЦентров.ЗначениеПараметра)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	
	
	
	
	//Запрос.Текст = ПолучитьЗапросРЦ(строка, добавка);
	//Запрос.УстановитьПараметр("ВключенВплан", Истина);
	//Запрос.УстановитьПараметр("Площадка", Площадка);
	//Запрос.УстановитьПараметр("Пользователь", глЗначениеПеременной("ГлТекущийПользователь"));
	
	
	ВыборкаРЦ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "РабочийЦентр");
	Пока выборкаРЦ.Следующий() Цикл
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.РабочийЦентр = ВыборкаРЦ.РабочийЦентр.ПорядковыйНомер;
		ОбластьШапка.Параметры.Дата = ТекущаяДата();
		ТабДокумент.Вывести(ОбластьШапка);
		Выборка = ВыборкаРЦ.Выбрать();
		Пока выборка.Следующий() Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			Областьстрока.Параметры.Заполнить(выборка);
			Если Выборка.ЗаменаМатериала Тогда 
				Материал = Выборка.Материал ;
			иначе 
				Материал = Выборка.Материал ;
			КонецЕсли;	
			Если Выборка.ЗаменаНарезки Тогда 
				ОбластьСтрока.Параметры.Нарезка = Выборка.Нарезка  ;
			иначе 
				ОбластьСтрока.Параметры.Нарезка = Выборка.Нарезка ;
			КонецЕсли;	
			Если Выборка.ЗаменаДопМатериалов Тогда 
				ДопМатериалы = Выборка.ДопМатериалы ;
			иначе 
				ДопМатериалы = Выборка.ДопМатериалы ;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ДопМатериалы)  Тогда 
				ОбластьСтрока.Параметры.Материал = Строка(Материал)+" "+ДопМатериалы;
			Иначе
				ОбластьСтрока.Параметры.Материал = Материал;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	Конеццикла;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ЭкземпляровНаСтранице=1;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПодготовкаЗаказПоВсемМашинам(Команда)
	ТабличныйДокумент= Новый ТабличныйДокумент;
	ПодготовкаЗаказПоВсемМашинамНаСервере(ТабличныйДокумент);
	
	ТабличныйДокумент.Показать();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготоваЗаказаПоМашине(Команда)
	ТабличныйДокумент= Новый ТабличныйДокумент;
	ПодготовкаЗаказПоВсемМашинамНаСервере(ТабличныйДокумент,РабочийЦентр);
	
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура Этапы1с(Команда)
	
	Если Элементы.ПланированиеЗаказов.ТекущиеДанные<>Неопределено Тогда
		
		ЗаказКлиента = Элементы.ПланированиеЗаказов.ТекущиеДанные.Заказ;
		
		Отбор = Новый Структура("Заказ", ЗаказКлиента);
		ПараметрыФормы = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.Лико_ЭтапыЗаказа.ФормаСписка", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

//+ Лико m.shenderov 07.05.2018
&НаСервере
Функция СформироватьПараметрыОткрытияДляПечатнойФормыОБЗ(ЗаказКлиента)
	
	Обработка = Справочники.Лико_ПредопределенныеЗначения.ВнешняяПечатнаяФормаОБЗ.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(Обработка) Тогда
		Сообщить("В системе не зарегистрирована печатная форма ""ОБЗ"" или она не заполнена в справочнике предопределенных значений.");
		Возврат Неопределено;
	КонецЕсли;
	Если Обработка.Команды.Количество() = 0 Тогда
		Сообщить("В печатной форме ""ОБЗ"" не найдено команд печати.");
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторКоманды = Обработка.Команды[0].Идентификатор;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ЗаказКлиента);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
	ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения,НеПечататьСразуНаПринтер", ИдентификаторКоманды, МассивОбъектов,Истина));
	
	ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
	
	Возврат ПараметрыОткрытия;	
	
КонецФункции  

&НаСервере
Функция СформироватьПараметрыОткрытияДляПечатнойФормыВБЗ(Заказ)
	
	Обработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ВнутреннийБланкЗаказаЕРП");
	Если НЕ ЗначениеЗаполнено(Обработка) Тогда
		Сообщить("В системе не зарегистрирована печатная форма с именем объекта ""ВнутреннийБланкЗаказаЕРП""");
		Возврат Неопределено;
	КонецЕсли;
	Если Обработка.Команды.Количество() = 0 Тогда
		Сообщить("В печатной форме ""ВнутреннийБланкЗаказаЕРП"" не найдено команд печати.");
		Возврат Неопределено;
	КонецЕсли;
	
	//Команда = Обработка.Команды.Найти(Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода, "ВариантЗапуска");
	//Если Команда = Неопределено Тогда
	
	ИдентификаторКоманды = Обработка.Команды[0].Идентификатор;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Заказ);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
	ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения,НеПечататьСразуНаПринтер", ИдентификаторКоманды, МассивОбъектов,Истина));
	ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);

	Возврат ПараметрыОткрытия;	
	
КонецФункции


//- Лико m.shenderov 07.05.2018

&НаСервере
Процедура ЕстьФорма(Док) //+Лико m.shenderov 18.05.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента";
	Запрос.УстановитьПараметр("ЗаказКлиента",Док.ЗаказКлиента );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект=Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ЕстьФормы=Не ДокументОбъект.ЕстьФормы;
		ДокументОбъект.Записать();
		
		
	КонецЦикла; 
	
КонецПроцедуры //-Лико m.shenderov 18.05.2018

&НаКлиенте
Процедура ПланированиеЗаказовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	а=1;
КонецПроцедуры


&НаКлиенте
Процедура СводноВсеРЦПриИзменении(Элемент)
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("СводноВсеРЦ",СводноВсеРЦ); 
КонецПроцедуры

&НаСервере
Процедура ВидЗаказаПриИзмененииНаСервере()
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ФильтрПоВидуЗаказа",ЗначениеЗаполнено(ВидЗаказа));
	НовыеЗаказы.Параметры.УстановитьЗначениеПараметра("ВидЗаказа",ВидЗаказа);
	
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ФильтрПоВидуЗаказа",ЗначениеЗаполнено(ВидЗаказа));
	ПланированиеЗаказов.Параметры.УстановитьЗначениеПараметра("ВидЗаказа",ВидЗаказа);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	ВидЗаказаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КартаПерерасхода(Команда)
	ВыполняемаяОбработка=НайтиПФ("Печатная форма ""Бланк снятия перерасхода""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.ПланированиеЗаказов.ТекущаяСтрока,"ЗаказКлиента"));
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ПечатнаяФормаБланкСнятияПерерасхода";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	ПараметрыОткрытия.ПараметрыИсточника.вставить("сообщение", "привет");
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
	
	
КонецПроцедуры

&НаСервере
Функция НовыеЗаказыТекстЗапросаПотребностиМатериалов() //+Лико m.shenderov 09.10.2019


	  Возврат  "ВЫБРАТЬ
	           |	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
	           |	ПооперационноеРасписание2_2.Этап КАК Этап,
	           |	ПооперационноеРасписание2_2.Этап.Распоряжение КАК ЗаказНаПроизводство,
	           |	ВЫБОР
	           |		КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
	           |			ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
	           |		ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
	           |	КОНЕЦ КАК ЗаказКлиента,
	           |	ПооперационноеРасписание2_2.Этап.НомерПроката КАК НомерПроката,
	           |	ПооперационноеРасписание2_2.Начало КАК Начало,
	           |	ПооперационноеРасписание2_2.Этап.ВидЭтапа КАК ВидЭтапа,
	           |	ПооперационноеРасписание2_2.Окончание КАК Окончание,
	           |	ВЫБОР
	           |		КОГДА ПооперационноеРасписание2_2.Выполняется = 1
	           |			ТОГДА ИСТИНА
	           |		ИНАЧЕ ЛОЖЬ
	           |	КОНЕЦ КАК НаПроизводстве
	           |ПОМЕСТИТЬ ВТ_ЗагрузкаРЦ
	           |ИЗ
	           |	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	           |ГДЕ
	           |	ПооперационноеРасписание2_2.Выполнено = 0
	           |	И ПооперационноеРасписание2_2.Этап.Организация = &Организация
	           |	И НЕ ПооперационноеРасписание2_2.Моделирование
	           |;
	           |
	           |////////////////////////////////////////////////////////////////////////////////
	           |ВЫБРАТЬ
	           |	ВТ_ЗагрузкаРЦ.ЗаказКлиента КАК Заказ,
	           |	Заказ.НомерБезПрефикса КАК НомерЗаказа,
	           |	ВТ_ЗагрузкаРЦ.НомерПроката КАК НомерПроката,
	           |	ВТ_ЗагрузкаРЦ.ЗаказКлиента.Партнер КАК Заказчик,
	           |	Заказ.Этикетки КАК Этикетки,
	           |	Заказ.МетражКВМ КАК МетражКВМ,
	           |	Заказ.МетражПМ КАК МетражПМ,
	           |	Заказ.Нарезка КАК Нарезка,
	           |	Заказ.Z КАК Z,
	           |	ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал КАК Материал,
	           |	Заказ.ПоставщикМатериалаЛюбой КАК ПоставщикЛюбой,
	           |	Заказ.ШтампыСтрокой КАК ШтампыСтрокой,
	           |	Заказ.ШтампВырубной КАК ШтампВырубной,
	           |	Заказ.ЦветаСтрокой КАК ЦветаСтрокой,
	           |	Заказ.Регион КАК Регион,
	           |	ВТ_ЗагрузкаРЦ.Начало КАК ВремяНачала,
	           |	ВТ_ЗагрузкаРЦ.РабочийЦентр КАК РабочийЦентр,
	           |	Заказ.ДатаОтгрузки КАК СрокСдачи,
	           |	ВТ_ЗагрузкаРЦ.Окончание КАК ВремяОкончания,
	           |	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ.Начало, ВТ_ЗагрузкаРЦ.Окончание, ЧАС) КАК ВремяВыполнения,
	           |	ВТ_ЗагрузкаРЦ.НаПроизводстве КАК НаПроизводстве,
	           |	Заказ.ВидЗаказа КАК ВидЗаказа,
	           |	Заказ.ФормыСтрокой КАК ФормыСтрокой,
	           |	Заказ.Ручьи КАК Ручьи,
	           |	Заказ.ШагПечати КАК ШагПечати,
	           |	Заказ.ДлинаЭтикетки КАК ДлинаЭтикетки,
	           |	Заказ.ШиринаЭтикетки КАК ШиринаЭтикетки,
	           |	Заказ.ПлощадьКлише КАК ПлощадьКлише,
	           |	Заказ.СрочноеЦветоделение КАК СрочноеЦветоделение,
	           |	Заказ.Тираж КАК Тираж,
	           |	Заказ.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
	           |	Заказ.БезЛака КАК БезЛака,
	           |	ВТ_ЗагрузкаРЦ.Этап КАК Этап,
	           |	ВТ_ЗагрузкаРЦ.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	           |	ВТ_ЗагрузкаРЦ.ВидЭтапа КАК ВидЭтапа,
	           |	Заказ.Площадка КАК Площадка
	           |ПОМЕСТИТЬ Вт
	           |ИЗ
	           |	ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Заказ
	           |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Заказ.Ссылка
	           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПодготовленныеМатериалы КАК Лико_ПодготовленныеМатериалы
	           |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ПодготовленныеМатериалы.ЗаказКлиента
	           |			И ВТ_ЗагрузкаРЦ.НомерПроката = Лико_ПодготовленныеМатериалы.НомерПроката
	           |ГДЕ
	           |	Лико_ПодготовленныеМатериалы.Регистратор ЕСТЬ NULL
	           |	И ВЫБОР
	           |			КОГДА &ФильтрПоВидуЗаказа
	           |				ТОГДА Заказ.ВидЗаказа = &ВидЗаказа
	           |			ИНАЧЕ ИСТИНА
	           |		КОНЕЦ
	           |;
	           |
	           |////////////////////////////////////////////////////////////////////////////////
	           |ВЫБРАТЬ РАЗЛИЧНЫЕ
	           |	Вт.Заказ КАК Заказ,
	           |	Вт.НомерЗаказа КАК НомерЗаказа,
	           |	Вт.НомерПроката КАК НомерПроката,
	           |	Вт.Заказчик КАК Заказчик,
	           |	Вт.Этикетки КАК Этикетки,
	           |	Вт.МетражКВМ КАК МетражКВМ,
	           |	Вт.МетражПМ КАК МетражПМ,
	           |	Вт.Нарезка КАК Нарезка,
	           |	Вт.Z КАК Z,
	           |	Вт.Материал КАК Материал,
	           |	Вт.ПоставщикЛюбой КАК ПоставщикЛюбой,
	           |	Вт.ШтампыСтрокой КАК ШтампыСтрокой,
	           |	Вт.ШтампВырубной КАК ШтампВырубной,
	           |	Вт.ЦветаСтрокой КАК ЦветаСтрокой,
	           |	Вт.Регион КАК Регион,
	           |	Вт.ВремяНачала КАК ВремяНачала,
	           |	Вт.РабочийЦентр КАК РабочийЦентр,
	           |	Вт.СрокСдачи КАК СрокСдачи,
	           |	Вт.ВремяОкончания КАК ВремяОкончания,
	           |	Вт.ВремяВыполнения КАК ВремяВыполнения,
	           |	Вт.НаПроизводстве КАК НаПроизводстве,
	           |	Вт.ВидЗаказа КАК ВидЗаказа,
	           |	Вт.ФормыСтрокой КАК ФормыСтрокой,
	           |	Вт.Ручьи КАК Ручьи,
	           |	Вт.ШагПечати КАК ШагПечати,
	           |	Вт.ДлинаЭтикетки КАК ДлинаЭтикетки,
	           |	Вт.ШиринаЭтикетки КАК ШиринаЭтикетки,
	           |	Вт.ПлощадьКлише КАК ПлощадьКлише,
	           |	Вт.СрочноеЦветоделение КАК СрочноеЦветоделение,
	           |	Вт.Тираж КАК Тираж,
	           |	Вт.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
	           |	Вт.БезЛака КАК БезЛака,
	           |	Вт.Этап КАК Этап,
	           |	Вт.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	           |	Вт.ВидЭтапа КАК ВидЭтапа,
	           |	Вт.Площадка КАК Площадка
	           |ИЗ
	           |	Вт КАК Вт
	           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_Затраты КАК Лико_Затраты
	           |		ПО Вт.Заказ = Лико_Затраты.ЗаказКлиента
	           |			И Вт.НомерПроката = Лико_Затраты.НомерПроката
	           |ГДЕ
	           |	ВЫБОР
	           |			КОГДА Лико_Затраты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
	           |				ТОГДА Лико_Затраты.Затрата.ОсновнаяНоменклатура = &ПотребностьНоменклатура
	           |			ИНАЧЕ Лико_Затраты.Затрата = &ПотребностьНоменклатура
	           |		КОНЕЦ
	           |	И ВЫБОР
	           |			КОГДА &ПотребностьЕстьНарезка
	           |				ТОГДА Вт.Нарезка = &ПотребностьНарезка
	           |			ИНАЧЕ ИСТИНА
	           |		КОНЕЦ";

	  	  
	  
КонецФункции  //-Лико m.shenderov 09.10.2019

&НаСервере
Функция ПланированиеЗаказовТекстЗапросаПотребностиМатериалов() //+Лико m.shenderov 09.10.2019


	Возврат  "ВЫБРАТЬ
          |	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
          |	ПооперационноеРасписание2_2.Этап КАК Этап,
          |	ПооперационноеРасписание2_2.Этап.Распоряжение КАК ЗаказНаПроизводство,
          |	ВЫБОР
          |		КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
          |			ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
          |		ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
          |	КОНЕЦ КАК ЗаказКлиента,
          |	ПооперационноеРасписание2_2.Этап.НомерПроката КАК НомерПроката,
          |	ПооперационноеРасписание2_2.Начало КАК Начало,
          |	ПооперационноеРасписание2_2.Этап.ВидЭтапа КАК ВидЭтапа,
          |	ПооперационноеРасписание2_2.Окончание КАК Окончание,
          |	ВЫБОР
          |		КОГДА ПооперационноеРасписание2_2.Выполняется > 0
          |			ТОГДА ИСТИНА
          |		ИНАЧЕ ЛОЖЬ
          |	КОНЕЦ КАК НаПроизводстве,
          |	МАКСИМУМ(ВЫБОР
          |			КОГДА Лико_Затраты.ЗаказКлиента ЕСТЬ NULL
          |				ТОГДА ЛОЖЬ
          |			ИНАЧЕ ИСТИНА
          |		КОНЕЦ) КАК ДопNF
          |ПОМЕСТИТЬ ВТ_ЗагрузкаРЦ
          |ИЗ
          |	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_Затраты КАК Лико_Затраты
          |		ПО (ВЫБОР
          |				КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
          |					ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
          |				ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
          |			КОНЕЦ = Лико_Затраты.ЗаказКлиента)
          |			И (Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil))
          |ГДЕ
          |	ПооперационноеРасписание2_2.Выполнено = 0
		  | И НЕ ПооперационноеРасписание2_2.Моделирование
		  |	И ПооперационноеРасписание2_2.Этап.Организация=&Организация
          |	И НЕ ПооперационноеРасписание2_2.Этап.ПометкаУдаления
          |	И НЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ПометкаУдаления
          |
          |СГРУППИРОВАТЬ ПО
          |	ПооперационноеРасписание2_2.РабочийЦентр,
          |	ПооперационноеРасписание2_2.Этап,
          |	ПооперационноеРасписание2_2.Этап.Распоряжение,
          |	ПооперационноеРасписание2_2.Этап.НомерПроката,
          |	ПооперационноеРасписание2_2.Начало,
          |	ПооперационноеРасписание2_2.Этап.ВидЭтапа,
          |	ПооперационноеРасписание2_2.Окончание,
          |	ВЫБОР
          |		КОГДА ПооперационноеРасписание2_2.Выполняется > 0
          |			ТОГДА ИСТИНА
          |		ИНАЧЕ ЛОЖЬ
          |	КОНЕЦ,
          |	ВЫБОР
          |		КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
          |			ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
          |		ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
          |	КОНЕЦ
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ
          |	ВТ_ЗагрузкаРЦ.ЗаказКлиента КАК Заказ,
          |	ЗаказКл.НомерБезПрефикса КАК НомерЗаказа,
          |	ВТ_ЗагрузкаРЦ.НомерПроката КАК НомерПроката,
          |	ВТ_ЗагрузкаРЦ.ЗаказКлиента.Партнер КАК Заказчик,
          |	ЗаказКл.Этикетки КАК Этикетки,
          |	ЗаказКл.МетражКВМ КАК МетражКВМ,
          |	ЗаказКл.МетражПМ КАК МетражПМ,
          |	ЗаказКл.Z КАК Z,
          |	ВЫБОР
          |		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.МатериалЗамена, """") = """"
          |			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
          |		ИНАЧЕ Лико_ПодготовкаМатериалов.МатериалЗамена
          |	КОНЕЦ КАК Материал,
          |	ЗаказКл.ПоставщикМатериалаЛюбой КАК ПоставщикЛюбой,
          |	ЗаказКл.ШтампыСтрокой КАК ШтампыСтрокой,
          |	ЗаказКл.ШтампВырубной КАК ШтампВырубной,
          |	ЗаказКл.ЦветаСтрокой КАК ЦветаСтрокой,
          |	ЗаказКл.Регион КАК Регион,
          |	ВТ_ЗагрузкаРЦ.Начало КАК ВремяНачала,
          |	ВТ_ЗагрузкаРЦ.РабочийЦентр КАК РабочийЦентр,
          |	ЗаказКл.ДатаОтгрузки КАК СрокСдачи,
          |	ВТ_ЗагрузкаРЦ.Окончание КАК ВремяОкончания,
          |	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ.Начало, ВТ_ЗагрузкаРЦ.Окончание, ЧАС) КАК ВремяВыполнения,
          |	ВТ_ЗагрузкаРЦ.НаПроизводстве КАК Выполняется,
          |	ЗаказКл.ВидЗаказа КАК ВидЗаказа,
          |	ЗаказКл.ФормыСтрокой КАК ФормыСтрокой,
          |	ЗаказКл.Ручьи КАК Ручьи,
          |	ЗаказКл.ШагПечати КАК ШагПечати,
          |	ЗаказКл.ДлинаЭтикетки КАК ДлинаЭтикетки,
          |	ЗаказКл.ШиринаЭтикетки КАК ШиринаЭтикетки,
          |	ЗаказКл.ПлощадьКлише КАК ПлощадьКлише,
          |	ЗаказКл.СрочноеЦветоделение КАК СрочноеЦветоделение,
          |	ЗаказКл.Тираж КАК Тираж,
          |	ЗаказКл.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
          |	ЗаказКл.БезЛака КАК БезЛака,
          |	ВТ_ЗагрузкаРЦ.Этап КАК Этап,
          |	ВТ_ЗагрузкаРЦ.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
          |	ВТ_ЗагрузкаРЦ.ВидЭтапа КАК ВидЭтапа,
          |	ЗаказКл.Площадка КАК Площадка,
          |	Лико_ПодготовленныеМатериалы.ДатаПроверкиНаличияМатериала КАК ДатаПроверкиНаличияМатериала,
          |	Лико_ПодготовленныеМатериалы.ЗаменаМатериала КАК ЗаменаМатериала,
          |	Лико_ПодготовленныеМатериалы.ЗаменаНарезки КАК ЗаменаНарезки,
          |	Лико_ПодготовленныеМатериалы.ЗаменаДопМатериалов КАК ЗаменаДопМатериалов,
          |	Лико_ПодготовленныеМатериалы.НаличиеМатериала КАК НаличиеМатериала,
          |	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка,
          |	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК МетражОбщий,
          |	ВЫБОР
          |		КОГДА ЗаказКл.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
          |			ТОГДА ЗаказКл.ОсновнойМатериал.Артикул
          |		ИНАЧЕ """"
          |	КОНЕЦ КАК Артикул,
          |	ВЫБОР
          |		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.НарезкаЗамена, """") = """"
          |			ТОГДА Лико_ПодготовкаМатериалов.Нарезка
          |		ИНАЧЕ Лико_ПодготовкаМатериалов.НарезкаЗамена
          |	КОНЕЦ КАК Нарезка,
          |	Лико_ПодготовкаМатериалов.ДатаПриходаМатериалаТекст КАК ДатаПриходаМатериала,
          |	ВЫБОР
          |		КОГДА Лико_ПодготовкаМатериалов.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
          |				И НЕ ВТ_ЗагрузкаРЦ.ДопNF
          |			ТОГДА """"
          |		ИНАЧЕ ВЫБОР
          |				КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена, """") = """"
          |					ТОГДА ЗаказКл.ДопМатериалыСтрокой
          |				ИНАЧЕ Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена
          |			КОНЕЦ
          |	КОНЕЦ КАК ДопМатериалы,
          |	СУММА(ЕСТЬNULL(Лико_МатериалыВРезерве.Количество, 0)) КАК КоличествоВРезерве,
          |	ВЫРАЗИТЬ(&ДатаКонтроляМатериала КАК ДАТА) КАК ДатаКонтроляМатериала,
          |	Лико_ПодготовкаМатериалов.СнятиеРезерва КАК СнятиеРезерва,
          |	ВЫБОР
          |		КОГДА ВТ_ЗагрузкаРЦ.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
          |			ТОГДА ИСТИНА
          |		ИНАЧЕ ЛОЖЬ
          |	КОНЕЦ КАК НФ,
          |	ВЫБОР
          |		КОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
          |			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
          |		ИНАЧЕ ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал.ОсновнаяНоменклатура
          |	КОНЕЦ КАК Номенклатура,
          |	СУММА(ВЫБОР
          |			КОГДА Лико_ЭтапыЗаказа.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.Производство)
          |				ТОГДА 1
          |			ИНАЧЕ 0
          |		КОНЕЦ) КАК НаПроизводстве,
          |	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
          |				КОГДА ЗакВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
          |					ТОГДА ВЫБОР
          |							КОГДА ЕСТЬNULL(Лико_ПараметрыШтампа.ЭтикетокНаЛисте, 0) > 0
          |								ТОГДА ЗакВидыРабот.Дополнительно * (ЗаказКл.Тираж * 1000 / Лико_ПараметрыШтампа.ЭтикетокНаЛисте) * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
          |							ИНАЧЕ ЗакВидыРабот.Дополнительно * ЗаказКл.Тираж * 1000 * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
          |						КОНЕЦ
          |			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК МетрыТиснения,
          |	МИНИМУМ(ВЫРАЗИТЬ(ВЫБОР
          |				КОГДА ЗакВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
          |					ТОГДА ВЫБОР
          |							КОГДА ЕСТЬNULL(Лико_ПараметрыШтампа.ЭтикетокНаЛисте, 0) > 0
          |								ТОГДА ЗакВидыРабот.Дополнительно * (ЗаказКл.Тираж * 1000 / Лико_ПараметрыШтампа.ЭтикетокНаЛисте) * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
          |							ИНАЧЕ ЗакВидыРабот.Дополнительно * ЗаказКл.Тираж * 1000 * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
          |						КОНЕЦ
          |			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК МетрыТиснения1
          |ПОМЕСТИТЬ Вт_Итог
          |ИЗ
          |	ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ
          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКл
          |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = ЗаказКл.Ссылка
          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПодготовленныеМатериалы КАК Лико_ПодготовленныеМатериалы
          |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
          |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве КАК Лико_МатериалыВРезерве
          |				ПО Лико_ПодготовкаМатериалов.Ссылка = Лико_МатериалыВРезерве.Регистратор
          |			ПО Лико_ПодготовленныеМатериалы.Регистратор = Лико_ПодготовкаМатериалов.Ссылка
          |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ПодготовленныеМатериалы.ЗаказКлиента
          |			И ВТ_ЗагрузкаРЦ.НомерПроката = Лико_ПодготовленныеМатериалы.НомерПроката
          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
          |		ПО ВТ_ЗагрузкаРЦ.РабочийЦентр.ВидРабочегоЦентра = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра
          |			И ВТ_ЗагрузкаРЦ.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
          |			И ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ПараметрыПроизводстваЗаказа.Заказ
          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
          |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ЭтапыЗаказа.Заказ
          |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗакВидыРабот
          |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
          |			ПО ЗакВидыРабот.Оснастка = Лико_ПараметрыШтампа.Номенклатура
          |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = ЗакВидыРабот.Ссылка
          |			И (ВЫБОР
          |				КОГДА ВТ_ЗагрузкаРЦ.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
          |					ТОГДА ЗакВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
          |				ИНАЧЕ ЗакВидыРабот.ВидРабот.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Тиснение)
          |						И ЗакВидыРабот.ВидРабот <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
          |			КОНЕЦ)
          |
          |СГРУППИРОВАТЬ ПО
          |	ВТ_ЗагрузкаРЦ.ЗаказКлиента,
          |	ЗаказКл.НомерБезПрефикса,
          |	ВТ_ЗагрузкаРЦ.НомерПроката,
          |	ВТ_ЗагрузкаРЦ.ЗаказКлиента.Партнер,
          |	ЗаказКл.Этикетки,
          |	ЗаказКл.МетражКВМ,
          |	ЗаказКл.МетражПМ,
          |	ЗаказКл.Z,
          |	ВЫБОР
          |		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.МатериалЗамена, """") = """"
          |			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
          |		ИНАЧЕ Лико_ПодготовкаМатериалов.МатериалЗамена
          |	КОНЕЦ,
          |	ЗаказКл.ПоставщикМатериалаЛюбой,
          |	ЗаказКл.ШтампыСтрокой,
          |	ЗаказКл.ШтампВырубной,
          |	ЗаказКл.ЦветаСтрокой,
          |	ЗаказКл.Регион,
          |	ВТ_ЗагрузкаРЦ.Начало,
          |	ВТ_ЗагрузкаРЦ.РабочийЦентр,
          |	ЗаказКл.ДатаОтгрузки,
          |	ВТ_ЗагрузкаРЦ.Окончание,
          |	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ.Начало, ВТ_ЗагрузкаРЦ.Окончание, ЧАС),
          |	ВТ_ЗагрузкаРЦ.НаПроизводстве,
          |	ЗаказКл.ВидЗаказа,
          |	ЗаказКл.ФормыСтрокой,
          |	ЗаказКл.Ручьи,
          |	ЗаказКл.ШагПечати,
          |	ЗаказКл.ДлинаЭтикетки,
          |	ЗаказКл.ШиринаЭтикетки,
          |	ЗаказКл.ПлощадьКлише,
          |	ЗаказКл.СрочноеЦветоделение,
          |	ЗаказКл.Тираж,
          |	ЗаказКл.ДатаУтвержденияРабот,
          |	ЗаказКл.БезЛака,
          |	ВТ_ЗагрузкаРЦ.Этап,
          |	ВТ_ЗагрузкаРЦ.ЗаказНаПроизводство,
          |	ВТ_ЗагрузкаРЦ.ВидЭтапа,
          |	ЗаказКл.Площадка,
          |	Лико_ПодготовленныеМатериалы.ДатаПроверкиНаличияМатериала,
          |	Лико_ПодготовленныеМатериалы.ЗаменаМатериала,
          |	Лико_ПодготовленныеМатериалы.ЗаменаНарезки,
          |	Лико_ПодготовленныеМатериалы.ЗаменаДопМатериалов,
          |	Лико_ПодготовленныеМатериалы.НаличиеМатериала,
          |	Лико_ПодготовкаМатериалов.Ссылка,
          |	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ,
          |	ВЫБОР
          |		КОГДА ЗаказКл.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
          |			ТОГДА ЗаказКл.ОсновнойМатериал.Артикул
          |		ИНАЧЕ """"
          |	КОНЕЦ,
          |	ВЫБОР
          |		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.НарезкаЗамена, """") = """"
          |			ТОГДА Лико_ПодготовкаМатериалов.Нарезка
          |		ИНАЧЕ Лико_ПодготовкаМатериалов.НарезкаЗамена
          |	КОНЕЦ,
          |	Лико_ПодготовкаМатериалов.ДатаПриходаМатериалаТекст,
          |	Лико_ПодготовкаМатериалов.СнятиеРезерва,
          |	ВЫБОР
          |		КОГДА ВТ_ЗагрузкаРЦ.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
          |			ТОГДА ИСТИНА
          |		ИНАЧЕ ЛОЖЬ
          |	КОНЕЦ,
          |	ВЫБОР
          |		КОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
          |			ТОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал
          |		ИНАЧЕ ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал.ОсновнаяНоменклатура
          |	КОНЕЦ,
          |	ВЫБОР
          |		КОГДА Лико_ПодготовкаМатериалов.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
          |				И НЕ ВТ_ЗагрузкаРЦ.ДопNF
          |			ТОГДА """"
          |		ИНАЧЕ ВЫБОР
          |				КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена, """") = """"
          |					ТОГДА ЗаказКл.ДопМатериалыСтрокой
          |				ИНАЧЕ Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена
          |			КОНЕЦ
          |	КОНЕЦ
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ
          |	Вт_Итог.Заказ КАК Заказ,
          |	Вт_Итог.НомерЗаказа КАК НомерЗаказа,
          |	Вт_Итог.НомерПроката КАК НомерПроката,
          |	Вт_Итог.Заказчик КАК Заказчик,
          |	Вт_Итог.Этикетки КАК Этикетки,
          |	Вт_Итог.МетражКВМ КАК МетражКВМ,
          |	Вт_Итог.МетражПМ КАК МетражПМ,
          |	Вт_Итог.Z КАК Z,
          |	Вт_Итог.Материал КАК Материал,
          |	Вт_Итог.ПоставщикЛюбой КАК ПоставщикЛюбой,
          |	Вт_Итог.ШтампыСтрокой КАК ШтампыСтрокой,
          |	Вт_Итог.ШтампВырубной КАК ШтампВырубной,
          |	Вт_Итог.ЦветаСтрокой КАК ЦветаСтрокой,
          |	Вт_Итог.Регион КАК Регион,
          |	Вт_Итог.ВремяНачала КАК ВремяНачала,
          |	Вт_Итог.РабочийЦентр КАК РабочийЦентр,
          |	Вт_Итог.СрокСдачи КАК СрокСдачи,
          |	Вт_Итог.ВремяОкончания КАК ВремяОкончания,
          |	Вт_Итог.ВремяВыполнения КАК ВремяВыполнения,
          |	Вт_Итог.Выполняется КАК Выполняется,
          |	Вт_Итог.ВидЗаказа КАК ВидЗаказа,
          |	Вт_Итог.ФормыСтрокой КАК ФормыСтрокой,
          |	Вт_Итог.Ручьи КАК Ручьи,
          |	Вт_Итог.ШагПечати КАК ШагПечати,
          |	Вт_Итог.ДлинаЭтикетки КАК ДлинаЭтикетки,
          |	Вт_Итог.ШиринаЭтикетки КАК ШиринаЭтикетки,
          |	Вт_Итог.ПлощадьКлише КАК ПлощадьКлише,
          |	Вт_Итог.СрочноеЦветоделение КАК СрочноеЦветоделение,
          |	Вт_Итог.Тираж КАК Тираж,
          |	Вт_Итог.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
          |	Вт_Итог.БезЛака КАК БезЛака,
          |	Вт_Итог.Этап КАК Этап,
          |	Вт_Итог.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
          |	Вт_Итог.ВидЭтапа КАК ВидЭтапа,
          |	Вт_Итог.Площадка КАК Площадка,
          |	Вт_Итог.ДатаПроверкиНаличияМатериала КАК ДатаПроверкиНаличияМатериала,
          |	Вт_Итог.ЗаменаМатериала КАК ЗаменаМатериала,
          |	Вт_Итог.ЗаменаНарезки КАК ЗаменаНарезки,
          |	Вт_Итог.ЗаменаДопМатериалов КАК ЗаменаДопМатериалов,
          |	Вт_Итог.НаличиеМатериала КАК НаличиеМатериала,
          |	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка,
          |	Вт_Итог.МетражОбщий КАК МетражОбщий,
          |	Вт_Итог.Номенклатура.Артикул КАК Артикул,
          |	Вт_Итог.Нарезка КАК Нарезка,
          |	Вт_Итог.ДатаПриходаМатериала КАК ДатаПриходаМатериала,
          |	Вт_Итог.ДопМатериалы КАК ДопМатериалы,
          |	Вт_Итог.КоличествоВРезерве КАК КоличествоВРезерве,
          |	Вт_Итог.ДатаКонтроляМатериала КАК ДатаКонтроляМатериала,
          |	Вт_Итог.СнятиеРезерва КАК СнятиеРезерва,
          |	Вт_Итог.НФ КАК НФ,
          |	Вт_Итог.Номенклатура КАК Номенклатура,
          |	Вт_Итог.НаПроизводстве КАК НаПроизводстве,
          |	ВЫБОР
          |		КОГДА Вт_Итог.МетрыТиснения = Вт_Итог.МетрыТиснения1
          |			ТОГДА Вт_Итог.МетрыТиснения
          |		ИНАЧЕ ВЫБОР
          |				КОГДА Вт_Итог.МетрыТиснения = 0
          |					ТОГДА Вт_Итог.МетрыТиснения1
          |				ИНАЧЕ Вт_Итог.МетрыТиснения
          |			КОНЕЦ
          |	КОНЕЦ КАК МетрыТиснения,
          |	Лико_ПодготовкаМатериалов.ЕстьФормы КАК ЕстьФормы,
          |	Лико_ПодготовкаМатериалов.НаличиеМатериала КАК НаличиеМатериала1
          |ПОМЕСТИТЬ втПодготовка
          |ИЗ
          |	Вт_Итог КАК Вт_Итог
          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
          |		ПО Вт_Итог.Ссылка = Лико_ПодготовкаМатериалов.Ссылка
          |ГДЕ
          |	ВЫБОР
          |			КОГДА &ФильтрПоВидуЗаказа
          |				ТОГДА Лико_ПодготовкаМатериалов.ЗаказКлиента.ВидЗаказа = &ВидЗаказа
          |			ИНАЧЕ ИСТИНА
          |		КОНЕЦ
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ РАЗЛИЧНЫЕ
          |	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
          |ПОМЕСТИТЬ ВтФильтрПоПодготовке
          |ИЗ
          |	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
          |		ПО (Лико_ПодготовкаМатериаловРезервирование.Ссылка = Лико_ПодготовкаМатериалов.Ссылка)
          |ГДЕ
          |	Лико_ПодготовкаМатериаловРезервирование.Номенклатура = &ПотребностьНоменклатура
          |			И ВЫБОР
          |				КОГДА &ПотребностьЕстьНарезка
          |					ТОГДА Лико_ПодготовкаМатериаловРезервирование.Нарезка = &ПотребностьНарезка
          |				ИНАЧЕ ИСТИНА
          |			КОНЕЦ
          |
          |ОБЪЕДИНИТЬ ВСЕ
          |
          |ВЫБРАТЬ РАЗЛИЧНЫЕ
          |	Лико_ПодготовкаМатериалов.Ссылка
          |ИЗ
          |	Документ.Лико_ПодготовкаМатериалов.Материалы КАК Лико_ПодготовкаМатериаловМатериалы
          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
          |		ПО Лико_ПодготовкаМатериаловМатериалы.Ссылка = Лико_ПодготовкаМатериалов.Ссылка
          |ГДЕ
          |	Лико_ПодготовкаМатериаловМатериалы.Номенклатура = &ПотребностьНоменклатура
          |			И ВЫБОР
          |				КОГДА &ПотребностьЕстьНарезка
          |					ТОГДА Лико_ПодготовкаМатериаловМатериалы.Нарезка = &ПотребностьНарезка
          |				ИНАЧЕ ИСТИНА
          |			КОНЕЦ
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ РАЗЛИЧНЫЕ
          |	ВтФильтрПоПодготовке.Ссылка КАК Ссылка
          |ПОМЕСТИТЬ ВтФильтрПоПодготовкеСвернутый
          |ИЗ
          |	ВтФильтрПоПодготовке КАК ВтФильтрПоПодготовке
          |;
          |
          |////////////////////////////////////////////////////////////////////////////////
          |ВЫБРАТЬ РАЗЛИЧНЫЕ
          |	втПодготовка.Заказ КАК Заказ,
          |	втПодготовка.НомерЗаказа КАК НомерЗаказа,
          |	втПодготовка.НомерПроката КАК НомерПроката,
          |	втПодготовка.Заказчик КАК Заказчик,
          |	втПодготовка.Этикетки КАК Этикетки,
          |	втПодготовка.МетражКВМ КАК МетражКВМ,
          |	втПодготовка.МетражПМ КАК МетражПМ,
          |	втПодготовка.Z КАК Z,
          |	втПодготовка.Материал КАК Материал,
          |	втПодготовка.ПоставщикЛюбой КАК ПоставщикЛюбой,
          |	втПодготовка.ШтампыСтрокой КАК ШтампыСтрокой,
          |	втПодготовка.ШтампВырубной КАК ШтампВырубной,
          |	втПодготовка.ЦветаСтрокой КАК ЦветаСтрокой,
          |	втПодготовка.Регион КАК Регион,
          |	втПодготовка.ВремяНачала КАК ВремяНачала,
          |	втПодготовка.РабочийЦентр КАК РабочийЦентр,
          |	втПодготовка.СрокСдачи КАК СрокСдачи,
          |	втПодготовка.ВремяОкончания КАК ВремяОкончания,
          |	втПодготовка.ВремяВыполнения КАК ВремяВыполнения,
          |	втПодготовка.Выполняется КАК Выполняется,
          |	втПодготовка.ВидЗаказа КАК ВидЗаказа,
          |	втПодготовка.ФормыСтрокой КАК ФормыСтрокой,
          |	втПодготовка.Ручьи КАК Ручьи,
          |	втПодготовка.ШагПечати КАК ШагПечати,
          |	втПодготовка.ДлинаЭтикетки КАК ДлинаЭтикетки,
          |	втПодготовка.ШиринаЭтикетки КАК ШиринаЭтикетки,
          |	втПодготовка.ПлощадьКлише КАК ПлощадьКлише,
          |	втПодготовка.СрочноеЦветоделение КАК СрочноеЦветоделение,
          |	втПодготовка.Тираж КАК Тираж,
          |	втПодготовка.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
          |	втПодготовка.БезЛака КАК БезЛака,
          |	втПодготовка.Этап КАК Этап,
          |	втПодготовка.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
          |	втПодготовка.ВидЭтапа КАК ВидЭтапа,
          |	втПодготовка.Площадка КАК Площадка,
          |	втПодготовка.ДатаПроверкиНаличияМатериала КАК ДатаПроверкиНаличияМатериала,
          |	втПодготовка.ЗаменаМатериала КАК ЗаменаМатериала,
          |	втПодготовка.ЗаменаНарезки КАК ЗаменаНарезки,
          |	втПодготовка.ЗаменаДопМатериалов КАК ЗаменаДопМатериалов,
          |	втПодготовка.НаличиеМатериала КАК НаличиеМатериала,
          |	втПодготовка.Ссылка КАК Ссылка,
          |	втПодготовка.МетражОбщий КАК МетражОбщий,
          |	втПодготовка.Артикул КАК Артикул,
          |	втПодготовка.Нарезка КАК Нарезка,
          |	втПодготовка.ДатаПриходаМатериала КАК ДатаПриходаМатериала,
          |	втПодготовка.ДопМатериалы КАК ДопМатериалы,
          |	втПодготовка.КоличествоВРезерве КАК КоличествоВРезерве,
          |	втПодготовка.ДатаКонтроляМатериала КАК ДатаКонтроляМатериала,
          |	втПодготовка.СнятиеРезерва КАК СнятиеРезерва,
          |	втПодготовка.НФ КАК НФ,
          |	втПодготовка.Номенклатура КАК Номенклатура,
          |	втПодготовка.НаПроизводстве КАК НаПроизводстве,
          |	втПодготовка.МетрыТиснения КАК МетрыТиснения,
          |	втПодготовка.ЕстьФормы КАК ЕстьФормы,
          |	втПодготовка.НаличиеМатериала1 КАК НаличиеМатериала1,
		  | Ложь 							КАК ЕстьПечатьСКлеящегоСлоя
          |ИЗ
          |	втПодготовка КАК втПодготовка
          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
          |		ПО втПодготовка.Ссылка = Лико_ПодготовкаМатериалов.Ссылка
          |ГДЕ
          |	втПодготовка.Ссылка В
          |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
          |				ВтФильтрПоПодготовкеСвернутый.Ссылка КАК Ссылка
          |			ИЗ
          |				ВтФильтрПоПодготовкеСвернутый КАК ВтФильтрПоПодготовкеСвернутый)";
	  	  
	  
КонецФункции  //-Лико m.shenderov 09.10.2019


Процедура УстановитьТекстЗапросаПланированиеЗаказов() //+Лико m.shenderov 09.04.2021
	
	ПланированиеЗаказов.ТекстЗапроса=
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПооперационноеРасписание2_2.РабочийЦентр КАК Справочник.РабочиеЦентры) КАК РабочийЦентр,
	|	ПооперационноеРасписание2_2.Этап КАК Этап,
	|	ВЫРАЗИТЬ(ПооперационноеРасписание2_2.Этап.Распоряжение КАК Документ.ЗаказНаПроизводство2_2) КАК ЗаказНаПроизводство,
	|	ПооперационноеРасписание2_2.Этап.Лико_ЗаказКлиента КАК ЗаказКлиента,
	|	ПооперационноеРасписание2_2.Этап.НомерПроката КАК НомерПроката,
	|	ПооперационноеРасписание2_2.Начало КАК Начало,
	|	ПооперационноеРасписание2_2.Этап.ВидЭтапа КАК ВидЭтапа,
	|	ПооперационноеРасписание2_2.Окончание КАК Окончание,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.Выполняется > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НаПроизводстве
	|ПОМЕСТИТЬ ВТ_ЗагрузкаРЦ
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Выполнено = 0
	|	И НЕ ПооперационноеРасписание2_2.Моделирование
	|	И ВЫБОР
	|			КОГДА &Сводно
	|				ТОГДА ВЫБОР
	|						КОГДА &СводноВсеРЦ
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ПооперационноеРасписание2_2.РабочийЦентр В (&РабочиеЦентры)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &НФ
	|						ТОГДА ПооперационноеРасписание2_2.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|					ИНАЧЕ ПооперационноеРасписание2_2.РабочийЦентр = &РабочийЦентр
	|				КОНЕЦ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПооперационноеРасписание2_2.Этап,
	|	ПооперационноеРасписание2_2.Этап.НомерПроката,
	|	ПооперационноеРасписание2_2.Начало,
	|	ПооперационноеРасписание2_2.Этап.ВидЭтапа,
	|	ПооперационноеРасписание2_2.Окончание,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.Выполняется > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ПооперационноеРасписание2_2.РабочийЦентр КАК Справочник.РабочиеЦентры),
	|	ВЫРАЗИТЬ(ПооперационноеРасписание2_2.Этап.Распоряжение КАК Документ.ЗаказНаПроизводство2_2),
	|	ПооперационноеРасписание2_2.Этап.Лико_ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗагрузкаРЦ.ЗаказКлиента КАК ЗаказКлиента,
	|	ИСТИНА КАК ЕстьПечатьСКлеящегоСлоя
	|ПОМЕСТИТЬ ВтЗаказыПечатьСКлеящегоСлоя
	|ИЗ
	|	ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = ЗаказКлиентаЦвета.Ссылка
	|ГДЕ
	|	ЗаказКлиентаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПечатьСКлеящегоСлоя)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗагрузкаРЦ.ЗаказКлиента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_Затраты.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВтNF
	|ИЗ
	|	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	|ГДЕ
	|	Лико_Затраты.РЦ.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|	И Лико_Затраты.ЗаказКлиента В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ЗагрузкаРЦ.ЗаказКлиента КАК ЗаказКлиента
	|			ИЗ
	|				ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗагрузкаРЦ.РабочийЦентр КАК РабочийЦентр,
	|	ВТ_ЗагрузкаРЦ.Этап КАК Этап,
	|	ВТ_ЗагрузкаРЦ.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВТ_ЗагрузкаРЦ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ЗагрузкаРЦ.НомерПроката КАК НомерПроката,
	|	ВТ_ЗагрузкаРЦ.Начало КАК Начало,
	|	ВТ_ЗагрузкаРЦ.ВидЭтапа КАК ВидЭтапа,
	|	ВТ_ЗагрузкаРЦ.Окончание КАК Окончание,
	|	ВТ_ЗагрузкаРЦ.НаПроизводстве КАК НаПроизводстве,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ.ЗаказКлиента В
	|				(ВЫБРАТЬ
	|					_Заказ.ЗаказКлиента
	|				ИЗ
	|					ВтNF КАК _Заказ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДопNF
	|ПОМЕСТИТЬ ВТ_ЗагрузкаРЦ2
	|ИЗ
	|	ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗагрузкаРЦ2.ЗаказКлиента КАК Заказ,
	|	ЗаказКл.НомерБезПрефикса КАК НомерЗаказа,
	|	ВТ_ЗагрузкаРЦ2.НомерПроката КАК НомерПроката,
	|	ВТ_ЗагрузкаРЦ2.ЗаказКлиента.Партнер КАК Заказчик,
	|	ЗаказКл.Этикетки КАК Этикетки,
	|	ЗаказКл.МетражКВМ КАК МетражКВМ,
	|	ЗаказКл.МетражПМ КАК МетражПМ,
	|	ЗаказКл.Z КАК Z,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.МатериалЗамена, """") = """"
	|			ТОГДА ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.МатериалЗамена
	|	КОНЕЦ КАК Материал,
	|	ЗаказКл.ПоставщикМатериалаЛюбой КАК ПоставщикЛюбой,
	|	ЗаказКл.ШтампыСтрокой КАК ШтампыСтрокой,
	|	ЗаказКл.ШтампВырубной КАК ШтампВырубной,
	|	ЗаказКл.ЦветаСтрокой КАК ЦветаСтрокой,
	|	ЗаказКл.Регион КАК Регион,
	|	ВТ_ЗагрузкаРЦ2.Начало КАК ВремяНачала,
	|	ВТ_ЗагрузкаРЦ2.РабочийЦентр КАК РабочийЦентр,
	|	ЗаказКл.ДатаОтгрузки КАК СрокСдачи,
	|	ВТ_ЗагрузкаРЦ2.Окончание КАК ВремяОкончания,
	|	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ2.Начало, ВТ_ЗагрузкаРЦ2.Окончание, ЧАС) КАК ВремяВыполнения,
	|	ВТ_ЗагрузкаРЦ2.НаПроизводстве КАК Выполняется,
	|	ЗаказКл.ВидЗаказа КАК ВидЗаказа,
	|	ЗаказКл.ФормыСтрокой КАК ФормыСтрокой,
	|	ЗаказКл.Ручьи КАК Ручьи,
	|	ЗаказКл.ШагПечати КАК ШагПечати,
	|	ЗаказКл.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	ЗаказКл.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	ЗаказКл.ПлощадьКлише КАК ПлощадьКлише,
	|	ЗаказКл.СрочноеЦветоделение КАК СрочноеЦветоделение,
	|	ЗаказКл.Тираж КАК Тираж,
	|	ЗаказКл.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
	|	ЗаказКл.БезЛака КАК БезЛака,
	|	ВТ_ЗагрузкаРЦ2.Этап КАК Этап,
	|	ВТ_ЗагрузкаРЦ2.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВТ_ЗагрузкаРЦ2.ВидЭтапа КАК ВидЭтапа,
	|	ЗаказКл.Площадка КАК Площадка,
	|	Лико_ПодготовленныеМатериалы.ДатаПроверкиНаличияМатериала КАК ДатаПроверкиНаличияМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаМатериала КАК ЗаменаМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаНарезки КАК ЗаменаНарезки,
	|	Лико_ПодготовленныеМатериалы.ЗаменаДопМатериалов КАК ЗаменаДопМатериалов,
	|	Лико_ПодготовленныеМатериалы.НаличиеМатериала КАК НаличиеМатериала,
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК МетражОбщий,
	|	ВЫБОР
	|		КОГДА ЗаказКл.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЗаказКл.ОсновнойМатериал.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Артикул,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.НарезкаЗамена, """") = """"
	|			ТОГДА Лико_ПодготовкаМатериалов.Нарезка
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.НарезкаЗамена
	|	КОНЕЦ КАК Нарезка,
	|	Лико_ПодготовкаМатериалов.ДатаПриходаМатериалаТекст КАК ДатаПриходаМатериала,
	|	ВЫБОР
	|		КОГДА Лико_ПодготовкаМатериалов.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|				И НЕ ВТ_ЗагрузкаРЦ2.ДопNF
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена, """") = """"
	|					ТОГДА ЗаказКл.ДопМатериалыСтрокой
	|				ИНАЧЕ Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена
	|			КОНЕЦ
	|	КОНЕЦ КАК ДопМатериалы,
	|	СУММА(ЕСТЬNULL(Лико_МатериалыВРезерве.Количество, 0)) КАК КоличествоВРезерве,
	|	ВЫРАЗИТЬ(&ДатаКонтроляМатериала КАК ДАТА) КАК ДатаКонтроляМатериала,
	|	Лико_ПодготовкаМатериалов.СнятиеРезерва КАК СнятиеРезерва,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ2.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НФ,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал.ОсновнаяНоменклатура
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ЭтапыЗаказа.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.Производство)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НаПроизводстве,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ЗакВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(Лико_ПараметрыШтампа.ЭтикетокНаЛисте, 0) > 0
	|								ТОГДА ЗакВидыРабот.Дополнительно * (ЗаказКл.Тираж * 1000 / Лико_ПараметрыШтампа.ЭтикетокНаЛисте) * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
	|							ИНАЧЕ ЗакВидыРабот.Дополнительно * ЗаказКл.Тираж * 1000 * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
	|						КОНЕЦ
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК МетрыТиснения,
	|	МИНИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ЗакВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(Лико_ПараметрыШтампа.ЭтикетокНаЛисте, 0) > 0
	|								ТОГДА ЗакВидыРабот.Дополнительно * (ЗаказКл.Тираж * 1000 / Лико_ПараметрыШтампа.ЭтикетокНаЛисте) * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
	|							ИНАЧЕ ЗакВидыРабот.Дополнительно * ЗаказКл.Тираж * 1000 * (1 + ЕСТЬNULL((Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак + Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) / Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0))
	|						КОНЕЦ
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК МетрыТиснения1,
	|	ЗаказКл.Трафарет КАК Трафарет
	|ПОМЕСТИТЬ Вт_Итог
	|ИЗ
	|	ВТ_ЗагрузкаРЦ2 КАК ВТ_ЗагрузкаРЦ2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКл
	|		ПО ВТ_ЗагрузкаРЦ2.ЗаказКлиента = ЗаказКл.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПодготовленныеМатериалы КАК Лико_ПодготовленныеМатериалы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве КАК Лико_МатериалыВРезерве
	|				ПО Лико_ПодготовкаМатериалов.Ссылка = Лико_МатериалыВРезерве.Регистратор
	|			ПО Лико_ПодготовленныеМатериалы.Регистратор = Лико_ПодготовкаМатериалов.Ссылка
	|		ПО ВТ_ЗагрузкаРЦ2.ЗаказКлиента = Лико_ПодготовленныеМатериалы.ЗаказКлиента
	|			И ВТ_ЗагрузкаРЦ2.НомерПроката = Лико_ПодготовленныеМатериалы.НомерПроката
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ПО ВТ_ЗагрузкаРЦ2.РабочийЦентр.ВидРабочегоЦентра = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра
	|			И ВТ_ЗагрузкаРЦ2.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	|			И ВТ_ЗагрузкаРЦ2.ЗаказКлиента = Лико_ПараметрыПроизводстваЗаказа.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
	|		ПО ВТ_ЗагрузкаРЦ2.ЗаказКлиента = Лико_ЭтапыЗаказа.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗакВидыРабот
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|			ПО ЗакВидыРабот.Оснастка = Лико_ПараметрыШтампа.Номенклатура
	|		ПО ВТ_ЗагрузкаРЦ2.ЗаказКлиента = ЗакВидыРабот.Ссылка
	|			И (ВЫБОР
	|				КОГДА ВТ_ЗагрузкаРЦ2.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|					ТОГДА ЗакВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
	|				ИНАЧЕ ЗакВидыРабот.ВидРабот.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Тиснение)
	|						И ЗакВидыРабот.ВидРабот <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Сводно
	|				ТОГДА ВЫБОР
	|						КОГДА &СводноВсеРЦ
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ВТ_ЗагрузкаРЦ2.РабочийЦентр В (&РабочиеЦентры)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &НФ
	|						ТОГДА ВТ_ЗагрузкаРЦ2.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|					ИНАЧЕ ВТ_ЗагрузкаРЦ2.РабочийЦентр = &РабочийЦентр
	|				КОНЕЦ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗагрузкаРЦ2.ЗаказКлиента,
	|	ЗаказКл.НомерБезПрефикса,
	|	ВТ_ЗагрузкаРЦ2.НомерПроката,
	|	ВТ_ЗагрузкаРЦ2.ЗаказКлиента.Партнер,
	|	ЗаказКл.Этикетки,
	|	ЗаказКл.МетражКВМ,
	|	ЗаказКл.МетражПМ,
	|	ЗаказКл.Z,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.МатериалЗамена, """") = """"
	|			ТОГДА ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.МатериалЗамена
	|	КОНЕЦ,
	|	ЗаказКл.ПоставщикМатериалаЛюбой,
	|	ЗаказКл.ШтампыСтрокой,
	|	ЗаказКл.ШтампВырубной,
	|	ЗаказКл.ЦветаСтрокой,
	|	ЗаказКл.Регион,
	|	ВТ_ЗагрузкаРЦ2.Начало,
	|	ВТ_ЗагрузкаРЦ2.РабочийЦентр,
	|	ЗаказКл.ДатаОтгрузки,
	|	ВТ_ЗагрузкаРЦ2.Окончание,
	|	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ2.Начало, ВТ_ЗагрузкаРЦ2.Окончание, ЧАС),
	|	ВТ_ЗагрузкаРЦ2.НаПроизводстве,
	|	ЗаказКл.ВидЗаказа,
	|	ЗаказКл.ФормыСтрокой,
	|	ЗаказКл.Ручьи,
	|	ЗаказКл.ШагПечати,
	|	ЗаказКл.ДлинаЭтикетки,
	|	ЗаказКл.ШиринаЭтикетки,
	|	ЗаказКл.ПлощадьКлише,
	|	ЗаказКл.СрочноеЦветоделение,
	|	ЗаказКл.Тираж,
	|	ЗаказКл.ДатаУтвержденияРабот,
	|	ЗаказКл.БезЛака,
	|	ВТ_ЗагрузкаРЦ2.Этап,
	|	ВТ_ЗагрузкаРЦ2.ЗаказНаПроизводство,
	|	ВТ_ЗагрузкаРЦ2.ВидЭтапа,
	|	ЗаказКл.Площадка,
	|	Лико_ПодготовленныеМатериалы.ДатаПроверкиНаличияМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаМатериала,
	|	Лико_ПодготовленныеМатериалы.ЗаменаНарезки,
	|	Лико_ПодготовленныеМатериалы.ЗаменаДопМатериалов,
	|	Лико_ПодготовленныеМатериалы.НаличиеМатериала,
	|	Лико_ПодготовкаМатериалов.Ссылка,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКл.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЗаказКл.ОсновнойМатериал.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.НарезкаЗамена, """") = """"
	|			ТОГДА Лико_ПодготовкаМатериалов.Нарезка
	|		ИНАЧЕ Лико_ПодготовкаМатериалов.НарезкаЗамена
	|	КОНЕЦ,
	|	Лико_ПодготовкаМатериалов.ДатаПриходаМатериалаТекст,
	|	Лико_ПодготовкаМатериалов.СнятиеРезерва,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ2.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал
	|		ИНАЧЕ ВТ_ЗагрузкаРЦ2.ЗаказКлиента.ОсновнойМатериал.ОсновнаяНоменклатура
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПодготовкаМатериалов.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.NewFoil)
	|				И НЕ ВТ_ЗагрузкаРЦ2.ДопNF
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена, """") = """"
	|					ТОГДА ЗаказКл.ДопМатериалыСтрокой
	|				ИНАЧЕ Лико_ПодготовкаМатериалов.ДополнительныеМатериалыСтрокойЗамена
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗаказКл.Трафарет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Итог.Заказ КАК Заказ,
	|	Вт_Итог.НомерЗаказа КАК НомерЗаказа,
	|	Вт_Итог.НомерПроката КАК НомерПроката,
	|	Вт_Итог.Заказчик КАК Заказчик,
	|	Вт_Итог.Этикетки КАК Этикетки,
	|	Вт_Итог.МетражКВМ КАК МетражКВМ,
	|	Вт_Итог.МетражПМ КАК МетражПМ,
	|	Вт_Итог.Z КАК Z,
	|	Вт_Итог.Материал КАК Материал,
	|	Вт_Итог.ПоставщикЛюбой КАК ПоставщикЛюбой,
	|	Вт_Итог.ШтампыСтрокой КАК ШтампыСтрокой,
	|	Вт_Итог.ШтампВырубной КАК ШтампВырубной,
	|	Вт_Итог.ЦветаСтрокой КАК ЦветаСтрокой,
	|	Вт_Итог.Регион КАК Регион,
	|	Вт_Итог.ВремяНачала КАК ВремяНачала,
	|	Вт_Итог.РабочийЦентр КАК РабочийЦентр,
	|	Вт_Итог.СрокСдачи КАК СрокСдачи,
	|	Вт_Итог.ВремяОкончания КАК ВремяОкончания,
	|	Вт_Итог.ВремяВыполнения КАК ВремяВыполнения,
	|	Вт_Итог.Выполняется КАК Выполняется,
	|	Вт_Итог.ВидЗаказа КАК ВидЗаказа,
	|	Вт_Итог.ФормыСтрокой КАК ФормыСтрокой,
	|	Вт_Итог.Ручьи КАК Ручьи,
	|	Вт_Итог.ШагПечати КАК ШагПечати,
	|	Вт_Итог.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	Вт_Итог.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	Вт_Итог.ПлощадьКлише КАК ПлощадьКлише,
	|	Вт_Итог.СрочноеЦветоделение КАК СрочноеЦветоделение,
	|	Вт_Итог.Тираж КАК Тираж,
	|	Вт_Итог.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
	|	Вт_Итог.БезЛака КАК БезЛака,
	|	Вт_Итог.Этап КАК Этап,
	|	Вт_Итог.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Вт_Итог.ВидЭтапа КАК ВидЭтапа,
	|	Вт_Итог.Площадка КАК Площадка,
	|	Вт_Итог.ДатаПроверкиНаличияМатериала КАК ДатаПроверкиНаличияМатериала,
	|	Вт_Итог.ЗаменаМатериала КАК ЗаменаМатериала,
	|	Вт_Итог.ЗаменаНарезки КАК ЗаменаНарезки,
	|	Вт_Итог.ЗаменаДопМатериалов КАК ЗаменаДопМатериалов,
	|	Вт_Итог.НаличиеМатериала КАК НаличиеМатериала,
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка,
	|	Вт_Итог.МетражОбщий КАК МетражОбщий,
	|	Вт_Итог.Номенклатура.Артикул КАК Артикул,
	|	Вт_Итог.Нарезка КАК Нарезка,
	|	Вт_Итог.ДатаПриходаМатериала КАК ДатаПриходаМатериала,
	|	Вт_Итог.ДопМатериалы КАК ДопМатериалы,
	|	Вт_Итог.КоличествоВРезерве КАК КоличествоВРезерве,
	|	Вт_Итог.ДатаКонтроляМатериала КАК ДатаКонтроляМатериала,
	|	Вт_Итог.СнятиеРезерва КАК СнятиеРезерва,
	|	Вт_Итог.НФ КАК НФ,
	|	Вт_Итог.Номенклатура КАК Номенклатура,
	|	Вт_Итог.НаПроизводстве КАК НаПроизводстве,
	|	ВЫБОР
	|		КОГДА Вт_Итог.МетрыТиснения = Вт_Итог.МетрыТиснения1
	|			ТОГДА Вт_Итог.МетрыТиснения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Вт_Итог.МетрыТиснения = 0
	|					ТОГДА Вт_Итог.МетрыТиснения1
	|				ИНАЧЕ Вт_Итог.МетрыТиснения
	|			КОНЕЦ
	|	КОНЕЦ КАК МетрыТиснения,
	|	Лико_ПодготовкаМатериалов.ЕстьФормы КАК ЕстьФормы,
	|	Лико_ПодготовкаМатериалов.НаличиеМатериала КАК НаличиеМатериала1,
	|	Вт_Итог.МетражОбщий * Вт_Итог.Нарезка.Размер / 1000 КАК МетражОбщийМ2,
	|	Вт_Итог.Трафарет КАК Трафарет,
	|	ЕСТЬNULL(ВтЗаказыПечатьСКлеящегоСлоя.ЕстьПечатьСКлеящегоСлоя, ЛОЖЬ) КАК ЕстьПечатьСКлеящегоСлоя
	|ИЗ
	|	Вт_Итог КАК Вт_Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|		ПО Вт_Итог.Ссылка = Лико_ПодготовкаМатериалов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗаказыПечатьСКлеящегоСлоя КАК ВтЗаказыПечатьСКлеящегоСлоя
	|		ПО Вт_Итог.Заказ = ВтЗаказыПечатьСКлеящегоСлоя.ЗаказКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФильтрПоВидуЗаказа
	|				ТОГДА Лико_ПодготовкаМатериалов.ЗаказКлиента.ВидЗаказа = &ВидЗаказа
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Лико_ПодготовкаМатериалов.ЗаказКлиента.Площадка В(&Площадка)";
		
КонецПроцедуры //-Лико m.shenderov 09.04.2021

&НаКлиенте
Асинх Процедура РезервироватьПоШаблону(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Резервировать по шаблону?';"
	+ " en = 'Reserve by template?'"), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	РезервироватьПоШаблонуСервер(Элементы.ПланированиеЗаказов.ВыделенныеСтроки); 
	
	Элементы.ПланированиеЗаказов.Обновить();
	
КонецПроцедуры

Процедура РезервироватьПоШаблонуСервер(Знач Массив) //+Лико m.shenderov 08.02.2023
	
	Шаблон=НайтиШаблонРезервированияСервер(Массив);
	
	Если Не ЗначениеЗаполнено(Шаблон) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Док Из Массив Цикл
		
		УстановитьРезервПоШаблонуСервер(Док,Шаблон);
		
	КонецЦикла;
	
			
КонецПроцедуры //-Лико m.shenderov 08.02.2023


Функция НайтиШаблонРезервированияСервер(Массив) //+Лико m.shenderov 08.02.2023
	
	Индекс=0;
	
	Шаблон=Неопределено;
	
	Для каждого Док Из Массив Цикл
		
		Если Док.Резервирование.Количество()>0 Тогда
			
			Шаблон=Док;
			Прервать;
		КонецЕсли;
		
		Индекс=Индекс+1;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		
		Массив.Удалить(Индекс);
		
		Возврат Шаблон; 
		
	КонецЕсли;
	
	
	
КонецФункции //-Лико m.shenderov 08.02.2023 

Процедура УстановитьРезервПоШаблонуСервер(Док,Шаблон) //+Лико m.shenderov 08.02.2023

	Если Док.Резервирование.Количество()>0 Тогда
		Возврат;
	КонецЕсли;
	 ДокОбъект=Док.ПолучитьОбъект();
	 ДокОбъект.НаличиеМатериала=Шаблон.НаличиеМатериала;
	 ДокОбъект.ДатаПриходаМатериала=Шаблон.ДатаПриходаМатериала;
	 
	 Для каждого СтрШаблона Из Шаблон.Резервирование Цикл
        НоваяСтрРезерва=ДокОбъект.Резервирование.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрРезерва,СтрШаблона); 
		КоличествоРезервирования=0;
		РасчитатьКоличество(КоличествоРезервирования,Док,НоваяСтрРезерва.СтатьяЗатрат,НоваяСтрРезерва.НомерРаботы);
        НоваяСтрРезерва.КоличествоУпаковок	 = КоличествоРезервирования; 
		НоваяСтрРезерва.Количество			 = НоваяСтрРезерва.КоличествоУпаковок*НоваяСтрРезерва.Упаковка.Числитель;
		
	КонецЦикла;
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	

		
КонецПроцедуры //-Лико m.shenderov 08.02.2023


Процедура РасчитатьКоличество(КоличествоРезервирования,Документ,СтатьяЗатрат,НомерРаботы)
	
	Структура = Новый Структура;
	Структура.Вставить("СтатьяЗатрат",СтатьяЗатрат);
	Структура.Вставить("НомерРаботы",НомерРаботы);
	
	НайденныеСтроки=Документ.Материалы.НайтиСтроки(Структура);
	Для каждого Стр Из НайденныеСтроки Цикл
		КоличествоРезервирования=КоличествоРезервирования+Стр.КоличествоУпаковок;
		
		Если  Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Стр.Номенклатура,"Код")="n0000165119" Тогда
			
			КоличествоРезервирования=КоличествоРезервирования/3;	
			
		КонецЕсли;

		
	КонецЦикла;	
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеНарезка() // <-- Начало Лико Яцун С. В. 19.02.2024	
	
	Возврат; 
	
	МассивУсловногоОформленияНарезка = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ПланированиеЗаказовНарезка" Тогда
			МассивУсловногоОформленияНарезка.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияНарезка Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Если Найти(ПланированиеЗаказов.ТекстЗапроса,"втПодготовка") = 0 Тогда
		Запрос.Текст = ПланированиеЗаказов.ТекстЗапроса + " И ВЫРАЗИТЬ(Вт_Итог.Заказ КАК Документ.ЗаказКлиента).Цвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПечатьСКлеящегоСлоя)"; 
	Иначе
		Запрос.Текст = ПланированиеЗаказов.ТекстЗапроса + " И ВЫРАЗИТЬ(втПодготовка.Заказ КАК Документ.ЗаказКлиента).Цвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПечатьСКлеящегоСлоя)"; 
	КонецЕсли;
	Для каждого Парам Из ПланированиеЗаказов.Параметры.Элементы Цикл
		Запрос.УстановитьПараметр(Парам.Параметр, Парам.Значение);
	КонецЦикла;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПланированиеЗаказовНарезка");
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПланированиеЗаказов.Заказ");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ВыборкаДетальныеЗаписи.Заказ;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноКоричневый);
	КонецЦикла;

КонецПроцедуры // <-- Конец Лико Яцун С. В. 19.02.2024


