
&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
Объект.ДополнительныеРеквизиты.Очистить();
Для каждого ДопРеквизит Из Объект.ВидНоменклатуры.НаборСвойств.ДополнительныеРеквизиты Цикл
	
	НовыйРеквизит= Объект.ДополнительныеРеквизиты.Добавить();
	НовыйРеквизит.Свойство=ДопРеквизит.Свойство;
	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию,ЗначениеКопирования=Неопределено)
	
	
		СхемаКомпоновкиДанных = Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ПолучитьМакет("ОтборПоУсловию");
		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПоусловию.Инициализировать(ИсточникНастроек);
		
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ТекНастройки = Параметры.ЗначениеКопирования.ОтборНастройки.Получить();
	Иначе
		ТекНастройки = Объект.Ссылка.ОтборНастройки.Получить();

	КонецЕсли;
	
	
	Если ТекНастройки = Неопределено Тогда
		
		ОтборПоусловию.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПоусловию.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПоусловию.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
	Объект.ВидНоменклатуры=Объект.Родитель.ВидНоменклатуры;
	КонецЕсли;
	ИнициализироватьКомпоновкуДанных(Ложь,Параметры.ЗначениеКопирования);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 29.12.2018
	Если Объект.СложнаяНастройка Тогда
		Элементы.Простая.Видимость=Ложь;
		Элементы.Сложная.Видимость=Истина;
	Иначе
		Элементы.Простая.Видимость=Истина;
		Элементы.Сложная.Видимость=Ложь;

	КонецЕсли;
	
	Если Объект.ТипСписания=ПредопределенноеЗначение("Перечисление.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию") Тогда
		Элементы.КатегорияЭксплуатации.Видимость=Истина;
	Иначе
		Элементы.КатегорияЭксплуатации.Видимость=Ложь;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 29.12.2018


&НаКлиенте
Процедура СложнаяНастройкаПриИзменении(Элемент)
	УстановитьВидимость();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		УстановитьВидимость();

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


Если ТекущийОбъект.СложнаяНастройка Тогда
	 ТекущийОбъект.Описание=Строка(ОтборПоусловию.Настройки.Отбор);
	 ТекущийОбъект.ОтборНастройки = Новый ХранилищеЗначения(ОтборПоусловию.Настройки, Новый СжатиеДанных(9));
 Иначе
	 ТекущийОбъект.ОтборНастройки = Неопределено;

КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КатегорияЭксплуатацииПриИзменении(Элемент)
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТипСписанияПриИзменении(Элемент)
	УстановитьВидимость();
	Если Не Объект.ТипСписания=ПредопределенноеЗначение("Перечисление.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию") Тогда
		
		Объект.КатегорияЭксплуатации=Неопределено;

	КонецЕсли;
	
КонецПроцедуры

