#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ШтрихКод(ТипоРазмерСсылка) Экспорт 
	
	Перем ШК;
	
	ВидИнформации = 1;
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	
	ФКод = Формат(ТипоРазмерСсылка.Код, "ЧЦ=10; ЧВН=; ЧГ=");	
	ШК = "8" + ФВидИнформации + ФКод;


	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	
	ШК = ШК + КонтольныйСимвол;
	
	Возврат ШК;

	
	
КонецФункции

Функция ШтрихКодСтрокой(ТипоРазмерСсылка) Экспорт
	
	Перем ШК;
	ВидИнформации = 1;
	
	
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	
	ФКод = Формат(ТипоРазмерСсылка.Код, "ЧЦ=10; ЧН=0000000000; ЧВН=; ЧГ=0"); // 7 символов код объекта номенклатуры
	
	Разделитель = " ";
	
	ШК = "8"+ ФВидИнформации
	+ ФКод;
	
	ШКСтрокой = "8"+ ФВидИнформации + Разделитель
	+ ФКод;
	
	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШКСтрокой = ШКСтрокой + Разделитель + КонтольныйСимвол;
	
	Возврат ШКСтрокой;
КонецФункции //ПолучитьКороткийШтрихКод Экспорт

Функция НайтиСоздатьТипоразмер(Высота,Ширина,Глубина,Вес)Экспорт 

	УстановитьПривилегированныйРежим(Истина); 
	
	ЕдиницаИзмеренияВеса 	= Константы.ЕдиницаИзмеренияВеса.Получить();
	ЕдиницаИзмеренияОбъема 	= Константы.ЕдиницаИзмеренияОбъема.Получить();
	ЕдиницаИзмеренияДлины 	= Справочники.Лико_ПредопределенныеЗначения.ЕИМиллиметр.ЗначениеПараметра;
	
	
	
	
	
	ВысотаЕдиницаИзмерения	 = ЕдиницаИзмеренияДлины;
	ГлубинаЕдиницаИзмерения	 = ЕдиницаИзмеренияДлины;
	ШиринаЕдиницаИзмерения	 = ЕдиницаИзмеренияДлины;
	ВесЕдиницаИзмерения		 = ЕдиницаИзмеренияВеса;
	ОбъемЕдиницаИзмерения	 = ЕдиницаИзмеренияОбъема;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ТипоразмерыПаллет.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ТипоразмерыПаллет КАК Лико_ТипоразмерыПаллет
	|ГДЕ
	|	Лико_ТипоразмерыПаллет.Высота = &Высота
	|	И Лико_ТипоразмерыПаллет.Глубина = &Глубина
	|	И Лико_ТипоразмерыПаллет.Ширина = &Ширина
	|	И Лико_ТипоразмерыПаллет.Вес = &Вес
	|	И Лико_ТипоразмерыПаллет.ВысотаЕдиницаИзмерения = &ВысотаЕдиницаИзмерения
	|	И Лико_ТипоразмерыПаллет.ГлубинаЕдиницаИзмерения = &ГлубинаЕдиницаИзмерения
	|	И Лико_ТипоразмерыПаллет.ВесЕдиницаИзмерения = &ВесЕдиницаИзмерения
	|	И Лико_ТипоразмерыПаллет.ШиринаЕдиницаИзмерения = &ШиринаЕдиницаИзмерения";
	Запрос.УстановитьПараметр("Высота",Высота );
	Запрос.УстановитьПараметр("Ширина",Ширина );
	Запрос.УстановитьПараметр("Глубина",Глубина );
	Запрос.УстановитьПараметр("Вес",Вес );
	Запрос.УстановитьПараметр("ВысотаЕдиницаИзмерения",ВысотаЕдиницаИзмерения ); 
	Запрос.УстановитьПараметр("ГлубинаЕдиницаИзмерения",ГлубинаЕдиницаИзмерения );
	Запрос.УстановитьПараметр("ШиринаЕдиницаИзмерения",ШиринаЕдиницаИзмерения );
	Запрос.УстановитьПараметр("ВесЕдиницаИзмерения",ВесЕдиницаИзмерения );

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	    Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
	НовыйСправочник = СоздатьЭлемент();
	НовыйСправочник.Заполнить(Истина);
	НовыйСправочник.Высота = Высота;
	НовыйСправочник.Ширина = Ширина;
	НовыйСправочник.Глубина = Глубина;
	НовыйСправочник.Вес = Вес;
	
	Попытка
		НовыйСправочник.Записать();
	Исключение
		ОшибкаСообщение = "Ошибка при сохранении справочника Лико_ТипоразмерыПаллет: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
	КонецПопытки;

	
		
	Возврат НовыйСправочник.Ссылка;
	

	
	
	
	
КонецФункции  



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли