
&НаКлиенте
Процедура Лико_СканированиеТоварПосле(Команда)
КонецПроцедуры

&НаКлиенте
Процедура Лико_ОбработкаОповещенияВместо(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" Тогда   		
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияКлиентПереопределяемый.ЕстьНеобработанноеСобытие() Тогда
			
			//Преобразуем предварительно к ожидаемому формату
			Если Параметр[1] = Неопределено Тогда
				Штрихкод = Параметр[0];
			Иначе
				Штрихкод = Параметр[1][1];
			КонецЕсли;
	 		
		Если ПараметрыРежима.Режим = "ЗапросИнформации" Тогда			
				ВывестиИнформациюПоШтрихкодуНаСервере(Штрихкод); 				
			ИначеЕсли ПараметрыРежима.Режим = "Сканирование" Тогда
				ПердыдущийПараметрСканирования=ПараметрыРежима.ПараметрСканирования;
				ПриСканированииЗначенияНаСервере(Штрихкод);
				//+m.shenderov 18.07.2017
				Серия=ТекущаяСтрокаСканирования.Серия;
				ОбъектНоменклатуры= ЗначениеРеквизитаОбъектаСервер(Серия,"ЯССМ_ОбъектНоменклатуры");
				Если  ПараметрыРежима.ПараметрСканирования="Серия" или 
					(ПараметрыРежима.ПараметрСканирования="Номенклатура" и ПердыдущийПараметрСканирования="Количество") Тогда  	
					ПараметрыРежима.ПараметрСканирования = "Количество";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Серия) и 
					ЗначениеЗаполнено(ОбъектНоменклатуры) и ПараметрыРежима.ПараметрСканирования="Количество" Тогда
					ВводКоличестваОтменен=Ложь;					
					ВводКоличестваКоличество=ЗначениеРеквизитаОбъектаСервер(ОбъектНоменклатуры,"Количество"); 					
					ПриСканированииЗначенияНаСервере(ВводКоличестваКоличество);
					Если ПараметрыРежима.ПараметрСканирования="Серия" Тогда
						ПараметрыРежима.ПараметрСканирования="Номенклатура";
						ВывестиСостояниеВыполненияЗаданияСервер();
						УстановитьПараметрыЭлементовСканированияСерве();   
					КонецЕсли; 						
					
					
					//ПерейтиКСледующейСтрокеСканированияНаСервере();
					
					
					//ВводКоличестваКоличество=ЗначениеРеквизитаОбъектаСервер(ОбъектНоменклатуры,"Количество");
					//РабочееМестоРаботникаСкладаКлиент.ВводКоличестваКоличествоПриИзменении(ЭтаФорма); 
					//РабочееМестоРаботникаСкладаКлиент.ВводКоличестваОК(ЭтаФорма);
				КонецЕсли;
				
				//-m.shenderov 18.07.2017
				
				#Если НЕ ВебКлиент Тогда
					Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
						Сигнал();
					КонецЕсли;
				#КонецЕсли
				
			ИначеЕсли ПараметрыРежима.Режим = "ВыборЗадания"
				Или ПараметрыРежима.Режим = "ВыборОперации" Тогда
				
				ПриСканированииШтрихкодаЗаданияНаСервере(Штрихкод);
				
			Иначе
				
				// Данный режим не предназначен для сканирования.
				#Если НЕ ВебКлиент Тогда
					Сигнал();
				#КонецЕсли
				
			КонецЕсли;
			
			ПодключитьОбработчикОжидания("Подключаемый_ВывестиСостояниеВыполненияЗаданияОбработчикОжидания", 5, Истина);
			
		КонецЕсли;
		
	КонецЕсли;   
	
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры
//+m.shenderov 18.07.2017 

#Область Дополнительно
&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка,ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);	
КонецФункции
&НаСервере
Процедура ПроставитьКоличество()
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСостояниеВыполненияЗаданияСервер()
	РабочееМестоРаботникаСкладаСервер.ВывестиСостояниеВыполненияЗадания(ЭтаФорма);	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЭлементовСканированияСерве()
	РабочееМестоРаботникаСкладаСервер.УстановитьПараметрыЭлементовСканирования(ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПереместитьПосле(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Лико_ЛК_ПереместитьПеред(Команда)
	//Лико_Действие=1;
	//Элементы.СтраницаВыборОперации.Видимость=Ложь;
	//Элементы.СтраницаСканированияЛико.Видимость=Истина;
	ОткрытьФорму("Обработка.РабочееМестоРаботникаСклада.Форма.Лико_ФормаРабочегоМеста_320х320",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Лико_СканированиеДействияВместо(Команда)
	Если Лико_Действие>0 Тогда
		Лико_Действие=0;
	Элементы.СтраницаВыборОперации.Видимость=Истина;
	Элементы.СтраницаСканированияЛико.Видимость=Ложь;
Иначе
ПродолжитьВызов(Команда);	
КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Процедура Лико_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	а=1;
КонецПроцедуры


#КонецОбласти


