#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	БезПроизводныхЗначений = Неопределено;
	Параметры.Свойство("БезПроизводныхЗначений", БезПроизводныхЗначений);
	
	Если БезПроизводныхЗначений = Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ, НСтр("ru = 'Гражданин Российской Федерации';
																											|en = 'Citizen of the Russian Federation'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, подлежащий страхованию кроме высококвалифицированных иностранных специалистов';
																															|en = 'Foreign national who is temporarily staying in the Russian Federation and is subject to insurance except for highly-skilled foreign specialists'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами, НСтр("ru = 'Иностранец, которому предоставлено временное убежище, временно пребывающий на территории РФ';
																																				|en = 'Foreign national with a temporary granted asylum temporarily staying in the Russian Federation'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы, НСтр("ru = 'Приравнен к гражданам РФ (постоянно проживает, признан беженцем, гражданин страны-участника Договора о ЕАЭС)';
																																|en = 'Person equated to RF citizens (permanently living, recognized as refugees, citizens of the member country of the EAEU Treaty)'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, не подлежащий страхованию кроме высококвалифицированных иностранных специалистов';
																																		|en = 'Foreign national who is temporarily staying in the Russian Federation and is not subject to insurance except for highly-skilled foreign specialists'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы, НСтр("ru = 'Иностранец, временно проживающий на территории РФ';
																															|en = 'Foreign national temporarily residing in RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, постоянно проживающий на территории РФ';
																																						|en = 'Highly-skilled foreign specialist or their family member temporarily staying in the RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно проживающий на территории РФ';
																																					|en = 'Highly-skilled foreign specialist or their family member temporarily staying in the RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи из страны-участника Договора о ЕАЭС, временно пребывающий на территории РФ';
																																		|en = 'Highly-skilled foreign specialist or their family member from the EAEU countries, temporarily staying in the RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыНестрахуемые, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно пребывающий на территории РФ, не подлежащий страхованию';
																																				|en = 'Highly-skilled foreign specialist or their family member temporarily staying in the Russian Federation not subject to insurance'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, с 2023 года не подлежащий страхованию на ОПС в соответствии с международным договором';
																																			|en = 'A foreign citizen who is temporarily staying in the Russian Federation and was not subject to mandatory pension insurance since 2023 in accordance with the international contract'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеНаОПС, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, подлежащий страхованию только на ОПС в соответствии с международным договором';
																																			|en = 'A foreign citizen temporarily staying in the Russian Federation and subject only to MPI in accordance with the international contract'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает виды застрахованных лиц, которые относятся к высококвалифицированным специалистам.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования
//
Функция ВысококвалифицированныеСпециалисты() Экспорт
	
	Категории = Новый Массив;
	Категории.Добавить(ВысококвалифицированныеСпециалистыВременноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыИзЕАЭС);
	Категории.Добавить(ВысококвалифицированныеСпециалистыНестрахуемые);
	
	Возврат Категории;
	
КонецФункции

// Возвращает виды застрахованных лиц, которые являются валютными резидентами.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования
//
Функция ВалютныеРезиденты() Экспорт
	
	ВалютныеРезиденты = Новый Массив;
	ВалютныеРезиденты.Добавить(ГражданеРФ);
	ВалютныеРезиденты.Добавить(ПостоянноПроживающиеИностранцы);
	ВалютныеРезиденты.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	
	Возврат ВалютныеРезиденты;
	
КонецФункции


#КонецОбласти

#КонецЕсли