

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗаполнитьТаблицуТиповыеДокументы();

КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаботы

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦены

&НаКлиенте
Процедура ЦеныЦеноваяГруппаПриИзменении(Элемент)

	ЗаполнитьСтрокуТчЦеныДаннымиИзРегистра();
	РассчитатьНДС();

	
КонецПроцедуры


&НаКлиенте
Процедура ЦеныКоличествоПриИзменении(Элемент)
	
	ПересчетСуммы(); 
	РассчитатьНДС();

	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныЦенаПриИзменении(Элемент)
	
	ПересчетСуммы();
	РассчитатьНДС();

	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныСуммаПриИзменении(Элемент)
	
	ПересчетЦены(); 
	РассчитатьНДС();

	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныСтавкаНДСПриИзменении(Элемент)
	
	
	РассчитатьНДС();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРаботам(Команда)
   ЗаполнитьПоРаботамСервер();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТиповыеДокументы

&НаКлиенте
Процедура СписокТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОрганизацияПоставщикаПриИзменении(Элемент)
	ОрганизацияПоставщикаПриИзмененииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура ОрганизацияПокупателяПриИзменении(Элемент)
	ОрганизацияПокупателяПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТиповыеДокументы(Команда)
	ЗаполнитьТаблицуТиповыеДокументы();
КонецПроцедуры



//Основные каманды формы
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	ЗаполнитьТаблицуТиповыеДокументы() ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры 
 //Основные каманды формы



// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда,Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды




#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПоставщикаПриИзмененииНаСервере()
	
	Объект.ПлощадкаПоставщика = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Объект.ОрганизацияПоставщика);
	Объект.КонтрагентПоставщика = КонтрагентПоОрганизацииСервер(Объект.ОрганизацияПоставщика); 
	Объект.ПартнерПоставщика = Объект.КонтрагентПоставщика.Партнер;
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПокупателяПриИзмененииНаСервере()
	
	Объект.ПлощадкаПокупателя = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Объект.ОрганизацияПокупателя);
	
	Объект.КонтрагентПокупателя = КонтрагентПоОрганизацииСервер(Объект.ОрганизацияПокупателя); 
	Объект.ПартнерПокупателя = Объект.КонтрагентПокупателя.Партнер;


КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТиповыеДокументы() //+Лико m.shenderov 21.08.2018
	
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка",Объект.Ссылка);
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("ПоказыватьДокумент",ЗначениеЗаполнено(Объект.Ссылка));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеИзРегистраПоЦГСоо(ПлощадкаПоставщика, ПлощадкаПокупателя, Период, знач _ЦеноваяГруппа=Неопределено)
	
		
	СооЦГ = РегистрыСведений.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.ДанныеДляЗаполненияПоЦеновойГруппеСоо(
	ПлощадкаПоставщика,
	ПлощадкаПокупателя,
	Период,
	_ЦеноваяГруппа);
	
	
	Возврат СооЦГ
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТчЦеныДаннымиИзРегистра() 
	
	СооЦГ = ДанныеИзРегистраПоЦГСоо(
	Объект.ПлощадкаПоставщика,
	Объект.ПлощадкаПокупателя,
	Объект.Дата,
	Объект.Цены.Выгрузить().ВыгрузитьКолонку("ЦеноваяГруппа"));
	
	Для каждого СтрЦена Из Объект.Цены Цикл 
		
		СтруктураДанныхЦГ = СооЦГ[СтрЦена.ЦеноваяГруппа];
		
		Если ЗначениеЗаполнено(СтруктураДанныхЦГ) Тогда
			
			ЗаполнитьЗначенияСвойств(СтрЦена,СтруктураДанныхЦГ);
			
		КонецЕсли;
		
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТчЦеныДаннымиИзРегистраСервер() 
	
	СооЦГ = ДанныеИзРегистраПоЦГСоо(
	Объект.ПлощадкаПоставщика,
	Объект.ПлощадкаПокупателя,
	Объект.Дата,
	Объект.Цены.Выгрузить().ВыгрузитьКолонку("ЦеноваяГруппа"));
	
	Для каждого СтрЦена Из Объект.Цены Цикл 
		
		СтруктураДанныхЦГ = СооЦГ[СтрЦена.ЦеноваяГруппа];
		
		Если ЗначениеЗаполнено(СтруктураДанныхЦГ) Тогда
			
			ЗаполнитьЗначенияСвойств(СтрЦена,СтруктураДанныхЦГ);
			
		КонецЕсли;
		
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры 


&НаКлиенте
Процедура ЗаполнитьСтрокуТчЦеныДаннымиИзРегистра() 
	
	ТД = Элементы.Цены.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СооЦГ = ДанныеИзРегистраПоЦГСоо(Объект.ПлощадкаПоставщика,Объект.ПлощадкаПокупателя,Объект.Дата,ТД.ЦеноваяГруппа);
	
	СтруктураДанныхЦГ = СооЦГ[ТД.ЦеноваяГруппа];
	
	Если ЗначениеЗаполнено(СтруктураДанныхЦГ) Тогда
		
		ЗаполнитьЗначенияСвойств(ТД,СтруктураДанныхЦГ);
		
		ЗаполнитьЗначенияСвойств(Объект, СтруктураДанныхЦГ);
		
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчетСуммы()
	ТД = Элементы.Цены.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.Сумма = ТД.Количество*ТД.Цена;
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчетЦены()
	
	ТД = Элементы.Цены.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТД.Количество = 0 Тогда
		Возврат;
	КонецЕсли;

	
	ТД.Цена = ТД.Сумма/ТД.Количество
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция КонтрагентПоОрганизацииСервер(Организация) 

Возврат УправлениеСвойствами.ЗначениеСвойства(Организация,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
КонецФункции

&НаКлиенте
Процедура РассчитатьНДС()
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ТекущаяСтрока = Элементы.Цены.ТекущиеДанные;

	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	
КонецПроцедуры 


&НаСервере
Процедура РассчитатьНДССервер(Данные)
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	

	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Данные, СтруктураДействий, КэшированныеЗначения);

	
КонецПроцедуры 



&НаКлиенте
Процедура РассчитатьНДСТчЦеныСервер()
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	Для каждого СтрЦена Из Объект.Цены Цикл
		
		СтруктураДействий = Новый Структура;
		
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрЦена, СтруктураДействий, КэшированныеЗначения);
		
	
КонецЦикла;
	
		
	
	
КонецПроцедуры 

&НаКлиенте
Процедура НалогообложениеНДСПриИзменении(Элемент)
	РассчитатьНДСТчЦеныСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	РассчитатьНДСТчЦеныСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРаботамСервер()
	
	ЗаполнитьЦеновуюГруппуУРаботСервер();
	
	ТзРаботы = Объект.Работы.Выгрузить();
	ТзРаботы.Свернуть("ЦеноваяГруппа","Количество");
	
	Объект.Цены.Очистить();
	
	Для каждого СтрРабота Из ТзРаботы Цикл
		
		НоваяЦена = Объект.Цены.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЦена, СтрРабота); 
		
	КонецЦикла;
	ЗаполнитьТчЦеныДаннымиИзРегистраСервер();
	
	Для каждого СтрЦена Из Объект.Цены Цикл
		РассчитатьНДССервер(СтрЦена);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеновуюГруппуУРаботСервер()
	
	Для каждого СтрРабота Из  Объект.Работы Цикл
		
		СтрРабота.ЦеноваяГруппа = СтрРабота.Номенклатура.ЦеноваяГруппа;
		
	КонецЦикла;
	
КонецПроцедуры 



#КонецОбласти






