&НаКлиенте
Перем ПропуститьВопросПередЗаписью; // Для отработки записи после вопроса

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли; 
	
	ПрослеживаемостьТоваров=УправлениеСвойствами.ЗначениеСвойства(Объект.Организация,"Лико_ПрослеживаемостьТоваров");
	
	Если Параметры.Свойство("ЛикоЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЛикоЗначенияЗаполнения);
	КонецЕсли;
	
	УстановитьУсловноеОформление(); 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ПриЧтенииСозданииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий); 		
		//Элементы.ГруппаИнформация.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
		Если Параметры.Свойство("ВидОперации") и ЗначениеЗаполнено(Параметры.ВидОперации) Тогда
			Объект.ВидОперации=Параметры.ВидОперации;
		КонецЕсли;
		ЭтоБылНовый=Истина;
		
	Иначе
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТоварыОтбор;
		
		Если Объект.Проведен Тогда
			ЭтоБылПроведенный=Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ПечататьСкладОперацииДокументаПриПроведении=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечататьСкладОперацииДокументаПриПроведении",Ложь);
	ПроставитьЗаказВФормах();
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 
	
	Если  РольДоступна("АдминистраторСистемы") Или РольДоступна("Лико_РедактированиеКоличестоУУ") Тогда
		Элементы.ТоварыКоличество.Видимость		=Истина;
		Элементы.АвторДокумента.Вид=ВидПоляФормы.ПолеВвода;
		Элементы.РабочееМесто.Вид=ВидПоляФормы.ПолеВвода;
		Элементы.БезПеремещения.ТолькоПросмотр = Ложь;
		Элементы.ТоварыКоличество.ТолькоПросмотр	=Ложь; 	
		
	Иначе
		Элементы.АвторДокумента.Вид=ВидПоляФормы.ПолеНадписи;
		Элементы.РабочееМесто.Вид=ВидПоляФормы.ПолеНадписи;
		Элементы.БезПеремещения.ТолькоПросмотр = Истина;
		Элементы.ТоварыКоличество.ТолькоПросмотр=Истина;		  
	КонецЕсли;
	//
	//Если  Объект.Проведен  Тогда
	//ЭтотОбъект.ТолькоПросмотр=Истина;
	//КонецЕсли;
	
	КонтролироватьСкладПриходаРасхода=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("КонтролироватьСкладПриходаРасхода",ЛОжь);
	ЗаполнитьРаспоряжениеВнутреннейПереработки();
	ПолучитьОбновитьИнформациюТранспортныхНакладных();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ЦенаВключаетНДС = Истина;
	КонецЕсли;
	
	//Подсистема WebSocket
	ПоказыватьQRCode=Ложь;
	WebSocketСервер.Инициализация(ЭтаФорма,ПоказыватьQRCode);
	// Подсистема WebSocket
	
  УчетПравилПеремещенияТМЦ = Справочники.Лико_ПравилаПеремещенияТМЦ.СтартСистемы(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);

	//Сервер взаимодействия. Мобильные устройства.
	Лико_СерверВзаимодействияКлиент.ОтключениеМобильныхУстройств(ЭтаФорма);

КонецПроцедуры




&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма); 
	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);
	
	УстановитьУсловноеОформлениеВидаОпераци(ЭтаФорма);
	УстановитьУсловноеОформлениеТолькоПросмотр(ЭтаФорма,"ФормыКонверт","Объект.ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм); 
	УстановитьУсловноеОформлениеТолькоПросмотр(ЭтаФорма,"ФормыКонверт","Объект.ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм); 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.Лико_ПередачаТоваров);
	
	
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	
	//УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов);
	
	
	ПересчитатьВесОбъемВСтрокахТЧ();
	//Элементы.ГруппаИнформация.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	ЗаполнитьОписаниеБракаК2Сервер();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() 	
	Элементы.Получатель.Заголовок="Получатель";
	Элементы.ГруппаНомерЗаказа.Видимость=Ложь;
	Элементы.ТоварыАдресХраненияНовый.Видимость=Ложь;
	Элементы.АдресХранения.Видимость=Истина;
	Элементы.ЗаказВПереработку.Видимость=Ложь;
	Элементы.ЗаказКлиента.Видимость=Истина;
	Элементы.НомерБланка.Видимость=Истина;
	Элементы.БракМатериала.Видимость=Ложь;
	Элементы.ПричинаСписания.Видимость=Ложь;
	Элементы.ВнутренняяПродажаПеремещение.Видимость=Ложь;
	Элементы.ГруппаРеквизитовДляРеализации.Видимость=Ложь;
	Элементы.ГруппаПодписьДокумента.Видимость=Ложь;
	Элементы.КонвертПолучатель.Видимость = Ложь;
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=ИСтина;		
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Элементы.АдресХранения.Видимость=Ложь;		
		Элементы.Получатель.Заголовок="Рабочий центр";
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка");			
		КонецЕсли;
		Элементы.Получатель.Видимость=Истина;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
		
		Элементы.ВнутренняяПродажаПеремещение.Видимость=Истина;
	ИначеЕсли Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=Ложь;		
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ТоварыАдресХраненияНовый.Видимость=Истина;
		Элементы.Распоряжение.Видимость=Ложь;
		Элементы.АдресХранения.Видимость=Истина;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ВнутренняяПродажаПеремещение.Видимость=Истина;
ИначеЕсли Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаМОЛ") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=Истина;
		Элементы.ЗаказКлиентка.Видимость=Ложь;
		Элементы.НомерБланка.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ТоварыАдресХраненияНовый.Видимость=ЛОжь;
		Элементы.Распоряжение.Видимость=Ложь;
		Элементы.АдресХранения.Видимость=Ложь;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ВнутренняяПродажаПеремещение.Видимость=Истина;
		
		
		
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу") Тогда	
		Элементы.ГруппаДавальца.Видимость			=Истина;
		Элементы.ГруппаПереработка.Видимость		=Ложь;
		
		//Если Объект.ВозвратДавальцу Тогда
		//	Элементы.БракМатериала.Видимость		    = Истина; 
		//Иначе 
		//	Элементы.БракМатериала.Видимость		    = Ложь;
		//	
		//КонецЕсли;
		
		Если Объект.БракМатериала И  Объект.ВозвратДавальцу Тогда 
			
			Элементы.ГруппаПодписьДокумента.Видимость=Истина;
		Иначе
			
			Элементы.ГруппаПодписьДокумента.Видимость=Ложь;
			
		КонецЕсли;
		
			
		
		Элементы.ГруппаТоварыОтбор.Видимость		=Истина;
		Элементы.ГруппаФормы.Видимость				=Ложь;
		Элементы.ГруппаБрак.Видимость				=Ложь;
		Элементы.ГруппаДополнительно.Видимость		=Истина;
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;  
		Элементы.Получатель.Видимость					=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость		=Истина;
		//Элементы.ЗаказВПереработку.Видимость=Истина;
		
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку") Тогда	
		Элементы.ГруппаДавальца.Видимость			=Ложь;
		Элементы.ГруппаПереработка.Видимость		=Истина;
		
		ОбработатьПолеЗаказПереработчику();
		
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Истина;
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;  
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Истина;
		//Элементы.ЗаказВПереработку.Видимость=Истина;
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику") Тогда	
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=ИСтина;
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Истина;
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли; 	
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Истина;
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения") ИЛИ
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Истина;
		Элементы.ТоварыАдресХраненияНовый.Видимость=Истина;
	    Элементы.ЦенаВключаетНДС.Видимость=Ложь;
		Элементы.РаспоряжениеИнтеркампани.Видимость=Ложь; 
		Элементы.ГруппаСчет.Видимость=Ложь;
		Элементы.Группа2.Видимость=Ложь;
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Истина;
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Истина;
		Элементы.ГруппаПродажа.Видимость=Истина;
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Истина;  
		
		Если Не Объект.ВнутренняяПродажа Тогда
			Элементы.ГруппаРеквизитовДляРеализации.Видимость=Истина;  
		КонецЕсли;
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Ложь;
		Элементы.ГруппаФормы.Видимость=Истина;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=ИСтина;		
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка");
		КонецЕсли;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
		Элементы.НомерБланка.Видимость=Ложь;
		Элементы.АдресХранения.Видимость=Ложь;
		
		Элементы.Получатель.Видимость=Истина;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
		Элементы.ФормыКонвертПолучатель.Видимость=Ложь;
		Элементы.Получатель.Заголовок="Рабочий центр";
		
		
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм") Тогда
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
		Элементы.НомерБланка.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=Ложь;
		Элементы.АдресХранения.Видимость=Ложь;
		Элементы.ГруппаТоварыОтбор.Видимость=Ложь;
		Элементы.ГруппаФормы.Видимость=Истина;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.Получатель.Видимость=Ложь;	
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
		Элементы.ФормыКонвертПолучатель.Видимость=ЛОжь;;
		
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеФорм") Тогда
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
		Элементы.НомерБланка.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=Ложь;
		Элементы.АдресХранения.Видимость=Ложь;
		Элементы.ГруппаТоварыОтбор.Видимость=Ложь;
		Элементы.ГруппаФормы.Видимость=Истина;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.Получатель.Видимость=Ложь;	
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
		Элементы.ФормыКонвертПолучатель.Видимость=Истина; 
		Элементы.КонвертПолучатель.Видимость = Истина;
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=Ложь;		
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость=ИСтина;
		Элементы.ЗаказКлиента.Видимость=Ложь;
		Элементы.НомерБланка.Видимость=Ложь;
		//Элементы.БракМатериала.Видимость=Истина;
		Элементы.ПричинаСписания.Видимость=Истина;
		
		Если Не ЗначениеЗаполнено(Объект.Получатель) Тогда
			Объект.Получатель=ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка");
		КонецЕсли;	
		Элементы.Получатель.Видимость=Ложь;
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		Элементы.ВидОперации.ТолькоПросмотр=Истина;
	Иначе
		Элементы.ВидОперации.ТолькоПросмотр=Ложь;
	КонецЕсли;
	
	Если Объект.ОтражатьВБухгалтерскомУчете Тогда
		Элементы.ЦеныНоменклатуры.Видимость=Истина;
	Иначе
		Элементы.ЦеныНоменклатуры.Видимость=Ложь;
	КонецЕсли;
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание") Тогда
		Элементы.Организация.Вид=ВидПоляФормы.ПолеВвода;
	Иначе
		Элементы.Организация.Вид=ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Вид=ВидПоляФормы.ПолеВвода;
		
	КонецЕсли;
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку") ТОгда	
		
		Если Объект.ВнутренняяПереработка Или 
			ОБъект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу") Тогда
			Элементы.Распоряжение.Видимость=Ложь;
			Элементы.РаспоряжениеВнутренняяПереработка.Видимость=Истина;
		Иначе
			Элементы.Распоряжение.Видимость=Истина;
			Элементы.РаспоряжениеВнутренняяПереработка.Видимость=Ложь;
			
		КонецЕсли;
	Иначе
		Элементы.ГруппаПереработка.Видимость=Ложь;	
	КонецЕсли;
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу") ТОгда		
		
		Элементы.Распоряжение.Видимость=Ложь;
		Элементы.РаспоряжениеВнутренняяПереработка.Видимость=Истина;
		
		
	Иначе
		Элементы.ГруппаДавальца.Видимость=Ложь;
		Элементы.Распоряжение.Видимость=Истина;
		Элементы.РаспоряжениеВнутренняяПереработка.Видимость=Ложь;
		
	КонецЕсли;
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа") ТОгда		
		ЕСли Объект.ВнутренняяПродажа Тогда
			Элементы.Распоряжение.Видимость=Ложь;
			Элементы.РаспоряжениеВнутренняяПереработка.Видимость=Истина;
			Элементы.ЗаказКлиентаПродажа.Видимость=Истина;
		Иначе
			Элементы.Распоряжение.Видимость=Истина;
			Элементы.РаспоряжениеВнутренняяПереработка.Видимость=Ложь;
			Элементы.ЗаказКлиентаПродажа.Видимость=Ложь; 			
		КонецЕсли;
		
			
	Иначе
		Элементы.ГруппаПродажа.Видимость=Ложь;	
		
	КонецЕсли;
	
   		Если ПрослеживаемостьТоваров  Тогда
			Элементы.ГруппаТоварыПрослеживаемостьТоваров.Видимость=Истина;
		Иначе
			Элементы.ГруппаТоварыПрослеживаемостьТоваров.Видимость=Истина;
			
		КонецЕсли;

	
	
	
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьПолеЗаказПереработчику() //+Лико m.shenderov 20.08.2018
	Если Объект.ВнутренняяПереработка Тогда
		Элементы.ЗаказКлиента.Видимость		=Истина;
		Элементы.ЗаказВПереработку.Видимость	=Ложь;
		ОБъект.ЗаказВПереработку=Неопределено;
	Иначе
		Элементы.ЗаказКлиента.Видимость		=Ложь;
		Элементы.ЗаказВПереработку.Видимость	=Истина;
		Объект.ЗаказКлиента=Неопределено;
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 20.08.2018




&НаСервере
Процедура ПересчитатьВесОбъемВСтрокахТЧ()
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", "");
	
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено); 
		
		Если ПрослеживаемостьТоваров Тогда 
			
			СтрокаТЧ.ПартияПроизводства=СформироватьИмяПартииСервер(СтрокаТЧ.Номенклатура,СтрокаТЧ.Серия,ПрослеживаемостьТоваров);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьИмяПартииСервер(Номенклатура,Серия,ПрослеживаемостьТоваров) //+Лико m.shenderov 27.03.2023
		Возврат  Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.СформироватьИмяПартии(Номенклатура,Серия,ПрослеживаемостьТоваров);	
КонецФункции  //-Лико m.shenderov 27.03.2023


	
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Перем ТекущаяСтрока;
	Перем СтруктураДействий;
	Элементы.Товары.ТекущиеДанные.Серия=Неопределено;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	Суффикс = "";
	
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу"      , ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	//+m.shenderov 10.07.2017 
	
	Характеристика	=Элементы.Товары.ТекущиеДанные.Характеристика;
	СтатусУказанияСерий=Элементы.Товары.ТекущиеДанные.СтатусУказанияСерий;
	Нарезка			=ПолучитьНарезку(Характеристика);
	Серия			=Элементы.Товары.ТекущиеДанные.Серия;
	ОБъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Серия,"ЯССМ_ОбъектНоменклатуры");
	Если ЗначениеЗаполнено(ОБъектНоменклатуры) И Характеристика<>Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОБъектНоменклатуры,"Характеристика") ТОгда
		Элементы.Товары.ТекущиеДанные.Серия					=Неопределено;
		Элементы.Товары.ТекущиеДанные.СтатусУказанияСерий	=7;
		Элементы.Товары.ТекущиеДанные.Упаковка				=Неопределено;
	КонецЕсли;
	
	
	//Если ЗначениеЗаполнено(Нарезка) Тогда
	//	Элементы.Товары.ТекущиеДанные.Упаковка=ПолучитьУпаковку(Нарезка);
	//	КоличествоУпаковокПриИзменении(Элемент);
	//	
	//	Если ЗначениеЗаполнено(Серия)и Нарезка<>Серия.ЯССМ_ОбъектНоменклатуры.Нарезка Тогда
	//		ОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
	//		ОбъектНоменклатуры.Нарезка=Нарезка;
	//		ОбъектНоменклатуры.ЕдиницаИзмеренияУУ=Элементы.Товары.ТекущиеДанные.Упаковка;
	//		ОбъектНоменклатуры.Записать();
	//		Серия.ПолучитьОбъект.Записать();			
	//	КонецЕсли;		
	//КонецЕсли;	
	//-m.shenderov 10.07.2017	
	
КонецПроцедуры


//+m.shenderov 10.07.2017  
#Область Дополнительно
&НаСервереБезКонтекста
Функция ПолучитьНарезку (Характеристика)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,"ЯССМ_Нарезка")	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУпаковку(Нарезка)
	Возврат	Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка)
	
КонецФункции

&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);		
КонецФункции 

&НаКлиенте
Процедура ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры)
	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	КоличествоЭкземпляров=0;
	
	ТабДокумент=Лико_Дополнительно.ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры,,БыстраяПечать);
	//!ТабДокумент.ИмяПринтера = ИмяПринтера;
	
	//
	//ТабДокумент.АвтоМасштаб = Истина;
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.ПолеСлева = 1;
	//ТабДокумент.ПолеСправа = 0;
	//ТабДокумент.ПолеСнизу = 0;
	//ТабДокумент.ПолеСверху = 1;
	////
	//ТабДокумент.РазмерСтраницы="Custom";//нестандартный размер бумаги
	//ТабДокумент.ВысотаСтраницы=64;
	//ТабДокумент.ШиринаСтраницы=90; 		
	
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ТабДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если БыстраяПечать Тогда
		ТабДокумент.Напечатать();
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;  	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Суффикс = "";
	
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	ОткрытьПодборСерий("Товары");
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПодборСерий(ИмяТЧ, Текст = "", ТекущиеДанные = Неопределено)
	//НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные) ;
	
	//Если ТекущиеДанные=Неопределено Тогда
	
	Номенклатура=Элементы.Товары.ТекущиеДанные.Номенклатура;
	Характеристика=Элементы.Товары.ТекущиеДанные.Характеристика;
	//    Иначе
	//    Номенклатура=ТекущиеДанные.Номенклатура;
	//    Характеристика=ТекущиеДанные.Характеристика;  		 
	//КонецЕсли;
	
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Номенклатура);
	Структура.Вставить("Характеристика",Характеристика);
	Структура.Вставить("Склад",Объект.Склад);
	Структура.Вставить("ТолькоОстатки",Истина);
	
	
	ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(ИмяТЧ, Текст, ТекущиеДанные)
	// Вставить содержимое метода.
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий[ИмяТЧ],Текст, ТекущиеДанные)
		и Лико_ОбщегоНазначенияСервер.ЕстьОбъектНоменклатуры(ТекущиеДанные.Номенклатура,ТекущиеДанные.Характеристика) Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",ТекущиеДанные.Характеристика);
		Структура.Вставить("Склад",Объект.Склад);
		Структура.Вставить("ТолькоОстатки",Истина);
		
		
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;	 
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ОткрытьПодборСерийЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 28.09.2017
	
	Если РезультатФормы<>Неопределено Тогда
		Счет=0;
		Для каждого Результат Из РезультатФормы Цикл
			//Счет=Счет+1;
			//Если Счет=1 И  ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Серия) Тогда
			//	Счет=2;
			//КонецЕсли;
			//
			//Если Счет>1 Тогда 	
			//	
			//	//Если Не ЗначениеЗаполнено(Результат.Серия) Тогда
			//	
			//	Отбор= Новый Структура;
			//	Отбор.Вставить("Серия",Результат.Серия); 				
			//	
			//	НайденныеСтроки=Объект.Товары.НайтиСтроки(Отбор); 
			//	Если  НайденныеСтроки.Количество()>0 Тогда
			//		Элементы.Товары.ТекущаяСтрока=Объект.Товары.Индекс(НайденныеСтроки[0]);
			//		Для каждого Стр Из НайденныеСтроки Цикл
			//			
			//		КонецЦикла;
			//	Иначе
			//		Элементы.Товары.СкопироватьСтроку();
			//	КонецЕсли;
			//	
			//КонецЕсли; 			
			ТекСтрока				=Элементы.Товары.ТекущиеДанные;			
			ТекСтрока.Серия			=Результат.Серия;
			Данныесерии				=ПолучитьДанныеПоСерии(Результат.Серия);
			ТекСтрока.Упаковка		=ДанныеСерии.Упаковка;
			ТекСтрока.АдресХранения	=Результат.АдресХранения;
			ТекСтрока.КоличествоУпаковок=Данныесерии.Количество;
			ТекСтрока.СтатусУказанияСерий=8; 
			Если ПрослеживаемостьТоваров Тогда
				ТекСтрока.ПартияПроизводства=СформироватьИмяПартииСервер(ТекСтрока.Номенклатура,ТекСтрока.Серия,ПрослеживаемостьТоваров);
			КонецЕсли;	
			Действия 			= Новый Структура();
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( Действия,"");	
			//Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекСтрока,Действия,КэшированныеЗначения);						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 28.09.2017



&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор, ИмяТЧ)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(Объект, ПараметрыУказанияСерий, ТекущиеДанныеИдентификатор, ЭтаФорма);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоСерии(Серия) //+Лико m.shenderov 28.09.2017
	
	//Серия=Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Если Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
		Количество= Серия.ЯССМ_ОбъектНоменклатуры.Количество;
	Иначе
		Количество=1
	КонецЕсли;
	
	
	Структура = Новый Структура;
	
	Структура.Вставить("Количество",Количество);
	Структура.Вставить("Упаковка",Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);	
	Возврат Структура; 
	
	
КонецФункции  //-Лико m.shenderov 28.09.2017


&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СкладПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер () //+Лико m.shenderov 10.10.2017
	
	ПриЧтенииСозданииНаСервере();		
	ЗаполнитьСтатусыУказанияСерий();
КонецПроцедуры  //-Лико m.shenderov 10.10.2017

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерий() //+Лико m.shenderov 10.10.2017
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	
КонецПроцедуры  //-Лико m.shenderov 10.10.2017





&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор)и Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		//	ОчиститьСообщения(); 	
		//	ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//	ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","Лико_ПередачаТоваров");
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		
		
		Отказ=Истина;
	КонецЕсли; 
	СформироватьТаблицуТиповыхДокументов();

	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		//Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		//	Сообщить("Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!"); 			
		//КонецЕсли;
		Объект.АвторДокумента=ГлЛико_Оператор;
	КонецЕсли;
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьВидимость();
	ЗаполнитьТаблицуТиповыеДокументы();
	//Сервер взаимодействия. Мобильные устройства. 
	Лико_СерверВзаимодействияКлиент.ПодключениеМобильныхУстройств(ЭтаФорма);
	
	#Если МобильныйКлиент Тогда
		Элементы.ГруппаСканер.Видимость=Истина;
	#Иначе
		Элементы.ГруппаСканер.Видимость=Ложь;		
	#КонецЕсли

КонецПроцедуры



// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Объект.Получатель=Неопределено;
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		ПометитьНаУдалениеРаспоряжение(Объект.Распоряжение);	
		Объект.Распоряжение=Неопределено;	
	КонецЕсли;
	УстановитьВидимость();
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство") Или
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение") Или 
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание") Или
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм") Или
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм") ТОгда
		Объект.Партнер=Неопределено;
		Объект.Контрагент=Неопределено;
	Иначе
		Объект.Получатель=Неопределено;
	КонецЕсли;
	Объект.ВозвратДавальцу			=Ложь;
	Объект.ВнутренняяПереработка	=Ложь;
	Объект.ВнутренняяПродажа		=ложь;
 ПересчитатьВесОбъемВСтрокахТЧ();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()  
	//+ ---> Лико2.5 m.shenderov 11.04.2022
ОбновитьТекстДокументыНаОсновании();
//- <--- Лико2.5 m.shenderov 11.04.2022

	
	УстановитьУсловноеОформление();
	ПриЧтенииСозданииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// <-- Начало Лико Яцун С. В. 27.10.2025 
	Если ПараметрыЗаписи.Свойство("НарушинПринципФИФОЛИФО") И ПараметрыЗаписи.НарушинПринципФИФОЛИФО.Письмо <> "" Тогда
		Если Найти(ПараметрыЗаписи.НарушинПринципФИФОЛИФО.Вопрос,"ФИФО") > 0 Тогда
			МетодУчета = "ФИФО";
		Иначе
			МетодУчета = "ЛИФО";
		КонецЕсли;
		Если ПараметрыЗаписи.НарушинПринципФИФОЛИФО.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения") Тогда
			ТемаПисьма = "В перемещении С ответственного хранения " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип " + МетодУчета;
			ТекстПисьма = "В перемещении С ответственного хранения " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип " + МетодУчета + "<br>" + "<br>" + ПараметрыЗаписи.НарушинПринципФИФОЛИФО.Письмо;
		ИначеЕсли ПараметрыЗаписи.НарушинПринципФИФОЛИФО.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение") Тогда
			ТемаПисьма = "В Перемещении " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип " + МетодУчета;
			ТекстПисьма = "В Перемещении " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип " + МетодУчета + "<br>" + "<br>" + ПараметрыЗаписи.НарушинПринципФИФОЛИФО.Письмо;
		Иначе
			ТемаПисьма = "В Передаче в производство " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип " + МетодУчета;
			ТекстПисьма = "В Передаче в производство " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип " + МетодУчета + "<br>" + "<br>" + ПараметрыЗаписи.НарушинПринципФИФОЛИФО.Письмо;
		КонецЕсли;
		ОтправитьПисьмо(ТекстПисьма, ТемаПисьма, ПараметрыЗаписи.НарушинПринципФИФОЛИФО.Адресаты);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 27.10.2025
	
	СформироватьТаблицуТиповыхДокументов();
	ПослеЗаписиНаСервере();
	УстановитьВидимость();
	ЗаполнитьТаблицуТиповыеДокументы();
	
	Если ЭтоБылНовый И ПечататьСкладОперацииДокументаПриПроведении И Объект.Проведен Тогда
		Если Объект.Товары.Количество()>5 
			и (Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание")
			Или Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение")) Тогда
			ОписаниеОповещения= Новый ОписаниеОповещения("ПослеЗаписиПечатьСкладскойКарточки",ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещения,"Пеатать карточку складской операции?",РежимДиалогаВопрос.ДаНет);
		Иначе 			
			ПечатьСкладскойКарточки(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	
	ЗаполнитьРаспоряжениеВнутреннейПереработки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиПечатьСкладскойКарточки(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 15.05.2018
	
	Если  РезультатФормы= КодВозвратаДиалога.Да Тогда
		ПечатьСкладскойКарточки(Неопределено);
	КонецЕсли;
КонецПроцедуры //-Лико m.shenderov 15.05.2018


&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеВидаОпераци(Форма,
	ИмяПоляВводаВидОперации = "ВидОперации",
	ПутьКПолюОтбора = "Объект.Проведен") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаВидОперации].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения    = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение  = Истина;
	
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеТолькоПросмотр(Форма,
	
	ИмяПоля = "ФормыКонверт",
	ПутьКПолюОтбора = "Объект.ВидОперации",ЗначениеОтбора = Неопределено) Экспорт
	
	Если ЗначениеОтбора =Неопределено Тогда
		ЗначениеОтбора = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм;
	КонецЕсли;
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоля].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения    = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение  = ЗначениеОтбора;
		
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры







Процедура ПометитьНаУдалениеРаспоряжение(Ссылка) //+Лико m.shenderov 16.10.2017
	
	ОбъектСсылка=Ссылка.получитьОбъект();
	ОбъектСсылка.ПометкаУдаления=Истина;
	ОбъектСсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //-Лико m.shenderov 16.10.2017

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
	Если ИмяСобытия = "Запись_ТранспортнаяНакладная" Тогда
		//+ ---> Лико2.5 m.shenderov 11.04.2022
		//ПолучитьОбновитьИнформациюТранспортныхНакладных();
		ОбновитьТекстДокументыНаОсновании(); 
		//- <--- Лико2.5 m.shenderov 11.04.2022	КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоШтрихкодуТабличногоДокументаСервер(Штрихкод) //+Лико m.shenderov 23.08.2018
	МенеджерыОбъектов = Новый Массив();
	МенеджерыОбъектов.Добавить(Документы.Лико_ЗаявкаНаСклад.ПустаяСсылка()); 
	МенеджерыОбъектов.Добавить(Документы.Лико_ЗаказНаРаскрой.ПустаяСсылка());

	Возврат	ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, МенеджерыОбъектов);
	
	
КонецФункции  //-Лико m.shenderov 23.08.2018


&НаСервере 
Процедура ОбработатьШтрихКодДокумента(МассивСсылок)

	Для каждого СсылкаДокумента Из МассивСсылок Цикл

		Если ТипЗНЧ(СсылкаДокумента)=Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
			Объект.ЗаявкаНаСклад=СсылкаДокумента;
			Объект.ЗаказКлиента= СсылкаДокумента.ЗаказКлиента;
			Объект.Получатель= СсылкаДокумента.РабочийЦентр; 
			Объект.Партнер =  СсылкаДокумента.Партнер;
			Объект.Контрагент =  СсылкаДокумента.Контрагент;
			Если Не Объект.Проведен И Не ЗначениеЗаполнено(Объект.Распоряжение) И ЗначениеЗаполнено(СсылкаДокумента.ВидОперации) Тогда
				Объект.ВидОперации= СсылкаДокумента.ВидОперации;
			КонецЕсли;
			
			Если Объект.ЗаказКлиента.ДавальческоеСырье И объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку ТОгда
				Контрагент=УправлениеСвойствами.ЗначениеСвойства(Объект.ЗаказКлиента.Площадка.Организация,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
				Объект.Партнер=Контрагент.Партнер;
				Объект.Контрагент=Контрагент;
				Объект.АдресХранения= УправлениеСвойствами.ЗначениеСвойства(Объект.ЗаказКлиента.Площадка.Организация,"Лико_ЗонаПриемкиСИМ"); 
				ОБъект.ВнутренняяПереработка=Истина;


			КонецЕсли;
			Объект.Товары.Загрузить(СсылкаДокумента.Товары.Выгрузить());

		КонецЕсли;


	КонецЦикла;


КонецПроцедуры



&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		МенеджерыОбъектов = Новый Массив();
		МенеджерыОбъектов.Добавить(ПредопределенноеЗначение("Документ.Лико_ЗаявкаНаСклад.ПустаяСсылка"));
		МенеджерыОбъектов.Добавить(ПредопределенноеЗначение("Документ.Лико_ЗаказНаРаскрой.ПустаяСсылка"));

		МассивСсылок =ПолучитьСсылкуПоШтрихкодуТабличногоДокументаСервер(ДанныеШтрихкода.Штрихкод);
		Если МассивСсылок.Количество()<>0 Тогда
			ОбработатьШтрихКодДокумента(МассивСсылок);
			УстановитьВидимость();
		Иначе
			
			
			Сообщить(Результат.Ошибка);
		КонецЕсли;
		
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			Объект.НомерБланка=Результат.НомерБланка;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа); 			
			
		ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			
			Объект.Сотрудник = Результат.Сотрудник;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 			
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			
			
			Если Не ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда
				
				Сообщить("Штрих код не найден! "+ Результат.ШК);
				Возврат;	
			КонецЕсли;
			
			ОбработатьШКНоменклатуры(Результат);
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Конверта") Тогда
			
							
			
			Конверт= Результат.Конверт;
			
			Если  ТекущийЭлемент = Элементы.КонвертПолучатель Тогда
				Объект.КонвертПолучатель = Конверт;
			Иначе
				
				
				Структура = Новый Структура;
				Структура.Вставить("Конверт",Конверт);
				
				ОписаниеОповещения= Новый ОписаниеОповещения("ПодборФормЗавершение",ЭтаФорма);
				ОткрытьФорму("Справочник.Лико_Формы.Форма.ФормаПодбора",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			КонецЕсли;
		
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
			ОБъект.Получатель=Результат.РабочийЦентр;
			
			
		ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//Это ячейка
			Если  ТекущийЭлемент = Элементы.АдресХранения или Элементы.Товары.ТекущиеДанные=Неопределено Тогда
				Объект.АдресХранения=Результат.АдресаХранения;
			Иначе
				
				Элементы.Товары.ТекущиеДанные.АдресХраненияНовый = Результат.АдресаХранения;
			КонецЕсли;
			
		//ИначеЕсли Не ЗначениеЗаполнено(Результат.ВидШК) Тогда
		//	ОбработатьШтрихкодыТиповой(ДанныеШтрихкода);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаказКлиентаПоНомеру(НомерЗаказа) //+Лико m.shenderov 30.11.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерБезПрефикса = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомерЗаказа );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
	
	
КонецФункции  //-Лико m.shenderov 30.11.2017



#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШКНоменклатуры(Результат);
	
	СтруктураНоменклатура = Новый Структура;
	ПолучитьСтруктуруОбъектаНоменклатуры(СтруктураНоменклатура,Результат.ОбъектНоменклатуры);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура",СтруктураНоменклатура.Номенклатура);
	СтруктураПоиска.Вставить("Характеристика",СтруктураНоменклатура.Характеристика);
	СтруктураПоиска.Вставить("Серия",СтруктураНоменклатура.Серия);
	
	НайденныеСтроки=Объект.Товары.НайтиСтроки(СтруктураПоиска);	
	
	Если  НайденныеСтроки.Количество()=0 Тогда
		
		НовыйТовар = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатура);
		//Если СтруктураНоменклатура.Уникальный Тогда
		НовыйТовар.СтатусУказанияСерий=8;		
		
		//КонецЕсли;
		Элементы.Товары.ТекущаяСтрока=НовыйТовар.ПолучитьИдентификатор(); 
		//ТоварыНоменклатураПриИзменении(Неопределено);
		//ТоварыКоличествоУпаковокПриИзменении(Неопределено);
		ПослеЗаписиНаСервере();
		Если Не ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.АдресХранения) Тогда
			
			ОткрытьПодборСерий("Товары");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 14.01.2018



&НаСервереБезКонтекста
Процедура ПолучитьСтруктуруОбъектаНоменклатуры(Структура,ОбъектНоменклатуры) //+Лико m.shenderov 14.01.2018
	
	Структура.Вставить("Номенклатура"	,	ОбъектНоменклатуры.Номенклатура);
	Структура.Вставить("Характеристика" ,	ОбъектНоменклатуры.Характеристика);
	Структура.Вставить("Упаковка"       ,   ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);
	Структура.Вставить("КоличествоУпаковок",ОбъектНоменклатуры.Количество);
	Структура.Вставить("Количество"     ,	ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);
	
	Структура.Вставить("Серия"          ,	ОбъектНоменклатуры.Серия);
	Структура.Вставить("Уникальный"     ,   ОбъектНоменклатуры.Уникальный);
	
	АдресХранения=Неопределено;
	
	МассивАХ=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерииМассив(ОбъектНоменклатуры.Серия);
	
	//Если ОбъектНоменклатуры.Уникальный И ЗначениеЗаполнено(ОбъектНоменклатуры.Серия) Тогда
	Если МассивАХ.Количество()=1 Тогда
		
		//АдресХранения=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерии(ОбъектНоменклатуры.Серия);
		АдресХранения=МассивАХ[0];
		
	КонецЕсли;
	Структура.Вставить("АдресХранения" ,АдресХранения);
	
	
	
КонецПроцедуры  //-Лико m.shenderov 14.01.2018





&НаКлиенте
Процедура ОбработатьШтрихкодыТиповой(ДанныеШтрихкодов)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул")); 	
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПересчитатьВесОбъем");
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( СтруктураДействийСДобавленнымиСтроками,"");
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	СтруктураДействийСИзмененнымиСтроками.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьВесОбъем");
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСИзмененнымиСтроками,"");
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = Новый Структура;
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ПересчитатьВесОбъем");
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий;
	СтруктураДействий.ТолькоТовары                           = Истина;
	
	
	СтруктураДействий.ДействияСНеизвестнымиШтрихкодами       = "НетДействий";
	СтруктураДействий.СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = СтруктураДействийСоСтрокамиИзУпаковочныхЛистов;
	
	
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
		
	КонецЕсли;
	
	Элементы.Товары.ТекущиеДанные.АдресХранения=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерии(Элементы.Товары.ТекущиеДанные.Серия,Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураДействий,КэшированныеЗначения);
	
	СтруктураДействийСТекущейСтрокой = Новый Структура;
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	//СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока);
	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействийСТекущейСтрокой, КэшированныеЗначения);
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	//+m.shenderov 11.07.2017
	ПечатьЭтикеток=Ложь ;	
	ОчиститьСообщения();  	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрано ни одного товара.'");
		
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	Для каждого Стр Из ВыделенныеСтроки Цикл
		Товар= Объект.Товары.НайтиПоИдентификатору(Стр);
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Серия,"ЯССМ_ОбъектНоменклатуры")); 
		ПечатьЭтикеток=Истина;
	КонецЦикла;	
	Если ПечатьЭтикеток Тогда
		Возврат;
	КонецЕсли;
	//-m.shenderov 11.07.2017
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю1(Команда)
	Объект.ЧленКомиссии1=ГлЛико_Оператор;
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю2(Команда)
	Объект.ЧленКомиссии2=ГлЛико_Оператор;
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю3(Команда)
	Объект.ЧленКомиссии3=ГлЛико_Оператор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборФорм(Команда)
	ОписаниеОповещения= Новый ОписаниеОповещения("ПодборФормЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_Формы.Форма.ФормаПодбора",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПодборФормЗавершение(РезультатФормы,ПараметрыФормы) Экспорт  
	Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
		Для каждого Форма Из РезультатФормы.Массив Цикл
			Если Объект.Формы.НайтиСтроки(Новый Структура("Форма",Форма)).количество()=0 Тогда
				НоваяФорма=Объект.Формы.Добавить();
				НоваяФорма.Форма=Форма;
				НоваяФорма.Конверт=РезультатФормы.Соответствие[Форма];
			КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЕсли;
	ПроставитьЗаказВФормах();
КонецПроцедуры 

&НаКлиенте
Процедура ДанныеПоНаработке(Команда)
	Объект.ДанныеПоНаработке = Не Объект.ДанныеПоНаработке;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Склад",Объект.Склад);
	Структура.Вставить("Помещение",Объект.Помещение);
	Структура.Вставить("Период",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	Структура.Вставить("ТолькоОстатки",Истина);
	
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 25.10.2017
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		
		Для каждого Товар Из РезультатФормы  Цикл
			ТекущаяСтрока = Товар;
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
			
			// Если  ЗначениеЗаполнено(Товар.Серия) Тогда
			//    
			// СтруктураСерии= ПолучитьСтруктуруСерии(Товар.Серия);
			// 
			// 
			//КонецЕсли;
			
			
			СтруктураНоменклатуры = Новый Структура;
			СтруктураНоменклатуры.Вставить("Номенклатура");
			СтруктураНоменклатуры.Вставить("Характеристика");
			СтруктураНоменклатуры.Вставить("Серия");
			
			ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 			 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
				
				НовыйТовар.АдресХранения=Товар.Ячейка;
				
				
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");  
				
				
				
				
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ПослеЗаписиНаСервере();
		
		
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 25.10.2017


&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСерии(Серия) //+Лико m.shenderov 24.10.2017
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Неопределено);
	Структура.Вставить("Характеристика",Неопределено);
	Структура.Вставить("КоличествоУпаковок",Неопределено);
	Структура.Вставить("Серия",Неопределено);
	Структура.Вставить("Упаковка",Неопределено);
	Структура.Вставить("Количество",Неопределено); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|	СерииНоменклатуры.Ссылка КАК Серия,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Характеристика КАК Характеристика,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество КАК КоличествоУпаковок,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество * СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК Количество
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Ссылка = &Серия";
	Запрос.УстановитьПараметр("Серия",Серия );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.10.2017

&НаСервере
Процедура ЗаявкаНаСкладПриИзмененииНаСервере()
	ЗаполнитьПоЗаявке();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаявке()
	
	Если ЗначениеЗаполнено(Объект.ЗаявкаНаСклад) Тогда
		//Объект.Получатель=Объект.ЗаявкаНаСклад.РабочийЦентр;
		//Объект.ЗаказКлиента=Объект.ЗаявкаНаСклад.ЗаказКлиента;
		//Объект.НомерБланка=Объект.ЗаявкаНаСклад.НомерБланка;
		
		Объект.ЗаказКлиента= Объект.ЗаявкаНаСклад.ЗаказКлиента;
		Объект.Получатель= Объект.ЗаявкаНаСклад.РабочийЦентр; 
		Объект.Партнер =  Объект.ЗаявкаНаСклад.Партнер;
		Объект.Контрагент =  Объект.ЗаявкаНаСклад.Контрагент;
		Если Не Объект.Проведен И Не ЗначениеЗаполнено(Объект.Распоряжение) И ЗначениеЗаполнено(Объект.ЗаявкаНаСклад.ВидОперации) Тогда
			Объект.ВидОперации= Объект.ЗаявкаНаСклад.ВидОперации;
			Объект.Товары.Загрузить(Объект.ЗаявкаНаСклад.Товары.Выгрузить());

		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаСкладПриИзменении(Элемент)
	ЗаявкаНаСкладПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер,Объект.Контрагент );
	Объект.ПодписьДокументаСотрудником=Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерПриИзмененииНаСервере();
КонецПроцедуры



#КонецОбласти


&НаКлиенте
Процедура ПечатьСкладскойКарточки(Команда)
	
	Если Не Объект.Проведен Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Распечатать карточку складской операции можно только после проведения документа!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("ДатаВремя", Объект.Дата);
	Данные.Вставить("Номер", Объект.Номер);
	Данные.Вставить("ВидОперации", Объект.ВидОперации);
	Данные.Вставить("НомерЗаказа", Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента,"Номер"),7));
	Данные.Вставить("Сотрудник", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.Сотрудник)));
	
	Данные.Вставить("Получатель", ОпределитьПолучателя());
	Данные.Вставить("АвторДокумента", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.АвторДокумента)));
	
	//Если Товары.Количество()>3 Тогда
	//	Если Вопрос("Будет распечатано "+Товары.Количество()+" карточек складских операций. Вы уверены, что хотите распечатать все эти карточки?", РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, "Внимание!")=КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	КоличествоКопий = 1;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		Данные.Вставить("КоличествоЕдиницаИзмерения", "" + СтрокаТовары.Количество + " " + СтрокаТовары.Упаковка);
		Данные.Вставить("ОбъектНоменклатуры", СтрокаТовары.Серия);
		Данные.Вставить("Дополнительное", "");
		
		// переопределим адрес хранения для ролика
		Если ЗначениеЗаполнено(СтрокаТовары.АдресХраненияНовый) Тогда
			Данные.Вставить("Получатель", СтрокаТовары.АдресХраненияНовый);
		КонецЕсли;
		
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСкладскойОперации(Данные, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		
		ТабДокумент.Напечатать();
		
	КонецЦикла;
	
	
	Если Объект.Формы.Количество()>0 Тогда
		Данные.Вставить("ОбщийПолучатель",Объект.Получатель);
		//ВремФормы = Объект.Формы.Выгрузить();
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ФормыПечатьСкладскойОперации(Объект.Ссылка, Данные, Ложь, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		Если СразуНаПринтер() Тогда
			ТабДокумент.Напечатать(СразуНаПринтер());
		Иначе
			ТабДокумент.Показать();
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Функция  ОпределитьПолучателя() //+Лико m.shenderov 14.01.2018
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство") Тогда
		Возврат Объект.Получатель;
	Иначе
		Возврат Объект.АдресХранения;
	КонецЕсли;
	
	
КонецФункции  //-Лико m.shenderov 14.01.2018



&НаКлиенте
Процедура ПечатьСтикераДокумента1(Команда)
	ПечатьСтикераДокумента();
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСтикераДокумента(БыстраяПечать=Истина)  	
	ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСтикераДокумента(Объект.Ссылка);	
	
	Если ПечатьСразуНаПринтер() Тогда
		ТабДокумент.Напечатать(БыстраяПечать);
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПечатьСразуНаПринтер() //+Лико m.shenderov 19.10.2017
	Возврат	Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
КонецФункции  //-Лико m.shenderov 19.10.2017



&НаСервереБезКонтекста
Функция СразуНапринтер() //+Лико m.shenderov 22.10.2017
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	
КонецФункции  //-Лико m.shenderov 22.10.2017

&НаКлиенте
Асинх Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.Товары.ТекущиеДанные;
	
	Если Поле.Имя="ТоварыСерия" Тогда
		Если ЗначениеЗаполнено(ТД.Серия) Тогда
			Структура = Новый Структура;
			Структура.Вставить("Ключ",ТД.Серия);
			ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаОбъекта",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
	Если Поле.Имя="ТоварыСерияЯССМ_ОбъектНоменклатурыКатегория2" Тогда
		
		Если  ЭтоШтампСервер(ТД.Номенклатура) Тогда
			
			ЗапенитьКатегориюНаСервере(Элементы.Товары.ТекущиеДанные.Серия); 		
			ОбновитьИнтерфейс();
		Иначе
			
		Ждать ПредупреждениеАсинх("Устанавливать признак можно только для штампов!");	
			
		КонецЕсли;
	КонецЕсли;
	
	
    Если Поле.Имя="ТоварыПартияПроизводства" Тогда
		Структура=ЗаполнитьСтруктуруДляПартииПроизводстваСервер(ТД.Серия);
		
		Если ЗначениеЗаполнено(Структура) Тогда
			ОписаниеОповещения= Новый ОписаниеОповещения("ТоварыПартияПроизводстваЗавершение",ЭтаФорма);
			ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлементаПрослеживаемость",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыПартияПроизводстваЗавершение(Результат,Параметры)Экспорт  //+Лико m.shenderov 27.03.2023
	
	ТД=Элементы.Товары.ТекущиеДанные;
	
	ТД.ПартияПроизводства=СформироватьИмяПартииСервер(Тд.Номенклатура,Тд.Серия,ПрослеживаемостьТоваров);
	
КонецПроцедуры //-Лико m.shenderov 27.03.2023



&НаСервереБезКонтекста
Функция  ЭтоШтампСервер(Номенклатура)  //+Лико m.shenderov 12.12.2022
	
	Если Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции  //-Лико m.shenderov 12.12.2022


&НаСервере
Процедура ЗапенитьКатегориюНаСервере(Серия) //+Лико m.shenderov 30.05.2018
	ОбъектНоменклатуры=Серия.ЯССМ_ОБъектНоменклатуры;
	Если  ОбъектНоменклатуры.Уникальный Тогда
		ОбъектНоменклатурыОбъект=ОбъектНоменклатуры.ПолучитьОбъект();
		ОбъектНоменклатурыОбъект.Категория2= Не ОбъектНоменклатурыОбъект.Категория2;
		ОбъектНоменклатурыОбъект.Записать();
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 30.05.2018


&НаСервереБезКонтекста
Функция ЗаполнитьСтруктуруДляПартииПроизводстваСервер(Серия) //+Лико m.shenderov 27.03.2023
	
	Если ЗначениеЗаполнено(Серия) Тогда
		
		ОН=Серия.ЯССМ_ОбъектНоменклатуры;
		
		Если ОН.Уникальный И ОН.Номенклатура.Лико_КонтрольПартииПроизводстваТовара  Тогда 
			
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Он);
			
		 Возврат Структура;
		
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецФункции  //-Лико m.shenderov 27.03.2023




&НаСервере
Процедура ЗаказВПереработкуПриИзмененииНаСервере()
	ОБъект.Товары.Загрузить(Объект.ЗаказВПереработку.Материалы.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаказВПереработкуПриИзменении(Элемент)
	Режим 					= РежимДиалогаВопрос.ДаНет;	
	ОписаниеОповещения		= Новый ОписаниеОповещения("ДобавитьМатериалИзЗаказаНаПереработку",ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения,"Добавить материал из заказа?. Таблица материалов будет отчищена!",Режим,);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериалИзЗаказаНаПереработку (РезультатВопроса,ПараметрыВопроса) Экспорт//+Лико m.shenderov 18.01.2018
	ЕСли РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ЗаказВПереработкуПриИзмененииНаСервере();
		ПослеЗаписиНаСервере();
		
	КонецЕсли;
КонецПроцедуры //-Лико m.shenderov 18.01.2018



Процедура ПроставитьЗаказВФормах()
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Форма Из Объект.Формы Цикл
		Форма.ЗаказКлиента=Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",Лев(Форма.Форма.Код,7)); 		

	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ФормыФормаПриИзменении(Элемент)
	ПроставитьЗаказВФормах();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуСЦенами() //+Лико m.shenderov 24.02.2018
	Если Объект.ОтражатьВБухгалтерскомУчете Тогда
		ТзНоменклатура=Объект.Товары.Выгрузить();
		ТзНоменклатура.Свернуть("Номенклатура","Количество");
		Объект.ЦеныНоменклатуры.Загрузить(ТзНоменклатура);
	Иначе
		Объект.ЦеныНоменклатуры.Очистить();
		
		
	КонецЕсли;
	
	Если Объект.ВнутренняяПродажа  Тогда
		Для каждого Номенклатура Из Объект.ЦеныНоменклатуры Цикл
			
			//Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
			//	Сумма=Лико_Планирование.СтоимостьЗаказаДляПередачиМеждуОрганизациями(ОБъект.ЗаказКлиента,ПолучитьОрганизациюПоКонтрагенту(Объект.Контрагент));  
			//	Цена=Сумма/Объект.Товары.Итог("Количество");
			//	Номенклатура.Цена=Цена;
			//Иначе
				Для каждого Товар Из Объект.Товары Цикл
					Если Товар.Номенклатура=Номенклатура.Номенклатура Тогда
						СтруктураЦены=Лико_ОбщегоНазначенияСервер.ПолучитьСтруктуруЦеныНоменклатуры(Объект.Организация,Товар.Номенклатура,Объект.Дата,Товар.Серия);
						Если ТипЗнч(СтруктураЦены)=Тип("Структура") Тогда 							
							Цена=?(ЗначениеЗаполнено(СтруктураЦены.ЦенаИзПоставкиУпр),СтруктураЦены.ЦенаИзПоставкиУпр,СтруктураЦены.ЦенаИзПоследнейПоставкиУпр);
							Если ЗначениеЗаполнено(Цена) Тогда
								Номенклатура.Цена=Цена*1.01;
							КонецЕсли; 													
							Прервать;
						КонецЕсли;						
					КонецЕсли;			
				КонецЦикла;				
			//КонецЕсли;
			//СтруктураЦены=Лико_ОбщегоНазначенияСервер.СтруктураЦеныПоЦенновойГрупе(Номенклатура.Номенклатура.ЦеноваяГруппа,Объект.Организация);
			//Номенклатура.Цена=СтруктураЦены.ЦенаПоставщика*1.01;

		КонецЦикла;
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 24.02.2018


&НаКлиенте
Процедура ОтражатьВБухгалтерскомУчетеПриИзменении(Элемент)
	ЗаполнитьТаблицуСЦенами();
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью180326(Отказ, ПараметрыЗаписи)
	 
	 Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	
	
	Если  КонтролироватьСкладПриходаРасхода Тогда
		Стоп=Ложь;
		Для каждого Товар Из Объект.Товары Цикл
			НомерСтроки=Товар.ПолучитьИдентификатор();
			
			ПомещениеРасход=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.АдресХранения,"Помещение");
			Если Объект.Помещение<>	ПомещениеРасход Тогда
				Стоп=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Расход товара с помещения:"""+Строка(ПомещениеРасход)+""" запрещено!";
				Сообщение.Поле = "Объект.Товары["+Формат(НомерСтроки,"ЧГ=")+"].АдресХранения"; //имя реквизита 
				Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
				Сообщение.Сообщить();
			КонецЕсли;
			
			
		КонецЦикла;	
		Если  Стоп Тогда
			Отказ=Истина;
			Возврат; 		
			
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Проведен и Не ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПоказатьПредупреждение(Неопределено, "Перед записью документа необходимо отменить проведение!");
		Отказ=Истина;
	КонецЕсли;
	
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа") и  Не ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения ТОгда
		Ликофлекс=ОрганизацияЛикофлекс();
		ИксПак=ОрганизацияИксПак();
		Если Объект.Контрагент=УправлениеСвойствамиСервер(Ликофлекс,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") И Объект.Организация=ИксПак Тогда
			Объект.ВнутренняяПродажа=Истина;  				
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(Ликофлекс,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		Если Объект.Контрагент=УправлениеСвойствамиСервер(ИксПак,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") И Объект.Организация=Ликофлекс  Тогда
			Объект.ВнутренняяПродажа=Истина;  				
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(ИксПак,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Объект.ОтражатьВБухгалтерскомУчете Тогда
			Объект.ОтражатьВБухгалтерскомУчете=Истина;
			ЗаполнитьТаблицуСЦенами();
			УстановитьВидимость();
			
		КонецЕсли; 	
		
		Для каждого ТекЦена Из Объект.ЦеныНоменклатуры Цикл
			
			Если  ТекЦена.Цена >0 И ТекЦена.Цена<0.01 Тогда
				ТекЦена.Цена=0.01; 		  
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЕсли;
	
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку") и  Не ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения ТОгда
		Ликофлекс=ОрганизацияЛикофлекс();
		ИксПак=ОрганизацияИксПак();
		Если Объект.Контрагент=УправлениеСвойствамиСервер(Ликофлекс,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") Тогда
							
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(Ликофлекс,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		Если Объект.Контрагент=УправлениеСвойствамиСервер(ИксПак,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") Тогда
		
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(ИксПак,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Если  УчетПравилПеремещенияТМЦ Тогда
		
		Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение  
			И Не ПараметрыЗаписи.Свойство("ПроверкаПравилПеремещенияТМЦПередЗаписью") Тогда
			
		
		Ответ = ПроверитьФИФОЛИФО(Отказ,ПараметрыЗаписи.РежимЗаписи);
		
		Если ТипЗнч(Ответ)=Тип("Массив") И  Ответ.Количество()>0 Тогда
			
			Текст ="";
			Для каждого Комментарий Из Ответ Цикл
				Текст = Текст+?(ЗначениеЗаполнено(Текст),"|"+Комментарий,Комментарий);
				Сообщить(Комментарий);
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Текст) Тогда
				
				Текст=Текст+"
				| Продолжить?";
					
					Режим = РежимДиалогаВопрос.ДаНет;
					Оповещение = Новый ОписаниеОповещения("ПроверкаПравилПеремещенияТМЦПередЗаписью", ЭтотОбъект, Новый Структура("Отказ,ПроверкаПравилПеремещенияТМЦПередЗаписью",Отказ,Ложь));
					ПоказатьВопрос(Оповещение, Текст, Режим, 0); 
					Отказ=Истина;
					Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
		
	Иначе
		
	// <-- Начало Лико Яцун С. В. 16.10.2025 
	НарушинПринципФИФОЛИФО = Новый Структура("Вопрос,ВидОперации,Письмо,Адресаты","",Объект.ВидОперации,"","");
	Если НЕ ПараметрыЗаписи.Свойство("ПровестиПослеПроверкиФИФОЛИФО") Тогда
		НарушинПринципФИФОЛИФО = ПроверитьФИФОЛИФО(Отказ,ПараметрыЗаписи.РежимЗаписи);
		Если НарушинПринципФИФОЛИФО.Вопрос = "" Тогда
			ПараметрыЗаписи.Вставить("НарушинПринципФИФОЛИФО",НарушинПринципФИФОЛИФО)
		КонецЕсли;
    КонецЕсли;
	Если НарушинПринципФИФОЛИФО.Вопрос <> "" И НарушинПринципФИФОЛИФО.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения") Тогда
		ПараметрыЗаписи.Вставить("НарушинПринципФИФОЛИФО",НарушинПринципФИФОЛИФО)
	ИначеЕсли НарушинПринципФИФОЛИФО.Вопрос <> "" Тогда
		Вопрос = НарушинПринципФИФОЛИФО.Вопрос + Символы.ПС + Символы.ПС + "Записать документ?";
		Письмо = НарушинПринципФИФОЛИФО.Письмо;
		Адресаты = НарушинПринципФИФОЛИФО.Адресаты;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросФИФОЛИФО", ЭтотОбъект,Новый Структура("ПараметрыЗаписи,Вопрос,Письмо,Адресаты",ПараметрыЗаписи,Вопрос,Письмо,Адресаты)), 
		Вопрос,
		РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 16.10.2025   
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение И ЭтоПеремещениеРезерваМеждуПомещениямиСервер()  Тогда
		
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПередЗаписью", ЭтотОбъект, Новый Структура("Отказ,НарушинПринципФИФОЛИФО",Отказ,ПараметрыЗаписи.НарушинПринципФИФОЛИФО));
		ПоказатьВопрос(Оповещение, "ВНИМАНИЕ!!! Вы перемещаете зарезервинованный материал! Продолжить?", Режим, 0); 
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		 Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	
	
	Если  КонтролироватьСкладПриходаРасхода Тогда
		Стоп=Ложь;
		Для каждого Товар Из Объект.Товары Цикл
			НомерСтроки=Товар.ПолучитьИдентификатор();
			
			ПомещениеРасход=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.АдресХранения,"Помещение");
			Если Объект.Помещение<>	ПомещениеРасход Тогда
				Стоп=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Расход товара с помещения:"""+Строка(ПомещениеРасход)+""" запрещено!";
				Сообщение.Поле = "Объект.Товары["+Формат(НомерСтроки,"ЧГ=")+"].АдресХранения"; //имя реквизита 
				Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
				Сообщение.Сообщить();
			КонецЕсли;
			
			
		КонецЦикла;	
		Если  Стоп Тогда
			Отказ=Истина;
			Возврат; 		
			
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Проведен и Не ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПоказатьПредупреждение(Неопределено, "Перед записью документа необходимо отменить проведение!");
		Отказ=Истина;
	КонецЕсли;
	
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа") и  Не ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения ТОгда
		Ликофлекс=ОрганизацияЛикофлекс();
		ИксПак=ОрганизацияИксПак();
		Если Объект.Контрагент=УправлениеСвойствамиСервер(Ликофлекс,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") И Объект.Организация=ИксПак Тогда
			Объект.ВнутренняяПродажа=Истина;  				
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(Ликофлекс,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		Если Объект.Контрагент=УправлениеСвойствамиСервер(ИксПак,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") И Объект.Организация=Ликофлекс  Тогда
			Объект.ВнутренняяПродажа=Истина;  				
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(ИксПак,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Объект.ОтражатьВБухгалтерскомУчете Тогда
			Объект.ОтражатьВБухгалтерскомУчете=Истина;
			ЗаполнитьТаблицуСЦенами();
			УстановитьВидимость();
			
		КонецЕсли; 	
		
		Для каждого ТекЦена Из Объект.ЦеныНоменклатуры Цикл
			
			Если  ТекЦена.Цена >0 И ТекЦена.Цена<0.01 Тогда
				ТекЦена.Цена=0.01; 		  
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЕсли;
	
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку") и  Не ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения ТОгда
		Ликофлекс=ОрганизацияЛикофлекс();
		ИксПак=ОрганизацияИксПак();
		Если Объект.Контрагент=УправлениеСвойствамиСервер(Ликофлекс,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") Тогда
							
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(Ликофлекс,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		Если Объект.Контрагент=УправлениеСвойствамиСервер(ИксПак,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") Тогда
		
			Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
				Объект.АдресХранения=УправлениеСвойствамиСервер(ИксПак,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Если  УчетПравилПеремещенияТМЦ Тогда
		
		Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение  
			И Не ПараметрыЗаписи.Свойство("ПроверкаПравилПеремещенияТМЦПередЗаписью") Тогда
			
		
		Ответ = ПроверитьФИФОЛИФО(Отказ,ПараметрыЗаписи.РежимЗаписи);
		
		Если ТипЗнч(Ответ)=Тип("Массив") И  Ответ.Количество()>0 Тогда
			
			Текст ="";
			Для каждого Комментарий Из Ответ Цикл
				Текст = Текст+?(ЗначениеЗаполнено(Текст),"|"+Комментарий,Комментарий);
				Сообщить(Комментарий);
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Текст) Тогда
				
				Текст=Текст+"
				| Продолжить?";
					
					Режим = РежимДиалогаВопрос.ДаНет;
					Оповещение = Новый ОписаниеОповещения("ПроверкаПравилПеремещенияТМЦПередЗаписью", ЭтотОбъект, Новый Структура("Отказ,ПроверкаПравилПеремещенияТМЦПередЗаписью",Отказ,Ложь));
					ПоказатьВопрос(Оповещение, Текст, Режим, 0); 
					Отказ=Истина;
					Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
		
	Иначе
		
	// <-- Начало Лико Яцун С. В. 16.10.2025 
	НарушинПринципФИФОЛИФО = Новый Структура("Вопрос,ВидОперации,Письмо,Адресаты","",Объект.ВидОперации,"","");
	Если НЕ ПараметрыЗаписи.Свойство("ПровестиПослеПроверкиФИФОЛИФО") Тогда
		НарушинПринципФИФОЛИФО = ПроверитьФИФОЛИФО(Отказ,ПараметрыЗаписи.РежимЗаписи);
		Если НарушинПринципФИФОЛИФО.Вопрос = "" Тогда
			ПараметрыЗаписи.Вставить("НарушинПринципФИФОЛИФО",НарушинПринципФИФОЛИФО)
		КонецЕсли;
    КонецЕсли;
	Если НарушинПринципФИФОЛИФО.Вопрос <> "" И НарушинПринципФИФОЛИФО.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения") Тогда
		ПараметрыЗаписи.Вставить("НарушинПринципФИФОЛИФО",НарушинПринципФИФОЛИФО)
	ИначеЕсли НарушинПринципФИФОЛИФО.Вопрос <> "" Тогда
		Вопрос = НарушинПринципФИФОЛИФО.Вопрос + Символы.ПС + Символы.ПС + "Записать документ?";
		Письмо = НарушинПринципФИФОЛИФО.Письмо;
		Адресаты = НарушинПринципФИФОЛИФО.Адресаты;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросФИФОЛИФО", ЭтотОбъект,Новый Структура("ПараметрыЗаписи,Вопрос,Письмо,Адресаты",ПараметрыЗаписи,Вопрос,Письмо,Адресаты)), 
		Вопрос,
		РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 16.10.2025   
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение И ЭтоПеремещениеРезерваМеждуПомещениямиСервер()  Тогда
		
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПередЗаписью", ЭтотОбъект, Новый Структура("Отказ",Отказ));
		ПоказатьВопрос(Оповещение, "ВНИМАНИЕ!!! Вы перемещаете зарезервинованный материал! Продолжить?", Режим, 0); 
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Функция ПроверитьФИФОЛИФО(Отказ,РежимЗаписи) // <-- Начало Лико Яцун С. В. 16.10.2025
	
	Возврат Документы.Лико_ПередачаТоваров.ПроверитьФИФОЛИФО(Отказ,РежимЗаписи,Объект, УчетПравилПеремещенияТМЦ);
		
КонецФункции  // <-- Конец Лико Яцун С. В. 16.10.2025

&НаКлиенте
Процедура ПослеОтветаНаВопросФИФОЛИФО(РезультатВопроса, ДополнительныеПараметры) Экспорт // <-- Начало Лико Яцун С. В. 16.10.2025
    
	Результат = РезультатВопроса;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры.ПараметрыЗаписи.Вставить("ПровестиПослеПроверкиФИФОЛИФО",Истина);
		НарушинПринципФИФОЛИФО = Новый Структура("Вопрос,ВидОперации,Письмо,Адресаты",ДополнительныеПараметры.Вопрос,Объект.ВидОперации,ДополнительныеПараметры.Письмо,ДополнительныеПараметры.Адресаты);
		ДополнительныеПараметры.ПараметрыЗаписи.Вставить("НарушинПринципФИФОЛИФО",НарушинПринципФИФОЛИФО);
		ЭтаФорма.Записать(ДополнительныеПараметры.ПараметрыЗаписи);
	КонецЕсли; 
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 16.10.2025    

&НаСервере
Процедура ОтправитьПисьмо(ТекстПисьма, Тема, Кому)
	Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, Тема, Кому);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПередЗаписью(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	НеВыполнятьПроверкуПередЗаписью=Истина;
	Структура = Новый Структура;
	Структура.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	Записать(Структура);
	
КонецПроцедуры   


&НаКлиенте
Процедура ПроверкаПравилПеремещенияТМЦПередЗаписью(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	НеВыполнятьПроверкуПередЗаписью=Истина;
	Структура = Новый Структура;
	Структура.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	Структура.Вставить("ПроверкаПравилПеремещенияТМЦПередЗаписью",Истина);
	Записать(Структура);
	
КонецПроцедуры




&НаКлиенте
Асинх Функция ОтказОтПеремещенияРезерваМеждуПомещениями() //+Лико m.shenderov 17.02.2023
		
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Ждать ВопросАсинх("ВНИМАНИЕ!!! Вы перемещаете зарезервинованный материал! Продолжить?", Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат Истина;
	КонецЕсли;	
	Возврат Ложь;  
	
КонецФункции  //-Лико m.shenderov 17.02.2023


&НаСервереБезКонтекста
Функция УправлениеСвойствамиСервер(Ссылка,Свойство) //+Лико m.shenderov 18.01.2019
	
	Возврат  УправлениеСвойствами.ЗначениеСвойства(Ссылка,Свойство);
КонецФункции  //-Лико m.shenderov 18.01.2019



&НаСервереБезКонтекста
Функция ОрганизацияЛикофлекс() //+Лико m.shenderov 18.01.2019 
	Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра;	
КонецФункции  //-Лико m.shenderov 18.01.2019


&НаСервереБезКонтекста
Функция ОрганизацияИксПак() //+Лико m.shenderov 18.01.2019 
	Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра;	
КонецФункции  //-Лико m.shenderov 18.01.2019



&НаКлиенте
Процедура АктБрака(Команда)
	Структура = Новый Структура;
	Структура.Вставить("СсылкаНаОбъект",Объект.Ссылка) ;
	Структура.Вставить("ПредседательКомисии",Объект.ЧленКомиссии1) ;
	Структура.Вставить("ГлавныйТехнолог",Объект.ЧленКомиссии2) ;
	Структура.Вставить("НачальникОтделаЗакупок",Объект.ЧленКомиссии3) ;
	Структура.Вставить("ОписаниеНедостатков",Объект.ПричинаБрака) ;
	ОткрытьФорму("Обработка.ЯССМ_АктБрака.Форма.ОтчетУпр",Структура,,,,,,);
	
КонецПроцедуры


&НаКлиенте
Процедура ВнутренняяПереработкаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспоряжениеВнутреннейПереработки() //+Лико m.shenderov 20.08.2018
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаСырьяПереработчику.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПередачаСырьяПереработчику КАК ПередачаСырьяПереработчику
	|ГДЕ
	|	ПередачаСырьяПереработчику.Лико_Документ = &Лико_Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаДавальцу.Ссылка
	|ИЗ
	|	Документ.ПередачаДавальцу КАК ПередачаДавальцу
	|ГДЕ
	|	ПередачаДавальцу.Лико_Документ = &Лико_Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Лико_Документ = &Лико_Документ";
	Запрос.УстановитьПараметр("Лико_Документ",Объект.Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		РаспоряжениеВнутренняяПереработка=Выборка.Ссылка;
	КонецЦикла; 	
	
КонецПроцедуры  //-Лико m.shenderov 20.08.2018


&НаСервере
Процедура ЗаполнитьТаблицуТиповыеДокументы() //+Лико m.shenderov 21.08.2018
	
	УстановитьПривилегированныйРежим(Истина);
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Ссылка КАК Документ
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|ГДЕ
	//|	РеализацияТоваровУслуг.Ссылка = &Распоряжение
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВнутреннееПотреблениеТоваров.Ссылка
	//|ИЗ
	//|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
	//|ГДЕ
	//|	ВнутреннееПотреблениеТоваров.Ссылка = &Распоряжение
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПриобретениеТоваровУслуг.Ссылка
	//|ИЗ
	//|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	//|ГДЕ
	//|	ПриобретениеТоваровУслуг.Ссылка = &Распоряжение
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПередачаСырьяПереработчику.Ссылка
	//|ИЗ
	//|	Документ.ПередачаСырьяПереработчику КАК ПередачаСырьяПереработчику
	//|ГДЕ
	//|	ПередачаСырьяПереработчику.Ссылка = &Распоряжение
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПередачаСырьяПереработчику.Ссылка
	//|ИЗ
	//|	Документ.ПередачаСырьяПереработчику КАК ПередачаСырьяПереработчику
	//|ГДЕ
	//|	ПередачаСырьяПереработчику.Лико_Документ = &Ссылка
	//|	И &ПоказыватьДокумент
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПередачаДавальцу.Ссылка
	//|ИЗ
	//|	Документ.ПередачаДавальцу КАК ПередачаДавальцу
	//|ГДЕ
	//|	ПередачаДавальцу.Лико_Документ = &Ссылка
	//|	И &ПоказыватьДокумент
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПоступлениеОтПереработчика.Ссылка
	//|ИЗ
	//|	Документ.ПоступлениеОтПереработчика КАК ПоступлениеОтПереработчика
	//|ГДЕ
	//|	ПоступлениеОтПереработчика.Лико_Документ = &Ссылка
	//|	И &ПоказыватьДокумент
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеСырьяОтДавальца.Ссылка
	//|ИЗ
	//|	Документ.ПоступлениеСырьяОтДавальца КАК ПоступлениеСырьяОтДавальца
	//|ГДЕ
	//|	ПоступлениеСырьяОтДавальца.Лико_Документ = &Ссылка
	//|	И &ПоказыватьДокумент
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ОтчетДавальцу.Ссылка
	//|ИЗ
	//|	Документ.ОтчетДавальцу КАК ОтчетДавальцу
	//|ГДЕ
	//|	ОтчетДавальцу.Лико_Документ = &Ссылка
	//|	И &ПоказыватьДокумент";
	//Запрос.УстановитьПараметр("Распоряжение",Объект.Распоряжение);
	//Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	//Запрос.УстановитьПараметр("ПоказыватьДокумент",ЗначениеЗаполнено(Объект.Ссылка));
	//
	//
	//ТиповыеДокументы.Загрузить(Запрос.Выполнить().Выгрузить());
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Распоряжение",Объект.Распоряжение);
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Распоряжение2",Объект.Распоряжение2);
	
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка",Объект.Ссылка);
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("ПоказыватьДокумент",ЗначениеЗаполнено(Объект.Ссылка));
	
КонецПроцедуры  //-Лико m.shenderov 21.08.2018


&НаКлиенте
Процедура СписокТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер="";
	Объект.Руководитель=Неопределено;
	Объект.ГлавныйБухгалтер=Неопределено;
	ПрослеживаемостьТоваров=ПрослеживаемостьТоваровСервер();
	Если ПрослеживаемостьТоваров Тогда
		
				УстановитьВидимость();  
		
		
		
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПрослеживаемостьТоваровСервер () //+Лико m.shenderov 28.02.2023  
	
	Возврат УправлениеСвойствами.ЗначениеСвойства(Объект.Организация,"Лико_ПрослеживаемостьТоваров");
 
КонецФункции  //-Лико m.shenderov 28.02.2023




&НаКлиенте
Процедура ВнутренняяПродажаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьОрганизациюПоКонтрагенту(Контрагент) //+Лико m.shenderov 27.10.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации.ДополнительныеРеквизиты КАК ОрганизацииДополнительныеРеквизиты
	|ГДЕ
	|	ОрганизацииДополнительныеРеквизиты.Свойство.Имя = ""КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2""
	|	И ОрганизацииДополнительныеРеквизиты.Значение = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;
		
	КонецЦикла; 
	
	
КонецФункции  //-Лико m.shenderov 27.10.2018

&НаКлиенте
Процедура ПечатьСкладскойКарточки1(Команда)
	Данные=Элементы.Товары.ТекущиеДанные;
	Если Данные<>Неопределено Тогда
		Лико_ДополнительноКлиент.ПечатьСкладскойКарточки(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Данные.Серия,"ЯССМ_ОбъектНоменклатуры"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучательПриИзмененииНаСервере260521()
	Если Справочники.Лико_РабочиеМеста.ПолучитьСвойство("УстановкаТекущегоОператораРЦВДокументеПередачаСоСклада",Ложь) ТОгда
		Объект.Сотрудник=Лико_ОбщегоНазначенияСервер.ПолучитьТекущегоОператорРабочегоЦентра(Объект.Получатель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере

Процедура ПолучательПриИзмененииНаСервере()
	Если Справочники.Лико_РабочиеМеста.ПолучитьСвойство("УстановкаТекущегоОператораРЦВДокументеПередачаСоСклада",Ложь) ТОгда
		Объект.Сотрудник=Лико_ОбщегоНазначенияСервер.ПолучитьТекущегоОператорРабочегоЦентра210720(Объект.Получатель);
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	ПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникАвтоПодборНаСервере(Текст)
	
	СписокЗначений= Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Код ПОДОБНО &Код
	|	И Сотрудники.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Код","%"+Текст+"%" );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Ссылка);
		
	КонецЦикла; 
	Возврат СписокЗначений;	
КонецФункции


&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Попытка
		Код=Число(Текст);
		СтандартнаяОбработка=Ложь;
		ДанныеВыбора=СотрудникАвтоПодборНаСервере(Текст);
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьТранспортнуюНакладную(Команда)
	
	ОчиститьСообщения();
	
	ПроверитьВозможностьСозданияТранспортнойНакладной();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьСозданияТранспортнойНакладной()
	
	МожноСоздатьТТН = Истина;
	
	// Проверка способов доставки заказов
	
	//Если Объект.ПеремещениеПоЗаказам Тогда
	//	
	//	ПроверитьСпособыДоставкиЗаказов(МожноСоздатьТТН);
	//	
	//Иначе
	//	
	//	СпособыДоставкиСНашимУчастием = ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками);
	//	
	//	Если СпособыДоставкиСНашимУчастием.Найти(Объект.СпособДоставки) <> Неопределено Тогда	
	//		ТекстСообщения = НСтр("ru = 'Невозможно создать транспортную накладную, т.к. используется способ доставки ""%СпособДоставки%"". Транспортные накладные в этом случае создаются при оформлении задания на перевозку.'");
	//		Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента") Тогда 
	//			СпособДоставки = НСтр("ru = 'До склада-получателя'");
	//		Иначе
	//			СпособДоставки = Объект.СпособДоставки;
	//		КонецЕсли;
	//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СпособДоставки%", СпособДоставки);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.СпособДоставки");	
	//		МожноСоздатьТТН = Ложь;	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//	
	//Если МожноСоздатьТТН
	//	И (НЕ ЗначениеЗаполнено(Объект.Ссылка)
	//		ИЛИ НЕ Объект.Проведен
	//		ИЛИ Модифицированность) Тогда
	//	
	//	ТекстВопроса = НСтр("ru = 'Ввод транспортных накладных возможен только после проведения документа.'");
	//	СписокКнопок = Новый СписокЗначений;
	//	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Провести'"));
	//	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьВозможностьСозданияТранспортнойНакладнойОбработкаОтвета", ЭтотОбъект), ТекстВопроса, СписокКнопок);
	//	Возврат;
	//КонецЕсли;
	
	ПроверитьВозможностьСозданияТранспортнойНакладнойЗавершение(МожноСоздатьТТН);
	
КонецПроцедуры



&НаКлиенте
Процедура ПроверитьВозможностьСозданияТранспортнойНакладнойЗавершение(МожноСоздатьТТН)
	
	Если Не МожноСоздатьТТН Тогда
		Возврат; // Проверки не были пройдены, продолжать создание ТТН не нужно
	КонецЕсли;
	
	Если ПроверитьНаличиеТранспортныхНакладных() Тогда
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,     НСтр("ru = 'Оформить'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru = 'Дополнить'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьТранспортнуюНакладнуюЗавершение", ЭтотОбъект), НСтр("ru = 'Оформить новую ТТН или дополнить существующую?'"), СписокКнопок);
	Иначе
		ОформитьТранспортнуюНакладную();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПроверитьНаличиеТранспортныхНакладных()
	
	Отбор = Новый Структура("ДокументОснование, Дата",Объект.Ссылка,Объект.Дата);
	
	Возврат Документы.ТранспортнаяНакладная.ПроверитьНаличиеОформленныхТранспортныхНакладных(Отбор);
	
КонецФункции


&НаКлиенте
Процедура СоздатьТранспортнуюНакладнуюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОформитьТранспортнуюНакладную();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ВыбратьТранспортнуюНакладную();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьТранспортнуюНакладную()
	
	СозданныеТТН = ОформитьТранспортныеНакладныеНаСервере();
	
	Если СозданныеТТН.Количество() = 1 Тогда 
		ПоказатьЗначение(, СозданныеТТН[0]);
	ИначеЕсли СозданныеТТН.Количество() > 1 Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТранспортныеНакладные", СозданныеТТН);
		ОткрытьФорму("Документ.ТранспортнаяНакладная.Форма.СозданныеТранспортныеНакладные", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТранспортнуюНакладную()
	
	АдресХранилища = ПолучитьАдресХранилищаСПараметрамиОтбораТТН();
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ДокументОснование", Объект.Ссылка);
	ПараметрыОтбора.Вставить("ДатаНачала", Объект.Дата - 14 * 24 * 60 * 60);
	ПараметрыОтбора.Вставить("АдресХранилища", АдресХранилища);
	
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Документ.ТранспортнаяНакладная.Форма.ФормаВыбора", 
	ПараметрыФормы, 
	ЭтаФорма,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры


&НаСервере
Функция ПолучитьАдресХранилищаСПараметрамиОтбораТТН()
	
	ТаблицаПараметровОтбора = Документы.ТранспортнаяНакладная.ПолучитьПараметрыОтбораТТН(Объект.Ссылка);
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметровОтбора);
	
КонецФункции	


&НаСервере
Функция ОформитьТранспортныеНакладныеНаСервере()
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);
	СозданныеТТН = Документы.ТранспортнаяНакладная.СоздатьТранспортныеНакладные(МассивОбъектов);
	
	Если СозданныеТТН.Количество() <> 0 Тогда 
		ПолучитьОбновитьИнформациюТранспортныхНакладных();
	КонецЕсли;
	
	Возврат СозданныеТТН;
	
КонецФункции


&НаСервере
Процедура ПолучитьОбновитьИнформациюТранспортныхНакладных()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьТТН") И ПравоДоступа("Чтение", Метаданные.Документы.ТранспортнаяНакладная) Тогда 
		ДанныеТранспортныхНакладных = ПолучитьИнформациюТранспортныхНакладных();
		//ОбновитьИнформациюТранспортныхНакладных(ДанныеТранспортныхНакладных, ЭтаФорма);
	Иначе
		Элементы.ГруппаТранспортныеНакладныеСтраницы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры




&НаСервере
Функция ПолучитьИнформациюТранспортныхНакладных()
	
	ТекстТТН = Документы.ТранспортнаяНакладная.ТекстТТН(ЭтотОбъект);
	ТекстыПоляДокументыНаОсновании.Добавить(ТекстТТН);
	
	Возврат ТекстТТН;
	
	//Возврат Документы.ТранспортнаяНакладная.ПолучитьИнформациюТранспортныхНакладных(Объект.Ссылка);
	
КонецФункции 

 //+ ---> Лико2.5 m.shenderov 11.04.2022
 &НаСервере
Процедура ОбновитьТекстДокументыНаОсновании()
	
	ТекстыПоляДокументыНаОсновании.Очистить();
	
	//++ Локализация
	ТекстТТН = Документы.ТранспортнаяНакладная.ТекстТТН(ЭтотОбъект);
	ТекстыПоляДокументыНаОсновании.Добавить(ТекстТТН);

		//-- Локализация
	
	ОбщегоНазначенияУТКлиентСервер.ОбновитьТекстДокументыНаОсновании(ЭтотОбъект);
	
КонецПроцедуры




&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИнформациюТранспортныхНакладных(Параметры, Форма)
	Форма.КоличествоТранспортныхНакладных = Параметры.КоличествоТранспортныхНакладных;
	
	Если Форма.КоличествоТранспортныхНакладных = 0 Тогда
		Форма.Элементы.ГруппаТранспортныеНакладныеСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаНетТранспортныхНакладных;
		//ИначеЕсли Форма.КоличествоТранспортныхНакладных = 1 Тогда
	Иначе
		
		Форма.Элементы.ГруппаТранспортныеНакладныеСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаОднаТранспортнаяНакладная;
		Форма.ТранспортнаяНакладная = Параметры.ТранспортнаяНакладная;
		Форма.ТранспортнаяНакладнаяТекст = НСтр("ru='ТТН'") + " " + Параметры.СокращенноеНаименованиеТранспортнойНакладной;
		//Иначе
		//	Форма.Элементы.ГруппаТранспортныеНакладныеСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаНесколькоТранспортныхНакладных;
		//	ЗаголовокКоманды = НСтр("ru = 'ТТН (%КоличествоТранспортныхНакладных%)'");
		//	ЗаголовокКоманды = СтрЗаменить(ЗаголовокКоманды, "%КоличествоТранспортныхНакладных%", Форма.КоличествоТранспортныхНакладных);
		//	Форма.Элементы.ОткрытьСписокТН.Заголовок = ЗаголовокКоманды;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ТранспортнаяНакладнаяТекстНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ТранспортнаяНакладная);
	ОткрытьФорму("Документ.ТранспортнаяНакладная.Форма.ФормаДокумента", СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	Если Объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа И 
		Не Объект.ВнутренняяПродажа И 
		Не ЗначениеЗаполнено(Объект.Договор) Тогда
		
		
		ДляДокумента	                =	Лико_ОбщегоНазначенияСервер.ПолучитьСтруктуруДляЗаполненияТиповыхДокументов(Объект.Контрагент,Объект.Валюта,Объект.ВидОперации);
		
		Объект.Договор					=	ДляДокумента.Договор;
		Объект.СоглашениеСКлиентами	    =	ДляДокумента.Соглашение;
		Объект.СпособДоставки			=	ДляДокумента.СпособДоставки;
		Объект.ИнтерКампани             =	ДляДокумента.ИнтерКампани;
		
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		//ПродажиКлиентСервер.СформироватьТекстДокументыНаОсновании(ЭтаФорма);
		//+ ---> Лико2.5 m.shenderov 06.04.2022
		//ПолучитьОбновитьИнформациюТранспортныхНакладных();
		ОбновитьТекстДокументыНаОсновании(); 
		//- <--- Лико2.5 m.shenderov 06.04.2022
КонецПроцедуры


&НаКлиенте
Процедура ТекстДокументыНаОснованииПодвалОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	//Если Не ЗначениеЗаполнено(Объект.Отпустил) Тогда
	//	ЗаполнитьРеквизитыДляПечати();
	//КонецЕсли;
	
	
	ОчиститьСообщения();
	
	//+ ---> Лико2.5 m.shenderov 11.04.2022
	//ПродажиКлиент.ОбработкаНавигационнойСсылкиТранспортныеНакладные(ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ТранспортнаяНакладнаяКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	//- <--- Лико2.5 m.shenderov 11.04.2022	
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыДляПечати() //+Лико m.shenderov 17.04.2020
	Объект.Отпустил = Объект.АвторДокумента;
	Объект.ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(Объект.Отпустил,Объект.Организация,Объект.Дата);
		Если НЕ ЗначениеЗаполнено(Объект.ОтпустилДолжность) Тогда
			Объект.ОтпустилДолжность = "Кладовщик";
		КонецЕсли;
		//НовоеРаспоряжение.Менеджер = Автор;
		Объект.Руководитель 		= Лико_Дополнительно.НайтиЛицоСПравомПодписи(Объект.Организация, ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"), Объект.Отпустил,Объект.Дата); 
		Объект.ГлавныйБухгалтер 	= Лико_Дополнительно.НайтиЛицоСПравомПодписи(Объект.Организация, ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер"), Объект.Отпустил,Объект.Дата); 
	 	ЭтаФорма.Записать(Новый Структура("РежимЗаписи,", РежимЗаписиДокумента.Запись));	
		
КонецПроцедуры //-Лико m.shenderov 17.04.2020

&НаКлиенте
Процедура ЗаполнитьЦену(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЦенуЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Заполнить цену?",РежимДиалогаВопрос.ДаНет, 60);
	
	 
	
КонецПроцедуры

//Вынести в отдельную процедуру
&НаКлиенте
Процедура ЗаполнитьЦенуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			
			ПроверитьНаличиеЦеныНаОснастку();
			
		КонецЕсли; 
		
КонецПроцедуры

Процедура ПроверитьНаличиеЦеныНаОснастку() //+Лико m.shenderov 26.03.2021
		
	 Массив = Новый Массив();
	
	Для каждого Номен Из Объект.ЦеныНоменклатуры Цикл
		Если Номен.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра  Тогда
			Массив.Добавить(Номен.Номенклатура);			
		КонецЕсли;		
	КонецЦикла;
	
	
	Если Массив.Количество()=0 ТОгда
		Возврат;
	КонецЕсли;
	ВалютаEur=Константы.ВалютаУправленческогоУчета.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Цена КАК Цена,
	|	Лико_ПараметрыШтампа.Номенклатура КАК Номенклатура,
	|	КурсыВалютСрезПоследних.Курс КАК КурсEur,
	|	КурсыВалютСрезПоследних1.Курс КАК Курс,
	|	Лико_ПараметрыШтампа.Цена * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних1.Курс КАК ЦенаИтог
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаEuro) КАК КурсыВалютСрезПоследних,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних1
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура В(&Номенклатура)";
	Запрос.УстановитьПараметр("Номенклатура",Массив);
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	Запрос.УстановитьПараметр("ВалютаEuro",ВалютаEur);
	Запрос.УстановитьПараметр("Валюта",Объект.Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл		
		СтрНоменклатуры=Объект.ЦеныНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));		
		Если СтрНоменклатуры.Количество()>0 Тогда			
			СтрНоменклатуры[0].Цена=Выборка.ЦенаИтог;		
		КонецЕсли;			
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 26.03.2021


&НаСервере
Функция ЭтоПеремещениеРезерваМеждуПомещениямиСервер() //+Лико m.shenderov 17.02.2023  
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивАдресов= Новый Массив;
	
	ТзТовары=Объект.Товары.Выгрузить();
	Тз=ТзТовары.Скопировать(,"АдресХранения");
	Тз.Свернуть("АдресХранения");
	
	Для каждого СтрТз Из Тз Цикл
		Если ЗначениеЗаполнено(СтрТз.АдресХранения) Тогда
			МассивАдресов.Добавить(СтрТз.АдресХранения);
		КонецЕсли;	 
	КонецЦикла;
	
	Тз=ТзТовары.Скопировать(,"АдресХраненияНовый");
	Тз.Свернуть("АдресХраненияНовый");
	
	Для каждого СтрТз Из Тз Цикл
		Если ЗначениеЗаполнено(СтрТз.АдресХраненияНовый) Тогда
			МассивАдресов.Добавить(СтрТз.АдресХраненияНовый);
		КонецЕсли;	 
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.АдресХранения) Тогда
		
		МассивАдресов.Добавить(Объект.АдресХранения);
		
	КонецЕсли; 
	
	
	ТзТовары.Свернуть("Серия");
	
	МассивСерий=ТзТовары.ВыгрузитьКолонку("Серия");
	
	
	Если Объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СкладскиеЯчейки.Помещение КАК Помещение
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	СкладскиеЯчейки.Ссылка В(&МассивАдресов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
		|ГДЕ
		|	ЯССМ_ОбъектыНоменклатуры.Серия В(&МассивСерий)
		|	И ЯССМ_ОбъектыНоменклатуры.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";
		Запрос.УстановитьПараметр("МассивАдресов",МассивАдресов ); 
		Запрос.УстановитьПараметр("МассивСерий",МассивСерий );
		
		Пакеты = Запрос.ВыполнитьПакет();
		Если Пакеты[0].Выбрать().Количество()>1 И  Пакеты[1].Выбрать().Количество()>0 Тогда
			Возврат Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции  //-Лико m.shenderov 17.02.2023



//Сервер взаимодействия. Мобильные устройства.
#Область ПодключениеМобильныхУстройств

&НаКлиенте
Процедура ВыполнитьПослеОкончания(ДополнительныеПараметры) Экспорт
	//ПоказатьПредупреждение(, "Подключение выполнено", 2);
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьПриОшибке(Инфо, Парам, ДополнительныеПараметры) Экспорт
	Сообщить( Инфо.Описание);
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаСообщенийСервера(Сообщение, ДополнительныеПараметры) Экспорт  	
	Если  ВводДоступен() Тогда
		ОбработатьШтрихкоды(Сообщение.Данные); 
	КонецЕсли;  	
КонецПроцедуры



#КонецОбласти

#Область ТиповыеДокументы
&НаКлиенте
Асинх Процедура ЗаполнитьТиповыеДокументы() //+Лико m.shenderov 06.06.2021
	
	 Массив=Ждать ПолучитьТиповыеДокументы();
	//ТиповыеДокументы.Очистить(); 
	// Для каждого СтрМассива Из Массив Цикл
	// 	        НоваяСтрокаТз=ТиповыеДокументы.Добавить();
	//			НоваяСтрокаТз.Документ=СтрМассива.Документ;
	// КонецЦикла;
	//
	
КонецПроцедуры  //-Лико m.shenderov 06.06.2021

&НаКлиенте
Асинх Функция ПолучитьТиповыеДокументы() //+Лико m.shenderov 06.06.2021
	АдресВременногоХранилища=ПоместитьВоВременноеХранилище(Неопределено,Новый УникальныйИдентификатор);
	Массив = Новый Массив();
	Массив.Добавить(Объект.Ссылка);
	Массив.Добавить(Истина);
	Массив.Добавить(Объект.Распоряжение);
	Массив.Добавить(Объект.Распоряжение2);
	Массив.Добавить(АдресВременногоХранилища);
    Массив.Добавить("Лико_ПередачаТоваров_ТиповыеДокументы");


	 ПолучитьТиповыеДокументыВФоне(Массив);
	
	
	
	//Возврат ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	
КонецФункции  //-Лико m.shenderov 06.06.2021

&НаКлиенте
Процедура Команда1(Команда)
	СформироватьТаблицуТиповыхДокументов();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьТиповыеДокументыВФоне150422(Массив) //+Лико m.shenderov 06.06.2021
	ФоновыеЗадания.Выполнить("Лико_СкладыВызовСервера.ТзТиповыеДокументы",Массив);
	//Лико_СкладыВызовСервера.ТзТиповыеДокументы(Массив[0],Массив[1],Массив[2],Массив[3],Массив[4]);


КонецПроцедуры  //-Лико m.shenderov 06.06.2021

&НаКлиенте
Процедура ЗаполнитьТиповыеДокументыОбработчик150422() //+Лико m.shenderov 06.06.2021
	
	
	Массив=  ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Если Массив=Неопределено тогда
		Возврат;
	КонецЕсли;
	ОтключитьОбработчикОжидания("ЗаполнитьТиповыеДокументыОбработчик");
	Элементы.КартинкаДлительнаяОперация.Видимость=Ложь;
	Элементы.ТиповыеДокументыОбновить.Видимость=Истина;
	
	Элементы.ТиповыеДокументы.Доступность=Истина;	
	
	ТиповыеДокументы.Очистить(); 
	Для каждого СтрМассива Из Массив Цикл
		НоваяСтрокаТз=ТиповыеДокументы.Добавить();
		НоваяСтрокаТз.Документ=СтрМассива.Документ;
		НоваяСтрокаТз.КартинкаДокумента=СтрМассива.КартинкаДокумента;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		НоваяСтрокаТз=ТиповыеДокументы.Добавить();
		НоваяСтрокаТз.Документ=Объект.Распоряжение;				
		Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Проведен") Тогда
			НоваяСтрокаТз.КартинкаДокумента=1;
		ИначеЕсли Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"ПометкаУдаления") ТОгда					
			НоваяСтрокаТз.КартинкаДокумента=3;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Распоряжение2) Тогда
		НоваяСтрокаТз=ТиповыеДокументы.Добавить();
		НоваяСтрокаТз.Документ=Объект.Распоряжение2;				
		Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение2,"Проведен") Тогда
			НоваяСтрокаТз.КартинкаДокумента=1;
		ИначеЕсли Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение2,"ПометкаУдаления") ТОгда					
			НоваяСтрокаТз.КартинкаДокумента=3;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 06.06.2021

 
&НаКлиенте
Процедура ЗаполнитьТиповыеДокументыОбработчик()


	Массив=  ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Если Массив=Неопределено тогда
		Возврат;
	КонецЕсли;
	ОтключитьОбработчикОжидания("ЗаполнитьТиповыеДокументыОбработчик");
	Элементы.КартинкаДлительнаяОперация.Видимость=Ложь;
	Элементы.ТиповыеДокументыОбновить.Видимость=Истина;

	Элементы.ТиповыеДокументы.Доступность=Истина;	

	ТиповыеДокументы.Очистить(); 
	Для каждого СтрМассива Из Массив Цикл
		
		
		НоваяСтрокаТз=ТиповыеДокументы.Добавить();
		НоваяСтрокаТз.Документ=СтрМассива.Документ;
		НоваяСтрокаТз.КартинкаДокумента=СтрМассива.КартинкаДокумента;

	КонецЦикла;
	
	//Если ЗначениеЗаполнено(Объект.Распоряжение) И Массив.Найти(Объект.Распоряжение)=Неопределено Тогда
	//	НоваяСтрокаТз=ТиповыеДокументы.Добавить();
	//	НоваяСтрокаТз.Документ=Объект.Распоряжение;				
	//	Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Проведен") Тогда
	//		НоваяСтрокаТз.КартинкаДокумента=1;
	//	ИначеЕсли Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"ПометкаУдаления") ТОгда					
	//		НоваяСтрокаТз.КартинкаДокумента=3;
	//	КонецЕсли;
	//КонецЕсли;

	//Если ЗначениеЗаполнено(Объект.Распоряжение2) И Массив.Найти(Объект.Распоряжение2)=Неопределено  Тогда
	//	НоваяСтрокаТз=ТиповыеДокументы.Добавить();
	//	НоваяСтрокаТз.Документ=Объект.Распоряжение2;				
	//	Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение2,"Проведен") Тогда
	//		НоваяСтрокаТз.КартинкаДокумента=1;
	//	ИначеЕсли Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение2,"ПометкаУдаления") ТОгда					
	//		НоваяСтрокаТз.КартинкаДокумента=3;
	//	КонецЕсли;
	//КонецЕсли;





КонецПроцедуры 



&НаСервереБезКонтекста
Процедура ПолучитьТиповыеДокументыВФоне(Массив)
	УстановитьПривилегированныйРежим(Истина);
	ФоновыеЗадания.Выполнить("Лико_СкладыВызовСервера.ТзТиповыеДокументы",Массив);
	//Лико_СкладыВызовСервера.ТзТиповыеДокументы(Массив[0],Массив[1],Массив[2],Массив[3],Массив[4]);


КонецПроцедуры





&НаКлиенте
Процедура СформироватьТаблицуТиповыхДокументов() //+Лико m.shenderov 07.06.2021
	
	Элементы.КартинкаДлительнаяОперация.Видимость=Истина;
	Элементы.ТиповыеДокументыОбновить.Видимость=Ложь;
	
	Элементы.ТиповыеДокументы.Доступность=Ложь;	
	ЗаполнитьТиповыеДокументы();
	ПодключитьОбработчикОжидания("ЗаполнитьТиповыеДокументыОбработчик",1);
	
КонецПроцедуры //-Лико m.shenderov 07.06.2021

&НаКлиенте
Процедура ТиповыеДокументыПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;

КонецПроцедуры




#КонецОбласти

// Подсистема WebSocket
&НаКлиенте
Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	WebSocketКлиент.СоздатьОбсуждение(ЭтаФорма,ДанныеСобытия);

	Если ВводДоступен() Тогда
	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);
	КонецЕсли; 
КонецПроцедуры

//4. В модуль формы добавить процедуру обработки штрих-кода(если надо): 	 
&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;
КонецПроцедуры 

// Подсистема WebSocket

&НаСервере
Процедура ТоварыОписаниеБракаК2ПриИзмененииНаСервере(Серия,ОписаниеБракаК2)
	
	НайденныеСтроки=Объект.ЗабраковкаСерий.НайтиСтроки( Новый Структура("Серия",Серия));
	Если ЗначениеЗаполнено(ОписаниеБракаК2) И НайденныеСтроки.Количество()>0 Тогда
		
		Для каждого НСтр Из НайденныеСтроки Цикл
			НСтр.Серия=Серия; 
			НСтр.ОписаниеДефекта=ОписаниеБракаК2;
			НСтр.Решение=Справочники.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2;
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(ОписаниеБракаК2) Тогда
		НСтр= Объект.ЗабраковкаСерий.Добавить();
		НСтр.Серия=Серия; 
		НСтр.ОписаниеДефекта=ОписаниеБракаК2;
		НСтр.Решение=Справочники.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2;
		
		
	ИначеЕсли Не ЗначениеЗаполнено(ОписаниеБракаК2) И НайденныеСтроки.Количество()>0 Тогда
		Для каждого НСтр Из НайденныеСтроки Цикл
			Объект.ЗабраковкаСерий.Удалить(Объект.ЗабраковкаСерий.Индекс(НСтр)); 		
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ТоварыОписаниеБракаК2ПриИзменении(Элемент)
	
	ТД = Элементы.Товары.ТекущиеДанные;
	
	Если  Не Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Серия,"ЯССМ_ОбъектНоменклатуры"),"Уникальный") Тогда
		
		Ждать ПредупреждениеАсинх("Описание брака ""К2"" возможно только для уникальных серий (#) !");
		Тд.ОписаниеБракаК2="";
		
	КонецЕсли;
	
	ТоварыОписаниеБракаК2ПриИзмененииНаСервере(Тд.Серия,Тд.ОписаниеБракаК2);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеБракаК2Сервер() //+Лико m.shenderov 12.12.2022
	Для каждого ТекСерия Из Объект.ЗабраковкаСерий  Цикл 
		
		НайденныеСтроки=Объект.Товары.НайтиСтроки( Новый Структура("Серия",ТекСерия.Серия));
		
		
		Для каждого НСтр Из НайденныеСтроки Цикл
			НСтр.ОписаниеБракаК2=ТекСерия.ОписаниеДефекта; 
		КонецЦикла;
		

		
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 12.12.2022

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
		ТД = Элементы.Товары.ТекущиеДанные; 
	ТоварыОписаниеБракаК2ПриИзмененииНаСервере(Тд.Серия,"");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНомерПартииИзготовленияПриИзменении(Элемент)
	 ПриИзмененииПартииИзготовленияДатыПроизводства(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыДатаПроизводстваПриИзменении(Элемент)
	 ПриИзмененииПартииИзготовленияДатыПроизводства(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииПартииИзготовленияДатыПроизводства(Элемент)
	ЗаполнитьОбъектНоменклатурыПоТоваруНаСервере(Элементы.Товары.ТекущиеДанные.Серия,
	Элементы.Товары.ТекущиеДанные.НомерПартииИзготовления,
	Элементы.Товары.ТекущиеДанные.ДатаПроизводства,
	Элементы.Товары.ТекущиеДанные.УпотребитьДо);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектНоменклатурыПоТоваруНаСервере(Серия,НомерПартииИзготовления,ДатаПроизводства,УпотребитьДо) //+Лико m.shenderov 15.05.2020
	СпрОбъект=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();	
	СпрОбъект.НомерПартииИзготовления=НомерПартииИзготовления;
	СпрОбъект.ДатаПроизводства=ДатаПроизводства; 
	СпрОбъект.УпотребитьДо=УпотребитьДо;

	СпрОбъект.Записать();
КонецПроцедуры  //-Лико m.shenderov 15.05.2020

&НаКлиенте
Процедура ТоварыУпотребитьДоПриИзменении(Элемент)
	 ПриИзмененииПартииИзготовленияДатыПроизводства(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПодписьДокумента(Команда)
			ДопПараметры = Новый Структура;
			
			//ДопПараметры.Вставить("ИмяПроцедурыПриУспешномПодтверждении", "ПодписьДокументаЗавершение(ДопПараметры)");
			ДопПараметры.Вставить("Должности", "ДолжностьКладовщик,ДолжностьТехнолог");
			ОписаниеОповещенияПриЗакрытииДругойФормы = Новый ОписаниеОповещения("РезультатЧтенияПропускаОтвЛица", ЭтотОбъект, ДопПараметры);
			ТСОтладка = Ложь;
			ПараметрыОткрытияДругойФормы = Новый Структура("ТекстЗаголовка,ТСОтладка,ИмяЗначения", "Считайте пропуск", ТСОтладка, "Сотрудник");
			ПараметрыКоманды = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнейОбработки(,, "ТСРабочийСтолЕРП");
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ПараметрыКоманды.Ссылка);
			ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаЗапросаЧтенияШтрихкода", ПараметрыОткрытияДругойФормы, ЭтаФорма,,,,ОписаниеОповещенияПриЗакрытииДругойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	

КонецПроцедуры  


&НаКлиенте
Процедура РезультатЧтенияПропускаОтвЛица(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Ошибка)
		ИЛИ НЕ ЗначениеЗаполнено(Результат.СчитанноеЗначение)
		ИЛИ ТипЗнч(Результат.СчитанноеЗначение) <> Тип("СправочникСсылка.ФизическиеЛица")
		Тогда
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			Сообщить(Результат.Ошибка);
		Иначе
			Сообщить("Пропуск не был считан");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	
	НомерТелефона = "";
	ЗапрашиватьСМС = Ложь;
	Должности = "";
	ДопПараметры.Свойство("Должности", Должности);
	Если ФизЛицоОбладаетПравамиНачальникаСмены(Результат.СчитанноеЗначение, НомерТелефона, ЗапрашиватьСМС, Должности) Тогда
		ЗапрашиватьСМС = Ложь; // для упаковки поставим принудительно
		ДопПараметры.Вставить("ФизЛицоПодтверждения", Результат.СчитанноеЗначение);
		ДопПараметры.Вставить("СчитанПропускБригадира");
		Если ЗапрашиватьСМС Тогда
			// Потребуем подтверждение пропуска по смс
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				Сообщить("У физ лица " + Результат.СчитанноеЗначение + " не заполнен номер телефона, подтверждение невозможно");
				Возврат;
			КонецЕсли;
			
			// Сформируем код подверждения через генератор случайных чисел
			КодПотверждения = ОтправитьКодПодтвержденияПоСмс(НомерТелефона);
			
			// Запросим код подтверждения
			ДопПараметры.Вставить("КодПодтверждения", КодПотверждения);
			ОписаниеОповещенияПослеВводаВозврата = Новый ОписаниеОповещения("ВведенКодПодтвержденияДляПодтвержденияПропускаОтвЛица", ЭтотОбъект, ДопПараметры);
			//ПараметрыДляКлавиатуры = Новый Структура("НабираемыйТекст,ТекстЗаголовка", "", "Введите код из смс на номер " + НомерТелефона);
			//ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатураЦифровая", ПараметрыДляКлавиатуры,,,,, ОписаниеОповещенияПослеВводаВозврата, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  
			ПоказатьВводСтроки(ОписаниеОповещенияПослеВводаВозврата, "", "Введите код из смс на номер " + НомерТелефона, 4, Ложь);
		Иначе	
			// СМС не нужны, считаем проверку пройденной
			//Выполнить("" + ДопПараметры.ИмяПроцедурыПриУспешномПодтверждении); 
			Объект.ПодписьДокументаСотрудником=Результат.СчитанноеЗначение;
		КонецЕсли;
		
	Иначе
		Сообщить("Считан пропуск сотрудника, не обладающего требуемыми правами");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФизЛицоОбладаетПравамиНачальникаСмены(ФизЛицо, НомерТелефона = "", ЗапрашиватьСМС = Ложь, СтрокаДолжностей = "")
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ТСРабочийСтолЕРП");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("Не найдена дополнительная обработка с именем объекта ТСРабочийСтолЕРП");
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
	
	ОрганизацияПартнера=УправлениеСвойствами.ЗначениеСвойства(Объект.Партнер,"Лико_СобственнаяОрганизация");
	
	Результат = ФизЛицоОбладаетПравамиНачальникаСменыСервер(ФизЛицо, ОрганизацияПартнера, НомерТелефона, ЗапрашиватьСМС, СтрокаДолжностей,Истина);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции 

Функция ФизЛицоОбладаетПравамиНачальникаСменыСервер(ФизЛицо, Организация, НомерТелефона = "", ЗапрашиватьСМС = Ложь, СтрокаДолжностей = "",НеПроверятьБезОрганизации=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МассивДолжностей = Новый Массив;
	Если НЕ ЗначениеЗаполнено(СтрокаДолжностей) Тогда
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьНачальникПроизводства.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьНачальникСмены.ЗначениеПараметра);
		//МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьМенеджерПоПланированиюПроизводства.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьТехнолог.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьЗамГлТехнолога.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьНачальникЦУ.ЗначениеПараметра);
	Иначе
		МассивДолжностейСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДолжностей, ",");
		Для каждого ДолжностьСтрока из МассивДолжностейСтрок Цикл
			Если   ДолжностьСтрока="ДолжностьКладовщик" Тогда
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик 3 категории"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик 2 категории"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик 1 категории"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Начальник складского комплекса"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Менеджер по планированию производства"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Диспетчер склада"));

			Иначе
				МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения[ДолжностьСтрока].ЗначениеПараметра); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДолжностьФизЛица = Лико_Дополнительно.НайтиДолжностьФизЛица(ФизЛицо, Организация, ТекущаяДата(),НеПроверятьБезОрганизации);
	
	Если МассивДолжностей.Найти(ДолжностьФизЛица) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		// найдем номер телефона
		НомерТелефона = Лико_Дополнительно.НайтиСотовыйНомерФизЛица(ФизЛицо);
		ЗапрашиватьСМС = ПараметрыСеанса.Лико_РабочееМесто.ТСПодтверждениеСчитыванияПропускаБригадираПоСмс;
		
		Возврат Истина;
	КонецЕсли;

КонецФункции


&НаСервере
Функция ОтправитьКодПодтвержденияПоСмс(НомерТелефона)
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ТСРабочийСтолЕРП");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("Не найдена дополнительная обработка с именем объекта ТСРабочийСтолЕРП");
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);

	Результат =  ВнешняяОбработка.ОтправитьКодПодтвержденияПоСмс(НомерТелефона, Объект.РабочееМесто);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции


&НаКлиенте
Процедура ПодписьДокументаЗавершение(ДопПараметры) Экспорт
	ДанОтветНаВопрос = Истина;
	Записать(ДопПараметры);
КонецПроцедуры


&НаКлиенте
Процедура БракМатериалаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратДавальцуПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатурыЦенаПриИзменении(Элемент)
	ТД=Элементы.ЦеныНоменклатуры.ТекущиеДанные;
	ТД.Сумма=ТД.Цена*ТД.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатурыСуммаПриИзменении(Элемент)
	
	ТД=Элементы.ЦеныНоменклатуры.ТекущиеДанные;
	Если ТД.Количество<>0 Тогда
		ТД.Цена=ТД.Сумма/ТД.Количество;  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования= Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихКода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan Code",ОповещениеСканирования,,ТипШтрихКода.Все);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" Не поддерживается сканирование штрихкодов");
		КонецЕсли; 		  	
	#КонецЕсли
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихКода(ШтрихКода,Результат,Сообщение,ДополнительныеПараметры) Экспорт //+Лико m.shenderov 30.07.2019
	#Если МобильныйКлиент Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("ШтрихКод",ШтрихКода);
		ОбработатьШтрихкоды(Структура);
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	
	
КонецПроцедуры //-Лико m.shenderov 30.07.2019



