#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Сообщение к передаче XML
//
// Параметры:
//  СсылкаНаОбъект          - СправочникСсылка - Ссылка на справочник.
//  Операция                - ПеречислениеСсылка.ВидыОперацийЗЕРНО - Операция ЗЕРНО.
//  ДополнительныеПараметры - Структура, Неопределено - Дополнительные параметры.
// Возвращаемое значение:
//  Массив из см. ИнтеграцияЗЕРНОСлужебный.СтруктураСообщенияXML - Сообщения к передаче.
//
Функция СообщениеКПередачеXML(СсылкаНаОбъект, Операция, ДополнительныеПараметры) Экспорт
	
	Возврат Справочники.КлассификаторНСИЗЕРНО.СообщениеКПередачеXML(СсылкаНаОбъект, Операция, ДополнительныеПараметры);
	
КонецФункции

Процедура ОбработкаЗагрузкиПолученныхДанных(ЭлементОчереди, ПараметрыОбмена, ПолученныеДанные, ИзмененныеОбъекты, ПрочитаноВерсиейAPI) Экспорт
	
	Справочники.КлассификаторНСИЗЕРНО.ОбработкаЗагрузкиПолученныхДанных(ЭлементОчереди, ПараметрыОбмена, ПолученныеДанные, ИзмененныеОбъекты, ПрочитаноВерсиейAPI);
	
КонецПроцедуры

// см. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры, ВременныеФайлы) Экспорт
	
	Справочники.КлассификаторНСИЗЕРНО.ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры, ВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
