
&НаКлиенте
Процедура ПодтвердитьОтклонитьИзменение(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		МассивДокументов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.Список.ВыделенныеСтроки);
		ПодтвердитьОтклонитьНаСервере(МассивДокументов, Команда.Имя);	
	КонецЕсли;
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьОтклонитьНаСервере(МассивДокументов, ИмяКоманды)

	Если ИмяКоманды = "ПодтвердитьИзменение" Тогда
		НовоеСостояние = Перечисления.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Подтверждено;
	ИначеЕсли ИмяКоманды = "ОтклонитьИзменение" Тогда
		НовоеСостояние = Перечисления.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Отклонено;
	Иначе
		Сообщить("Ошибка. Обратитесь к программистам");
		Возврат;
	КонецЕсли; 
	
	Для каждого ТекДокумент из МассивДокументов Цикл
		Если НЕ ЗначениеЗаполнено(ТекДокумент) Тогда
			Продолжить;
		КонецЕсли;
		Если ТекДокумент.ПометкаУдаления Тогда
			Сообщить("" + ТекДокумент + " помечен на удаление");
			Продолжить;
		КонецЕсли; 
		Если НЕ ТекДокумент.Проведен Тогда
			Сообщить("" + ТекДокумент + " сначала нужно провести");
			Продолжить;
		КонецЕсли; 
		Если ТекДокумент.Состояние = НовоеСостояние Тогда
			Сообщить("" + ТекДокумент + " уже " + ?(ИмяКоманды = "ПодтвердитьИзменение", "подтвержден", "отклонен"));
			Продолжить;
		КонецЕсли;
		
		ДокОбъект = ТекДокумент.ПолучитьОбъект();
		ДокОбъект.Состояние = НовоеСостояние;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Лико_Дополнительно.ЗапуститьПерепроведениеЗаказаВФоне(ТекДокумент.ЗаказКлиента);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВБЗ(Команда)

	Если Элементы.Список.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.ЗаказКлиента) Тогда		
		ПараметрыОткрытия = Лико_Дополнительно.ПолучитьПараметрыОткрытияПечатнойФормы(,, "ВнутреннийБланкЗаказаЕРП", Элементы.Список.ТекущиеДанные.ЗаказКлиента);
		Если ПараметрыОткрытия = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры
