#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	#Область ПрограммныйИнтерфейс
	
	Функция ОстаткиСерийПоБух(Дата,Организация,МассивСерий) Экспорт  //+Лико m.shenderov 03.04.2024
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыНаСкладахОстатки.Серия КАК Серия
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			Помещение.Лико_Организация = &Организация
	|				И Серия В (&МассивСерий)) КАК ТоварыНаСкладахОстатки";
	Запрос.УстановитьПараметр("Дата",Дата );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("МассивСерий",МассивСерий );

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");
	
	
	
	
КонецФункции //-Лико m.shenderov 03.04.2024 

	
	#КонецОбласти
	
//Имена реквизитов, от значений которых зависят параметры указания серий
//
//	Возвращаемое значение:
//		Строка - имена реквизитов, перечисленные через запятую
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	ИменаРеквизитов = "Склад,Дата";
	
	Возврат ИменаРеквизитов;
КонецФункции

// Возвращает текст запроса для проверки заполнения серий
//	Параметры:
//		ПараметрыУказанияСерий - Структура - состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий
//	Возвращаемое значение:
//		Строка - текст запроса
//
Функция ТекстЗапросаПроверкиЗаполненияСерий(ПараметрыУказанияСерий) Экспорт
	
	// Не нужно проверять количество, т.к. в задании на отбор и размещение не может быть серий, идентифицирующих экземпляр
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаСерий.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСерий.Номенклатура КАК Номенклатура,
	|	ТаблицаСерий.Серия КАК Серия,
	|	ТаблицаСерий.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТаблицаСерий.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ТаблицаСерий
	|ИЗ
	|	&ТаблицаСерий КАК ТаблицаСерий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаСерий.Номенклатура) КАК ТоварПредставление,
	|	ВЫБОР
	|		КОГДА ТаблицаСерий.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|					И НЕ ТаблицаСерий.СтатусУказанияСерий В (3, 4)
	|				ИЛИ ТаблицаСерий.СтатусУказанияСерий В (3, 4)
	|					И ТаблицаСерий.КоличествоУпаковок <> 0
	|					И &ФактОтбора
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СерияНеЗаполнена,
	|	ЛОЖЬ КАК ОшибкаКоличества,
	|	ТаблицаСерий.НомерСтроки КАК НомерСтроки,
	|	""Серия"" КАК ИмяПоляСерия
	|ИЗ
	|	ТаблицаСерий КАК ТаблицаСерий
	|ГДЕ
	|	ТаблицаСерий.СтатусУказанияСерий <> 0
	|	И ТаблицаСерий.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяПоляКоличество", ПараметрыУказанияСерий.ИмяПоляКоличество);
	
	Возврат ТекстЗапроса;
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе.
//
// Параметры:
//  Объект	 - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
// 
// Возвращаемое значение:
//  Структура - состав полей задается в функции ОбработкаТабличнойЧастиКлиентСервер.ПараметрыУказанияСерий.
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.Лико_ПередачаТоваров";
	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	ПараметрыУказанияСерий.ИмяТЧСерии  = "Товары";
	
	ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.Склад, Ложь);
	
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры  = ПараметрыСерийСклада.ИспользоватьСерииНоменклатуры;
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПараметрыСерийСклада.УчитыватьСебестоимостьПоСериям;
	ПараметрыУказанияСерий.ИспользоватьАдресноеХранение = Истина;
	ПараметрыУказанияСерий.ИмяПоляКоличество = "КоличествоУпаковок";	
		
	ПараметрыУказанияСерий.ЭтоОрдер = Истина;
	ПараметрыУказанияСерий.ИмяПоляПомещение = "Помещение";
	ПараметрыУказанияСерий.ОсобеннаяПроверкаСтатусовУказанияСерий = Истина;
	ПараметрыУказанияСерий.ИмяПоляКоличество = "КоличествоУпаковок";
	
	ПараметрыУказанияСерий.Дата = Объект.Дата;
	
	
		
	Возврат ПараметрыУказанияСерий;
КонецФункции


// Возвращает текст запроса для расчета статусов указания серий
//	Параметры:
//		ПараметрыУказанияСерий - Структура - состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий
//	Возвращаемое значение:
//		Строка - текст запроса
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Упаковка КАК Упаковка,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	Таблица.Серия,
	|	Таблица." + ПараметрыУказанияСерий.ИмяПоляКоличество + " КАК Количество,
	|	Таблица.СтатусУказанияСерий,
	|	Таблица.ДокументОтгрузки КАК ДокументОтгрузки,
	|	Таблица.НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
		
	Если ПараметрыУказанияСерий.ПоляСвязи.Найти("Упаковка") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Таблица.Упаковка", "ИСТИНА");
	КонецЕсли;
	Если ПараметрыУказанияСерий.ПоляСвязи.Найти("ДокументОтгрузки") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Таблица.ДокументОтгрузки", "ИСТИНА");
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|					ТОГДА ВЫБОР
	|							КОГДА Товары.Количество > 0
	|									И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|								ТОГДА ВЫБОР
	|										КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|											ТОГДА 14
	|										ИНАЧЕ 10
	|									КОНЕЦ
	|							КОГДА &ПодготовкаОрдера
	|								ТОГДА 11
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|										ТОГДА 13
	|									ИНАЧЕ 9
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|					ТОГДА ВЫБОР
	|							КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|								ТОГДА ВЫБОР
	|										КОГДА Товары.Количество > 0
	|												И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|											ТОГДА 6
	|										КОГДА &ПодготовкаОрдера
	|											ТОГДА 25
	|										ИНАЧЕ 5
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Количество > 0
	|											И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|										ТОГДА 8
	|									КОГДА &ПодготовкаОрдера
	|										ТОГДА 27
	|									ИНАЧЕ 7
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОГДА &УсловиеПоПараметруПолитикиУчетаСерий
	|					ТОГДА ВЫБОР
	|							КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|								ТОГДА ВЫБОР
	|										КОГДА Товары.Количество > 0
	|												И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|											ТОГДА 4
	|										КОГДА &ПодготовкаОрдера
	|											ТОГДА 23
	|										ИНАЧЕ 3
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Количество > 0
	|											И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|										ТОГДА 2
	|									КОГДА &ПодготовкаОрдера
	|										ТОГДА 21
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ ТаблицаСтатусов
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|			ПО ПолитикиУчетаСерий.Склад = Склады.Ссылка
	|		ПО (ПолитикиУчетаСерий.Склад = &Склад)
	|			И Товары.Номенклатура.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтатусов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСтатусов.СтатусУказанияСерий КАК СтатусУказанияСерий
	|ИЗ
	|	ТаблицаСтатусов КАК ТаблицаСтатусов
	|ГДЕ
	|	ТаблицаСтатусов.СтатусУказанияСерий <> ТаблицаСтатусов.СтарыйСтатусУказанияСерий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ЭтоВозвратНепринятыхТоваров = ПараметрыУказанияСерий.СкладскиеОперации
		.Найти(Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваров) <> Неопределено;
	ЭтоВозвратНепринятыхТоваровУстаревший = ПараметрыУказанияСерий.СкладскиеОперации
		.Найти(Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваровУстарел) <> Неопределено;
		
	Если ЭтоВозвратНепринятыхТоваров
		Или ЭтоВозвратНепринятыхТоваровУстаревший Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеПоПараметруПолитикиУчетаСерий",
			"ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриВозвратеНепринятыхПолучателемТоваров");
			
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеПоПараметруПолитикиУчетаСерий",
			"ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемке
			|						И (ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеОтПоставщика
			|								И &ПриемкаОтПоставщика
			|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПоВозвратуОтКлиента
			|								И &ПриемкаПоВозвратуОтКлиента
			//++ НЕ УТ
			|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПродукцииИзПроизводства
			|								И &ПриемкаПродукцииИзПроизводства
			//-- НЕ УТ
			|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПоПеремещению
			|								И &ПриемкаПоПеремещению
			|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПоПрочемуОприходованию
			|								И &ПриемкаПоПрочемуОприходованию
			|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеКомплектующихПослеРазборки
			|								И &ПриемкаКомплектующихПослеРазборки
			|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеСобранныхКомплектов
			|								И &ПриемкаСобранныхКомплектов)");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции


/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	
КонецПроцедуры




#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры);
	
    ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
	//ТекстЗапросаТаблицаТоварыКОформлениюПоступления(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаТоварыКОформлениюИзлишковНедостач(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры);

	
	ПроведениеДокументов.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект) 
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Дата КАК Период,
	|	Документ.Склад КАК Склад,
	|	Документ.Помещение КАК Помещение,
	|	Документ.ВидОперации КАК ВидОперации,
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	Документ.Партнер КАК Отправитель,
	|	Документ.АдресХранения КАК АдресХранения,
	|	Документ.Распоряжение КАК Распоряжение,
	|	ЛОЖЬ КАК ЗакрыватьГрафикПоступления,
	|	Документ.Партнер КАК Партнер,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.Организация КАК Организация
	|ИЗ
	|	Документ.Лико_ВозвратТоваров КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	
	Запрос.УстановитьПараметр("Склад",       		Реквизиты.Склад);
	Запрос.УстановитьПараметр("Период",      		Реквизиты.Период);
	Запрос.УстановитьПараметр("ВидОперации", 		Реквизиты.ВидОперации);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", Реквизиты.ЗаданиеНаПеревозку);
    Запрос.УстановитьПараметр("Отправитель", 		Реквизиты.Отправитель);
	Запрос.УстановитьПараметр("Помещение",         	Реквизиты.Помещение);
	Запрос.УстановитьПараметр("Отправитель2", 		Реквизиты.Партнер);
	Запрос.УстановитьПараметр("Организация", 		Реквизиты.Организация);


	
	
	
	
	Запрос.УстановитьПараметр("Распоряжение",                        Реквизиты.Распоряжение);
	Запрос.УстановитьПараметр("ЗонаПриемки",                         Реквизиты.АдресХранения);
	Запрос.УстановитьПараметр("Статус",                              Перечисления.СтатусыПриходныхОрдеров.Принят);

	Запрос.УстановитьПараметр("ИспользоватьАдресноеХранение",       истина);
	Запрос.УстановитьПараметр("ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач", истина);
	Запрос.УстановитьПараметр("СкладскаяОперация",                   Перечисления.СкладскиеОперации.ПриемкаОтПоставщика);
	Запрос.УстановитьПараметр("Отправитель",                         Реквизиты.Партнер);
	Запрос.УстановитьПараметр("ВозвратНепринятыхТоваров",            Ложь);
	Запрос.УстановитьПараметр("ЗакрыватьГрафикПоступления",          Реквизиты.ЗакрыватьГрафикПоступления);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация2",               Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчика);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",          Неопределено);
	
	ЕстьРаспоряжениеНаОтгрузку = ЗначениеЗаполнено(ДокументСсылка.Распоряжение);
	
	Если    ЕстьРаспоряжениеНаОтгрузку Тогда
		
		ЕстьРаспоряжениеНаОтгрузку = ЗначениеЗаполнено(ДокументСсылка.Распоряжение.Дата);
		
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("ЕстьРаспоряжениеНаОтгрузку",ЕстьРаспоряжениеНаОтгрузку);



	
	// Если в соглашении указаны особые правила учета товаров к поступлению.
	Если Реквизиты.ЗакрыватьГрафикПоступления Тогда
		Если ТипЗнч(Реквизиты.Распоряжение) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
			Запрос.УстановитьПараметр("РаспоряжениеДляГрафика", Справочники.СоглашенияСПоставщиками.ПолучитьДокументРегистрации(Реквизиты.Распоряжение));
		Иначе
			Запрос.УстановитьПараметр("РаспоряжениеДляГрафика", Реквизиты.Распоряжение);
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("РаспоряжениеДляГрафика", Неопределено);
	КонецЕсли;
	



		
КонецПроцедуры

Функция ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыВЯчейках";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Лико_ВозвратТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ВозвратТоваровТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ВозвратТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ВозвратТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ВозвратТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ВозвратТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.Ссылка.АдресХранения = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ВозвратТоваровТовары.АдресХраненияНовый
	|		ИНАЧЕ Лико_ВозвратТоваровТовары.Ссылка.АдресХранения
	|	КОНЕЦ КАК Ячейка,
	|	Лико_ВозвратТоваровТовары.КоличествоУпаковок КАК ВНаличии,
	|	0 КАК КОтбору,
	|	0 КАК КРазмещению,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ВозвратТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства)
	|			ИЛИ Лико_ВозвратТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходПоАктуРазборки))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_ВозвратТоваровТовары.Номенклатура,
	|	Лико_ВозвратТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ВозвратТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ВозвратТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ВозвратТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ВозвратТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	Лико_ВозвратТоваровТовары.АдресХранения,
	|	Лико_ВозвратТоваровТовары.КоличествоУпаковок,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ВозвратТоваровТовары.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки))
	|	И Лико_ВозвратТоваровТовары.АдресХранения <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_ВозвратТоваровТовары.Номенклатура,
	|	Лико_ВозвратТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ВозвратТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ВозвратТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ВозвратТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ВозвратТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ВозвратТоваровТовары.Ссылка.АдресХранения = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ВозвратТоваровТовары.АдресХраненияНовый
	|		ИНАЧЕ Лико_ВозвратТоваровТовары.Ссылка.АдресХранения
	|	КОНЕЦ,
	|	Лико_ВозвратТоваровТовары.КоличествоУпаковок,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ВозвратТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
  
Функция ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКПоступлению";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&Отправитель2 КАК Отправитель,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	&Распоряжение КАК ДокументПоступления,
	|	0 КАК Принимается,
	|	ТаблицаТовары.Количество КАК КОформлениюОрдеров,
	|	0 КАК КОформлениюПоступленийПоОрдерам,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	&ХозяйственнаяОперация2 КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)
	|	И ТаблицаТовары.Количество <> 0
	|	И НЕ &ВозвратНепринятыхТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	&Отправитель2,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	&Распоряжение,
	|	0,
	|	0,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Назначение,
	|	&ХозяйственнаяОперация2
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)
	|	И ТаблицаТовары.Количество <> 0
	|	И НЕ &ВозвратНепринятыхТоваров";
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//|	&Период КАК Период,
	//|	&Склад КАК Склад,
	//|	&Отправитель КАК Отправитель,
	//|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	//|	ТаблицаТовары.Характеристика КАК Характеристика,
	//|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	//|	&Распоряжение КАК ДокументПоступления,
	//|	ТаблицаТовары.Количество КАК КОформлениюОрдеров,
	//|	0 КАК КОформлениюПоступленийПоОрдерам,
	//|	0 КАК Принимается,
	//|	ТаблицаТовары.Назначение КАК Назначение,
	//|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	//|ИЗ
	//|	ВтТаблицаТовары КАК ТаблицаТовары
	//|ГДЕ
	//|	ТаблицаТовары.Количество <> 0
	//|	И &ЕстьРаспоряжениеНаОтгрузку
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	&Период,
	//|	&Склад,
	//|	&Подразделение,
	//|	ТаблицаТовары.Номенклатура,
	//|	ТаблицаТовары.Характеристика,
	//|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	//|	&Распоряжение,
	//|	0,
	//|	ТаблицаТовары.Количество,
	//|	0,
	//|	ТаблицаТовары.Назначение,
	//|	&ХозяйственнаяОперация
	//|ИЗ
	//|	ВтТаблицаТовары КАК ТаблицаТовары
	//|ГДЕ
	//|	ТаблицаТовары.Количество <> 0
	//|	И &ЕстьРаспоряжениеНаОтгрузку";

	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыНаСкладах";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&Помещение КАК Помещение,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК ВНаличии,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0
	|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)
	|	И &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	&Помещение,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, Склад.Лико_площадка.Организация = &Организация) КАК ТоварыНаСкладахОстатки
	|		ПО ТаблицаТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0
	|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки)
	|	И &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И ТоварыНаСкладахОстатки.Серия ЕСТЬ NULL
	|	И &ЕстьРаспоряжениеНаОтгрузку";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияСерийТоваров";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.Количество КАК Количество,
	|	&Склад КАК Получатель,
	|	&Помещение КАК ПомещениеПолучателя,
	|	&Отправитель КАК Отправитель,
	|	&СкладскаяОперация КАК СкладскаяОперация,
	|	&Ссылка КАК Документ,
	|	&Период КАК Период,
	|	ИСТИНА КАК ЭтоСкладскоеДвижение
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И 
	|		 &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТоварыКОформлениюПоступления(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКОформлениюПоступления";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	&Склад                                 КАК Склад,
	|	&Отправитель                           КАК Отправитель,
	|	&Распоряжение                          КАК ДокументПоступления,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.Количество               КАК КОформлению,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий = 14
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ                                  КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	&ХозяйственнаяОперация                 КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0
	|	И &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И НЕ &ВозвратНепринятыхТоваров
	|			И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТоварыКОформлениюИзлишковНедостач(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКОформлениюИзлишковНедостач";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК КОформлениюАктов,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий = 14
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0
	|	И &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И &ВозвратНепринятыхТоваров
	|	И &ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ОбеспечениеЗаказов";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                      КАК Период,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	&Склад          			 КАК Склад,
	|	ТаблицаТовары.Назначение     КАК Назначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Количество
	|	КОНЕЦ 						 КАК НаличиеПодЗаказ
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)	
	|	И ТаблицаТовары.Количество <> 0
	|	И &Статус = Значение(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвижениеТоваров";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период                      КАК Период,
	|	&Склад                       КАК Склад,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	&РаспоряжениеДляГрафика      КАК Распоряжение,
	|	ВЫБОР КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|		  ТОГДА ТаблицаТовары.Назначение
	|		  ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ						 КАК ПланируемоеПоступление,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ						 КАК ПланируемоеПоступлениеПодЗаказ,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ						 КАК ПланируемоеПоступлениеСНеподтвержденными,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ						 КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	&ЗакрыватьГрафикПоступления
	|	И &Статус = Значение(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И ТаблицаТовары.Количество <> 0
	|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "СвободныеОстатки";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК ВНаличии,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВРезервеПодЗаказ
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И  &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаТовары";
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Лико_ВозвратТоваровТовары.Ссылка КАК Ссылка,
	|	Лико_ВозвратТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ВозвратТоваровТовары.Характеристика КАК Характеристика,
	|	Лико_ВозвратТоваровТовары.Назначение КАК Назначение,
	|	Лико_ВозвратТоваровТовары.Серия КАК Серия,
	|	Лико_ВозвратТоваровТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	Лико_ВозвратТоваровТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаТовары
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции




#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Задание складскому работнику
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьДокумента";
	КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.СразуНаПринтер = Истина;	
	
	
	

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПечатьДокумента",
			НСтр("ru = 'ПечатьДокумента'"),
			ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)

	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьДокумента_ПередачаТоваров";

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВозвратТоваров.Ссылка КАК Ссылка,
	|	Лико_ВозвратТоваров.Дата КАК Дата,
	|	Лико_ВозвратТоваров.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ВозвратТоваров.Склад) КАК СкладПредсавление,
	|	Лико_ВозвратТоваров.Склад КАК Склад,
	|	Лико_ВозвратТоваров.Получатель КАК Получатель,
	|	Лико_ВозвратТоваров.ВидОперации КАК ВидОперации,
	|	Лико_ВозвратТоваров.Распоряжение КАК Распоряжение,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ВозвратТоваров.АвторДокумента) КАК ИсполнительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ВозвратТоваров.Распоряжение) КАК РаспоряжениеПредставление,
	|	Лико_ВозвратТоваров.Распоряжение.Номер КАК РаспоряжениеНомер,
	|	Лико_ВозвратТоваров.Распоряжение.Дата КАК РаспоряжениеДата
	|ИЗ
	|	Документ.Лико_ВозвратТоваров КАК Лико_ВозвратТоваров
	|ГДЕ
	|	Лико_ВозвратТоваров.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ВозвратТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	0 КАК Метка,
	|	Лико_ВозвратТоваровТовары.КоличествоУпаковок КАК КоличествоПлан,
	|	Лико_ВозвратТоваровТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	Лико_ВозвратТоваровТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|	Лико_ВозвратТоваровТовары.Серия.Наименование КАК СерияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ВозвратТоваровТовары.Упаковка) КАК УпаковкаПредставление,
	|	Лико_ВозвратТоваровТовары.Номенклатура.Код КАК Код,
	|	Лико_ВозвратТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	Лико_ВозвратТоваровТовары.Ссылка КАК Ссылка,
	|	Лико_ВозвратТоваровТовары.АдресХранения КАК АдресХранения
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Метка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	//Нужно напечатать номер и дату накладной, но к накладным может не быть доступа
	УстановитьПривилегированныйРежим(Истина);

	Результаты = Запрос.ВыполнитьПакет();

	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаПоДокументам      = Результаты[0].Выбрать();
	ВыборкаПоТабличнымЧастям = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);


	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс, Представление");

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Лико_ВозвратТоваров.ПФ_MXL_ПечатнаяФормаДокумента");

	ОбластьЗаголовок 		  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСкладИсполнитель   = Макет.ПолучитьОбласть("СкладИсполнитель");

	ОбластьШапкаТаблицыНачало 	= Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
	ОбластьСтрокаТаблицыНачало 	= Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
	ОбластьПодвалТаблицыНачало 	= Макет.ПолучитьОбласть("ПодвалТаблицы|НачалоСтроки");

	ОбластьШапкаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьСтрокаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
	ОбластьПодвалТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
	ОбластьПодзаголовок 	 			 = Макет.ПолучитьОбласть("Подзаголовок");
	ОбластьРаспоряжение 	  = Макет.ПолучитьОбласть("Распоряжение");
	ОбластьШапкаТаблицыКолонкаКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов; 

	Если НЕ ВыводитьКоды Тогда
		ОбластьКолонкаТоваров = Макет.Область("КолонкаТоваров");

		ОбластьКолонкаТоваров.ШиринаКолонки = ОбластьКолонкаТоваров.ШиринаКолонки  + Макет.Область("КолонкаКодов").ШиринаКолонки;
	КонецЕсли;	

	ОбластьШапкаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаТоваров");
	ОбластьСтрокаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаТоваров");
	ОбластьПодвалТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаТоваров");

	ОбластьШапкаТаблицыКонец 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	ОбластьСтрокаТаблицыКонец 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КонецСтроки");
	ОбластьПодвалТаблицыКонец 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КонецСтроки");

	ПервыйДокумент = Истина;

	Пока ВыборкаПоДокументам.Следующий() Цикл

		Если НЕ ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;

		ВыборкаПоСтрокамТЧ = ВыборкаПоТабличнымЧастям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ВыводитьОснование = Ложь;

		//Если ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор Тогда

		ТекстЗаголовка		 = НСтр("ru='Возврат на склад'");
		//ТекстЗоны			 = НСтр("ru='Зона отгрузки:'");
		//ЗонаПредставление	 = ВыборкаПоДокументам.ЗонаОтгрузкиПредставление;
		//РабочийУчасток		 = ВыборкаПоДокументам.РабочийУчастокПредставление;
		ВыводитьРаспоряжение = Истина;
		//ВыводитьОснование    = ТипЗнч(ВыборкаПоДокументам.Распоряжение) = Тип("ДокументСсылка.РасходныйОрдерНаТовары");
		ВыводитьПодзаголовок = Истина;

		//ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение Тогда
		//	
		//	ТекстЗаголовка = НСтр("ru='Задание на размещение товара'");
		//	ТекстЗоны = НСтр("ru='Зона приемки:'");
		//	ЗонаПредставление = ВыборкаПоДокументам.ЗонаПриемкиПредставление;
		//	РабочийУчасток		= ВыборкаПоДокументам.РабочийУчастокПредставление;
		//	ВыводитьРаспоряжение = Ложь;
		//	ВыводитьПодзаголовок = Ложь;
		//	
		//ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение Тогда
		//	
		//	ТекстЗаголовка = НСтр("ru='Задание на перемещение товара'");
		//	ТекстЗоны = "";
		//	ЗонаПредставление = "";
		//	РабочийУчасток	= "";
		//	ВыводитьРаспоряжение = Ложь;
		//	ВыводитьПодзаголовок = Истина;
		//				
		//КонецЕсли;

		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаПоДокументам);

		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, ТекстЗаголовка);

		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ВыборкаПоДокументам.Ссылка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		//ОбластьСкладИсполнитель.Параметры.ИсполнительПредставление	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Исполнитель, ВыборкаПоДокументам.Дата);
		//ОбластьСкладИсполнитель.Параметры.СкладПредставление		= СкладыСервер.ПолучитьПредставлениеСклада(ВыборкаПоДокументам.СкладПредставление,ВыборкаПоДокументам.ПомещениеПредставление);
		//ОбластьСкладИсполнитель.Параметры.ТекстЗоны 				= ТекстЗоны;
		//ОбластьСкладИсполнитель.Параметры.ЗонаПредставление 		= ЗонаПредставление;

		//Если ЗначениеЗаполнено(РабочийУчасток) Тогда
		//	ОбластьСкладИсполнитель.Параметры.ТекстРабочегоУчастка = НСтр("ru = 'Рабочий участок:'");
		//	ОбластьСкладИсполнитель.Параметры.РабочийУчастокПредставление = РабочийУчасток;			
		//Иначе
		//	ОбластьСкладИсполнитель.Параметры.ТекстРабочегоУчастка = "";
		//	ОбластьСкладИсполнитель.Параметры.РабочийУчастокПредставление = "";			
		//КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьСкладИсполнитель);

		//Если ВыводитьОснование Тогда
		//	
		//	Счетчик = 0;
		//	ПредставлениеОснований = "";
		//	ПервоеРаспоряжение = Истина;
		//	РеквизитыДокумента = Новый Структура("Дата, Номер, Префикс, Представление");
		//	
		//	Пока ВыборкаПоРаспоряжениям.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка)) Цикл
		//		
		//		РеквизитыДокумента.Дата          = ВыборкаПоРаспоряжениям.ОснованиеДата;
		//		РеквизитыДокумента.Номер         = ВыборкаПоРаспоряжениям.ОснованиеНомер;
		//		РеквизитыДокумента.Префикс       = "";
		//		РеквизитыДокумента.Представление = ВыборкаПоРаспоряжениям.ОснованиеПредставление;
		//		
		//	ПредставлениеОснования = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
		//		
		//		Если Не ПервоеРаспоряжение Тогда
		//			ПредставлениеОснований = ПредставлениеОснований + ", ";		
		//		КонецЕсли;
		//		
		//		ПервоеРаспоряжение = Ложь;
		//		
		//		ПредставлениеОснований = ПредставлениеОснований + ПредставлениеОснования;
		//		
		//		Счетчик = Счетчик + 1;
		//		
		//	КонецЦикла;
		//	
		//	ОснованияЗаголовок = "";
		//	Если Счетчик > 1 Тогда 
		//		ОснованияЗаголовок = НСтр("ru = 'Основания:'");
		//	Иначе
		//		ОснованияЗаголовок = НСтр("ru = 'Основание:'");
		//	КонецЕсли;
		//	
		//	ОбластьОснование.Параметры.ОснованияПредставление = ПредставлениеОснований;
		//	ОбластьОснование.Параметры.ОснованияЗаголовок = ОснованияЗаголовок;
		//	
		//	ТабличныйДокумент.Вывести(ОбластьОснование);
		//	
		//КонецЕсли;
		//
		Если ВыводитьРаспоряжение Тогда
			РеквизитыДокумента.Дата          = ВыборкаПоДокументам.РаспоряжениеДата;
			РеквизитыДокумента.Номер         = ВыборкаПоДокументам.РаспоряжениеНомер;
			РеквизитыДокумента.Префикс       = "";
			РеквизитыДокумента.Представление = ВыборкаПоДокументам.РаспоряжениеПредставление;

			ОбластьРаспоряжение.Параметры.РаспоряжениеПредставление	= ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
			ТабличныйДокумент.Вывести(ОбластьРаспоряжение);
		КонецЕсли;
		//
		//Если ВыборкаПоДокументам.ОтгрузкаПоЗаданиюНаПеревозку Тогда
		//	РеквизитыДокумента.Дата          = ВыборкаПоДокументам.ЗаданиеНаПеревозкуДата;
		//	РеквизитыДокумента.Номер         = ВыборкаПоДокументам.ЗаданиеНаПеревозкуНомер;
		//	РеквизитыДокумента.Префикс       = "";
		//	РеквизитыДокумента.Представление = ВыборкаПоДокументам.ЗаданиеНаПеревозкуПредставление;
		//	                                    
		//	ОбластьЗаданиеНаПеревозку.Параметры.ЗаданиеНаПеревозкуПредставление	= ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
		//	ОбластьЗаданиеНаПеревозку.Параметры.ПорядокДоставки = ВыборкаПоДокументам.ПорядокДоставки;
		//	ТабличныйДокумент.Вывести(ОбластьЗаданиеНаПеревозку);
		//КонецЕсли;

		Метка = Неопределено;

		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл

			Если Метка <> ВыборкаПоСтрокамТЧ.Метка Тогда
				Если ВыводитьПодзаголовок Тогда


					ТекстПозаголовка=ВыборкаПоДокументам.ВидОперации;

					Если Метка <> Неопределено Тогда
						ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
						Если ВыводитьКоды Тогда
							ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
						КонецЕсли;
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);
					КонецЕсли;

					ОбластьПодзаголовок.Параметры.ТекстПозаголовка = ТекстПозаголовка;
					ТабличныйДокумент.Вывести(ОбластьПодзаголовок);
				КонецЕсли;

				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыНачало);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаКодов);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаТоваров);
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКонец);
			КонецЕсли;

			ОбластьСтрокаТаблицыНачало.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыНачало);

			Если ВыводитьКоды Тогда
				ОбластьСтрокаТаблицыКолонкаКодов.Параметры.Артикул = ВыборкаПоСтрокамТЧ[КолонкаКодов];
				ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаКодов);
			КонецЕсли;

			ОбластьСтрокаТаблицыКолонкаТоваров.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоСтрокамТЧ.НоменклатураПредставление,
			ВыборкаПоСтрокамТЧ.ХарактеристикаПредставление,
			, // Упаковка
			ВыборкаПоСтрокамТЧ.СерияПредставление);

			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаТоваров);

			ОбластьСтрокаТаблицыКонец.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКонец);	

			Метка = ВыборкаПоСтрокамТЧ.Метка;

		КонецЦикла;

		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;

	Возврат ТабличныйДокумент;	
КонецФункции


#КонецОбласти

  
#Область ИмяДокумента

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ХозяйственнаяОперация");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Ссылка.ВидОперации) Тогда

		ПредставлениеОперации = СписокОпераций().НайтиПоЗначению(Данные.Ссылка.ВидОперации);
		Если ПредставлениеОперации <> Неопределено Тогда
			ПредставлениеОперации = ПредставлениеОперации.Представление;
		Иначе
			ПредставлениеОперации = "Передача со склада";
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 %2 от %3'"),
			ПредставлениеОперации,
			Данные.Номер,
			Данные.Дата);
		
	КонецЕсли;
		
КонецПроцедуры



Функция СписокОпераций() Экспорт

	СписокОпераций = Новый СписокЗначений;
	
	ПриходИзПроизводства				= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства");
	ПриходИзПереработки					= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки");
	ПриходИзРемонта						= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзРемонта");
	ВводНачальныхОстатковФорм			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм");
	ПриходФорм							= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм");
	ПриходПоАктуРазборки				= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходПоАктуРазборки");
	ПоступлениеНаОтветсвенноеХранение	= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПоступлениеНаОтветсвенноеХранение");

	
		
	СписокОпераций.Добавить(ПриходИзПроизводства, 				НСтр("ru = 'лк Приход из производства'"));
	СписокОпераций.Добавить(ПриходИзПереработки,    		 	НСтр("ru = 'лк Приход из переработки'"));
	
	СписокОпераций.Добавить(ПриходИзРемонта, 					НСтр("ru = 'лк Приход из ремонта'"));
	СписокОпераций.Добавить(ВводНачальныхОстатковФорм,     		НСтр("ru = 'лк Ввод начальных остатков форм'"));
	
	СписокОпераций.Добавить(ПриходФорм, 						НСтр("ru = 'лк Приход форм'"));
	СписокОпераций.Добавить(ПриходПоАктуРазборки,    			НСтр("ru = 'лк Приход по акту разборки'"));
	СписокОпераций.Добавить(ПоступлениеНаОтветсвенноеХранение,  НСтр("ru = 'лк Поступление на ответсвенное хранение'"));


		
	Возврат СписокОпераций;

КонецФункции

#КонецОбласти

  
//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
  //МеханизмыДокумента.Добавить("ЗакрытиеБланков"); 
  МеханизмыДокумента.Добавить("АдресныйСклад");
  МеханизмыДокумента.Добавить("Лико_Склад");

КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры);	
		ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
		//ТекстЗапросаТаблицаТоварыКОформлениюПоступления(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыКОформлениюИзлишковНедостач(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвижениеТоваров(Запрос, ТекстыЗапроса, Регистры);   		
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции


//- <--- Лико2.5 m.shenderov 30.03.2022 


#КонецЕсли
