


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства;
	КонецЕсли;	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
			

	
	//+Проверка ЯССМ Склада
	//#Если Клиент Тогда
	Если Не Лико_ОбщегоНазначенияСервер.АдминистраторСклада() Тогда
		Расшифровка = "";			
		МассивОбъектов = Товары.ВыгрузитьКолонку("Серия");
		МожноПровестиДокумент = Лико_ОбщегоНазначенияСервер.ПроверитьВозможностьПроведенияДокумента(ЭтотОбъект, МассивОбъектов, РежимЗаписи, РежимПроведения, Расшифровка);
		Если Не МожноПровестиДокумент Тогда
			
			СообщениеПользователю = "Невозможно провести документ на это время! Пояснение: " + Расшифровка;
			Сообщить(СообщениеПользователю);			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//#КонецЕсли
	//-Проверка ЯССМ Склада
	
	// --> Начало Лико Ефимов ЕВВ 25.08.2021
	ПроверитьНовыеАдресаХранения(Отказ, РежимЗаписи);
	// <-- Конец Лико Ефимов ЕВВ 25.08.2021	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм или
		ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм	   Тогда
		Товары.Очистить();
	Иначе
		Формы.Очистить();
	КонецЕсли;
	
	
	
	Если ТипЗнч(Отправитель)=Тип("СправочникСсылка.Контрагенты") и ЗначениеЗаполнено(Отправитель) Тогда
		Контрагент=Отправитель;
		Партнер=Контрагент.Партнер;
	КонецЕсли;
	
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);	
	ДополнительныеСвойства.Вставить("БылПроведен", Проведен); 
	
	
	//ТаблицаТоваровИзменена--> 
	
	ТзТоварыСтарые =   Ссылка.Товары.Выгрузить(,"Номенклатура");
	ТзТоварыНовые  = Товары.Выгрузить(,"Номенклатура");
	
	ТзТоварыСтарые.Свернуть("Номенклатура");
	ТзТоварыНовые.Свернуть("Номенклатура");
	
	ЕстьИзмененияТоваров = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТзТоварыСтарые,ТзТоварыНовые);
	
	ДополнительныеСвойства.Вставить("ТаблицаТоваровИзменена", ЕстьИзмененияТоваров); 
	
	//ТаблицаТоваровИзменена<--	
	
	
	
	ЕСли ОтражатьВБухгалтерскомУчете=Истина Тогда
		
		ПроверитьНаличиеРаспоряжения();
	Иначе
		Распоряжение=Неопределено;
	КонецЕсли;
	Для каждого Товар Из Товары Цикл
		Если ЗначениеЗаполнено(Товар.Серия) Тогда	
			Товар.СтатусУказанияСерий=8;
		Иначе
			Товар.СтатусУказанияСерий=7;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ДанныеПоНаработке Тогда
		
		Для каждого Товар Из Товары Цикл
			Если Товар.НаработкаТекущейОперации>0 Тогда
				ДанныеПоНаработке=Истина;
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЕсли;
		
	Если ЭтоНовый() и ОтражатьВБухгалтерскомУчете Тогда
		НоваяСсылка=Документы.Лико_ВозвратТоваров.ПолучитьСсылку();
		ДополнительныеСвойства.Вставить("НоваяСсылкаСсылка",НоваяСсылка);
		УстановитьСсылкуНового(НоваяСсылка);
		Распоряжение=Неопределено; 
		
	КонецЕсли;

	 Если  Не Проведен Тогда	
		ОбработатьРаспоряжение(ДополнительныеСвойства.РежимЗаписи,Отказ);
	КонецЕсли;
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства И 
		Не ЗначениеЗаполнено(Отправитель) Тогда
		ГУ=Справочники.РабочиеЦентры.НайтиПоНаименованию("Гравировальный участок");
		АдресГУ =ГУ.ЛикоЯчейка;
		
		Для каждого Товар Из Товары Цикл
			Если Товар.АдресХранения=АдресГУ Тогда
				Отправитель=ГУ;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		ЗаполнитьСклады(Отказ, РежимЗаписи);

		//+ ---> Лико2.5 m.shenderov 30.03.2022
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	//- <--- Лико2.5 m.shenderov 30.03.2022


КонецПроцедуры

Процедура ПроверитьНовыеАдресаХранения(Отказ, РежимЗаписи) // --> Начало Лико Ефимов ЕВВ 25.08.2021
	
	Если Дата < Дата('20210826100000') ИЛИ РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка
		|ПОМЕСТИТЬ ВТ_ЯчейкиРабочихЦентров
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|ГДЕ
		|	НЕ РабочиеЦентры.ВидРабочегоЦентра В (&ВидыРЦИсключения)
		|	И РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочиеЦентры.ЛикоЯчейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.АдресХраненияНовый КАК Справочник.СкладскиеЯчейки) КАК АдресХраненияНовый,
		|	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|			ТОГДА &ЯчейкаИзШапки
		|		ИНАЧЕ ВТ.АдресХраненияНовый
		|	КОНЕЦ КАК АдресХраненияСУчетомТЧ,
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.АдресХраненияНовый КАК АдресХраненияНовый
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.АдресХраненияСУчетомТЧ КАК АдресХраненияСУчетомТЧ,
		|	ВТ2.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ВТ_ЯчейкиРабочихЦентров.Ячейка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЯчейкаРЦ,
		|	ВТ2.АдресХраненияНовый КАК АдресХраненияНовый
		|ПОМЕСТИТЬ ВТ3
		|ИЗ
		|	ВТ2 КАК ВТ2
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЯчейкиРабочихЦентров КАК ВТ_ЯчейкиРабочихЦентров
		|		ПО ВТ2.АдресХраненияСУчетомТЧ = ВТ_ЯчейкиРабочихЦентров.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ3.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ВТ3.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АдресХраненияНовыйПустой
		|ИЗ
		|	ВТ3 КАК ВТ3
		|ГДЕ
		|	ВТ3.ЯчейкаРЦ";
	
	Запрос.УстановитьПараметр("ТЗ", Товары.Выгрузить(,"НомерСтроки,АдресХраненияНовый"));
	Запрос.УстановитьПараметр("ЯчейкаИзШапки", АдресХранения);
	Запрос.УстановитьПараметр("ВидыРЦИсключения", Лико_Дополнительно.СформироватьМассивИсключенийВидовРЦДляПоискаЯчеекРЦ());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + " Строка №" + ВыборкаДетальныеЗаписи.НомерСтроки + ": материалы запрещено возвращать в ячейки рабочих центров";
		Если ВыборкаДетальныеЗаписи.АдресХраненияНовыйПустой Тогда
			Сообщение.Поле = "АдресХранения";
		Иначе
			Сообщение.Поле = "Товары["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].АдресХраненияНовый";
		КонецЕсли;
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 25.08.2021 


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
   //+ ---> Лико2.5 m.shenderov 05.04.2022
  	Если Отказ Тогда
		Возврат;
	КонецЕсли;


	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	 //- <--- Лико2.5 m.shenderov 05.04.2022
 

	СозатьНаборЗаписейИсторяФорм(Отказ);
	СозатьНаборЗаписейПоНаработке(Отказ);
	// <-- Начало Лико Яцун С. В. 11.03.2024 
	ДатаГлубокихФорм = Справочники.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм.ЗначениеПараметра;
	Если ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() И ВидОперации = Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки Тогда
		//Если ДополнительныеСвойства.ТаблицаТоваровИзменена Тогда 
			
			СозатьЗаписьПоЗаявкамНаГравировкуВалов(Отказ, ДополнительныеСвойства.ТаблицаТоваровИзменена);
			
		//КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 11.03.2024

	Если Не Отказ и ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходПоАктуРазборки Тогда

		//УстановитьПризнакАктаРазборкиУНоменклатуры();

	КонецЕсли;
	Лико_ОбщегоНазначенияСервер.ПроверитьКоличествоОбъектаНоменклатуры(Товары.ВыгрузитьКолонку("Серия"));
	
	РегистрыСведений.Лико_СерииНоменклатурыДоп.Записать(ЭтотОбъект); 

	Обработки.ПеремещениеТоваровДоп.СформироватьДокумент(ЭтотОбъект);


КонецПроцедуры



Процедура СтруктураПараметровЗаписиОбъекта() 	
	
	Если Не ДополнительныеСвойства.Свойство("ЕстьВопросыПередЗаписью") ТОгда
		ДополнительныеСвойства.Вставить("ЕстьВопросыПередЗаписью", Ложь);
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("НовыйОбъект") ТОгда
		ДополнительныеСвойства.Вставить("НовыйОбъект", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ПринудительноЗакрытьФорму") ТОгда
		ДополнительныеСвойства.Вставить("ПринудительноЗакрытьФорму", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("РежимЗаписи") ТОгда
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);		
	КонецЕсли; 	
	Если Не ДополнительныеСвойства.Свойство("РежимПроведения") ТОгда
		ДополнительныеСвойства.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный); 	
	КонецЕсли;
	
Конецпроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ОбработатьРаспоряжение(РежимЗаписиДокумента.ОтменаПроведения,Отказ);
	
	
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПрочееОприходованиеТоваров","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПриобретениеУслугПрочихАктивов","Лико_Документ",Ссылка,Отказ); 
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПеремещениеТоваров","Лико_Документ",Ссылка,Отказ);
	Распоряжение=Неопределено;
	Лико_ПоступлениеБух=Неопределено;
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ДополнительныеСвойства.Свойство("ПараметрыПроверки") Тогда	
		ПараметрыПроверки = ДополнительныеСвойства.ПараметрыПроверки;
		НепроверяемыеРеквизитыМассив = ПараметрыПроверки.НепроверяемыеРеквизиты;
		Для Каждого СтрМас из НепроверяемыеРеквизитыМассив Цикл
			МассивНепроверяемыхРеквизитов.Добавить(СтрМас);
		КонецЦикла;
	Иначе
		
	КонецЕсли;
	
	Если Не СкладыСервер.ИспользоватьСкладскиеПомещения(Склад,Дата) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Помещение");
	КонецЕсли;
	
	
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
	ПараметрыПроверки.ИмяТЧ = "Товары";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ,ПараметрыПроверки);
	
	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
		ТекстСообщения = НСтр("ru='В настройках программы не включено использование упаковок номенклатуры, 
		|поэтому нельзя оформить документ по складу с адресным хранением остатков. Обратитесь к администратору'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
	Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
		
	КонецЕсли;
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм Или
		ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
		МассивНепроверяемыхРеквизитов.Добавить("Получатель");
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
		
		
	КонецЕсли;
	
	  Если Не (ОтражатьВБухгалтерскомУчете) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Лико_ЦеныНоменклатуры");
		МассивНепроверяемыхРеквизитов.Добавить("Лико_ЦеныНоменклатуры.Цена"); 
	КонецЕсли;

	
	
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияУпаковок();
	ПараметрыПроверки.ИмяТЧ = "Товары";
	НоменклатураСервер.ПроверитьЗаполнениеУпаковок(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ, ПараметрыПроверки);
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.Лико_ПередачаТоваров);
	
	//НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,ПараметрыУказанияСерий,Отказ, МассивНепроверяемыхРеквизитов);
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	//ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиЗаполненияКоличества();
	//ПараметрыПроверки.ИмяТЧ = "Товары";
	//ПараметрыПроверки.СуффиксДопРеквизита = "";
	//ПараметрыПроверки.ПроверитьВозможностьОкругления = Ложь;
	//ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ,ПараметрыПроверки);
	

КонецПроцедуры


#КонецОбласти

#Область ИнициализацияИЗаполнение



Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
КонецПроцедуры



#КонецОбласти

#Область Прочее


Процедура СформироватьСписокРегистровДляКонтроля()
	
	
	
	Массив = Новый Массив;
	
	Если Не ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении") Тогда
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Массив.Добавить(Движения.ТоварыНаСкладах);
			Массив.Добавить(Движения.ТоварыВЯчейках);
			
			
			
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
	
	
КонецПроцедуры


Процедура 	СоздатьРедактироватьРаспоряжениеДляСкладскихОперацийУдалить(Распоряжение,ДанныеЗаполнения,РежимЗаписи,Отказ) 
	
	СоздатьРедактироватьПоступлениеОтПереработчика(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);
	СоздатьРедактироватьВозвратПоставщику(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);  
	СоздатьРедактироватьПередачуВРемонт(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);  
	СоздатьРедактироватьПродажа(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);  
	СоздатьРедактироватьСписание(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ); 
	
	
	
	
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			РаспоряжениеОбъект=Распоряжение.ПолучитьОбъект();
			РаспоряжениеОбъект.ПометкаУдаления=ДанныеЗаполнения.ПометкаУдаления;
			РаспоряжениеОбъект.Записать(РежимЗаписи); 			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 


Процедура СоздатьРедактироватьРаспоряжениеДляСкладскихОпераций(ДанныеЗаполнения,РежимЗаписи,Отказ) 
	
	Лико_СоздатьРедактироватьПрочееОприходование( ДанныеЗаполнения, РежимЗаписи,Отказ);

	СоздатьРедактироватьПоступление(ДанныеЗаполнения, РежимЗаписи,Отказ);  
	
	
	
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗначениеЗаполнено(Лико_ПоступлениеБух) Тогда
			РаспоряжениеОбъект=Лико_ПоступлениеБух.ПолучитьОбъект();
			Попытка  				
				РаспоряжениеОбъект.ПометкаУдаления=Истина; 		
				РаспоряжениеОбъект.Записать(РежимЗаписи);
			Исключение
				Отказ = Истина;
				Сообщить("Документ """ + Лико_ПоступлениеБух + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				
			КонецПопытки;
			
			Если Не Отказ Тогда
				
				//Запрос = Новый Запрос;
				////Запрос.Текст = "ВЫБРАТЬ Док.Ссылка КАК Ссылка ИЗ Документ.СчетНаОплатуКлиенту КАК Док ГДЕ Док.ДокументОснование = &Основание";
				////Запрос.УстановитьПараметр("Основание",Распоряжение);
				//РезультатЗапроса = Запрос.Выполнить();
				//Выборка = РезультатЗапроса.Выбрать();
				//Пока Выборка.Следующий() Цикл
				//	Попытка  				
				//		ДокОбъект=Выборка.Ссылка.ПолучитьОбъект();
				//		ДокОбъект.ПометкаУдаления=Истина; 		
				//		ДокОбъект.Записать(РежимЗаписи);
				//	Исключение
				//		//Отказ = Истина;
				//		Сообщить("Документ """ + ДокОбъект.Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());						
				//	КонецПопытки;
				//КонецЦикла; 
				
				
			КонецЕсли;
			
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры 




Функция СтруктураДанныхДляЗаполненияРаспоряженияУдалить(ВидОперации ) 
	Структура = Новый Структура; 	
	//Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Тогда 			
	Структура.Вставить("Распоряжение");
	Структура.Вставить("ВидОперации"); 	
	Структура.Вставить("Дата");
	Структура.Вставить("Контрагент");
	Структура.Вставить("Партнер");
	Структура.Вставить("Получатель");
	Структура.Вставить("Организация");
	Структура.Вставить("Подразделение");
	Структура.Вставить("Проведен",Ложь);
	Структура.Вставить("ПометкаУдаления",Ложь);
	Структура.Вставить("Валюта");
	Структура.Вставить("Товары");
	Структура.Вставить("Автор");
	Структура.Вставить("Комментарий"); 
	Структура.Вставить("Склад"); 		
	//КонецЕсли;
	
	
	Возврат Структура; 			
КонецФункции 




Функция СтруктураДанныхДляЗаполненияРаспоряжения() 
	Структура = Новый Структура; 	
	//Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Тогда 			
	//Структура.Вставить("Распоряжение");
	Структура.Вставить("ВидОперации"); 	
	Структура.Вставить("Дата");
	Структура.Вставить("Контрагент");
	Структура.Вставить("Партнер");   
	Структура.Вставить("Партнер");
	Структура.Вставить("Получатель");
	Структура.Вставить("Организация");
	Структура.Вставить("Подразделение");
	Структура.Вставить("Проведен",Ложь);
	Структура.Вставить("ПометкаУдаления",Ложь);
	Структура.Вставить("Валюта");
	Структура.Вставить("Товары");
	Структура.Вставить("Автор");
	Структура.Вставить("Комментарий"); 
	Структура.Вставить("Склад"); 		
	//КонецЕсли;
	
	
	Возврат Структура; 			
КонецФункции 


Процедура ЗаполнитьСклады(Отказ, РежимЗаписи) //+--->Лико m.shenderov 28.06.2024
	 
	 Если Отказ 
		 Или  РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		 
		 Возврат; 
		 
	 КонецЕсли;
	 
	 МассивАдресов = Новый Массив();  
	 МассивАдресов.Добавить(АдресХранения); 
	 
	 	 
	 Для каждого Товар Из  Товары Цикл
		 
		 Если МассивАдресов.Найти(Товар.АдресХранения)=Неопределено Тогда
			 МассивАдресов.Добавить(Товар.АдресХранения); 
		 КонецЕсли;
		 
		 Если ЗначениеЗаполнено(Товар.АдресХраненияНовый) 
			 И МассивАдресов.Найти(Товар.АдресХраненияНовый)=Неопределено Тогда
			 МассивАдресов.Добавить(Товар.АдресХраненияНовый); 
		 КонецЕсли; 	 
		 
	 КонецЦикла;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	СкладскиеЯчейки.Ссылка КАК Ссылка,
	 |	СкладскиеЯчейки.Владелец КАК Владелец,
	 |	СкладскиеЯчейки.Помещение КАК Помещение
	 |ИЗ
	 |	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	 |ГДЕ
	 |	СкладскиеЯчейки.Ссылка В(&МассивАдресов)";
	 Запрос.УстановитьПараметр("МассивАдресов",МассивАдресов );
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 СооАдресов = Новый Соответствие;
	 
	 Пока Выборка.Следующий() Цикл
		 
		 СооАдресов.Вставить(Выборка.Ссылка,Выборка.Владелец);
		 
	 КонецЦикла; 
	 
	 Для каждого Товар Из  Товары Цикл
		 
		 Товар.СкладОтправитель = Неопределено;
		 Товар.СкладПолучатель = Неопределено;
		 
		 Если ВидОперации= Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства 
			 ИЛИ ВидОперации= Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки Тогда
			 
			 
			 Товар.СкладОтправитель = СооАдресов[Товар.АдресХранения];
			 НовыйАдрес = ?(ЗначениеЗаполнено(Товар.АдресХраненияНовый),Товар.АдресХраненияНовый,АдресХранения);  
			 
			 Товар.СкладПолучатель = СооАдресов[НовыйАдрес];
		 КонецЕсли;
		 
	 КонецЦикла; 
	 
 КонецПроцедуры //-<---Лико m.shenderov 28.06.2024


#КонецОбласти


Функция ПоляТыблицыТоваров() 
	Возврат "Номенклатура,Характеристика,Серия,Упаковка,Количество,КоличествоУпаковок";	
КонецФункции 

Процедура ОбработатьРаспоряжениеУдалить (РежимЗаписи,Отказ) 
	////
	////СтруктураДанных=СтруктураДанныхДляЗаполненияРаспоряжения(ВидОперации);	
	////ЗаполнитьЗначенияСвойств(СТруктураДанных,ЭтотОбъект);
	//////СтруктураДанных.Контрагент=Отправитель;
	//////Если ТипЗнч(Отправитель)=Тип("СправочникСсылка.Контрагенты") Тогда
	//////	СтруктураДанных.Партнер=Отправитель.Партнер;
	//////КонецЕсли;
	////СтруктураДанных.Комментарий="Создан в проведении документа: "+ Ссылка; 
	////СоздатьРедактироватьРаспоряжениеДляСкладскихОпераций(Распоряжение,СтруктураДанных,РежимЗаписи,Отказ);
	////
	
	
КонецПроцедуры 

Процедура ОбработатьРаспоряжение (РежимЗаписи,Отказ) 
	УстановитьПривилегированныйРежим(Истина);	
	
	СтруктураДанных=СтруктураДанныхДляЗаполненияРаспоряжения();	
	ЗаполнитьЗначенияСвойств(СТруктураДанных,ЭтотОбъект);
	СтруктураДанных.Комментарий="Создан в проведении документа: "+ Ссылка; 
	СоздатьРедактироватьРаспоряжениеДляСкладскихОпераций(СтруктураДанных,РежимЗаписи,Отказ);
	
	УстановитьПривилегированныйРежим(ЛОжь);		
	
КонецПроцедуры 


Процедура СоздатьРедактироватьПоступлениеОтПереработчика(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	Возврат;
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение  Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ПоступлениеОтПереработчика.СоздатьДокумент();	
				НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ПоступлениеОтПереработчика.СоздатьДокумент();	
			НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		Тз=Товары.Выгрузить(,ПоляТыблицыТоваров());
		Тз.Свернуть("Номенклатура,Характеристика,Упаковка","Количество,КоличествоУпаковок");
		Тз.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		Для каждого СтТз Из Тз Цикл
			СтТз.Склад=Склад;
		КонецЦикла;
		НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчика;
		НовоеРаспоряжение.Товары.Загрузить(Тз); 			
		Попытка 				
			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
		Исключение
			НовоеРаспоряжение.Записать();
		КонецПопытки;
		
		Распоряжение=НовоеРаспоряжение.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры 

Процедура СоздатьРедактироватьВозвратПоставщику(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ВозвратТоваровПоставщику.СоздатьДокумент();	
				НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ВозвратТоваровПоставщику.СоздатьДокумент();	
			НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТыблицыТоваров())); 			
		Попытка 				
			НовоеРаспоряжение.Записать(); 				
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		
		Распоряжение=НовоеРаспоряжение.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры 

Процедура СоздатьРедактироватьПередачуВРемонт(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
				НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
			НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТыблицыТоваров())); 			
		Попытка 				
			НовоеРаспоряжение.Записать(РежимЗаписи); 				
		Исключение
			НовоеРаспоряжение.Записать();
		КонецПопытки;
		
		Распоряжение=НовоеРаспоряжение.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры 

Процедура СоздатьРедактироватьПродажа(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
				НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
			НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТыблицыТоваров())); 			
		Попытка 				
			НовоеРаспоряжение.Записать(); 				
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		Распоряжение=НовоеРаспоряжение.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры 

Процедура СоздатьРедактироватьСписание(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
				НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
			НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТыблицыТоваров())); 			
		НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		Для каждого Товар Из НовоеРаспоряжение.Товары  Цикл
			Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяСписанияМатериалов.ЗначениеПараметра;
			
		КонецЦикла;
		Попытка 				
			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
		Исключение
			НовоеРаспоряжение.Записать();
		КонецПопытки;
		Если  Распоряжение<>НовоеРаспоряжение.Ссылка Тогда
			//Распоряжение=НовоеРаспоряжение.Ссылка;
			//Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры 

Процедура СозатьНаборЗаписейИсторяФорм(Отказ) //+Лико m.shenderov 21.10.2017
	Если  Отказ Тогда 	
		Возврат;
	КонецЕсли;
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм
		Или ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм Тогда
		Движения.Лико_ИсторияДвиженийФорм.Записывать = Истина;
		
		Для Каждого ТекСтрокаФормы Из Формы Цикл
			Движение                  = Движения.Лико_ИсторияДвиженийФорм.Добавить();  			
			Движение.Период           = Дата;
			Движение.Организация      = Организация;
			Движение.Форма            = ТекСтрокаФормы.Форма;			
			Движение.Расположение     = ТекСтрокаФормы.Конверт;
			Движение.ЗаказПокупателя  = ?( ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм,ТекСтрокаФормы.Форма.Заказ,Null);
			Движение.Ответственный    = АвторДокумента;
		КонецЦикла;
		
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 21.10.2017


Процедура СозатьНаборЗаписейПоНаработке(Отказ) //+Лико m.shenderov 21.10.2017
	Если  Отказ Тогда 	
		Возврат;
	КонецЕсли;
	Если ДанныеПоНаработке Тогда
		Движения.Лико_НаработкиОбъектовНоменклатуры.Записывать = Истина;
		
		// <-- Начало Лико Яцун С. В. 30.07.2024
		Движения.Лико_НаработкиГлубокихФорм.Записывать = Истина;
		// <-- Конец Лико Яцун С. В. 30.07.2024
		
		Для каждого Товар Из Товары  Цикл
			
			лДанныеПоНаработке = Лико_Дополнительно.ПолучитьДанныеПоНаработке(Товар.Серия.ЯССМ_ОбъектНоменклатуры, Дата-1);
			
			Движение 							= Движения.Лико_НаработкиОбъектовНоменклатуры.Добавить();
			Движение.Период 					= Дата;
			Движение.ОбъектНоменклатуры 		= Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			Движение.НаработкаТекущейОперации 	= Товар.НаработкаТекущейОперации;
			Движение.ОбщаяНаработка 			= Товар.НаработкаТекущейОперации + лДанныеПоНаработке.ОбщаяНаработка;
			Движение.РабочийЦентр 				= Отправитель;
			Движение.Примечание 				= Товар.ПримечаниеПоНаработке;
			Движение.НомерСекции 				= Товар.НомерСекции; 
			
			// <-- Начало Лико Яцун С. В. 30.07.2024
			//Наработка глубоких форм
			//Форма вала на дату прихода из производства
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ВалыФормыСрезПоследних.Период КАК Период,
			|	Лико_ВалыФормыСрезПоследних.Форма КАК Форма
			|ИЗ
			|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(&МоментВремени, Вал = &Вал) КАК Лико_ВалыФормыСрезПоследних
			|ГДЕ
			|	Лико_ВалыФормыСрезПоследних.Вал = &Вал";
			
			Запрос.УстановитьПараметр("Вал", Товар.Номенклатура); 
			Запрос.УстановитьПараметр("МоментВремени", Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДатаПриходаФормы = ВыборкаДетальныеЗаписи.Период;
				ТекущаяФормаВала = ВыборкаДетальныеЗаписи.Форма;
			КонецЦикла;
			//Общая наработка Формы
			ЗапросДанныеПоНаработке = Новый Запрос;
			ЗапросДанныеПоНаработке.Текст = 
			"ВЫБРАТЬ
			|	Лико_НаработкиГлубокихФормСрезПоследних.ОбщаяНаработка КАК ОбщаяНаработка
			|ИЗ
			|	РегистрСведений.Лико_НаработкиГлубокихФорм.СрезПоследних(
			|			&МоментВремени,
			|			Вал = &Вал
			|				И Форма = &Форма
			|				И НАЧАЛОПЕРИОДА(ДатаПрихода, ДЕНЬ) = &ДатаПриходаФормы) КАК Лико_НаработкиГлубокихФормСрезПоследних";
			
			ЗапросДанныеПоНаработке.УстановитьПараметр("Вал", Товар.Номенклатура);
			ЗапросДанныеПоНаработке.УстановитьПараметр("Форма", ТекущаяФормаВала);
			ЗапросДанныеПоНаработке.УстановитьПараметр("ДатаПриходаФормы", НачалоДня(ДатаПриходаФормы));
			ЗапросДанныеПоНаработке.УстановитьПараметр("МоментВремени", Дата - 1);
			
			РезультатЗапросаДанныеПоНаработке = ЗапросДанныеПоНаработке.Выполнить(); 
			
			Если Не РезультатЗапросаДанныеПоНаработке.Пустой() Тогда
				ВыборкаЗапросаДанныеПоНаработке = РезультатЗапросаДанныеПоНаработке.Выбрать();
				ВыборкаЗапросаДанныеПоНаработке.Следующий();
				ДанныеПоНаработкеОбщаяНаработка = ВыборкаЗапросаДанныеПоНаработке.ОбщаяНаработка;
			Иначе
				ДанныеПоНаработкеОбщаяНаработка = 0;
			КонецЕсли;
			//Запись наработки глубоких форм
			ДвижениеЛико_НаработкиГлубокихФорм 							= Движения.Лико_НаработкиГлубокихФорм.Добавить();
			ДвижениеЛико_НаработкиГлубокихФорм.Период 					= Дата;
			ДвижениеЛико_НаработкиГлубокихФорм.Вал 						= Товар.Номенклатура;
			ДвижениеЛико_НаработкиГлубокихФорм.Форма 					= ТекущаяФормаВала;
			ДвижениеЛико_НаработкиГлубокихФорм.ДатаПрихода 				= ДатаПриходаФормы;
			ДвижениеЛико_НаработкиГлубокихФорм.НаработкаТекущейОперации = Товар.НаработкаТекущейОперации;
			ДвижениеЛико_НаработкиГлубокихФорм.ОбщаяНаработка 			= Товар.НаработкаТекущейОперации + ДанныеПоНаработкеОбщаяНаработка;
			// <-- Конец Лико Яцун С. В. 30.07.2024
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 21.10.2017


Процедура СозатьЗаписьПоЗаявкамНаГравировкуВалов(Отказ, ОтправитьПисьмо) // <-- Начало Лико Яцун С. В. 11.03.2024
	
	Если  Отказ Тогда 	
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр Из Товары Цикл
		Если Стр.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оснастка") 
			И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,Стр.Номенклатура,"ОснасткаВид", Перечисления.Лико_ВидОснастки.ПустаяСсылка()) = Перечисления.Лико_ВидОснастки.Вал Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лико_ЗаявкиНаГравировкуВалов.Вал КАК Вал,
			|	Лико_ЗаявкиНаГравировкуВалов.Форма КАК Форма,
			|	Лико_ЗаявкиНаГравировкуВалов.Количество КАК Количество,
			|	Лико_ЗаявкиНаГравировкуВалов.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВТПоследняяЗаявка
			|ИЗ
			|	РегистрНакопления.Лико_ЗаявкиНаГравировкуВалов КАК Лико_ЗаявкиНаГравировкуВалов
			|ГДЕ
			|	Лико_ЗаявкиНаГравировкуВалов.Вал = &Вал
			|	И Лико_ЗаявкиНаГравировкуВалов.ВидДвижения = &ВидДвижения
			|
			|УПОРЯДОЧИТЬ ПО
			|	Лико_ЗаявкиНаГравировкуВалов.Период УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Лико_ЗаявкиНаГравировкуВаловОстатки.Вал КАК Вал,
			|	Лико_ЗаявкиНаГравировкуВаловОстатки.Форма КАК Форма,
			|	Лико_ЗаявкиНаГравировкуВаловОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ВТПоследняяЗаявка.Регистратор КАК Регистратор,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТПоследняяЗаявка.Регистратор КАК Документ.Лико_ЗаявкаНаГравировкуВалов).ЗаказКлиента, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ
			|ИЗ
			|	РегистрНакопления.Лико_ЗаявкиНаГравировкуВалов.Остатки(, Вал = &Вал) КАК Лико_ЗаявкиНаГравировкуВаловОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследняяЗаявка КАК ВТПоследняяЗаявка
			|		ПО Лико_ЗаявкиНаГравировкуВаловОстатки.Вал = ВТПоследняяЗаявка.Вал
			|			И Лико_ЗаявкиНаГравировкуВаловОстатки.Форма = ВТПоследняяЗаявка.Форма";
			
			Запрос.УстановитьПараметр("Вал", Стр.Номенклатура);
			Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);

			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			//Проверка есть ли уже запись Вала с этим регистратором и отправка письма, если нет записи и нет открытой заявки на действия в валом
			ЗапросПроверка = Новый Запрос;
			ЗапросПроверка.Текст = 
			"ВЫБРАТЬ
			|	Лико_ЗаявкиНаГравировкуВалов.Вал КАК Вал
			|ИЗ
			|	РегистрНакопления.Лико_ЗаявкиНаГравировкуВалов КАК Лико_ЗаявкиНаГравировкуВалов
			|ГДЕ
			|	Лико_ЗаявкиНаГравировкуВалов.Регистратор = &Регистратор
			|	И Лико_ЗаявкиНаГравировкуВалов.ВидДвижения = &ВидДвижения
			|	И Лико_ЗаявкиНаГравировкуВалов.Вал = &Вал";
			
			ЗапросПроверка.УстановитьПараметр("Вал", Стр.Номенклатура);
			ЗапросПроверка.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
			ЗапросПроверка.УстановитьПараметр("Регистратор", Ссылка);
			
			РезультатЗапросаПроверка = ЗапросПроверка.Выполнить();
			
			ВыборкаДетальныеЗаписиПроверка = РезультатЗапросаПроверка.Выбрать();
			ЗаявкаНаДействияСВаломПоЭтомуДокументуИсполнена = Ложь;
			Пока ВыборкаДетальныеЗаписиПроверка.Следующий() Цикл
				ЗаявкаНаДействияСВаломПоЭтомуДокументуИсполнена = Истина;
			КонецЦикла;
						
			Если ВыборкаДетальныеЗаписи.Количество() = 0 И НЕ ЗаявкаНаДействияСВаломПоЭтомуДокументуИсполнена Тогда
				ТекстПисьма = "Приход из переработки №" + Номер + ", вал " + Стр.Номенклатура.Артикул + " - нет заявки на действия в валом, не возможно установить связь с глубокой формой.";
				Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
					Адресат = "VRomsa@okil-sato.ru;aivanova@okil-sato.ru;OlegPak@okil.ru";
				ИначеЕсли Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
					Адресат = "vplaksin@okil-sato.ru;aivanova@okil-sato.ru;OlegPak@okil.ru";
				Иначе
					Адресат = "";
				КонецЕсли;
				Если ЗначениеЗаполнено(Адресат) И ОтправитьПисьмо Тогда
					Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, ТекстПисьма, Адресат);
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Движения.Лико_ЗаявкиНаГравировкуВалов.Записывать = Истина;
				Движение = Движения.Лико_ЗаявкиНаГравировкуВалов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Вал = ВыборкаДетальныеЗаписи.Вал;
				Движение.Форма = ВыборкаДетальныеЗаписи.Форма;
				Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Регистратор.ВидОперации) ИЛИ ВыборкаДетальныеЗаписи.Регистратор.ВидОперации = Перечисления.Лико_ВидыОперацийЗаявокНаГравировку.Гравировка Тогда
					//Запись для связи Вала с Формой
					НаборЗаписей = РегистрыСведений.Лико_ВалыФормы.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
					НаборЗаписей.Прочитать();
					ОбновитьСуществующуюЗапись = Ложь;
					Для Каждого Запись Из НаборЗаписей Цикл
						Если Запись.Вал = ВыборкаДетальныеЗаписи.Вал Тогда
							ОбновитьСуществующуюЗапись = Истина;
							Запись.Форма = ВыборкаДетальныеЗаписи.Форма; 
						КонецЕсли;
					КонецЦикла;
					Если НЕ ОбновитьСуществующуюЗапись Тогда
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.Регистратор = Ссылка;
						НоваяЗапись.Период = Дата;
						НоваяЗапись.Вал = ВыборкаДетальныеЗаписи.Вал;
						НоваяЗапись.Форма = ВыборкаДетальныеЗаписи.Форма;
						НоваяЗапись.Заказ = ВыборкаДетальныеЗаписи.Заказ;
					КонецЕсли;
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 11.03.2024



Процедура ПроверитьНаличиеРаспоряжения(); 	
	Если Не ЗначениеЗаполнено(Распоряжение)Или Лев(Строка(Распоряжение),18)="<Объект не найден>" Тогда
		Если ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки Тогда		
			Распоряжение=Документы.ПоступлениеОтПереработчика.ПолучитьСсылку();
			
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда		
			Распоряжение=Документы.ВозвратТоваровПоставщику.ПолучитьСсылку();
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт Тогда		
			Распоряжение=Документы.ПередачаСырьяПереработчику.ПолучитьСсылку();
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа Тогда		
			Распоряжение=Документы.РеализацияТоваровУслуг.ПолучитьСсылку();
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда		
			Распоряжение=Документы.ВнутреннееПотребление.ПолучитьСсылку();
			Док= Документы.ВнутреннееПотребление.СоздатьДокумент();
			Док.Дата=Дата-1;
			Док.Записать();
			Распоряжение=Док.ссылка; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НетРаспоряжения() //+Лико m.shenderov 09.01.2018
	
	
КонецПроцедуры //-Лико m.shenderov 09.01.2018




Процедура УстановитьПризнакАктаРазборкиУНоменклатуры() //+Лико m.shenderov 09.01.2018
	Для каждого Товар Из Товары Цикл
		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный и Не Товар.Серия.ЯССМ_ОбъектНоменклатуры.ПоАктуРазборки Тогда
			ОбъектНоменклатурыОбъект=Товар.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект(); 		
			ОбъектНоменклатурыОбъект.ПоАктуРазборки=Истина;
			ОбъектНоменклатурыОбъект.Записать();
		КонецЕсли;
		
		
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 09.01.2018

#Область ДокументыПоступления


   

Процедура СоздатьРедактироватьПоступление(ДанныеЗаполнения, РежимЗаписи, Отказ)
	Если Не (ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки )  Тогда
		Возврат;
	КонецЕсли;
	ЕСли Не ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Лико_ПоступлениеБух) Тогда
		
		НовоеПоступление=Лико_ПоступлениеБух.ПолучитьОбъект();
		Если НовоеПоступление=Неопределено Тогда
			НовоеПоступление=Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();	
			
		КонецЕсли;  				
	Иначе
		ИмяНакладной		="ПриобретениеУслугПрочихАктивов";
		ДокументСсылка		=Лико_ОбщегоНазначенияСервер.НайтиДокумент(ИмяНакладной,"Лико_Документ",Ссылка);		
		Если  ЗначениеЗаполнено(ДокументСсылка) Тогда
			НовоеПоступление=ДокументСсылка.ПолучитьОбъект();			
		Иначе			
			НовоеПоступление=Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();	
		КонецЕсли;
		
	КонецЕсли;  		
	ЗаполнитьЗначенияСвойств(НовоеПоступление,ДанныеЗаполнения);
	//***************************************************
	//******************************************************
	//ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();
	
	НовоеПоступление.Организация=Организация;
	
	
	НовоеПоступление.БанковскийСчетОрганизации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовоеПоступление.Организация);
	Если НЕ ЗначениеЗаполнено(НовоеПоступление.БанковскийСчетОрганизации) Тогда
		НовоеПоступление.БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовоеПоступление.Организация, ВалютаРуб);
	КонецЕсли;
	НовоеПоступление.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Контрагент, ВалютаРуб);
	НовоеПоступление.Валюта =Лико_Валюта;
	НакладнаяНаЭкспорт = Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
	
	НовоеПоступление.ЦенаВключаетНДС = Лико_ЦенаВключаетНДС;

	Если БезНДС Тогда 
			НовоеПоступление.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			НовоеПоступление.ЗакупкаПодДеятельность=Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
            	НовоеПоступление.ЦенаВключаетНДС = Ложь;

	Иначе
			НовоеПоступление.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			НовоеПоступление.ЗакупкаПодДеятельность=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;

	КонецЕсли;
	
	
	НовоеПоступление.ВалютаВзаиморасчетов = НовоеПоступление.Валюта;
	НовоеПоступление.Контрагент = Контрагент;
	НовоеПоступление.Партнер = Партнер;
	
	
	НовоеПоступление.Соглашение = НайтиСоглашениеСПоставщиком();
	НовоеПоступление.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	
	
	Отбор = Новый Структура("Валюта", Лико_Валюта);
	//НовоеПоступление.Курс = 1;
	//НовоеПоступление.Кратность = 1;
	НовоеПоступление.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;  		
	НовоеПоступление.НомерВходящегоДокумента=НомерВходящегоДокумента;
	НовоеПоступление.ДатаВходящегоДокумента=ДатаВходящегоДокумента;
	НовоеПоступление.Комментарий = "" + НовоеПоступление.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
	
	
	ФизЛицо = АвторДокумента;
	НовоеПоступление.Менеджер = АвторДокумента;
	НовоеПоступление.Руководитель = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовоеПоступление.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, АвторДокумента, НовоеПоступление.Дата); 
	//НовоеПоступление.ЗакупкаПодДеятельность=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	УсловияЗакупок = ЗакупкиСервер.ПолучитьУсловияЗакупок(НовоеПоступление.Соглашение, Истина, Истина);
	НовоеПоступление.ЗаполнитьУсловияЗакупок(УсловияЗакупок);
	
	Если НовоеПоступление.ВалютаВзаиморасчетов = ВалютаРуб Тогда
		// резидент
		Если НовоеПоступление.Валюта = ВалютаРуб Тогда
			//НовоеПоступление.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
		Иначе
			//НовоеПоступление.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях;
		КонецЕсли;
	Иначе
		// не резидент
		Если НовоеПоступление.Валюта = ВалютаРуб Тогда
			// не резидент, ставка НДС = 0
			//НовоеПоступление.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте;
			НовоеПоступление.ГруппаФинансовогоУчета=Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию("Поставщики (руб)");
		Иначе
			// резидент
			//НовоеПоступление.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях;
			НовоеПоступление.ГруппаФинансовогоУчета=Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию("Поставщики (у.е.)");
			
		КонецЕсли;
	КонецЕсли;
	
	Если НовоеПоступление.Валюта = ВалютаРуб Тогда
		// не резидент, ставка НДС = 0
		НовоеПоступление.ГруппаФинансовогоУчета=Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию("Поставщики (руб)");
	Иначе
		// резидент
		
		НовоеПоступление.ГруппаФинансовогоУчета=Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию("Поставщики (у.е.)");
		
	КонецЕсли;
	
	
	
	НовоеПоступление.Договор=ПодобратьДоговор(НовоеПоступление);
	
	//********************************
	//************************************
	Тз=ДанныеЗаполнения.Товары.Выгрузить(,ПоляТыблицыТоваров());
	Тз.Свернуть("Номенклатура","Количество");
	НовоеПоступление.Расходы.Очистить();	
	Для каждого Услуга Из Тз Цикл
		Товар=НовоеПоступление.Расходы.Добавить();
		Если Перегравировка Тогда
			Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяРасходовПерегравировки.ЗначениеПараметра;
			ТОвар.АналитикаРасходов=Услуга.Номенклатура;
		Иначе
			Товар.СтатьяРасходов=Услуга.Номенклатура.Лико_СтатьяРасходов;
			РЦ=УправлениеСвойствами.ЗначениеСвойства(Услуга.Номенклатура,"РабочийЦентр");
			Если ЗначениеЗаполнено(РЦ) и ТипЗнч(РЦ)=Тип("СправочникСсылка.РабочиеЦентры") Тогда
				
				ТОвар.АналитикаРасходов=РЦ.ВидРабочегоЦентра;
			Иначе
				ТОвар.АналитикаРасходов=РЦ;
			КонецЕсли;
		КонецЕсли;
		
		Товар.Подразделение=НовоеПоступление.Подразделение;
		
		
		НоменклатураЦена=ЛИко_ЦеныНоменклатуры.Найти(Услуга.Номенклатура,"Номенклатура");
		Товар.Содержание=НоменклатураЦена.Услуга;
		
		Товар.Цена =НоменклатураЦена.Цена_0;
		Товар.Количество=Услуга.Количество;
		
		
		
		// резидент
		Если БезНДС Тогда
				СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);

		Иначе
			     
		Товар.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);

		ЕСли НовоеПоступление.Дата>=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
			
				Если Год(НовоеПоступление.Дата)>=2026 Тогда
				
				Товар.СтавкаНДС   =   УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);
				Если Лико_ЦенаВключаетНДС Тогда
					Товар.Цена=Товар.Цена/1.22;
				КонецЕсли;    
				
			Иначе	
				
				Товар.СтавкаНДС   =   УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
				Если Лико_ЦенаВключаетНДС Тогда
					Товар.Цена=Товар.Цена/1.2;
				КонецЕсли;
			КонецЕсли;

			
			//Товар.СтавкаНДС   =   УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);

			//Если Лико_ЦенаВключаетНДС Тогда
			//	Товар.Цена=Товар.Цена/1.2;
			//КонецЕсли;                  
		Иначе
			Товар.СтавкаНДС   =   УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
 
			Если Лико_ЦенаВключаетНДС Тогда
				Товар.Цена=Товар.Цена/1.18;
			КонецЕсли;
		КонецЕсли;
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовоеПоступление.ЦенаВключаетНДС, Товар.СтавкаНДС));
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	
	НовоеПоступление.Договор=ПодобратьДоговор(НовоеПоступление);
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		НовоеПоступление.Лико_Документ=ДополнительныеСвойства.НоваяСсылкаСсылка;
	Иначе
		НовоеПоступление.Лико_Документ=Ссылка; 
	КонецЕсли;
	
	
	Попытка 				
		НовоеПоступление.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовоеПоступление + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		
	КонецПопытки;
	
	ЕСли Не Отказ Тогда
		Лико_ПоступлениеБух=НовоеПоступление.Ссылка;
		Если ЗначениеЗаполнено(Лико_ВхДатаСФ) И	 ЗначениеЗаполнено(Лико_ВхНомерСчет) И Не БезНДС Тогда
			СоздатьДокументСчетФактураПолученный(,НовоеПоступление.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры



Процедура Лико_СоздатьРедактироватьПрочееОприходование( ДанныеЗаполнения, РежимЗаписи,Отказ) 
	
	Если Не (ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки и Перегравировка)  Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 	
	
	ИмяНакладной="ПрочееОприходованиеТоваров";
	ДокументСсылка=Лико_ОбщегоНазначенияСервер.НайтиДокумент(ИмяНакладной,"Лико_Документ",Ссылка);		
	
	Если  ЗначениеЗаполнено(ДокументСсылка) Тогда
		НовоеПоступление=ДокументСсылка.ПолучитьОбъект();			
	Иначе			
		НовоеПоступление=Документы.ПрочееОприходованиеТоваров.СоздатьДокумент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовоеПоступление,ДанныеЗаполнения);
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();
	
	НовоеПоступление.Организация=Организация; 
	НовоеПоступление.Валюта =ВалютаРуб;	
	НовоеПоступление.Склад = Склад;	
	НовоеПоступление.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОприходованиеЗаСчетРасходов;	
	НовоеПоступление.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
	НовоеПоступление.Комментарий = "" + НовоеПоступление.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
	
	
	НовоеПоступление.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	
	Тз=Товары.Выгрузить(,ПоляТыблицыТоваров());
	
	
	
	МассивСерий=Товары.Выгрузить().ВыгрузитьКолонку("Серия");
	ОстаткиСерийНаСкладе=Документы.Лико_ВозвратТоваров.ОстаткиСерийПоБух(Дата,Ссылка ,МассивСерий);
	
	Для каждого Серия Из ОстаткиСерийНаСкладе Цикл
		
		НайденныеСтроки=Тз.НайтиСтроки(Новый Структура("Серия",Серия));
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			
			Тз.Удалить(НайденнаяСтрока);
			
		КонецЦикла; 
		
	КонецЦикла;


	Тз.Свернуть("Номенклатура","Количество");
	
	Если Тз.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	НовоеПоступление.Товары.Очистить();	
	Для каждого Услуга Из Тз Цикл
		
		Товар=НовоеПоступление.Товары.Добавить();
		Товар.СтатьяРасходовДоходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяДоходовПерегравировки.ЗначениеПараметра;
		ТОвар.АналитикаРасходов=НовоеПоступление.Подразделение;
		Товар.Номенклатура=Услуга.Номенклатура;
		
		Товар.Цена =1;
		Товар.Количество=Услуга.Количество;
		Товар.КоличествоУпаковок=Услуга.Количество;
		Товар.Сумма=Товар.Цена*Товар.Количество;
		
	КонецЦикла;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		НовоеПоступление.Лико_Документ=ДополнительныеСвойства.НоваяСсылкаСсылка;
	Иначе
		НовоеПоступление.Лико_Документ=Ссылка; 
	КонецЕсли;
	
	
	Попытка 				
		НовоеПоступление.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовоеПоступление + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());		
	КонецПопытки;
	
	ЕСли Не Отказ Тогда
		Распоряжение=НовоеПоступление.Ссылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 


Функция ПоляТыблицыТоваровУдалить() 
	Возврат "Номенклатура,Характеристика,Серия,Упаковка,Количество,КоличествоУпаковок";	
КонецФункции 

Функция ПодобратьДоговор(Поступление)
	
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Лико_Договор) Тогда
		
		НовыйДоговор=Лико_Договор;
		Возврат НовыйДоговор.Ссылка;
		
	Иначе
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	КонецЕсли;
	
	
	
	НовыйДоговор.Наименование = "СЧ" + СокрЛП(Лико_ВхНомерСчет)+" от "+
	Формат(Лико_ВхДатаСчет,"ДФ=dd.MM.yy")+" "+
	?(ЗначениеЗаполнено(Лико_СуммаПоСчету),Формат(Лико_СуммаПоСчету,"ЧДЦ=2")+Строка(Лико_Валюта),"");
	
	НовыйДоговор.НаименованиеДляПечати = НовыйДоговор.Наименование;
	НовыйДоговор.Номер =СокрЛП(Лико_ВхНомерСчет);
	НовыйДоговор.Контрагент = Контрагент;
	НовыйДоговор.Дата = Лико_ВхДатаСчет;
	НовыйДоговор.Организация = Организация;
	НовыйДоговор.Партнер = Партнер;
	НовыйДоговор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
	НовыйДоговор.НалогообложениеНДС=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	НовыйДоговор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	//НовыйДоговор.ПорядокОплаты = Поступление.ПорядокОплаты;
	НовыйДоговор.Согласован = Истина;
	НовыйДоговор.ЗакупкаПодДеятельность=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	НовыйДоговор.НалогообложениеНДСОпределяетсяВДокументе=Ложь;
	
	
	ЕСли НовыйДоговор.Дата>=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда	
		//НовыйДоговор.СтавкаНДС   =  УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);	
		
		Если Год(НовыйДоговор.Дата)>=2026 Тогда
			НовыйДоговор.СтавкаНДС   =   УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);	
		Иначе
			НовыйДоговор.СтавкаНДС   =   УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);			                 
		КонецЕсли;		
	Иначе
		НовыйДоговор.СтавкаНДС   =   УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);			
	КонецЕсли;

		
	
	
	НовыйДоговор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	НовыйДоговор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком;
	НовыйДоговор.ВалютаВзаиморасчетов = Поступление.ВалютаВзаиморасчетов;
	//НовыйДоговор.ПорядокОплаты = Поступление.ПорядокОплаты;
	НовыйДоговор.ГруппаФинансовогоУчета = Поступление.ГруппаФинансовогоУчета;
	НовыйДоговор.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-000006");
	НовыйДоговор.СпособДоставки=Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;
	НовыйДоговор.ВариантОформленияЗакупок=Перечисления.ВариантыОформленияЗакупок.НеРазделять;
	НовыйДоговор.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	//НовыйДоговор.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных; 
	//Если Распоряжение.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
	//	// не резидент, ставка НДС = 0
	//	НовыйДоговор.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
	//Иначе
	//	// резидент
	//	Если Поступление.Товары.Количество() > 0 Тогда
	//		НовыйДоговор.СтавкаНДС = Поступление.Товары[0].СтавкаНДС;
	//	КонецЕсли;
	//КонецЕсли;
	
	Попытка
		НовыйДоговор.Записать();
		Лико_Договор=НовыйДоговор.Ссылка;
		Возврат НовыйДоговор.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции


Функция СоздатьДокументСчетФактураПолученный(УжеСозданныйДокумент = Неопределено, Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК Док
	|ГДЕ
	|	Док.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование",Основание);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		УжеСозданныйДокумент=Выборка.Ссылка;
	КонецЦикла; 
	
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", Основание);
	ДанныеЗаполнения.Вставить("Организация", Основание.Организация);
	ДанныеЗаполнения.Вставить("ДатаСоставления",  Лико_ВхДатаСФ);
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	Если НовыйДокОбъект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		НовыйДокОбъект.Валюта = Основание.Валюта;
	КонецЕсли;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//НовыйДокОбъект.Дата = Лико_ВхДатаСФ;
	//НовыйДокОбъект.Номер =Основание.Дата;
	
	НовыйДокОбъект.Дата =Основание.Дата;
	НовыйДокОбъект.Номер =Лико_ВхНомерСФ;
	НовыйДокОбъект.ДатаСоставления = Лико_ВхДатаСФ;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция ПолучитьДатуПлатежа(Соглашение) //+Лико m.shenderov 27.03.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты,
	|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Сдвиг КАК Сдвиг,
	|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару
	|ИЗ
	|	Справочник.СоглашенияСПоставщиками.ЭтапыГрафикаОплаты КАК СоглашенияСПоставщикамиЭтапыГрафикаОплаты
	|ГДЕ
	|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Соглашение );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Сдвиг;
		
	КонецЦикла; 
	Возврат 0;
	
КонецФункции //-Лико m.shenderov 27.03.2018 

Функция НайтиСоглашениеСПоставщиком241220() //+Лико m.shenderov 17.02.2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоглашенияСПоставщиками.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
	|ГДЕ
	|	СоглашенияСПоставщиками.Контрагент = &Контрагент
	|	И СоглашенияСПоставщиками.Валюта = &Валюта
	|	И НЕ СоглашенияСПоставщиками.ПометкаУдаления
	|	И СоглашенияСПоставщиками.Статус = &Статус";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Запрос.УстановитьПараметр("Валюта",Лико_Валюта );
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСоглашенийСПоставщиками.Действует);


	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	
	КонецЦикла; 
	
	
	
КонецФункции //-Лико m.shenderov 17.02.2019 


Функция НайтиСоглашениеСПоставщиком()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоглашенияСПоставщиками.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
	|ГДЕ
	|	СоглашенияСПоставщиками.Контрагент = &Контрагент
	|	И СоглашенияСПоставщиками.Валюта = &Валюта
	|	И СоглашенияСПоставщиками.Организация = &Организация  
	|	И НЕ СоглашенияСПоставщиками.ПометкаУдаления
	|	И СоглашенияСПоставщиками.Статус = &Статус";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("Валюта",Лико_Валюта );
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСоглашенийСПоставщиками.Действует);


	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;

	КонецЦикла; 



КонецФункции


Процедура ПриЗаписи(Отказ)
//+ ---> Лико2.5 m.shenderov 04.05.2022

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
//- <--- Лико2.5 m.shenderov 04.05.2022


	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
		 
	 УстановитьСтатусзаявки(Отказ);

	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства
		И Отправитель.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.ГравировальныйУчасток
		И ДополнительныеСвойства.РежимЗаписи=РежимЗаписиДокумента.Проведение 
		И Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра  
		////И  ДополнительныеСвойства.ЭтоНовый  
		Тогда
		НаписатьПисьмоПоступилНовыйШтампСГравировальногоУчастка();

	КонецЕсли;



	

КонецПроцедуры



Процедура УстановитьСтатусзаявки(Отказ,УдалениеДОкументаПоЗаявке=Ложь) //+Лико m.shenderov 05.11.2018
	Если Не Отказ Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаСклад) Тогда
			ДокументОбъект=ЗаявкаНаСклад.ПолучитьОбъект();
			Если  УдалениеДОкументаПоЗаявке Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("УдалениеДОкументаПоЗаявке",Истина);
			КонецЕсли;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры //-Лико m.shenderov 05.11.2018


Процедура НаписатьПисьмоПоступилНовыйШтампСГравировальногоУчастка() //+Лико m.shenderov 10.03.2021
УстановитьПривилегированныйРежим(Истина);  	
	
	ОтборНастройки				= Новый КомпоновщикНастроекКомпоновкиДанных;
	СхемаКомпоновкиДанных 		= Документы.Лико_ВозвратТоваров.ПолучитьМакет("НаписатьПисьмоПоступилНовыйШтампСГравировальногоУчастка");
	ИсточникНастроек 			= Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	ОтборНастройки.Инициализировать(ИсточникНастроек);
		

		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);

	//УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Организация", Ссылка);
	//УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство); 
	//УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"ВидыРабот",Массив);
	//УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"ПомещениеПроизводство",Получатель.ЛикоЯчейка.Помещение);
	//УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"Склад",Склад);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"Ссылка",Ссылка);




	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТД=Новый ТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТД);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ИмяТемпФайла = ПолучитьИмяВременногоФайла();
	Тд.Записать(ИмяТемпФайла,ТипФайлаТабличногоДокумента.HTML5);
	ТекстHТМЛ = Новый ТекстовыйДокумент;
	ТекстHТМЛ.Прочитать(ИмяТемпФайла);
	ТекстHТМЛ = ТекстHТМЛ.ПолучитьТекст(); 					
	Текст=" Поступил новый штамп с гравировального участка: " ;
	Текст = Текст + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка); //+ " от " + Формат(Дата, "ДФ='дд ММММ гггг'");
	//Текст = Текст + ". РЦ N: "+ Строка(Получатель.ПорядковыйНомер);
	Тема  = текст;  
	Текст=ТекстHТМЛ;
	ТипСообщения=Справочники.Лико_ТипыСообщений.ПоступлениеНовыхШтампов;
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Организация); 		
	Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат); 


		
КонецПроцедуры //-Лико m.shenderov 10.03.2021



Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры





#КонецОбласти

