#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает шаблон текста с сообщением о проблеме для вывода в форму закрытия месяца, зависит от важности проблемы.
//	
// Параметры:
//	Состояние - ПеречислениеСсылка.ВажностьПроблемыУчета - важность проблемы, влияющая на поясняющий текст.
//	
// Возвращаемое значение:
//	Строка - шаблон текста с сообщением о проблеме для вывода в форму закрытия месяца.
//
Функция ШаблонТекстаПроблемыОшибкаВыполненияКода(Состояние = Неопределено) Экспорт
	
	ТекстВЗависимостиОтСостояния = Новый Соответствие;
	ТекстВЗависимостиОтСостояния.Вставить(Перечисления.ВажностьПроблемыУчета.Предупреждение,
		НСтр("ru = 'При выполнении расчета периода %2 по организации ""%1"" обнаружены проблемы';
			|en = 'Some issues occurred when calculating the %2 period for the %1 company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ТекстПоУмолчанию = НСтр("ru = 'При выполнении расчета периода %2 по организации ""%1"" произошла исключительная ситуация';
							|en = 'An exception is thrown when calculating the %2 period for the ""%1"" company'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Текст = ТекстВЗависимостиОтСостояния.Получить(Состояние);
	Текст = ?(Текст = Неопределено, ТекстПоУмолчанию, Текст);
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли