
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не (Параметры.Свойство("Номенклатура") и Параметры.Свойство("Характеристика") и Параметры.Свойство("Склад")) Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура=Параметры.Номенклатура;
	Характеристика=Параметры.Характеристика;
	Склад=Параметры.Склад;
	Если Параметры.Свойство("ТолькоОстатки") Тогда
		ТолькоОСтатки=Параметры.ТолькоОстатки;
	КонецЕсли;
	
	
	
	СерииСписок.Параметры.УстановитьЗначениеПараметра("ТолькоОСтатки",ТолькоОСтатки);
	СерииСписок.Параметры.УстановитьЗначениеПараметра("Номенклатура",Номенклатура);
	СерииСписок.Параметры.УстановитьЗначениеПараметра("Характеристика",Характеристика);
	СерииСписок.Параметры.УстановитьЗначениеПараметра("Склад",Склад);    	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеНоменклатуры(Команда)
	
	
	ТекСерия=Элементы.СерииСписок.ВыделенныеСтроки;
	
	Если  ТекСерия=Неопределено Тогда
		Закрыть();
	КонецЕсли;

	Массив= Новый Массив;
	
	Для каждого Серия Из ТекСерия Цикл
		Структура=Новый Структура;
		Структура.Вставить("Серия",Элементы.СерииСписок.ДанныеСтроки(Серия).Серия);
		Структура.Вставить("Серия",Элементы.СерииСписок.ДанныеСтроки(Серия).Серия);
		Структура.Вставить("АдресХранения",Элементы.СерииСписок.ДанныеСтроки(Серия).АдресХранения);
		Структура.Вставить("Количество",Элементы.СерииСписок.ДанныеСтроки(Серия).Остаток);

		Массив.Добавить(Структура);		
	КонецЦикла;  	
		
	Закрыть(Массив);
	
КонецПроцедуры

&НаКлиенте
Процедура СерииСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ВыбратьЗначениеНоменклатуры(Истина);
	
КонецПроцедуры
