#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив; 
	Если Статус <> Перечисления.ТССтатусыЗаказов.Печать Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоЗаявлено");
	КонецЕсли;
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	Если Не  ЗначениеЗаполнено(Состояние) Тогда
		
		Состояние = Перечисления.Лико_СостоянияДокументаКартаПерерасхода.Создан;	
		
	КонецЕсли;
	
	
	ВыполнитьПрверки(РежимЗаписи, Отказ);
	
	ПроверитьНаличиеКартыСТакимиПараметрами(РежимЗаписи, Отказ);
	Организация = РабочийЦентр.Лико_Площадка.Организация; 
	
	Если НЕ Отказ И Заказ.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт И Состояние = Перечисления.Лико_СостоянияДокументаКартаПерерасхода.Подтвержден И Ссылка.Состояние <> Состояние Тогда
		Если Заказ.Площадка <> Справочники.Лико_Площадки.ИксПак Тогда
			Кому = "Uchet@okil-sato.ru";
			Тема = "Подтверждена карта расхода " + Номер + " к закрытому заказу " + Заказ.НомерБезПрефикса;
			ТекстПисьма = Тема + ". Подтвердил " + Проверил;
			Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, Тема, Кому);		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции 


Процедура ВыполнитьПрверки(РежимЗаписи, Отказ);

ПроверитьНаличиеКартыСТакимиПараметрами(РежимЗаписи, Отказ);
//ПроверитьПравоНаПодтверждение(РежимЗаписи, Отказ);

КонецПроцедуры


Процедура ПроверитьНаличиеКартыСТакимиПараметрами(РежимЗаписи, Отказ) ///+--->Лико m.shenderov 02.07.2025
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		 Возврат;
	КонецЕсли;
	
	
	КартаУжеЕсть = Документы.Лико_КартаПерерасхода.ЕстьКартаСТакимиПараметрами(ЭтотОбъект);
	
	Если КартаУжеЕсть <> Неопределено Тогда
		
		ТекстОшибки =  СтрШаблон("Карта перерасхода по заказу № %1, бланку № %2 , прокату № %3 в статусе: ""%4"" по оператору: ""%5"" уже была добавлена ( %6 от %7).",
		 Заказ.НомерБезПрефикса,
		 НомерБланка,
		 НомерПроката,
		 Статус,
		 Оператор,
		 КартаУжеЕсть.Номер,
		 КартаУжеЕсть.Дата);
		Сообщить(ТекстОшибки);
		
		Отказ = Истина;
		
	КонецЕсли;


КонецПроцедуры //ПроверитьНаличиеКартыСТакимиПараметрами -<---Лико m.shenderov 02.07.2025


Процедура ПроверитьПравоНаПодтверждение(РежимЗаписи, Отказ) //+--->Лико m.shenderov 02.07.2025
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Состояние = Перечисления.Лико_СостоянияДокументаКартаПерерасхода.Подтвержден
		
		И НЕ Документы.Лико_КартаПерерасхода.ЕстьПравоНаПодтверждение() Тогда
		Сообщить("Недостаточно прав для имзменения подтвержденной карты");
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры //-<---Лико m.shenderov 02.07.2025





#КонецОбласти
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли





