
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		Объект.Организация = ?(Объект.Ответственный.Лико_Площадки.Количество() > 0, Объект.Ответственный.Лико_Площадки[0].Организация, Неопределено);
		Объект.Площадка = ?(Объект.Ответственный.Лико_Площадки.Количество() > 0, Объект.Ответственный.Лико_Площадки[0].Площадка, Неопределено); 
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьЗаказПоНомеру(НомерЗаказа)
	Заказ = Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса", НомерЗаказа);
	Возврат Заказ;
КонецФункции

&НаСервере
Функция ПолучитьЗаказНаРаскройПоШтрихкоду(Штрихкод) // <-- Начало Лико Яцун С. В. 29.01.2024
	МассивТиповДокументов = Новый Массив();
	МассивТиповДокументов.Добавить(Документы.Лико_ЗаказНаРаскрой.ПустаяСсылка());
	ЗаказНаРаскрой = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод,МассивТиповДокументов)[0];
	Возврат ЗаказНаРаскрой;
КонецФункции // <-- Конец Лико Яцун С. В. 29.01.2024

&НаСервере
Функция ПолучитьНомерЗаказа(Заказ)
	Возврат Заказ.НомерБезПрефикса;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" Тогда  // И ВводДоступен() 
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	// <-- Начало Лико Яцун С. В. 29.01.2024 
	Если СтрДлина(ДанныеШтрихкода.Штрихкод) > 25 Тогда
		ЗаказНаРаскрой = ПолучитьЗаказНаРаскройПоШтрихкоду(ДанныеШтрихкода.Штрихкод);
		Если ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда 
			стр = Объект.ЗаказыРаскрой.Добавить();
			стр.ЗаказРаскрой = ЗаказНаРаскрой;
		КонецЕсли;
	Иначе
	// <-- Конец Лико Яцун С. В. 29.01.2024	
		НомерЗаказа =   Сред(ДанныеШтрихкода.Штрихкод, 13, 7);
		Заказ = ПолучитьЗаказПоНомеру(НомерЗаказа);
		Если ЗначениеЗаполнено(Заказ) Тогда 
			стр = Объект.Заказы.Добавить();
			стр.заказ = заказ;
			стр.номер = НомерЗаказа;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыНомерПриИзменении(Элемент)
	текстр = Элементы.Заказы.ТекущиеДанные;
	Если значениеЗаполнено(текстр.номер) Тогда
		текстр.заказ = ПолучитьЗаказПоНомеру(текстр.Номер);
	Иначе
		текстр.заказ = ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка")
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыЗаказПриИзменении(Элемент)
	текстр = Элементы.Заказы.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.Заказ) Тогда 
		текстр.номер = ПолучитьНомерЗаказа(текстр.Заказ);	
	Иначе
		текстр.номер = "";
	КонецЕсли;
КонецПроцедуры


#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда,Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



#КонецОбласти


