
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		// Заполнение шапки
		Если ДанныеЗаполнения.Свойство("ЗаказКлиента")Тогда
			ВидЗаказа = ДанныеЗаполнения.ЗаказКлиента.ВидЗаказа;
			Комментарий = ДанныеЗаполнения.ЗаказКлиента.Комментарий;
			Партнер = ДанныеЗаполнения.ЗаказКлиента.Партнер;
			Организация = ДанныеЗаполнения.ЗаказКлиента.Организация;
			Менеджер = ДанныеЗаполнения.ЗаказКлиента.Ответственный;
			Площадка = ДанныеЗаполнения.ЗаказКлиента.Площадка;
			ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента.Ссылка;
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.ЗаказКлиента.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			КонецЦикла;
		КонецЕсли;
	Иначе
	Менеджер = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
    Площадка = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", Менеджер)); 
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

