#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НаправлениеДеятельности);
	ДанныеВыбора.Добавить(Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции);
	ДанныеВыбора.Добавить(Перечисления.ВариантыОбособленияМатериаловВПроизводстве.ЗаказНаПроизводство);
	ДанныеВыбора.Добавить(Перечисления.ВариантыОбособленияМатериаловВПроизводстве.ЭтапПроизводства);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли