
&Вместо("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	УстановитьПривилегированныйРежим(Истина);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект,
	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ПересчетТоваров));

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			Дата = ПолучитьОперативнуюОтметкуВремени();
		КонецЕсли; 
		//+ ---> Лико2.5 m.shenderov 22.04.2022
		Если Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ 
			Или Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.Производство Тогда 
			
			Возврат;  
			
		КонецЕсли;
		//- <--- Лико2.5 m.shenderov 22.04.2022	

		ПрошлыйСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");

		Если (Не ЗначениеЗаполнено(ПрошлыйСтатус) 
			Или ПрошлыйСтатус = Перечисления.СтатусыПересчетовТоваров.Подготовлено)
			И (Статус = Перечисления.СтатусыПересчетовТоваров.ВнесениеРезультатов
			Или Статус = Перечисления.СтатусыПересчетовТоваров.Выполнено
			И СкладыСервер.ИспользоватьСтатусыПересчетовТоваров(Склад)) Тогда

			Если ЗначениеЗаполнено(Ссылка) Тогда 
				ТекстСообщения = НСтр("ru = 'Невозможно провести документ ""%Документ%"" в статусе ""%НовыйСтатус%"". Необходимо сначала провести документ в статусе ""%СтатусВРаботе%"".';
				|en = 'Cannot post %Документ% in status %НовыйСтатус%. To post it, change status to %СтатусВРаботе%.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Ссылка);
			Иначе
				ТекстСообщения = НСтр("ru = 'Невозможно провести документ в статусе ""%НовыйСтатус%"". Необходимо сначала провести документ в статусе ""%СтатусВРаботе%"".';
				|en = 'Cannot post the document in status %НовыйСтатус%. To post it, change status to %СтатусВРаботе%.'");
			КонецЕсли;

			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НовыйСтатус%", Статус);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусВРаботе%", Перечисления.СтатусыПересчетовТоваров.ВРаботе);

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);

			Если Отказ Тогда 
				Возврат;
			КонецЕсли;

		КонецЕсли;

		Если Статус = Перечисления.СтатусыПересчетовТоваров.Подготовлено
			И РежимЗаписи = РежимЗаписиДокумента.Проведение
			Или Статус = Перечисления.СтатусыПересчетовТоваров.ВРаботе
			Или Статус = Перечисления.СтатусыПересчетовТоваров.ВнесениеРезультатов Тогда

			Если СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение, Дата) Тогда
				ПроверитьЯчейкиПередБлокировкой(Отказ);
			Иначе
				ПроверитьДругиеПересчеты(Отказ);
			КонецЕсли;

		КонецЕсли;

		Если Не УчетныеДанныеЗаполнены
			И Не Отказ Тогда

			ЗаполнитьКоличествоПоУчету();

		КонецЕсли;

	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		УчетныеДанныеЗаполнены = Ложь;
	КонецЕсли;

	ПересчетТоваровЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	// --> noname	
	//	//// Вставить содержимое метода.
	//	//Если Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ ТОгда
	//
	//	//	Если ОбменДанными.Загрузка Тогда
	//	//		Возврат;
	//	//	КонецЕсли;
	//	//	
	//	//	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	//	//	
	//	//	УстановитьПривилегированныйРежим(Истина);
	//	//	
	//	//	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект,
	//	//	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ПересчетТоваров));
	//	//	
	//	//	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект,  РежимЗаписи, РежимПроведения);
	//	//	
	//	//	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	//	//	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	//	//	
	//	//	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	//		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
	//	//			Дата = ПолучитьОперативнуюОтметкуВремени();
	//	//		КонецЕсли;
	//	//	КонецЕсли;	
	//	//Иначе		
	//	//	ПродолжитьВызов(Отказ, РежимЗаписи, РежимПроведения);
	//	//КонецЕсли;
	// <-- noname	

КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура Лико_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ Проведен       
		//+ Лико m.shenderov 26.12.2018
		И  Склад.Лико_ТипСклада<>Перечисления.Лико_ТипСклада.СИМ  
		И Склад.Лико_ТипСклада<>Перечисления.Лико_ТипСклада.Производство 
		//- Лико m.shenderov 26.12.2018 		
		И (Статус = Перечисления.СтатусыПересчетовТоваров.ВнесениеРезультатов
		ИЛИ Статус = Перечисления.СтатусыПересчетовТоваров.Выполнено)
		И СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение, Дата) Тогда

		ТекстСообщения = НСтр("ru = 'Нельзя проводить документ сразу в статусе ""%ТекущийСтатус%"". Необходимо сначала провести документ в предыдущем статусе.';
		|en = 'Cannot post the document in status %ТекущийСтатус%. To post it, return to the preceding status.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТекущийСтатус%",Статус);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект, "Статус", "Объект", Отказ);

	КонецЕсли;

	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ИменаПолейССуффиксом.Вставить("Количество", "КоличествоФакт");
	ПараметрыПроверки.ИменаПолейССуффиксом.Вставить("КоличествоУпаковок", "КоличествоУпаковокФакт");
	ПараметрыПроверки.ПроверитьВозможностьОкругления = Ложь;
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);

	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если НЕ СкладыСервер.ИспользоватьСкладскиеПомещения(Склад,Дата) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Помещение");
	КонецЕсли;

	Если НЕ ИспользоватьОтдельнуюЯчейкуИзлишков Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЯчейкаКонсолидацииИзлишковТоваров");
	КонецЕсли;
	Если НЕ ИспользоватьОтдельнуюЯчейкуПорчи Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЯчейкаКонсолидацииИспорченныхТоваров");
	КонецЕсли;

	ИспользоватьАдресноеХранение = СкладыСервер.ИспользоватьАдресноеХранение(Склад, Помещение, Дата);
	//+ Лико m.shenderov 11.01.2019
	Если  Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ Или Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.Производство  Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Ячейка");
	КонецЕсли;
	//- Лико m.shenderov 11.01.2019

	Если Не ИспользоватьАдресноеХранение Тогда

		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Ячейка");

	ИначеЕсли Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда

		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");

		ТекстСообщения = НСтр("ru = 'В настройках программы не включено использование упаковок номенклатуры, 
		|поэтому нельзя оформить документ по складу с адресным хранением остатков. Обратитесь к администратору';
		|en = 'Packaging options are disabled in the application settings. To create a document that uses bin locations, you need to enable packaging options.
		|Please contact the administrator'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	Иначе
		НоменклатураСервер.ПроверитьЗаполнениеУпаковок(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ)
	КонецЕсли;

	Если ИспользоватьАдресноеХранение Тогда

		МассивНепроверяемыхРеквизитов.Добавить("Товары.Номенклатура");

	КонецЕсли;

	Если НЕ УчетныеДанныеЗаполнены Тогда

		КлючевыеРеквизиты = Новый Массив;
		КлючевыеРеквизиты.Добавить("Номенклатура");
		КлючевыеРеквизиты.Добавить("Характеристика");
		КлючевыеРеквизиты.Добавить("Назначение");
		КлючевыеРеквизиты.Добавить("Серия");
		КлючевыеРеквизиты.Добавить("Ячейка");
		КлючевыеРеквизиты.Добавить("Упаковка");

		ОбщегоНазначенияУТ.ПроверитьНаличиеДублейСтрокТЧ(ЭтотОбъект, "Товары", КлючевыеРеквизиты, Отказ)

	КонецЕсли;

	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(
	ЭтотОбъект,
	МассивНепроверяемыхРеквизитов,
	Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ПересчетТоваров),
	Отказ,
	МассивНепроверяемыхРеквизитов);

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	ПересчетТоваровЛокализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры
