
&Вместо("ЦеныИзБУ")
Функция Лико_ЦеныИзБУ(Организация, Склад, Дата)

	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстатки.Субконто2 КАК Склад,
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, , &ВидыСубконто, Субконто2 = &Склад) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.Организация = &Организация
	|	И НЕ ХозрасчетныйОстатки.Счет.Забалансовый";
	Запрос.УстановитьПараметр("Организация",Организация ); 
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Дата",Дата+1 );

	ВидыСубконто = Новый Массив();
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("ВидыСубконто",ВидыСубконто );


	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Результат.Получить(Выборка.Номенклатура)=Неопределено Тогда
			Результат.Вставить(Выборка.Номенклатура,Выборка.Цена);			
		КонецЕсли;


	КонецЦикла; 

	Возврат Результат; 
	
КонецФункции

&Вместо("ОстаткиТоваровПоБухУчету")
Функция Лико_ОстаткиТоваровПоБухУчету(Организация, Склад, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстатки.Субконто1.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ХозрасчетныйОстатки.Субконто1.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ХозрасчетныйОстатки.Субконто1.Код КАК ТоварКод,
	|	ХозрасчетныйОстатки.Субконто1.НаименованиеПолное КАК ТоварНаименование,
	|	"""" КАК ХарактеристикаНаименование,
	|	"""" КАК СерияНаименование,
	|	ХозрасчетныйОстатки.Субконто2 КАК Склад,
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоПоУчету,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоФактическое,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоФакт,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоУпаковок,
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоУпаковокФакт,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто1.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ &ХарактеристикаНоменклатуры
	|	КОНЕЦ КАК Характеристика,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаПоУчету,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаФактическая,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток / ХозрасчетныйОстатки.КоличествоОстаток
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, НЕ Счет В ИЕРАРХИИ (&СчетОС), , ) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.Субконто2 = &Склад
	|	И ХозрасчетныйОстатки.Организация = &Организация
	|	И ХозрасчетныйОстатки.КоличествоОстаток > 0
	//|	И ХозрасчетныйОстатки.Субконто1.ВидНоменклатуры <> &ВидНоменклатурыКлики
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварНаименование";
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Организация",Организация );
	//Запрос.УстановитьПараметр("ВидНоменклатурыКлики",
	//Справочники.Лико_ПредопределенныеЗначения.CLICKS_INDIGO.ЗначениеПараметра.ВидНоменклатуры);

	Запрос.УстановитьПараметр("Дата",Дата+1 );
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию("1000 (Нарезка)"));
	Запрос.УстановитьПараметр("СчетОС",ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовОсновныхСредств);

	Возврат  Запрос.Выполнить().Выбрать();


КонецФункции
