
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
		Объект.ВидНоменклатуры=Объект.Родитель.ВидНоменклатуры;
	КонецЕсли;
	ИнициализироватьКомпоновкуДанных(Ложь,Параметры.ЗначениеКопирования);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Если ТекущийОбъект.СложнаяНастройка Тогда
		ТекущийОбъект.Описание=Строка(ОтборПоусловию.Настройки.Отбор);
		ТекущийОбъект.ОтборНастройки = Новый ХранилищеЗначения(ОтборПоусловию.Настройки, Новый СжатиеДанных(9));
	Иначе
		ТекущийОбъект.ОтборНастройки = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	Объект.ТекстСообщения = ТекстСообщения();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Объект.ТекстСообщения = ТекстСообщения();

КонецПроцедуры



&НаКлиенте
Процедура СложнаяНастройкаПриИзменении(Элемент)
	УстановитьВидимость();

КонецПроцедуры





#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
Объект.ДополнительныеРеквизиты.Очистить();
Для каждого ДопРеквизит Из Объект.ВидНоменклатуры.НаборСвойств.ДополнительныеРеквизиты Цикл
	
	НовыйРеквизит= Объект.ДополнительныеРеквизиты.Добавить();
	НовыйРеквизит.Свойство=ДопРеквизит.Свойство;
	
КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию,ЗначениеКопирования=Неопределено)
	
	
		СхемаКомпоновкиДанных = Справочники.Лико_ПравилаПеремещенияТМЦ.ПолучитьМакет("ОтборПоУсловию");
		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПоусловию.Инициализировать(ИсточникНастроек);
		
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ТекНастройки = Параметры.ЗначениеКопирования.ОтборНастройки.Получить();
	Иначе
		ТекНастройки = Объект.Ссылка.ОтборНастройки.Получить();

	КонецЕсли;
	
	
	Если ТекНастройки = Неопределено Тогда
		
		ОтборПоусловию.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПоусловию.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПоусловию.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 29.12.2018
	Если Объект.СложнаяНастройка Тогда
		
		Элементы.Простая.Видимость=Ложь;
		Элементы.Сложная.Видимость=Истина;
		
	Иначе
		
		Элементы.Простая.Видимость=Истина;
		Элементы.Сложная.Видимость=Ложь;

	КонецЕсли;
	
	
	Если Объект.Стратегия=ПредопределенноеЗначение("Перечисление.Лико_СтратегииПеремещенияТМЦ.Заблокировать") Тогда 
		
		Элементы.Действие.Видимость = Ложь;
		Объект.Действие = Неопределено;
		
	Иначе
		
		Элементы.Действие.Видимость = Истина;
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 29.12.2018


&НаКлиенте
Функция ТекстСообщения()		
	
	Возврат Объект.Комментарий + " Ответственный:" +Объект.Ответственный+"."

КонецФункции  

&НаКлиенте
Процедура ПравилоПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СтратегияПриИзменении(Элемент)
	УстановитьВидимость();

КонецПроцедуры

#КонецОбласти


