
&НаКлиенте
Асинх Процедура Лико_СоздатьНоменклатуруПантонаВместо(Команда)
	Если Объект.Состав.Количество()>0 и НЕ ЗначениеЗаполнено(Объект.Состав[0].Номенклатура ) Тогда
		
		Ждать ПредупреждениеАсинх("Не указана номенклатура  смеси!");
		Возврат;
	КонецЕсли;
	
	
	Если ПроверкаЗаполненияПолей() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		НаименованиеПантона=ПолучитьНаименованиеПантона();
		
		Текст=СтрШаблон("Создать номенклатуру пантона :%1 ?",НаименованиеПантона);
		Ответ = Ждать ВопросАсинх(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		СоздатьНоменклатуруНаСервере();
	КонецЕсли; 	



КонецПроцедуры


&НаКлиенте
&Вместо("ПроверкаЗаполненияПолей")
Функция Лико_ПроверкаЗаполненияПолей()
	Результат=Истина;
	СообщитьПользователю(Объект.Состав,"Объект.Состав","Состав",Результат);
	СообщитьПользователю(Объект.ВидПечати,"Объект.ВидПечати","Вид Печати",Результат);
	СообщитьПользователю(Объект.ВидТМЦ,"Объект.ВидТМЦ","Вид ТМЦ",Результат);
	СообщитьПользователю(Объект.Наименование,"Объект.Наименование","Наименование",Результат);
	
	
	Если Объект.Площадка=
		Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ОрганизацияИксПак"),"ЗначениеПараметра") Тогда		
		СообщитьПользователю(Объект.ЦеноваяГруппа,"Объект.ЦеноваяГруппа","Ценовая группа",Результат);
		//СообщитьПользователю(Объект.ВидПечати,"Объект.Номенклатура","Номенклатура",Результат); 		
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции

&Вместо("СоздатьНоменклатуруНаСервере")
Процедура Лико_СоздатьНоменклатуруНаСервере()
	Объект.Номенклатура=
	Справочники.Лико_ФормулыПантонов.СодатьНоменклатуруСмеси(?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Ссылка,Новый Структура("Наименование",Объект.Наименование))
	,Объект.ВидТМЦ,
	Объект.ВидПечати,
	Новый Структура("БазоваяНоменклатура,ЦеноваяГруппа",Объект.Состав[0].Номенклатура,Объект.ЦеноваяГруппа));
	
	
КонецПроцедуры
