
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	Элементы.Код.Видимость = ПолныеПрава;
	Элементы.Guid.Видимость = ПолныеПрава;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.Наименование) И НЕ ЗначениеЗаполнено(Объект.Gtin) Тогда
			Объект.Gtin = Объект.Наименование;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура GtinПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьНаименование()
	Объект.Наименование = Лико_ДополнительноКлиентСервер.ПолучитьНаименованиеЧестногоЗнака(Объект);
КонецФункции

&НаКлиенте
Процедура ДатаЭмиссииПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры
