#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных; 
	
КонецФункции
 
Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект, ТаблицаСписанияНоменклатуры)  
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	СтруктураНоменклатуры = ПолучитьСтруктуруНоменклатуры(ДокументСсылка);

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	Лико_ПередачаТоваров.Дата КАК Период,
	|	Лико_ПередачаТоваров.Склад КАК Склад,
	|	Лико_ПередачаТоваров.Помещение КАК Помещение,
	|	Лико_ПередачаТоваров.ВидОперации КАК ВидОперации,
	|	Лико_ПередачаТоваров.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание)
	|			ТОГДА Лико_ПередачаТоваров.Подразделение
	|		ИНАЧЕ Лико_ПередачаТоваров.Партнер
	|	КОНЕЦ КАК Получатель,
	|	Лико_ПередачаТоваров.Организация КАК Организация,
	|	Лико_ПередачаТоваров.Подразделение КАК Подразделение,
	|	Лико_ПередачаТоваров.ЗаказВПереработку КАК РаспоряжениеДляПереработки 
	|ИЗ
	|	Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|ГДЕ
	|	Лико_ПередачаТоваров.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	Запрос.УстановитьПараметр("Склад",       				Реквизиты.Склад);
	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);
	Запрос.УстановитьПараметр("ВидОперации", 				Реквизиты.ВидОперации);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", 		Реквизиты.ЗаданиеНаПеревозку); 
	Запрос.УстановитьПараметр("Получатель", 				
	?(ДокументСсылка.ИнтерКампани,Справочники.Лико_ПредопределенныеЗначения.СкладИнтеркампани.ЗначениеПараметра,Реквизиты.Получатель));
	Запрос.УстановитьПараметр("Помещение",         			Реквизиты.Помещение);
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Подразделение",      		Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("ТаблицаТмцВЭксплуатации",    ПолучитьТаблицуТмцВЭксплуатации(ДокументСсылка));
	//Запрос.УстановитьПараметр("МомВрем", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("МомВрем"						,КонецДня(Реквизиты.Период));
	Запрос.УстановитьПараметр("ВидНоменклатурыОснастка"		,Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
	
	//Запрос.УстановитьПараметр("НоменклатураПодЗаказ"		,ПолучитьНоменклатуруПодЗаказ(ДокументСсылка));
	//Запрос.УстановитьПараметр("НоменклатураСписания"		,ПолучитьНоменклатуруСписания(ДокументСсылка));
	//Запрос.УстановитьПараметр("ТмцВЭксплуатации"            ,ПолучитьНоменклатуруПодПередачуВЭксплуатацию(ДокументСсылка.Товары.Выгрузить(),ДокументСсылка)); 
	
	Запрос.УстановитьПараметр("НоменклатураПодЗаказ"		,СтруктураНоменклатуры.ПодЗаказ);
	Запрос.УстановитьПараметр("НоменклатураСписания"		,СтруктураНоменклатуры.Списание);
	Запрос.УстановитьПараметр("ТмцВЭксплуатации"            ,СтруктураНоменклатуры.ПередачуВЭксплуатацию);

	ЯчейкаПолучательПроизводство  = ДокументСсылка.Получатель.ЛикоЯчейка;
	
	Обработки.ПеремещениеТоваровДоп.КорректировкаЯчейкиРабочегоЦентра(
	ДокументСсылка.Организация,
	ДокументСсылка.Дата, 
	ЯчейкаПолучательПроизводство);
	
	Запрос.УстановитьПараметр("ЯчейкаПолучательПроизводство"            ,ЯчейкаПолучательПроизводство);

	//Распределение краски через колористическую
	ЦеховаяКладоваяКраски = Реквизиты.Склад.Лико_Площадка.ЦеховаяКладовая;
	//ЦеховаяКладоваяКраски=УправлениеСвойствами.ЗначениеСвойства(ДокументСсылка.Организация,"Лико_Колористическая");
	Если  ДокументСсылка.БракМатериала Тогда
		ЦеховаяКладоваяКраски=Неопределено;
	КонецЕсли;
	
		СписаниеКраскиЧерезЦеховуюКладовую=ЗначениеЗаполнено(ЦеховаяКладоваяКраски)
	И  Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаСписаниеКраскиЧерезЦеховуюКладовую.ЗначениеПараметра<ДокументСсылка.Дата;
	
	РаспоряжениеНаКраску=Документы.ЗаказМатериаловВПроизводство.ПустаяСсылка();
	Если ДокументСсылка.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		Если СписаниеКраскиЧерезЦеховуюКладовую	Тогда
			РаспоряжениеНаКраску=Лико_ОбщегоНазначенияСервер.СоздатьПолучитьРаспоряжениеНаКраску(ДокументСсылка);			
		Иначе
			РаспоряжениеНаКраску=Документы.ЗаказМатериаловВПроизводство.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли;
	Запрос.УстановитьПараметр("СписаниеКраскиЧерезЦеховуюКладовую",СписаниеКраскиЧерезЦеховуюКладовую);
	Запрос.УстановитьПараметр("ЦеховаяКладоваяКраски",ЦеховаяКладоваяКраски);
	Запрос.УстановитьПараметр("СписаниеКраскиЧерезЦеховуюКладовую",СписаниеКраскиЧерезЦеховуюКладовую);
	Запрос.УстановитьПараметр("РаспоряжениеНаКраску",РаспоряжениеНаКраску);
	Запрос.УстановитьПараметр("ВидНоменклатурыКраска",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);
	Запрос.УстановитьПараметр("ТзСписанияНоменклатуры",ТаблицаСписанияНоменклатуры);
	Запрос.УстановитьПараметр("РазделУчетаТоваровНаСкладах",Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах);
	Запрос.УстановитьПараметр("ВалютаТоветственногоХранения",Константы.ВалютаРегламентированногоУчета.Получить());

КонецПроцедуры
 
Функция ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры)
	
	ИмяРегистра = "ТоварыВЯчейках";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтСписанияНоменклатуры", ТекстыЗапроса) Тогда
		ТекстЗапросаВтСписанияНоменклатуры(Запрос, ТекстыЗапроса,ТаблицаСписанияНоменклатуры);
	КонецЕсли;
	

	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВтСписанияНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВтСписанияНоменклатуры.Характеристика КАК Характеристика,
	|	ВтСписанияНоменклатуры.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА ВтСписанияНоменклатуры.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВтСписанияНоменклатуры.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК Упаковка,
	|	&ЯчейкаПолучательПроизводство КАК Ячейка,
	|	ВтСписанияНоменклатуры.КоличествоУпаковок КАК ВНаличии,
	|	0 КАК КОтбору,
	|	0 КАК КРазмещению,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ИЗ
	|	ВтСписанияНоменклатуры КАК ВтСписанияНоменклатуры
	|ГДЕ
	|	НЕ ВтСписанияНоменклатуры.СписатьСЯчейки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ПередачаТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ПередачаТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.АдресХранения,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаМол))
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ПередачаТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ПередачаТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.АдресХранения,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СответственногоХранения)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание))
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ПередачаТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ПередачаТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения))
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ПередачаТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ПередачаТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.Ссылка.ЯчекаПереработка,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ЗаказВПереработку = ЗНАЧЕНИЕ(Документ.ЗаказПереработчику.ПустаяСсылка)
	|	И Лико_ПередачаТоваровТовары.Ссылка.ЯчекаПереработка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ПередачаТоваровТовары.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|					ТОГДА Лико_ПередачаТоваровТовары.Упаковка
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.Ссылка.Сотрудник.Лико_Ячейка,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.передачаМОл)
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаЛико_ТоварыНаОтветственномХранении(Запрос, ТекстыЗапроса, Регистры, ТаблицаСписанияНоменклатуры)

	ИмяРегистра = "Лико_ТоварыНаОтветственномХранении";

	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;


	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_Организация
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_Организация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_ОрганизацияОтветственногоХранения
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_ОрганизацияОтветственногоХранения
	|	КОНЕЦ КАК ОрганизацияОтветственногоХранения,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_СкладОтветственногоХранения
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_СкладОтветственногоХранения
	|	КОНЕЦ КАК Склад,
	|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
	|	&ВалютаТоветственногоХранения КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < Лико_ПередачаТоваровТовары.Количество
	|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|	КОНЕЦ КАК Количество,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(СтоимостьТоваровСрезПоследних.СтоимостьРегл, 0) = 0
	|				ТОГДА 15 * ВЫБОР
	|						КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < Лико_ПередачаТоваровТовары.Количество
	|							ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток
	|						ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|					КОНЕЦ
	|			ИНАЧЕ СтоимостьТоваровСрезПоследних.СтоимостьРегл * ВЫБОР
	|					КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < Лико_ПередачаТоваровТовары.Количество
	|						ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток
	|					ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|				КОНЕЦ
	|		КОНЕЦ) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < Лико_ПередачаТоваровТовары.Количество
	|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	|	Лико_ПередачаТоваровТовары.АдресХранения.Лико_СкладОтветственногоХранения КАК СкладОтправитель
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров.СрезПоследних(&Период, ) КАК СтоимостьТоваровСрезПоследних
	|		ПО Лико_ПередачаТоваровТовары.Номенклатура = СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.Номенклатура
	|			И Лико_ПередачаТоваровТовары.Характеристика = СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.Характеристика
	|			И (СтоимостьТоваровСрезПоследних.Организация = &Организация)
	|			И (СтоимостьТоваровСрезПоследних.РазделУчета = &РазделУчетаТоваровНаСкладах)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|			И Лико_ПередачаТоваровТовары.Ссылка.Склад = ТоварыНаСкладахОстатки.Склад
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|				ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_ОрганизацияОтветственногоХранения <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_ОрганизацияОтветственногоХранения <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|				ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Помещение
	|			ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Помещение
	|		КОНЕЦ <> Лико_ПередачаТоваровТовары.АдресХранения.Помещение
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_Организация
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_Организация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_ОрганизацияОтветственногоХранения
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_ОрганизацияОтветственногоХранения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_СкладОтветственногоХранения
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_СкладОтветственногоХранения
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.Серия,
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	Лико_ПередачаТоваровТовары.Номенклатура.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < Лико_ПередачаТоваровТовары.Количество
	|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.АдресХранения.Лико_СкладОтветственногоХранения,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < Лико_ПередачаТоваровТовары.Количество
	|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_ТоварыНаОтветственномХраненииОстатки.Организация,
	|	Лико_ТоварыНаОтветственномХраненииОстатки.ОрганизацияОтветственногоХранения,
	|	Лико_ТоварыНаОтветственномХраненииОстатки.Склад,
	|	Лико_ПередачаТоваровТовары.Серия,
	|	Лико_ТоварыНаОтветственномХраненииОстатки.Валюта,
	|	ВЫБОР
	|		КОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток < Лико_ПередачаТоваровТовары.Количество
	|			ТОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток = ВЫБОР
	|				КОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток < Лико_ПередачаТоваровТовары.Количество
	|					ТОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток
	|				ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|			КОНЕЦ
	|			ТОГДА Лико_ТоварыНаОтветственномХраненииОстатки.СуммаОстаток
	|		ИНАЧЕ Лико_ТоварыНаОтветственномХраненииОстатки.СуммаОстаток * ВЫБОР
	|				КОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток < Лико_ПередачаТоваровТовары.Количество
	|					ТОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток
	|				ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|			КОНЕЦ / Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток < Лико_ПередачаТоваровТовары.Количество
	|			ТОГДА Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.Количество
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	Лико_ПередачаТоваровТовары.Номенклатура.ЕдиницаИзмерения,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ТоварыНаОтветственномХранении.Остатки(&Период, ) КАК Лико_ТоварыНаОтветственномХраненииОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = Лико_ТоварыНаОтветственномХраненииОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОрганизацияОтветственногоХранения <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|				ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Помещение
	|			ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Помещение
	|		КОНЕЦ <> Лико_ПередачаТоваровТовары.АдресХранения.Помещение
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение)
	|	И Лико_ТоварыНаОтветственномХраненииОстатки.КоличествоОстаток > 0";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры, ТаблицаСписанияНоменклатуры)

	ИмяРегистра = "ТоварыНаСкладах";

	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	Лико_ПередачаТоваровТовары.АдресХранения.Владелец КАК Склад,
	|	&Помещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК ВНаличии,
	|	0 КАК КОткрузке,
	|	ИСТИНА КАК КонтролироватьОстатки
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|				И Лико_ПередачаТоваровТовары.Ссылка.ОтражатьВБухгалтерскомУчете
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание))
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И НЕ Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОтветственноеХранение
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПродажа
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	Лико_ПередачаТоваровТовары.АдресХранения.Владелец,
	|	&Помещение,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	Лико_ПередачаТоваровТовары.АдресХранения.Владелец,
	|	&Помещение,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Период,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу)
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	Лико_ПередачаТоваровТовары.АдресХранения.Владелец,
	|	&Помещение,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа)
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПродажа
	|	И Лико_ПередачаТоваровТовары.Ссылка.БезПеремещения = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВтСписанияНоменклатуры.Номенклатура,
	|	ВтСписанияНоменклатуры.Характеристика,
	|	ВтСписанияНоменклатуры.Назначение,
	|	ВтСписанияНоменклатуры.Склад,
	|	&Помещение,
	|	ВтСписанияНоменклатуры.Серия,
	|	ВтСписанияНоменклатуры.КоличествоБУ,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	ВтСписанияНоменклатуры КАК ВтСписанияНоменклатуры
	|ГДЕ
	|	ВтСписанияНоменклатуры.КоличествоБУ > 0";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры, ТаблицаСписанияНоменклатуры)

	ИмяРегистра = "ТоварыКОтгрузке";

	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ВЫБОР
	|		КОГДА &СписаниеКраскиЧерезЦеховуюКладовую
	|				И Лико_ПередачаТоваровТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКраска
	|			ТОГДА &ЦеховаяКладоваяКраски
	|		ИНАЧЕ &Получатель
	|	КОНЕЦ КАК Получатель,
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.СтатусУказанияСерий В (10, 14)
	|			ТОГДА Лико_ПередачаТоваровТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК КОтгрузке,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	Лико_ПередачаТоваровТовары.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА НЕ Лико_ПередачаТоваровТовары.Номенклатура В (&ТмцВЭксплуатации)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.Распоряжение
	|		ИНАЧЕ Лико_ПередачаТоваровТовары.Ссылка.Распоряжение2
	|	КОНЕЦ КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|				И Лико_ПередачаТоваровТовары.Ссылка.ЗаказВПереработку <> ЗНАЧЕНИЕ(Документ.ЗаказПереработчику.Пустаяссылка)
	|			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.ЗаказВПереработку
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание)
	|					ТОГДА ВЫБОР
	|							КОГДА НЕ Лико_ПередачаТоваровТовары.Номенклатура В (&ТМЦВЭксплуатации)
	|								ТОГДА ВЫБОР
	|										КОГДА &СписаниеКраскиЧерезЦеховуюКладовую
	|												И Лико_ПередачаТоваровТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКраска
	|											ТОГДА &РаспоряжениеНаКраску
	|										ИНАЧЕ Лико_ПередачаТоваровТовары.Ссылка.Распоряжение
	|									КОНЕЦ
	|							ИНАЧЕ Лико_ПередачаТоваровТовары.Ссылка.Распоряжение2
	|						КОНЕЦ
	|				ИНАЧЕ Лико_ПередачаТоваровТовары.Ссылка.Распоряжение
	|			КОНЕЦ
	|	КОНЕЦ КАК ДокументОтгрузки
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|				И Лико_ПередачаТоваровТовары.Ссылка.ОтражатьВБухгалтерскомУчете
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание))
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И НЕ Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОтветственноеХранение
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПродажа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Период,
	|	&Склад,
	|	&ЗаданиеНаПеревозку,
	|	СписанияНоменклатуры.Получатель,
	|	СписанияНоменклатуры.Номенклатура,
	|	СписанияНоменклатуры.Характеристика,
	|	СписанияНоменклатуры.Серия,
	|	СписанияНоменклатуры.КоличествоБУ,
	|	0,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	СписанияНоменклатуры.Распоряжение,
	|	СписанияНоменклатуры.Распоряжение
	|ИЗ
	|	ВтСписанияНоменклатуры КАК СписанияНоменклатуры
	|ГДЕ
	|	СписанияНоменклатуры.КоличествоБУ > 0";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры, ТаблицаСписанияНоменклатуры)

	ИмяРегистра = "ДвиженияСерийТоваров";

	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК Количество,
	|	&Склад КАК Отправитель,
	|	&Помещение КАК ПомещениеОтправителя,
	|	&Получатель КАК Получатель,
	|	ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка) КАК ПомещениеПолучателя,
	|	&Ссылка КАК Документ,
	|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту) КАК СкладскаяОперация,
	|	ИСТИНА КАК ЭтоСкладскоеДвижение
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|				И Лико_ПередачаТоваровТовары.Ссылка.ОтражатьВБухгалтерскомУчете
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт)
	|			ИЛИ Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание))
	|	И Лико_ПередачаТоваровТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И НЕ Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОтветственноеХранение
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПродажа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	Лико_ПередачаТоваровТовары.Серия,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ,
	|	&Склад,
	|	&Помещение,
	|	&Получатель,
	|	ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка),
	|	&Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту),
	|	ИСТИНА
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку)
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПереработка
	|	И Лико_ПередачаТоваровТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И НЕ Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОтветственноеХранение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	Лико_ПередачаТоваровТовары.Серия,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ,
	|	&Склад,
	|	&Помещение,
	|	&Получатель,
	|	ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка),
	|	&Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту),
	|	ИСТИНА
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Период,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу)
	|	И Лико_ПередачаТоваровТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И НЕ Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОтветственноеХранение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	Лико_ПередачаТоваровТовары.Серия,
	|	ВЫБОР
	|		КОГДА Лико_ПередачаТоваровТовары.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА Лико_ПередачаТоваровТовары.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ,
	|	&Склад,
	|	&Помещение,
	|	&Получатель,
	|	ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка),
	|	&Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту),
	|	ИСТИНА
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Лико_ПередачаТоваровТовары.Серия КАК Серия
	|					ИЗ
	|						Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|					ГДЕ
	|						Лико_ПередачаТоваровТовары.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа)
	|	И Лико_ПередачаТоваровТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И НЕ Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОтветственноеХранение
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВнутренняяПродажа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	СписанияНоменклатуры.Номенклатура,
	|	СписанияНоменклатуры.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	СписанияНоменклатуры.Серия,
	|	СписанияНоменклатуры.КоличествоБУ,
	|	&Склад,
	|	&Помещение,
	|	&Получатель,
	|	ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка),
	|	&Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту),
	|	ИСТИНА
	|ИЗ
	|	ВтСписанияНоменклатуры КАК СписанияНоменклатуры
	|ГДЕ
	|	СписанияНоменклатуры.КоличествоБУ > 0";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса

КонецФункции

Функция ТекстЗапросаТаблицаТМЦВЭксплуатации(Запрос, ТекстыЗапроса, Регистры)
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТмцВЭксплуатации", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТМЦЭксплуатация(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	
	
	ИмяРегистра = "ТМЦВЭксплуатации";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.Партия КАК Партия,
	|	-Лико_ПередачаТоваровСписаниеИзЭксплуатации.Количество КАК Количество
	|ИЗ
	|	ВтТаблицаТмцВЭксплуатации КАК Лико_ПередачаТоваровСписаниеИзЭксплуатации" ;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
	
КонецФункции

Функция ТекстЗапросаВтТМЦЭксплуатация(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаТмцВЭксплуатации";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.Партия КАК Партия,
	|	Лико_ПередачаТоваровСписаниеИзЭксплуатации.Количество КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаТмцВЭксплуатации
	|ИЗ
	|	&ТаблицаТмцВЭксплуатации КАК Лико_ПередачаТоваровСписаниеИзЭксплуатации";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

//Начало изменений Иванова Анна 
Функция ТекстЗапросаТаблицаЛикоОснасткаПоЗаказу(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ОснасткаПоЗаказу";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ПередачаТоваровТовары.Ссылка КАК Ссылка,
	|	Лико_ПередачаТоваровТовары.Ссылка.Получатель КАК РабочийЦентр,
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	СУММА(Лико_ПередачаТоваровТовары.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.ВидРабот ЕСТЬ NULL
	|				ИЛИ Лико_ПараметрыШтампа.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Лико_ПередачаТоваровТовары.Номенклатура.Наименование ПОДОБНО ""%онтрматрица%""
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Конгрев)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ Лико_ПараметрыШтампа.ВидРабот
	|	КОНЕЦ КАК ВидРабот,
	|	&Период КАК Период,
	|	Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО Лико_ПередачаТоваровТовары.Номенклатура = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Номенклатура В (&НоменклатураПодЗаказ)
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПередачаТоваровТовары.Ссылка.ЗаказКлиента,
	|	Лико_ПередачаТоваровТовары.Ссылка,
	|	Лико_ПередачаТоваровТовары.Ссылка.Получатель,
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.ВидРабот ЕСТЬ NULL
	|				ИЛИ Лико_ПараметрыШтампа.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Лико_ПередачаТоваровТовары.Номенклатура.Наименование ПОДОБНО ""%онтрматрица%""
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Конгрев)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ Лико_ПараметрыШтампа.ВидРабот
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.Серия.ЯССМ_ОбъектНоменклатуры";
	
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//Конец изменений Иванова Анна 

Функция ТекстЗапросаТаблицаЛико_СписаниеНаЗаказ(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_СписаниеНаЗаказ";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Лико_ПередачаТоваровТовары.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.ВидРабот ЕСТЬ NULL
	|				ИЛИ Лико_ПараметрыШтампа.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Лико_ПередачаТоваровТовары.Номенклатура.Наименование ПОДОБНО ""%онтрматрица%""
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Конгрев)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ Лико_ПараметрыШтампа.ВидРабот
	|	КОНЕЦ КАК ВидРабот,
	|	СУММА(Лико_ПередачаТоваровТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО Лико_ПередачаТоваровТовары.Номенклатура = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.Номенклатура В (&НоменклатураПодЗаказ)
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПередачаТоваровТовары.Ссылка.ЗаказКлиента,
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.ВидРабот ЕСТЬ NULL
	|				ИЛИ Лико_ПараметрыШтампа.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Лико_ПередачаТоваровТовары.Номенклатура.Наименование ПОДОБНО ""%онтрматрица%""
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Конгрев)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ Лико_ПараметрыШтампа.ВидРабот
	|	КОНЕЦ,
	|	Лико_ПередачаТоваровТовары.Серия,
	|	Лико_ПередачаТоваровТовары.Характеристика";
	
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтСписанияНоменклатуры(Запрос, ТекстыЗапроса,ТаблицаСписанияНоменклатуры)
	ИмяРегистра = "ВтСписанияНоменклатуры";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВтСписанияНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВтСписанияНоменклатуры.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ВтСписанияНоменклатуры.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА ВтСписанияНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|			ТОГДА 0
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК СтатусУказанияСерий,
	|	ВтСписанияНоменклатуры.СписатьСЯчейки КАК СписатьСЯчейки,
	|	ВтСписанияНоменклатуры.Склад КАК Склад,
	|	ВтСписанияНоменклатуры.Получатель КАК Получатель,
	|	ВтСписанияНоменклатуры.Распоряжение КАК Распоряжение,
	|	ВтСписанияНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВтСписанияНоменклатуры.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВтСписанияНоменклатуры.КоличествоБУ < ВтСписанияНоменклатуры.Количество
	|			ТОГДА ВтСписанияНоменклатуры.КоличествоБУ
	|		ИНАЧЕ ВтСписанияНоменклатуры.Количество
	|	КОНЕЦ КАК КоличествоБУ,
	|	ВЫБОР
	|		КОГДА ВтСписанияНоменклатуры.Количество > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МожноСписать,
	|	ИСТИНА КАК ДопРасход
	|ПОМЕСТИТЬ ВтСписанияНоменклатуры
	|ИЗ
	|	&ТзСписанияНоменклатуры КАК ВтСписанияНоменклатуры";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
	
	
КонецФункции

Функция ТекстЗапросаТаблицаЛико_КонтрольВозвратовПоставщику(Запрос, ТекстыЗапроса, Регистры)
		ИмяРегистра = "Лико_КонтрольВозвратовПоставщику";
		
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	Лико_ПередачаТоваровТовары.Ссылка.Организация КАК Организация,
		|	Лико_ПередачаТоваровТовары.ДокументПоступления.Партнер КАК Поставщик,
		|	Лико_ПередачаТоваровТовары.ДокументПоступления КАК ДокументПоступления,
		|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
		|	Лико_ПередачаТоваровТовары.ХарактеристикаПоступления КАК Характеристика,
		|	Лико_ПередачаТоваровТовары.Количество КАК Количество
		|ИЗ
		|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
		|ГДЕ
		|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
		|	И Лико_ПередачаТоваровТовары.Ссылка.Склад.Лико_ДатаНачалаКонтроляВозвратов <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику)
		|	И Лико_ПередачаТоваровТовары.Ссылка.Склад.Лико_ДатаНачалаКонтроляВозвратов <= &Период";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции


#КонецОбласти

#Область Прочее
Функция ПолучитьТаблицуТмцВЭксплуатации(ДокументСсылка) 
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Очистить();   	
	Если ДокументСсылка.ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		Возврат ТЗ;
	КонецЕсли; 	
	Возврат ТЗ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТМЦВЭксплуатации.Организация КАК Организация,
	|	ТМЦВЭксплуатации.Подразделение КАК Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТМЦВЭксплуатации.Номенклатура КАК Номенклатура,
	|	ТМЦВЭксплуатации.Характеристика КАК Характеристика,
	|	ТМЦВЭксплуатации.Партия КАК Партия,
	|	СУММА(-ТМЦВЭксплуатации.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтДвижениеДокумента
	|ИЗ
	|	РегистрНакопления.ТМЦВЭксплуатации КАК ТМЦВЭксплуатации
	|ГДЕ
	|	ТМЦВЭксплуатации.Регистратор = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТМЦВЭксплуатации.Организация,
	|	ТМЦВЭксплуатации.Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо,
	|	ТМЦВЭксплуатации.Номенклатура,
	|	ТМЦВЭксплуатации.Характеристика,
	|	ТМЦВЭксплуатации.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	СУММА(Лико_ПередачаТоваровТовары.Количество) КАК Количество,
	|	Лико_ПередачаТоваровТовары.Ссылка.Организация КАК Организация,
	|	Лико_ПередачаТоваровТовары.Ссылка.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВтТМЦ
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И (Лико_ПередачаТоваровТовары.Номенклатура.ВидНоменклатуры.Лико_ТМЦ_ВЭксплуатации
	|			ИЛИ Лико_ПередачаТоваровТовары.Номенклатура.Лико_ТМЦ_ВЭксплуатации)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	Лико_ПередачаТоваровТовары.Ссылка.Организация,
	|	Лико_ПередачаТоваровТовары.Ссылка.Подразделение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Организация, ВтДвижениеДокумента.Организация) КАК Организация,
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Подразделение, ВтДвижениеДокумента.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.ФизическоеЛицо, ВтДвижениеДокумента.ФизическоеЛицо) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Номенклатура, ВтДвижениеДокумента.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Характеристика, ВтДвижениеДокумента.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Партия, ВтДвижениеДокумента.Партия) КАК Партия,
	|	СУММА(ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.КоличествоОборот, 0) + ЕСТЬNULL(ВтДвижениеДокумента.Количество, 0)) КАК КоличествоПартия
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	РегистрНакопления.ТМЦВЭксплуатации.Обороты(
	|			,
	|			&Дата,
	|			,
	|			(Организация, Подразделение, Номенклатура, Характеристика) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВтТМЦ.Организация КАК Организация,
	|					ВтТМЦ.Подразделение КАК Подразделение,
	|					ВтТМЦ.Номенклатура КАК Номенклатура,
	|					ВтТМЦ.Характеристика КАК Характеристика
	|				ИЗ
	|					ВтТМЦ КАК ВтТМЦ)) КАК ТМЦВЭксплуатацииОбороты
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВтДвижениеДокумента КАК ВтДвижениеДокумента
	|		ПО ТМЦВЭксплуатацииОбороты.Организация = ВтДвижениеДокумента.Организация
	|			И ТМЦВЭксплуатацииОбороты.Подразделение = ВтДвижениеДокумента.Подразделение
	|			И ТМЦВЭксплуатацииОбороты.ФизическоеЛицо = ВтДвижениеДокумента.ФизическоеЛицо
	|			И ТМЦВЭксплуатацииОбороты.Номенклатура = ВтДвижениеДокумента.Номенклатура
	|			И ТМЦВЭксплуатацииОбороты.Характеристика = ВтДвижениеДокумента.Характеристика
	|			И ТМЦВЭксплуатацииОбороты.Партия = ВтДвижениеДокумента.Партия
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Организация, ВтДвижениеДокумента.Организация),
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Подразделение, ВтДвижениеДокумента.Подразделение),
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.ФизическоеЛицо, ВтДвижениеДокумента.ФизическоеЛицо),
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Номенклатура, ВтДвижениеДокумента.Номенклатура),
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Характеристика, ВтДвижениеДокумента.Характеристика),
	|	ЕСТЬNULL(ТМЦВЭксплуатацииОбороты.Партия, ВтДвижениеДокумента.Партия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстатки.Организация КАК Организация,
	|	ВтОстатки.Подразделение КАК Подразделение,
	|	ВтОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВтОстатки.Номенклатура КАК Номенклатура,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Партия КАК Партия,
	|	ВтОстатки.КоличествоПартия КАК КоличествоПартия,
	|	МАКСИМУМ(ВтТМЦ.Количество) КАК Количество
	|ИЗ
	|	ВтОстатки КАК ВтОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТМЦ КАК ВтТМЦ
	|		ПО ВтОстатки.Организация = ВтТМЦ.Организация
	|			И ВтОстатки.Подразделение = ВтТМЦ.Подразделение
	|			И ВтОстатки.Номенклатура = ВтТМЦ.Номенклатура
	|			И ВтОстатки.Характеристика = ВтТМЦ.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОстатки.Организация,
	|	ВтОстатки.Подразделение,
	|	ВтОстатки.ФизическоеЛицо,
	|	ВтОстатки.Номенклатура,
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.Партия,
	|	ВтОстатки.КоличествоПартия
	|ИТОГИ
	|	МИНИМУМ(Количество)
	|ПО
	|	Номенклатура,
	|	Характеристика";
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка.Ссылка );
	Запрос.УстановитьПараметр("Дата",ДокументСсылка.Дата );
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаХарактеристика.Следующий() Цикл
			ОсталосьСписать=ВыборкаХарактеристика.Количество;
			Выборка=ВыборкаХарактеристика.Выбрать();
			Пока Выборка.Следующий() Цикл 
				Если ОсталосьСписать<=0 Тогда
					Прервать;
				КонецЕсли;				
				Тмц=ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(ТМц,Выборка,,"Количество");
				Списать=Мин(ОсталосьСписать,Выборка.КоличествоПартия);
				Тмц.Количество=Списать;
				ОсталосьСписать=ОсталосьСписать-Списать;
			КонецЦикла; 			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТЗ;
	
	
КонецФункции  


Функция ПолучитьСтруктуруНоменклатуры(ДокументСсылка)

	СтруктураНоменклатуры = Новый Структура;
	СтруктураНоменклатуры.Вставить("ПодЗаказ", Новый Массив());
	СтруктураНоменклатуры.Вставить("Списание", Новый Массив());
	СтруктураНоменклатуры.Вставить("ВнутреннееПотребление", Новый Массив());
	СтруктураНоменклатуры.Вставить("ПередачуВЭксплуатацию", Новый Массив());
	СтруктураНоменклатуры.Вставить("СтруктураПередачиВЭксплуатацию", Новый Массив()); 

	Для каждого Товар Из ДокументСсылка.Товары Цикл
		Правило=Товар.ПравилоСписания;

		Если ЗначениеЗаполнено(Правило) И Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПодЗаказ Тогда

			СтруктураНоменклатуры.ПодЗаказ.Добавить(Товар.Номенклатура);

		КонецЕсли; 

		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию Или Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию) Тогда

			СтруктураНоменклатуры.Списание.Добавить(Товар.Номенклатура);

		КонецЕсли; 

		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.СписаниеНаВнутреннееПотребление) Тогда

			СтруктураНоменклатуры.ВнутреннееПотребление.Добавить(Товар.Номенклатура); 

		КонецЕсли; 

		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию) Тогда

			СтруктураНоменклатуры.ПередачуВЭксплуатацию.Добавить(Товар.Номенклатура);

		КонецЕсли; 

		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию ) Тогда

			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",Товар.Номенклатура);
			Структура.Вставить("КатегорияЭксплуатации",Правило.КатегорияЭксплуатации);
			Структура.Вставить("Правило",Правило); 			
			СтруктураНоменклатуры.СтруктураПередачиВЭксплуатацию.Добавить(Структура);

		КонецЕсли; 

	КонецЦикла; 


	Возврат СтруктураНоменклатуры;

КонецФункции


Функция ПолучитьНоменклатуруПодЗаказ(ДокументСсылка) //+Лико m.shenderov 02.12.2018
	Массив = Новый Массив(); 	
	Для каждого Товар Из ДокументСсылка.Товары Цикл
		Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура,ДокументСсылка);
		Если ЗначениеЗаполнено(Правило) И Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПодЗаказ Тогда
			Массив.Добавить(Товар.Номенклатура);
		КонецЕсли; 		
	КонецЦикла; 	
	Возврат Массив;
КонецФункции //-Лико m.shenderov 02.12.2018 

Функция ПолучитьНоменклатуруСписания(ДокументСсылка) //+Лико m.shenderov 02.12.2018
	Массив = Новый Массив(); 	
	Для каждого Товар Из ДокументСсылка.Товары Цикл
		Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура,ДокументСсылка);
		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию Или Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию) Тогда
			Массив.Добавить(Товар.Номенклатура);
		КонецЕсли; 		
	КонецЦикла; 	
	Возврат Массив;
КонецФункции //-Лико m.shenderov 02.12.2018 

Функция ПолучитьНоменклатуруПодВнутреннееПотребление(Товары,Ссылка=Неопределено)Экспорт //+Лико m.shenderov 02.12.2018
	ДокументРасхода=?(Ссылка=Неопределено,Документы.Лико_ПередачаТоваров.ПустаяСсылка(),Ссылка);

	Массив = Новый Массив(); 	
	Для каждого Товар Из Товары Цикл
		Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура,ДокументРасхода);
		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.СписаниеНаВнутреннееПотребление) Тогда
			Массив.Добавить(Товар.Номенклатура);
		КонецЕсли; 		
	КонецЦикла; 	
	Возврат Массив;
КонецФункции //-Лико m.shenderov 02.12.2018 

Функция ПолучитьНоменклатуруПодПередачуВЭксплуатацию(Товары,Ссылка=Неопределено) Экспорт//+Лико m.shenderov 02.12.2018
	ДокументРасхода=?(Ссылка=Неопределено,Документы.Лико_ПередачаТоваров.ПустаяСсылка(),Ссылка);
	Массив = Новый Массив(); 	
	Для каждого Товар Из Товары Цикл
		Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура,ДокументРасхода);
		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию) Тогда
			Массив.Добавить(Товар.Номенклатура);
		КонецЕсли; 		
	КонецЦикла; 	
	Возврат Массив;
КонецФункции //-Лико m.shenderov 02.12.2018 

Функция ПолучитьСтруктуруНоменклатурыПодПередачуВЭксплуатацию(Товары,Ссылка=Неопределено) Экспорт//+Лико m.shenderov 02.12.2018
	ДокументРасхода=?(Ссылка=Неопределено,Документы.Лико_ПередачаТоваров.ПустаяСсылка(),Ссылка);
	Массив = Новый Массив(); 	
	Для каждого Товар Из Товары Цикл
		Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура,ДокументРасхода);
		Если ЗначениеЗаполнено(Правило) И (Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию ) Тогда
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",Товар);
			Структура.Вставить("КатегорияЭксплуатации",Правило.КатегорияЭксплуатации);
			Структура.Вставить("Правило",Правило); 			
			Массив.Добавить(Структура);
		КонецЕсли; 		
	КонецЦикла; 	
	Возврат Массив;
КонецФункции //-Лико m.shenderov 02.12.2018 

// Формирует временную таблицу, содержащую табличную часть по таблице данных документов.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц.
//
Процедура ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Серия КАК Серия,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.Количество КАК КоличествоУпаковок,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	Истина КАК ЭтоТовар,
	|	ЛОЖЬ КАК ЭтоНеВозвратнаяТара,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка
	|ПОМЕСТИТЬ Лико_ПередачаТоваровТаблицаТоваров
	|ИЗ
	|	Документ.Лико_передачаТоваров.Товары КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.НомерСтроки,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика,
	|	ТаблицаТоваров.Серия,
	|	ТаблицаТоваров.Количество,
	|	ТаблицаТоваров.КоличествоУпаковок,
	|	0,
	|	0,
	|	0,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ТаблицаТоваров.Упаковка
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО ТаблицаТоваров.Ссылка = ДанныеДокументов.Ссылка
	|
	|ГДЕ
	|	НЕ ТаблицаТоваров.Номенклатура.ТипНоменклатуры В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	Запрос.Выполнить();
	
КонецПроцедуры
//-- Локализация


//Имена реквизитов, от значений которых зависят параметры указания серий
//
//	Возвращаемое значение:
//		Строка - имена реквизитов, перечисленные через запятую
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	ИменаРеквизитов = "Склад,Дата";
	
	Возврат ИменаРеквизитов;
КонецФункции

// Возвращает текст запроса для проверки заполнения серий
//	Параметры:
//		ПараметрыУказанияСерий - Структура - состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий
//	Возвращаемое значение:
//		Строка - текст запроса
//
Функция ТекстЗапросаПроверкиЗаполненияСерий(ПараметрыУказанияСерий) Экспорт
	
	// Не нужно проверять количество, т.к. в задании на отбор и размещение не может быть серий, идентифицирующих экземпляр
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаСерий.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСерий.Номенклатура КАК Номенклатура,
	|	ТаблицаСерий.Серия КАК Серия,
	|	ТаблицаСерий.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТаблицаСерий.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ТаблицаСерий
	|ИЗ
	|	&ТаблицаСерий КАК ТаблицаСерий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаСерий.Номенклатура) КАК ТоварПредставление,
	|	ВЫБОР
	|		КОГДА ТаблицаСерий.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|					И НЕ ТаблицаСерий.СтатусУказанияСерий В (3, 4)
	|				ИЛИ ТаблицаСерий.СтатусУказанияСерий В (3, 4)
	|					И ТаблицаСерий.КоличествоУпаковок <> 0
	|					И &ФактОтбора
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СерияНеЗаполнена,
	|	ЛОЖЬ КАК ОшибкаКоличества,
	|	ТаблицаСерий.НомерСтроки КАК НомерСтроки,
	|	""Серия"" КАК ИмяПоляСерия
	|ИЗ
	|	ТаблицаСерий КАК ТаблицаСерий
	|ГДЕ
	|	ТаблицаСерий.СтатусУказанияСерий <> 0
	|	И ТаблицаСерий.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяПоляКоличество", ПараметрыУказанияСерий.ИмяПоляКоличество);
	
	Возврат ТекстЗапроса;
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе.
//
// Параметры:
//  Объект	 - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
// 
// Возвращаемое значение:
//  Структура - состав полей задается в функции ОбработкаТабличнойЧастиКлиентСервер.ПараметрыУказанияСерий.
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.Лико_ПередачаТоваров";
	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	ПараметрыУказанияСерий.ИмяТЧСерии  = "Товары";
	
	ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.Склад, Ложь);
	
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры  = ПараметрыСерийСклада.ИспользоватьСерииНоменклатуры;
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПараметрыСерийСклада.УчитыватьСебестоимостьПоСериям;
	ПараметрыУказанияСерий.ИспользоватьАдресноеХранение = Истина;
	ПараметрыУказанияСерий.ИмяПоляКоличество = "КоличествоУпаковок";	
	
	ПараметрыУказанияСерий.ЭтоОрдер = Истина;
	ПараметрыУказанияСерий.ИмяПоляПомещение = "Помещение";
	ПараметрыУказанияСерий.ОсобеннаяПроверкаСтатусовУказанияСерий = Истина;
	ПараметрыУказанияСерий.ИмяПоляКоличество = "КоличествоУпаковок";
	
	ПараметрыУказанияСерий.Дата = Объект.Дата;
	
	
	
	Возврат ПараметрыУказанияСерий;
КонецФункции


// Возвращает текст запроса для расчета статусов указания серий
//	Параметры:
//		ПараметрыУказанияСерий - Структура - состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий
//	Возвращаемое значение:
//		Строка - текст запроса
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Упаковка КАК Упаковка,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	Таблица.Серия,
	|	Таблица." + ПараметрыУказанияСерий.ИмяПоляКоличество + " КАК Количество,
	|	Таблица.СтатусУказанияСерий,
	|	Таблица.ДокументОтгрузки КАК ДокументОтгрузки,
	|	Таблица.НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Если ПараметрыУказанияСерий.ПоляСвязи.Найти("Упаковка") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Таблица.Упаковка", "ИСТИНА");
	КонецЕсли;
	Если ПараметрыУказанияСерий.ПоляСвязи.Найти("ДокументОтгрузки") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Таблица.ДокументОтгрузки", "ИСТИНА");
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|					ТОГДА ВЫБОР
	|							КОГДА Товары.Количество > 0
	|									И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|								ТОГДА ВЫБОР
	|										КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|											ТОГДА 14
	|										ИНАЧЕ 10
	|									КОНЕЦ
	|							КОГДА &ПодготовкаОрдера
	|								ТОГДА 11
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|										ТОГДА 13
	|									ИНАЧЕ 9
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|					ТОГДА ВЫБОР
	|							КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|								ТОГДА ВЫБОР
	|										КОГДА Товары.Количество > 0
	|												И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|											ТОГДА 6
	|										КОГДА &ПодготовкаОрдера
	|											ТОГДА 25
	|										ИНАЧЕ 5
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Количество > 0
	|											И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|										ТОГДА 8
	|									КОГДА &ПодготовкаОрдера
	|										ТОГДА 27
	|									ИНАЧЕ 7
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОГДА &УсловиеПоПараметруПолитикиУчетаСерий
	|					ТОГДА ВЫБОР
	|							КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|								ТОГДА ВЫБОР
	|										КОГДА Товары.Количество > 0
	|												И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|											ТОГДА 4
	|										КОГДА &ПодготовкаОрдера
	|											ТОГДА 23
	|										ИНАЧЕ 3
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Количество > 0
	|											И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|										ТОГДА 2
	|									КОГДА &ПодготовкаОрдера
	|										ТОГДА 21
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ ТаблицаСтатусов
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|			ПО ПолитикиУчетаСерий.Склад = Склады.Ссылка
	|		ПО (ПолитикиУчетаСерий.Склад = &Склад)
	|			И Товары.Номенклатура.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтатусов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСтатусов.СтатусУказанияСерий КАК СтатусУказанияСерий
	|ИЗ
	|	ТаблицаСтатусов КАК ТаблицаСтатусов
	|ГДЕ
	|	ТаблицаСтатусов.СтатусУказанияСерий <> ТаблицаСтатусов.СтарыйСтатусУказанияСерий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ЭтоВозвратНепринятыхТоваров = ПараметрыУказанияСерий.СкладскиеОперации
	.Найти(Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваров) <> Неопределено;
	ЭтоВозвратНепринятыхТоваровУстаревший = ПараметрыУказанияСерий.СкладскиеОперации
	.Найти(Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваровУстарел) <> Неопределено;
	
	Если ЭтоВозвратНепринятыхТоваров
		Или ЭтоВозвратНепринятыхТоваровУстаревший Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеПоПараметруПолитикиУчетаСерий",
		"ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриВозвратеНепринятыхПолучателемТоваров");
		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеПоПараметруПолитикиУчетаСерий",
		"ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемке
		|						И (ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеОтПоставщика
		|								И &ПриемкаОтПоставщика
		|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПоВозвратуОтКлиента
		|								И &ПриемкаПоВозвратуОтКлиента
		//++ НЕ УТ
		|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПродукцииИзПроизводства
		|								И &ПриемкаПродукцииИзПроизводства
		//-- НЕ УТ
		|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПоПеремещению
		|								И &ПриемкаПоПеремещению
		|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеПоПрочемуОприходованию
		|								И &ПриемкаПоПрочемуОприходованию
		|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеКомплектующихПослеРазборки
		|								И &ПриемкаКомплектующихПослеРазборки
		|							ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПриемкеСобранныхКомплектов
		|								И &ПриемкаСобранныхКомплектов)");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции


/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	
КонецПроцедуры



#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Задание складскому работнику
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьДокумента";
	КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.СразуНаПринтер = Истина;	
	
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПечатьДокумента",
		НСтр("ru = 'ПечатьДокумента'"),
		ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры


Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)

    КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьДокумента_ПередачаТоваров";

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваров.Ссылка КАК Ссылка,
	|	Лико_ПередачаТоваров.Дата КАК Дата,
	|	Лико_ПередачаТоваров.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ПередачаТоваров.Склад) КАК СкладПредсавление,
	|	Лико_ПередачаТоваров.Склад КАК Склад,
	|	Лико_ПередачаТоваров.Получатель КАК Получатель,
	|	Лико_ПередачаТоваров.ВидОперации КАК ВидОперации,
	|	Лико_ПередачаТоваров.Распоряжение КАК Распоряжение,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ПередачаТоваров.АвторДокумента) КАК ИсполнительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ПередачаТоваров.Распоряжение) КАК РаспоряжениеПредставление,
	|	Лико_ПередачаТоваров.Распоряжение.Номер КАК РаспоряжениеНомер,
	|	Лико_ПередачаТоваров.Распоряжение.Дата КАК РаспоряжениеДата
	|ИЗ
	|	Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|ГДЕ
	|	Лико_ПередачаТоваров.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	0 КАК Метка,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок КАК КоличествоПлан,
	|	Лико_ПередачаТоваровТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	Лико_ПередачаТоваровТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|	Лико_ПередачаТоваровТовары.Серия.Наименование КАК СерияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Лико_ПередачаТоваровТовары.Упаковка) КАК УпаковкаПредставление,
	|	Лико_ПередачаТоваровТовары.Номенклатура.Код КАК Код,
	|	Лико_ПередачаТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	Лико_ПередачаТоваровТовары.Ссылка КАК Ссылка,
	|	Лико_ПередачаТоваровТовары.АдресХранения КАК АдресХранения
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Метка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	//Нужно напечатать номер и дату накладной, но к накладным может не быть доступа
	УстановитьПривилегированныйРежим(Истина); 
	Результаты = Запрос.ВыполнитьПакет();	
	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаПоДокументам      = Результаты[0].Выбрать();
	ВыборкаПоТабличнымЧастям = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);


	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс, Представление");	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Лико_передачаТоваров.ПФ_MXL_ПечатнаяФормаДокумента");

	ОбластьЗаголовок 		 	 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСкладИсполнитель   			= Макет.ПолучитьОбласть("СкладИсполнитель");

	ОбластьШапкаТаблицыНачало 			= Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
	ОбластьСтрокаТаблицыНачало 			= Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
	ОбластьПодвалТаблицыНачало 			= Макет.ПолучитьОбласть("ПодвалТаблицы|НачалоСтроки");

	ОбластьШапкаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьСтрокаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
	ОбластьПодвалТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
	ОбластьПодзаголовок 	 			= Макет.ПолучитьОбласть("Подзаголовок");
	ОбластьРаспоряжение 	  			= Макет.ПолучитьОбласть("Распоряжение");

	ОбластьШапкаТаблицыКолонкаКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов; 

	Если НЕ ВыводитьКоды Тогда
		ОбластьКолонкаТоваров = Макет.Область("КолонкаТоваров");		
		ОбластьКолонкаТоваров.ШиринаКолонки = ОбластьКолонкаТоваров.ШиринаКолонки  + Макет.Область("КолонкаКодов").ШиринаКолонки;
	КонецЕсли;	

	ОбластьШапкаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаТоваров");
	ОбластьСтрокаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаТоваров");
	ОбластьПодвалТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаТоваров");

	ОбластьШапкаТаблицыКонец 			= Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	ОбластьСтрокаТаблицыКонец 			= Макет.ПолучитьОбласть("СтрокаТаблицы|КонецСтроки");
	ОбластьПодвалТаблицыКонец 			= Макет.ПолучитьОбласть("ПодвалТаблицы|КонецСтроки");

	ПервыйДокумент = Истина;



	Пока ВыборкаПоДокументам.Следующий() Цикл

		Если НЕ ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;

		ВыборкаПоСтрокамТЧ = ВыборкаПоТабличнымЧастям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ВыводитьОснование = Ложь;

		//Если ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор Тогда

		ТекстЗаголовка		 = НСтр("ru='Передача со склада'");
		//ТекстЗоны			 = НСтр("ru='Зона отгрузки:'");
		//ЗонаПредставление	 = ВыборкаПоДокументам.ЗонаОтгрузкиПредставление;
		//РабочийУчасток		 = ВыборкаПоДокументам.РабочийУчастокПредставление;
		ВыводитьРаспоряжение = Истина;
		//ВыводитьОснование    = ТипЗнч(ВыборкаПоДокументам.Распоряжение) = Тип("ДокументСсылка.РасходныйОрдерНаТовары");
		ВыводитьПодзаголовок = Истина;

		//ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение Тогда
		//	
		//	ТекстЗаголовка = НСтр("ru='Задание на размещение товара'");
		//	ТекстЗоны = НСтр("ru='Зона приемки:'");
		//	ЗонаПредставление = ВыборкаПоДокументам.ЗонаПриемкиПредставление;
		//	РабочийУчасток		= ВыборкаПоДокументам.РабочийУчастокПредставление;
		//	ВыводитьРаспоряжение = Ложь;
		//	ВыводитьПодзаголовок = Ложь;
		//	
		//ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение Тогда
		//	
		//	ТекстЗаголовка = НСтр("ru='Задание на перемещение товара'");
		//	ТекстЗоны = "";
		//	ЗонаПредставление = "";
		//	РабочийУчасток	= "";
		//	ВыводитьРаспоряжение = Ложь;
		//	ВыводитьПодзаголовок = Истина;
		//				
		//КонецЕсли;

		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаПоДокументам); 		
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, ТекстЗаголовка);		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ВыборкаПоДокументам.Ссылка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		//ОбластьСкладИсполнитель.Параметры.ИсполнительПредставление	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Исполнитель, ВыборкаПоДокументам.Дата);
		//ОбластьСкладИсполнитель.Параметры.СкладПредставление		= СкладыСервер.ПолучитьПредставлениеСклада(ВыборкаПоДокументам.СкладПредставление,ВыборкаПоДокументам.ПомещениеПредставление);
		//ОбластьСкладИсполнитель.Параметры.ТекстЗоны 				= ТекстЗоны;
		//ОбластьСкладИсполнитель.Параметры.ЗонаПредставление 		= ЗонаПредставление;

		//Если ЗначениеЗаполнено(РабочийУчасток) Тогда
		//	ОбластьСкладИсполнитель.Параметры.ТекстРабочегоУчастка = НСтр("ru = 'Рабочий участок:'");
		//	ОбластьСкладИсполнитель.Параметры.РабочийУчастокПредставление = РабочийУчасток;			
		//Иначе
		//	ОбластьСкладИсполнитель.Параметры.ТекстРабочегоУчастка = "";
		//	ОбластьСкладИсполнитель.Параметры.РабочийУчастокПредставление = "";			
		//КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьСкладИсполнитель);

		//Если ВыводитьОснование Тогда
		//	
		//	Счетчик = 0;
		//	ПредставлениеОснований = "";
		//	ПервоеРаспоряжение = Истина;
		//	РеквизитыДокумента = Новый Структура("Дата, Номер, Префикс, Представление");
		//	
		//	Пока ВыборкаПоРаспоряжениям.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка)) Цикл
		//		
		//		РеквизитыДокумента.Дата          = ВыборкаПоРаспоряжениям.ОснованиеДата;
		//		РеквизитыДокумента.Номер         = ВыборкаПоРаспоряжениям.ОснованиеНомер;
		//		РеквизитыДокумента.Префикс       = "";
		//		РеквизитыДокумента.Представление = ВыборкаПоРаспоряжениям.ОснованиеПредставление;
		//		
		//	ПредставлениеОснования = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
		//		
		//		Если Не ПервоеРаспоряжение Тогда
		//			ПредставлениеОснований = ПредставлениеОснований + ", ";		
		//		КонецЕсли;
		//		
		//		ПервоеРаспоряжение = Ложь;
		//		
		//		ПредставлениеОснований = ПредставлениеОснований + ПредставлениеОснования;
		//		
		//		Счетчик = Счетчик + 1;
		//		
		//	КонецЦикла;
		//	
		//	ОснованияЗаголовок = "";
		//	Если Счетчик > 1 Тогда 
		//		ОснованияЗаголовок = НСтр("ru = 'Основания:'");
		//	Иначе
		//		ОснованияЗаголовок = НСтр("ru = 'Основание:'");
		//	КонецЕсли;
		//	
		//	ОбластьОснование.Параметры.ОснованияПредставление = ПредставлениеОснований;
		//	ОбластьОснование.Параметры.ОснованияЗаголовок = ОснованияЗаголовок;
		//	
		//	ТабличныйДокумент.Вывести(ОбластьОснование);
		//	
		//КонецЕсли;
		//
		Если ВыводитьРаспоряжение Тогда
			РеквизитыДокумента.Дата          = ВыборкаПоДокументам.РаспоряжениеДата;
			РеквизитыДокумента.Номер         = ВыборкаПоДокументам.РаспоряжениеНомер;
			РеквизитыДокумента.Префикс       = "";
			РеквизитыДокумента.Представление = ВыборкаПоДокументам.РаспоряжениеПредставление;

			ОбластьРаспоряжение.Параметры.РаспоряжениеПредставление	= ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
			ТабличныйДокумент.Вывести(ОбластьРаспоряжение);
		КонецЕсли;
		//
		//Если ВыборкаПоДокументам.ОтгрузкаПоЗаданиюНаПеревозку Тогда
		//	РеквизитыДокумента.Дата          = ВыборкаПоДокументам.ЗаданиеНаПеревозкуДата;
		//	РеквизитыДокумента.Номер         = ВыборкаПоДокументам.ЗаданиеНаПеревозкуНомер;
		//	РеквизитыДокумента.Префикс       = "";
		//	РеквизитыДокумента.Представление = ВыборкаПоДокументам.ЗаданиеНаПеревозкуПредставление;
		//	                                    
		//	ОбластьЗаданиеНаПеревозку.Параметры.ЗаданиеНаПеревозкуПредставление	= ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
		//	ОбластьЗаданиеНаПеревозку.Параметры.ПорядокДоставки = ВыборкаПоДокументам.ПорядокДоставки;
		//	ТабличныйДокумент.Вывести(ОбластьЗаданиеНаПеревозку);
		//КонецЕсли;

		Метка = Неопределено;

		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл

			Если Метка <> ВыборкаПоСтрокамТЧ.Метка Тогда
				Если ВыводитьПодзаголовок Тогда  									
					ТекстПозаголовка=ВыборкаПоДокументам.ВидОперации;					
					Если Метка <> Неопределено Тогда
						ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
						Если ВыводитьКоды Тогда
							ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
						КонецЕсли;
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);
					КонецЕсли;				
					ОбластьПодзаголовок.Параметры.ТекстПозаголовка = ТекстПозаголовка;
					ТабличныйДокумент.Вывести(ОбластьПодзаголовок);
				КонецЕсли;

				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыНачало);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаКодов);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаТоваров);
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКонец);
			КонецЕсли;

			ОбластьСтрокаТаблицыНачало.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыНачало);

			Если ВыводитьКоды Тогда
				ОбластьСтрокаТаблицыКолонкаКодов.Параметры.Артикул = ВыборкаПоСтрокамТЧ[КолонкаКодов];
				ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаКодов);
			КонецЕсли;

			ОбластьСтрокаТаблицыКолонкаТоваров.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоСтрокамТЧ.НоменклатураПредставление,
			ВыборкаПоСтрокамТЧ.ХарактеристикаПредставление,
			, // Упаковка
			ВыборкаПоСтрокамТЧ.СерияПредставление);

			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаТоваров);

			ОбластьСтрокаТаблицыКонец.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКонец);	

			Метка = ВыборкаПоСтрокамТЧ.Метка;

		КонецЦикла;

		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;

	Возврат ТабличныйДокумент;	
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ХозяйственнаяОперация");
	Поля.Добавить("ВидОперации");

	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ВидОперации) Тогда
		
		ПредставлениеОперации = СписокОпераций().НайтиПоЗначению(Данные.ВидОперации);
		Если ПредставлениеОперации <> Неопределено Тогда
			ПредставлениеОперации = ПредставлениеОперации.Представление;
		Иначе
			ПредставлениеОперации = "Передача со склада";
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='%1 %2 от %3'"),
		ПредставлениеОперации,
		Данные.Номер,
		Данные.Дата);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СписокОпераций() Экспорт
	
	СписокОпераций = Новый СписокЗначений;
	
	ПередачаВПроизводство			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство");
	ПередачаВПереработку			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку");
	Перемещение						= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение");
	ВозвратПоставщику				= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику");
	ПередачаВРемонт					= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт");
	СОтветственногоХранения			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения");
	Продажа							= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа");
	ПередачаФорм						= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм");
	Списание			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Списание");
	СписаниеФорм			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм");
	ПеремещениеФорм			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеФорм");
	ПередачаПоРаспоряжению			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаПоРаспоряжению");
	ПеремещениеНаОтветственноеХранение			= ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение");
	
	
	
	
	СписокОпераций.Добавить(ПередачаВПроизводство, 				НСтр("ru = 'лк Передача в производство'"));
	СписокОпераций.Добавить(ПередачаВПереработку,    		 	НСтр("ru = 'лк Передача в переработку'"));
	
	СписокОпераций.Добавить(Перемещение, 						НСтр("ru = 'лк Перемещение'"));
	СписокОпераций.Добавить(ВозвратПоставщику,     				НСтр("ru = 'лк Возврат поставщику'"));
	
	СписокОпераций.Добавить(ПередачаВРемонт, 					НСтр("ru = 'лк Передача в ремонт'"));
	СписокОпераций.Добавить(СОтветственногоХранения,    		НСтр("ru = 'лк С ответственного хранения'"));
	
	СписокОпераций.Добавить(Продажа,              				НСтр("ru = 'лк Продажа'"));
	СписокОпераций.Добавить(ПередачаФорм,               	НСтр("ru = 'лк Передача форм'"));
	СписокОпераций.Добавить(Списание,               			НСтр("ru = 'лк Списание'"));
	СписокОпераций.Добавить(СписаниеФорм,               		НСтр("ru = 'лк Списание форм'"));
	СписокОпераций.Добавить(ПеремещениеФорм,               		НСтр("ru = 'лк Перемещение форм'"));
	СписокОпераций.Добавить(ПередачаПоРаспоряжению,             НСтр("ru = 'лк Передача по распоряжению'"));
	СписокОпераций.Добавить(ПеремещениеНаОтветственноеХранение, НСтр("ru = 'лк Перемещение на ответ. хранение'"));
	
	
	
	Возврат СписокОпераций;
	
КонецФункции

#КонецОбласти

#КонецЕсли


//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
  МеханизмыДокумента.Добавить("АдресныйСклад");
  МеханизмыДокумента.Добавить("Лико_Склад");

КонецПроцедуры
// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения180326(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
	   ТаблицаСписанияНоменклатуры=ДопПараметры.ТаблицаСписанияНоменклатуры;
	
		ЗаполнитьПараметрыИнициализации(Запрос, Документ,ТаблицаСписанияНоменклатуры);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
	ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
	
	Если ЭтоОтветственноеХранение(Документ) Тогда
		
		ТекстЗапросаТаблицаЛико_ТоварыНаОтветственномХранении(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
		
	КонецЕсли; 

	ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
	ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
	ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
	//ТекстЗапросаТаблицаТМЦВЭксплуатации(Запрос, ТекстыЗапроса, Регистры);
	
	//Начало изменений Иванова Анна 20181027
	ТекстЗапросаТаблицаЛикоОснасткаПоЗаказу(Запрос, ТекстыЗапроса, Регистры);
	//КонецИзменений Иванова Анна 20181027   
	ТекстЗапросаТаблицаЛико_СписаниеНаЗаказ(Запрос, ТекстыЗапроса, Регистры);
	//ТекстЗапросаВтСписанияНоменклатуры(Запрос, ТекстыЗапроса,ТаблицаСписанияНоменклатуры);
    ТекстЗапросаТаблицаЛико_КонтрольВозвратовПоставщику(Запрос, ТекстыЗапроса, Регистры); 			
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции 

Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры) Экспорт
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;

	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;

	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		ТаблицаСписанияНоменклатуры=ДопПараметры.ТаблицаСписанияНоменклатуры;

		ЗаполнитьПараметрыИнициализации(Запрос, Документ,ТаблицаСписанияНоменклатуры);
		
				

		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
		
		Если ЭтоОтветственноеХранение(Документ) Тогда
			
			ТекстЗапросаТаблицаЛико_ТоварыНаОтветственномХранении(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
			
		КонецЕсли; 

		
		
		//ТекстЗапросаТаблицаЛико_ТоварыНаОтветственномХранении(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
		ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
		ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры,ТаблицаСписанияНоменклатуры);
		//ТекстЗапросаТаблицаТМЦВЭксплуатации(Запрос, ТекстыЗапроса, Регистры);

		//Начало изменений Иванова Анна 20181027
		ТекстЗапросаТаблицаЛикоОснасткаПоЗаказу(Запрос, ТекстыЗапроса, Регистры);
		//КонецИзменений Иванова Анна 20181027   
		ТекстЗапросаТаблицаЛико_СписаниеНаЗаказ(Запрос, ТекстыЗапроса, Регистры);
		//ТекстЗапросаВтСписанияНоменклатуры(Запрос, ТекстыЗапроса,ТаблицаСписанияНоменклатуры);
		ТекстЗапросаТаблицаЛико_КонтрольВозвратовПоставщику(Запрос, ТекстыЗапроса, Регистры); 			

	КонецЕсли;

	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений

	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);

КонецФункции    


Функция ЭтоОтветственноеХранение(Документ) //+Лико m.shenderov 15.02.2026
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|				ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Лико_ОрганизацияОтветственногоХранения <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Лико_ОрганизацияОтветственногоХранения <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|				ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Помещение
	|			ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Помещение
	|		КОНЕЦ <> Лико_ПередачаТоваровТовары.АдресХранения.Помещение
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|	И Лико_ПередачаТоваровТовары.АдресХранения.Лико_ОрганизацияОтветственногоХранения <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|				ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Помещение
	|			ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Помещение
	|		КОНЕЦ <> Лико_ПередачаТоваровТовары.АдресХранения.Помещение
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение)";
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);
	Возврат  Не Запрос.Выполнить().Пустой();
	
	
	
	
	
КонецФункции //-Лико m.shenderov 15.02.2026 


// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие - соответствие имен таблиц изменения регистров и текстов запросов.
//	
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции
  // Правила получения значений реквизитов ТТН
// 
// Возвращаемое значение:
//  Структура -  см. Документы.ТранспортнаяНакладная.ПараметрыФормированияТранспортныхНакладных
//
Функция ПараметрыФормированияТранспортныхНакладных() Экспорт
	
	ПараметрыФормированияТранспортныхНакладных =
		Документы.ТранспортнаяНакладная.ПараметрыФормированияТранспортныхНакладных();
		
	ПараметрыФормированияТранспортныхНакладных.Реквизиты.Грузоотправитель = 
	"	ВЫБОР
	|		КОГДА ОснованиеТранспортнойНакладной.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ОснованиеТранспортнойНакладной.Организация
	|		ИНАЧЕ ОснованиеТранспортнойНакладной.Грузоотправитель
	|	КОНЕЦ";
	
	ПараметрыФормированияТранспортныхНакладных.Реквизиты.Грузополучатель = 
	"		ВЫБОР
	|			КОГДА ОснованиеТранспортнойНакладной.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ОснованиеТранспортнойНакладной.Контрагент
	|			ИНАЧЕ ОснованиеТранспортнойНакладной.Грузополучатель
	|		КОНЕЦ";
	
	ПараметрыФормированияТранспортныхНакладных.Реквизиты.ЗаказчикПеревозки                 = "ОснованиеТранспортнойНакладной.Контрагент";
	ПараметрыФормированияТранспортныхНакладных.Реквизиты.БанковскийСчетЗаказчикаПеревозки  = "ОснованиеТранспортнойНакладной.БанковскийСчетКонтрагента";
	ПараметрыФормированияТранспортныхНакладных.Реквизиты.Плательщик                        = "ОснованиеТранспортнойНакладной.Контрагент";
	ПараметрыФормированияТранспортныхНакладных.Реквизиты.БанковскийСчетПлательщика         = "ОснованиеТранспортнойНакладной.БанковскийСчетКонтрагента";
	
	////ПараметрыФормированияТранспортныхНакладных.ЕстьЗаказы = Истина;
	////ПараметрыФормированияТранспортныхНакладных.ИмяПоляЗаказВТЧТовары = "ЗаказКлиента";
	////ПараметрыФормированияТранспортныхНакладных.ИмяПоляНакладнаяПоЗаказу = "РеализацияПоЗаказам";
	////
	////ПараметрыФормированияТранспортныхНакладных.ИспользоватьРасширенныеВозможностиЗаказа = Истина;
	////ПараметрыФормированияТранспортныхНакладных.ЕстьДополнительнаяПроверкаВозможностиСозданияНакладной = Истина;
	////ПараметрыФормированияТранспортныхНакладных.ИменаРеквизитовДляДополнительнойПроверки.Добавить("Статус");
	
	Возврат	ПараметрыФормированияТранспортныхНакладных;
	
КонецФункции
//- <--- Лико2.5 m.shenderov 30.03.2022 

Функция ПроверитьФИФОЛИФО(Отказ,РежимЗаписи,Объект, УчетПравилПеремещенияТМЦ) Экспорт // <-- Начало Лико Яцун С. В. 16.10.2025
Ответ = "";	
	
	Если УчетПравилПеремещенияТМЦ Тогда
		
		Результат  = Неопределено; 
		Если 	РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(Объект,Отказ,Результат);
			
		КонецЕсли;
		
		
		Если ТипЗнч(Результат)=Тип("Структура") И Результат.Свойство("ПроверкаПравил") Тогда
			
			Если ТипЗнч(Результат.ПроверкаПравил)=Тип("ТаблицаЗначений") Тогда
				
				Ответ=Результат.ПроверкаПравил.ВыгрузитьКолонку("Комментарий");	
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	Иначе
		
		Ответ  = ПроверитьФИФОЛИФО_в1(Отказ,РежимЗаписи,Объект);
		
	КонецЕсли;
Возврат  Ответ;
КонецФункции  // <-- Конец Лико Яцун С. В. 16.10.2025   

Функция ПроверитьФИФОЛИФО_в2(Отказ,РежимЗаписи,Объект)
	
	Ответ = Неопределено;
	Если 	РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(Объект,Отказ,Ответ);
		
	КонецЕсли;
	
	Возврат  Ответ;
	
КонецФункции 

Функция ПроверитьФИФОЛИФО_в1(Отказ,РежимЗаписи,Объект) // <-- Начало Лико Яцун С. В. 16.10.2025
	
	УстановитьПривилегированныйРежим(Истина);
	
	Вопрос = "";
	Письмо = "";
	Адресаты = "";
	МеждуАнгарИОсновной = "";
	//Если Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение 
	//	И Объект.Товары[0].АдресХранения.Помещение.Наименование = "Склад №2  (Ликофлекс)" 
	//	И Объект.АдресХранения.Помещение.Наименование = "СИМ  (Ликофлекс)" Тогда
	//	МеждуАнгарИОсновной = "ФИФО"
	//ИначеЕсли Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение 
	//	И Объект.Товары[0].АдресХранения.Помещение.Наименование = "СИМ  (Ликофлекс)" 
	//	И Объект.АдресХранения.Помещение.Наименование = "Склад №2  (Ликофлекс)" Тогда
	//	МеждуАнгарИОсновной = "ЛИФО"
	//КонецЕсли;
	
	Если НЕ (Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение 
			ИЛИ Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения 
			ИЛИ Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство) 
		ИЛИ (ЗначениеЗаполнено(Объект.ЗаявкаНаСклад) И Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение И МеждуАнгарИОсновной = "") Тогда
		Вопрос = Новый Структура("Вопрос,ВидОперации,Письмо,Адресаты",Вопрос,Объект.ВидОперации,Письмо,Адресаты);
		Возврат Вопрос;	
	КонецЕсли;
	
	
	ТзТоварыСтарые =   Объект.Ссылка.Товары.Выгрузить(,"Серия");
	ТзТоварыНовые  = Объект.Товары.Выгрузить(,"Серия");
	
	ТзТоварыСтарые.Свернуть("Серия");
	ТзТоварыНовые.Свернуть("Серия");
	
	ЕстьИзмененияТоваров = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТзТоварыСтарые,ТзТоварыНовые);
	
	Если ЕстьИзмененияТоваров 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ Отказ 
		И Объект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра
		И (Объект.АдресХранения.Лико_Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра 
			ИЛИ Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство И Объект.Получатель.Лико_Площадка = Справочники.Лико_Площадки.Ликофлекс) Тогда
		ТЗ = Объект.Товары.Выгрузить();
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
		ТЗ.Колонки.Добавить("ДатаФормирования",Новый ОписаниеТипов("Дата", , ,КвалификаторыДаты));	
		Для каждого СтрТЗ Из ТЗ Цикл
			СтрТЗ.ДатаФормирования = СтрТЗ.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования;
		КонецЦикла;
		Если (ТЗ[0].АдресХранения.Лико_УдаленныйСклад ИЛИ ТЗ[0].АдресХранения.Лико_ОтветственноеХранение) 
			И НЕ Объект.АдресХранения.Лико_УдаленныйСклад 
			ИЛИ Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство 
			ИЛИ МеждуАнгарИОсновной = "ФИФО" Тогда
			//ФИФО проверяем сначала более свежие
			ТЗ.Сортировать("ДатаФормирования Убыв");
		ИначеЕсли (НЕ ТЗ[0].АдресХранения.Лико_УдаленныйСклад ИЛИ ТЗ[0].АдресХранения.Лико_ОтветственноеХранение) И Объект.АдресХранения.Лико_УдаленныйСклад Тогда
			//ЛИФО проверяем сначала более старые
			ТЗ.Сортировать("ДатаФормирования");
		КонецЕсли;		
		МассивСерийПеремещения = ТЗ.ВыгрузитьКолонку("Серия");
		МассивПодобранныхСерий = Новый Массив;
		Для каждого Стр Из ТЗ Цикл
			Если Стр.АдресХранения.Лико_Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра 
				И Стр.АдресХранения.Владелец.Лико_Площадка = Справочники.Лико_Площадки.Ликофлекс
				И НЕ Стр.АдресХранения.Лико_ПомещениеБрака
				И ЗначениеЗаполнено(Стр.Серия) 
				И (Стр.Номенклатура.ВидНоменклатуры.Наименование = "Краска" И Стр.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный ИЛИ Стр.Номенклатура.ЦеноваяГруппа.Лико_ВидТМЦ = Справочники.Лико_ВидыТМЦ.Чернила) Тогда
				Если (Стр.АдресХранения.Лико_УдаленныйСклад ИЛИ Стр.АдресХранения.Лико_ОтветственноеХранение) И НЕ Объект.АдресХранения.Лико_УдаленныйСклад 
					ИЛИ Объект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство 
					ИЛИ МеждуАнгарИОсновной = "ФИФО" Тогда
					МетодУчета = "ФИФО";
					ВопросНайден = "ранний";
				ИначеЕсли (НЕ Стр.АдресХранения.Лико_УдаленныйСклад ИЛИ Стр.АдресХранения.Лико_ОтветственноеХранение) И Объект.АдресХранения.Лико_УдаленныйСклад Тогда
					МетодУчета = "ЛИФО";
					ВопросНайден = "свежий";
				Иначе
					Продолжить;
				КонецЕсли;	
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования КАК ДатаФормирования,
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки КАК НомерПоставки,
				|	ТоварыВЯчейкахОстатки.Серия КАК Серия
				|ИЗ
				|	РегистрНакопления.ТоварыВЯчейках.Остатки(
				|			&ДатаОстатков,
				|			Номенклатура = &Номенклатура
				|				И НАЧАЛОПЕРИОДА(Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаФормированияТМЦ, ДЕНЬ)
				|				И НЕ Серия В (&МассивСерийПеремещения)
				|				И НЕ Серия В (&МассивПодобранныхСерий)
				|				И НЕ Ячейка.Лико_ПомещениеБрака
				|				И ВЫБОР
				|					КОГДА &УдаленныйСклад
				|							ИЛИ &ОтветХранение
				|							ИЛИ &МеждуАнгарИОсновной
				|						ТОГДА Ячейка.Помещение = &Помещение
				|					ИНАЧЕ Ячейка.Лико_ТипСклада = &ТипСклада
				|							И Ячейка.Лико_Организация = &Организация
				|							И Ячейка.Владелец = &Склад
				|							И НЕ Ячейка.Лико_ОтветственноеХранение
				|							И НЕ Ячейка.Лико_УдаленныйСклад
				|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования,
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки,
				|	ТоварыВЯчейкахОстатки.Серия
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДатаФормирования";
				
				Запрос.УстановитьПараметр("ДатаОстатков", ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
				Запрос.УстановитьПараметр("ДатаФормированияТМЦ", Стр.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования);
				Запрос.УстановитьПараметр("МассивСерийПеремещения", МассивСерийПеремещения);
				Запрос.УстановитьПараметр("МассивПодобранныхСерий", МассивПодобранныхСерий);
				Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
				Запрос.УстановитьПараметр("Помещение", Стр.АдресХранения.Помещение);
				Запрос.УстановитьПараметр("Организация", Стр.АдресХранения.Лико_Организация);
				Запрос.УстановитьПараметр("Склад", Стр.АдресХранения.Владелец);
				Запрос.УстановитьПараметр("ТипСклада", Стр.АдресХранения.Лико_ТипСклада);
				Запрос.УстановитьПараметр("УдаленныйСклад", Стр.АдресХранения.Лико_УдаленныйСклад);
				Запрос.УстановитьПараметр("ОтветХранение", Стр.АдресХранения.Лико_ОтветственноеХранение);
				Запрос.УстановитьПараметр("МеждуАнгарИОсновной", МеждуАнгарИОсновной <> "");
				
				Если МетодУчета = "ЛИФО" Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст,"<",">");	
					Запрос.Текст = СтрЗаменить(Запрос.Текст,"УПОРЯДОЧИТЬ ПО
															|	ДатаФормирования","УПОРЯДОЧИТЬ ПО
															|	ДатаФормирования УБЫВ");	
				КонецЕсли;
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					МассивПодобранныхСерий.Добавить(ВыборкаДетальныеЗаписи.Серия); 
					НомерПоставки = Стр.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки;
					ДатаФормирования = Стр.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования;
					ТекстВопроса = "Нарушен принцип "+ МетодУчета + ", для ТМЦ """ + Стр.Номенклатура.Наименование + """, #" + НомерПоставки + " от " + Формат(ДатаФормирования,"ДФ=dd.MM.yyyy") 
					+ " - есть более " + ВопросНайден + " - " + "#" + ВыборкаДетальныеЗаписи.НомерПоставки + " от " + Формат(ВыборкаДетальныеЗаписи.ДатаФормирования,"ДФ=dd.MM.yyyy");
					Вопрос = ?(Вопрос = "", ТекстВопроса,Вопрос + "; " + Символы.ПС + Символы.ПС + ТекстВопроса);
					ТекстПисьма = "Для ТМЦ """ + Стр.Номенклатура.НаименованиеПолное
					+ ?(Найти(НРег(Стр.Номенклатура.НаименованиеПолное),НРег(Стр.Номенклатура.Артикул)) > 0,""," (" + Стр.Номенклатура.Артикул +")") 
					+ """, #" + НомерПоставки + " от " + Формат(ДатаФормирования,"ДФ=dd.MM.yyyy") 
					+ " - есть более " + ВопросНайден + " - " + "#" + ВыборкаДетальныеЗаписи.НомерПоставки + " от " + Формат(ВыборкаДетальныеЗаписи.ДатаФормирования,"ДФ=dd.MM.yyyy");
					Письмо = ?(Письмо = "", ТекстПисьма,Письмо + "<br>" + "<br>" + ТекстПисьма);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Вопрос = Новый Структура("Вопрос,ВидОперации,Письмо,Адресаты",Вопрос,Объект.ВидОперации,Письмо,Адресаты);
		Возврат Вопрос; 
	КонецЕсли;
	                                        	
	Если МеждуАнгарИОсновной <> "" Тогда
		Адресаты = "sklad_sm@okil-sato.ru";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство") Тогда
		Адресаты = "OlegPak@okil.ru;ALeshev@okil-sato.ru;MBuyanov@okil-sato.ru;OLyaskovskaya@okil-sato.ru;sklad_sm@okil-sato.ru";
		Если Объект.Товары.Количество() > 0 И ЗначениеЗаполнено(Объект.Товары[0].АдресХранения.Помещение) И Объект.Товары[0].АдресХранения.Помещение.Наименование = "Цифровой участок  (Ликофлекс)" Тогда
			Адресаты = "OlegPak@okil.ru;sboreckiy@okil-sato.ru;cifrasklad@okil-sato.ru;OLyaskovskaya@okil-sato.ru;MBuyanov@okil-sato.ru";
		КонецЕсли;
	Иначе
		Адресаты = "MBuyanov@okil-sato.ru;ALeshev@okil-sato.ru;OlegPak@okil.ru;OLyaskovskaya@okil-sato.ru";
	КонецЕсли;
	
	Вопрос = Новый Структура("Вопрос,ВидОперации,Письмо,Адресаты",Вопрос,Объект.ВидОперации,Письмо,Адресаты);
	Возврат Вопрос;
	
КонецФункции  // <-- Конец Лико Яцун С. В. 16.10.2025   

