#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    УстановитьПривилегированныйРежим(Истина);
	
	УстановитьПризакБрак();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ИнтерКампани=Ложь;

	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	
	Если ЭтоНовый() Тогда
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотОбъект.Записать();
		ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
		
	КонецЕсли; 
	
	Если Проведен и РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения Тогда
		Отказ=Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед записью документа необходимо отменить проведение!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	
	ПроверкаЯССМСклада(Отказ,РежимЗаписи,РежимПроведения);
	ОбработкаВидаОперации(Отказ,РежимЗаписи,РежимПроведения);
	ОбработкаСерий();
	ПроверкаБлокировкиНоменклатурыПриВыдачиНаРц(Отказ,РежимЗаписи);
	BrcПроверкаБлокировкиНоментклатуры(Отказ);
	
	ПроверкаОтсутсвияМатериаловНаОтветственномХранении(Отказ,РежимЗаписи);
	
	ПроверкаРезерваМатериалов(Отказ,РежимЗаписи);
	КонтрольЗаполненияПартииПроизводства(Отказ,РежимЗаписи);
	ЗаполнитьПравилоСписанияНоменклатурыПриПередачеВПроизводство(Отказ, РежимЗаписи);
	ЗаполнитьСклады(Отказ, РежимЗаписи);

	// --> Начало Лико Ефимов ЕВВ 24.08.2021
	ПроверитьЯчейкиНаСоответствиеРабочимЦентрам(Отказ, РежимЗаписи);
	ПроверитьПередачуОснасткиНаМашину(Отказ, РежимЗаписи, РежимПроведения);
	// <-- Конец Лико Ефимов ЕВВ 24.08.2021 

	// -->   Субботин 02.12.2022
	Если Получатель.ПорядковыйНомер = 17 Тогда  
		//проверка на 2 любых глубоких вала
		ПроверитьГлубокиеВалы(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	// <--

	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("БылПроведен", Проведен); 

	//Если Не ДополнительныеСвойства.БылПроведен  Тогда	
	//	ОбработатьРаспоряжение(РежимЗаписи,Отказ);
	//КонецЕсли;		

	СписаниеИзЭксплуатации();  		

	Если Не Отказ Тогда
		ЯчекаПереработка=ОпределитьЯчейкуДляПереработки();
		ЯчейкаМОЛ=ОпределитьЯчейкуМОЛ();
	КонецЕсли;

	ЗаполнитьРеквизитыДляПечати();
	ПроверкаОрганизацииСкладаИлиРЦ(Отказ,РежимЗаписи);
	ПроверкаВидаОперацииДляСкладаОтветственноеХранениеBRC(Отказ,РежимЗаписи);
	ЗаполнитьДопРеквизитыВТчТоварыДляВозвратаПоставщику(РежимЗаписи);
	//ПроверитьНаличиеЦеныНаОснастку();
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ВозможностьИспользованияВнутреннийПереработки(Отказ,РежимЗаписи); 
	КонтрольНаличияФотоРулонногоМатериала(Отказ, РежимЗаписи);
	КонтрольПеремещенияОтветХранения(Отказ, РежимЗаписи);
КонецПроцедуры

Процедура УстановитьПризакБрак() 
	
	Если ЗначениеЗаполнено(ПричинаСписания) И ПричинаСписания=Справочники.Лико_ПричиныСписания.Брак Тогда
		БракМатериала=Истина;
	КонецЕсли;
	

КонецПроцедуры 


Процедура  ПроверитьГлубокиеВалы(Отказ, РежимЗаписи, РежимПроведения)  
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидОперации <> Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		Возврат;
	КонецЕсли;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка
		|ПОМЕСТИТЬ ВТ_ЯчейкиРабочихЦентров
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|ГДЕ
		|	НЕ РабочиеЦентры.ВидРабочегоЦентра В (&ВидыРЦИсключения)
		|	И РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочиеЦентры.ЛикоЯчейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ТЗ.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
		|	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ТЗ.АдресХраненияНовый КАК Справочник.СкладскиеЯчейки)) = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|			ТОГДА &АдресИзШапки
		|		ИНАЧЕ ВЫРАЗИТЬ(ТЗ.АдресХраненияНовый КАК Справочник.СкладскиеЯчейки)
		|	КОНЕЦ КАК АдресХранения
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Серия КАК Серия,
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.АдресХранения КАК АдресХранения,
		|	ДопРеквизитОснасткаВид.Значение КАК Вал,
		|	ДопРеквизитВидШтампа.Значение КАК ГлубокаяПечать
		|ПОМЕСТИТЬ ВТ_ТолькоОснасткаПередающаясяНаРЦ
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЯчейкиРабочихЦентров КАК ВТ_ЯчейкиРабочихЦентров
		|		ПО ВТ.АдресХранения = ВТ_ЯчейкиРабочихЦентров.Ячейка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДопРеквизитВидШтампа
		|		ПО ВТ.Номенклатура = ДопРеквизитВидШтампа.Ссылка
		|			И (ДопРеквизитВидШтампа.Свойство.Имя = ""ОстасткаВидШтампа"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДопРеквизитОснасткаВид
		|		ПО ВТ.Номенклатура = ДопРеквизитОснасткаВид.Ссылка
		|			И (ДопРеквизитОснасткаВид.Свойство.Имя = ""ОснасткаВид"")
		|ГДЕ
		|	ВТ.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка
		|	И ДопРеквизитВидШтампа.Значение = ЗНАЧЕНИЕ(Справочник.Лико_видШтампа.ГлубокаяПечать)
		|	И ДопРеквизитОснасткаВид.Значение = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОснастки.Вал)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоРазличныхВДокументе
		|ПОМЕСТИТЬ ВТ_КоличествоРазличныхВДокументе
		|ИЗ
		|	ВТ_ТолькоОснасткаПередающаясяНаРЦ КАК ВТ_ТолькоОснасткаПередающаясяНаРЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТолькоОснасткаПередающаясяНаРЦ.Вал,
		|	ВТ_ТолькоОснасткаПередающаясяНаРЦ.ГлубокаяПечать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Серия КАК Серия,
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.АдресХранения КАК АдресХранения,
		|	ВТ_КоличествоРазличныхВДокументе.КоличествоРазличныхВДокументе КАК КоличествоРазличныхВДокументе,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыВЯчейкахОстатки.Серия) КАК КоличествоШтамповНаМашинеСТакойЖеНоменклатурой
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ТолькоОснасткаПередающаясяНаРЦ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				&ДатаОстатков,
		|				(Номенклатура, Ячейка) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура,
		|						ВТ.АдресХранения
		|					ИЗ
		|						ВТ)) КАК ТоварыВЯчейкахОстатки
		|		ПО ВТ.Серия <> ТоварыВЯчейкахОстатки.Серия
		|			И ВТ.АдресХранения = ТоварыВЯчейкахОстатки.Ячейка,
		|	ВТ_КоличествоРазличныхВДокументе КАК ВТ_КоличествоРазличныхВДокументе
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Серия,
		|	ВТ.НомерСтроки,
		|	ВТ.АдресХранения,
		|	ВТ_КоличествоРазличныхВДокументе.КоличествоРазличныхВДокументе
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Серия КАК Серия,
		|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
		|	ВТ_Итог.АдресХранения КАК АдресХранения,
		|	ВТ_Итог.КоличествоРазличныхВДокументе КАК КоличествоРазличныхВДокументе,
		|	ВТ_Итог.КоличествоШтамповНаМашинеСТакойЖеНоменклатурой КАК КоличествоШтамповНаМашинеСТакойЖеНоменклатурой
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.КоличествоРазличныхВДокументе > 1";
	
	Запрос.УстановитьПараметр("ТЗ", Товары.Выгрузить(, "Номенклатура,Серия,НомерСтроки,АдресХраненияНовый"));
	Запрос.УстановитьПараметр("АдресИзШапки", ?(ЗначениеЗаполнено(Получатель.ЛикоЯчейка), Получатель.ЛикоЯчейка, АдресХранения));
	Запрос.УстановитьПараметр("ДатаОстатков", ?(РежимПроведения = РежимПроведенияДокумента.Оперативный, Дата('39991231235959'), Дата));
	Запрос.УстановитьПараметр("ВидНоменклатурыОснастка", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
	Запрос.УстановитьПараметр("ВидыРЦИсключения", Лико_Дополнительно.СформироватьМассивИсключенийВидовРЦДляПоискаЯчеекРЦ());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Если Выборка.КоличествоРазличныхВДокументе > 1 Тогда
			Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "Строка №" + Выборка.НомерСтроки + ": по номенклатуре """ + Выборка.НоменклатураНаименованиеПолное + """ вы пытаетесь передать сразу " + Выборка.КоличествоРазличныхВДокументе + " шт. Разрешено передавать не более 1 вала глубокой печати.";
		Иначе
			Продолжить;
		КонецЕсли;	
		Сообщение.Поле = "Товары["+(Выборка.НомерСтроки-1)+"].Номенклатура";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЦикла;

	
	
КонецПроцедуры	

Процедура ПроверитьЯчейкиНаСоответствиеРабочимЦентрам(Отказ, РежимЗаписи) // --> Начало Лико Ефимов ЕВВ 27.08.2021
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПроверкиЯчеекВПередачеСоСклада = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПроверкиЯчеекВПередачеСоСклада.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПроверкиЯчеекВПередачеСоСклада) ИЛИ Дата < ДатаНачалаПроверкиЯчеекВПередачеСоСклада Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПередачаВПроизводство = ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство;
	Если НЕ (ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение
		ИЛИ ЭтоПередачаВПроизводство
		ИЛИ ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку
		) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка
		|ПОМЕСТИТЬ ВТ_ЯчейкиРабочихЦентров
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|ГДЕ
		|	НЕ РабочиеЦентры.ВидРабочегоЦентра В (&ВидыРЦИсключения)
		|	И РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочиеЦентры.ЛикоЯчейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.АдресХранения КАК Справочник.СкладскиеЯчейки) КАК АдресХранения,
		|	ВЫРАЗИТЬ(ТЗ.АдресХраненияНовый КАК Справочник.СкладскиеЯчейки) КАК АдресХраненияНовый,
		|	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.АдресХранения КАК АдресХранения,
		|	ВЫБОР
		|		КОГДА ВТ.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|			ТОГДА &ЯчейкаИзШапки
		|		ИНАЧЕ ВТ.АдресХраненияНовый
		|	КОНЕЦ КАК АдресХраненияНовыйСУчетомТЧ,
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.АдресХраненияНовый КАК АдресХраненияНовый
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.АдресХранения КАК АдресХранения,
		|	ВТ2.АдресХраненияНовыйСУчетомТЧ КАК АдресХраненияНовыйСУчетомТЧ,
		|	ВТ2.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ВТ_ЯчейкиРабочихЦентров.Ячейка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК АдресХраненияЯчейкаРЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ЯчейкиРабочихЦентровНовый.Ячейка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК АдресХраненияНовыйЯчейкаРЦ,
		|	ВТ2.АдресХраненияНовый КАК АдресХраненияНовый
		|ПОМЕСТИТЬ ВТ3
		|ИЗ
		|	ВТ2 КАК ВТ2
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЯчейкиРабочихЦентров КАК ВТ_ЯчейкиРабочихЦентров
		|		ПО ВТ2.АдресХранения = ВТ_ЯчейкиРабочихЦентров.Ячейка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЯчейкиРабочихЦентров КАК ВТ_ЯчейкиРабочихЦентровНовый
		|		ПО ВТ2.АдресХраненияНовыйСУчетомТЧ = ВТ_ЯчейкиРабочихЦентровНовый.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ3.НомерСтроки КАК НомерСтроки,
		|	МАКСИМУМ(ВТ3.АдресХраненияЯчейкаРЦ) КАК АдресХраненияЯчейкаРЦ,
		|	МАКСИМУМ(ВТ3.АдресХраненияНовыйЯчейкаРЦ) КАК АдресХраненияНовыйЯчейкаРЦ,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ3.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК АдресХраненияНовыйПустой
		|ИЗ
		|	ВТ3 КАК ВТ3
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ3.НомерСтроки";
	
	Запрос.УстановитьПараметр("ТЗ", Товары.Выгрузить(,"НомерСтроки,Номенклатура,АдресХранения,АдресХраненияНовый"));
	Запрос.УстановитьПараметр("ЯчейкаИзШапки", ?(ЭтоПередачаВПроизводство, Получатель.ЛикоЯчейка, АдресХранения));
	Запрос.УстановитьПараметр("ВидыРЦИсключения", Лико_Дополнительно.СформироватьМассивИсключенийВидовРЦДляПоискаЯчеекРЦ());
	Запрос.УстановитьПараметр("ВидНоменклатурыОснастка", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ПутьКДанным = "Объект";
		Если ЭтоПередачаВПроизводство И ВыборкаДетальныеЗаписи.АдресХраненияЯчейкаРЦ Тогда
			Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "Строка №" + ВыборкаДетальныеЗаписи.НомерСтроки + ": оснастку запрещено передавать в производство из ячеек РЦ. Сначала необходимо создать возврат на склад";
			Сообщение.Поле = "Товары["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].АдресХранения";
			Сообщение.Сообщить();
			Отказ = Истина;
		ИначеЕсли НЕ ЭтоПередачаВПроизводство Тогда
			Если ВыборкаДетальныеЗаписи.АдресХраненияЯчейкаРЦ Тогда
				Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "Строка №" + ВыборкаДетальныеЗаписи.НомерСтроки + ": оснастку запрещено перемещать из ячеек РЦ. Сначала необходимо создать возврат на склад";
				Сообщение.Поле = "Товары["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].АдресХранения";
			ИначеЕсли ВыборкаДетальныеЗаписи.АдресХраненияНовыйЯчейкаРЦ Тогда
				Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "Строка №" + ВыборкаДетальныеЗаписи.НомерСтроки + ": оснастку запрещено перемещать в ячейки РЦ, необходимо использовать передачу в производство";
				Если ВыборкаДетальныеЗаписи.АдресХраненияНовыйПустой Тогда
					Сообщение.Поле = "АдресХранения";
				Иначе
					Сообщение.Поле = "Товары["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].АдресХраненияНовый";
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 27.08.2021  

Процедура ПроверитьПередачуОснасткиНаМашину(Отказ, РежимЗаписи, РежимПроведения) // --> Начало Лико Ефимов ЕВВ 24.08.2021 
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	// Нельзя передавать на машину оснастку, если такая оснастка уже есть на машине. Также нельзя передавать больше одной оснаски с одинаковой номенклатурой
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидОперации <> Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		Возврат;
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ДатаНачалаУчетаПробегаШтамповПоСчетчику = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Организация, "ДатаНачалаУчетаПробегаШтамповПоСчетчику", Дата('00010101'));
	Если НЕ ЗначениеЗаполнено(ДатаНачалаУчетаПробегаШтамповПоСчетчику) ИЛИ Дата < ДатаНачалаУчетаПробегаШтамповПоСчетчику Тогда
		Возврат;
	КонецЕсли;		
	
	// --> Начало Лико Ефимов ЕВВ 03.10.2023 Решили убрать эту проверку. Вместо нее теперь нельзя будет перейти в синий счетчик, если на машине несколько штампов
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка
	//	|ПОМЕСТИТЬ ВТ_ЯчейкиРабочихЦентров
	//	|ИЗ
	//	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	//	|ГДЕ
	//	|	НЕ РабочиеЦентры.ВидРабочегоЦентра В (&ВидыРЦИсключения)
	//	|	И РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	РабочиеЦентры.ЛикоЯчейка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	//	|	ВЫРАЗИТЬ(ТЗ.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	//	|	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА (ВЫРАЗИТЬ(ТЗ.АдресХраненияНовый КАК Справочник.СкладскиеЯчейки)) = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	//	|			ТОГДА &АдресИзШапки
	//	|		ИНАЧЕ ВЫРАЗИТЬ(ТЗ.АдресХраненияНовый КАК Справочник.СкладскиеЯчейки)
	//	|	КОНЕЦ КАК АдресХранения
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&ТЗ КАК ТЗ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.Номенклатура КАК Номенклатура,
	//	|	ВТ.Серия КАК Серия,
	//	|	ВТ.НомерСтроки КАК НомерСтроки,
	//	|	ВТ.АдресХранения КАК АдресХранения
	//	|ПОМЕСТИТЬ ВТ_ТолькоОснасткаПередающаясяНаРЦ
	//	|ИЗ
	//	|	ВТ КАК ВТ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЯчейкиРабочихЦентров КАК ВТ_ЯчейкиРабочихЦентров
	//	|		ПО ВТ.АдресХранения = ВТ_ЯчейкиРабочихЦентров.Ячейка
	//	|ГДЕ
	//	|	ВТ.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ТолькоОснасткаПередающаясяНаРЦ.Номенклатура КАК Номенклатура,
	//	|	СУММА(1) КАК КоличествоРазличныхВДокументе
	//	|ПОМЕСТИТЬ ВТ_КоличествоРазличныхВДокументе
	//	|ИЗ
	//	|	ВТ_ТолькоОснасткаПередающаясяНаРЦ КАК ВТ_ТолькоОснасткаПередающаясяНаРЦ
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ТолькоОснасткаПередающаясяНаРЦ.Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.Номенклатура КАК Номенклатура,
	//	|	ВТ.Серия КАК Серия,
	//	|	ВТ.НомерСтроки КАК НомерСтроки,
	//	|	ВТ.АдресХранения КАК АдресХранения,
	//	|	ВТ_КоличествоРазличныхВДокументе.КоличествоРазличныхВДокументе КАК КоличествоРазличныхВДокументе,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыВЯчейкахОстатки.Серия) КАК КоличествоШтамповНаМашинеСТакойЖеНоменклатурой
	//	|ПОМЕСТИТЬ ВТ_Итог
	//	|ИЗ
	//	|	ВТ_ТолькоОснасткаПередающаясяНаРЦ КАК ВТ
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоРазличныхВДокументе КАК ВТ_КоличествоРазличныхВДокументе
	//	|		ПО ВТ.Номенклатура = ВТ_КоличествоРазличныхВДокументе.Номенклатура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	//	|				&ДатаОстатков,
	//	|				(Номенклатура, Ячейка) В
	//	|					(ВЫБРАТЬ
	//	|						ВТ.Номенклатура,
	//	|						ВТ.АдресХранения
	//	|					ИЗ
	//	|						ВТ)) КАК ТоварыВЯчейкахОстатки
	//	|		ПО ВТ.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	//	|			И ВТ.Серия <> ТоварыВЯчейкахОстатки.Серия
	//	|			И ВТ.АдресХранения = ТоварыВЯчейкахОстатки.Ячейка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ.Номенклатура,
	//	|	ВТ.Серия,
	//	|	ВТ.НомерСтроки,
	//	|	ВТ.АдресХранения,
	//	|	ВТ_КоличествоРазличныхВДокументе.КоличествоРазличныхВДокументе
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	//	|	ВТ_Итог.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	//	|	ВТ_Итог.Серия КАК Серия,
	//	|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	//	|	ВТ_Итог.АдресХранения КАК АдресХранения,
	//	|	ВТ_Итог.КоличествоРазличныхВДокументе КАК КоличествоРазличныхВДокументе,
	//	|	ВТ_Итог.КоличествоШтамповНаМашинеСТакойЖеНоменклатурой КАК КоличествоШтамповНаМашинеСТакойЖеНоменклатурой
	//	|ИЗ
	//	|	ВТ_Итог КАК ВТ_Итог
	//	|ГДЕ
	//	|	(ВТ_Итог.КоличествоРазличныхВДокументе > 1
	//	|			ИЛИ ВТ_Итог.КоличествоШтамповНаМашинеСТакойЖеНоменклатурой <> 0)
	//	|";
	//
	//Запрос.УстановитьПараметр("ТЗ", Товары.Выгрузить(, "Номенклатура,Серия,НомерСтроки,АдресХраненияНовый"));
	//Запрос.УстановитьПараметр("АдресИзШапки", ?(ЗначениеЗаполнено(Получатель.ЛикоЯчейка), Получатель.ЛикоЯчейка, АдресХранения));
	//Запрос.УстановитьПараметр("ДатаОстатков", ?(РежимПроведения = РежимПроведенияДокумента.Оперативный, Дата('39991231235959'), Дата));
	//Запрос.УстановитьПараметр("ВидНоменклатурыОснастка", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
	//Запрос.УстановитьПараметр("ВидыРЦИсключения", Лико_Дополнительно.СформироватьМассивИсключенийВидовРЦДляПоискаЯчеекРЦ());
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Сообщение = Новый СообщениеПользователю;
	//	Если ВыборкаДетальныеЗаписи.КоличествоРазличныхВДокументе > 1 Тогда
	//		Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", "") + "Строка №" + ВыборкаДетальныеЗаписи.НомерСтроки + ": по номенклатуре """ + ВыборкаДетальныеЗаписи.НоменклатураНаименованиеПолное + """ вы пытаетесь передать сразу " + ВыборкаДетальныеЗаписи.КоличествоРазличныхВДокументе + " шт. Разрешено передавать не более 1 шт.";
	//	ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоШтамповНаМашинеСТакойЖеНоменклатурой <> 0 Тогда
	//		Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", "") + "Строка №" + ВыборкаДетальныеЗаписи.НомерСтроки + ": """ + ВыборкаДетальныеЗаписи.НоменклатураНаименованиеПолное + """ в ячейке """ + ВыборкаДетальныеЗаписи.АдресХранения + """ уже находится " + ВыборкаДетальныеЗаписи.КоличествоШтамповНаМашинеСТакойЖеНоменклатурой + " шт. Сначала нужно вернуть с машины на склад";
	//	Иначе
	//		Продолжить;
	//	КонецЕсли;	
	//	Сообщение.Поле = "Товары["+(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].Номенклатура";
	//	Сообщение.ПутьКДанным = "Объект";
	//	Сообщение.Сообщить();
	//	Отказ = Истина;
	//КонецЦикла;
	// <-- Конец Лико Ефимов ЕВВ 03.10.2023
	
	// --> Начало Лико Ефимов ЕВВ 27.03.2023
	ДатаНачалаПроверкиПередачиВаловВПроизводство = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПроверкиПередачиВаловВПроизводство.ЗначениеПараметра;
	Если ЗначениеЗаполнено(ДатаНачалаПроверкиПередачиВаловВПроизводство)
		И Дата >= ДатаНачалаПроверкиПередачиВаловВПроизводство
		И ЗначениеЗаполнено(ЗаказКлиента)
		И ЗначениеЗаполнено(Получатель)
		И ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство
		Тогда
		// На заказ нельзя передавать больше валов, чем указано в самом заказе (без разницы каких именно)
		// Сначала посчитаем, сколько валов передают этим документом
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
			|	ВТ_Товары.Номенклатура КАК Номенклатура
			|ИЗ
			|	ВТ_Товары КАК ВТ_Товары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|		ПО ВТ_Товары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
			|			И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""ОснасткаВид""
			|				И (ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Перечисление.Лико_ВидОснастки)) = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОснастки.Вал))
			|ГДЕ
			|	ВТ_Товары.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка";
		
		Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(, "НомерСтроки,Номенклатура"));
		Запрос.УстановитьПараметр("ВидНоменклатурыОснастка", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
		
		КоличествоВаловВДокументе = Запрос.Выполнить().Выбрать().Количество();
		Если КоличествоВаловВДокументе > 0 Тогда
			// Документом передают валы
			// Посчитаем, сколько валов в заказе
			МассивВаловВЗаказе = Новый Массив;
			Для каждого СтрокаТЧ из ЗаказКлиента.Цвета Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.Вал) Тогда
					МассивВаловВЗаказе.Добавить(СтрокаТЧ.Вал);
				КонецЕсли;
			КонецЦикла;
			КоличествоВаловВЗаказе = МассивВаловВЗаказе.Количество();
			Если КоличествоВаловВДокументе > КоличествоВаловВЗаказе Тогда
				Отказ = Истина;
				Сообщить(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", "") + "в заказе " + ЗаказКлиента.НомерБезПрефикса + " указано " + КоличествоВаловВЗаказе
							+ " шт. валов, а вы хотите передать " + КоличествоВаловВДокументе + " шт.");
			КонецЕсли;
			Если НЕ Отказ Тогда
				//Теперь посчитаем, сколько выданных на этот заказ валов находятся на машине
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура
					|ПОМЕСТИТЬ ВТ_ВалыВыданныеНаЗаказ
					|ИЗ
					|	Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
					|			ПО Лико_ПередачаТоваровТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
					|				И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""ОснасткаВид"")
					|				И ((ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Перечисление.Лико_ВидОснастки)) = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОснастки.Вал))
					|		ПО Лико_ПередачаТоваров.Ссылка = Лико_ПередачаТоваровТовары.Ссылка
					|ГДЕ
					|	Лико_ПередачаТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство)
					|	И Лико_ПередачаТоваров.Проведен
					|	И Лико_ПередачаТоваров.Получатель = &Получатель
					|	И Лико_ПередачаТоваров.ЗаказКлиента = &ЗаказКлиента
					|	И Лико_ПередачаТоваров.Ссылка <> &Ссылка
					|	И Лико_ПередачаТоваров.Дата <= &Дата
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
					|	ТоварыВЯчейкахОстатки.Номенклатура.Артикул КАК НоменклатураАртикул,
					|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
					|ИЗ
					|	РегистрНакопления.ТоварыВЯчейках.Остатки(
					|			&ДатаОстатков,
					|			Ячейка = &Ячейка
					|				И Номенклатура В
					|					(ВЫБРАТЬ
					|						Т.Номенклатура
					|					ИЗ
					|						ВТ_ВалыВыданныеНаЗаказ КАК Т)) КАК ТоварыВЯчейкахОстатки
					|ГДЕ
					|	ТоварыВЯчейкахОстатки.ВНаличииОстаток > 0";
				
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(Ссылка), Дата, Дата('39991231235959')));
				Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(Запрос.Параметры.Дата, ВидГраницы.Включая));
				Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
				Запрос.УстановитьПараметр("Получатель", Получатель);
				Запрос.УстановитьПараметр("Ячейка", ?(ЗначениеЗаполнено(Получатель.ЛикоЯчейка), Получатель.ЛикоЯчейка, АдресХранения));
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				КоличествоВаловУжеВыдано = 0;
				СтрокаВыданныхВалов = "";
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					КоличествоВаловУжеВыдано = КоличествоВаловУжеВыдано + ВыборкаДетальныеЗаписи.ВНаличииОстаток;
					СтрокаВыданныхВалов = СтрокаВыданныхВалов + ?(ЗначениеЗаполнено(СтрокаВыданныхВалов), ", ", "") + ВыборкаДетальныеЗаписи.НоменклатураАртикул;
				КонецЦикла;
				Если КоличествоВаловВДокументе + КоличествоВаловУжеВыдано > КоличествоВаловВЗаказе Тогда
					Отказ = Истина;
					Сообщить(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", "") + "в заказе " + ЗаказКлиента.НомерБезПрефикса + " указано " + КоличествоВаловВЗаказе
								+ " шт. валов, вы хотите передать " + КоличествоВаловВДокументе + " шт., а также ранее уже выдано " + КоличествоВаловУжеВыдано + " шт.: "
								+ СтрокаВыданныхВалов);
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 27.03.2023
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 24.08.2021 
 
Процедура ПриЗаписи(Отказ)
	//+m.shenderov 23.09.2016

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	


	УстановитьПривилегированныйРежим(Истина);	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику и ДополнительныеСвойства.РежимЗаписи=РежимЗаписиДокумента.Запись И  ДополнительныеСвойства.ЭтоНовый  Тогда		
		Текст =  "Создан или изменен  акт брака  N " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка) + " от " + Формат(ДатаФормированияАктаБрака, "ДФ='дд ММММ гггг'");
		Тема  = текст;  		
		Для каждого Товар  Из Товары  Цикл
			Текст=Текст+Символы.ПС+Символы.ВК;
			Текст=Текст+Товар.Номенклатура.Код+" "+Товар.Серия.ЯССМ_ОбъектНоменклатуры+ ";        Кол =  "+Строка(Товар.Количество);			
		КонецЦикла;	
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+" Причины брака: "+ ПричинаБрака;

		Адресат ="mshenderov@okil-sato.ru; OKIL_Zakupki@okil-sato.ru; Technologs@okil-sato.ru; TexSluzba@okil-sato.ru";


		Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат,,"textBody");  		

	КонецЕсли; 	
	//-m.shenderov 23.09.2016


	УстановитьСтатусзаявки(Отказ);	


	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство 
		И ДополнительныеСвойства.РежимЗаписи=РежимЗаписиДокумента.Проведение 
		И Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра  
		////И  ДополнительныеСвойства.ЭтоНовый  
		Тогда
		 НаписатьПисьмоВыданНовыйШтамп();

	 КонецЕсли; 
	 Если  (ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Или  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение)
		И ДополнительныеСвойства.РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда

		ПроверкаПомещенийСклада(Отказ);

	КонецЕсли;
		ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);


	
	УстановитьПривилегированныйРежим(Ложь);	



КонецПроцедуры

Процедура ОбработкаПроведения180326(Отказ, РежимПроведения)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// --> Начало Лико Субботин 20.04.2022
	ПроверкаТермоусадки(Отказ);
	// <-- Конец Лико Субботин 20.04.2022

	Если Не ДополнительныеСвойства.БылПроведен  Тогда	
		ОбработатьРаспоряжение(РежимЗаписиДокумента.Проведение,Отказ);
	КонецЕсли;


	Движения.ТоварыКОтгрузке.Очистить();
	Движения.ТоварыКОтгрузке.Записать();
	УдалениеДокуметовПеремещенияВКолористическую(Отказ);
	_ТаблицаСписанияНоменклатуры= СписаниеНоменклатурыПоПравилу();
	ДополнительныеСвойства.Вставить("ТаблицаСписанияНоменклатуры",_ТаблицаСписанияНоменклатуры);	
	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.Вставить("ТаблицаСписанияНоменклатуры",_ТаблицаСписанияНоменклатуры);
	
	ФормированиеДокументовОтветсвенноеХранениеБУ(ДополнительныеСвойства.РежимЗаписи,Отказ);	
	
	//+ ---> Лико2.5 m.shenderov 05.04.2022
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ,ДопПараметры);



	//- <--- Лико2.5 m.shenderov 05.04.2022

   //ОтразитьЛико_ТоварыНаОтветственномХранении(ДополнительныеСвойства,Движения,Отказ);
   ОтразитьЛико_ТоварыНаОтветственномХранении(ДополнительныеСвойства, Движения, Отказ);
    СоздатьЗаказМатериаловПроизводствоПоТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);

   СозатьНаборЗаписейИсторяФорм(Отказ);
   СозатьНаборЗаписейЗабраковкаСерий(Отказ); 
   
  		
	


	Если Не Отказ Тогда
		Если ВнутренняяПереработка И ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку  Тогда
			Лико_ОбщегоНазначенияСервер.СформироватьПередачу(Ссылка,Отказ);
		КонецЕсли;

		Если ВнутренняяПродажа И  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа и ОтражатьВБухгалтерскомУчете Тогда
			Лико_ОбщегоНазначенияСервер.СформироватьПродажу(Ссылка,Отказ);
		КонецЕсли;


		Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу Тогда

			Лико_ОбщегоНазначенияСервер.СформироватьПоступление(Ссылка,Отказ);

		КонецЕсли;
		
		
		РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СформироватьЗаписи(ЭтотОбъект, Отказ);

	КонецЕсли;


	//Если Не ДополнительныеСвойства.БылПроведен Тогда	
	//	ОбработатьРаспоряжение(РежимЗаписиДокумента.Проведение,Отказ);
	//КонецЕсли;	

	//Начало изменений Иванова А.В.
	Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра 
		Или Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра Тогда
		Если ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание И
			
			ПричинаСписания <> Справочники.Лико_ПричиныСписания.НеИспользуется Тогда 
			Лико_Планирование.СозданиеЗаказовОснасткиПриСписанииШтампов(Ссылка);
			
		КонецЕсли;	
	КонецЕсли;
	
	Обработки.ПеремещениеТоваровДоп.СформироватьДокумент(ЭтотОбъект);
		
	УстановитьСтатусзаявки(Отказ);
	Лико_ОбщегоНазначенияСервер.ПроверитьКоличествоОбъектаНоменклатуры(Товары.ВыгрузитьКолонку("Серия"));

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// --> Начало Лико Субботин 20.04.2022
	ПроверкаТермоусадки(Отказ);
	// <-- Конец Лико Субботин 20.04.2022  
	
    // <-- Начало Лико Яцун С. В. 02.04.2026 
	Если ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		ПроверкаВыдачиВаловСФормой(Отказ, РежимПроведения);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 02.04.2026   
	
	Если Не ДополнительныеСвойства.БылПроведен  Тогда	
		ОбработатьРаспоряжение(РежимЗаписиДокумента.Проведение,Отказ);
	КонецЕсли;


	Движения.ТоварыКОтгрузке.Очистить();
	Движения.ТоварыКОтгрузке.Записать();
	УдалениеДокуметовПеремещенияВКолористическую(Отказ);
	_ТаблицаСписанияНоменклатуры= СписаниеНоменклатурыПоПравилу();
	ДополнительныеСвойства.Вставить("ТаблицаСписанияНоменклатуры",_ТаблицаСписанияНоменклатуры);	
	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.Вставить("ТаблицаСписанияНоменклатуры",_ТаблицаСписанияНоменклатуры);

	ФормированиеДокументовОтветсвенноеХранениеБУ(ДополнительныеСвойства.РежимЗаписи,Отказ);	

	//+ ---> Лико2.5 m.shenderov 05.04.2022
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ,ДопПараметры);



	//- <--- Лико2.5 m.shenderov 05.04.2022

	//ОтразитьЛико_ТоварыНаОтветственномХранении(ДополнительныеСвойства,Движения,Отказ);
	ОтразитьЛико_ТоварыНаОтветственномХранении(ДополнительныеСвойства, Движения, Отказ);
	СоздатьЗаказМатериаловПроизводствоПоТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);

	СозатьНаборЗаписейИсторяФорм(Отказ);
	СозатьНаборЗаписейЗабраковкаСерий(Отказ);


	Если Не Отказ Тогда
		Если ВнутренняяПереработка И ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку  Тогда
			Лико_ОбщегоНазначенияСервер.СформироватьПередачу(Ссылка,Отказ);
		КонецЕсли;

		Если ВнутренняяПродажа И  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа и ОтражатьВБухгалтерскомУчете Тогда
			Лико_ОбщегоНазначенияСервер.СформироватьПродажу(Ссылка,Отказ);
		КонецЕсли;


		Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу Тогда

			Лико_ОбщегоНазначенияСервер.СформироватьПоступление(Ссылка,Отказ);

		КонецЕсли;	
     РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СформироватьЗаписи(ЭтотОбъект, Отказ);

	КонецЕсли;


	//Если Не ДополнительныеСвойства.БылПроведен Тогда	
	//	ОбработатьРаспоряжение(РежимЗаписиДокумента.Проведение,Отказ);
	//КонецЕсли;	

	//Начало изменений Иванова А.В.
	Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра 
		Или Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра Тогда
		Если ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание И
			ПричинаСписания <> Справочники.Лико_ПричиныСписания.НеИспользуется Тогда 
			Лико_Планирование.СозданиеЗаказовОснасткиПриСписанииШтампов(Ссылка);
		КонецЕсли;	
	КонецЕсли;

	Обработки.ПеремещениеТоваровДоп.СформироватьДокумент(ЭтотОбъект);

	УстановитьСтатусзаявки(Отказ);
	Лико_ОбщегоНазначенияСервер.ПроверитьКоличествоОбъектаНоменклатуры(Товары.ВыгрузитьКолонку("Серия"));

КонецПроцедуры

  
Процедура ПроверкаВыдачиВаловСФормой(Отказ,РежимПроведения) // <-- Начало Лико Яцун С. В. 02.04.2026

		Для каждого Стр Из Товары Цикл
			Если Стр.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оснастка") 
				И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,Стр.Номенклатура,"ОснасткаВид", Перечисления.Лико_ВидОснастки.ПустаяСсылка()) = Перечисления.Лико_ВидОснастки.Вал Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Лико_ВалыФормыСрезПоследних.Вал КАК Вал,
				|	Лико_ВалыФормыСрезПоследних.Форма КАК Форма
				|ПОМЕСТИТЬ ВТПередаютВалСФормой
				|ИЗ
				|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(, Вал = &Вал) КАК Лико_ВалыФормыСрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТПередаютВалСФормой.Вал КАК ВалПередают,
				|	ВТПередаютВалСФормой.Форма КАК ФормаВалов,
				|	Лико_ВалыФормыСрезПоследних.Вал КАК ВалНаОстаткахРЦ
				|ИЗ
				|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(, Вал <> &Вал) КАК Лико_ВалыФормыСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПередаютВалСФормой КАК ВТПередаютВалСФормой
				|		ПО Лико_ВалыФормыСрезПоследних.Форма = ВТПередаютВалСФормой.Форма
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(&ДатаОстатков, Ячейка = &Ячейка) КАК ТоварыВЯчейкахОстатки
				|		ПО Лико_ВалыФормыСрезПоследних.Вал = ТоварыВЯчейкахОстатки.Номенклатура";
				
				Запрос.УстановитьПараметр("Вал", Стр.Номенклатура);
				Запрос.УстановитьПараметр("Ячейка", Получатель.ЛикоЯчейка);
				Запрос.УстановитьПараметр("ДатаОстатков", ?(РежимПроведения = РежимПроведенияДокумента.Оперативный, Дата('39991231235959'), Дата));
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ИндексСтроки = Товары.Индекс(Стр);	
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + Символы.ПС, "") + "Строка №" + Стр.НомерСтроки 
					+ "  - " + Стр.Номенклатура + ", (" + Стр.Номенклатура.Артикул + "), форма - " + ВыборкаДетальныеЗаписи.ФормаВалов.Код + ": " + Символы.ПС + "На указанном Рабочем центре " + Получатель 
					+ " уже числится " + ВыборкаДетальныеЗаписи.ВалНаОстаткахРЦ + ", (" + ВыборкаДетальныеЗаписи.ВалНаОстаткахРЦ.Артикул + ") с таким же номером формы - " + ВыборкаДетальныеЗаписи.ФормаВалов.Код + ". Для передачи нового Вала - " + Стр.Номенклатура.Артикул + " сначала верните на склад Вал - " + ВыборкаДетальныеЗаписи.ВалНаОстаткахРЦ.Артикул;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;

КонецПроцедуры // <-- Конец Лико Яцун С. В. 02.04.2026 
	
Процедура ПроверкаТермоусадки(Отказ)


	ЭтоИкспак  = Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра;
	ЭтоТермоусадка = Получатель.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки ;
	ЕстьКраска = Ложь;
	Если  ЭтоТермоусадка и ЭтоИкспак Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
		|ГДЕ
		|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
		|	И Лико_ПередачаТоваровТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";

		Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

		РезультатЗапроса = Запрос.Выполнить();
		Если не  РезультатЗапроса.Пустой() Тогда
			ЕстьКраска = Истина	;
		КонецЕсли;

		Если ЕстьКраска Тогда

			Если не ЗначениеЗаполнено(ЗаказКлиента) Тогда
				Сообщить("установлен запрет на передачу в производство клея на машину с видом «Склейка термоусадки» без указания Заказа клиента, укажите Заказ клиента.");
				Отказ = Истина;
				Возврат;
			КонецЕсли;

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказКлиентаЦвета.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВТКлей
			|ИЗ
			|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
			|ГДЕ
			|	ЗаказКлиентаЦвета.Ссылка = &Ссылка
			|	И ЗаказКлиентаЦвета.ВидСекции = ЗНАЧЕНИЕ(справочник.лико_видысекций.склейкату)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Лико_ФормулыПантоновСостав.Номенклатура КАК Ссылка
			|ИЗ
			|	Справочник.Лико_ФормулыПантонов.Состав КАК Лико_ФормулыПантоновСостав,
			|	ВТКлей КАК ВТКлей
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТКлей.Номенклатура
			|ИЗ
			|	ВТКлей КАК ВТКлей";


			Запрос.УстановитьПараметр("Ссылка", ЗаказКлиента);
			ДопустимыеЗначения = новый массив;

			ДопустимыеЗначения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ссылка");

			Для каждого стр из Товары Цикл
				Если стр.Номенклатура.ВидНоменклатуры = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра Тогда
					Если  ДопустимыеЗначения.Найти(стр.Номенклатура) = Неопределено  Тогда
						Сообщить("В документе выбран клей (компонент клея) для термоусадки, отличающийся от данных заказа. Номер строки " + стр.НомерСтроки);
						Отказ = Истина;
						Возврат;
					КонецЕсли;

				КонецЕсли;
			КонецЦикла;

		КонецЕсли;

	КонецЕсли;




КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
   	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);




	ОбработатьРаспоряжение(РежимЗаписиДокумента.ОтменаПроведения,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПередачаСырьяПереработчику","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПоступлениеСырьяОтДавальца","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПоступлениеОтПереработчика","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПередачаДавальцу","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ОтчетДавальцу","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ВозвратСырьяДавальцу","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ВозвратСырьяОтПереработчика","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПриходныйОрдерНаТовары","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("РеализацияТоваровУслуг","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПриобретениеТоваровУслуг","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПеремещениеТоваров","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("Лико_ПередачаТоваровМеждуОрганизациями","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ВнутреннееПотребление","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("СборкаТоваров","Лико_Документ",Ссылка,Отказ);
   	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("Лико_ПередачаТоваров","Лико_Документ",Ссылка,Отказ); 
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПередачаТоваровХранителю","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПоступлениеТоваровОтХранителя","Лико_Документ",Ссылка,Отказ);


	УдалениеДокуметовПеремещенияВКолористическую(Отказ);

	УстановитьСтатусзаявки(Отказ,Истина);	

	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Распоряжение=Неопределено;	
	ЗабраковкаСерий.Очистить();
	ИнициализироватьДокумент();
	ПодписьДокументаСотрудником=Неопределено;
	Лико_Документ=Неопределено;
	БезПеремещения = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ДополнительныеСвойства.Свойство("ПараметрыПроверки") Тогда	
		ПараметрыПроверки = ДополнительныеСвойства.ПараметрыПроверки;
		НепроверяемыеРеквизитыМассив = ПараметрыПроверки.НепроверяемыеРеквизиты;
		Для Каждого СтрМас из НепроверяемыеРеквизитыМассив Цикл
			МассивНепроверяемыхРеквизитов.Добавить(СтрМас);
		КонецЦикла;
	Иначе
		
	КонецЕсли;
	
	Если Не СкладыСервер.ИспользоватьСкладскиеПомещения(Склад,Дата) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Помещение");
	КонецЕсли; 
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
	ПараметрыПроверки.ИмяТЧ = "Товары";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ,ПараметрыПроверки);
	
	
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
		ТекстСообщения = НСтр("ru='В настройках программы не включено использование упаковок номенклатуры, 
		|поэтому нельзя оформить документ по складу с адресным хранением остатков. Обратитесь к администратору'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
	//Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку и Не ВнутренняяПереработка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
	КонецЕсли;
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа и Не ВнутренняяПродажа Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");  
		//ПроверяемыеРеквизиты.Добавить("Договор");
		//Если Не ИнтерКампани Тогда
		//	ПроверяемыеРеквизиты.Добавить("СоглашениеСКлиентами");	
		//КонецЕсли;
		
	
		
	КонецЕсли;
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку и Не ВнутренняяПереработка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
	КонецЕсли;
	МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда	
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		
		
	КонецЕсли;
	МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм Или ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Получатель");
	КонецЕсли;
	//Иначе
	Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
	КонецЕсли;
	
	
	//КонецЕсли;
	
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
		МассивНепроверяемыхРеквизитов.Добавить("Получатель");                        
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		
		
	КонецЕсли;
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение  Или ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
		МассивНепроверяемыхРеквизитов.Добавить("Получатель");                        
		//МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		//МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		
		
	КонецЕсли;
	
	
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм Или
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм ИЛИ 
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеФорм ИЛИ 
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаМОЛ Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		
		
	КонецЕсли; 
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм Или
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм  Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Формы.Конверт");
		
		
	КонецЕсли;
	

	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Получатель");
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		
		
	КонецЕсли;
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Получатель"); 		
	КонецЕсли;
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Тогда
		
		Если Не ВнутренняяПереработка Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		КонецЕсли;
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Получатель"); 		
	КонецЕсли;
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа Тогда
		
		Если Не ВнутренняяПродажа Тогда
			//МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		КонецЕсли;
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка");
		МассивНепроверяемыхРеквизитов.Добавить("Получатель"); 		
	КонецЕсли;
	
	
	
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказВПереработку");
		
	КонецЕсли;
	
	Если Не (ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа И ОтражатьВБухгалтерскомУчете) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЦеныНоменклатуры");
		МассивНепроверяемыхРеквизитов.Добавить("ЦеныНоменклатуры.Цена"); 
	КонецЕсли;
	
	ЕСли ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеФорм Или ЗначениеЗаполнено(КонвертПолучатель) ТОгда
		МассивНепроверяемыхРеквизитов.Добавить("Формы.КонвертПолучатель");
	КонецЕсли;
	
	
	
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияУпаковок();
	ПараметрыПроверки.ИмяТЧ = "Товары";
	НоменклатураСервер.ПроверитьЗаполнениеУпаковок(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ, ПараметрыПроверки);
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.Лико_ПередачаТоваров);
	
	//НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,ПараметрыУказанияСерий,Отказ, МассивНепроверяемыхРеквизитов);
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство И 
		Не  Получатель.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.ГравировальныйУчасток И
		ЕстьОснастка() Тогда
		ИндексЗаказКлиента=МассивНепроверяемыхРеквизитов.Найти("ЗаказКлиента");
		Если ИндексЗаказКлиента<>Неопределено Тогда 
			МассивНепроверяемыхРеквизитов.Удалить(ИндексЗаказКлиента);
		КонецЕсли;
		
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("ДатаФормированияАктаБрака"); 
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда	
		
		
		ИндексРеквизита=МассивНепроверяемыхРеквизитов.Найти("ДатаФормированияАктаБрака");
		Если ИндексРеквизита<>Неопределено Тогда 
			МассивНепроверяемыхРеквизитов.Удалить(ИндексРеквизита);
		КонецЕсли;
		
		ИндексРеквизита=МассивНепроверяемыхРеквизитов.Найти("Партнер");
		Если ИндексРеквизита<>Неопределено Тогда 
			МассивНепроверяемыхРеквизитов.Удалить(ИндексРеквизита);
		КонецЕсли;
		
		ИндексРеквизита=МассивНепроверяемыхРеквизитов.Найти("Контрагент");
		Если ИндексРеквизита<>Неопределено Тогда 
			МассивНепроверяемыхРеквизитов.Удалить(ИндексРеквизита);
		КонецЕсли;
		
		
	КонецЕсли;	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение Тогда	
		
		
		
		ИндексРеквизита=МассивНепроверяемыхРеквизитов.Найти("Партнер");
		Если ИндексРеквизита<>Неопределено Тогда 
			МассивНепроверяемыхРеквизитов.Удалить(ИндексРеквизита);
		КонецЕсли;
		
		ИндексРеквизита=МассивНепроверяемыхРеквизитов.Найти("Контрагент");
		Если ИндексРеквизита<>Неопределено Тогда 
			МассивНепроверяемыхРеквизитов.Удалить(ИндексРеквизита);
		КонецЕсли;
		
		
	КонецЕсли;	
		Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу Тогда
			
			 ПроверяемыеРеквизиты.Добавить("АдресХранения");
			
		 КонецЕсли; 
		 Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаДавальцу И 
			  ВозвратДавальцу И БракМатериала  Тогда 
			   ПроверяемыеРеквизиты.Добавить("ПодписьДокументаСотрудником");

		 КонецЕсли;

		
	МассивНепроверяемыхРеквизитов.Добавить("Отпустил");
	
	//Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание И
	//	ТипЗнч(Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаРегистрацииПричинСписанияОснастки.ЗначениеПараметра)=Тип("Дата") И
	//	 Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаРегистрацииПричинСписанияОснастки.ЗначениеПараметра< ТекущаяДата() И
	//	 ЕстьОснасткаБезПравил() Тогда
	//	 ПроверяемыеРеквизиты.Добавить("ПричинаСписания");  	
	//	
	// КонецЕсли; 
	 
	 Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		 ПроверяемыеРеквизиты.Добавить("ПричинаСписания");  	
		
	 КонецЕсли;

	 
	 
	 	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	
	//ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиЗаполненияКоличества();
	//ПараметрыПроверки.ИмяТЧ = "Товары";
	//ПараметрыПроверки.СуффиксДопРеквизита = "";
	//ПараметрыПроверки.ПроверитьВозможностьОкругления = Ложь;
	//ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ,ПараметрыПроверки);
	//
	
	
КонецПроцедуры


Функция ЕстьОснасткаБезПравил() //+Лико m.shenderov 10.09.2021
		 
		УстановитьПривилегированныйРежим(Истина);
	Для каждого Товар Из Товары Цикл
		
		Если Товар.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра Тогда
			Возврат Истина;
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат Ложь;

	
КонецФункции //-Лико m.shenderov 10.09.2021 


#КонецОбласти

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
КонецПроцедуры

#КонецОбласти

#Область Прочее 

Процедура BrcПроверкаБлокировкиНоментклатуры (Отказ) //+Лико m.shenderov 13.10.2022
  Brc=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC");
	Brc=?(Brc=Неопределено,Ложь,Brc);
	Нпор=0;
	Если Brc и ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство и НЕ Получатель.Лико_Резак Тогда
		Для каждого Товар Из Товары Цикл
			Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК ТОгда
				Отказ=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Объект номенклатуры: "+ Строка(Товар.Серия) +" заблокирован! Товар можно только перемещать!";
				Сообщение.Поле = "Товары["+Нпор+"].Номенклатура"; //имя реквизита	
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
			Нпор=Нпор+1;			
		КонецЦикла;	 
	КонецЕсли; 
	
	Если Brc и ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		Для каждого Товар Из Товары Цикл
			//Если Товар.Номенклатура.Лико_ВидКонтактаСПищевойПродукцией=Справочники.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтактаСКонтролемСрокаГодности 
			Если ЗначениеЗаполнено(Товар.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо)
				И Товар.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо<Дата ТОгда
				Отказ=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("У Объект номенклатуры: %1 истек срок годности.Товар можно только перемещать!",Строка(Товар.Серия));
				Сообщение.Поле = "Товары["+Нпор+"].Номенклатура"; //имя реквизита	
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
			Нпор=Нпор+1;			
		КонецЦикла;	 
	КонецЕсли;



		
КонецПроцедуры //-Лико m.shenderov 13.10.2022

Процедура СформироватьСписокРегистровДляКонтроля()
	
	
	
	Массив = Новый Массив;
	
	Если Не ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении") Тогда
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			//Массив.Добавить(Движения.ТоварыКОтгрузке);
			//Движения.ТоварыКОтгрузке.ДополнительныеСвойства.Вставить("ЗапретитьКонтрольДвиженияТоварыКОтгрузкеИзменениеСводно", Истина);
			//Массив.Добавить(Движения.ТоварыНаСкладах);
			Массив.Добавить(Движения.ТоварыКОтбору);  		
			Массив.Добавить(Движения.ТоварыВЯчейках);
			
			
			
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
	
	
КонецПроцедуры

Функция СтруктураДанныхДляЗаполненияРаспоряжения(ВидОперации ) 
	Структура = Новый Структура; 	
	//Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Тогда 			
	Структура.Вставить("Распоряжение");
	Структура.Вставить("ВидОперации"); 	
	Структура.Вставить("Дата");
	Структура.Вставить("Контрагент");
	Структура.Вставить("Партнер");   
	Структура.Вставить("Партнер");
	Структура.Вставить("Получатель");
	Структура.Вставить("Организация");
	Структура.Вставить("Подразделение");
	Структура.Вставить("Проведен",Ложь);
	Структура.Вставить("ПометкаУдаления",Ложь);
	Структура.Вставить("Валюта");
	Структура.Вставить("Товары");
	Структура.Вставить("Автор");
	Структура.Вставить("Комментарий"); 
	Структура.Вставить("Склад"); 		
	//КонецЕсли;
	
	
	Возврат Структура; 			
КонецФункции 

Функция ПоляТаблицыТоваров() 
	Возврат "Номенклатура,Характеристика,Серия,Упаковка,Количество,КоличествоУпаковок";	
КонецФункции 


Функция ПоляТаблицыТоваровВозврат() 
	Возврат "Номенклатура,Характеристика,ХарактеристикаПоступления,Серия,Упаковка,Количество,КоличествоУпаковок";	
КонецФункции 


Процедура СозатьНаборЗаписейИсторяФорм(Отказ) 
	Если  Отказ Тогда 	
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм Тогда
		Движения.Лико_ИсторияДвиженийФорм.Записывать = Истина;
		
		Для Каждого ТекСтрокаФормы Из Формы Цикл
			Движение                  = Движения.Лико_ИсторияДвиженийФорм.Добавить();  			
			Движение.Период           = Дата;
			Движение.Организация      = Организация;
			Движение.Форма            = ТекСтрокаФормы.Форма;			
			Движение.Расположение     = Получатель;
			Движение.ЗаказПокупателя  = ЗаказКлиента;
			Движение.Ответственный    = АвторДокумента;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм Тогда
		Движения.Лико_ИсторияДвиженийФорм.Записывать = Истина;
		
		Для Каждого ТекСтрокаФормы Из Формы Цикл
			Движение                  = Движения.Лико_ИсторияДвиженийФорм.Добавить();  			
			Движение.Период           = Дата;
			Движение.Организация      = Организация;
			Движение.Форма            = ТекСтрокаФормы.Форма;			
			Движение.Расположение     = Справочники.Лико_Конверты.СписанныеФормы;
			;
			Движение.Ответственный    = АвторДокумента;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеФорм Тогда
		Движения.Лико_ИсторияДвиженийФорм.Записывать = Истина;
		
		Для Каждого ТекСтрокаФормы Из Формы Цикл
			ПолучательФорм = ?(ЗначениеЗаполнено(ТекСтрокаФормы.КонвертПолучатель),ТекСтрокаФормы.КонвертПолучатель,КонвертПолучатель);
			Движение                  = Движения.Лико_ИсторияДвиженийФорм.Добавить();  			
			Движение.Период           = Дата;
			Движение.Организация      = Организация;
			Движение.Форма            = ТекСтрокаФормы.Форма;			
			Движение.Расположение     = ПолучательФорм;
			Движение.ЗаказПокупателя  = ТекСтрокаФормы.Форма.Заказ;
			Движение.Ответственный    = АвторДокумента;
		КонецЦикла;
		
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
КонецПроцедуры 

Процедура СозатьНаборЗаписейЗабраковкаСерий(Отказ) 
	Если  Отказ Тогда 	
		Возврат;
	КонецЕсли;
//+ ---> Лико m.shenderov 12.12.2022
	УстановитьПривилегированныйРежим(Истина);	
	Движения.Лико_БракСерий.Записывать = Истина;
	
	Для каждого Материал Из ЗабраковкаСерий  Цикл 
		
		Движение 						=	Движения.Лико_БракСерий.Добавить();
		Движение.Серия					=	Материал.Серия;
		Движение.ОбъектНоменклатуры		=	Материал.Серия.ЯССМ_ОбъектНоменклатуры;
		Движение.Документ				=	Ссылка;
		Движение.ОписаниеДефекта		= 	Материал.ОписаниеДефекта;  
		Движение.Решение				=	Материал.Решение;
		Движение.КомментарийКРешению	= 	Материал.КомментарийКРешению; 		
		
	КонецЦикла; 	
	//- <--- Лико m.shenderov 12.12.2022	
КонецПроцедуры 


Процедура  СписаниеИзЭксплуатации();
	СписаниеИзЭксплуатации.Очистить();	
	
	////Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
	////	Возврат;
	////КонецЕсли;
	////
	////Запрос = Новый Запрос;
	////Запрос.Текст = 
	////"ВЫБРАТЬ
	////|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	////|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	////|	СУММА(Лико_ПередачаТоваровТовары.Количество) КАК Количество,
	////|	Лико_ПередачаТоваровТовары.Ссылка.Организация КАК Организация,
	////|	Лико_ПередачаТоваровТовары.Ссылка.Подразделение КАК Подразделение
	////|ПОМЕСТИТЬ ВтТМЦ
	////|ИЗ
	////|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	////|ГДЕ
	////|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	////|	И Лико_ПередачаТоваровТовары.Номенклатура.ВидНоменклатуры.Лико_ТМЦ_ВЭксплуатации
	////|
	////|СГРУППИРОВАТЬ ПО
	////|	Лико_ПередачаТоваровТовары.Номенклатура,
	////|	Лико_ПередачаТоваровТовары.Характеристика,
	////|	Лико_ПередачаТоваровТовары.Ссылка.Организация,
	////|	Лико_ПередачаТоваровТовары.Ссылка.Подразделение
	////|
	////|ИНДЕКСИРОВАТЬ ПО
	////|	Организация,
	////|	Подразделение,
	////|	Номенклатура,
	////|	Характеристика
	////|;
	////|
	////|////////////////////////////////////////////////////////////////////////////////
	////|ВЫБРАТЬ
	////|	ТМЦВЭксплуатацииОбороты.Организация КАК Организация,
	////|	ТМЦВЭксплуатацииОбороты.Подразделение КАК Подразделение,
	////|	ТМЦВЭксплуатацииОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	////|	ТМЦВЭксплуатацииОбороты.Номенклатура КАК Номенклатура,
	////|	ТМЦВЭксплуатацииОбороты.Характеристика КАК Характеристика,
	////|	ТМЦВЭксплуатацииОбороты.Партия КАК Партия,
	////|	СУММА(ТМЦВЭксплуатацииОбороты.КоличествоОборот) КАК КоличествоПартия,
	////|	МАКСИМУМ(ВтТМЦ.Количество) КАК Количество
	////|ИЗ
	////|	РегистрНакопления.ТМЦВЭксплуатации.Обороты(
	////|			,
	////|			&Дата,
	////|			,
	////|			(Организация, Подразделение, Номенклатура, Характеристика) В
	////|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	////|					ВтТМЦ.Организация КАК Организация,
	////|					ВтТМЦ.Подразделение КАК Подразделение,
	////|					ВтТМЦ.Номенклатура КАК Номенклатура,
	////|					ВтТМЦ.Характеристика КАК Характеристика
	////|				ИЗ
	////|					ВтТМЦ КАК ВтТМЦ)) КАК ТМЦВЭксплуатацииОбороты
	////|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТМЦ КАК ВтТМЦ
	////|		ПО ТМЦВЭксплуатацииОбороты.Организация = ВтТМЦ.Организация
	////|			И ТМЦВЭксплуатацииОбороты.Подразделение = ВтТМЦ.Подразделение
	////|			И ТМЦВЭксплуатацииОбороты.Номенклатура = ВтТМЦ.Номенклатура
	////|			И ТМЦВЭксплуатацииОбороты.Характеристика = ВтТМЦ.Характеристика
	////|
	////|СГРУППИРОВАТЬ ПО
	////|	ТМЦВЭксплуатацииОбороты.Организация,
	////|	ТМЦВЭксплуатацииОбороты.Подразделение,
	////|	ТМЦВЭксплуатацииОбороты.ФизическоеЛицо,
	////|	ТМЦВЭксплуатацииОбороты.Номенклатура,
	////|	ТМЦВЭксплуатацииОбороты.Характеристика,
	////|	ТМЦВЭксплуатацииОбороты.Партия
	////|ИТОГИ
	////|	МИНИМУМ(Количество)
	////|ПО
	////|	Номенклатура,
	////|	Характеристика";
	////Запрос.УстановитьПараметр("Ссылка",Ссылка );
	////Запрос.УстановитьПараметр("Дата",Дата );
	
	////РезультатЗапроса = Запрос.Выполнить();
	////ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	////Пока ВыборкаНоменклатура.Следующий() Цикл
	////	ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	////	Пока ВыборкаХарактеристика.Следующий() Цикл
	////		ОсталосьСписать=ВыборкаХарактеристика.Количество;
	////		Выборка=ВыборкаХарактеристика.Выбрать();
	////		Пока Выборка.Следующий() Цикл 
	////			Если ОсталосьСписать<=0 Тогда
	////				Прервать;
	////			КонецЕсли;				
	////			Тмц=СписаниеИзЭксплуатации.Добавить();
	////			ЗаполнитьЗначенияСвойств(ТМц,Выборка,,"Количество");
	////			Списать=Мин(ОсталосьСписать,Выборка.КоличествоПартия);
	////			Тмц.Количество=Списать;
	////			ОсталосьСписать=ОсталосьСписать-Списать;
	////		КонецЦикла; 			
	////	КонецЦикла;
	////КонецЦикла;
	////
КонецПроцедуры 

Процедура ТоварыБезЭксплуатации(ДанныеДляЗаполнения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровТовары.Упаковка КАК Упаковка,
	|	Лико_ПередачаТоваровТовары.Количество КАК Количество,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	&ТЗ КАК Лико_ПередачаТоваровТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Номенклатура КАК Номенклатура,
	|	Вт.Характеристика КАК Характеристика,
	|	Вт.Упаковка КАК Упаковка,
	|	СУММА(Вт.Количество) КАК Количество,
	|	СУММА(Вт.КоличествоУпаковок) КАК КоличествоУпаковок
	|ИЗ
	|	Вт КАК Вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номен
	|		ПО Вт.Номенклатура = Номен.Ссылка
	|ГДЕ
	|	НЕ Номен.Ссылка В (&ТмцВЭксплуатации)
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Номенклатура,
	|	Вт.Характеристика,
	|	Вт.Упаковка";
	ТзТовары=Товары.Выгрузить();	
	Запрос.УстановитьПараметр("ТЗ",ТзТовары);
	Запрос.УстановитьПараметр("ТмцВЭксплуатации", Документы.Лико_ПередачаТоваров.ПолучитьНоменклатуруПодПередачуВЭксплуатацию(ТзТовары,Ссылка)); 
	ДанныеДляЗаполнения.Товары= Запрос.Выполнить().Выгрузить();
	
	
КонецПроцедуры


Процедура ТоварыЭксплуатации(ДанныеДляЗаполнения) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровТовары.Упаковка КАК Упаковка,
	|	Лико_ПередачаТоваровТовары.Количество КАК Количество,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	&ТЗ КАК Лико_ПередачаТоваровТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Номенклатура КАК Номенклатура,
	|	Вт.Характеристика КАК Характеристика,
	|	Вт.Упаковка КАК Упаковка,
	|	СУММА(Вт.Количество) КАК Количество,
	|	СУММА(Вт.КоличествоУпаковок) КАК КоличествоУпаковок
	|ИЗ
	|	Вт КАК Вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номен
	|		ПО Вт.Номенклатура = Номен.Ссылка
	|ГДЕ
	|	(Номен.ВидНоменклатуры.Лико_ТМЦ_ВЭксплуатации
	|			ИЛИ Номен.Лико_ТМЦ_ВЭксплуатации)
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Номенклатура,
	|	Вт.Характеристика,
	|	Вт.Упаковка";
	Запрос.УстановитьПараметр("ТЗ",Товары.Выгрузить());
	
	ДанныеДляЗаполнения.Товары= Запрос.Выполнить().Выгрузить();
	
	
	
КонецПроцедуры 

Функция ЕстьНоменклатураСписания() 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ВидНоменклатуры.Лико_ТМЦ_ВЭксплуатации
	|	И Номенклатура.Ссылка В (&Товары)";
	Запрос.УстановитьПараметр("Товары",Товары.ВыгрузитьКолонку("Номенклатура"));
	Возврат Не  Запрос.Выполнить().Пустой();
	
КонецФункции 

// Процедура формирования движений по регистру "Лико_ОснасткаВыданнаяНаЗаказ".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура ОтразитьЛико_Лико_ОснасткаПоЗаказу(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ОснасткаПоЗаказу;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения_Лико_ОснасткаПоЗаказу = Движения.Лико_ОснасткаПоЗаказу;
	Движения_Лико_ОснасткаПоЗаказу.Записывать = Истина;
	Движения_Лико_ОснасткаПоЗаказу.Загрузить(Таблица);
	
КонецПроцедуры

//Процедура формирования движений по регистру "Лико_СписаниеНаЗаказ".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура ОтразитьЛико_Лико_СписаниеНаЗаказ(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_СписаниеНаЗаказ;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения_Лико_СписаниеНаЗаказ = Движения.Лико_СписаниеНаЗаказ;
	Движения_Лико_СписаниеНаЗаказ.Записывать = Истина;
	Движения_Лико_СписаниеНаЗаказ.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьДвиженияЛико_КонтрольВозвратовПоставщику(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_КонтрольВозвратовПоставщику;
	
	Если Отказ
		Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Лико_КонтрольВозвратовПоставщику.Записывать = Истина;
	Движения.Лико_КонтрольВозвратовПоставщику.Загрузить(Таблица);
	
КонецПроцедуры




//Процедура формирования движений по регистру "Лико_ТоварыНаОтветственномХранении".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура ОтразитьЛико_ТоварыНаОтветственномХранении(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ОрганизацияДокумента   		= Неопределено;
	Таблица                		= Движения.Лико_ТоварыНаОтветственномХранении.Выгрузить();
	ТаблицаТоварыНаСкладах 		= Движения.ТоварыНаСкладах.Выгрузить();
	ПерезаписатьТоварыНаСкладах	= Ложь;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;  	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("Упаковка",Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТЗ.Колонки.Добавить("СкладОтправитель",Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("СкладПолучатель",Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТЗ.Колонки.Добавить("КоличествоУпаковок",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТзПриход=Тз.Скопировать();
	ТзРасход=Тз.Скопировать();
	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 

	СкладПолучатель=Неопределено;
	СкладОтправитель=Неопределено;
	
	Для каждого СтрТаблицы Из Таблица  Цикл 
		Если СтрТаблицы.ВидДвижения=ВидДвиженияНакопления.Приход Тогда
			СкладПолучатель= СтрТаблицы.Склад;
			
		Иначе
			СкладОтправитель= СтрТаблицы.Склад; 
		КонецЕсли;
		Если ЗначениеЗаполнено(СкладПолучатель) И ЗначениеЗаполнено(СкладОтправитель) Тогда
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	
	СкладОтправитель =?(ЗначениеЗаполнено(СкладОтправитель),СкладОтправитель,Товары[0].СкладОтправитель); 
	СкладПолучатель  =?(ЗначениеЗаполнено(СкладПолучатель),СкладПолучатель,Товары[0].СкладПолучатель);
	
	
	
	
	Для каждого СтрТаблицы Из Таблица  Цикл 
		
		
		Если СтрТаблицы.ВидДвижения=ВидДвиженияНакопления.Приход Тогда
					Если СкладОтправитель=СкладПолучатель Тогда
				Продолжить;
			КонецЕсли;
			
			НовяСтрТз=ТзПриход.Добавить();
			НовяСтрТз.СкладОтправитель=СкладОтправитель;
			НовяСтрТз.СкладПолучатель=СкладПолучатель;
			
			Движение 				= НаборЗаписей.Добавить(); 
			Движение.Регистратор 	= Ссылка; 
			Движение.Период			= Дата;
			Движение.Организация	= СтрТаблицы.ОрганизацияОтветственногоХранения;
			ОрганизацияДокумента    =  СтрТаблицы.Организация;
			// Заполнить счет дебета. 
			Движение.СчетДт 		= ПланыСчетов.Хозрасчетный.ТМЦнаскладах;
			// Заполнить аналитику счета дебета. 
			Движение.СубконтоДт.Контрагенты 	= 	УправлениеСвойствами.ЗначениеСвойства(ОрганизацияДокумента,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2"); 
			Движение.СубконтоДт.Номенклатура 	= 	СтрТаблицы.Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура; 
			//Движение.СубконтоДт.Склады 			= УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_СкладОтветственногоХраненияBRCЛикофлекс"); 
			Движение.СубконтоДт.Склады 			= СкладПолучатель; 

			
			Движение.КоличествоДт				=	СтрТаблицы.Количество;
			// Балансовый ресурс. 
			Движение.Сумма 						= 	СтрТаблицы.Сумма; 
			// Реквизиты.Движение.НомерЖурнала = "БК"; 
			Движение.Содержание 				= "Поступление на ответственное хранение BRC"; 
			
			
		Иначе
				
			Если СкладОтправитель=СкладПолучатель Тогда
				Продолжить;
			КонецЕсли;
			
			НовяСтрТз=ТзРасход.Добавить();
			НовяСтрТз.СкладОтправитель=СкладОтправитель;
			НовяСтрТз.СкладПолучатель=СкладПолучатель;
			
			Движение 				= НаборЗаписей.Добавить(); 
			Движение.Регистратор 	= Ссылка; 
			Движение.Период			= Дата;
			Движение.Организация	= СтрТаблицы.ОрганизацияОтветственногоХранения;
			ОрганизацияДокумента    =  СтрТаблицы.Организация;
			// Заполнить счет дебета. 
			Движение.СчетКт 		= ПланыСчетов.Хозрасчетный.ТМЦнаскладах;
			// Заполнить аналитику счета дебета. 
			Движение.СубконтоКт.Контрагенты 	= 	УправлениеСвойствами.ЗначениеСвойства(ОрганизацияДокумента,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2"); 
			Движение.СубконтоКт.Номенклатура 	= 	СтрТаблицы.Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура; 
			Движение.СубконтоКт.Склады 			= 	СкладОтправитель; 
					
			
			Движение.КоличествоКт				=	СтрТаблицы.Количество;
			// Балансовый ресурс. 
			Движение.Сумма 						= 	СтрТаблицы.Сумма; 
			// Реквизиты.Движение.НомерЖурнала = "БК"; 
			Движение.Содержание 				= "Расход с  ответственного хранения BRC";   
			
			
		КонецЕсли;	
		ОрганизацияВладелецПолучатель	= УправлениеСвойствами.ЗначениеСвойства(СкладПолучатель,"ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
		ОрганизацияВладелецОтправитель	= УправлениеСвойствами.ЗначениеСвойства(СкладОтправитель,"ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
			
		НовяСтрТз.Номенклатура		=СтрТаблицы.Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура;
		НовяСтрТз.Характеристика	=СтрТаблицы.Серия.ЯССМ_ОбъектНоменклатуры.Характеристика;
		НовяСтрТз.Упаковка			=СтрТаблицы.Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура.ЕдиницаИзмерения;
		НовяСтрТз.Количество		=СтрТаблицы.Количество;
		НовяСтрТз.КоличествоУпаковок=СтрТаблицы.Количество; 		
			
		
		Если ЗначениеЗаполнено(ОрганизацияВладелецПолучатель) И  ОрганизацияВладелецПолучатель=ОрганизацияВладелецОтправитель Тогда
			Продолжить;
		КонецЕсли;
		

		
		НоваяСтрокаТоварыНаСкладах				=ТаблицаТоварыНаСкладах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТоварыНаСкладах,НовяСтрТз);
		НоваяСтрокаТоварыНаСкладах.ВидДвижения	=?(СтрТаблицы.ВидДвижения=ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		НоваяСтрокаТоварыНаСкладах.Период		=Дата;
		НоваяСтрокаТоварыНаСкладах.Серия		=СтрТаблицы.Серия;
		НоваяСтрокаТоварыНаСкладах.Склад		=?(СтрТаблицы.ВидДвижения=ВидДвиженияНакопления.Приход,НовяСтрТз.СкладОтправитель,НовяСтрТз.СкладПолучатель);
		НоваяСтрокаТоварыНаСкладах.ВНаличии		=СтрТаблицы.Количество;		
		ПерезаписатьТоварыНаСкладах				=Истина;  		
	КонецЦикла;
	
	
	// Записать набор записей. 
	НаборЗаписей.Записать();	
	
	Если ТзПриход.Количество()>0 Тогда	
		ДанныеЗаполнения = Новый Структура;  
		ДанныеЗаполнения.Вставить("Организация",  ОрганизацияДокумента);
		ДанныеЗаполнения.Вставить("СкладОтправитель",ТзПриход[0].СкладОтправитель);
		ДанныеЗаполнения.Вставить("СкладПолучатель",ТзПриход[0].СкладПолучатель);
		ДанныеЗаполнения.Вставить("Товары",ТзПриход); 
		СоздатьРедактироватьПеремещениеНаОтветственноеХранение(ДанныеЗаполнения,Отказ);
		Если ДополнительныеСвойства.ЭтоНовый Тогда
			НаписатьПисмоОПередачеТМЦНаСкладОтветственногоХранения(ТзПриход); 
		КонецЕсли;
		
		
		
	ИначеЕсли ТзРасход.Количество()>0 Тогда		
		ДанныеЗаполнения = Новый Структура;  
		ДанныеЗаполнения.Вставить("Организация",ОрганизацияДокумента);
		ДанныеЗаполнения.Вставить("СкладОтправитель",ТзРасход[0].СкладОтправитель);
		ДанныеЗаполнения.Вставить("СкладПолучатель",ТзРасход[0].СкладПолучатель);
		ДанныеЗаполнения.Вставить("Товары",ТзРасход); 
		СоздатьРедактироватьПеремещениеНаОтветственноеХранение(ДанныеЗаполнения,Отказ);
	КонецЕсли;
	
	
	
	
	ДвиженияЛико_ТоварыНаОтветственномХранении = Движения.Лико_ТоварыНаОтветственномХранении;
	ДвиженияЛико_ТоварыНаОтветственномХранении.Записывать = Истина;
	ДвиженияЛико_ТоварыНаОтветственномХранении.Загрузить(Таблица);
	
	
	Если ПерезаписатьТоварыНаСкладах Тогда
		
		ДвиженияТоварыНаСкладах = Движения.ТоварыНаСкладах;
		ДвиженияТоварыНаСкладах.Записывать = Истина;
		ДвиженияТоварыНаСкладах.Загрузить(ТаблицаТоварыНаСкладах);
		Для каждого Движение Из ДвиженияТоварыНаСкладах Цикл
		
			 Движение.Активность=Истина;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура НаписатьПисмоОПередачеТМЦНаСкладОтветственногоХранения(ТзПриход)
	УстановитьПривилегированныйРежим(Истина);	
	
	Текст =  "Перемещение на склад ответственного хранения " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка) + " от " + Формат(ДатаФормированияАктаБрака, "ДФ='дд ММММ гггг'");
	Тема  = текст;  		
	Для каждого Товар  Из ТзПриход  Цикл
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+Товар.Номенклатура.Код+" "+Товар.Номенклатура+" "+Товар.характеристика+";        Кол =  "+Строка(Товар.Количество);			
	КонецЦикла;	
	Текст=Текст+Символы.ПС+Символы.ВК;
	//Текст=Текст+" Причины брака: "+ ПричинаБрака;
	
	
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(Справочники.Лико_ТипыСообщений.ПеремещениеНаСкладОтветственнгоХраненияИксПак,Организация);
	Если ЗначениеЗаполнено(Адресат) Тогда 
		Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат,,"textBody");  		
	КонецЕсли;
	; 	
	//-m.shenderov 23.09.2016
	
	
	
	
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	
КонецПроцедуры


Процедура СтруктураПараметровЗаписиОбъекта() 	
	
	Если Не ДополнительныеСвойства.Свойство("ЕстьВопросыПередЗаписью") ТОгда
		ДополнительныеСвойства.Вставить("ЕстьВопросыПередЗаписью", Ложь);
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("НовыйОбъект") ТОгда
		ДополнительныеСвойства.Вставить("НовыйОбъект", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ПринудительноЗакрытьФорму") ТОгда
		ДополнительныеСвойства.Вставить("ПринудительноЗакрытьФорму", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("РежимЗаписи") ТОгда
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);		
	КонецЕсли; 	
	Если Не ДополнительныеСвойства.Свойство("РежимПроведения") ТОгда
		ДополнительныеСвойства.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный); 	
	КонецЕсли;
	
Конецпроцедуры
  

Процедура УстановитьСтатусзаявки(Отказ, УдалениеДОкументаПоЗаявке=Ложь)
	Если Не Отказ Тогда
		Если ЗначениеЗаполнено(ЗаявкаНаСклад) Тогда
			ДокументОбъект=ЗаявкаНаСклад.ПолучитьОбъект();
			Если  УдалениеДОкументаПоЗаявке Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("УдалениеДОкументаПоЗаявке",Истина);
			КонецЕсли;
				ДокументОбъект.ДополнительныеСвойства.Вставить("УстановитьСтатусзаявки",Истина);

			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;

	КонецЕсли;



КонецПроцедуры


Функция ЕстьОснастка()
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Товар Из Товары Цикл
		
		Если Товар.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра Тогда
			Возврат Истина;
		КонецЕсли;
		Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура, Ссылка);
		Если ЗначениеЗаполнено(Правило) И Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПодЗаказ Тогда
			Возврат Истина; 			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


Функция ОпределитьЯчейкуДляПереработки()	 //+Лико m.shenderov 01/11/2019
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку 
		И Не ВнутренняяПереработка 
		и Не ЗначениеЗаполнено(ЗаказВПереработку) Тогда
		Возврат НайтиСкладскуюЯчейкуДляКонтрагента();
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	
КонецФункции //-Лико m.shenderov 01/11/2019

Функция ОпределитьЯчейкуМОЛ()	 //+Лико m.shenderov 01/11/2019
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаМОЛ  Тогда
		Возврат НайтиСкладскуюЯчейкуМОЛ();
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	
КонецФункции //-Лико m.shenderov 01/11/2019 


Функция НайтиСкладскуюЯчейкуДляКонтрагента180336() //+Лико m.shenderov 01/11/2019
	ПомещениеПереработки=НайтиПомещениеПереработки(); 
	СкладПереработки = НайтиСкладПереработки();
	Если Не ЗначениеЗаполнено(ПомещениеПереработки) И  Не ЗначениеЗаполнено(СкладПереработки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
		Ячейка=НайтиСкладскуЯчейкуПереработка(ПомещениеПереработки,СкладПереработки);
		
		
	
	
	Если Не ЗначениеЗаполнено(Ячейка) ТОгда
		Ячейка=СоздатьСкладскуюЯчейкуДляПереработки(ПомещениеПереработки,СкладПереработки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СкладПереработки) Тогда
		
		Для каждого Товар Из Товары Цикл
			Товар.СкладПолучатель = СкладПереработки;
			
		КонецЦикла;
		
	КонецЕсли;
	
		
	
	Возврат Ячейка;	 
	
КонецФункции //-Лико m.shenderov 01/11/2019 

Функция НайтиСкладскуюЯчейкуДляКонтрагента()
	ПомещениеПереработки=НайтиПомещениеПереработки(); 
	СкладПереработки = НайтиСкладПереработки();
	Если Не ЗначениеЗаполнено(ПомещениеПереработки) И  Не ЗначениеЗаполнено(СкладПереработки) Тогда
		
		Возврат АдресХранения;
	КонецЕсли;


	Ячейка=НайтиСкладскуЯчейкуПереработка(ПомещениеПереработки,СкладПереработки);




	Если Не ЗначениеЗаполнено(Ячейка) ТОгда
		Ячейка=СоздатьСкладскуюЯчейкуДляПереработки(ПомещениеПереработки,СкладПереработки);
	КонецЕсли;

	Если ЗначениеЗаполнено(СкладПереработки) Тогда

		Для каждого Товар Из Товары Цикл
			Товар.СкладПолучатель = СкладПереработки;

		КонецЦикла;

	КонецЕсли;



	Возврат Ячейка;	 

КонецФункции


Функция НайтиСкладскуюЯчейкуМОЛ() //+Лико m.shenderov 01/11/2019
	ПомещениеМОЛ=НайтиПомещениеМОЛ();
	Если Не ЗначениеЗаполнено(ПомещениеМОЛ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ячейка=НайтиСкладскуЯчейкуМОЛ();
	
	Если Не ЗначениеЗаполнено(Ячейка) ТОгда
		Ячейка=СоздатьСкладскуюЯчейкуМОЛ(ПомещениеМОЛ);
		СотрудникОбъект=Сотрудник.ПолучитьОбъект();
		СотрудникОбъект.Лико_Ячейка=Ячейка;
		СотрудникОбъект.Записать();
	КонецЕсли;
	
	Возврат Ячейка;	 
	
КонецФункции //-Лико m.shenderov 01/11/2019 



Функция НайтиПомещениеПереработки() //+Лико m.shenderov 01/11/2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеПомещения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеПомещения КАК СкладскиеПомещения
	|ГДЕ
	|	СкладскиеПомещения.Владелец = &Склад
	|	И СкладскиеПомещения.Лико_Организация = &Организация
	|	И СкладскиеПомещения.Лико_ТипСклада = &Лико_ТипСклада";
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("Лико_ТипСклада",Перечисления.Лико_ТипСклада.Переработка );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 01/11/2019 

Функция НайтиСкладПереработки() //+Лико m.shenderov 01/11/2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Лико_Площадка.Организация = &Организация
	|	И Склады.Лико_ТипСклада = &Лико_ТипСклада";
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("Лико_ТипСклада",Перечисления.Лико_ТипСклада.Переработка );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 01/11/2019 




Функция НайтиПомещениеМОЛ() //+Лико m.shenderov 01/11/2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеПомещения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеПомещения КАК СкладскиеПомещения
	|ГДЕ
	|	СкладскиеПомещения.Владелец = &Склад
	|	И СкладскиеПомещения.Лико_Организация = &Организация
	|	И СкладскиеПомещения.Лико_ТипСклада = &Лико_ТипСклада";
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("Лико_ТипСклада",Перечисления.Лико_ТипСклада.МОЛ );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 01/11/2019 



Функция НайтиСкладскуЯчейкуПереработка(ПомещениеПереработки,СкладПереработки=Неопределено) //+Лико m.shenderov 01/11/2019
	Если Не ЗначениеЗаполнено(СкладПереработки) Тогда
		
		СкладПереработки = Склад;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПомещениеПереработки) Тогда
		
		ПомещениеПереработки = Справочники.СкладскиеПомещения.ПустаяСсылка();
		
	КонецЕсли;

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Лико_Контрагент = &Контрагент
	|	И СкладскиеЯчейки.Помещение = &Помещение
	|	И СкладскиеЯчейки.Владелец = &Склад";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Запрос.УстановитьПараметр("Помещение",ПомещениеПереработки );
	Запрос.УстановитьПараметр("Склад",СкладПереработки );
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 01/11/2019 



Функция НайтиСкладскуЯчейкуМОЛ() //+Лико m.shenderov 01/11/2019
	Возврат Сотрудник.Лико_Ячейка;	
	
КонецФункции //-Лико m.shenderov 01/11/2019 



Функция СоздатьСкладскуюЯчейкуДляПереработки(ПомещениеПереработки,СкладПереработки=Неопределено) //+Лико m.shenderov 01/11/2019

	Если Не ЗначениеЗаполнено(СкладПереработки) Тогда
		СкладПереработки = Склад;
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Истина);
	СпрОбъект=Справочники.СкладскиеЯчейки.СоздатьЭлемент();
	СпрОбъект.Владелец=СкладПереработки;
	СпрОбъект.Помещение=ПомещениеПереработки;
	СпрОбъект.Наименование=Организация.Префикс+" "+Контрагент.Наименование;
	СпрОбъект.ТипСкладскойЯчейки=Перечисления.ТипыСкладскихЯчеек.Хранение; 
	СпрОбъект.Типоразмер=Справочники.ТипоразмерыЯчеек.НайтиПоНаименованию("Ячейка"); 				
	СпрОбъект.Код=СпрОбъект.Наименование;
	СпрОбъект.Лико_Контрагент=Контрагент;
	
	СпрОбъект.Записать();
	Возврат СпрОбъект.Ссылка;
	
	
	
КонецФункции //-Лико m.shenderov 01/11/2019 



Функция СоздатьСкладскуюЯчейкуМОЛ(ПомещениеМОЛ) //+Лико m.shenderov 01/11/2019
	
	УстановитьПривилегированныйРежим(Истина);
	
	СпрОбъект=Справочники.СкладскиеЯчейки.СоздатьЭлемент();
	СпрОбъект.Владелец=Склад;
	СпрОбъект.Помещение=ПомещениеМОЛ;
	СпрОбъект.Наименование=Сотрудник.Наименование;
	СпрОбъект.ТипСкладскойЯчейки=Перечисления.ТипыСкладскихЯчеек.Хранение; 
	СпрОбъект.Типоразмер=Справочники.ТипоразмерыЯчеек.НайтиПоНаименованию("Ячейка"); 				
	СпрОбъект.Код=СпрОбъект.Наименование;
	СпрОбъект.Лико_Контрагент=Контрагент;
	
	СпрОбъект.Записать();
	Возврат СпрОбъект.Ссылка;
	
	
	
КонецФункции //-Лико m.shenderov 01/11/2019 



Функция ОрганизацияЯчейки() //+Лико m.shenderov 18/11/2019  
	
	ячОрганизация=Товары[0].АдресХранения.Помещение.Лико_Организация;
	Если ЗначениеЗаполнено(ячОрганизация) Тогда
		Возврат ячОрганизация;
	Иначе
		Возврат Организация;
	КонецЕсли;
	
	
КонецФункции  //-Лико m.shenderov 18/11/2019

Процедура ПроверкаЯССМСклада(Отказ,РежимЗаписи,РежимПроведения) //+Лико m.shenderov 12/12/2019
	
	Если Не Лико_ОбщегоНазначенияСервер.АдминистраторСклада()  Тогда
		Если  НЕ ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда
			
			Расшифровка = "";			
			МассивОбъектов = Товары.ВыгрузитьКолонку("Серия");
			
			МожноПровестиДокумент = Лико_ОбщегоНазначенияСервер.ПроверитьВозможностьПроведенияДокумента(ЭтотОбъект, МассивОбъектов, РежимЗаписи, РежимПроведения, Расшифровка);
			Если Не МожноПровестиДокумент Тогда
				
				СообщениеПользователю = "Невозможно провести документ на это время! Пояснение: " + Расшифровка;
				Сообщить(СообщениеПользователю);			
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 12/12/2019

Процедура ОбработкаВидаОперации(Отказ,РежимЗаписи,РежимПроведения)

	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
		|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Серия В (&Серии)) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный";
		Запрос.УстановитьПараметр("Дата",Дата);
		Запрос.УстановитьПараметр("Серии",ТОвары.ВыгрузитьКолонку("Серия"));

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Структура = Новый Структура;
			Структура.Вставить("Серия",Выборка.Серия);
			НайденныеСтроки=Товары.НайтиСтроки(Структура);
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл

				Если Выборка.Ячейка<>НайденнаяСтрока.АдресХранения Тогда
					НайденнаяСтрока.АдресХранения=Выборка.Ячейка;
				КонецЕсли;		
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;



	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаФорм Или 
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СписаниеФорм Или 
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеФорм Тогда 		
		Товары.Очистить();
	Иначе
		Формы.Очистить();
	КонецЕсли;

	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		Организация=ОрганизацияЯчейки();
	КонецЕсли;	


	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение и РежимЗаписи = РежимЗаписиДокумента.Проведение ТОгда
		Если Не ЗначениеЗаполнено(АдресХранения) Тогда
			АдресХранения=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_СкладОтветственногоХранениеУПоставщика");

		КонецЕсли;

	КонецЕсли;

	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа и РежимЗаписи = РежимЗаписиДокумента.Проведение ТОгда
		Ликофлекс=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра;
		ИксПак=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра;
		Если Контрагент=УправлениеСвойствами.ЗначениеСвойства(Ликофлекс,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") И Организация=ИксПак  Тогда
			ВнутренняяПродажа=Истина;

			Если Не ЗначениеЗаполнено(АдресХранения) Тогда
				АдресХранения=УправлениеСвойствами.ЗначениеСвойства(Ликофлекс,"Лико_ЗонаПриемкиСИМ"); 			
			КонецЕсли;

		КонецЕсли;


		Если Не ЗначениеЗаполнено(АдресХранения) Тогда
			//АдресХранения=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_СкладОтветственногоХранениеУПоставщика"); 			
		КонецЕсли; 		
	КонецЕсли;



КонецПроцедуры


Процедура ОбработкаСерий() //+Лико m.shenderov 12/12/2019
	
	Для каждого Товар Из Товары Цикл
		Если ЗначениеЗаполнено(Товар.Серия) Тогда	
			Товар.СтатусУказанияСерий=8;
		Иначе
			Товар.СтатусУказанияСерий=7;
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры //-Лико m.shenderov 12/12/2019


Процедура ЗаполнитьРеквизитыДляПечати() //+Лико m.shenderov 17.04.2020
	УстановитьПривилегированныйРежим(Истина);	
	ФизЛицо = АвторДокумента;
	Отпустил = АвторДокумента;
	ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(Отпустил,Организация,Дата);
	Если НЕ ЗначениеЗаполнено(ОтпустилДолжность) Тогда
		ОтпустилДолжность = "Кладовщик";
	КонецЕсли;
	//НовоеРаспоряжение.Менеджер = Автор;
	Руководитель 		= Лико_Дополнительно.НайтиЛицоСПравомПодписи(Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Отпустил,Дата); 
	ГлавныйБухгалтер 	= Лико_Дополнительно.НайтиЛицоСПравомПодписи(Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, Отпустил,Дата); 
	
	
КонецПроцедуры //-Лико m.shenderov 17.04.2020


Процедура ПроверитьТребуетсяПодписьОтветственногоЛица() //+Лико m.shenderov 02.06.2020
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Товар Из Товары Цикл
		
		Правило=Справочники.Лико_ПравилаПодписиДокументов.ОпределитьПравило(Организация,Товар.Номенклатура,Ссылка,Товар.Количество,Товар.КоличествоУпаковок);
		Если ЗначениеЗаполнено(Правило) Тогда
			НаборЗаписей = РегистрыСведений.Лико_ПодписанныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Ссылка);
			НаборЗаписей.Отбор.Правило.Установить(Правило);
			НоваяЗапись=НаборЗаписей.Добавить();
			НоваяЗапись.Документ=Ссылка;
			НоваяЗапись.Правило=Правило;
			НаборЗаписей.Записать();
			Прервать;
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры //-Лико m.shenderov 02.06.2020


Процедура ПроверкаВидаОперацииДляСкладаОтветственноеХранениеBRC(Отказ,РежимЗаписи)
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	
	Нпор=0;
	
	Для каждого Товар Из  Товары Цикл
		Если ЗначениеЗаполнено(Товар.АдресХранения.Помещение.Лико_ОрганизацияОтветственногоХранения) и
			ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Со склада: "+ Строка(Товар.АдресХранения.Помещение) +" товар можно только перемещать!";
			Сообщение.Поле = "Товары["+Нпор+"].АдресХранения"; //имя реквизита 
			//Сообщение.КлючДанных = Ссылка;
			Сообщение.ПутьКДанным = "Объект";
			
			Сообщение.Сообщить();
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Товар.АдресХранения.Помещение.Лико_ОрганизацияОтветственногоХранения) и
			ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда
			
			лОрганизацияНовая=?(ЗначениеЗаполнено(Товар.АдресХраненияНовый),Товар.АдресХраненияНовый.Лико_Организация,АдресХранения.Лико_Организация);
			лОрганизация=Товар.АдресХранения.Помещение.Лико_Организация;
			Если лОрганизация<>лОрганизацияНовая Тогда
				
			Отказ=Истина;	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Товар: "+ Строка(Товар.Серия) +" можно  перемещать только на ячейки организации: "+лОрганизация+" !";
			Сообщение.Поле = "Товары["+Нпор+"].АдресХранения";; //имя реквизита 
			//Сообщение.КлючДанных = Ссылка;
			Сообщение.ПутьКДанным = "Объект";
			
			Сообщение.Сообщить();

				
			КонецЕсли;
	
		КонецЕсли;
		Нпор=Нпор+1;
		
	КонецЦикла;
	
КонецПроцедуры

 
Процедура ПроверкаОрганизацииСкладаИлиРЦ(Отказ, РежимЗаписи)

	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	Если  Не (ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение 
		Или  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство) Тогда  	

		Возврат;

	КонецЕсли; 

	//+ ---> Лико m.shenderov 05.03.2024

	//Костыль
	Если  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство 
		и Получатель.ПорядковыйНомер=122 Тогда  	

		Возврат;

	КонецЕсли; 	
	//- <--- Лико m.shenderov 05.03.2024



	Нпор=0; 
	Если  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		
		лНовыйАдрес = Получатель.ЛикоЯчейка;
		
	КонецЕсли;


	Для каждого Товар Из  Товары Цикл 
		
		Если  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда
			
					
		лНовыйАдрес = ?(ЗначениеЗаполнено(Товар.АдресХраненияНовый),Товар.АдресХраненияНовый,АдресХранения); 
		
	КонецЕсли;
	
		лАдрес = Товар.АдресХранения;

		лОрганизацияНовая = лНовыйАдрес.Лико_Организация;
		лОрганизация = лАдрес.Лико_Организация; 
		лОрганизацияОтветственногоХраненияНовая = лНовыйАдрес.Лико_ОрганизацияОтветственногоХранения;
		лОрганизацияОтветственногоХранения = лАдрес.Лико_ОрганизацияОтветственногоХранения;

		лСкладНовый = лНовыйАдрес.Владелец;
		лСклад =  лАдрес.Владелец;

		//Если  лОрганизацияОтветственногоХраненияНовая<> лОрганизацияОтветственногоХранения
		//	И лСкладНовый <> лСклад Тогда 
		//	
		//	
		//	
		//	Отказ=Истина;	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Товар: "+ Строка(Товар.Серия) +" нельзя перемещать в другую организацию. Оформите продажу!";
		//	Сообщение.Поле = "Товары["+Нпор+"].АдресХранения";; //имя реквизита 
		//	//Сообщение.КлючДанных = Ссылка;
		//	Сообщение.ПутьКДанным = "Объект";

		//	Сообщение.Сообщить();
		//	
		//	
		//	
		//КонецЕсли;


		Если Товар.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра Или 
			Товар.Серия.ЯССМ_ОбъектНоменклатуры.Рулонный Тогда
			Нпор=Нпор+1;

			Продолжить;	
		КонецЕсли;
		//лОрганизацияНовая=?(ЗначениеЗаполнено(Товар.АдресХраненияНовый),Товар.АдресХраненияНовый.Помещение.Лико_Организация,АдресХранения.Помещение.Лико_Организация);
		//лОрганизация=Товар.АдресХранения.Помещение.Лико_Организация; 

		Если Не ЗначениеЗаполнено(лОрганизацияНовая) Тогда
			лОрганизацияНовая = товар.СкладПолучатель.Лико_Площадка.Организация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(лОрганизация) Тогда
			лОрганизация = товар.СкладОтправитель.Лико_Площадка.Организация;
		КонецЕсли;

		Если  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
			лОрганизацияНовая=Получатель.Лико_Площадка.Организация;
		КонецЕсли;


		Если лОрганизация<>лОрганизацияНовая Тогда

			Отказ=Истина;	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Товар: "+ Строка(Товар.Серия) +" нельзя перемещать в другую организацию. Оформите продажу!";
			Сообщение.Поле = "Товары["+Нпор+"].АдресХранения";; //имя реквизита 
			//Сообщение.КлючДанных = Ссылка;
			Сообщение.ПутьКДанным = "Объект";

			Сообщение.Сообщить();


		КонецЕсли;

		Нпор=Нпор+1;

	КонецЦикла;

КонецПроцедуры


Процедура ПроверитьНаличиеЦеныНаОснастку() //+Лико m.shenderov 26.03.2021
	Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа Тогда
		Возврат;
	КонецЕсли;
	
	
	Массив = Новый Массив();
	
	
	
	Для каждого Номен Из ЦеныНоменклатуры Цикл
		Если Номен.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра 
			И Не ЗначениеЗаполнено(Номен.Цена)  Тогда
			Массив.Добавить(Номен.Номенклатура);			
		КонецЕсли;		
	КонецЦикла;
	
	
	Если Массив.Количество()=0 ТОгда
		Возврат;
	КонецЕсли;
	ВалютаEur=Константы.ВалютаУправленческогоУчета.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Цена КАК Цена,
	|	Лико_ПараметрыШтампа.Номенклатура КАК Номенклатура,
	|	КурсыВалютСрезПоследних.Курс КАК КурсEur,
	|	КурсыВалютСрезПоследних1.Курс КАК Курс,
	|	Лико_ПараметрыШтампа.Цена * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних1.Курс КАК ЦенаИтог
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаEuro) КАК КурсыВалютСрезПоследних,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних1
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура В(&Номенклатура)";
	Запрос.УстановитьПараметр("Номенклатура",Массив);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("ВалютаEuro",ВалютаEur);
	Запрос.УстановитьПараметр("Валюта",Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл		
		СтрНоменклатуры=ЦеныНоменклатуры.Найти(Выборка.Номенклатура,"Номенклатура");		
		Если СтрНоменклатуры<>Неопределено Тогда			
			СтрНоменклатуры.Цена=Выборка.ЦенаИтог;		
		КонецЕсли;			
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 26.03.2021


Процедура ПроверкаБлокировкиНоменклатурыПриВыдачиНаРц(Отказ, РежимЗаписи)
	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение Или
		ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Или
		Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаБлокировкиПередачиНоменклатурыНаРЦ.ЗначениеПараметра>Дата Тогда
		Возврат;
	КонецЕсли;
	НомерСтроки=0;

	Для каждого Товар Из Товары Цикл
		Если ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(Товар.Номенклатура,"Лико_НеПередаватьНаРЦ")) Тогда
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал:""%3. %1 %2"" заблокирован для выдачи на рабочий центр! Обратитесь в отдел снабжения.",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
		КонецЕсли;
		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Категория2=Истина И ОснасткаВыпускалась(Товар.Серия) Тогда
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Оснастка:"" %1 "" не соответствует требованиям (категория К2)! Заблокирована для выдачи на рабочий центр.",
			Товар.Серия);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();

		КонецЕсли;


		НомерСтроки=НомерСтроки+1;

	КонецЦикла;



КонецПроцедуры


Процедура ПроверкаРезерваМатериаловБезРегионов(Отказ, РежимЗаписи)

	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартСистемы() Тогда 
		Возврат;
	КонецЕсли;

	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение Или
		ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		Возврат;
	КонецЕсли;



	НомерСтроки=0;

	Если Получатель.Лико_Резак Тогда 

		Партнер=ЗаявкаНаСклад.ЗаказНаРаскрой.Партнер;

	Иначе

		Партнер=ЗаказКлиента.Партнер; 

	КонецЕсли;

	Для каждого Товар Из Товары Цикл
		ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
		ОбъектНоменклатуры_Партнер=ОбъектНоменклатуры.Партнер;
		Если ЗначениеЗаполнено(ОбъектНоменклатуры_Партнер) И ОбъектНоменклатуры_Партнер<> Партнер Тогда
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал: №%3 (%1) - %2 - #%4, зарезервирован под заказы клиента: ""%5""!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1,
			Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
			ОбъектНоменклатуры_Партнер);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
		КонецЕсли;


		НомерСтроки=НомерСтроки+1;

	КонецЦикла;



КонецПроцедуры


Процедура ПроверкаРезерваМатериалов(Отказ, РежимЗаписи)

	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартСистемы() Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		ПроверкаРезерваМатериаловБезРегионов(Отказ, РежимЗаписи);
		
		Возврат;
		
	КонецЕсли;


	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение Или
		ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		Возврат;
	КонецЕсли;



	НомерСтроки=0;

	Если Получатель.Лико_Резак Тогда 

		Резерв=ЗаявкаНаСклад.ЗаказНаРаскрой.Резерв;
		БизнесРегион = Резерв;

	Иначе

		Резерв=ЗаказКлиента.Партнер;
		БизнесРегион = ЗаказКлиента.Регион;

	КонецЕсли;

	Для каждого Товар Из Товары Цикл
		ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
		ОбъектНоменклатуры_Резерв=ОбъектНоменклатуры.Резерв;
		Если ЗначениеЗаполнено(ОбъектНоменклатуры_Резерв) И ОбъектНоменклатуры_Резерв<> Резерв И  ОбъектНоменклатуры_Резерв<> БизнесРегион Тогда
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал: №%3 (%1) - %2 - #%4, зарезервирован под заказы : ""%5""!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1,
			Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
			ОбъектНоменклатуры_Резерв);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
		КонецЕсли;


		НомерСтроки=НомерСтроки+1;

	КонецЦикла;



КонецПроцедуры

Процедура КонтрольЗаполненияПартииПроизводства(Отказ, РежимЗаписи)
	
	Если Не ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_ПрослеживаемостьТоваров")) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.Старт() Тогда 
		Возврат;
	КонецЕсли;

	Если Не (РежимЗаписи=РежимЗаписиДокумента.Проведение И 
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Или 
		(ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку и ВнутренняяПереработка))
		Тогда
		Возврат;
	КонецЕсли;



	НомерСтроки=0;


	Для каждого Товар Из Товары Цикл
		ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;

		Если Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.ТребоватьПартию(ОбъектНоменклатуры) Тогда
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("У серии : № %1 , не заполнены данные о партии производства!",
			Товар.Серия);
			Сообщение.Поле = "Товары["+НомерСтроки+"].ПартияПроизводства"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
		КонецЕсли; 
		НомерСтроки=НомерСтроки+1;

	КонецЦикла;





КонецПроцедуры

Процедура НаписатьПисьмоВыданНовыйШтамп()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Ссылка.Получатель КАК РабочийЦентр,
	|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
	|	СУММА(ЕСТЬNULL(ТоварыВЯчейках.ВНаличии, 0)) КАК КоличествоВыданных
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО Лико_ПередачаТоваровТовары.Номенклатура = Лико_ПараметрыШтампа.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|		ПО Лико_ПередачаТоваровТовары.Серия = ТоварыВЯчейках.Серия
	|			И (ТоварыВЯчейках.Ячейка.Владелец = &Склад)
	|			И (ТоварыВЯчейках.Ячейка.Помещение = &ПомещениеПроизводство)
	|			И (ТоварыВЯчейках.Ячейка.Помещение.Лико_Организация = &Организация)
	|ГДЕ
	|	Лико_ПараметрыШтампа.ВидРабот.Родитель В(&ВидыРабот)
	|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = &ВидОперации
	|	И Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Серия,
	|	Лико_ПередачаТоваровТовары.Ссылка.Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Номенклатура КАК Номенклатура,
	|	Вт.РабочийЦентр КАК РабочийЦентр,
	|	Вт.Серия КАК Серия,
	|	Вт.КоличествоВыданных КАК КоличествоВыданных
	|ИЗ
	|	Вт КАК Вт
	|ГДЕ
	|	Вт.КоличествоВыданных = 0";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство);
   Массив = Новый Массив();
   Массив.Добавить(Справочники.ВидыРаботСотрудников.Конгревы);
   Массив.Добавить(Справочники.ВидыРаботСотрудников.Тиснение);
	Запрос.УстановитьПараметр("ВидыРабот",Массив);
	Запрос.УстановитьПараметр("ПомещениеПроизводство",Получатель.ЛикоЯчейка.Помещение);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);

	Тз = Запрос.Выполнить().Выгрузить();
	Если Тз.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);  	
	
	ОтборНастройки				= Новый КомпоновщикНастроекКомпоновкиДанных;
	СхемаКомпоновкиДанных 		= Документы.Лико_ПередачаТоваров.ПолучитьМакет("НаписатьПисьмоВыданНовыйШтамп");
	ИсточникНастроек 			= Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	ОтборНастройки.Инициализировать(ИсточникНастроек);
		

		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);

	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Организация", Ссылка);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство); 
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"ВидыРабот",Массив);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"ПомещениеПроизводство",Получатель.ЛикоЯчейка.Помещение);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"Склад",Склад);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки,"Ссылка",Ссылка);




	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТД=Новый ТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТД);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	 ИмяТемпФайла = ПолучитьИмяВременногоФайла();
	Тд.Записать(ИмяТемпФайла,ТипФайлаТабличногоДокумента.HTML5);
	ТекстHТМЛ = Новый ТекстовыйДокумент;
	ТекстHТМЛ.Прочитать(ИмяТемпФайла);
	ТекстHТМЛ = ТекстHТМЛ.ПолучитьТекст(); 					
	Текст=" Выдан новый штамп : " ;
	Текст = Текст + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка); //+ " от " + Формат(Дата, "ДФ='дд ММММ гггг'");
	Текст = Текст + ". РЦ N: "+ Строка(Получатель.ПорядковыйНомер);
	Тема  = текст;  
	Текст=ТекстHТМЛ;
	ТипСообщения=Справочники.Лико_ТипыСообщений.НайтиПоНаименованию("НаписатьПисьмоВыданНовыйШтамп");
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Организация); 		
	Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат); 
	
КонецПроцедуры



Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

 Процедура ЗаполнитьДопРеквизитыВТчТоварыДляВозвратаПоставщику(РежимЗаписи)

	Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Или РежимЗаписи<>РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	Для каждого Товар Из Товары  Цикл
		Структура = Новый Структура;
		Структура.Вставить("ДокументПоступления");
		Структура.Вставить("ХарактеристикаПоступления");

		ПолучитьДокументПоступленияХаракиеристикуНоменклатуры(Товар.Серия.ЯССМ_ОбъектНоменклатуры,Структура);
		Если ЗначениеЗаполнено(Структура.ХарактеристикаПоступления) Тогда
			Прервать;
		КонецЕсли;
		

	КонецЦикла;
	
	Для каждого Товар Из Товары  Цикл
		
			Товар.ДокументПоступления=Структура.ДокументПоступления;
		Товар.ХарактеристикаПоступления=Структура.ХарактеристикаПоступления;


	КонецЦикла;



КонецПроцедуры

Процедура ПолучитьДокументПоступленияХаракиеристикуНоменклатуры(ОбъектНоменклатуры,Структура) //+Лико m.shenderov 07.06.2021
	
	
	
	
	
	//ОбъектНоменклатуры=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьЭлемент();  	
	Если ЗначениеЗаполнено(ОбъектНоменклатуры.ПриходныйОрдер) Тогда
		Структура.ДокументПоступления=Лико_ОбщегоНазначенияСервер.НайтиДокументПоступленияПоПриходномуОрдеру(ОбъектНоменклатуры.ПриходныйОрдер,ОбъектНоменклатуры.Номенклатура);
		Структура.ХарактеристикаПоступления=ОбъектНоменклатуры.Характеристика; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектНоменклатуры.ЗакрытиеБланка) Тогда
		ОбъектНоменклатурыЗакрытия=ПолучитьОбъектНоменклатурыРасходаВЗакрытии(ОбъектНоменклатуры.ЗакрытиеБланка); 
		 ПолучитьДокументПоступленияХаракиеристикуНоменклатуры(ОбъектНоменклатурыЗакрытия,Структура);
	КонецЕсли;

	
	
	
		
КонецПроцедуры //-Лико m.shenderov 07.06.2021 

Функция ПолучитьОбъектНоменклатурыРасходаВЗакрытии(ЗакрытиеБланка) //+Лико m.shenderov 07.06.2021
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК СерияЯССМ_ОбъектНоменклатуры
|ИЗ
|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
|ГДЕ
|	Лико_БланкЭтапаТовары.Списать
|	И Лико_БланкЭтапаТовары.Ссылка = &Ссылка";
Запрос.УстановитьПараметр("Ссылка",ЗакрытиеБланка );
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
Возврат  Выборка.СерияЯССМ_ОбъектНоменклатуры;
КонецЦикла; 

		
	
КонецФункции //-Лико m.shenderov 07.06.2021 

Функция ОснасткаВыпускалась(Серия) //+Лико m.shenderov 16.09.2021
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаВыпуск.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка.Проведен
	|	И НЕ Лико_БланкЭтапаВыпуск.Ссылка.ПометкаУдаления
	|	И Лико_БланкЭтапаВыпуск.Серия = &Серия
	|	И Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ГравировальныйУчасток)";
	Запрос.УстановитьПараметр("Серия",Серия );
	Возврат Не  Запрос.Выполнить().Пустой();




КонецФункции //-Лико m.shenderov 16.09.2021

Процедура ПроверкаПомещенийСклада(Отказ) //+Лико m.shenderov 18.04.2022

  Запрос = Новый Запрос;
  Запрос.Текст =
  "ВЫБРАТЬ
  |	Лико_ПередачаТоваровТовары.АдресХранения.Помещение КАК Помещения
  |ИЗ
  |	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
  |ГДЕ
  |	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
  |
  |СГРУППИРОВАТЬ ПО
  |	Лико_ПередачаТоваровТовары.АдресХранения.Помещение
  |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	ВЫБОР
  |		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
  |			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Помещение
  |		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Помещение
  |	КОНЕЦ КАК Помещения
  |ИЗ
  |	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
  |ГДЕ
  |	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
  |
  |СГРУППИРОВАТЬ ПО
  |	ВЫБОР
  |		КОГДА Лико_ПередачаТоваровТовары.АдресХраненияНовый = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
  |			ТОГДА Лико_ПередачаТоваровТовары.Ссылка.АдресХранения.Помещение
  |		ИНАЧЕ Лико_ПередачаТоваровТовары.АдресХраненияНовый.Помещение
  |	КОНЕЦ";
  Запрос.УстановитьПараметр("Ссылка",Ссылка);
  Пакеты = Запрос.ВыполнитьПакет();
  Выборка = Пакеты[0].Выбрать();
  Сч=0;

  Пока Выборка.Следующий() Цикл
	  Сч=Сч+1;
  КонецЦикла;
  Если Сч>1 Тогда
	  Сообщить("Выдача материалов из разных помещений в одном документе запрещена!");
	  Отказ=Истина;
  КонецЕсли;

  Выборка = Пакеты[1].Выбрать();
  Сч=0;

  Пока Выборка.Следующий() Цикл
	  Сч=Сч+1;
  КонецЦикла;
  Если Сч>1 Тогда
	  Сообщить("Оприходовать  материалы в разные помещения в одном документе запрещено!");
	   Отказ=Истина;

  КонецЕсли;







КонецПроцедуры //-Лико m.shenderov 18.04.2022

Процедура ФормированиеДокументовОтветсвенноеХранениеБУ(РежимЗаписи,Отказ)
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		
		УстановитьПривилегированныйРежим(Истина);

		
		ПередачаНаОтветсвенноеХранениеБУ(РежимЗаписи,Отказ);
		ПоступлениеСОтветсвенногоХраненияБУ(РежимЗаписи,Отказ); 
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередачаНаОтветсвенноеХранениеБУ(РежимЗаписи,Отказ) //+Лико m.shenderov 11.09.2023
	
	Если  Не(Не Отказ И 
		РежимЗаписи=РежимЗаписиДокумента.Проведение И 
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение) Тогда
		Возврат;
	КонецЕсли;
	Движения.Лико_СерииНаОтветственномХраненииБУ.Записывать=Истина;
	Для каждого Товар Из Товары Цикл 
		
		Движение				=	Движения.Лико_СерииНаОтветственномХраненииБУ.ДобавитьПриход();
	    
		Движение.Период			=	Дата;
		Движение.Организация	=	Организация;
		Движение.Серия			=	Товар.Серия;
		Движение.Контрагент		=	Контрагент;
		Движение.Количество		=	Товар.КоличествоУпаковок;
				
		
	КонецЦикла;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("СкладПолучатель",УправлениеСвойствами.ЗначениеСвойства(Контрагент,"Лико_СкладОтветсвенногоХранения")); 
	ДанныеЗаполнения.Вставить("СкладОтправитель",Склад);
	ДанныеЗаполнения.Вставить("Лико_НеИспользоватьОрдернуюСхему",Истина);
	
	
	СоздатьРедактироватьПеремещениеТоваров(ДанныеЗаполнения,Отказ);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Склад",УправлениеСвойствами.ЗначениеСвойства(Контрагент,"Лико_СкладОтветсвенногоХранения"));
	ДанныеЗаполнения.Вставить("Лико_НеИспользоватьОрдернуюСхему",Истина);
	
	
	СоздатьРедактироватьПередачаТоваровХранителю(ДанныеЗаполнения,Отказ);
	  
КонецПроцедуры //-Лико m.shenderov 11.09.2023


 Процедура ПоступлениеСОтветсвенногоХраненияБУ(РежимЗаписи,Отказ) //+Лико m.shenderov 11.09.2023
	 
		 
	 Если  Не(Не Отказ И 
		РежимЗаписи=РежимЗаписиДокумента.Проведение И 
		ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.СОтветственногоХранения) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Организация КАК Организация,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Серия КАК Серия,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Ячейка КАК Ячейка,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Контрагент КАК Контрагент,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Лико_СерииНаОтветственномХраненииБУ.Остатки(&Дата, Серия В (&Серии)) КАК Лико_СерииНаОтветственномХраненииБУОстатки";
	Запрос.УстановитьПараметр("Дата",Дата );
	Запрос.УстановитьПараметр("Серии",Товары.ВыгрузитьКолонку("Серия") );
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() ТОгда
				Сообщить("Нет данных товаров на ответсвенном хранении!"); 				
				Отказ=Истина;
				Возврат; 			
	КонецЕсли;
	
	
	
	ТзТовары = РезультатЗапроса.Выгрузить();
	НомерСтроки=0;
	
	Для каждого Товар Из Товары  Цикл  
		
		Если ТзТовары.Найти(Товар.Серия,"Серия") = Неопределено Тогда
			
			
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал:""%3. %1 %2 "" не числится на ответсвенном хранении!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
			НомерСтроки=НомерСтроки+1;
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат; 
	КонецЕсли;
	
		
	
	
	
	
	
	Движения.Лико_СерииНаОтветственномХраненииБУ.Записывать=Истина;
	
	
	Для каждого Товар Из ТзТовары  Цикл
		
		
				
		Движение				=	Движения.Лико_СерииНаОтветственномХраненииБУ.ДобавитьРасход();
	    
		Движение.Период			=	Дата;
		Движение.Организация	=	Товар.Организация;
		Движение.Серия			=	Товар.Серия;
		Движение.Контрагент		=	Товар.Контрагент;
		Движение.Количество		=	Товар.Количество;
				
		
	КонецЦикла;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("СкладОтправитель",УправлениеСвойствами.ЗначениеСвойства(Контрагент,"Лико_СкладОтветсвенногоХранения")); 
	ДанныеЗаполнения.Вставить("СкладПолучатель",Склад);
	ДанныеЗаполнения.Вставить("Лико_НеИспользоватьОрдернуюСхему",Истина);

	
	  
	  СоздатьРедактироватьПеремещениеТоваров(ДанныеЗаполнения,Отказ);
	  
	  	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Склад",УправлениеСвойствами.ЗначениеСвойства(Контрагент,"Лико_СкладОтветсвенногоХранения"));
	ДанныеЗаполнения.Вставить("Лико_НеИспользоватьОрдернуюСхему",Истина);
	
	
	СоздатьРедактироватьПоступлениеТоваровОтХранителя(ДанныеЗаполнения,Отказ);

 		
 КонецПроцедуры //-Лико m.shenderov 11.09.2023
 
 
 Процедура ПроверкаОтсутсвияМатериаловНаОтветственномХранении(Отказ,РежимЗаписи) //+Лико m.shenderov 19.09.2023
	УстановитьПривилегированныйРежим(Истина);
 
	 Если  Не(Не Отказ И 
		 РежимЗаписи=РежимЗаписиДокумента.Проведение И 
		 (ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПеремещениеНаОтветственноеХранение Или
		 ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Или
		 ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа)) Тогда
		 Возврат;
	 КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Организация КАК Организация,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Серия КАК Серия,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Ячейка КАК Ячейка,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.Контрагент КАК Контрагент,
	|	Лико_СерииНаОтветственномХраненииБУОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Лико_СерииНаОтветственномХраненииБУ.Остатки(&Дата, Серия В (&Серии)) КАК Лико_СерииНаОтветственномХраненииБУОстатки";
	Запрос.УстановитьПараметр("Дата",Дата );
	Запрос.УстановитьПараметр("Серии",Товары.ВыгрузитьКолонку("Серия") );
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() ТОгда
				
				Возврат; 			
			КонецЕсли;
			
			Отказ=Истина;
	
	
	
	ТзТовары = РезультатЗапроса.Выгрузить();
	НомерСтроки=0;
	
	Для каждого Товар Из Товары  Цикл  
		
		Если ТзТовары.Найти(Товар.Серия,"Серия") <> Неопределено Тогда
			
			
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал:""%3. %1 %2 "" числится на ответсвенном хранении!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить(); 
			НомерСтроки=НомерСтроки+1;
		КонецЕсли;		
	КонецЦикла; 		
 КонецПроцедуры //-Лико m.shenderov 19.09.2023
 
 
 
 Процедура ЗаполнитьПравилоСписанияНоменклатурыПриПередачеВПроизводство(Отказ, РежимЗаписи) //+--->Лико m.shenderov 28.06.2024
	 
	 
	 Если ВидОперации <> Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство 
		 Или Отказ 
		 Или  РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		 
		 Возврат; 
		 
	 КонецЕсли;
	 
	 СооНоменклатура = Новый Соответствие; 
	 
	 Для каждого Товар Из Товары Цикл 
		 
		 Правило = СооНоменклатура.Получить(Товар.Номенклатура);
		 
		 Если Правило = Неопределено Тогда
			 
			 Структура = Новый Структура;
			 
			 ПравилоСсылка = Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило2(Товар.Номенклатура,Ссылка); 
			 
			 Если ПравилоСсылка = Неопределено Тогда 
				 
				Правило = Новый Структура;
				Правило.Вставить("Ссылка");
				Правило.Вставить("ТипСписания");
				Правило.Вставить("КатегорияЭксплуатации");
				 
			 Иначе
				 
				 Правило = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПравилоСсылка,"Ссылка,ТипСписания,КатегорияЭксплуатации");
			 КонецЕсли;
			 
			 СооНоменклатура.Вставить(Товар.Номенклатура,Правило);
			 
		 КонецЕсли;
		 
		 
		 Товар.ПравилоСписания = Правило.Ссылка;
		 Товар.ТипСписанияНоменклатуры = Правило.ТипСписания;
		 Товар.КатегорияЭксплуатации = Правило.КатегорияЭксплуатации; 
		 
		 
	 КонецЦикла;
	 
	 
 КонецПроцедуры //-<---Лико m.shenderov 28.06.2024
 
 Процедура ЗаполнитьСклады(Отказ, РежимЗаписи) //+--->Лико m.shenderov 28.06.2024
	 
	 Если Отказ 
		 Или  РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		 
		 Возврат; 
		 
	 КонецЕсли;
	 
	 МассивАдресов = Новый Массив();  
	 МассивАдресов.Добавить(АдресХранения); 
	 
	 Если ЗначениеЗаполнено(Получатель) Тогда
		 
		 АдресРЦ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель,"ЛикоЯчейка"); 
		 
		 Обработки.ПеремещениеТоваровДоп.КорректировкаЯчейкиРабочегоЦентра(Организация, Дата, АдресРЦ); 
		 
		 МассивАдресов.Добавить(АдресРЦ); 
		 
	 КонецЕсли; 
	 
	 Для каждого Товар Из  Товары Цикл
		 
		 Если МассивАдресов.Найти(Товар.АдресХранения)=Неопределено Тогда
			 МассивАдресов.Добавить(Товар.АдресХранения); 
		 КонецЕсли;
		 
		 Если ЗначениеЗаполнено(Товар.АдресХраненияНовый) 
			 И МассивАдресов.Найти(Товар.АдресХраненияНовый)=Неопределено Тогда
			 МассивАдресов.Добавить(Товар.АдресХраненияНовый); 
		 КонецЕсли; 	 
		 
	 КонецЦикла;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	СкладскиеЯчейки.Ссылка КАК Ссылка,
	 |	ВЫБОР
	 |		КОГДА СкладскиеЯчейки.Лико_СкладОтветственногоХранения = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	 |			ТОГДА СкладскиеЯчейки.Владелец
	 |		ИНАЧЕ СкладскиеЯчейки.Лико_СкладОтветственногоХранения
	 |	КОНЕЦ КАК Владелец,
	 |	СкладскиеЯчейки.Помещение КАК Помещение
	 |ИЗ
	 |	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	 |ГДЕ
	 |	СкладскиеЯчейки.Ссылка В(&МассивАдресов)";
	 Запрос.УстановитьПараметр("МассивАдресов",МассивАдресов );
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 СооАдресов = Новый Соответствие;
	 
	 Пока Выборка.Следующий() Цикл
		 
		 СооАдресов.Вставить(Выборка.Ссылка,Выборка.Владелец);
		 
	 КонецЦикла; 
	 
	 Для каждого Товар Из  Товары Цикл
		 
		 Товар.СкладОтправитель = СооАдресов[Товар.АдресХранения];
		 Склад =    Товар.СкладОтправитель;
		 
		 Если ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
			 
			 НовыйАдрес = АдресРЦ;
			 
		 ИначеЕсли ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда 
			 
			 НовыйАдрес = ?(ЗначениеЗаполнено(Товар.АдресХраненияНовый),Товар.АдресХраненияНовый,АдресХранения);
			 
		 ИначеЕсли  ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
			 
			 
			НовыйАдрес = Неопределено;
		Иначе
			
			 НовыйАдрес =АдресХранения;
			 
			 
		 КонецЕсли;
				 
		 Товар.СкладПолучатель = СооАдресов[НовыйАдрес]; 
		 
		 СкладОтветственногоХранения = Неопределено;
		 СкладОтветственногоХраненияНовый = Неопределено;
 
		 Если ЗначениеЗаполнено(Товар.АдресХранения) Тогда 
			 СкладОтветственногоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар.АдресХранения,"Лико_СкладОтветственногоХранения"); 
		 КонецЕсли;
		 
		 Если ЗначениеЗаполнено(НовыйАдрес) Тогда
			 СкладОтветственногоХраненияНовый = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйАдрес,"Лико_СкладОтветственногоХранения");
		 КонецЕсли;
		 
		 Если ЗначениеЗаполнено(СкладОтветственногоХранения) Или
			 
			 ЗначениеЗаполнено(СкладОтветственногоХраненияНовый) Тогда
			 Товар.ОтветственноеХранение =Истина; 
			 
		 Иначе
			 
			 Товар.ОтветственноеХранение =Ложь;
			 
			 
		 КонецЕсли;
		 
		 
	 КонецЦикла; 
	 
	 ТзСкладОтправитель = Товары.Выгрузить(,"СкладОтправитель");
	 ТзСкладОтправитель.Свернуть("СкладОтправитель");
	 
	 ТзСкладПолучатель = Товары.Выгрузить(,"СкладПолучатель");
	 ТзСкладПолучатель.Свернуть("СкладПолучатель");
	 
	 Если ТзСкладОтправитель.Количество()>1 Или  ТзСкладПолучатель.Количество()>1 Тогда
		 
		 Отказ = Истина;
		 
		 Сообщить("Перемещение или оприходование с более чем одного склада запрещено. Разбейте операцию на несколько документов.");  
		 
	 КонецЕсли;
	 
	 
	 
	 
 КонецПроцедуры //-<---Лико m.shenderov 28.06.2024
 
 
 Процедура ВозможностьИспользованияВнутреннийПереработки(Отказ,РежимЗаписи) //+--->Лико m.shenderov 01.10.2024
	 Если РежимЗаписи<>РежимЗаписиДокумента.Проведение Тогда 
		Возврат;
	КонецЕсли;

	 
	 УстановитьПривилегированныйРежим(Истина);
	 
	 Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку И
		 ВнутренняяПереработка Тогда 
		 Если АрендаРЦИксПак(Дата) Тогда 
			 
			 Отказ = Истина;
			 ДатаНачалаАрендыРЦИксПак  = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаАрендыРЦИксПак.ЗначениеПараметра; 
			 
			 
			 Сообщить(СтрШаблон("С %1 операция ""Внутренняя переаботка"" запрещена. Используйте операцию ""Перемещение""."
			 ,Формат(ДатаНачалаАрендыРЦИксПак,"ДФ=dd.MM.yyyy"))); 
		 КонецЕсли;	 
		 
	 КонецЕсли;
	 
 КонецПроцедуры //-<---Лико m.shenderov 01.10.2024
 
 
 
 
 
 Функция АрендаРЦИксПак(Период) //+--->Лико m.shenderov 25.09.2024
	
	Результат = Ложь;
	
	  ДатаНачалаАрендыРЦИксПак  = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаАрендыРЦИксПак.ЗначениеПараметра; 
	  
	  Если ЗначениеЗаполнено(ДатаНачалаАрендыРЦИксПак) 
		  И ТипЗнч(ДатаНачалаАрендыРЦИксПак) = Тип("Дата") 
		  И ДатаНачалаАрендыРЦИксПак<=Период Тогда 
		  
		Результат = Истина;  
	  КонецЕсли;
	  
		
		
		Возврат Результат;
  
  КонецФункции //-<---Лико m.shenderov 25.09.2024

Процедура КонтрольНаличияФотоРулонногоМатериала(Отказ, РежимЗаписи) //+--->Лико m.shenderov 29.01.2025
	  
	  УстановитьПривилегированныйРежим(Истина);
	  
	  Если  Не(Не Отказ И 
		  РежимЗаписи=РежимЗаписиДокумента.Проведение И 
		  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство
		  И Получатель.Лико_Резак) Тогда
		  Возврат;
	  КонецЕсли; 
	  
	  МассивСерийБезФото = Справочники.Лико_Площадки.КонтрольНаличияФотоРулонногоМатериала(Получатель.Лико_Площадка,Дата,Товары.ВыгрузитьКолонку("Серия"));
	  Если ЗначениеЗаполнено(МассивСерийБезФото) Тогда
		  Отказ = Истина;
		  НомерСтроки=0;
		  
		  Для каждого Товар Из Товары Цикл
			  
			  Если МассивСерийБезФото.Найти(Товар.Серия) <> Неопределено Тогда
				  
				  
				  Сообщение = Новый СообщениеПользователю;
				  Сообщение.Текст = СтрШаблон("У серии (#):""%3. %1 %2 #%4 "" отсутствует фото бирки!",
				  Товар.Номенклатура.Код,
				  Товар.Номенклатура,
				  НомерСтроки+1,
				  Товар.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки);
				  Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
				  Сообщение.ПутьКДанным = "Объект";
				  Сообщение.Сообщить(); 
				  НомерСтроки=НомерСтроки+1;
			  КонецЕсли;	
			  
			  
			  
		  КонецЦикла;
	  КонецЕсли;
	  
	  
  КонецПроцедуры //-<---Лико m.shenderov 29.01.2025
  
  
  Процедура КонтрольПеремещенияОтветХранения(Отказ, РежимЗаписи) //+--->Лико m.shenderov 29.01.2025
	  
	  
	  Если  Не( Не Отказ И 
		  РежимЗаписи=РежимЗаписиДокумента.Проведение И 
		  ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение) Тогда
		  Возврат;
	  КонецЕсли; 
	  
	  
	  
	  УстановитьПривилегированныйРежим(Истина); 
	  ПроверкаКонтроля = Ложь; 
	  ДатаНачалаКонтроля =Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаКонтроляПеремещенияОтветХраненияСИМ.ЗначениеПараметра;
	  
	  Если НЕ (ЗначениеЗаполнено(ДатаНачалаКонтроля) И ДатаНачалаКонтроля<Дата) Тогда
		  Возврат;		
	  КонецЕсли;
	  НомерСтроки = 0;
	  
	  
	  Для каждого Товар Из Товары Цикл
		  
		  НовыйАдресХранения = ?(ЗначениеЗаполнено(Товар.АдресХраненияНовый),Товар.АдресХраненияНовый,АдресХранения);
		  Ошибка =""; 
		  ПроверитьЯчейкиОтветственногоХранения(Товар.АдресХранения, НовыйАдресХранения, Ошибка);
		  
		  Если ЗначениеЗаполнено(Ошибка) Тогда
			  
			  Отказ = Истина;
			  
			  Сообщение = Новый СообщениеПользователю;
			  Сообщение.Текст = СтрШаблон(" (#):""%3. %1 %2 #%4. "" %5",
			  Товар.Номенклатура.Код,
			  Товар.Номенклатура,
			  НомерСтроки+1,
			  Товар.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки,
			  Ошибка);
			  Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			  Сообщение.ПутьКДанным = "Объект";
			  Сообщение.Сообщить(); 
			  НомерСтроки=НомерСтроки+1;
			  
			  
		  КонецЕсли;
		  
		  
	  КонецЦикла;	
	  
	  
	  
	  
  КонецПроцедуры //-<---Лико m.shenderov 29.01.2025

 Процедура ПроверитьЯчейкиОтветственногоХранения(АдресХранения, НовыйАдресХранения, Ошибка)
	 
	 Результат = Ложь;
	 
	 Результат = ЭтоПередачаНаОтветственноеХранение(АдресХранения, НовыйАдресХранения, Ошибка);
 	 Результат = ЭтоВозвратСОтветственноеХранение(АдресХранения, НовыйАдресХранения, Ошибка);	 
	 Результат = ЭтоСотрудникиСкладаОтветственногоХранения(АдресХранения, НовыйАдресХранения, Ошибка);
 
 КонецПроцедуры
  
Функция ЭтоПередачаНаОтветственноеХранение(АдресХранения, НовыйАдресХранения, Ошибка)

	Если НЕ ЗначениеЗаполнено(АдресХранения.Лико_ОрганизацияОтветственногоХранения) И 
		ЗначениеЗаполнено(НовыйАдресХранения.Лико_ОрганизацияОтветственногоХранения)Тогда 
		
		
		Если Не НовыйАдресХранения.Лико_БуферОтветственногоХранения Тогда 
			
			Ошибка = "Передача материалов на ответственное хранение возможна только через буферную зону!";
			
		КонецЕсли;
		
	Возврат Истина;	
		
	КонецЕсли;
	
Возврат Ложь;	

КонецФункции

Функция ЭтоВозвратСОтветственноеХранение(АдресХранения, НовыйАдресХранения, Ошибка)

	Если ЗначениеЗаполнено(АдресХранения.Лико_ОрганизацияОтветственногоХранения) И 
		Не ЗначениеЗаполнено(НовыйАдресХранения.Лико_ОрганизацияОтветственногоХранения)Тогда 
		
		
		Если Не НовыйАдресХранения.Лико_БуферОтветственногоХранения Тогда 
			
			Ошибка = "Возврат  материалов с ответственного хранения возможно только через буферную зону!";
			
		КонецЕсли;
		
		Если Не АдресХранения.Лико_БуферОтветственногоХранения Тогда 
			
			Ошибка = "Возврат материалов с ответственного хранения возможен только со специализированной ячейки возврата с ответственного хранения!";
			
		КонецЕсли;

		
	Возврат Истина;	
		
	КонецЕсли;
	
Возврат Ложь;	

КонецФункции 

Функция ЭтоСотрудникиСкладаОтветственногоХранения(АдресХранения, НовыйАдресХранения, Ошибка)

	Если ЗначениеЗаполнено(АдресХранения.Лико_ОрганизацияОтветственногоХранения) И 
	     ЗначениеЗаполнено(НовыйАдресХранения.Лико_ОрганизацияОтветственногоХранения)Тогда 
		
		
		 Если АдресХранения.Лико_ОрганизацияОтветственногоХранения = НовыйАдресХранения.Лико_ОрганизацияОтветственногоХранения 
			 И АдресХранения.Лико_ОрганизацияОтветственногоХранения<>Организация  Тогда 
			
			Ошибка = СтрШаблон("Операция должна быть выполнена сотрудниками организации: ""%1""!",АдресХранения.Лико_ОрганизацияОтветственногоХранения);
		Возврат Ложь;	
	
		КонецЕсли;
		
			
		
	КонецЕсли;
	Возврат Истина;	
	

КонецФункции 



Процедура СформироватьДвиженияСоставаПаллеты()
	
	
	Движения.Лико_ТоварыНаПаллетах.Записывать = Истина;
	
	ОстаткиТоваровСПаллет=ОстаткиТоваровСПаллет(); 
	
	Для Каждого СтрокаОстатков Из ОстаткиТоваровСПаллет Цикл
		
		// Если количество к перемещению = 0, пропускаем строку
		Если СтрокаОстатков.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Параметры движения расхода
		ПараметрыДвижения = Новый Структура;
		ПараметрыДвижения.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
		ПараметрыДвижения.Вставить("Период", Дата);
		ПараметрыДвижения.Вставить("Серия", СтрокаОстатков.Серия);
		ПараметрыДвижения.Вставить("Паллет", СтрокаОстатков.Паллет);
		ПараметрыДвижения.Вставить("Количество", СтрокаОстатков.Количество);
		
		
		ДобавитьДвижение(Движения.Лико_ТоварыНаПаллетах, ПараметрыДвижения);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет движение по регистру накопления
//
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей - набор записей регистра накопления
//  ПараметрыДвижения - Структура - параметры движения, ключи структуры должны соответствовать
//                      реквизитам, измерениям и ресурсам регистра
//
Процедура ДобавитьДвижение(НаборЗаписей, ПараметрыДвижения)

    Движение = НаборЗаписей.Добавить();
    ЗаполнитьЗначенияСвойств(Движение, ПараметрыДвижения);

КонецПроцедуры



// Формирует движения списания товаров с предыдущих паллет
//
// Параметры:
//  ДатаДокумента - Дата - дата документа
//
Функция ОстаткиТоваровСПаллет()

  
    // Получаем уникальные серии из документа для оптимизации запроса
    СерииДокумента = Новый Массив;
    Для Каждого СтрокаТоваров Из Товары Цикл
        Если ЗначениеЗаполнено(СтрокаТоваров.Серия) И СерииДокумента.Найти(СтрокаТоваров.Серия) = Неопределено Тогда
            СерииДокумента.Добавить(СтрокаТоваров.Серия);
        КонецЕсли;
    КонецЦикла;

    // Один запрос для получения остатков паллет для всех серий из документа
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТоварыНаПаллетахОстатки.Серия КАК Серия,
    |	ТоварыНаПаллетахОстатки.Паллет КАК Паллет,
    |	ТоварыНаПаллетахОстатки.КоличествоОстаток КАК Количество
    |ИЗ
    |	РегистрНакопления.Лико_ТоварыНаПаллетах.Остатки(&ДатаДокумента, Серия В (&СерииДокумента)) КАК ТоварыНаПаллетахОстатки
    |ГДЕ
    |	ТоварыНаПаллетахОстатки.КоличествоОстаток > 0
    |
    |УПОРЯДОЧИТЬ ПО
    |	Серия,
    |	Количество УБЫВ";

    Запрос.УстановитьПараметр("ДатаДокумента", Дата);
    Запрос.УстановитьПараметр("СерииДокумента", СерииДокумента);

    Возврат Запрос.Выполнить().Выгрузить();
   

	
	
КонецФункции


#КонецОбласти

#Область СозданиеДокументовРаспоряжения 


Процедура  УдалениеДокуметовПеремещенияВКолористическую(Отказ)
	
	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Лико_Документ",Ссылка);
	СтруктураПараметров.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую);	
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдалениеРасш("ДвижениеПродукцииИМатериалов",СтруктураПараметров,Отказ);	
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ЗаказМатериаловВПроизводство","Лико_Документ",Ссылка,Отказ);
	
КонецПроцедуры 

Процедура СоздатьРедактироватьРаспоряжениеДляСкладскихОпераций(Распоряжение,ДанныеЗаполнения,РежимЗаписи,Отказ) 
	
	СоздатьРедактироватьПередачуСырьяПереработчику(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);
	СоздатьРедактироватьВозвратПоставщику(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);  
	СоздатьРедактироватьПередачуВРемонт(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);  
	СоздатьРедактироватьПродажа(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);
	СоздатьРедактироватьПродажаИнтеркампани(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);  
	
	СоздатьРедактироватьСписание(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ); 
	СоздатьРедактироватьПередачуВЭксплуатацию(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ); 
	
	
	
	
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			РаспоряжениеОбъект=Распоряжение.ПолучитьОбъект();
			Попытка  				
				РаспоряжениеОбъект.ПометкаУдаления=Истина; 
				РаспоряжениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);  
				
				РаспоряжениеОбъект.Записать(РежимЗаписи);
			Исключение
				Отказ = Истина;
				Сообщить("Документ """ + Распоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				
			КонецПопытки;
			
			Если Не Отказ Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ Док.Ссылка КАК Ссылка ИЗ Документ.СчетНаОплатуКлиенту КАК Док ГДЕ Док.ДокументОснование = &Основание";
				Запрос.УстановитьПараметр("Основание",Распоряжение);
				РезультатЗапроса = Запрос.Выполнить();
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					Попытка  				
						ДокОбъект=Выборка.Ссылка.ПолучитьОбъект();
						ДокОбъект.ПометкаУдаления=Истина; 		
						ДокОбъект.Записать(РежимЗаписи);
					Исключение
						//Отказ = Истина;
						Сообщить("Документ """ + ДокОбъект.Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());						
					КонецПопытки;
				КонецЦикла; 
				
				
			КонецЕсли;
			
			
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Распоряжение2) Тогда
			РаспоряжениеОбъект=Распоряжение2.ПолучитьОбъект();
			Попытка  				
				РаспоряжениеОбъект.ПометкаУдаления=Истина; 
				РаспоряжениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);  
				
				РаспоряжениеОбъект.Записать(РежимЗаписи);
			Исключение
				Отказ = Истина;
				Сообщить("Документ """ + Распоряжение2 + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				
			КонецПопытки;
			
			
			
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры 

Процедура ПроверитьНаличиеРаспоряжения(); 	
	
	Если Не ЗначениеЗаполнено(Распоряжение) Или Лев(Строка(Распоряжение),18)="<Объект не найден>" Тогда
		Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку И ОтражатьВБухгалтерскомУчете  Тогда		
			Распоряжение=Документы.ПередачаСырьяПереработчику.ПолучитьСсылку();			
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда		
			Распоряжение=Документы.ВозвратТоваровПоставщику.ПолучитьСсылку();
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт Тогда		
			Распоряжение=Документы.ПередачаСырьяПереработчику.ПолучитьСсылку();
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа Тогда		
			Распоряжение=Документы.РеализацияТоваровУслуг.ПолучитьСсылку();
		ИначеЕсли ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание и ЕстьНоменклатураСписания() Тогда		
			Распоряжение=Документы.ВнутреннееПотребление.ПолучитьСсылку();
			Док= Документы.ВнутреннееПотребление.СоздатьДокумент();
			Док.Дата=Дата+1; 			
			Док.Записать();
			Распоряжение=Док.ссылка; 
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

Процедура ОбработатьРаспоряжение (РежимЗаписи,Отказ) 
	УстановитьПривилегированныйРежим(Истина);	
	
	СтруктураДанных=СтруктураДанныхДляЗаполненияРаспоряжения(ВидОперации);	
	ЗаполнитьЗначенияСвойств(СТруктураДанных,ЭтотОбъект);
	СтруктураДанных.Комментарий="Создан в проведении документа: "+ Ссылка; 
	СоздатьРедактироватьРаспоряжениеДляСкладскихОпераций(Распоряжение,СтруктураДанных,РежимЗаписи,Отказ);
	
	УстановитьПривилегированныйРежим(ЛОжь);		
	
КонецПроцедуры 

Процедура СоздатьРедактироватьПередачуСырьяПереработчику210220(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку И ОтражатьВБухгалтерскомУчете И Не ВнутренняяПереработка Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда	
			НовоеРаспоряжение.ЗаказПереработчику=ЗаказВПереработку; 		
			НовоеРаспоряжение.ПередачаПоЗаказам=Истина;
			НовоеРаспоряжение.СпособДоставки=ЗаказВПереработку.СпособДоставки;
		КонецЕсли;
		
		Тз=ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров());
		Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда
			Тз.Колонки.Добавить("ЗаказПереработчику");
		КонецЕсли;
		Для каждого СтрТЗ Из Тз Цикл
			СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
			СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;	
			Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда
				СтрТЗ.ЗаказПереработчику= ЗаказВПереработку;
			КонецЕсли;			  
		КонецЦикла;
		НовоеРаспоряжение.Валюта=Валюта;
		НовоеРаспоряжение.Комментарий = "" + НовоеРаспоряжение.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
		
		
		ФизЛицо = АвторДокумента;
		НовоеРаспоряжение.Отпустил = ФизЛицо;
		НовоеРаспоряжение.ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Организация, НовоеРаспоряжение.Дата);
		Если НЕ ЗначениеЗаполнено(НовоеРаспоряжение.ОтпустилДолжность) Тогда
			НовоеРаспоряжение.ОтпустилДолжность = "Кладовщик";
		КонецЕсли;
		НовоеРаспоряжение.Менеджер = Автор;
		НовоеРаспоряжение.Руководитель = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовоеРаспоряжение.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Дата); 
		НовоеРаспоряжение.ГлавныйБухгалтер = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовоеРаспоряжение.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Дата); 
		ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
		НовоеРаспоряжение.Договор       =ДляДокумента.Договор; 	
		НовоеРаспоряжение.Основание		=НовоеРаспоряжение.Договор.Наименование;
		НовоеРаспоряжение.ОснованиеДата	=НовоеРаспоряжение.Договор.Дата;
		НовоеРаспоряжение.ОснованиеНомер=НовоеРаспоряжение.Договор.Номер;
		
		
		Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда
			Тз.Свернуть("Номенклатура,Характеристика,Упаковка,ЗаказПереработчику","Количество,КоличествоУпаковок");
		Иначе
			Тз.Свернуть("Номенклатура,Характеристика,Упаковка","Количество,КоличествоУпаковок"); 
		КонецЕсли;
		НовоеРаспоряжение.Товары.Загрузить(Тз); 
		Для каждого СтрокаТовары Из НовоеРаспоряжение.Товары Цикл
			
			СтрокаТовары.Цена = ЦеныНоменклатуры.Найти(СтрокаТовары.Номенклатура,"Номенклатура").Цена;
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСумму");
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, Неопределено);
			
		КонецЦикла;
		
		НовоеРаспоряжение.Товары.Сортировать("Номенклатура,Характеристика");
		
		
		
		
		Попытка 				
			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
			
		КонецПопытки;
		Если Не Отказ Тогда
			
			Распоряжение=НовоеРаспоряжение.Ссылка;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 


Процедура СоздатьРедактироватьПередачуСырьяПереработчику(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку И ОтражатьВБухгалтерскомУчете И Не ВнутренняяПереработка Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда	
			НовоеРаспоряжение.ЗаказПереработчику=ЗаказВПереработку; 		
			НовоеРаспоряжение.ПередачаПоЗаказам=Истина;
			НовоеРаспоряжение.СпособДоставки=ЗаказВПереработку.СпособДоставки;
		КонецЕсли;
		
		Тз=ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров());
		Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда
			Тз.Колонки.Добавить("ЗаказПереработчику");
		КонецЕсли;
		Для каждого СтрТЗ Из Тз Цикл
			СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
			СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;	
			Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда
				СтрТЗ.ЗаказПереработчику= ЗаказВПереработку;
			КонецЕсли;			  
		КонецЦикла;
		НовоеРаспоряжение.Валюта=Валюта;
		НовоеРаспоряжение.Комментарий = "" + НовоеРаспоряжение.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
		
		
		ФизЛицо = АвторДокумента;
		НовоеРаспоряжение.Отпустил = ФизЛицо;
		НовоеРаспоряжение.ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Организация, НовоеРаспоряжение.Дата);
		Если НЕ ЗначениеЗаполнено(НовоеРаспоряжение.ОтпустилДолжность) Тогда
			НовоеРаспоряжение.ОтпустилДолжность = "Кладовщик";
		КонецЕсли;
		НовоеРаспоряжение.Менеджер = Автор;
		НовоеРаспоряжение.Руководитель = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовоеРаспоряжение.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Дата); 
		НовоеРаспоряжение.ГлавныйБухгалтер = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовоеРаспоряжение.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Дата); 
		ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
		НовоеРаспоряжение.Договор       =ДляДокумента.Договор; 	
		НовоеРаспоряжение.Основание		=НовоеРаспоряжение.Договор.Наименование;
		НовоеРаспоряжение.ОснованиеДата	=НовоеРаспоряжение.Договор.Дата;
		НовоеРаспоряжение.ОснованиеНомер=НовоеРаспоряжение.Договор.Номер;
		
		
		Если ЗначениеЗаполнено(ЗаказВПереработку) Тогда
			Тз.Свернуть("Номенклатура,Характеристика,Упаковка,ЗаказПереработчику","Количество,КоличествоУпаковок");
		Иначе
			Тз.Свернуть("Номенклатура,Характеристика,Упаковка","Количество,КоличествоУпаковок"); 
		КонецЕсли;
		НовоеРаспоряжение.Товары.Загрузить(Тз); 
		Для каждого СтрокаТовары Из НовоеРаспоряжение.Товары Цикл
			
			СтрокаТовары.Цена = ЦеныНоменклатуры.Найти(СтрокаТовары.Номенклатура,"Номенклатура").Цена;
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСумму");
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, Неопределено);
			
		КонецЦикла;
		
		НовоеРаспоряжение.Товары.Сортировать("Номенклатура,Характеристика");
		
		
		
		
		Попытка 				
			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
			
		КонецПопытки;
		Если Не Отказ Тогда
			
			Распоряжение=НовоеРаспоряжение.Ссылка;
			ОбменДанными.Загрузка=Истина;
			Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 


Процедура СоздатьРедактироватьВозвратПоставщику180326(Распоряжение, ДанныеЗаполнения, РежимЗаписи, Отказ)

	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Склад.Лико_ДатаНачалаКонтроляВозвратов) И   Склад.Лико_ДатаНачалаКонтроляВозвратов<=Дата Тогда
		тз=Товары.Выгрузить();
		тз.Свернуть("Номенклатура,Характеристика,ХарактеристикаПоступления","Количество");
		Соответствие = Новый Соответствие;
		
		Для каждого Товар Из тз Цикл
			
		
			Если ЗначениеЗаполнено(Товар.ХарактеристикаПоступления) И Товар.Характеристика<>Товар.ХарактеристикаПоступления Тогда
				СобратьВХарактеристикуПоступления(Товар.Номенклатура,Товар.Характеристика,Товар.ХарактеристикаПоступления,Товар.Количество);
				Прервать;
			КонецЕсли; 			
		КонецЦикла;
	КонецЕсли;


	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда
		Если Не ОтражатьВБухгалтерскомУчете Тогда
			Возврат;
		КонецЕсли;



		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ВозвратТоваровПоставщику.СоздатьДокумент();	
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ВозвратТоваровПоставщику.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;

		Тз=	ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваровВозврат());
		//ТЗ = Новый ТаблицаЗначений; 		
		Тз.Колонки.Добавить("ДокументПоступления",Новый ОписаниеТипов("ДокументСсылка.ПриобретениеТоваровУслуг"));
		Тз.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));       
		Тз.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 4, ДопустимыйЗнак.Любой)));
		ДокументПоступления=Неопределено;
		Для каждого СтрТз Из Тз Цикл
			лДокументПоступления=ДокументПоступления;
			ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();	
			Лико_ОбщегоНазначенияСервер.НайтиДокументПоступления(ДокументПоступления,Организация,СтрТз.Серия,Дата);
			Если Не ЗначениеЗаполнено(ДокументПоступления) И ЗначениеЗаполнено(лДокументПоступления) Тогда
				ДокументПоступления=лДокументПоступления;
			КонецЕсли;
			
			
			СтрТз.ДокументПоступления=ДокументПоступления;
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",СтрТз.Номенклатура);
			НайденыеСтроки=ДокументПоступления.Товары.НайтиСтроки(Структура);
			Для каждого СтрНайденыеСтроки Из НайденыеСтроки Цикл
				СтрТз.Цена=СтрНайденыеСтроки.Цена;
				СтрТз.СтавкаНДС=СтрНайденыеСтроки.СтавкаНДС;
			КонецЦикла;
		КонецЦикла;
		Тз.Свернуть("Номенклатура,ХарактеристикаПоступления,Цена,СтавкаНДС,ДокументПоступления","Количество");

		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		//НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров())); 
		//НовоеРаспоряжение.Товары.Загрузить(Тз);
		НовоеРаспоряжение.Товары.Очистить();
		Для каждого СтрТз Из Тз Цикл
			НоваяСтрТовары=НовоеРаспоряжение.Товары.Добавить();

			ЗаполнитьЗначенияСвойств(НоваяСтрТовары,СтрТз);
			НоваяСтрТовары.Характеристика=СтрТз.ХарактеристикаПоступления;
			НоваяСтрТовары.КоличествоУпаковок=НоваяСтрТовары.Количество;

		КонецЦикла;

		НовоеРаспоряжение.НалогообложениеНДС=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		НовоеРаспоряжение.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз;
		НовоеРаспоряжение.Проведен=Ложь;
		НовоеРаспоряжение.Договор=ДокументПоступления.Договор;
		НовоеРаспоряжение.Валюта=ДокументПоступления.Валюта;
		НовоеРаспоряжение.ДокументПоступления=ДокументПоступления;
		НовоеРаспоряжение.ЦенаВключаетНДС=ДокументПоступления.ЦенаВключаетНДС;
		НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику;
		НовоеРаспоряжение.СпособКомпенсации=Перечисления.СпособыКомпенсацииВозвратовТоваров.ОставитьВКачествеАванса;
		НовоеРаспоряжение.Лико_НеНужныДвиженияОрдерныхСкладов=Истина;

		Для каждого НоваяСтрока Из НовоеРаспоряжение.Товары Цикл


			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСумму");
			//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ДокументОбъект.НалогообложениеНДС);
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовоеРаспоряжение.ЦенаВключаетНДС, НоваяСтрока.СтавкаНДС));
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);

		КонецЦикла;
		Попытка 				
			Если ЗначениеЗаполнено(ДокументПоступления) Тогда
				НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение);
			Иначе 
				НовоеРаспоряжение.Записать();
			КонецЕсли;
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

		КонецПопытки;


		Распоряжение=НовоеРаспоряжение.Ссылка;

	КонецЕсли;	

КонецПроцедуры

Процедура СоздатьРедактироватьВозвратПоставщику(Распоряжение, ДанныеЗаполнения, РежимЗаписи, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Склад.Лико_ДатаНачалаКонтроляВозвратов) И   Склад.Лико_ДатаНачалаКонтроляВозвратов<=Дата Тогда
		тз=Товары.Выгрузить();
		тз.Свернуть("Номенклатура,Характеристика,ХарактеристикаПоступления","Количество");
		Соответствие = Новый Соответствие;

		Для каждого Товар Из тз Цикл


			Если ЗначениеЗаполнено(Товар.ХарактеристикаПоступления.ЯССМ_нарезка.Размер) И Товар.Характеристика.ЯССМ_нарезка.Размер<>Товар.ХарактеристикаПоступления.ЯССМ_нарезка.Размер Тогда
				СобратьВХарактеристикуПоступления(Товар.Номенклатура,Товар.Характеристика,Товар.ХарактеристикаПоступления,Товар.Количество);
				Прервать;
			КонецЕсли; 			
		КонецЦикла;
	КонецЕсли;


	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ВозвратПоставщику Тогда
		Если Не ОтражатьВБухгалтерскомУчете Тогда
			Возврат;
		КонецЕсли;



		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ВозвратТоваровПоставщику.СоздатьДокумент();	
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ВозвратТоваровПоставщику.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;

		Тз=	ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваровВозврат());
		//ТЗ = Новый ТаблицаЗначений; 		
		Тз.Колонки.Добавить("ДокументПоступления",Новый ОписаниеТипов("ДокументСсылка.ПриобретениеТоваровУслуг"));
		Тз.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));       
		Тз.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 4, ДопустимыйЗнак.Любой)));
		ДокументПоступления=Неопределено;
		Для каждого СтрТз Из Тз Цикл
			лДокументПоступления=ДокументПоступления;
			ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();	
			Лико_ОбщегоНазначенияСервер.НайтиДокументПоступления(ДокументПоступления,Организация,СтрТз.Серия,Дата);
			Если Не ЗначениеЗаполнено(ДокументПоступления) И ЗначениеЗаполнено(лДокументПоступления) Тогда
				ДокументПоступления=лДокументПоступления;
			КонецЕсли;


			СтрТз.ДокументПоступления=ДокументПоступления;
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",СтрТз.Номенклатура);
			НайденыеСтроки=ДокументПоступления.Товары.НайтиСтроки(Структура);
			Для каждого СтрНайденыеСтроки Из НайденыеСтроки Цикл
				СтрТз.Цена=СтрНайденыеСтроки.Цена;
				СтрТз.СтавкаНДС=СтрНайденыеСтроки.СтавкаНДС;
			КонецЦикла;
		КонецЦикла;
		Тз.Свернуть("Номенклатура,ХарактеристикаПоступления,Цена,СтавкаНДС,ДокументПоступления","Количество");

		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		//НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров())); 
		//НовоеРаспоряжение.Товары.Загрузить(Тз);
		НовоеРаспоряжение.Товары.Очистить();
		Для каждого СтрТз Из Тз Цикл
			НоваяСтрТовары=НовоеРаспоряжение.Товары.Добавить();

			ЗаполнитьЗначенияСвойств(НоваяСтрТовары,СтрТз);
			НоваяСтрТовары.Характеристика=СтрТз.ХарактеристикаПоступления;
			НоваяСтрТовары.КоличествоУпаковок=НоваяСтрТовары.Количество;

		КонецЦикла;

		НовоеРаспоряжение.НалогообложениеНДС=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		НовоеРаспоряжение.СпособДоставки=Перечисления.СпособыДоставки.Самовывоз;
		НовоеРаспоряжение.Проведен=Ложь;
		НовоеРаспоряжение.Договор=ДокументПоступления.Договор;
		НовоеРаспоряжение.Валюта=ДокументПоступления.Валюта;
		НовоеРаспоряжение.ДокументПоступления=ДокументПоступления;
		НовоеРаспоряжение.ЦенаВключаетНДС=ДокументПоступления.ЦенаВключаетНДС;
		НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику;
		НовоеРаспоряжение.СпособКомпенсации=Перечисления.СпособыКомпенсацииВозвратовТоваров.ОставитьВКачествеАванса;
		НовоеРаспоряжение.Лико_НеНужныДвиженияОрдерныхСкладов=Истина;

		Для каждого НоваяСтрока Из НовоеРаспоряжение.Товары Цикл


			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСумму");
			//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ДокументОбъект.НалогообложениеНДС);
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовоеРаспоряжение.ЦенаВключаетНДС, НоваяСтрока.СтавкаНДС));
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);

		КонецЦикла;
		Попытка 				
			Если ЗначениеЗаполнено(ДокументПоступления) Тогда
				НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение);
			Иначе 
				НовоеРаспоряжение.Записать();
			КонецЕсли;
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

		КонецПопытки;


		Распоряжение=НовоеРаспоряжение.Ссылка;

	КонецЕсли;	

КонецПроцедуры


Процедура СоздатьРедактироватьПередачуВРемонт(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВРемонт Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
				НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ПередачаСырьяПереработчику.СоздатьДокумент();	
			НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров())); 			
		Попытка 				
			НовоеРаспоряжение.Записать(РежимЗаписи); 				
		Исключение
			НовоеРаспоряжение.Записать();
		КонецПопытки;
		
		Распоряжение=НовоеРаспоряжение.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры 



Процедура СоздатьРедактироватьПередачуВЭксплуатацию(Распоряжение, ДанныеЗаполнения, РежимЗаписи, Отказ)
	УстановитьПривилегированныйРежим(Истина);

	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Распоряжение2) Тогда
		//Возврат;
	КонецЕсли; 	
	
	Возврат;

	//Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Или ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание  Тогда

		Если ЗначениеЗаполнено(Распоряжение2) Тогда
			НовоеРаспоряжение=Распоряжение2.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		//ТоварыЭксплуатации(ДанныеЗаполнения);
		//Если  ДанныеЗаполнения.Товары.Количество()=0 Тогда
		//	Возврат;
		//КонецЕсли;
		НовоеРаспоряжение.Заполнить(Неопределено);

		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения); 
		НовоеРаспоряжение.Статус=Перечисления.СтатусыВнутреннихПотреблений.Принято;

		//НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров())); 
		//Тз=Товары.Выгрузить();
		////Тз=ДанныеЗаполнения.Товары.Выгрузить()
		//Тз.Свернуть("Номенклатура,Характеристика",Количество);
		//НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары);
		Запрос = Новый Запрос;

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
		|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
		|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
		|	Лико_ПередачаТоваровТовары.АдресХранения КАК АдресХранения,
		|	Лико_ПередачаТоваровТовары.Количество КАК Количество,
		|	Лико_ПередачаТоваровТовары.Количество КАК КоличествоУпаковок
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&ТЗ КАК Лико_ПередачаТоваровТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт.Номенклатура КАК Номенклатура,
		|	Вт.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА Вт.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
		|			ТОГДА Вт.Количество
		|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА Вт.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
		|			ТОГДА Вт.Количество
		|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
		|	КОНЕЦ КАК КоличествоУпаковок,
		|	НОмен.ЕдиницаИзмерения КАК Упаковка
		|ИЗ
		|	Вт КАК Вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&МомВрем,
		|				Серия В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						Вт.Серия КАК Серия
		|					ИЗ
		|						Вт КАК Вт)) КАК ТоварыНаСкладахОстатки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НОмен
		|			ПО ТоварыНаСкладахОстатки.Номенклатура = НОмен.Ссылка
		|		ПО Вт.Серия = ТоварыНаСкладахОстатки.Серия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|		ПО Вт.АдресХранения = СкладскиеЯчейки.Ссылка
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|	И НОмен.Ссылка В(&ТмцВЭксплуатации)
		|	И НЕ СкладскиеЯчейки.Лико_ОтветственноеХранение";
		ТзТовары=Товары.Выгрузить();

		Запрос.УстановитьПараметр("ТЗ", ТзТовары);
		Запрос.УстановитьПараметр("ТмцВЭксплуатации", Документы.Лико_ПередачаТоваров.ПолучитьНоменклатуруПодПередачуВЭксплуатацию(ТзТовары,Ссылка)); 		
		Запрос.УстановитьПараметр("МомВрем",?(ЗначениеЗаполнено(Ссылка), Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая),ТекущаяДата()));


		Тз = Запрос.Выполнить().Выгрузить();


		НовоеРаспоряжение.Товары.Загрузить(Тз); 
		//НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию;

		Для каждого Товар Из НовоеРаспоряжение.Товары  Цикл
			Если ЗначениеЗаполнено(Товар.Номенклатура.Лико_СтатьяРасходов) Тогда
				Товар.СтатьяРасходов=Товар.Номенклатура.Лико_СтатьяРасходов;
			Иначе
				Товар.СтатьяРасходов=Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Товар.Номенклатура);
				Если Не ЗначениеЗаполнено(Товар.СтатьяРасходов) Тогда
					Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяСписанияМатериаловНеопределена.ЗначениеПараметра;  
				КонецЕсли;

			КонецЕсли;

			Если БракМатериала Тогда
				Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяРасходовДляСписанияБракаМатериалов.ЗначениеПараметра;				
			КонецЕсли;
			Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура,Ссылка);
			Товар.КатегорияЭксплуатации= Справочники.Лико_ПредопределенныеЗначения.КатегорияЭксплуатации.ЗначениеПараметра;	
			Если ЗначениеЗаполнено(Правило) Тогда
				Товар.КатегорияЭксплуатации=Правило.КатегорияЭксплуатации;
			КонецЕсли;




			//Товар.СтатьяРасходов=Товар.КатегорияЭксплуатации.СтатьяРасходов;  			
			Товар.АналитикаРасходов=Подразделение;
			Товар.ФизическоеЛицо=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_ФизЛицоПриПередачеВЭксплуатацию");
			//Товар.Упаковка=Товар.Номенклатура.ЕдиницаИзмерения;
			//Товар.КоличествоУпаковок=Товар.Количество;
		КонецЦикла;
		Если  НовоеРаспоряжение.Товары.Количество()=0 Тогда
			Возврат ;
		КонецЕсли;

		Попытка 

			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

		КонецПопытки;
		Распоряжение2=НовоеРаспоряжение.Ссылка;
		ОбменДанными.Загрузка=Истина;
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;	


КонецПроцедуры

Процедура СоздатьРедактироватьСписание(Распоряжение, ДанныеЗаполнения, РежимЗаписи, Отказ)
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Распоряжение) Тогда
		//Возврат;
	КонецЕсли;


	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение);
			КонецЕсли;
		Иначе
			НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение);
		КонецЕсли;
		//ТоварыБезЭксплуатации(ДанныеЗаполнения);
		//Если  ДанныеЗаполнения.Товары.Количество()=0 Тогда
		//	Возврат;
		//КонецЕсли;

		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		//НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров()));
		//Тз=Товары.Выгрузить();
		////Тз=ДанныеЗаполнения.Товары.Выгрузить()
		//Тз.Свернуть("Номенклатура,Характеристика",Количество);
		//НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары);
		//Запрос = Новый Запрос;
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	СУММА(ТоварыНаСкладах.ВНаличии) КАК Количество,
		//|	ТоварыНаСкладах.Характеристика КАК Характеристика,
		//|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
		//|	ТоварыНаСкладах.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		//|	СУММА(ТоварыНаСкладах.ВНаличии) КАК КоличествоУпаковок
		//|ИЗ
		//|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		//|ГДЕ
		//|	ТоварыНаСкладах.Регистратор = &Ссылка
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТоварыНаСкладах.Номенклатура,
		//|	ТоварыНаСкладах.Характеристика";

        Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
		|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
		|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
		|	Лико_ПередачаТоваровТовары.АдресХранения КАК АдресХранения,
		|	Лико_ПередачаТоваровТовары.Количество КАК Количество,
		|	Лико_ПередачаТоваровТовары.Количество КАК КоличествоУпаковок
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&ТЗ КАК Лико_ПередачаТоваровТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт.Номенклатура КАК Номенклатура,
		|	Вт.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА Вт.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
		|			ТОГДА Вт.Количество
		|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА Вт.Количество <= ТоварыНаСкладахОстатки.ВНаличииОстаток
		|			ТОГДА Вт.Количество
		|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
		|	КОНЕЦ КАК КоличествоУпаковок,
		|	НОмен.ЕдиницаИзмерения КАК Упаковка
		|ИЗ
		|	Вт КАК Вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&МомВрем,
		|				Серия В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						Вт.Серия КАК Серия
		|					ИЗ
		|						Вт КАК Вт)) КАК ТоварыНаСкладахОстатки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НОмен
		|			ПО ТоварыНаСкладахОстатки.Номенклатура = НОмен.Ссылка
		|		ПО Вт.Серия = ТоварыНаСкладахОстатки.Серия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|		ПО Вт.АдресХранения = СкладскиеЯчейки.Ссылка
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		//|	И НЕ НОмен.Ссылка В (&ТмцВЭксплуатации)
		|	И НЕ СкладскиеЯчейки.Лико_ОтветственноеХранение
		|	И ВЫБОР
		|			КОГДА &СписаниеКраскиЧерезЦеховуюКладовую
		|				ТОГДА Вт.Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыКраска  Иначе Истина
		|		КОНЕЦ";
		ТзТовары=Товары.Выгрузить();

		Запрос.УстановитьПараметр("ТЗ", ТзТовары);
		Запрос.УстановитьПараметр("ТмцВЭксплуатации", Документы.Лико_ПередачаТоваров.ПолучитьНоменклатуруПодПередачуВЭксплуатацию(ТзТовары,Ссылка));
		Запрос.УстановитьПараметр("МомВрем",?(ЗначениеЗаполнено(Ссылка), Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая),ТекущаяДата()));
		
		//Запрос.УстановитьПараметр("Ссылка", Ссылка);

		
		//ЦеховаяКладоваяКраски=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_Колористическая");
		ЦеховаяКладоваяКраски=Склад.Лико_Площадка.ЦеховаяКладовая;
		Если  Ссылка.БракМатериала Тогда
			ЦеховаяКладоваяКраски=Неопределено;
		КонецЕсли;

		СписаниеКраскиЧерезЦеховуюКладовую=ЗначениеЗаполнено(ЦеховаяКладоваяКраски)
		и Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаСписаниеКраскиЧерезЦеховуюКладовую.ЗначениеПараметра<Дата;
		Запрос.УстановитьПараметр("СписаниеКраскиЧерезЦеховуюКладовую",СписаниеКраскиЧерезЦеховуюКладовую);
		Запрос.УстановитьПараметр("ВидНоменклатурыКраска",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);



		Тз = Запрос.Выполнить().Выгрузить();


		НовоеРаспоряжение.Товары.Загрузить(Тз);
		НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		Для каждого Товар Из НовоеРаспоряжение.Товары  Цикл
			Если ЗначениеЗаполнено(Товар.Номенклатура.Лико_СтатьяРасходов) Тогда
				Товар.СтатьяРасходов=Товар.Номенклатура.Лико_СтатьяРасходов;
			Иначе
				Товар.СтатьяРасходов=Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Товар.Номенклатура);
				Если Не ЗначениеЗаполнено(Товар.СтатьяРасходов) Тогда
					Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяСписанияМатериаловНеопределена.ЗначениеПараметра;
				КонецЕсли;

			КонецЕсли;

			Если БракМатериала Тогда
				Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяРасходовДляСписанияБракаМатериалов.ЗначениеПараметра;
			КонецЕсли;




			Товар.АналитикаРасходов=Справочники.Лико_ПредопределенныеЗначения.АналитикаРасходовСписанияМатериалов.ЗначениеПараметра;
			//Товар.Упаковка=Товар.Номенклатура.ЕдиницаИзмерения;
			//Товар.КоличествоУпаковок=Товар.Количество;
		КонецЦикла;
		Если  НовоеРаспоряжение.Товары.Количество()=0 Тогда
			Возврат ;
		КонецЕсли;

		Попытка

			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

		КонецПопытки;
		Распоряжение=НовоеРаспоряжение.Ссылка;
		ОбменДанными.Загрузка=Истина;
		Записать(РежимЗаписиДокумента.Запись);

	КонецЕсли;


КонецПроцедуры


Процедура СоздатьРедактироватьПродажа(Распоряжение, ДанныеЗаполнения, РежимЗаписи, Отказ)
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 
	ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
	Если ДляДокумента.Интеркампани Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа И Не ВнутренняяПродажа Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли; 

		Если  ТипЗнч(НовоеРаспоряжение)<>Тип("ДокументОбъект.РеализацияТоваровУслуг") ТОгда
			НовоеРаспоряжение=Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
		КонецЕсли;	

		ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
		//***************************************************
		//******************************************************
		//ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
		ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
		ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();

		НовоеРаспоряжение.БанковскийСчетОрганизации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовоеРаспоряжение.Организация);
		Если НЕ ЗначениеЗаполнено(НовоеРаспоряжение.БанковскийСчетОрганизации) Тогда
			НовоеРаспоряжение.БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовоеРаспоряжение.Организация, ВалютаРуб);
		КонецЕсли;
		НовоеРаспоряжение.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Контрагент, ВалютаРуб);
		НовоеРаспоряжение.Валюта =Валюта;
		НакладнаяНаЭкспорт = Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;

		НовоеРаспоряжение.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		НовоеРаспоряжение.ВалютаВзаиморасчетов = НовоеРаспоряжение.Валюта;
		НовоеРаспоряжение.Контрагент = Контрагент;
		НовоеРаспоряжение.Партнер = Партнер;
		//НовоеРаспоряжение.Подразделение = ПолучитьПодразделениеПоРегиону(ПерваяСтрока.ЗаказКлиента.Регион);
		НовоеРаспоряжение.Склад = Склад;
		НовоеРаспоряжение.Согласован = Истина;

		НовоеРаспоряжение.Соглашение = ДляДокумента.Соглашение;
		НовоеРаспоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
		НовоеРаспоряжение.ЦенаВключаетНДС = Истина;
		НовоеРаспоряжение.Автор = ПараметрыСеанса.ТекущийПользователь;
		НовоеРаспоряжение.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
		Отбор = Новый Структура("Валюта", Валюта);
		//КурсВалюты = РегистрыСведений.КурсыВалют.СрезПоследних(ДатаОтгрузки, Отбор);
		//НовоеРаспоряжение.Курс = КурсВалюты[0].Курс;
		//НовоеРаспоряжение.Кратность = КурсВалюты[0].Кратность;
		НовоеРаспоряжение.КурсЧислитель = 1;
		НовоеРаспоряжение.Курсзнаменатель = 1;
		НовоеРаспоряжение.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;  		
		НовоеРаспоряжение.СпособДоставки = ?(ЗначениеЗаполнено(ДляДокумента.СпособДоставки),ДляДокумента.СпособДоставки,Перечисления.СпособыДоставки.Самовывоз);		
		НовоеРаспоряжение.Комментарий = "" + НовоеРаспоряжение.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";


		ФизЛицо = АвторДокумента;
		НовоеРаспоряжение.Отпустил = ФизЛицо;
		НовоеРаспоряжение.ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Организация, НовоеРаспоряжение.Дата);
		Если НЕ ЗначениеЗаполнено(НовоеРаспоряжение.ОтпустилДолжность) Тогда
			НовоеРаспоряжение.ОтпустилДолжность = "Кладовщик";
		КонецЕсли;
		НовоеРаспоряжение.Менеджер = Автор;
		НовоеРаспоряжение.Руководитель = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовоеРаспоряжение.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Дата); 
		НовоеРаспоряжение.ГлавныйБухгалтер = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовоеРаспоряжение.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, НовоеРаспоряжение.Отпустил, НовоеРаспоряжение.Дата); 

		Если НовоеРаспоряжение.ВалютаВзаиморасчетов = ВалютаРуб Тогда
			// резидент
			Если НовоеРаспоряжение.Валюта = ВалютаРуб Тогда
				//НовоеРаспоряжение.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
			Иначе
				//НовоеРаспоряжение.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях;
			КонецЕсли;
		Иначе
			// не резидент
			Если НакладнаяНаЭкспорт Тогда
				// не резидент, ставка НДС = 0
				//НовоеРаспоряжение.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте;
			Иначе
				// резидент
				//НовоеРаспоряжение.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях;
			КонецЕсли;
		КонецЕсли;

		НовоеРаспоряжение.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;


		// Заполняем договор
		//ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
		НовоеРаспоряжение.Договор        =ДляДокумента.Договор; 			
		НовоеРаспоряжение.Основание		=НовоеРаспоряжение.Договор.Наименование;
		НовоеРаспоряжение.ОснованиеДата	=НовоеРаспоряжение.Договор.Дата;
		НовоеРаспоряжение.ОснованиеНомер=НовоеРаспоряжение.Договор.Номер;

		//Если НЕ ЗначениеЗаполнено(НовоеРаспоряжение.ДатаПлатежа) Тогда
		//	НовоеРаспоряжение.ДатаПлатежа = НовоеРаспоряжение.Дата;
		//КонецЕсли;

		//********************************
		//************************************
		Тз=ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров());
		Для каждого СтрТЗ Из Тз Цикл
			СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
			СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;			
		КонецЦикла;
		Тз.Свернуть("Номенклатура,Характеристика,Упаковка","Количество,КоличествоУпаковок");
		НовоеРаспоряжение.Товары.Загрузить(Тз); 			

		Для каждого Товар Из НовоеРаспоряжение.Товары Цикл
			Товар.Склад=Склад;			
			Товар.Цена = ЦеныНоменклатуры.Найти(Товар.Номенклатура,"Номенклатура").Цена;
			// резидент
			Товар.СтавкаНДС =  УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);

			ЕСли НовоеРаспоряжение.Дата>=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
				Если  Год(НовоеРаспоряжение.Дата)>=2026 Тогда
					Товар.СтавкаНДС   =    УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);
				Иначе
					Товар.СтавкаНДС   =    УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
				КонецЕсли;
			Иначе
				Товар.СтавкаНДС   =    УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18); 
			КонецЕсли;


			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСумму");
			//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", НовоеРаспоряжение.НалогообложениеНДС);
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовоеРаспоряжение.ЦенаВключаетНДС, Товар.СтавкаНДС));
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);

		КонецЦикла;


		//ВидОперации=Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
		НовоеРаспоряжение.Товары.Сортировать("Номенклатура,Характеристика");
		//НовоеРаспоряжение.ЗаполнитьЭтапыГрафикаОплаты();

		Попытка 				
			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

		КонецПопытки;

		ЕСли Не Отказ Тогда
			Распоряжение=НовоеРаспоряжение.Ссылка;
			СоздатьДокументСчетФактураВыданный(,Распоряжение);
			СоздатьДокументСчетНаОплатуКлиенту(,Распоряжение);
			ОбменДанными.Загрузка=Истина;
			Записать(РежимЗаписиДокумента.Запись);

		КонецЕсли;


	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры


Процедура СоздатьРедактироватьПродажаИнтеркампани(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 
	ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
	Если НЕ ДляДокумента.Интеркампани Тогда
		Возврат;
	КонецЕсли;
	ИнтерКампани=Истина;
	Если ДанныеЗаполнения.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа И Не ВнутренняяПродажа Тогда
		СоздатьРедактироватьПеремещение(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);
		СоздатьДокументЛико_ПередачаТоваровМеждуОрганизациями(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);
		
		
		
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

Процедура СоздатьРедактироватьПеремещение(Распоряжение, ДанныеЗаполнения, РежимЗаписи, Отказ)
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
		НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
		Если НовоеРаспоряжение=Неопределено Тогда
			НовоеРаспоряжение=Документы.ПеремещениеТоваров.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
		КонецЕсли;  				
	Иначе
		НовоеРаспоряжение=Документы.ПеремещениеТоваров.СоздатьДокумент();	
		//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
	КонецЕсли;  		
	Если  ТипЗнч(НовоеРаспоряжение)<>Тип("ДокументОбъект.ПеремещениеТоваров") ТОгда
		НовоеРаспоряжение=Документы.ПеремещениеТоваров.СоздатьДокумент();	
	КонецЕсли;	

	ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);




	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовоеРаспоряжение.Дата = Дата;
	//НовоеРаспоряжение.ДатаРаспоряжения = НовоеРаспоряжение.Дата;
	НовоеРаспоряжение.Организация = Организация;
	НовоеРаспоряжение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовоеРаспоряжение.Подразделение = Подразделение;
	НовоеРаспоряжение.СкладОтправитель = Склад;
	НовоеРаспоряжение.СкладПолучатель = Справочники.Лико_ПредопределенныеЗначения.СкладИнтеркампани.ЗначениеПараметра;
	НовоеРаспоряжение.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовоеРаспоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовоеРаспоряжение.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	НовоеРаспоряжение.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
    НовоеРаспоряжение.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;

	Тз=ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров());
	Для каждого СтрТЗ Из Тз Цикл
		СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
		СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;			
	КонецЦикла;
	Тз.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	НовоеРаспоряжение.Товары.Загрузить(Тз); 	
	НовоеРаспоряжение.Лико_Документ=Ссылка;	
	НовоеРаспоряжение.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);

	Если  НовоеРаспоряжение.Товары.Количество()=0 Тогда
		Возврат ;
	КонецЕсли;
        
	Попытка 

	 НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

	КонецПопытки;
	Распоряжение			=НовоеРаспоряжение.Ссылка;
	ОбменДанными.Загрузка	=Истина;
	Записать(РежимЗаписиДокумента.Запись);


КонецПроцедуры


Процедура СоздатьРедактироватьПеремещениеНаОтветственноеХранение( ДанныеЗаполнения, Отказ)
	
	ДокументСсылка=Лико_ОбщегоНазначенияСервер.НайтиДокумент("ПеремещениеТоваров","Лико_Документ",Ссылка);
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		НовоеРаспоряжение=ДокументСсылка.ПолучитьОбъект();
		Если НовоеРаспоряжение=Неопределено Тогда
			НовоеРаспоряжение=Документы.ПеремещениеТоваров.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
		КонецЕсли;  				
	Иначе
		НовоеРаспоряжение=Документы.ПеремещениеТоваров.СоздатьДокумент();	
		//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
	КонецЕсли;  		
	Если  ТипЗнч(НовоеРаспоряжение)<>Тип("ДокументОбъект.ПеремещениеТоваров") ТОгда
		НовоеРаспоряжение=Документы.ПеремещениеТоваров.СоздатьДокумент();	
	КонецЕсли;	
	
	//ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
	
	
	
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовоеРаспоряжение.Дата = Дата;
	//НовоеРаспоряжение.ДатаРаспоряжения = НовоеРаспоряжение.Дата;
	НовоеРаспоряжение.Организация = ДанныеЗаполнения.Организация;
	НовоеРаспоряжение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовоеРаспоряжение.Подразделение = Подразделение;
	НовоеРаспоряжение.СкладОтправитель = ДанныеЗаполнения.СкладОтправитель;
	НовоеРаспоряжение.СкладПолучатель = ДанныеЗаполнения.СкладПолучатель; ;
	НовоеРаспоряжение.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовоеРаспоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовоеРаспоряжение.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	НовоеРаспоряжение.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовоеРаспоряжение.Лико_НеНужныДвиженияОрдерныхСкладовУОтправителя=Истина;
	НовоеРаспоряжение.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	НовоеРаспоряжение.ПометкаУдаления=Ложь;
	Тз=ДанныеЗаполнения.Товары;
	//Для каждого СтрТЗ Из Тз Цикл
	//	СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
	//	СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;			
	//КонецЦикла;
	Тз.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	НовоеРаспоряжение.Товары.Загрузить(Тз); 	
	НовоеРаспоряжение.Лико_Документ=Ссылка;	
	НовоеРаспоряжение.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);
	
	Если  НовоеРаспоряжение.Товары.Количество()=0 Тогда
		Возврат ;
	КонецЕсли;
	
	Попытка 
		
		НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		
	КонецПопытки;
	Распоряжение			=НовоеРаспоряжение.Ссылка;
	ОбменДанными.Загрузка	=Истина;
	Записать(РежимЗаписиДокумента.Запись);
	
	
КонецПроцедуры


Процедура СоздатьРедактироватьПеремещениеТоваров(ДанныеЗаполнения, Отказ)
	ДокументСсылка=Лико_ОбщегоНазначенияСервер.НайтиДокумент("ПеремещениеТоваров","Лико_Документ",Ссылка);

	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДокОбъект=ДокументСсылка.ПолучитьОбъект();
		Если ДокОбъект=Неопределено Тогда
			ДокОбъект=Документы.ПеремещениеТоваров.СоздатьДокумент();	
			//ДокОбъект.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
		КонецЕсли;  				
	Иначе
		ДокОбъект=Документы.ПеремещениеТоваров.СоздатьДокумент();	
		//ДокОбъект.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
	КонецЕсли;  		
	Если  ТипЗнч(ДокОбъект)<>Тип("ДокументОбъект.ПеремещениеТоваров") ТОгда
		ДокОбъект=Документы.ПеремещениеТоваров.СоздатьДокумент();	
	КонецЕсли;	

	//ЗаполнитьЗначенияСвойств(ДокОбъект,ДанныеЗаполнения);

	ЗаполнитьЗначенияСвойств(ДокОбъект,ДанныеЗаполнения);


	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокОбъект.Дата = Дата;
	//ДокОбъект.ДатаРаспоряжения = ДокОбъект.Дата;
	ДокОбъект.Организация = Организация;
	ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокОбъект.Подразделение = Подразделение;
	//ДокОбъект.СкладОтправитель =ДанныеЗаполнения.СкладОтправитель;
	//ДокОбъект.СкладПолучатель = ДанныеЗаполнения.СкладПолучатель; ;
	ДокОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	ДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	ДокОбъект.Лико_НеНужныДвиженияОрдерныхСкладовУОтправителя=Истина;
	ДокОбъект.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	ДокОбъект.ПометкаУдаления=Ложь;
	Тз=Товары.Выгрузить();;
	Для каждого СтрТЗ Из Тз Цикл
		СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
		СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;			
	КонецЦикла;
	Тз.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	ДокОбъект.Товары.Загрузить(Тз); 	
	ДокОбъект.Лико_Документ=Ссылка;	
	ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);

	Если  ДокОбъект.Товары.Количество()=0 Тогда
		Возврат ;
	КонецЕсли;

	Попытка 

		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + ДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

	КонецПопытки;


КонецПроцедуры
  
Процедура СоздатьРедактироватьПередачаТоваровХранителю(ДанныеЗаполнения, Отказ)

	ДокументСсылка=Лико_ОбщегоНазначенияСервер.НайтиДокумент("ПередачаТоваровХранителю","Лико_Документ",Ссылка);

	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДокОбъект=ДокументСсылка.ПолучитьОбъект();
		Если ДокОбъект=Неопределено Тогда
			ДокОбъект=Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
			//ДокОбъект.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
		КонецЕсли;  				
	Иначе
		ДокОбъект=Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
		//ДокОбъект.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
	КонецЕсли;  		
	Если  ТипЗнч(ДокОбъект)<>Тип("ДокументОбъект.ПередачаТоваровХранителю") ТОгда
		ДокОбъект=Документы.ПередачаТоваровХранителю.СоздатьДокумент();	
	КонецЕсли;	

	//ЗаполнитьЗначенияСвойств(ДокОбъект,ДанныеЗаполнения);

	ЗаполнитьЗначенияСвойств(ДокОбъект,ДанныеЗаполнения);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПередачаТоваровХранителю.Соглашение КАК Соглашение,
	|	ПередачаТоваровХранителю.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ПередачаТоваровХранителю.СпособДоставки КАК СпособДоставки,
	|	ПередачаТоваровХранителю.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ПередачаТоваровХранителю.АдресДоставки КАК АдресДоставки,
	|	ПередачаТоваровХранителю.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ПередачаТоваровХранителю.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	ПередачаТоваровХранителю.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
	|	ПередачаТоваровХранителю.Основание КАК Основание,
	|	ПередачаТоваровХранителю.Договор КАК Договор,
	|	ПередачаТоваровХранителю.Валюта КАК Валюта,
	|	ПередачаТоваровХранителю.Дата КАК Дата,
	|	ПередачаТоваровХранителю.Партнер КАК Партнер,
	|	ПередачаТоваровХранителю.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|ГДЕ
	|	ПередачаТоваровХранителю.Контрагент = &Контрагент
	|	И ПередачаТоваровХранителю.Склад = &Склад
	|	И ПередачаТоваровХранителю.Дата < &Дата
	|	И ПередачаТоваровХранителю.Лико_ОбразецДляЗаполнения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";  

	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Запрос.УстановитьПараметр("Склад",ДанныеЗаполнения.Склад );
	Запрос.УстановитьПараметр("Дата",Дата );

	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначенияСвойств(ДокОбъект,Выборка);

	КонецЦикла; 




	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокОбъект.Дата = Дата;
	//ДокОбъект.ДатаРаспоряжения = ДокОбъект.Дата;
	ДокОбъект.Организация = Организация;
	ДокОбъект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	ДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	ДокОбъект.Лико_НеНужныДвиженияОрдерныхСкладов=Истина;
	ДокОбъект.ПометкаУдаления=Ложь;
	Тз=Товары.Выгрузить();
		Для каждого СтрТЗ Из Тз Цикл
		СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
		СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;			
	КонецЦикла;
	Тз.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	ДокОбъект.Товары.Загрузить(Тз); 	
	ДокОбъект.Лико_Документ=Ссылка;	
	ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);

	Если  ДокОбъект.Товары.Количество()=0 Тогда
		Возврат ;
	КонецЕсли;

	Попытка

		Для каждого Товар Из ДокОбъект.Товары Цикл

			Товар.Склад=ДокОбъект.Склад;
			ЦенаНоменклатуры=ЦеныНоменклатуры.Найти(Товар.Номенклатура,"Номенклатура");

			Если   ЦенаНоменклатуры<>Неопределено Тогда 				
				Товар.Цена			=	ЦенаНоменклатуры.Цена; 				
				СтруктураДействий 	= Новый Структура;				
				СтруктураДействий.Вставить("ПересчитатьСумму"); 				
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);   			

			КонецЕсли;

		КонецЦикла;

		ДокОбъект.ДополнительныеСвойства.Вставить("ПерезаполнитьВидыЗапасов",Истина);  	
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + ДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

	КонецПопытки;


КонецПроцедуры
 
Процедура СоздатьРедактироватьПоступлениеТоваровОтХранителя(ДанныеЗаполнения, Отказ)

	ДокументСсылка=Лико_ОбщегоНазначенияСервер.НайтиДокумент("ПоступлениеТоваровОтХранителя","Лико_Документ",Ссылка);

	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДокОбъект=ДокументСсылка.ПолучитьОбъект();
		Если ДокОбъект=Неопределено Тогда
			ДокОбъект=Документы.ПоступлениеТоваровОтХранителя.СоздатьДокумент();	
			//ДокОбъект.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
		КонецЕсли;  				
	Иначе
		ДокОбъект=Документы.ПоступлениеТоваровОтХранителя.СоздатьДокумент();	
		//ДокОбъект.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
	КонецЕсли;  		
	Если  ТипЗнч(ДокОбъект)<>Тип("ДокументОбъект.ПоступлениеТоваровОтХранителя") ТОгда
		ДокОбъект=Документы.ПоступлениеТоваровОтХранителя.СоздатьДокумент();	
	КонецЕсли;	

	//ЗаполнитьЗначенияСвойств(ДокОбъект,ДанныеЗаполнения);

	ЗаполнитьЗначенияСвойств(ДокОбъект,ДанныеЗаполнения);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваровОтХранителя.Соглашение КАК Соглашение,
	|	ПоступлениеТоваровОтХранителя.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ПоступлениеТоваровОтХранителя.Договор КАК Договор,
	|	ПоступлениеТоваровОтХранителя.Валюта КАК Валюта,
	|	ПоступлениеТоваровОтХранителя.Дата КАК Дата,
	|	ПоступлениеТоваровОтХранителя.Партнер КАК Партнер,
	|	ПоступлениеТоваровОтХранителя.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровОтХранителя.Подразделение КАК Подразделение,
	|	ПоступлениеТоваровОтХранителя.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров
	|ИЗ
	|	Документ.ПоступлениеТоваровОтХранителя КАК ПоступлениеТоваровОтХранителя
	|ГДЕ
	|	ПоступлениеТоваровОтХранителя.Контрагент = &Контрагент
	|	И ПоступлениеТоваровОтХранителя.Склад = &Склад
	|	И ПоступлениеТоваровОтХранителя.Дата < &Дата
	|	И ПоступлениеТоваровОтХранителя.Лико_ОбразецДляЗаполнения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";  

	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Запрос.УстановитьПараметр("Склад",ДанныеЗаполнения.Склад );
	Запрос.УстановитьПараметр("Дата",Дата );

	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначенияСвойств(ДокОбъект,Выборка);

	КонецЦикла; 




	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокОбъект.Дата = Дата;
	//ДокОбъект.ДатаРаспоряжения = ДокОбъект.Дата;
	ДокОбъект.Организация = Организация;
	ДокОбъект.Менеджер = ПараметрыСеанса.ТекущийПользователь; 
	ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	ДокОбъект.Лико_НеНужныДвиженияОрдерныхСкладов=Истина;
	ДокОбъект.ПометкаУдаления=Ложь;
	Тз=Товары.Выгрузить();
    	Для каждого СтрТЗ Из Тз Цикл
		СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
		СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;			
	КонецЦикла;
	Тз.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	ДокОбъект.Товары.Загрузить(Тз); 	
	ДокОбъект.Лико_Документ=Ссылка;	
	ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);

	Если  ДокОбъект.Товары.Количество()=0 Тогда
		Возврат ;
	КонецЕсли;

	Попытка

		Для каждого Товар Из ДокОбъект.Товары Цикл

			ЦенаНоменклатуры=ЦеныНоменклатуры.Найти(Товар.Номенклатура,"Номенклатура");

			Если   ЦенаНоменклатуры<>Неопределено Тогда 				
				Товар.Цена			=	ЦенаНоменклатуры.Цена; 				
				СтруктураДействий 	= Новый Структура;				
				СтруктураДействий.Вставить("ПересчитатьСумму"); 				
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);   			

			КонецЕсли;

		КонецЦикла;

		ДокОбъект.ДополнительныеСвойства.Вставить("ПерезаполнитьВидыЗапасов",Истина);  	
		
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		ДокОбъект.Записать(РежимЗаписи);
		
	Исключение
		Отказ = Истина;
		Сообщить(" Не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());

	КонецПопытки;


КонецПроцедуры


Процедура СоздатьДокументЛико_ПередачаТоваровМеждуОрганизациями(Распоряжение, ДанныеЗаполнения, РежимЗаписи, Отказ)
	УстановитьПривилегированныйРежим(Истина); 
	Если ЗначениеЗаполнено(РаспоряжениеИнтеркампани) Тогда 
		НовоеРаспоряжение=РаспоряжениеИнтеркампани.ПолучитьОбъект();
		Если НовоеРаспоряжение=Неопределено Тогда
			НовоеРаспоряжение=Документы.Лико_ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();				
		КонецЕсли;  				
	Иначе
		НовоеРаспоряжение=Документы.Лико_ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();			
	КонецЕсли;  		
	Если  ТипЗнч(НовоеРаспоряжение)<>Тип("ДокументОбъект.Лико_ПередачаТоваровМеждуОрганизациями") ТОгда
		НовоеРаспоряжение=Документы.Лико_ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();	
	КонецЕсли;	
	
	
	
	НовоеРаспоряжение.Дата	 					 = Дата;
	НовоеРаспоряжение.ТипДокумента	 			 = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.Интеркампани;
	НовоеРаспоряжение.СкладПродажи  			 = Справочники.Лико_ПредопределенныеЗначения.СкладИнтеркампани.ЗначениеПараметра;
	НовоеРаспоряжение.Валюта   					 = Валюта;
	НовоеРаспоряжение.НалогообложениеНДС  		 = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	НовоеРаспоряжение.ЦенаВключаетНДС   		 = ЦенаВключаетНДС;
	НовоеРаспоряжение.Автор   					 = ПараметрыСеанса.ТекущийПользователь;
	НовоеРаспоряжение.ПодписьЗаГлавногоБухгалтера= АвторДокумента;
	НовоеРаспоряжение.ПодписьЗаРуководителя		 = АвторДокумента;
	НовоеРаспоряжение.ПодписьОтпустил            = АвторДокумента;
	
	
	НовоеРаспоряжение.ОрганизацияПродавец   	= Организация;
	НовоеРаспоряжение.ПометкаУдаления			= Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииДополнительныеРеквизиты.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации.ДополнительныеРеквизиты КАК ОрганизацииДополнительныеРеквизиты
	|ГДЕ
	|	ОрганизацииДополнительныеРеквизиты.Значение = &Контрагент
	|	И ОрганизацииДополнительныеРеквизиты.Свойство.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя","КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2" );
	Запрос.УстановитьПараметр("Контрагент",Контрагент );                                                                            
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовоеРаспоряжение.ОрганизацияПокупатель=Выборка.Организация; 
	КонецЦикла;	
	ДляДокумента=ПолучитьСтруктуруДляЗаполненияТиповыхДокументов();
	НовоеРаспоряжение.ДоговорМеждуОрганизациями =ДляДокумента.Договор; 
	Если НЕ ЗначениеЗаполнено(НовоеРаспоряжение.ДоговорМеждуОрганизациями) Тогда  			
		Возврат ;
	КонецЕсли;
	
	НовоеРаспоряжение.Комментарий 	= "Создан автоматически на основании документа """ + Ссылка + """"; 		
	
	
	Тз=ДанныеЗаполнения.Товары.Выгрузить(,ПоляТаблицыТоваров());
	Для каждого СтрТЗ Из Тз Цикл
		СтрТЗ.КоличествоУпаковок= СтрТЗ.Количество;
		СтрТЗ.Упаковка= СтрТЗ.Номенклатура.ЕдиницаИзмерения;			
	КонецЦикла;
	Тз.Свернуть("Номенклатура,Характеристика","Количество");
	НовоеРаспоряжение.Товары.Загрузить(Тз); 			
	
	Для каждого Товар Из НовоеРаспоряжение.Товары Цикл
		
		Товар.Цена 			= ЦеныНоменклатуры.Найти(Товар.Номенклатура,"Номенклатура").Цена; 
		
	 	Если  Год(НовоеРаспоряжение.Дата)>=2026 Тогда
			
			Товар.СтавкаНДС   	=  УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22); 
			
		Иначе 			
			
			Товар.СтавкаНДС   	=  УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20); 
			
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму","Количество");
		
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовоеРаспоряжение.ЦенаВключаетНДС, Товар.СтавкаНДС));
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);
		
	КонецЦикла;
	НовоеРаспоряжение.Товары.Сортировать("Номенклатура,Характеристика");	
	НовоеРаспоряжение.Лико_Документ=Ссылка;	
	
	Если  НовоеРаспоряжение.Товары.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Попытка			
		НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		
	КонецПопытки;
	РаспоряжениеИнтеркампани			=НовоеРаспоряжение.Ссылка;
	ОбменДанными.Загрузка	=Истина;
	Записать(РежимЗаписиДокумента.Запись);
	
	
КонецПроцедуры

Функция ПолучитьСтруктуруДляЗаполненияТиповыхДокументов() //+Лико m.shenderov 24.02.2018
	
	Структура = Новый Структура;
	Структура.Вставить("Договор"		,Неопределено) ;
	Структура.Вставить("Соглашение"		,Неопределено) ;
	Структура.Вставить("СпособДоставки"	,Неопределено) ;
	Структура.Вставить("Интеркампани"	,ложь) ;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаполениеРегламентированныхДокументов.Договор КАК Договор,
	|	Лико_ЗаполениеРегламентированныхДокументов.Соглашение КАК Соглашение,
	|	Лико_ЗаполениеРегламентированныхДокументов.СпособДоставки КАК СпособДоставки,
	|	Лико_ЗаполениеРегламентированныхДокументов.Интеркампани КАК Интеркампани
	|ИЗ
	|	РегистрСведений.Лико_ЗаполениеРегламентированныхДокументов КАК Лико_ЗаполениеРегламентированныхДокументов
	|ГДЕ
	|	Лико_ЗаполениеРегламентированныхДокументов.Контрагент = &Контрагент
	|	И Лико_ЗаполениеРегламентированныхДокументов.Валюта = &Валюта
	|	И Лико_ЗаполениеРегламентированныхДокументов.ТипОперации = &ВидОперации
	|	И Лико_ЗаполениеРегламентированныхДокументов.Организация = &Организация";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Запрос.УстановитьПараметр("Валюта",Валюта );
	Запрос.УстановитьПараметр("ВидОперации",ВидОперации);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура.Договор			=Выборка.Договор;
		Структура.Соглашение		=Выборка.Соглашение;
		Структура.СпособДоставки	=Выборка.СпособДоставки;
		Структура.Интеркампани	    =Выборка.Интеркампани;
		
	КонецЦикла; 
	
	
	Возврат Структура;
	
	
КонецФункции //-Лико m.shenderov 24.02.2018 


Функция СоздатьДокументСчетФактураВыданный(УжеСозданныйДокумент = Неопределено, Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Док.Ссылка КАК Ссылка ИЗ Документ.СчетФактураВыданный КАК Док ГДЕ Док.ДокументОснование = &Основание";
	Запрос.УстановитьПараметр("Основание",Основание);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		УжеСозданныйДокумент=Выборка.Ссылка;
	КонецЦикла; 
	
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
	НовыйДокОбъект.Дата = Основание.Дата;
	НовыйДокОбъект.Номер = Основание.Номер;
	НовыйДокОбъект.ПредставлениеНомера = Документы.СчетФактураВыданный.ПолучитьПредставлениеНомера(НовыйДокОбъект);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", Основание);
	ДанныеЗаполнения.Вставить("Организация", Основание.Организация);
	ДанныеЗаполнения.Вставить("ДатаВыставления", Основание.Дата);
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	Если НовыйДокОбъект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		НовыйДокОбъект.Валюта = Основание.Валюта;
	КонецЕсли;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументСчетНаОплатуКлиенту(УжеСозданныйДокумент = Неопределено, Основание)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Док.Ссылка КАК Ссылка ИЗ Документ.СчетНаОплатуКлиенту КАК Док ГДЕ Док.ДокументОснование = &Основание";
	Запрос.УстановитьПараметр("Основание",Основание);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		УжеСозданныйДокумент=Выборка.Ссылка;
	КонецЦикла; 
	
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
	НовыйДокОбъект.Дата = Основание.Дата;
	НомерДоговора = СокрЛП(Основание.Договор.Номер);
	НовыйДокОбъект.Заполнить(Основание);	
	НовыйДокОбъект.Менеджер = Основание.Менеджер;
	СтруктураОснования = Лико_Дополнительно.СформироватьОснованиеРеализацииПоДоговору(Основание.Договор, Основание.Дата, Истина);
	Если СтруктураОснования <> Неопределено И ЗначениеЗаполнено(СтруктураОснования.ТекстОснования) Тогда
		НовыйДокОбъект.ДополнительнаяИнформация = СтруктураОснования.ТекстОснования;
	КонецЕсли;
	
	НовыйДокОбъект.ГлавныйБухгалтер = Основание.ГлавныйБухгалтер;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	
	Если НовыйДокОбъект.ЭтапыГрафикаОплаты.Количество() > 0 И НовыйДокОбъект.ЭтапыГрафикаОплаты.Итог("ПроцентПлатежа") < 100 Тогда
		НовыйДокОбъект.ЭтапыГрафикаОплаты[0].ПроцентПлатежа = НовыйДокОбъект.ЭтапыГрафикаОплаты[0].ПроцентПлатежа + 100 - НовыйДокОбъект.ЭтапыГрафикаОплаты.Итог("ПроцентПлатежа");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерДоговора) И СтрДлина(НомерДоговора) <=10 Тогда
		НовыйДокОбъект.Номер = Лико_Дополнительно.ПолучитьНомерДокументаДляСчетаНаОплатуКлиенту(НовыйДокОбъект, НомерДоговора);
	КонецЕсли;
	
	Если УжеСозданныйДокумент = Неопределено Тогда
		// Попробуем найти документ с таким номером
		УжеСозданныйДокумент = Документы.СчетНаОплатуКлиенту.НайтиПоНомеру(НовыйДокОбъект.Номер, НовыйДокОбъект.Дата);
		Если НЕ ЗначениеЗаполнено(УжеСозданныйДокумент) Тогда
			УжеСозданныйДокумент = Неопределено;
		КонецЕсли;
	КонецЕсли;		
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		СписокИсключаемыхРеквизитов = "Ссылка";
		Если НовыйДокОбъект.Номер = "" Тогда
			СписокИсключаемыхРеквизитов = СписокИсключаемыхРеквизитов + ",Номер";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,СписокИсключаемыхРеквизитов);
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		//ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции


// Процедура предназначена для преобразования номера документа.
//
// Параметры:
//  Документ - (ДокументСсылка), документ, чей номер надо получить для печати.
//
// Возвращаемое значение.
//  Строка - номер документа для печати
//
Функция ПолучитьНомерНаПечать(Документ, МассивПрефиксов = Неопределено) Экспорт
	
	Если Документ = Неопределено Тогда 
		Возврат 0;
	КонецЕсли;
	
	Номер   = СокрЛП(Документ.Номер);
	Префикс = "";
	Если МассивПрефиксов = Неопределено Тогда
		
		Организация = Неопределено;
		
		Если ТипЗнч(Документ) = Тип("ВыборкаИзРезультатаЗапроса")
			ИЛИ ТипЗнч(Документ) = Тип("Структура") Тогда
			
			Организация = Документ.Организация;
			
		Иначе
			
			МетаданныеДокумента = Документ.Метаданные();
			
			Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
				
				Организация = Документ.Организация;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивПрефиксовДляОбхода = СформироватьМассивПрефиксовДляРИБИОрганизации(Организация)
		
	Иначе
		
		МассивПрефиксовДляОбхода = МассивПрефиксов;
		
	КонецЕсли;
	
	Для Каждого ТекущийПрефикс ИЗ МассивПрефиксовДляОбхода Цикл
		
		// удаление префикса из номера документа
		Если Найти(Номер, ТекущийПрефикс)=1 Тогда 
			Номер = Сред(Номер, СтрДлина(ТекущийПрефикс)+1);
		КонецЕсли;
		
		// так же, может остаться "минус" впереди
		Если Лев(Номер, 1) = "-" Тогда
			Номер = Сред(Номер, 2);
		КонецЕсли;
		
		// удаление ведущих нулей
		Пока Лев(Номер, 1)="0" Цикл
			Номер = Сред(Номер, 2);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Номер;
	
КонецФункции // ПолучитьНомерНаПечать()


Функция СформироватьМассивПрефиксовДляРИБИОрганизации(Организация) Экспорт
	
	МассивПрефиксов = ПолучитьМассивПрефиксовРИБ();	
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Префикс = СокрЛП(Организация.Префикс);
		
		Если Префикс <> "" Тогда
			МассивПрефиксов.Добавить(Префикс);
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивПрефиксов.Количество() = 0 Тогда
		МассивПрефиксов.Добавить("");
	КонецЕсли;
	
	Возврат МассивПрефиксов;
	
КонецФункции


Функция ПолучитьМассивПрефиксовРИБ()
	
	МассивПрефиксов = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ Различные
	|	ПрефиксыИнформационныхБаз.Префикс КАК Префикс
	|ИЗ
	|	Справочник.Организации КАК ПрефиксыИнформационныхБаз";
	
	ВыборкаУзлов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		
		Если Не ПустаяСтрока(ВыборкаУзлов.Префикс) Тогда
			
			МассивПрефиксов.Добавить(ВыборкаУзлов.Префикс);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МассивПрефиксов;
	
КонецФункции


Процедура СобратьВХарактеристикуПоступления(Номенклатура, Характеристика, ХарактеристикаПоступления, Количество)
	
	ТЗ=Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура,ХарактеристикаПоступления","Количество");
	
	
	Для каждого ТзТовар Из ТЗ  Цикл
		ДокументСборки=НайтиДокументСборки(ТзТовар.Номенклатура);
		
		Если ДокументСборки<>Неопределено Тогда
			ДокОбъект=ДокументСборки.ПолучитьОбъект();
		Иначе
			ДокОбъект=Документы.СборкаТоваров.СоздатьДокумент(); 
		КонецЕсли;  
		
		ДокОбъект.Дата                 					=Дата;
	ДокОбъект.Склад                 				=Склад;
	ДокОбъект.Организация           				=Организация;
	ДокОбъект.ХозяйственнаяОперация 				=Перечисления.ХозяйственныеОперации.СборкаТоваров;	   
	ДокОбъект.ВариантПриемкиТоваров 				=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	ДокОбъект.СборкаПодДеятельность    				=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ДокОбъект.Лико_Документ            				=Ссылка;
	ДокОбъект.Лико_НеНужныДвиженияОрдерныхСкладов	=Истина;
	ДокОбъект.Номенклатура							=ТзТовар.Номенклатура;
	ДокОбъект.Характеристика						=ТзТовар.ХарактеристикаПоступления;
	ДокОбъект.Количество							=ТзТовар.Количество;
	ДокОбъект.КоличествоУпаковок					=ТзТовар.Количество;
	ДокОбъект.Статус								=Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	ДокОбъект.Комментарий							=СтрШаблон("Создан автоматически на основании документа: ""%1""",Ссылка);	
	ДокОбъект.ПометкаУдаления						=Ложь;
	ДокОбъект.Товары.Очистить();
	Количество=0;
	Для каждого  Товар Из Товары Цикл
		
		Если Товар.Номенклатура=ТзТовар.Номенклатура 
			И Товар.ХарактеристикаПоступления<>Товар.Характеристика 
			И Товар.ХарактеристикаПоступления=ТзТовар.ХарактеристикаПоступления Тогда 
			НовыйТовар					  					=ДокОбъект.Товары.Добавить();
			НовыйТовар.Номенклатура		  					=Товар.Номенклатура;
			НовыйТовар.Характеристика	  					=Товар.Характеристика;
			НовыйТовар.Количество		  					=Товар.Количество;
			НовыйТовар.КоличествоУпаковок 					=Товар.Количество;
			НовыйТовар.ДоляСтоимости      					=Товар.Количество;
			Количество=Количество+Товар.Количество;
		КонецЕсли;
		
			
		КонецЦикла;
		
        	ДокОбъект.Количество							=Количество;
	ДокОбъект.КоличествоУпаковок							=Количество;


	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 



		
	КонецЦикла;
	
	
	//ДокументСборки=НайтиДокументСборки(Номенклатура);

	//Если ДокументСборки<>Неопределено Тогда
	//	ДокОбъект=ДокументСборки.ПолучитьОбъект();
	//Иначе
	//	ДокОбъект=Документы.СборкаТоваров.СоздатьДокумент(); 
	//КонецЕсли;

	//ДокОбъект.Дата                 					=Дата;
	//ДокОбъект.Склад                 				=Склад;
	//ДокОбъект.Организация           				=Организация;
	//ДокОбъект.ХозяйственнаяОперация 				=Перечисления.ХозяйственныеОперации.СборкаТоваров;	   
	//ДокОбъект.ВариантПриемкиТоваров 				=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	//ДокОбъект.СборкаПодДеятельность    				=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	//ДокОбъект.Лико_Документ            				=Ссылка;
	//ДокОбъект.Лико_НеНужныДвиженияОрдерныхСкладов	=Истина;
	//ДокОбъект.Номенклатура							=Номенклатура;
	//ДокОбъект.Характеристика						=ХарактеристикаПоступления;
	//ДокОбъект.Количество							=Количество;
	//ДокОбъект.КоличествоУпаковок					=Количество;
	//ДокОбъект.Статус								=Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	//ДокОбъект.Комментарий							=СтрШаблон("Создан автоматически на основании документа: ""%1""",Ссылка);	
	//ДокОбъект.ПометкаУдаления						=Ложь;
	////ДокОбъект.Товары.Очистить();
	//НовыйТовар					  					=ДокОбъект.Товары.Добавить();
	//НовыйТовар.Номенклатура		  					=Номенклатура;
	//НовыйТовар.Характеристика	  					=Характеристика;
	//НовыйТовар.Количество		  					=Количество;
	//НовыйТовар.КоличествоУпаковок 					=Количество;
	//НовыйТовар.ДоляСтоимости      					=100;


	//ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 





КонецПроцедуры


Функция НайтиДокументСборки(Номенклатура) //+Лико m.shenderov 07.06.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборкаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|	СборкаТоваров.Лико_Документ = &Лико_Документ
	|	И СборкаТоваров.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("Лико_Документ",Ссылка );

	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	        Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 07.06.2021 





#Область Распределение_Краски


Процедура СоздатьЗаказМатериаловПроизводствоПоТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Списание Тогда
		Возврат;
	КонецЕсли;      
	
	Таблица =  Движения.ТоварыКОтгрузке.Выгрузить();

	
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	лЗаказМатериаловВПроизводство=Неопределено;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Если ТипЗнч(СтрокаТаблицы.ДокументОтгрузки)=Тип("ДокументСсылка.ЗаказМатериаловВПроизводство") Тогда
			лЗаказМатериаловВПроизводство=СтрокаТаблицы.ДокументОтгрузки;
			Прервать;
		КонецЕсли;
		
		
	КонецЦикла;
	Если лЗаказМатериаловВПроизводство=Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ДокументОтгрузки",лЗаказМатериаловВПроизводство);
	НайденыеТовары=Таблица.НайтиСтроки(СтруктураОтбора);
	
	
	
	НовоеРаспоряжение					=лЗаказМатериаловВПроизводство.ПолучитьОбъект();
	НовоеРаспоряжение.Дата				=Дата;
	НовоеРаспоряжение.ПометкаУдаления	=Ложь;
	НовоеРаспоряжение.Товары.Очистить();
	
	Для каждого Товар Из НайденыеТовары Цикл
		НовыйТовар							=НовоеРаспоряжение.Товары.Добавить();
		НовыйТовар.Номенклатура				=Товар.Номенклатура;
		НовыйТовар.Характеристика			=Товар.Характеристика;
		НовыйТовар.Количество				=Товар.КОтгрузке;
		НовыйТовар.КоличествоУпаковок		=Товар.КОтгрузке;				
		НовыйТовар.ВариантОбеспечения		=Перечисления.ВариантыОбеспечения.Отгрузить;
		НовыйТовар.НачалоОтгрузки			=Дата;
		НовыйТовар.ОкончаниеПоступления		=Дата; 
	КонецЦикла;
	
	Ошибка=Неопределено;
	Попытка 				
		НовоеРаспоряжение.ПометкаУдаления=Ложь;
		НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 	
	Исключение
		Отказ=Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
	КонецПопытки;	
	
	Если Не Отказ Тогда
		СоздатьДокументДвижениеМатериалов(лЗаказМатериаловВПроизводство,Отказ);	
	КонецЕсли;
	
КонецПроцедуры 

Процедура СоздатьДокументДвижениеМатериалов(ЗаказМатериаловВПроизводство,Отказ)		
	
	
	НовыйДокОбъект 					= Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	НовыйДокОбъект.Дата 			= Дата;		
	Массив 							= Новый Массив();
	Массив.Добавить(ЗаказМатериаловВПроизводство);		
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
	Массив, ЗаказМатериаловВПроизводство.ХозяйственнаяОперация);
	
	
	ДанныеЗаполнения = ПараметрыОткрытия.Основание;
	ДанныеЗаполнения.Вставить("Товары", ЗаказМатериаловВПроизводство.Товары.Выгрузить());
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	НовыйДокОбъект.Лико_Документ=Ссылка;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Статус=Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	ПередачаМатериаловВКладовую=НайтиДокументПередачиМатериаловВКладовую(ЗаказМатериаловВПроизводство);
	Если  ЗначениеЗаполнено(ПередачаМатериаловВКладовую)  Тогда
		УжеСозданныйДокументОбъект = ПередачаМатериаловВКладовую.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки()); 			
		ВызватьИсключение;
	КонецПопытки;		
КонецПроцедуры

Функция НайтиДокументПередачиМатериаловВКладовую(ЗаказМатериаловВПроизводство) //+Лико m.shenderov 30.05.2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеПродукцииИМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Лико_Документ = &Лико_Документ
	|	И ДвижениеПродукцииИМатериалов.Распоряжение = &Распоряжение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДвижениеПродукцииИМатериалов.Дата";
	Запрос.УстановитьПараметр("Лико_Документ",Ссылка);
	Запрос.УстановитьПараметр("Распоряжение",ЗаказМатериаловВПроизводство);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка; 	
	КонецЦикла;	
	
КонецФункции //-Лико m.shenderov 30.05.2019 

#КонецОбласти



#КонецОбласти

#Область Списание_номенклатуры_по_правилу

Функция СписаниеНоменклатурыПоПравилу() //+Лико m.shenderov 02.06.2020
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ВнутреннееПотребление"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
	
	МассивТиповСклад = Новый Массив;
	МассивТиповСклад.Добавить(Тип("СправочникСсылка.Склады"));
	МассивТиповСклад.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	
	
	ТаблицаСписанияНоменклатуры=Новый ТаблицаЗначений;
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Распоряжение",Новый ОписаниеТипов(МассивТипов));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("КоличествоУпаковок",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("СписатьСЯчейки",Новый ОписаниеТипов("Булево"));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("КоличествоБУ",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Правило",Новый ОписаниеТипов("СправочникСсылка.Лико_ПравилаСписанияНоменклатурыПодЗаказ"));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("Получатель",Новый ОписаниеТипов(МассивТиповСклад));
	
	
	
	Если ВидОперации<>Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
		Возврат ТаблицаСписанияНоменклатуры;	
	КонецЕсли;
	
	ТаблицаСвязанныхДокументов	=СоздатьТаблицуСвязанныхДокументов(); 
	ОтменитьПроведениеСвязанныхДокументов(ТаблицаСвязанныхДокументов);
	Для каждого СтрТз Из СоздатьТаблицуСписанияНоменклатуры(ТаблицаСвязанныхДокументов)  Цикл
		НоваяСтрТз=ТаблицаСписанияНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрТз,СтрТз);
	КонецЦикла;
	//ТаблицаСписанияНоменклатуры=СоздатьТаблицуСписанияНоменклатуры(ТаблицаСвязанныхДокументов);
	ЗаполнитьПравилоУТаблицыСписания(ТаблицаСписанияНоменклатуры,ТаблицаСвязанныхДокументов);
	
	СформироватьДокументыСписанияНоменклатуры(ТаблицаСписанияНоменклатуры,ТаблицаСвязанныхДокументов); 
	ДополнительныеСвойства.Вставить("ТаблицаСписанияНоменклатуры",ТаблицаСписанияНоменклатуры);
	
	Возврат ТаблицаСписанияНоменклатуры;
	
КонецФункции //-Лико m.shenderov 02.06.2020

Функция СоздатьТаблицуСвязанныхДокументов() //+Лико m.shenderov 28.05.2020
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК ВнутреннееПотреблениеТоваров
	|ГДЕ
	|	ВнутреннееПотреблениеТоваров.Лико_Документ = &Лико_Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериалов.Ссылка
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Лико_Документ = &Лико_Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказМатериаловВПроизводство.Ссылка
	|ИЗ
	|	Документ.ЗаказМатериаловВПроизводство КАК ЗаказМатериаловВПроизводство
	|ГДЕ
	|	ЗаказМатериаловВПроизводство.Лико_Документ = &Лико_Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Лико_Документ = &Лико_Документ";
	Запрос.УстановитьПараметр("Лико_Документ",Ссылка );
	Возврат  Запрос.Выполнить().Выгрузить();
	
	
КонецФункции //-Лико m.shenderov 28.05.2020 

Функция СоздатьТаблицуСписанияНоменклатуры(ТаблицаСвязанныхДокументов) //+Лико m.shenderov 28.05.2020
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровТовары.Упаковка КАК Упаковка,
	|	СУММА(Лико_ПередачаТоваровТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(Лико_ПередачаТоваровТовары.Количество) КАК Количество,
	|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
	|	Лико_ПередачаТоваровТовары.Ссылка.Склад КАК Склад
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПередачаТоваровТовары.Номенклатура,
	|	Лико_ПередачаТоваровТовары.Упаковка,
	|	Лико_ПередачаТоваровТовары.Характеристика,
	|	Лико_ПередачаТоваровТовары.Серия,
	|	Лико_ПередачаТоваровТовары.Ссылка.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТовары.Номенклатура КАК Номенклатура,
	|	ВтТовары.Характеристика КАК Характеристика,
	|	ВтТовары.Серия КАК Серия,
	|	ВтТовары.Склад КАК Склад,
	|	ВтТовары.Упаковка КАК Упаковка,
	|	ВтТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВтТовары.Количество КАК Количество,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК КоличествоБУ,
	|	НЕОПРЕДЕЛЕНО КАК Правило,
	|	ЛОЖЬ КАК СписатьСЯчейки,
	|	НЕОПРЕДЕЛЕНО КАК Распоряжение
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Период,
	|				(Серия, Склад) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВтТовары.Серия КАК Серия,
	|						ВтТовары.Склад КАК Склад
	|					ИЗ
	|						ВтТовары КАК ВтТовары)) КАК ТоварыНаСкладахОстатки
	|		ПО ВтТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВтТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И ВтТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|			И ВтТовары.Склад = ТоварыНаСкладахОстатки.Склад";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	Запрос.УстановитьПараметр("Период",КонецДня(Дата));
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
	
	
КонецФункции //-Лико m.shenderov 28.05.2020 

Процедура СформироватьДокументыСписанияНоменклатуры(ТаблицаСписанияНоменклатуры,ТаблицаСвязанныхДокументов) //+Лико m.shenderov 28.05.2020
	
	Правила=ТаблицаСписанияНоменклатуры.Скопировать();
	Правила.Свернуть("Распоряжение");
	Для каждого Правило  Из Правила  Цикл
		
		Структура = Новый Структура;
		//Структура.Вставить("Правило",Правило.Правило);
		Структура.Вставить("Распоряжение",Правило.Распоряжение);
		
		СоздатьРедактироватьДокументСписания(ТаблицаСписанияНоменклатуры.НайтиСтроки(Структура));
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 28.05.2020

Процедура ЗаполнитьПравилоУТаблицыСписания110820(ТаблицаСписанияНоменклатуры,ТаблицаСвязанныхДокументов) //+Лико m.shenderov 31.05.2020
	ЦеховаяКладоваяКраски=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_Колористическая");
	
	Для каждого Товар Из ТаблицаСписанияНоменклатуры Цикл
		Если Не ЗначениеЗаполнено(Товар.Правило) Тогда
			Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Товар.Номенклатура,Ссылка);
			СтруктураПоиска=Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура",Товар.Номенклатура);
			Для каждого НайденнаяСтрока Из ТаблицаСписанияНоменклатуры.НайтиСтроки(СтруктураПоиска) Цикл
				НайденнаяСтрока.Правило=Правило;
			КонецЦикла;
			
		КонецЕсли;
		Если Товар.Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.СписаниеНаСкладе Или
			Товар.Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПеремещениеВЦеховуюКладовую Тогда 
			Товар.СписатьСЯчейки=Истина;
		КонецЕсли;
		Если Товар.Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПеремещениеВЦеховуюКладовую Тогда 
			Товар.Получатель=ЦеховаяКладоваяКраски;
		Иначе
			Товар.Получатель=Подразделение;
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(Товар.Правило) Тогда
			Товар.КоличествоБУ=0;
		КонецЕсли;
		
		ПодобратьРаспоряжение(Товар,ТаблицаСвязанныхДокументов); 		
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 31.05.2020

Процедура ЗаполнитьПравилоУТаблицыСписания(ТаблицаСписанияНоменклатуры, ТаблицаСвязанныхДокументов)
	ЦеховаяКладоваяКраски=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_Колористическая");
	
	Для каждого Товар Из ТаблицаСписанияНоменклатуры Цикл
		Если Не ЗначениеЗаполнено(Товар.Правило) Тогда
			Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило2(Товар.Номенклатура,Ссылка);
			СтруктураПоиска=Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура",Товар.Номенклатура);
			Для каждого НайденнаяСтрока Из ТаблицаСписанияНоменклатуры.НайтиСтроки(СтруктураПоиска) Цикл
				НайденнаяСтрока.Правило=Правило;
			КонецЦикла;
			
		КонецЕсли;
		Если Товар.Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.СписаниеНаСкладе Или
			Товар.Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПеремещениеВЦеховуюКладовую Тогда 
			Товар.СписатьСЯчейки=Истина;
		КонецЕсли;
		Если Товар.Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПеремещениеВЦеховуюКладовую Тогда 
			Товар.Получатель=ЦеховаяКладоваяКраски;
		Иначе
			Товар.Получатель=Подразделение;
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(Товар.Правило) Тогда
			Товар.КоличествоБУ=0;
		КонецЕсли;
		
		ПодобратьРаспоряжение(Товар,ТаблицаСвязанныхДокументов); 		
	КонецЦикла;
	
	
КонецПроцедуры


Процедура СоздатьРедактироватьДокументСписания(тчТовары)  //+Лико m.shenderov 31.05.2020
	ДокументОбъект=ПолучитьДокументОбъектСписания(тчТовары);
	Если  ДокументОбъект=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументСписания2(ДокументОбъект,тчТовары);
	ЗаполнитьДокументПеремещения(ДокументОбъект,тчТовары);
	
	
	Попытка 
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 				
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + ДокументОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		
	КонецПопытки;
	
	
КонецПроцедуры //-Лико m.shenderov 31.05.2020

Функция ПолучитьДокументОбъектСписания(тчТовары) //+Лико m.shenderov 02.06.2020
	Если  тчТовары.Количество()>0 и ЗначениеЗаполнено(тчТовары[0].Распоряжение) Тогда
		
		Возврат тчТовары[0].Распоряжение.Ссылка.ПолучитьОбъект();
	КонецЕсли;
КонецФункции //-Лико m.shenderov 02.06.2020 

Процедура ЗаполнитьДокументСписания2(ДокументОбъект, тчТовары)
	Если ТипЗнч(ДокументОбъект.Ссылка)<>Тип("ДокументСсылка.ВнутреннееПотребление") Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	_Подразделение= Подразделение;

	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство И
		ЗначениеЗаполнено(Получатель.ВидРабочегоЦентра.Подразделение) Тогда
		_Подразделение= Получатель.ВидРабочегоЦентра.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Склад.Лико_Площадка.ПодразделениеПроизводство) Тогда
		
		_Подразделение= Склад.Лико_Площадка.ПодразделениеПроизводство;
		
	КонецЕсли;
	

	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументОбъект.Дата 					= Дата;
	//ДокументОбъект.ДатаРаспоряжения 		= ДокументОбъект.Дата;
	ДокументОбъект.ПометкаУдаления			= Ложь;
	ДокументОбъект.Организация 				= Организация;
	ДокументОбъект.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Подразделение 			= _Подразделение;
	ДокументОбъект.Склад 					= Склад;

	//ДокументОбъект.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	//ДокументОбъект.СпособДоставки 			= Перечисления.СпособыДоставки.Самовывоз;
	ДокументОбъект.Комментарий 				= "Создан автоматически на основании документа """ + Ссылка + """";

	ДокументОбъект.Товары.Очистить();
	Для каждого Тч Из тчТовары Цикл
		Если Тч.Номенклатура.ГруппаФинансовогоУчета=Справочники.Лико_ПредопределенныеЗначения.ГруппаФинУчетаРасчетовДля08Счетов.ЗначениеПараметра Тогда
			Продолжить;
		КонецЕсли;

		Списать = Мин(Тч.Количество,Тч.КоличествоБу);
		Если Списать=0 тогда
			Продолжить;
		КонецЕсли;

		Стр=ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Тч);
		Стр.КоличествоУпаковок	= Списать;
		Стр.Количество			= Списать;
		Стр.Упаковка			= Стр.Номенклатура.ЕдиницаИзмерения;
		Стр.СтатьяРасходов      = Стр.Номенклатура.Лико_СтатьяРасходов;


		Если Стр.СтатьяРасходов.ТипЗначения=Новый ОписаниеТипов("СправочникСсылка.ВидыРабочихЦентров") Тогда
			Стр.АналитикаРасходов=Получатель.ВидРабочегоЦентра;
		КонецЕсли;
		Стр.АналитикаРасходов   = ?(ЗначениеЗаполнено(Стр.АналитикаРасходов),Стр.АналитикаРасходов,_Подразделение);

		Если ДокументОбъект.ХозяйственнаяОперация= Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда
			Стр.ФизическоеЛицо   		= Сотрудник;
			Стр.КатегорияЭксплуатации   = Тч.Правило.КатегорияЭксплуатации;
		КонецЕсли;




	КонецЦикла;
	Если ДокументОбъект.ХозяйственнаяОперация= Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда

		ДокументОбъект.Товары.Свернуть("Номенклатура,Характеристика,СтатьяРасходов,АналитикаРасходов,ФизическоеЛицо,КатегорияЭксплуатации","Количество,КоличествоУпаковок");

	Иначе

		ДокументОбъект.Товары.Свернуть("Номенклатура,Характеристика,СтатьяРасходов,АналитикаРасходов","Количество,КоличествоУпаковок");
	КонецЕсли;

	Если ДокументОбъект.Товары.Количество()=0 Тогда
		ДокументОбъект.Записать();
		ДокументОбъект.Удалить();
		Возврат;
	КонецЕсли;
	ДокументОбъект.Лико_Документ=Ссылка;
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);



КонецПроцедуры

Процедура ЗаполнитьДокументПеремещения(ДокументОбъект,тчТовары) //+Лико m.shenderov 02.06.2020
	Если ТипЗнч(ДокументОбъект.Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументОбъект.Дата 					= Дата;
	//ДокументОбъект.ДатаРаспоряжения 		= ДокументОбъект.Дата;
	ДокументОбъект.ПометкаУдаления			= Ложь;
	ДокументОбъект.Организация 				= Организация;
	ДокументОбъект.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Подразделение 			= Подразделение;
	ДокументОбъект.СкладОтправитель 		= Склад;
	//ДокументОбъект.СкладПолучатель 			= УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_Колористическая");
	
	СкладПолучатель = ДокументОбъект.Лико_Документ.Склад.Лико_Площадка.ЦеховаяКладовая;
	ДокументОбъект.СкладПолучатель = СкладПолучатель;
	
	ДокументОбъект.Статус 					= Перечисления.СтатусыПеремещенийТоваров.Принято;
	ДокументОбъект.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументОбъект.СпособДоставки 			= Перечисления.СпособыДоставки.Самовывоз;
	ДокументОбъект.Комментарий 				= "Создан автоматически на основании документа """ + Ссылка + """";
	ДокументОбъект.ВариантПриемкиТоваров 	= Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	
	ДокументОбъект.Товары.Очистить();
	
	Для каждого Тч Из тчТовары Цикл
		Стр=ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Тч);
		Стр.КоличествоУпаковок= Мин(Тч.Количество,Тч.КоличествоБу);
		Стр.Количество= Мин(Тч.Количество,Тч.КоличествоБу); 
		Стр.Упаковка= Стр.Номенклатура.ЕдиницаИзмерения;
		
	КонецЦикла;
	ДокументОбъект.Товары.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	Если ДокументОбъект.Товары.Количество()=0 Тогда
		ДокументОбъект.Записать();
		ДокументОбъект.Удалить();
		Возврат;
	КонецЕсли;	  
	ДокументОбъект.Лико_Документ=Ссылка;	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.06.2020

Процедура ЗаполнитьДокументСписания(ДокументОбъект,тчТовары) //+Лико m.shenderov 02.06.2020
	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.ВнутреннееПотребление")и 
		ДокументОбъект.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию Тогда
		
	Иначе
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументОбъект.Дата 					= Дата;
	//ДокументОбъект.ДатаРаспоряжения 		= ДокументОбъект.Дата;
	ДокументОбъект.Организация 				= Организация;
	ДокументОбъект.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Подразделение 			= Подразделение;
	ДокументОбъект.Склад			 		= Склад;
	ДокументОбъект.СкладПолучатель 			= УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_Колористическая");
	ДокументОбъект.Статус 					= Перечисления.СтатусыПеремещенийТоваров.Принято;
	//ДокументОбъект.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	//ДокументОбъект.СпособДоставки 			= Перечисления.СпособыДоставки.Самовывоз;
	ДокументОбъект.Комментарий 				= "Создан автоматически на основании документа """ + Ссылка + """";
	
	
	Для каждого Тч Из тчТовары Цикл
		Если Тч.Номенклатура.ГруппаФинансовогоУчета=Справочники.Лико_ПредопределенныеЗначения.ГруппаФинУчетаРасчетовДля08Счетов.ЗначениеПараметра Тогда
			Продолжить;
		КонецЕсли;
		
		Стр=ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Тч);
		Стр.КоличествоУпаковок= Мин(Тч.Количество,Тч.КоличествоБу);
		Стр.Количество= Мин(Тч.Количество,Тч.КоличествоБу); 
		Стр.Упаковка= Стр.Номенклатура.ЕдиницаИзмерения;
		Стр.АналитикаРасходов=Подразделение;
		
	КонецЦикла;
	ДокументОбъект.Товары.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	ДокументОбъект.Лико_Документ=Ссылка;	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.06.2020

Процедура ЗаполнитьДокументПередачаВЭксплуатацию(ДокументОбъект,тчТовары) //+Лико m.shenderov 02.06.2020
	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.ВнутреннееПотребление")и 
		ДокументОбъект.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда
		
	Иначе
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	//НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументОбъект.Дата 					= Дата;
	//ДокументОбъект.ДатаРаспоряжения 		= ДокументОбъект.Дата;
	ДокументОбъект.Организация 				= Организация;
	ДокументОбъект.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Подразделение 			= Подразделение;
	ДокументОбъект.Склад			 		= Склад;
	//ДокументОбъект.СкладПолучатель 			= УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_Колористическая");
	ДокументОбъект.Статус 					= Перечисления.СтатусыПеремещенийТоваров.Принято;
	//ДокументОбъект.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	//ДокументОбъект.СпособДоставки 			= Перечисления.СпособыДоставки.Самовывоз;
	ДокументОбъект.Комментарий 				= "Создан автоматически на основании документа """ + Ссылка + """";
	
	
	Для каждого Тч Из тчТовары Цикл
		Если Тч.Номенклатура.ГруппаФинансовогоУчета=Справочники.Лико_ПредопределенныеЗначения.ГруппаФинУчетаРасчетовДля08Счетов.ЗначениеПараметра Тогда
			Продолжить;
		КонецЕсли;
		
		Стр=ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Тч);
		Стр.КоличествоУпаковок= Мин(Тч.Количество,Тч.КоличествоБу);
		Стр.Количество= Мин(Тч.Количество,Тч.КоличествоБу); 
		Стр.Упаковка= Стр.Номенклатура.ЕдиницаИзмерения;
		
		Стр.КатегорияЭксплуатации= Справочники.Лико_ПредопределенныеЗначения.КатегорияЭксплуатации.ЗначениеПараметра;	
		Если ЗначениеЗаполнено( Тч.Правило) Тогда
			Стр.КатегорияЭксплуатации=Тч.Правило.КатегорияЭксплуатации;
		КонецЕсли;
		
		
		
		
		//Товар.СтатьяРасходов=Товар.КатегорияЭксплуатации.СтатьяРасходов;  			
		//Стр.АналитикаРасходов=Подразделение;
	Если Стр.КатегорияЭксплуатации.СтатьяРасходов.ТипЗначения=Новый ОписаниеТипов("СправочникСсылка.ВидыРабочихЦентров") Тогда
			Стр.АналитикаРасходов=Получатель.ВидРабочегоЦентра;
		КонецЕсли;		
		Стр.АналитикаРасходов   = ?(ЗначениеЗаполнено(Стр.АналитикаРасходов),Стр.АналитикаРасходов,Подразделение);

		Стр.ФизическоеЛицо=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_ФизЛицоПриПередачеВЭксплуатацию");
		
	КонецЦикла;
	ДокументОбъект.Товары.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
	ДокументОбъект.Лико_Документ=Ссылка;	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина);
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.06.2020

Функция ПоляТаблицыТоваровСписания() 
	Возврат "Номенклатура,Характеристика,Серия,Упаковка,Количество,КоличествоУпаковок,КоличествоБУ";	
КонецФункции 

Функция ПолучитьДокументСписания(Товары) //+Лико m.shenderov 01.06.2020
	
КонецФункции //-Лико m.shenderov 01.06.2020 

Процедура ПодобратьРаспоряжение(Товар,ТаблицаСвязанныхДокументов) //+Лико m.shenderov 31.05.2020
	Если Не ЗначениеЗаполнено(Товар.Правило) или Товар.КоличествоБУ=0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипРаспоряжение=ОпределитьТипДокументаСписания(Товар.Правило);
	ТипРаспоряжениеСсылка=ТипРаспоряжение.Ссылка;
	Если    ТипРаспоряжениеСсылка=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	лРаспоряжение=Неопределено;	
	Для каждого СтрРаспоряжение Из ТаблицаСвязанныхДокументов Цикл
		Если ТипЗнч(СтрРаспоряжение.Ссылка)=ТипЗнч(ТипРаспоряжениеСсылка) Тогда
			Если ТипЗнч(СтрРаспоряжение.Ссылка)=тип("ДокументСсылка.ВнутреннееПотребление")и
				Не СтрРаспоряжение.Ссылка.ХозяйственнаяОперация=ХозяйственнаяОперацияСписания(Товар.Правило) Тогда
				Продолжить;
			КонецЕсли;
			
			лРаспоряжение=СтрРаспоряжение.Ссылка;
			Прервать;
		КонецЕсли;	 
	КонецЦикла;
	Если лРаспоряжение=Неопределено Тогда
		лРаспоряжениеОбъект=ТипРаспоряжение;
		Если ТипЗнч(ТипРаспоряжениеСсылка)=тип("ДокументСсылка.ВнутреннееПотребление")Тогда
			
			лРаспоряжениеОбъект.ХозяйственнаяОперация=ХозяйственнаяОперацияСписания(Товар.Правило); 
		КонецЕсли;
		лРаспоряжениеОбъект.Дата=Дата;
		лРаспоряжениеОбъект.Организация=Организация;
		лРаспоряжениеОбъект.Подразделение=Подразделение;
		//лРаспоряжениеОбъект.Склад=Склад;
		лРаспоряжениеОбъект.Лико_Документ=Ссылка;
		лРаспоряжениеОбъект.Записать(РежимЗаписиДокумента.Запись);
		лРаспоряжение=лРаспоряжениеОбъект.Ссылка;
		НоваяСтр=ТаблицаСвязанныхДокументов.Добавить();
		НоваяСтр.Ссылка=лРаспоряжение;
	КонецЕсли;
	Товар.Распоряжение=лРаспоряжение;
	
	
КонецПроцедуры //-Лико m.shenderov 31.05.2020

Функция ХозяйственнаяОперацияСписания(Правило) //+Лико m.shenderov 31.05.2020
	Если Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию Тогда 
		Возврат Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию;
	Иначе
		Возврат Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 31.05.2020 

Функция ОпределитьТипДокументаСписания(Правило) //+Лико m.shenderov 31.05.2020
	Если Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию Тогда
		Возврат Документы.ВнутреннееПотребление.СоздатьДокумент();
	ИначеЕсли Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.СписаниеНаВнутреннееПотребление Тогда
		Возврат Документы.ВнутреннееПотребление.СоздатьДокумент(); 
	ИначеЕсли Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.СписаниеНаСкладе Тогда
		Возврат Документы.ВнутреннееПотребление.СоздатьДокумент(); 
	ИначеЕсли Правило.ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПеремещениеВЦеховуюКладовую Тогда
		Возврат Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;  	
КонецФункции //-Лико m.shenderov 31.05.2020 

Процедура ОтменитьПроведениеСвязанныхДокументов(ТаблицаСвязанныхДокументов) //+Лико m.shenderov 31.05.2020
	
	Для каждого СтрТаб Из  ТаблицаСвязанныхДокументов Цикл
		ДокОбъект=СтрТаб.Ссылка.ПолучитьОбъект();
		ДокОбъект.ПометкаУдаления=истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецПроцедуры //-Лико m.shenderov 31.05.2020

 #КонецОбласти

#КонецЕсли
