
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыОткрытия = Новый Структура();
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЗаказПоставщику", ПараметрКоманды);	
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
    ПараметрыОткрытия.Вставить("КлючПользовательскихНастроек", Строка(Новый УникальныйИдентификатор));
    ПараметрыОткрытия.Вставить("КлючВарианта","КонтекстныйЗаказПоставщику");

	

	
	ОткрытьФорму("Отчет.Лико_АнализЗакупок.Форма", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, Строка(Новый УникальныйИдентификатор), ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
