
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_ПрайсНомменклатураПрайса.Номенклатура КАК Продукция,
		|	Лико_ПрайсНомменклатураПрайса.Ссылка КАК Прайс
		|ИЗ
		|	Документ.Лико_Прайс.НоменклатураПрайса КАК Лико_ПрайсНомменклатураПрайса
		|ГДЕ
		|	Лико_ПрайсНомменклатураПрайса.Ссылка = &Ссылка
		|	И Лико_ПрайсНомменклатураПрайса.Ссылка.НоменклатураСписком = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_ПрайсТовары.Продукция,
		|	Лико_ПрайсТовары.Ссылка
		|ИЗ
		|	Документ.Лико_Прайс.Товары КАК Лико_ПрайсТовары
		|ГДЕ
		|	Лико_ПрайсТовары.Ссылка = &Ссылка
		|	И Лико_ПрайсТовары.Ссылка.НоменклатураСписком = ЛОЖЬ";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		НаборЗаписейЛико_Прайс = РегистрыСведений.Лико_ПрайсыГП.СоздатьНаборЗаписей();
		НаборЗаписейЛико_Прайс.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейЛико_Прайс.Записать();   
		
		Пока Выборка.Следующий() Цикл
			Движение =НаборЗаписейЛико_Прайс.Добавить();
			Движение.Регистратор = Ссылка;
			Движение.Период = Дата;
			Движение.Продукция = Выборка.Продукция;
			Движение.Прайс = Выборка.Прайс;   
		КонецЦикла;  
			
	
	
	НаборЗаписейЛико_Прайс.Записать(); 

	
	НаборЗаписейЛико_ЦеныГП = РегистрыСведений.Лико_ЦеныГП.СоздатьНаборЗаписей();
	НаборЗаписейЛико_ЦеныГП.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейЛико_ЦеныГП.Записать();	
	
	Для каждого текстр из Товары Цикл
		Движение =НаборЗаписейЛико_ЦеныГП.Добавить();
		Движение.Регистратор = Ссылка; 
		Движение.Прайс = Ссылка;  
		Если  ТипГПДляПрайса = Перечисления.Лико_ТипыГПДляПрайса.РазмерыЭтикетки Тогда  
			Движение.Ширина = текстр.Ширина;
			Движение.Высота = текстр.Высота;
		Иначе	
			Движение.Продукция = текстр.Продукция;    
		КонецЕсли;  
		Движение.типэтикетки = текстр.типэтикетки; 
		Движение.Количество = текстр.Количество;
		Движение.Цена = текстр.Цена;
		Движение.Валюта = Валюта;   
		

	КонецЦикла;
	НаборЗаписейЛико_ЦеныГП.Записать(); 
	
КонецПроцедуры
