#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если (Параметры.Свойство("ПоказатьВсе") И Параметры.ПоказатьВсе)
		ИЛИ ((Параметры.Свойство("РеализацияПоЗаказам") И НЕ Параметры.РеализацияПоЗаказам) 
			И НЕ (Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
				ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера
				ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности)) Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате);
	КонецЕсли;
	Если (Параметры.Свойство("ПереходПравСобственности") И Параметры.ПереходПравСобственности)
		ИЛИ (Параметры.Свойство("ХозяйственнаяОперация") 
			И (Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
				ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности)) Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыРеализацийТоваровУслуг.ВПути);
	КонецЕсли;
	ДанныеВыбора.Добавить(Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено);
	
КонецПроцедуры

#КонецОбласти
