
&Вместо("ОбработкаПолученияДанныхВыбора")
Процедура Лико_ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЕСли Справочники.Лико_РабочиеМеста.ПолучитьСвойство("АвтоПодборНоменклатурыСклада",Ложь) Тогда

		СписокЗначений=Новый СписокЗначений;
		СтандартнаяОбработка=Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка КАК Ссылка,
		|	1 КАК код
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(ПОДСТРОКА(Номенклатура.Код, 1, 1) = ""n""
		|			ИЛИ ПОДСТРОКА(Номенклатура.Код, 1, 1) = ""m"")
		|	И Номенклатура.Код ПОДОБНО &Код
		|	И НЕ Номенклатура.Лико_НеИспользовать
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка,
		|	2
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование ПОДОБНО &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка,
		|	3
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул ПОДОБНО &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка,
		|	4
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЦеноваяГруппа.Код ПОДОБНО &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка,
		|	5
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	ПОДСТРОКА(Номенклатура.Код, 1, 1) <> ""n""
		|	И ПОДСТРОКА(Номенклатура.Код, 1, 1) <> ""m""
		|	И Номенклатура.Код ПОДОБНО &Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		|	Вт.Ссылка КАК Ссылка,
		|	Вт.код КАК код
		|ИЗ
		|	Вт КАК Вт
		|ГДЕ
		|	НЕ Вт.Ссылка.Лико_НеИспользовать
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вт.код";
		Запрос.УстановитьПараметр("Код","%"+Параметры.СтрокаПоиска+"%" );
		СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		ДанныеВыбора=СписокЗначений; 	
	Иначе
	НоменклатураВызовСервера.НоменклатураОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
	КонецЕсли;
КонецПроцедуры
