
&После("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ)
	ЕСли Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ЕСли ЗначениеЗаполнено(Ссылка) и Не Лико_ФиксироватьСтатьюРасходов Тогда
		Лико_СтатьяРасходов=Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Ссылка);
	КонецЕсли;
	ЕСли ЗначениеЗаполнено(Ссылка)Тогда
		Лико_КонтрольПартииПроизводстваТовара=ЗначениеЗаполнено(Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.ОпределитьПравило(Ссылка));
	КонецЕсли;
		
КонецПроцедуры

&После("ПриЗаписи")
Процедура Лико_ПриЗаписи(Отказ)
	ЕСли Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ЕСли ЗначениеЗаполнено(Ссылка) и Не Лико_ФиксироватьСтатьюРасходов Тогда
		ПолученнаяСтатьяРасходов= Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Ссылка);
		Если  ПолученнаяСтатьяРасходов<> Лико_СтатьяРасходов Тогда
		Лико_СтатьяРасходов=ПолученнаяСтатьяРасходов;
		Записать();
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры
