#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Рассчитывает сумму неотмененных строк заказа
//
// Параметры:
//	ТолькоЗалогЗаТару - Булево - признак залога за тару.
//
// Возвращаемое значение:
//	Число - сумма заменяющих строк.
//
Функция ПолучитьСуммуЗаказанныхСтрок(ТолькоЗалогЗаТару = Ложь) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.Отменено КАК Отменено
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Отменено
	|	И (((Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ (НЕ &ВернутьМногооборотнуюТару) ИЛИ &ТребуетсяЗалогЗаТару)
	|			И НЕ &ТолькоЗалогЗаТару)
	|		ИЛИ (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			И &ВернутьМногооборотнуюТару
	|			И &ТребуетсяЗалогЗаТару
	|			И &ТолькоЗалогЗаТару))
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС,Отменено"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	Запрос.УстановитьПараметр("ТолькоЗалогЗаТару", ТолькоЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаЗаказанныхСтрок = Выгрузка[0].СуммаСНДС;
	Возврат СуммаЗаказанныхСтрок;
	
КонецФункции

// Рассчитывает количество заказанных строк заказа
// 
// Возвращаемое значение:
// 	Число - 
Функция ПолучитьКоличествоЗаказанныхСтрок() Экспорт
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Отменено", Ложь));
	Возврат НайденныеСтроки.Количество();
	
КонецФункции

// Заполняет условия продаж в заказе клиента
//
// Параметры:
//	УсловияПродаж - Структура - Структура для заполнения.
//
Процедура ЗаполнитьУсловияПродаж(Знач УсловияПродаж) Экспорт
	
	Если УсловияПродаж = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.ВалютаВзаиморасчетов) Тогда
		Валюта = УсловияПродаж.ВалютаВзаиморасчетов;
	КонецЕсли;
	ХозяйственнаяОперация = УсловияПродаж.ХозяйственнаяОперация;
	
	Если ЗначениеЗаполнено(УсловияПродаж.ГрафикОплаты) Тогда
		ГрафикОплаты = УсловияПродаж.ГрафикОплаты;
	КонецЕсли;
	
	ЦенаВключаетНДС      		   = УсловияПродаж.ЦенаВключаетНДС;
	ВернутьМногооборотнуюТару 	   = УсловияПродаж.ВозвращатьМногооборотнуюТару;
	СрокВозвратаМногооборотнойТары = УсловияПродаж.СрокВозвратаМногооборотнойТары;
	ТребуетсяЗалогЗаТару 		   = УсловияПродаж.ТребуетсяЗалогЗаТару;
	НаправлениеДеятельности 	   = УсловияПродаж.НаправлениеДеятельности;

	РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "КомиссионныеПродажи25, ХозяйственнаяОперация");
	КомиссионныеПродажи25 = ?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		И (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
			ИЛИ (ЗначениеЗаполнено(Соглашение)
				И РеквизитыСоглашения.КомиссионныеПродажи25
				И РеквизитыСоглашения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию)), Истина, Ложь);
			
	Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		 И КомиссионныеПродажи25) Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи Тогда
		ВернутьМногооборотнуюТару      = Ложь;
		СрокВозвратаМногооборотнойТары = 0;
		ТребуетсяЗалогЗаТару           = Ложь;
	КонецЕсли;
	
	ИзмененаОрганизация = ЗначениеЗаполнено(УсловияПродаж.Организация) И УсловияПродаж.Организация <> Организация;
	ИзмененаФормаОплаты = ЗначениеЗаполнено(УсловияПродаж.ФормаОплаты) И УсловияПродаж.ФормаОплаты <> ФормаОплаты;
	
	ФормаОплаты = УсловияПродаж.ФормаОплаты;
	
	Если ИзмененаОрганизация Тогда
		Организация = УсловияПродаж.Организация;
	КонецЕсли;
	
	Если ИзмененаОрганизация Или ИзмененаФормаОплаты Тогда
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация    			= Организация;
		СтруктураПараметров.НаправлениеДеятельности = НаправлениеДеятельности;
		БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация    			= Организация;
		СтруктураПараметров.НаправлениеДеятельности = НаправлениеДеятельности;
		СтруктураПараметров.ФормаОплаты 			= ФормаОплаты;
		СтруктураПараметров.ФизическоеЛицо			= Курьер;

		Касса  = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
		
	КонецЕсли;
	
	Если Не УсловияПродаж.Типовое Тогда
		Если ЗначениеЗаполнено(УсловияПродаж.Контрагент) Тогда
			Контрагент = УсловияПродаж.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	
	Если Не УсловияПродаж.Типовое Тогда
		Если ЗначениеЗаполнено(УсловияПродаж.КонтактноеЛицо) 
			И НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			КонтактноеЛицо = УсловияПродаж.КонтактноеЛицо;
		КонецЕсли;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Партнер, КонтактноеЛицо);
	
	Если УсловияПродаж.ИспользуютсяДоговорыКонтрагентов <> Неопределено И УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда

		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперация, Валюта);
		
		ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчет, БанковскийСчетКонтрагента);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности") Тогда
			НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(НаправлениеДеятельности, Соглашение, Договор);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(УсловияПродаж.ИспользуютсяДоговорыКонтрагентов) 
		ИЛИ НЕ УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
		ОплатаВВалюте = УсловияПродаж.ОплатаВВалюте;
	Иначе
		ОплатаВВалюте = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ОплатаВВалюте");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.Склад) Тогда
		Склад = УсловияПродаж.Склад;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.ГруппаФинансовогоУчета) Тогда
		ГруппаФинансовогоУчета = УсловияПродаж.ГруппаФинансовогоУчета;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.СрокПоставки)
		И Не ЭтоЗаказКакСчет
		И ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") Тогда
		
		ДатаНачала = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
		ДатаОтгрузкиВСтроке = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаНачала,Перечисления.Периодичность.День, УсловияПродаж.СрокПоставки) + 1;
		Если НеОтгружатьЧастями Тогда
			ДатаОтгрузки = ДатаОтгрузкиВСтроке;
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Товары Цикл
			СтрокаТЧ.ДатаОтгрузки = ДатаОтгрузкиВСтроке;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет условия продаж по умолчанию в заказе клиента
//
Процедура ЗаполнитьУсловияПродажПоУмолчанию() Экспорт
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	Если ЗначениеЗаполнено (Партнер) ИЛИ Не ИспользоватьСоглашенияСКлиентами Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("УчитыватьГруппыСкладов", Истина);
		ПараметрыОтбора.Вставить("ВыбранноеСоглашение", Соглашение);
		ПараметрыОтбора.Вставить("ПустаяСсылкаДокумента", Документы.ЗаказКлиента.ПустаяСсылка());
		ХозяйственныеОперации = Документы.ЗаказКлиента.ХозяйственныеОперацииДокумента(Истина);
		ПараметрыОтбора.Вставить("ХозяйственныеОперации", ХозяйственныеОперации);
		
		УсловияПродажПоУмолчанию = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(Партнер, ПараметрыОтбора);
			
		Если УсловияПродажПоУмолчанию <> Неопределено Тогда
			
			Если НЕ ИспользоватьСоглашенияСКлиентами ИЛИ 
				(Соглашение <> УсловияПродажПоУмолчанию.Соглашение И ЗначениеЗаполнено(УсловияПродажПоУмолчанию.Соглашение)) Тогда
			
				Соглашение = УсловияПродажПоУмолчанию.Соглашение;
				ЗаполнитьУсловияПродаж(УсловияПродажПоУмолчанию);
				
				ПараметрыЗаполнения = Документы.ЗаказКлиента.ПараметрыЗаполненияНалогообложенияНДСПродажи(ЭтотОбъект);
				УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
				
				Если ИспользоватьСоглашенияСКлиентами Тогда
					СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
					ПараметрыЗаполнения = Новый Структура;
					ПараметрыЗаполнения.Вставить("Дата", Дата);
					ПараметрыЗаполнения.Вставить("Организация", Организация);
					ПараметрыЗаполнения.Вставить("Валюта", Валюта);
					ПараметрыЗаполнения.Вставить("Соглашение", Соглашение);
					ПараметрыЗаполнения.Вставить("НалогообложениеНДС", НалогообложениеНДС);
					ПараметрыЗаполнения.Вставить("ВозвращатьМногооборотнуюТару", ВернутьМногооборотнуюТару);
					ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
					ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦены, СрокПоставки");
					
					СтруктураДействий = Новый Структура;
					СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
					СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки", "КоличествоУпаковок");
					СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
					СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
					
					ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
						Товары,
						, // Массив строк или структура отбора
						ПараметрыЗаполнения,
						СтруктураДействий);
				КонецЕсли;
			Иначе
				Соглашение = УсловияПродажПоУмолчанию.Соглашение;
				ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
			КонецЕсли;
		Иначе
			Соглашение = Неопределено;
			ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
		КонецЕсли;
		
		БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
		
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Партнер,КонтактноеЛицо);
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		АдресДоставки = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Партнер);
	КонецЕсли;
		
КонецПроцедуры

// Заполняет условия продаж по соглашению в заказе клиента.
//
// Параметры:
// 	ПересчитыватьЦены - Булево - признак необходимости пересчета цен
//
// Возвращаемое значение:
// 	Булево - результат перезаполнения
//
Функция ЗаполнитьУсловияПродажПоСоглашению(ПересчитыватьЦены = Истина) Экспорт
	
	ЦеныРассчитаны = Ложь;
	
	УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина);
	ЗаполнитьУсловияПродаж(УсловияПродаж);
	
	ПараметрыЗаполнения = Документы.ЗаказКлиента.ПараметрыЗаполненияНалогообложенияНДСПродажи(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	
	СтруктураДействий = Новый Структура;
	
	Если ПересчитыватьЦены = Истина Тогда
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Дата", Дата);
		ПараметрыЗаполнения.Вставить("Организация", Организация);
		ПараметрыЗаполнения.Вставить("Валюта", Валюта);
		ПараметрыЗаполнения.Вставить("Соглашение", Соглашение);
		ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
		ПараметрыЗаполнения.Вставить("НалогообложениеНДС", НалогообложениеНДС);
		ПараметрыЗаполнения.Вставить("ВозвращатьМногооборотнуюТару", ВернутьМногооборотнуюТару);
		ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦены, СрокПоставки");
		
		СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
		СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки", "КоличествоУпаковок");
		СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		
		ЦеныРассчитаны = ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
			Товары,,
			ПараметрыЗаполнения,
			СтруктураДействий);
		
	КонецЕсли;
	
	СтруктураПересчетаСуммы =
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
	
	СтруктураДействий.Очистить();
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация = Организация;
	СтруктураПараметров.БанковскийСчет = БанковскийСчет;
	СтруктураПараметров.НаправлениеДеятельности = УсловияПродаж.НаправлениеДеятельности;
	БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

// Устанавливает статус для объекта документа
//
// Параметры:
//	НовыйСтатус - Строка - Имя статуса, который будет установлен у заказов
//	ДополнительныеПараметры - Структура - Структура дополнительных параметров установки статуса.
//
// Возвращаемое значение:
//	Булево - Истина, в случае успешной установки нового статуса.
//
Функция УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаказовКлиентов[НовыйСтатус];
	
	Если ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
		
		Если Согласован Тогда
			Согласован = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		ЗаказИзменен = ЗаказыСервер.СкорректироватьСтрокиЗаказа(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	Статус = ЗначениеНовогоСтатуса;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента);
	
	ЭтоЗаказСоСклада = Не ЭтоЗаказКакСчет
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	
	Если ЭтоЗаказСоСклада Тогда
		СтруктураДействий = Новый Структура();
		ПараметрыДокумента = Документы.ЗаказКлиента.ПараметрыДокументаДляДействийОбеспечения(ЭтотОбъект);
		ПоляСтрокой = "ВариантОбеспечения";
		ОбеспечениеВДокументахКлиентСервер.ДобавитьДействияОбеспечения(СтруктураДействий, ПоляСтрокой, ПараметрыДокумента);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);
	КонецЕсли;
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	
	Возврат ПроверитьЗаполнение();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Если Ссылка.Состояние = Перечисления.Лико_СостоянияЗаказов.Создан 
		И Состояние = Перечисления.Лико_СостоянияЗаказов.ВключенВПлан Тогда
		
		Если АрендаРЦИксПак(ТекущаяДата()) Тогда 
			
			ЗапретИспользованияДавальческогоСырья(Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
		
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если ЭтоНовый() И Не ЭтоЗаказКакСчет Тогда 
	// если ЭтоЗаказКакСчет = Истина - тогда реквизит был заполнен ранее в форме – изменять не требуется
		ЭтоЗаказКакСчет  = Не ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ЭтоЗаказКакСчет И Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
		
		ТекстОшибки = НСтр("ru = 'Заказ как счет должен иметь статус ""На согласовании"".';
							|en = 'Order as a commercial invoice must have the ""Pending approval"" status.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах")
		И Не СкидкиРассчитаны
		И ПродажиСервер.ОперацииПередачиТоваров().Найти(ХозяйственнаяОперация) = Неопределено Тогда
		
			Отказ = Истина;
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе %1 не рассчитаны автоматические скидки (наценки). Проведение невозможно. Для расчёта автоматических скидок (наценок) проведите документ из формы документа.';
				|en = 'Discounts/markups are not calculated in the %1document. Posting is impossible. To calculate discounts/markups, post the document from the document form.'"),
			Ссылка);
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				Ссылка,
				,
				,
				Отказ);
		
	КонецЕсли;
	
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
	
	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");
	
	ОперацииПередачи = ПродажиСервер.ОперацииПередачиТоваров();
	//+ Лико m.shenderov 02.09.2021
	Если ВидЗаказа=Перечисления.Лико_ВидыЗаказов.Оснастка И
		  СтатусЗаказаНаПроизводствоОснасткиОснастки <> Ссылка.СтатусЗаказаНаПроизводствоОснасткиОснастки И
		  (СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование Или
		  СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ГотовКГравировке)Тогда 
	  ДополнительныеСвойства.Вставить("ОСнасткаИнформирование", Истина); 	  
	КонецЕсли;	  
	//- Лико m.shenderov 02.09.2021
	
	// Начало изменений Ликофлекс Иванова Анна  20200219
	//ОперацииПередачи = ПродажиСервер.ОперацииПередачиТоваров();
	//
	//Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
	//	ВозвращатьМногооборотнуюТару = Ложь;
	//	ТребуетсяЗалогЗаТару = Ложь;
	//КонецЕсли;

	//Если (ОперацииПередачи.Найти(ХозяйственнаяОперация) <> Неопределено
	//		Или Не ВернутьМногооборотнуюТару)
	//	И ТребуетсяЗалогЗаТару Тогда
	//	ТребуетсяЗалогЗаТару = Ложь;
	//КонецЕсли;
	
	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	//СуммаВозвратнойТары = ПолучитьСуммуВозвратнойТары();        
		
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	//ДокументСогласован = Согласован;
	//
	//ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиДокумента(
	//	ЭтотОбъект,
	//	РежимЗаписи,
	//	Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	//
	//// Установим дату согласования, если документ согласован
	//Если Не ДокументСогласован И Согласован Тогда
	//	ДатаСогласования = ТекущаяДатаСеанса();
	//	ВзаиморасчетыСервер.ПриИзмененииДатыСогласования(ЭтотОбъект);
	//КонецЕсли;







	
	//ВзаиморасчетыСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи); 
	
	//ГрафикИсполненияВДоговоре = Ложь;
	//Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
	//	И ЗначениеЗаполнено(Договор) Тогда
	//	ГрафикИсполненияВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ЗаданГрафикИсполнения");
	//КонецЕсли;
	
	//Если ОперацииПередачи.Найти(ХозяйственнаяОперация) <> Неопределено
	//	Или ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным
	//	Или ГрафикИсполненияВДоговоре Тогда
	//	СуммаАвансаДоОбеспечения = 0;
	//	СуммаПредоплатыДоОтгрузки = 0;
	//Иначе
	//	ПродажиСервер.ЗаполнитьСуммыАвансаПредоплаты(ЭтотОбъект);
	//КонецЕсли;




	
	//Если Не НеОтгружатьЧастями Тогда
	//	НоваяДатаОтгрузки = Дата(1,1,1);
	//	Если Товары.Количество() > 0 Тогда
	//		Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению
	//			ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
	//			ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
	//			ПараметрыОтбора.Вставить("Отменено", Ложь);
	//			СтрокиКОбеспечению = Товары.НайтиСтроки(ПараметрыОтбора);
	//			Если СтрокиКОбеспечению.Количество() > 0 Тогда
	//				ТаблицаСтрокКОбеспечению = Товары.Выгрузить(СтрокиКОбеспечению, "ДатаОтгрузки");
	//				ТаблицаСтрокКОбеспечению.Сортировать("ДатаОтгрузки Возр");
	//				НоваяДатаОтгрузки = ТаблицаСтрокКОбеспечению[0].ДатаОтгрузки;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	ДатаОтгрузки = НоваяДатаОтгрузки;
	//Иначе
	//	ОбеспечениеВДокументахСервер.ЗаполнитьДатыОтгрузкиВТаблице(ДатаОтгрузки, Товары, "ДатаОтгрузки");
	//КонецЕсли;










	
	//// Очистим реквизиты документа не используемые для хозяйственной операции.
	//МассивВсехРеквизитов = Новый Массив;
	//МассивРеквизитовОперации = Новый Массив;
	//Документы.ЗаказКлиента.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	//	ХозяйственнаяОперация,
	//	МассивВсехРеквизитов,
	//	МассивРеквизитовОперации);
	//ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
	//	ЭтотОбъект,
	//	МассивВсехРеквизитов,
	//	МассивРеквизитовОперации);     
	//	
	//МассивРеквизитов = Новый Массив;
	//Если ЗначениеЗаполнено(ФормаОплаты) И Не (ФормаОплаты = Перечисления.ФормыОплаты.Наличная) Тогда
	//	МассивРеквизитов.Добавить("Касса");
	//КонецЕсли;
	//
	//ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(ЭтотОбъект, МассивРеквизитов, Новый Массив);
		
	//НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента));







	
	//ШаблонНазначения = Документы.ЗаказКлиента.ШаблонНазначения(ЭтотОбъект);
	
	//РеквизитыДляПроверкиНазначения = "НаправлениеДеятельности,Договор,Партнер";
	//Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(Назначение, ШаблонНазначения, ЭтотОбъект, РеквизитыДляПроверкиНазначения, Отказ);

	НоменклатураПартнеровСервер.ЗаполнитьНоменклатуруПартнераПоНоменклатуреВТаблице(Товары, Партнер);
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураПартнеровСервер.ЗаполнитьПустоеСопоставлениеВНоменклатуреПартнераПоНоменклатуреИБ(Товары, Отказ);
	КонецЕсли;

	//Если ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным
	//	И ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
	//	ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(ЭтотОбъект);
	//Иначе
	//	ИдентификаторПлатежа = Неопределено;
	//КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Товары.Имя);
	КонецЕсли;
	
	ЗаказКлиентаЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();   
	КонецЕсли;    
	
	//Подсистема DFM    
	НоменклатураDFM=DFMСервер.ЭтоНоменклатураDFM(РабочийЦентр,
	ТипЗаказа,
	Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаСозданияНоменклатурыDFM.ЗначениеПараметра<ТекущаяДата(),
	ДатаПервойОтправкиВРаботу,
	Товары.Выгрузить(),
	Партнер);  
	//Подсистема DFM    
	
	// --> Лико Субботин 16.02.2022  
	//Если ЗначениеЗаполнено(ДатаОтправкиВРаботу) Тогда 
	//	УстановитьПривилегированныйРежим(истина);	
	//	СтруктураДляПроверкиФорма = новый Структура;
	//	СтруктураДляПроверкиФорма.Вставить("Цвета", Цвета.Выгрузить());
	//	СтруктураДляПроверкиФорма.Вставить("ВидыРабот", ВидыРабот.Выгрузить());	   
	//	СтруктураДляПроверкиБД = новый Структура;
	//	СтруктураДляПроверкиБД.Вставить("Цвета", Ссылка.Цвета.Выгрузить());
	//	СтруктураДляПроверкиБД.Вставить("ВидыРабот", Ссылка.ВидыРабот.Выгрузить());	   	
	//	КонтрольнаяСуммаНормативовБД = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтруктураДляПроверкиБД);
	//	КонтрольнаяСуммаНормативов = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтруктураДляПроверкиФорма); 
	//	Если КонтрольнаяСуммаНормативов <> КонтрольнаяСуммаНормативовБД Тогда 
	//		НаборЗаписей = РегистрыСведений.Лико_ПересчетДокументов.СоздатьНаборЗаписей();
	//		НаборЗаписей.Отбор.ДокументДвижения.Установить(Ссылка);
	//		Запись=НаборЗаписей.Добавить();
	//		Запись.ДокументДвижения = Ссылка;
	//		Запись.Заказ = Ссылка;
	//		НаборЗаписей.Записать();
	//	КонецЕсли;
	//	УстановитьПривилегированныйРежим(Ложь);	  
	//КонецЕсли;
	//<-- Лико Субботин 16.02.2022     			
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;      
	
	//Начало изменений Иванова Анна 20200219
	Возврат;
	//Конец изменений Иванова Анна 20200219 
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	ШаблонНазначения = Документы.ЗаказКлиента.ШаблонНазначения(ЭтотОбъект);
	Справочники.Назначения.ПриЗаписиДокумента(Назначение, ШаблонНазначения, ЭтотОбъект, Партнер,
		УчетНДСУП.ВидДеятельностиПоНалогообложениюНДС(НалогообложениеНДС, Организация, Дата));
	ЗаказКлиентаЛокализация.ПриЗаписи(ЭтотОбъект, Отказ);        
	
	//+ Лико m.shenderov 02.09.2021
	Если ДополнительныеСвойства.Свойство("ОСнасткаИнформирование") Тогда
		ОснасткаСоздатьСообщение();
	КонецЕсли;
	//- Лико m.shenderov 02.09.2021
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.АвторизованныйПользователь();
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.Партнеры") Тогда
		ЗаполнитьДокументНаОснованииПартнера(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СделкиСКлиентами") Тогда
		ЗаполнитьДокументНаОснованииСделкиПоПродаже(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		ЗаполнитьДокументНаОснованииИндивидуальногоСоглашенияСКлиентом(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаданиеТорговомуПредставителю") Тогда
		ЗаполнитьДокументНаОснованииЗаданияТорговомуПредставителю(ДанныеЗаполнения);
	Иначе
		Продажи.ПриОбработкеЗаполненияЗаказаКлиента(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	
	РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "КомиссионныеПродажи25, ХозяйственнаяОперация");
	КомиссионныеПродажи25 = ?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		И (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
			ИЛИ (ЗначениеЗаполнено(Соглашение)
				И РеквизитыСоглашения.КомиссионныеПродажи25
				И РеквизитыСоглашения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию)), Истина, Ложь);
			
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		 И КомиссионныеПродажи25 Тогда
		ВернутьМногооборотнуюТару      = Ложь;
		СрокВозвратаМногооборотнойТары = 0;
		ТребуетсяЗалогЗаТару           = Ложь;
	КонецЕсли;
	
	ИнициализироватьУсловияПродаж();
	
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	ОтветственныеЛицаСервер.УстановитьМенеджера(ЭтотОбъект, ДокументОснование);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьПодчиненныеРеквизитыОбъекта(ЭтотОбъект, "Менеджер",, Истина);
	
	ЗаказКлиентаЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	ВзаиморасчетыСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Склад);
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Склад, СкладГруппа, Товары, Ложь);
	
	Приоритет = ЗначениеНастроекПовтИсп.ПолучитьПриоритетПоУмолчанию(Приоритет);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Начало изменений Иванова Анна 20200219
	ПроверяемыеРеквизиты.очистить();
	Возврат;
	//Конец изменений Иванова Анна 20200219
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НалогообложениеНДС");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.СтавкаНДС");
	КонецЕсли;
	
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
	
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);
	
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
												НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента),
												Отказ,
												МассивНепроверяемыхРеквизитов);
	
	НоменклатураСервер.ПроверитьЗаполнениеСодержания(ЭтотОбъект,Отказ,"Товары");

	// Срок действия заказа должен быть не меньше даты документа
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован
		И Не ЭтоЗаказКакСчет
		И ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru = 'Дата согласования должна быть не меньше даты документа %Дата%';
							|en = 'Approval date shall not be less than document date %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата, "ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаСогласования",
			,
			Отказ);
		
	КонецЕсли;
	
	ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ЭтотОбъект, "Товары", "Отменено");
	
	МассивНепроверяемыхРеквизитов.Добавить("ДатаОтгрузки");
	
	// Дата отгрузки в шапке должна быть не меньше даты документа
	Если НеОтгружатьЧастями И 
		ЗначениеЗаполнено(ДатаОтгрузки) И 
		ДатаОтгрузки < НачалоДня(Дата) Тогда
	
		ТекстОшибки = НСтр("ru = 'Дата отгрузки должна быть не меньше даты документа %Дата%';
							|en = 'Shipment date cannot be less than document date%Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаОтгрузки",
			,
			Отказ);

	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаОтмены");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаОтгрузки");
	
	ПараметрыВстраивания = Документы.ЗаказКлиента.ДоступныеОстаткиПараметрыВстраивания();
	ТаблицаОшибок = ОбеспечениеВДокументахСервер.ТаблицаОшибокЗаполнения(ЭтотОбъект, ПараметрыВстраивания);
	
	ДатаОтгрузкиОбязательна = Ложь;
	ШаблонТекстаДатаОтгрузки = НСтр("ru = 'Не заполнена колонка ""Дата отгрузки"" в строке %НомерСтроки% списка ""Товары""';
									|en = 'Column ""Shipment date"" in line %НомерСтроки% of the Item list is not filled in'");
	
	Для ТекИндекс = 0 По ТаблицаОшибок.Количество() - 1 Цикл
		
		СтрокаОшибки = ТаблицаОшибок[ТекИндекс];
		
		Если СтрокаОшибки.ДатаОтгрузкиОбязательна И Не НеОтгружатьЧастями И СтрокаОшибки.ДатаОтгрузкиНеЗаполнена Тогда
			
			ТекстОшибки   = СтрЗаменить(ШаблонТекстаДатаОтгрузки, "%НомерСтроки%", СтрокаОшибки.НомерСтроки);
			ПутьКТабЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаОшибки.НомерСтроки, "ДатаОтгрузки");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКТабЧасти, , Отказ);
			
		КонецЕсли;
		ДатаОтгрузкиОбязательна = ДатаОтгрузкиОбязательна Или СтрокаОшибки.ДатаОтгрузкиОбязательна;
		
	КонецЦикла;
	
	Если ДатаОтгрузкиОбязательна И НеОтгружатьЧастями И Не ЗначениеЗаполнено(ДатаОтгрузки) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ""Дата отгрузки"" не заполнено';
							|en = '""Shipment date"" is not filled in'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДатаОтгрузки", , Отказ);
		
	КонецЕсли;
	
	СоответствиеКодовСтрок = Новый Соответствие;
	
	Для ТекИндекс = 0 По Товары.Количество()-1 Цикл
		
		СтрокаТовары = Товары[ТекИндекс]; // СтрокаТабличнойЧасти
		
		АдресОшибки = " " + НСтр("ru = 'в строке %НомерСтроки% списка ""Товары""';
								|en = 'in line %НомерСтроки% of the ""Goods"" list'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", СтрокаТовары.НомерСтроки);
		
		// Причина отмены обязательна для заполнения в строках без признака Отменено
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов")
			И СтрокаТовары.Отменено И
			Не ЗначениеЗаполнено(СтрокаТовары.ПричинаОтмены) Тогда
			
			ТекстОшибки = НСтр("ru = 'Необходимо указать причину отмены';
								|en = 'Cancellation reason is required'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ПричинаОтмены"),
				,
				Отказ);
			
		КонецЕсли;
		
		// Дата отгрузки в тч Товары должна быть не меньше даты документа
		Если Не НеОтгружатьЧастями 
			И ЗначениеЗаполнено(СтрокаТовары.ДатаОтгрузки) 
			И СтрокаТовары.ДатаОтгрузки < НачалоДня(Дата) Тогда
			
			ТекстОшибки = НСтр("ru = 'Дата отгрузки должна быть не меньше даты документа ""%Дата%""';
								|en = 'Shipment date cannot be less than document date ""%Дата%""'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки,"%Дата%", Формат(Дата, "ДЛФ=DD"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ДатаОтгрузки"),
				,
				Отказ);
			
		КонецЕсли;
		
		ЗаказыСервер.ПроверитьДублиКодовСтрокВТаблице(ЭтотОбъект,
			СтрокаТовары.КодСтроки,
			СтрокаТовары.НомерСтроки,
			СоответствиеКодовСтрок,
			Отказ);
		
	КонецЦикла;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ДоговорОбязателенПоСоглашению = ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Соглашение)
		И ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Соглашение, "ИспользуютсяДоговорыКонтрагентов");
		
	Если Не ДоговорОбязателенПоСоглашению
		И Не ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала
		И Не ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
		И Не (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию И Не ИспользоватьСоглашенияСКлиентами) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Договор");
		
	КонецЕсли;
	
	ДоставкаТоваров.ПроверитьЗаполнениеРеквизитовДоставки(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	ПроверитьИзменениеХозяйственнойОперации(Отказ);
	
	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;
	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	СуммаВозвратнойТары = ПолучитьСуммуВозвратнойТары();
	
	ПродажиСервер.ПроверитьКорректностьЗаполненияДокументаПродажи(ЭтотОбъект, Отказ);
	
	Если Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован И Не ВсеСтрокиОтменены Тогда
		
		ПродажиСервер.ПроверитьЗапретОтгрузки(Партнер, Отказ);
		
	КонецЕсли;
	
	ЗаказКлиентаЛокализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ЗаказКлиентаЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения); 
	//Начало изменений Иванова Анна 20190908
	//Не удаляем движения при записи!!!
	//ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	//Начало Изменений Иванова Анна 20190908
	//ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
	//Конец Изменений Иванова Анна 20190908
	
	РегистрыСведений.СтатусыСборкиИДоставки.ЗаписатьСтатусИзРаспоряжения(Ссылка, Отказ);
	
	ПродажиСервер.ВыполнитьКонтрольЗаказаПослеПроведения(Ссылка, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ЗаказКлиентаЛокализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ, Истина);
	
	РегистрыСведений.СтатусыСборкиИДоставки.ЗаписатьСтатусИзРаспоряжения(Ссылка, Отказ, Истина);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// <-- Начало Лико Яцун С. В. 15.06.2023 
	Если ОбъектКопирования.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка И ОбъектКопирования.ВидЗаказа <> ОбъектКопирования.Ссылка.ВидЗаказа Тогда
		ВидНовогоЗаказа = ВидЗаказа;
		ВидЗаказа = ОбъектКопирования.Ссылка.ВидЗаказа;
		ОбъектКопирования.ВидЗаказа = ОбъектКопирования.Ссылка.ВидЗаказа;
		ДанныеЗаполнения = Новый Структура("ВидНовогоЗаказа",ВидНовогоЗаказа); 
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 15.06.2023
	Статус                 = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка();
	ДатаОтгрузки           = Дата(1,1,1);
	ДатаСогласования       = Дата(1,1,1);
	МаксимальныйКодСтроки  = 0;
	Согласован             = Ложь;
	ДокументОснование      = Неопределено;
	НомерПоДаннымКлиента   = "";
	ДатаПоДаннымКлиента    = Дата(1,1,1);
	Назначение             = Неопределено;
	ИдентификаторПлатежа   = Неопределено;
	// <-- Начало Лико Яцун С. В. 15.05.2023 
	МетрыКПечати           = 0;
	// <-- Конец Лико Яцун С. В. 15.05.2023
	//+ Лико m.shenderov 29.09.2021
	СозданВПроизводстве=Неопределено;
	//- Лико m.shenderov 29.09.2021
	СостояниеЗаполненияМногооборотнойТары = Перечисления.СостоянияЗаполненияМногооборотнойТары.ПустаяСсылка();
	// --> Начало Лико Ефимов ЕВВ 03.04.2024
	Если ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
		ДействиеСИзлишками = Неопределено; 
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 03.04.2024
	// --> Начало Лико Ефимов ЕВВ 16.09.2024
	Для каждого Строка из Цвета Цикл
		Строка.ЗаказФорм = Неопределено;
	КонецЦикла;
	// <-- Конец Лико Ефимов ЕВВ 16.09.2024
	// --> Начало Лико Ефимов ЕВВ 18.09.2024
	Если ПараметрыСеанса.ТекущийПользователь.Наименование = "Горе Марина Вадимовна" 
		ИЛИ ПараметрыСеанса.ТекущийПользователь.Наименование = "Сергеева Марина" Тогда
		Регион = Неопределено;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 18.09.2024
	// --> Начало Лико Ефимов ЕВВ 16.10.2024
	ДатаОтправкиУведомленияОСкоройПечати = Неопределено;
	// <-- Конец Лико Ефимов ЕВВ 16.10.2024
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Статус") = Перечисления.СтатусыДоговоровКонтрагентов.Закрыт Тогда
		Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ДатаОтгрузкиВСтроке = Дата(1,1,1);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ЗначениеЗаполнено(Соглашение) Тогда
		УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина);
		Если УсловияПродаж.СтатусСоглашения <> Перечисления.СтатусыСоглашенийСКлиентами.Закрыто Тогда
			Если ЗначениеЗаполнено(УсловияПродаж.СрокПоставки) И Не ЭтоЗаказКакСчет Тогда
				ДатаОтгрузкиВСтроке = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(
					ТекущаяДатаСеанса(),
					Перечисления.Периодичность.День,
					УсловияПродаж.СрокПоставки) + 1;
			КонецЕсли;
		Иначе
			Соглашение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если НеОтгружатьЧастями Тогда
		ДатаОтгрузки = ДатаОтгрузкиВСтроке;
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		КомиссионныеПродажи25 = ПродажиСервер.ЭтоДоговорПоНовойКомиссии(Договор);
	Иначе
		КомиссионныеПродажи25 = Ложь;
	КонецЕсли;
	
	Если КомиссионныеПродажи25 Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи Тогда
		ВернутьМногооборотнуюТару      = Ложь;
		СрокВозвратаМногооборотнойТары = 0;
		ТребуетсяЗалогЗаТару           = Ложь;
	КонецЕсли;

	Для Каждого СтрокаТЧ Из Товары Цикл
		
		СтрокаТЧ.КодСтроки      = 0;
		СтрокаТЧ.ДатаОтгрузки   = ДатаОтгрузкиВСтроке;
		СтрокаТЧ.Отменено = Ложь;
		СтрокаТЧ.ПричинаОтмены = Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка();
		
		//--> noname
		Если Не ЗаДеньги И (ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник ИЛИ ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка) Тогда
			Лико_Дополнительно.ОчищениеЦенВТоварыНеЗаДеньги(СтрокаТЧ);
		КонецЕсли;  
		//<-- noname
	КонецЦикла;
	
	СкидкиНаценкиЗаполнениеСервер.ОтменитьСкидки(ЭтотОбъект, "Товары", Истина,,Истина);
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.СуммаБонусныхБалловКСписанию = 0;
		СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте = 0;
	КонецЦикла;

	// <-- Начало Лико Яцун С. В. 15.06.2023
	//ИнициализироватьДокумент();
	ИнициализироватьДокумент(ДанныеЗаполнения);
	// <-- Конец Лико Яцун С. В. 15.06.2023
	
	ВзаиморасчетыСервер.ПриКопировании(ЭтотОбъект);
	
	ЗаказКлиентаЛокализация.ПриКопировании(ЭтотОбъект, ОбъектКопирования);

	Автор = Пользователи.АвторизованныйПользователь();
	
КонецПроцедуры
//{{MRG[ <-> ]
//	ИнициализироватьДокумент();
//}}MRG[ <-> ]

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьДокументНаОснованииПартнера(Знач Основание)
	
	Партнер = Основание;
	ПродажиСервер.ПроверитьВозможностьВводаНаОснованииПартнераКлиента(Партнер, ЭтотОбъект);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		ЗаполнитьУсловияПродажПоУмолчанию();
	Иначе
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииСделкиПоПродаже(Основание)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КоммерческоеПредложениеКлиенту.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_КоммерческиеПредложения
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
		|ГДЕ
		|	КоммерческоеПредложениеКлиенту.Сделка = &Основание
		|	И НЕ КоммерческоеПредложениеКлиенту.ПометкаУдаления
		|	И КоммерческоеПредложениеКлиенту.Проведен
		|	И КоммерческоеПредложениеКлиенту.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКоммерческихПредложенийКлиентам.Действует)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоммерческоеПредложениеКлиенту.МоментВремени УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СделкиСКлиентами.Ссылка КАК Сделка,
		|	СделкиСКлиентами.Партнер КАК Партнер,
		|	СделкиСКлиентами.СоглашениеСКлиентом КАК Соглашение,
		|	СделкиСКлиентамиПартнерыИКонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ЕСТЬNULL(ВТ_КоммерческиеПредложения.Ссылка, НЕОПРЕДЕЛЕНО) КАК КоммерческоеПредложение
		|ИЗ
		|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкиСКлиентами.ПартнерыИКонтактныеЛица КАК СделкиСКлиентамиПартнерыИКонтактныеЛица
		|		ПО (СделкиСКлиентамиПартнерыИКонтактныеЛица.Ссылка = СделкиСКлиентами.Ссылка)
		|			И (СделкиСКлиентамиПартнерыИКонтактныеЛица.Партнер = СделкиСКлиентами.Партнер)
		|			И (СделкиСКлиентамиПартнерыИКонтактныеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоммерческиеПредложения КАК ВТ_КоммерческиеПредложения
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СделкиСКлиентами.Ссылка = &Основание");
		
	Запрос.УстановитьПараметр("Основание",Основание);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСделкиПоПродаже(Выборка.Партнер);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		Если ЗначениеЗаполнено(Соглашение) Тогда
			ЗаполнитьУсловияПродажПоСоглашению(НЕ ЗначениеЗаполнено(Выборка.КоммерческоеПредложение));
		Иначе
			ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	// Дополнить данными последнего коммерческого предложения
	Если ЗначениеЗаполнено(Выборка.КоммерческоеПредложение) Тогда
		Продажи.ПриОбработкеЗаполненияЗаказаКлиента(ЭтотОбъект, Выборка.КоммерческоеПредложение, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииИндивидуальногоСоглашенияСКлиентом(Знач ДокументОснование)
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СоглашениеСКлиентом.Ссылка         КАК Соглашение,
		|	СоглашениеСКлиентом.Партнер        КАК Партнер,
		|	СоглашениеСКлиентом.КонтактноеЛицо КАК КонтактноеЛицо,
		|
		|	СоглашениеСКлиентом.Статус      КАК СтатусДокумента,
		|	ВЫБОР
		|		КОГДА
		|			СоглашениеСКлиентом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|		ТОГДА
		|			ЛОЖЬ
		|		ИНАЧЕ
		|			ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	СоглашениеСКлиентом.Типовое КАК ЕстьОшибкиТиповое,
		|	СоглашениеСКлиентом.НаправлениеДеятельности КАК НаправлениеДеятельности
		|
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашениеСКлиентом
		|ГДЕ
		|	СоглашениеСКлиентом.Ссылка = &ДокументОснование
		|");
		
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	РезультатЗапроса = МассивРезультатовЗапроса[0]; // РезультатЗапроса
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыСоглашенийСКлиентами.Действует);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСоглашения(Выборка.ЕстьОшибкиТиповое);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.Соглашение,
		Выборка.СтатусДокумента,
		,
		Выборка.ЕстьОшибкиСтатус,
		МассивДопустимыхСтатусов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ЗаполнитьУсловияПродажПоСоглашению();

КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииЗаданияТорговомуПредставителю(Знач Основание)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаданиеТорговомуПредставителю.Ссылка КАК ДокументОснование,
		|	ЗаданиеТорговомуПредставителю.Организация КАК Организация,
		|	ЗаданиеТорговомуПредставителю.Партнер КАК Партнер,
		|	ЗаданиеТорговомуПредставителю.Контрагент КАК Контрагент,
		|	ЗаданиеТорговомуПредставителю.Договор КАК Договор,
		|	ЗаданиеТорговомуПредставителю.Соглашение КАК Соглашение,
		|	ЗаданиеТорговомуПредставителю.Соглашение.ОплатаВВалюте КАК ОплатаВВалюте,
		|	ЗаданиеТорговомуПредставителю.Валюта КАК Валюта,
		|	ЗаданиеТорговомуПредставителю.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЗаданиеТорговомуПредставителю.ГрафикОплаты КАК ГрафикОплаты,
		|	ЗаданиеТорговомуПредставителю.Склад КАК Склад,
		|	ЗаданиеТорговомуПредставителю.ФормаОплаты КАК ФормаОплаты,
		|	ВЫБОР КОГДА ЗаданиеТорговомуПредставителю.НеОтгружатьЧастями ТОГДА
		|			ЗаданиеТорговомуПредставителю.ЖелаемаяДатаОтгрузки
		|		ИНАЧЕ
		|			ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ КАК ДатаОтгрузки,
		|	ЗаданиеТорговомуПредставителю.НеОтгружатьЧастями КАК НеОтгружатьЧастями,
		|	ЗаданиеТорговомуПредставителю.Статус КАК СтатусДокумента,
		|	ЗаданиеТорговомуПредставителю.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЗаданиеТорговомуПредставителю.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗаданиеТорговомуПредставителю.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
		|	ЗаданиеТорговомуПредставителю.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
		|	ЗаданиеТорговомуПредставителю.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
		|	ЗаданиеТорговомуПредставителю.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
		|	ВЫБОР
		|		КОГДА ЗаданиеТорговомуПредставителю.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийТорговымПредставителям.Отработано)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	ЗаданиеТорговомуПредставителю.Товары.(
		|		Номенклатура КАК Номенклатура,
		|		Характеристика КАК Характеристика,
		|		Количество КАК Количество,
		|		Упаковка КАК Упаковка,
		|		КоличествоУпаковок КАК КоличествоУпаковок,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма,
		|		ВидЦены КАК ВидЦены,
		|		СтавкаНДС КАК СтавкаНДС,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаСНДС КАК СуммаСНДС,
		|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|		ПричинаОтмены КАК ПричинаОтмены,
		|		Содержание КАК Содержание,
		|		ВЫБОР
		|			КОГДА ЗаданиеТорговомуПредставителю.Товары.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ КАК Отменено,
		|		ВЫБОР
		|			КОГДА ЗаданиеТорговомуПредставителю.Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ИНАЧЕ ЗаданиеТорговомуПредставителю.Склад
		|		КОНЕЦ КАК Склад
		|	) КАК Товары,
		|	ЗаданиеТорговомуПредставителю.ЭтапыГрафикаОплаты.(
		|		ВариантОплаты КАК ВариантОплаты,
		|		ВариантОтсчета КАК ВариантОтсчета,
		|		ДатаПлатежа КАК ДатаПлатежа,
		|		ПроцентПлатежа КАК ПроцентПлатежа,
		|		СуммаПлатежа КАК СуммаПлатежа,
		|		ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
		|		СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
		|		НомерСтроки КАК НомерСтроки
		|	) КАК ЭтапыГрафикаОплаты
		|ИЗ
		|	Документ.ЗаданиеТорговомуПредставителю КАК ЗаданиеТорговомуПредставителю
		|ГДЕ
		|	ЗаданиеТорговомуПредставителю.Ссылка = &Основание");
	
	Запрос.УстановитьПараметр("Основание",Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаданийТорговымПредставителям.Отработано);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.ДокументОснование,
		Выборка.СтатусДокумента,
		,
		Выборка.ЕстьОшибкиСтатус,
		МассивДопустимыхСтатусов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперация, Валюта);
	КонецЕсли;
	
	ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчет, БанковскийСчетКонтрагента);
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	КонецЕсли;
	
	ТаблицаТовары = Выборка.Товары.Выгрузить();
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Количество",0);
	
	// Найдем и удалим из таблицы строки с нулевым количеством
	НулевыеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого ТекЭлемент Из НулевыеСтроки Цикл
		ТаблицаТовары.Удалить(ТекЭлемент);
	КонецЦикла;
	
	Товары.Загрузить(ТаблицаТовары);

	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
	СтруктураПараметры.Вставить("УправляемыеСкидки", Неопределено);
	
	СкидкиНаценкиСервер.Рассчитать(ЭтотОбъект, СтруктураПараметры);
	СкидкиРассчитаны = Истина;
	
	ТаблицаЭтаповОплаты = Выборка.ЭтапыГрафикаОплаты.Выгрузить();
	
	// Если в задании заполнены этапы графиков оплаты - скопируем их
	Если ТаблицаЭтаповОплаты.Количество() > 0 Тогда
		ЭтапыГрафикаОплаты.Загрузить(ТаблицаЭтаповОплаты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("Партнер") Тогда
		
		Партнер = ДанныеЗаполнения.Партнер;
		ПродажиСервер.ПроверитьВозможностьВводаНаОснованииПартнераКлиента(Партнер, ЭтотОбъект);
		Если ДанныеЗаполнения.Свойство("Контрагент")
			И ТипЗнч(ДанныеЗаполнения.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Контрагент = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
			ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
		
	ИначеЕсли ДанныеЗаполнения.Свойство("Сделка") Тогда
		
		ЗаполнитьДокументНаОснованииСделкиПоПродаже(ДанныеЗаполнения.Сделка);
		
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Организация)
		И ДанныеЗаполнения.Свойство("Организация")
		И ТипЗнч(ДанныеЗаполнения.Организация) = Тип("СправочникСсылка.Организации") Тогда
		Организация = ДанныеЗаполнения.Организация;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
		Менеджер = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЭтоЗаказКакСчет = Не ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	Организация               = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	КонецЕсли;
	Подразделение             = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Менеджер, Подразделение);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    			= Организация;
	СтруктураПараметров.БанковскийСчет 			= БанковскийСчет;
	БанковскийСчет            = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
		
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(
		Контрагент, , 
		БанковскийСчетКонтрагента,
		БанковскийСчет);
		
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    	= Организация;
	СтруктураПараметров.ФормаОплаты 	= ФормаОплаты;
	СтруктураПараметров.Касса 			= Касса;
	СтруктураПараметров.ФизическоеЛицо	= Курьер;
	Касса                     = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
		
	Склад                     = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад,
		ПолучитьФункциональнуюОпцию("ИспользоватьСкладыВТабличнойЧастиДокументовПродажи"));
	Приоритет                 = ЗначениеНастроекПовтИсп.ПолучитьПриоритетПоУмолчанию(Приоритет);
	НеОтгружатьЧастями        = Истина;
	Если ЭтоЗаказКакСчет Тогда
		Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	Иначе
		Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") Тогда
			ДатаОтгрузки = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли; 
	
	СтруктураДействий = Новый Структура();
	ПараметрыДокумента = Документы.ЗаказКлиента.ПараметрыДокументаДляДействийОбеспечения(ЭтотОбъект);
	ПоляСтрокой = "ВариантОбеспечения";
	ОбеспечениеВДокументахКлиентСервер.ДобавитьДействияОбеспечения(СтруктураДействий, ПоляСтрокой, ПараметрыДокумента);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);
	
	ПараметрыЗаполнения = Документы.ЗаказКлиента.ПараметрыЗаполненияНалогообложенияНДСПродажи(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(ЭтотОбъект);
	СтруктураДействий = Новый Структура;
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураЗаполненияСтавкиНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЭтотОбъект, Истина);
	СтруктураЗаполненияСтавкиНДС.ЗаполнениеНаОснованииКопирование = ЗначениеЗаполнено(ДанныеЗаполнения);
	СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", СтруктураЗаполненияСтавкиНДС);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, КэшированныеЗначения);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		КэшированныеЗначения.ОбработанныеСтроки,
		СтруктураДействий,
		Товары,
		КэшированныеЗначения);
	
	//Начало изменений Иванова Анна 20200430	
	ИнициализироватьНачальныеПараметры(ДанныеЗаполнения);
	//20190328- используем свой механизм для пересчета НДС
	//УчетНДСУП.СкорректироватьСтавкуНДСВТЧДокумента(ЭтотОбъект, Товары);
	//Конец изменений Иванова Анна 20190328
	
КонецПроцедуры

Процедура ИнициализироватьУсловияПродаж()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И Не ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗаполнитьУсловияПродажПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

//Начало изменений Иванова А.В.
Процедура ИнициализироватьНачальныеПараметры(ДанныеЗаполнения) Экспорт
	Дата = ТекущаяДата();
	Версия = 0;
	Валюта = Справочники.Валюты.НайтиПоКоду("978");
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	способдоставки = Перечисления.СпособыДоставки.Самовывоз;
	НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Состояние = Перечисления.Лико_СостоянияЗаказов.Создан;
	Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
	ЦенаВключаетНДС = Истина;
	Заблокирован = Ложь;
	КоличествоПоУпаковке = 0;
	КомментарийОУ = "";
	ОтветственныйОУ = Справочники.Пользователи.ПустаяСсылка();
	ПечатьВПрисутствииТехнолога = Ложь; 
	ПечатьВПрисутствииМенеджера = Ложь;
	ПечатьВПрисутствииЗаказчика = Ложь;
	ПлощадьКлише = 0;
	ПервыйВсерии = Документы.ЗаказКлиента.ПустаяСсылка();
	СерийныйЗаказ = Ложь;
	РазрешитьОтрицательнуюДоходность = Ложь;
	КомментарийПланировщика = "";
	ПланируемаяДатаСклад = Неопределено; 
	ЕстьЗаявкаНаОтгрузку = Ложь;      
	ДоходПлан = 0;
	РентабельностьПлан =0 ;
	ДоходностьПлан = 0;
	МетражПланКВМ = 0;
	МетражПланПМ = 0; 
	ПредыдущийЗаказ = Документы.ЗаказКлиента.ПустаяСсылка(); 
	РезультатЗаказа = Документы.Лико_РезультатЗаказа.ПустаяСсылка();
	НомерЗаказаЛинкс= "";
	НомерПЗЛинкс = "";
	//БезОМ = Ложь;
	//РазмерКода = Неопределено;
	// <-- Начало Лико Яцун С. В. 29.10.2024 
	ЧЗ = Неопределено;
	// <-- Конец Лико Яцун С. В. 29.10.2024
    СтоимостьОснастки = 0;
	//Маковеева А.Ю. 18.02.2022: ПорядокОплаты переименован в УдалитьПорядокОплаты, ПорядокОплатыПоСоглашениям - в УдалитьПорядокОплатыПоСоглашениям
	//Если Не ЗначениеЗаполнено(УдалитьПорядокОплаты) Тогда 		
	//	УдалитьПорядокОплаты =  Перечисления.УдалитьПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях; 
	//КонецЕсли;
	НомерБезПрефикса = "";
	ДатаОтправкиВРаботу = '0001.01.01';
	ДатаПервойОтправкиВРаботу = '0001.01.01';
	
	// <-- Начало Лико Яцун С. В. 29.10.2025 
	СклейкаРукаваНужна = Ложь;
	ПеремоткаНужна = Ложь;
	ОстатокРоликаХранить = Ложь;
	ОтгрузкаНужна = Ложь;
	ЗаДеньги = Ложь;
	СклейкаРукаваНеНужна = Ложь;
	ПеремоткаНеНужна = Ложь;
	ОстатокРоликаНеХранить = Ложь;
	ОтгрузкаНеНужна = Ложь;
	РоликиСОбразцами = Неопределено;
	КонвертыСОбразцами = Неопределено;
	Технолог = Неопределено;
	// <-- Конец Лико Яцун С. В. 29.10.2025
	ЦветаСтрокойЦифра = "";
	Втулка = Неопределено;
	// --> Начало Лико Яцун 25.04.2022 
	НеБолееУказанногоКоличества = Ложь;
	Если ЧестныйЗнак И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,Партнер,"УтилизироватьИзлишкиДляЧЗ",Ложь) Тогда
		УтилизироватьИзлишки = Истина;
		ДействиеСИзлишками = Перечисления.Лико_ДействияСИзлишками.Утилизировать; // --> Начало Лико Ефимов ЕВВ 29.03.2024
	Иначе
		УтилизироватьИзлишки = Ложь;
	КонецЕсли;
	// <-- Конец Лико Яцун 25.04.2022 
	
	ДатаЗакрытия =  '0001.01.01';
	Пользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(Пользователь.Лико_Менеджер)  Тогда 
		Если ДанныеЗаполнения <> Неопределено ТОгда 
			Менеджер = ДанныеЗаполнения.Менеджер;
		Иначе
			Менеджер = Пользователь.Лико_Менеджер;
		КонецЕсли;
	КонецЕсли;
	Ответственный = ПОльзователи.ТекущийПользователь();

	ДатаУтвержденияРабот = '0001.01.01';
	ДатаУтвержденияЦветов = '0001.01.01';
	УтвердилЦвета = Справочники.Пользователи.ПустаяСсылка();
	УтвердилРаботы = Справочники.Пользователи.ПустаяСсылка();

	СрочноеЦветоделение = Ложь;
	КоличествоРоликов = 0;
	КоличествоКоробок = 0;
	ОписаниеИзменений = "";
	Цветоделение.Очистить();
	Отгрузки.Очистить();
	Нормативы.Очистить();
	КартаПерерасхода.Очистить();
	КартаСнятия.Очистить();
	Перемотка.Очистить();
	ИзготовлениеФорм.Очистить();
	Производство.Очистить();
	ПараметрыСклейки.Очистить();
	ПараметрыПродувки.Очистить();

	Если Товары.Количество()>0 Тогда 
		//20200712 - пробник, пф, цифровая проба - без цены
		Для каждого стр из Товары Цикл
			стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
			СтавкаЧислом = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(стр.СтавкаНДС);
			Если СтавкаЧислом= 18 Тогда 
				стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				стр.Цена = (стр.цена/1.18)*1.20;
				стр.сумма = стр.количество*стр.цена;
				стр.суммаСНДС = стр.сумма;
				стр.СуммаНДС = стр.сумма*СтавкаЧислом/(100+СтавкаЧислом);
				//Меняем и цену для документов
				Если ЦенаДляДокументовВключаетНДС Тогда 
					Стр.ЦенаДляДокументов = (Стр.ЦенаДляДокументов/1.18)*1.20;
				КонецЕсли;					
			КонецЕсли;
			// --> Начало Лико Ефимов ЕВВ 02.08.2021
			// Нужно очистить даты эмиссии. Они хранятся в справочнике ЧестныйЗнак, поэтому присвоим новые честные знаки
			Если ЗначениеЗаполнено(Стр.ЧестныйЗнак) И ЗначениеЗаполнено(Стр.ЧестныйЗнак.ДатаЭмиссии) Тогда
				// <-- Начало Лико Яцун С. В. 15.06.2023
				//При создании заказов на переборку дату эмиссии очищать не нужно
				Если ДанныеЗаполнения <> Неопределено И ДанныеЗаполнения.Свойство("ВидНовогоЗаказа") И ДанныеЗаполнения.ВидНовогоЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка Тогда
					Продолжить;	
				Иначе	
					// <-- Конец Лико Яцун С. В. 15.06.2023	
					Стр.ЧестныйЗнак = Лико_Дополнительно.НайтиСоздатьЧестныйЗнак(Стр.ЧестныйЗнак.Gtin, Дата('00010101'));
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЦикла;
		
		СуммаДокумента = Товары.Итог("СуммаСНДС")+СтоимостьОснастки;
	КонецЕсли;

	ДатаОтгрузки = ТекущаяДата()+604800;
	ЖелаемаяДатаОтгрузки = ТекущаяДата()+604800;
	ОсновнойМатериалФакт = Справочники.ЦеновыеГруппы.ПустаяСсылка();
	НарезкаФакт = Справочники.ЯССМ_Нарезки.ПустаяСсылка();
	ПоказыватьКлиентуМатериалИзЗаказа = Ложь;

	Для каждого стр из Цвета Цикл		
        стр. ЗаказНовойОснастки = Ложь;
		стр.УтвердилОператор = Неопределено;
		стр.НовыйВал = Ложь;
		стр.Цветоделение = Ложь;
		стр.Перегравировка = Ложь;
		Если Не ЗначениеЗаполнено(стр.номерРаботы) Тогда
			стр.НомерРаботы = 1;
		КонецЕсли;

		Если ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда

			стр.ВидПолимера = Справочники.Лико_ВидыПолимеров.ПустаяСсылка();
			стр.ТипСкотча   = Неопределено;  			
			стр.Кривая		  = "";
			стр.Cycles 		  = "";
			стр.DoubleHit 	  = ложь;
			стр.Дисторт		  = 0; 
			стр.Density 	  = 0;
			стр.СоставПантона = "";
			стр.ColorMatch 	  = 0; 
			стр.Клики 		  = 0; 
			стр.Enulec 		  = "";
			стр.ТипРакеля	  = Неопределено;
			стр.Растворитель  = "";
			стр.Замедлитель	  = "";			

		КонецЕсли;   		
	КонецЦикла; 

	Если   Соглашение.Типовое Тогда 
		Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
	КонецЕсли;


	ПроверкаОрфографии = Истина;
	ПроверкаШК = Истина;
	ОтгрузкаСНастройкой = Неопределено;
	БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
	Руководитель = Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка();
	ГлавныйБухгалтер = Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка();
	ВариантОтгрузки = Неопределено;
	// --> Начало Лико Ефимов ЕВВ 26.05.2021
	ВидНастройки = Неопределено;
	// <-- Конец Лико Ефимов ЕВВ 26.05.2021


	// --> Начало Лико Ефимов ЕВВ 14.03.2022
	СчетНаПредоплату = Неопределено;
	// <-- Конец Лико Ефимов ЕВВ 14.03.2022 

	// --> Начало Лико Субботин 02.08.2022 	
	//очистка новых реквизитов для ТачПада 
	ПроблемыПриПечати = ""; 
	Resipe = ""; 
	Registron = "";
	LineThinning = 0;   
	Линиатура = 0; 


	СтатусКолористов = Неопределено;   

	ПричиныЗамены.Очистить(); 

	КоличествоКодовЧестногоЗнакаПлан = 0;

	// --> Начало Лико Ефимов ЕВВ 14.11.2022
	Если ЗначениеЗаполнено(Партнер) И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Партнер, "Лико_ПриКопированииЗаказаОчищатьКолонкуГород", Ложь) Тогда
		Для каждого Строка из Товары Цикл
			Строка.Город = Неопределено;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 14.11.2022
	ДатаВыпуска = Неопределено;
	
КонецПроцедуры

//Конец изменений Иванова А.В.

#КонецОбласти

#Область Прочее

Процедура ПроверитьИзменениеХозяйственнойОперации(Отказ)
	
	ОперацииПередачи = ПродажиСервер.ОперацииПередачиТоваров();
	
	Если Не ЭтоНовый()
		И ОперацииПередачи.Найти(ХозяйственнаяОперация) <> Неопределено Тогда
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РасчетыСКлиентами.СуммаРасход КАК СуммаОплаты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,Период,
		|		ОбъектРасчетов = &ОбъектРасчетов
		|	) КАК РасчетыСКлиентами
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Документ.ЗаказКлиента КАК ДанныеДокумента
		|	ПО
		|		ДанныеДокумента.Ссылка = &Ссылка
		|		И ДанныеДокумента.ХозяйственнаяОперация <> &ХозяйственнаяОперация
		|ГДЕ
		|	РасчетыСКлиентами.СуммаРасход > 0
		|");
		Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Заказ клиента оплачен. Нельзя устанавливать операцию %1';
					|en = 'Sales order is paid. Cannot set transaction %1'"),
				ХозяйственнаяОперация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ЭтотОбъект,
				"ХозяйственнаяОперация",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуВозвратнойТары()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.Отменено КАК Отменено
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Отменено
	|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	И &ВернутьМногооборотнуюТару
	|	И НЕ &ТребуетсяЗалогЗаТару
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС,Отменено"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаВозвратнойТарыЗаказанныхСтрок = Выгрузка[0].СуммаСНДС;
	Возврат СуммаВозвратнойТарыЗаказанныхСтрок;
	
КонецФункции


//+ Лико m.shenderov 02.09.2021
Процедура ОснасткаСоздатьСообщение() //+Лико m.shenderov 02.09.2021
	УстановитьПривилегированныйРежим(Истина);	
	Если СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование  Тогда		
		ЗаголовокСообщения="готов к программированию";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ПрограммированиеОснастки;		
	Иначе
		ЗаголовокСообщения="готов к гравировке";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ГотовКГравировкеОснастки;		
	КонецЕсли;
	
	Текст =  СтрШаблон("Заказ № %1 %2",НомерБезПрефикса,ЗаголовокСообщения);
	
	Тема  = Текст;
	Текст= Символы.ПС+ "Ссылка : "+Символы.ПС+Символы.ВК+ПолучитьНавигационнуюСсылку(Ссылка);
	Для каждого Товар  Из Товары  Цикл
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+Товар.Артикул+ ";        Номенклатура =  "+Строка(Товар.Наименование);			
	КонецЦикла;	
	Текст=Текст+Символы.ПС+Символы.ВК;  
	
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Площадка); 		
	
	Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат,,"textBody"); 
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.09.2021
//- Лико m.shenderov 02.09.2021
Функция АрендаРЦИксПак(Период) //+--->Лико m.shenderov 25.09.2024
	
	Результат = Ложь;
	
	ДатаНачалаАрендыРЦИксПак  = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаАрендыРЦИксПак.ЗначениеПараметра; 
	
	Если ЗначениеЗаполнено(ДатаНачалаАрендыРЦИксПак) 
		И ТипЗнч(ДатаНачалаАрендыРЦИксПак) = Тип("Дата") 
		И ДатаНачалаАрендыРЦИксПак<=Период Тогда 
		
		Результат = Истина;  
	КонецЕсли;
	
	
	
	Возврат Результат;
	
КонецФункции //-<---Лико m.shenderov 25.09.2024

Процедура ЗапретИспользованияДавальческогоСырья(Отказ) 
	
	Если ДавальческоеСырье = Истина Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запрет на использование давальческого сырья в заказе!";
		Сообщение.Поле = "ДавальческоеСырье"; //имя реквизита 
		Сообщение.КлючДанных = Ссылка;
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		Отказ = Истина;  
		
	КонецЕсли;   
	
	Для каждого Цвет Из Цвета Цикл 
		Счетчик = 0;
		Если Цвет.ДавальческоеСырье = Истина Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Запрет на использование давальческого сырья в заказе!";
			Сообщение.Поле = СтрШаблон("Цвета[%1].НомерСтроки",Счетчик); //имя реквизита 
			Сообщение.КлючДанных = Ссылка;
			Сообщение.ПутьКДанным = "Объект";
			
			
			Сообщение.Сообщить();
			Отказ = Истина;  
			Счетчик = Счетчик+1; 
		КонецЕсли;   
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗатратыПроизводства(ТолькоНовые, НомерПроката = Неопределено) Экспорт

	Если НомерПроката = Неопределено Тогда
		МассивПрокатов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Цвета.ВыгрузитьКолонку("НомерПроката"));
	Иначе
		МассивПрокатов = Новый Массив;
		МассивПрокатов.Добавить(НомерПроката);
	КонецЕсли;

	Если НЕ ТолькоНовые Тогда
		// Перед заполнением очистим уже заполненные затраты по текущему прокату
		Для каждого ТекНомерПроката из МассивПрокатов Цикл
			НайденныеСтроки = Производство.НайтиСтроки(Новый Структура("НомерПроката", ТекНомерПроката));
			Для каждого Строка из НайденныеСтроки Цикл
				Производство.Удалить(Строка);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка КАК Нарезка,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник КАК Сотрудник,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник2 КАК Сотрудник2,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка КАК НомерБланка,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПриложения КАК НомерПриложения,
	|	НАЧАЛОПЕРИОДА(Лико_БланкЭтапаТовары.Ссылка.Дата, ДЕНЬ) КАК ДатаРасхода,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка <> ЗНАЧЕНИЕ(Документ.Лико_БланкЭтапа.ПустаяСсылка)
	|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя = Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.НомерПроката = Лико_БланкЭтапаТовары.Ссылка.НомерПроката
	|				ТОГДА 0
	|			ИНАЧЕ Лико_БланкЭтапаТовары.КоличествоРасходУУ
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка <> ЗНАЧЕНИЕ(Документ.Лико_БланкЭтапа.ПустаяСсылка)
	|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя = Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.НомерПроката = Лико_БланкЭтапаТовары.Ссылка.НомерПроката
	|				ТОГДА 0
	|			ИНАЧЕ Лико_БланкЭтапаТовары.КоличествоРасход
	|		КОНЕЦ) КАК КоличествоПМ,
	|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр КАК РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката КАК НомерПроката,
	|	Лико_БланкЭтапаТовары.Ссылка КАК Бланк,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|		ИНАЧЕ Лико_БланкЭтапаТовары.ВидСекции
	|	КОНЕЦ КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	|				И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала В (ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.БесплатныйНастроечный), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПлатныйНастроечный))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НастроечныйМатериал,
	|	Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя КАК Заказ,
	|	МИНИМУМ(Лико_БланкЭтапаТовары.Ссылка.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(Лико_БланкЭтапаТовары.Ссылка.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя = &Заказ
	|	И (Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	|			ИЛИ Лико_БланкЭтапаТовары.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.CLICKS))
	|	И Лико_БланкЭтапаТовары.Ссылка.Проведен
	|	И Лико_БланкЭтапаТовары.Ссылка.НомерПроката В(&МассивПрокатов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник2,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПриложения,
	|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Номенклатура.ЦеноваяГруппа,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката,
	|	Лико_БланкЭтапаТовары.Ссылка,
	|	НАЧАЛОПЕРИОДА(Лико_БланкЭтапаТовары.Ссылка.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	|				И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала В (ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.БесплатныйНастроечный), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПлатныйНастроечный))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|		ИНАЧЕ Лико_БланкЭтапаТовары.ВидСекции
	|	КОНЕЦ,
	|	Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ.Нарезка) КАК Нарезка,
	|	ВТ.Сотрудник КАК Сотрудник,
	|	ВТ.Сотрудник2 КАК Сотрудник2,
	|	ВТ.НомерБланка КАК НомерБланка,
	|	ВТ.НомерПриложения КАК НомерПриложения,
	|	МИНИМУМ(ВТ.ДатаРасхода) КАК ДатаРасхода,
	|	СУММА(ВТ.Количество) КАК Количество,
	|	СУММА(ВТ.КоличествоПМ) КАК КоличествоПМ,
	|	ВТ.РабочийЦентр КАК РабочийЦентр,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	ВТ.ВидРабот КАК ВидРабот,
	|	МИНИМУМ(ВТ.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ВТ.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРасход
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	|	И ВТ.РабочийЦентр.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Прочее)
	|	И ВТ.РабочийЦентр.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Перемотка)
	|	И НЕ ВТ.НастроечныйМатериал
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Сотрудник,
	|	ВТ.Сотрудник2,
	|	ВТ.НомерБланка,
	|	ВТ.НомерПриложения,
	|	ВТ.РабочийЦентр,
	|	ВТ.НомерПроката,
	|	ВТ.ВидРабот
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ.Нарезка),
	|	ВТ.Сотрудник,
	|	МАКСИМУМ(ВТ.Сотрудник2),
	|	ВТ.НомерБланка,
	|	ВТ.НомерПриложения,
	|	ВТ.ДатаРасхода,
	|	0,
	|	0,
	|	ВТ.РабочийЦентр,
	|	ВТ.НомерПроката,
	|	ВТ.ВидРабот,
	|	МИНИМУМ(ВТ.ДатаНачала),
	|	МАКСИМУМ(ВТ.ДатаОкончания)
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ1
	|		ПО ВТ.Сотрудник = ВТ1.Сотрудник
	|			И ВТ.НомерБланка = ВТ1.НомерБланка
	|			И ВТ.НомерПроката = ВТ1.НомерПроката
	|			И ВТ.НомерПриложения = ВТ1.НомерПриложения
	|			И ВТ.ДатаРасхода = ВТ1.ДатаРасхода
	|			И ВТ.РабочийЦентр = ВТ1.РабочийЦентр
	|			И (НЕ ВТ1.НастроечныйМатериал)
	|ГДЕ
	|	ВТ.НастроечныйМатериал
	|	И ВТ1.Сотрудник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Сотрудник,
	|	ВТ.НомерБланка,
	|	ВТ.НомерПриложения,
	|	ВТ.ДатаРасхода,
	|	ВТ.РабочийЦентр,
	|	ВТ.НомерПроката,
	|	ВТ.ВидРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасход.Нарезка КАК Нарезка,
	|	ВТРасход.Сотрудник КАК Сотрудник,
	|	ВТРасход.Сотрудник2 КАК Сотрудник2,
	|	ВТРасход.НомерБланка КАК НомерБланка,
	|	ВТРасход.НомерПриложения КАК НомерПриложения,
	|	МИНИМУМ(ВТРасход.ДатаРасхода) КАК ДатаРасхода,
	|	СУММА(ВТРасход.Количество) КАК Количество,
	|	СУММА(ВТРасход.КоличествоПМ) КАК КоличествоПМ,
	|	ВТРасход.РабочийЦентр КАК РабочийЦентр,
	|	ВТРасход.НомерПроката КАК НомерПроката,
	|	ВТРасход.ВидРабот КАК ВидРабот,
	|	МИНИМУМ(ВТРасход.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ВТРасход.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРасходСгруппирован
	|ИЗ
	|	ВТРасход КАК ВТРасход
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасход.Нарезка,
	|	ВТРасход.Сотрудник,
	|	ВТРасход.Сотрудник2,
	|	ВТРасход.НомерБланка,
	|	ВТРасход.НомерПриложения,
	|	ВТРасход.РабочийЦентр,
	|	ВТРасход.НомерПроката,
	|	ВТРасход.ВидРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(Лико_БланкЭтапаВыпуск.Ссылка.Дата, ДЕНЬ)) КАК ДатаПроизводства,
	|	Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр КАК РабочийЦентр,
	|	Лико_БланкЭтапаВыпуск.Ссылка.Сотрудник КАК Сотрудник,
	|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката КАК НомерПроката,
	|	Лико_БланкЭтапаВыпуск.Ссылка.НомерБланка КАК НомерБланка,
	|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПриложения КАК НомерПриложения,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Лико_БланкЭтапаВыпуск.Ссылка.МестоВалидации = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.Печать)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Валидация,
	|	СУММА(Лико_БланкЭтапаВыпуск.Количество) КАК КоличествоПМ,
	|	СУММА(Лико_БланкЭтапаВыпуск.КоличествоУУ) КАК Количество,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|					ТОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ШтКВМ * Лико_БланкЭтапаВыпуск.КоличествоУУ / 1000
	|				КОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|					ТОГДА Лико_БланкЭтапаВыпуск.Количество
	|				КОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|					ТОГДА Лико_БланкЭтапаВыпуск.КоличествоУУ
	|			КОНЕЦ КАК ЧИСЛО(15, 4))) КАК КоличествоВыпуск
	|ПОМЕСТИТЬ ВТВыпуск
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|		ПО Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя = Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	|			И Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката = Лико_БланкЭтапаТовары.Ссылка.НомерПроката
	|			И Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр = Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр
	|			И Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры = Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры,
	|	Справочник.Лико_ПредопределенныеЗначения КАК ТысШт,
	|	Справочник.Лико_ПредопределенныеЗначения КАК ПМ,
	|	Справочник.Лико_ПредопределенныеЗначения КАК КВМ
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка.Проведен
	|	И Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя = &Заказ
	|	И Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката В(&МассивПрокатов)
	|	И ТысШт.ИмяПредопределенныхДанных = ""ЕИТысШт""
	|	И ПМ.ИмяПредопределенныхДанных = ""ЕИПогМетр""
	|	И КВМ.ИмяПредопределенныхДанных = ""ЕИКвадрМетр""
	|	И Лико_БланкЭтапаТовары.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр,
	|	Лико_БланкЭтапаВыпуск.Ссылка.Сотрудник,
	|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката,
	|	Лико_БланкЭтапаВыпуск.Ссылка.НомерБланка,
	|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПриложения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ_Учтено.Сотрудник КАК Сотрудник,
	|	ТЗ_Учтено.РабочийЦентр КАК РабочийЦентр,
	|	ТЗ_Учтено.НомерБланка КАК НомерБланка,
	|	ТЗ_Учтено.НомерПроката КАК НомерПроката,
	|	ТЗ_Учтено.Дата КАК Дата
	|ПОМЕСТИТЬ ВТУчтено
	|ИЗ
	|	&ТЗ_Учтено КАК ТЗ_Учтено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сотрудник КАК Сотрудник,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	ВТ.НомерБланка КАК НомерБланка,
	|	ВТ.НомерПриложения КАК НомерПриложения,
	|	СУММА(ВТ.Количество) КАК КоличествоКликов,
	|	ВТ.РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТКликов
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.CLICKS)
	|	И ВТ.НомерПроката В(&МассивПрокатов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Сотрудник,
	|	ВТ.НомерПроката,
	|	ВТ.НомерБланка,
	|	ВТ.НомерПриложения,
	|	ВТ.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасходСгруппирован.НомерБланка КАК НомерБланка,
	|	МАКСИМУМ(Лико_ЭтапыЗаказа.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатаПередачиНаЭтапПечать
	|ИЗ
	|	ВТРасходСгруппирован КАК ВТРасходСгруппирован
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
	|		ПО ВТРасходСгруппирован.НомерБланка = Лико_ЭтапыЗаказа.НомерБланка
	|			И (Лико_ЭтапыЗаказа.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.Печать))
	|ГДЕ
	|	ВТРасходСгруппирован.НомерПроката = 1
	|	И Лико_ЭтапыЗаказа.Заказ = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасходСгруппирован.НомерБланка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо КАК Оператор,
	|	ВТРасходСгруппирован.НомерБланка КАК НомерБланка,
	|	ВТРасходСгруппирован.НомерПроката КАК НомерПроката,
	|	МАКСИМУМ(Лико_КартаСнятия.Ссылка) КАК КартаСнятия,
	|	МАКСИМУМ(Лико_КартаПерерасхода.Ссылка) КАК КартаПерерасхода,
	|	МАКСИМУМ(Лико_КартаПерерасходаПриПечати.Ссылка) КАК КартаПерерасходаПриПечати
	|ПОМЕСТИТЬ ВТКартыСнятияПерерасхода
	|ИЗ
	|	ВТРасходСгруппирован КАК ВТРасходСгруппирован
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчтено КАК ВТУчтено
	|		ПО ВТРасходСгруппирован.Сотрудник = ВТУчтено.Сотрудник
	|			И ВТРасходСгруппирован.РабочийЦентр = ВТУчтено.РабочийЦентр
	|			И ВТРасходСгруппирован.НомерПроката = ВТУчтено.НомерПроката
	|			И ВТРасходСгруппирован.НомерБланка = ВТУчтено.НомерБланка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_КартаСнятия КАК Лико_КартаСнятия
	|		ПО ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо = Лико_КартаСнятия.Оператор
	|			И ВТРасходСгруппирован.НомерБланка = Лико_КартаСнятия.НомерБланка
	|			И (Лико_КартаСнятия.Заказ = &Заказ)
	|			И (Лико_КартаСнятия.Проведен)
	|			И (НЕ Лико_КартаСнятия.ПометкаУдаления)
	|			И ВТРасходСгруппирован.НомерПроката = Лико_КартаСнятия.НомерПроката
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_КартаПерерасхода КАК Лико_КартаПерерасхода
	|		ПО ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо = Лико_КартаПерерасхода.Оператор
	|			И ВТРасходСгруппирован.НомерБланка = Лико_КартаПерерасхода.НомерБланка
	|			И ВТРасходСгруппирован.НомерПроката = Лико_КартаПерерасхода.НомерПроката
	|			И (Лико_КартаПерерасхода.Заказ = &Заказ)
	|			И (Лико_КартаПерерасхода.Проведен)
	|			И (НЕ Лико_КартаПерерасхода.ПометкаУдаления)
	|			И (Лико_КартаПерерасхода.Состояние = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияДокументаКартаПерерасхода.Подтвержден))
	|			И (Лико_КартаПерерасхода.Статус = ЗНАЧЕНИЕ(Перечисление.ТССтатусыЗаказов.Настройка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_КартаПерерасхода КАК Лико_КартаПерерасходаПриПечати
	|		ПО ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо = Лико_КартаПерерасходаПриПечати.Оператор
	|			И ВТРасходСгруппирован.НомерБланка = Лико_КартаПерерасходаПриПечати.НомерБланка
	|			И ВТРасходСгруппирован.НомерПроката = Лико_КартаПерерасходаПриПечати.НомерПроката
	|			И (Лико_КартаПерерасходаПриПечати.Заказ = &Заказ)
	|			И (Лико_КартаПерерасходаПриПечати.Проведен)
	|			И (НЕ Лико_КартаПерерасходаПриПечати.ПометкаУдаления)
	|			И (Лико_КартаПерерасходаПриПечати.Состояние = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияДокументаКартаПерерасхода.Подтвержден))
	|			И (Лико_КартаПерерасходаПриПечати.Статус = ЗНАЧЕНИЕ(Перечисление.ТССтатусыЗаказов.Печать))
	|ГДЕ
	|	ВТУчтено.Сотрудник ЕСТЬ NULL
	|	И (ВТРасходСгруппирован.ВидРабот = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПустаяСсылка)
	|			ИЛИ ВТРасходСгруппирован.ВидРабот = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо,
	|	ВТРасходСгруппирован.НомерБланка,
	|	ВТРасходСгруппирован.НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.НомерПроката КАК НомерПроката,
	|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.НомерБланка КАК НомерБланка,
	|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Оператор КАК Оператор
	|ИЗ
	|	Документ.Лико_ДвиженияЗаказаПоЭтапам.ФактыНастройки КАК Лико_ДвиженияЗаказаПоЭтапамФактыНастройки
	|ГДЕ
	|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Ссылка.ЗаказКлиента = &Заказ
	|	И Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Ссылка.Проведен
	|	И Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.НомерПроката В(&МассивПрокатов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.НомерПроката,
	|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.НомерБланка,
	|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Оператор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасходСгруппирован.ДатаРасхода КАК Дата,
	|	ВТРасходСгруппирован.Сотрудник КАК Сотрудник,
	|	ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо КАК Оператор,
	|	МАКСИМУМ(ВТРасходСгруппирован.Сотрудник2) КАК Сотрудник2,
	|	ВТРасходСгруппирован.РабочийЦентр КАК РабочийЦентр,
	|	ВТРасходСгруппирован.РабочийЦентр.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ВТРасходСгруппирован.НомерБланка КАК НомерБланка,
	|	ВТРасходСгруппирован.НомерПриложения КАК НомерПриложения,
	|	МАКСИМУМ(ВТРасходСгруппирован.Нарезка) КАК Нарезка,
	|	СУММА(ВТРасходСгруппирован.Количество) КАК Количество,
	|	СУММА(ВТРасходСгруппирован.КоличествоПМ) КАК КоличествоПМ,
	|	СУММА(ВТВыпуск.КоличествоПМ) КАК КоличествоВыпускПМ,
	|	СУММА(ВТВыпуск.Количество) КАК КоличествоВыпускКВМ,
	|	СУММА(ВТКликов.КоличествоКликов) КАК КоличествоКликов,
	|	ВТРасходСгруппирован.НомерПроката КАК НомерПроката,
	|	СУММА(ВТВыпуск.КоличествоВыпуск) КАК ЭтикетокНапечатано,
	|	МАКСИМУМ(ВТВыпуск.Валидация) КАК Валидация,
	|	МАКСИМУМ(ВТКартыСнятияПерерасхода.КартаСнятия) КАК КартаСнятия,
	|	МАКСИМУМ(ЕСТЬNULL(ВТКартыСнятияПерерасхода.КартаСнятия.Дата, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаКартыСнятия,
	|	МАКСИМУМ(ВТКартыСнятияПерерасхода.КартаСнятия.ВидСнятия) КАК ВидСнятия,
	|	МАКСИМУМ(ВТКартыСнятияПерерасхода.КартаПерерасхода) КАК КартаПерерасхода,
	|	МАКСИМУМ(ВТКартыСнятияПерерасхода.КартаПерерасходаПриПечати) КАК КартаПерерасходаПриПечати,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ДатаПередачиНаЭтапПечать.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаПередачиНаЭтапПечать,
	|	МИНИМУМ(ВТРасходСгруппирован.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ВТРасходСгруппирован.ДатаОкончания) КАК ДатаОкончания
	|ИЗ
	|	ВТРасходСгруппирован КАК ВТРасходСгруппирован
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыпуск КАК ВТВыпуск
	|		ПО ВТРасходСгруппирован.Сотрудник = ВТВыпуск.Сотрудник
	|			И ВТРасходСгруппирован.РабочийЦентр = ВТВыпуск.РабочийЦентр
	|			И ВТРасходСгруппирован.НомерПроката = ВТВыпуск.НомерПроката
	|			И ВТРасходСгруппирован.НомерБланка = ВТВыпуск.НомерБланка
	|			И ВТРасходСгруппирован.НомерПриложения = ВТВыпуск.НомерПриложения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчтено КАК ВТУчтено
	|		ПО ВТРасходСгруппирован.Сотрудник = ВТУчтено.Сотрудник
	|			И ВТРасходСгруппирован.РабочийЦентр = ВТУчтено.РабочийЦентр
	|			И ВТРасходСгруппирован.НомерПроката = ВТУчтено.НомерПроката
	|			И ВТРасходСгруппирован.НомерБланка = ВТУчтено.НомерБланка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКликов КАК ВТКликов
	|		ПО ВТРасходСгруппирован.Сотрудник = ВТКликов.Сотрудник
	|			И ВТРасходСгруппирован.НомерПроката = ВТКликов.НомерПроката
	|			И ВТРасходСгруппирован.НомерБланка = ВТКликов.НомерБланка
	|			И ВТРасходСгруппирован.НомерПриложения = ВТКликов.НомерПриложения
	|			И ВТРасходСгруппирован.РабочийЦентр = ВТКликов.РабочийЦентр
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКартыСнятияПерерасхода КАК ВТКартыСнятияПерерасхода
	|		ПО ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо = ВТКартыСнятияПерерасхода.Оператор
	|			И ВТРасходСгруппирован.НомерБланка = ВТКартыСнятияПерерасхода.НомерБланка
	|			И ВТРасходСгруппирован.НомерПроката = ВТКартыСнятияПерерасхода.НомерПроката
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаПередачиНаЭтапПечать КАК ВТ_ДатаПередачиНаЭтапПечать
	|		ПО ВТРасходСгруппирован.НомерБланка = ВТ_ДатаПередачиНаЭтапПечать.НомерБланка
	|			И (ВТРасходСгруппирован.НомерПроката = 1)
	|ГДЕ
	|	ВТУчтено.Сотрудник ЕСТЬ NULL
	|	И (ВТРасходСгруппирован.ВидРабот = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПустаяСсылка)
	|			ИЛИ ВТРасходСгруппирован.ВидРабот = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасходСгруппирован.ДатаРасхода,
	|	ВТРасходСгруппирован.Сотрудник,
	|	ВТРасходСгруппирован.РабочийЦентр,
	|	ВТРасходСгруппирован.НомерБланка,
	|	ВТРасходСгруппирован.НомерПриложения,
	|	ВТРасходСгруппирован.НомерПроката,
	|	ВТРасходСгруппирован.РабочийЦентр.ВидРабочегоЦентра,
	|	ВТРасходСгруппирован.Сотрудник.ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПроката,
	|	НомерБланка,
	|	НомерПриложения,
	|	Дата,
	|	ВТРасходСгруппирован.Сотрудник.Наименование
	|ИТОГИ ПО
	|	НомерПроката";
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	Запрос.УстановитьПараметр("МассивПрокатов", МассивПрокатов);
	ТЗ_Учтено = Производство.Выгрузить();
	ТЗ_Учтено.Очистить();
	Для каждого ТекСтрока из Производство Цикл
		Если МассивПрокатов.Найти(ТекСтрока.НомерПроката) <> Неопределено Тогда 
			НоваяСтрокаУчтено = ТЗ_Учтено.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаУчтено, ТекСтрока); 
			Если ЗначениеЗаполнено(НоваяСтрокаУчтено.СотрудникПоБланку) Тогда
				НоваяСтрокаУчтено.Сотрудник = НоваяСтрокаУчтено.СотрудникПоБланку;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ТЗ_Учтено", ТЗ_Учтено);

	ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК.ЗначениеПараметра;
	
	ЭтоПробник = ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник;
	ЭтоЛинкс = Площадка = Справочники.Лико_Площадки.Линкс;
	ДатаПереходаНоНовуюСхемуЗаполненияПроизводстваЛинкс = Справочники.Лико_ПредопределенныеЗначения.ДатаПереходаНоНовуюСхемуЗаполненияПроизводстваЛинкс.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(ДатаПереходаНоНовуюСхемуЗаполненияПроизводстваЛинкс) Тогда
		ДатаПереходаНоНовуюСхемуЗаполненияПроизводстваЛинкс = Дата('00010101');
	КонецЕсли;
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	// --> Начало Лико Ефимов ЕВВ 08.12.2025
	// Сделаем соответствие настроек для переходного периода. Если соответствие пустое, то заполним по-старому, а если соответствие не пустое, то заполним из него
	//ВыборкаНастроек = МассивРезультатовЗапроса[МассивРезультатовЗапроса.Количество()-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//СоответствиеНастроек = Новый Соответствие;
	//Пока ВыборкаНастроек.Следующий() Цикл
	//	ВыборкаНастроекДетЗап = ВыборкаНастроек.Выбрать();
	//	СоответствиеНастроекТекПрокат = Новый Соответствие;
	//	Пока ВыборкаНастроекДетЗап.Следующий() Цикл
	//		СоответствиеНастроекТекПрокат.Вставить(ВыборкаНастроекДетЗап.НомерБланка, Истина);
	//	КонецЦикла;
	//	СоответствиеНастроек.Вставить(ВыборкаНастроек.НомерПроката, СоответствиеНастроекТекПрокат);
	//КонецЦикла; 
	ТаблицаНастроек = МассивРезультатовЗапроса[МассивРезультатовЗапроса.Количество()-2].Выгрузить();
	// <-- Конец Лико Ефимов ЕВВ 08.12.2025
	
	ВыборкаНомерПроката = МассивРезультатовЗапроса[МассивРезультатовЗапроса.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНомерПроката.Следующий() Цикл

		// Нужно заполнять засчитанные этикетки в том случае, если сейчас заполняют последний прокат.
		// Чтобы определить, последний ли это прокат, поищем НомерПроката+1 в цветах и работах. Если найдем, значит прокат не последний
		НужноЗаполнятьЗасчитанныеЭтикетки = Ложь;
		НайденныеСтрокиПоТекущемуПрокату = Цвета.НайтиСтроки(Новый Структура("НомерПроката", ВыборкаНомерПроката.НомерПроката));
		ТекРЦ = Неопределено;
		Для каждого ТекСтрокаЦвета из НайденныеСтрокиПоТекущемуПрокату Цикл
			Если ЗначениеЗаполнено(ТекСтрокаЦвета.РабочийЦентр) Тогда
				ТекРЦ = ТекСтрокаЦвета.РабочийЦентр;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ТекРцСклейкаТермоусадки = ЗначениеЗаполнено(ТекРЦ) И ТекРЦ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки;
		ТекРЦОмега18 = ЗначениеЗаполнено(ТекРЦ) И ТекРЦ.ПорядковыйНомер = 18;
		
		Если ЗначениеЗаполнено(ТекРЦ) И ТекРЦ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Comexi Тогда
			// Суп задача № 4324
			// Для комекси считаем по выпуску самой комекси 
			НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
			СоответствиеБланковИЗасчЭт = СформироватьСоответствиеЗасчитанныхЭтикетокПоВыпускуТекущегоПроката(ВыборкаНомерПроката.НомерПроката);
		Иначе
			Если ЗначениеЗаполнено(ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК) И ТекущаяДата() >= ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК Тогда
				СтруктураПоиска = Новый Структура("НомерПроката", ВыборкаНомерПроката.НомерПроката+1);
				Если Цвета.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
					НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
				КонецЕсли;
			КонецЕсли;
			Если НужноЗаполнятьЗасчитанныеЭтикетки Тогда
				СоответствиеБланковИЗасчЭт = Лико_Дополнительно.ПолучитьКоличествоЗасчитанныхЭтикетокПоЗаказу(Ссылка);
			Иначе
				// Суп задача № 3378
				// Это не последний прокат, поэтому засчитанные этикетки будем искать в зависимости от типа заказа
				Если ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка
					ИЛИ ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Упаковка Тогда
					// Тоже по ВК
					НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
					СоответствиеБланковИЗасчЭт = Лико_Дополнительно.ПолучитьКоличествоЗасчитанныхЭтикетокПоЗаказу(Ссылка);
				ИначеЕсли ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка
					ИЛИ ТипЗаказа = Перечисления.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка Тогда
					НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
					СоответствиеБланковИЗасчЭт = СформироватьСоответствиеЗасчитанныхЭтикетокПоПотреблениюСледующегоПроката(ВыборкаНомерПроката.НомерПроката);
					Если НЕ ЗначениеЗаполнено(СоответствиеБланковИЗасчЭт) И ТекРцСклейкаТермоусадки Тогда
						// После склейки не было потреблений, попробуем заполнить по поперечной резке
						ВСледующемПрокатеПоперечнаяРезка = Ложь;
						НайденныеСтроки = Цвета.НайтиСтроки(Новый Структура("НомерПроката", ВыборкаНомерПроката.НомерПроката+1));
						Для каждого Строка из НайденныеСтроки Цикл
							Если Строка.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПоперечнаяРезка Тогда
								ВСледующемПрокатеПоперечнаяРезка = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если ВСледующемПрокатеПоперечнаяРезка Тогда
							СоответствиеБланковИЗасчЭт = СформироватьСоответствиеЗасчитанныхЭтикетокПоПередачеСПоперечнойРезкиНаВК();
						Иначе
							НужноЗаполнятьЗасчитанныеЭтикетки = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//СоответствиеНастроекТекПрокат = СоответствиеНастроек.Получить(ВыборкаНомерПроката.НомерПроката);
		ТаблицаНастроекТекПрокат = ТаблицаНастроек.Скопировать(Новый Структура("НомерПроката", ВыборкаНомерПроката.НомерПроката));
		ТаблицаНастроекТекПрокатЗаполнена = ТаблицаНастроекТекПрокат.Количество() > 0;
		БылаНастройка = Ложь;  
		ЗаполнитьДополнительнуюНастройку = Ложь; 
		Если ТолькоНовые Тогда
			Для каждого Строка из Запрос.Параметры.ТЗ_Учтено Цикл
				Если Строка.НомерПроката = ВыборкаНомерПроката.НомерПроката
					И Строка.КоличествоНастроек <> 0 Тогда
					БылаНастройка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Выборка = ВыборкаНомерПроката.Выбрать();

		Пока Выборка.Следующий() Цикл
			стрпп = Производство.Добавить();
			Если Выборка.НомерПроката = 1 Тогда 
				Если ЗначениеЗаполнено(Выборка.количествоКликов) Тогда 
					стрпп.ВсегоКликов = Выборка.КоличествоКликов;
				КонецЕсли;
				стрпп.Сотрудник2 = Выборка.Сотрудник2;
			КонецЕсли;       
			заполнитьЗначенияСвойств(стрпп, Выборка,, "Сотрудник2");
			// --> Начало Лико Ефимов ЕВВ 15.01.2026
			Если ЭтоПробник И ЗначениеЗаполнено(Выборка.ДатаНачала) И ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
				стрпп.ВремяВыполнения = (Выборка.ДатаОкончания - Выборка.ДатаНачала) / 60 / 60;
			КонецЕсли;
			// <-- Конец Лико Ефимов ЕВВ 15.01.2026
			Если ЗначениеЗаполнено(Выборка.КартаСнятия) Тогда
				стрпп.КартаСнятияНомер = Выборка.КартаСнятия.Номер;
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.КартаПерерасхода) Тогда
				стрпп.КартаПерерасходаНомер = Выборка.КартаПерерасхода.Номер;
				стрпп.ПодтвержденныйПерерасход = Выборка.КартаПерерасхода.КоличествоПодтверждено;
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.КартаПерерасходаПриПечати) Тогда
				стрпп.КартаПерерасходаПриПечатиНомер = Выборка.КартаПерерасходаПриПечати.Номер;
				стрпп.ПодтвержденныйПерерасход = стрпп.ПодтвержденныйПерерасход + Выборка.КартаПерерасходаПриПечати.КоличествоПодтверждено;
			КонецЕсли;
			// --> Начало Лико Ефимов ЕВВ 08.12.2025
			Если ТаблицаНастроекТекПрокатЗаполнена Тогда 
				// Заполняем настройку из Документы.Лико_ДвиженияЗаказаПоЭтапам.ФактыНастройки
				ОператорЗаполнен = Истина;
				Для каждого ТекСтрокаТаблНастроекТекПрокат из ТаблицаНастроекТекПрокат Цикл
					Если НЕ ЗначениеЗаполнено(ТекСтрокаТаблНастроекТекПрокат.Оператор) Тогда
						ОператорЗаполнен = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ОператорЗаполнен Тогда
					МассивСтрокТаблНастроек = ТаблицаНастроекТекПрокат.НайтиСтроки(Новый Структура("НомерБланка,Оператор", Выборка.НомерБланка, Выборка.Оператор));
				Иначе
					МассивСтрокТаблНастроек = ТаблицаНастроекТекПрокат.НайтиСтроки(Новый Структура("НомерБланка", Выборка.НомерБланка));
				КонецЕсли;
				
				Если МассивСтрокТаблНастроек.Количество() <> 0 Тогда
					// По данному бланку зафиксирована настройка
					Стрпп.КоличествоНастроек = 1; 
					// Далее код Сергея Яцуна из старой ветки, который снимет настройку в том случае, если была карта снятия с определенными условиями
					Если ЗначениеЗаполнено(Выборка.ВидСнятия) И (Выборка.ВидСнятия = Перечисления.Лико_ВидыСнятия.ВинаПечатника ИЛИ Выборка.ВидСнятия = Перечисления.Лико_ВидыСнятия.НетВиныПечатника И НЕ ЗначениеЗаполнено(Выборка.КоличествоВыпускПМ)) Тогда
						Стрпп.КоличествоНастроек = 0;
					КонецЕсли; 
					Для каждого ТекСтрокаКУдалению из МассивСтрокТаблНастроек Цикл
						ТаблицаНастроекТекПрокат.Удалить(ТекСтрокаКУдалению);
					КонецЦикла;
				КонецЕсли;
			Иначе 
				// Заполняем по-старому		
			// <-- Конец Лико Ефимов ЕВВ 08.12.2025
				Если НЕ БылаНастройка ИЛИ ЗаполнитьДополнительнуюНастройку Тогда
					Стрпп.КоличествоНастроек = 1;
					БылаНастройка = Истина;
					// <-- Начало Лико Яцун С. В. 28.04.2025 
					Если Площадка = Справочники.Лико_Площадки.Ликофлекс ИЛИ Площадка = Справочники.Лико_Площадки.Линкс ИЛИ Площадка = Справочники.Лико_Площадки.ИксПак Тогда
						ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода.ЗначениеПараметра;
						Если ЗначениеЗаполнено(ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода) И ТекущаяДата() >= ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода Тогда
							Если ЗаполнитьДополнительнуюНастройку Тогда
								ЗаполнитьДополнительнуюНастройку = Ложь;
								ЭтоДополнительнаяНастройка = Истина;
							Иначе
								ЭтоДополнительнаяНастройка = Ложь;
							КонецЕсли;
							Если ЗначениеЗаполнено(Выборка.ВидСнятия) И (Выборка.ВидСнятия = Перечисления.Лико_ВидыСнятия.ВинаПечатника ИЛИ Выборка.ВидСнятия = Перечисления.Лико_ВидыСнятия.НетВиныПечатника И НЕ ЗначениеЗаполнено(Выборка.КоличествоВыпускПМ)) Тогда
								Если ЭтоДополнительнаяНастройка Тогда
									Стрпп.КоличествоНастроек = 0;
									ЗаполнитьДополнительнуюНастройку = Истина;
								Иначе
									Стрпп.КоличествоНастроек = 0;
									БылаНастройка = Ложь;
								КонецЕсли;
							ИначеЕсли ЗначениеЗаполнено(Выборка.ВидСнятия) И Выборка.ВидСнятия = Перечисления.Лико_ВидыСнятия.НетВиныПечатника И ЗначениеЗаполнено(Выборка.КоличествоВыпускПМ) Тогда
								ЗаполнитьДополнительнуюНастройку = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					// <-- Конец Лико Яцун С. В. 28.04.2025
				КонецЕсли;
			КонецЕсли;
			стрпп.КлючСтроки =  Новый УникальныйИдентификатор;
			стрпп.НарезкаРазмер = ?(стрпп.КоличествоПМ = 0, 0, стрпп.Количество / стрпп.КоличествоПМ) * 1000;
			Если стрпп.НарезкаРазмер = 0 Тогда
				стрпп.НарезкаРазмер = Выборка.Нарезка.Размер;
			КонецЕсли;

			// --> Начало Лико Ефимов ЕВВ 07.07.2023
			Если НужноЗаполнятьЗасчитанныеЭтикетки Тогда
				ЗначениеСоответствияТекБланк = СоответствиеБланковИЗасчЭт.Получить(Выборка.НомерБланка);
				Если ЗначениеСоответствияТекБланк <> Неопределено Тогда
					Если ТипЗнч(ЗначениеСоответствияТекБланк) = Тип("Структура") И ЗначениеСоответствияТекБланк.ТипДанных = "ПогМетры" Тогда
						стрпп.ПогМетровЗасчитано = ЗначениеСоответствияТекБланк.Значение;
						Если стрпп.КоличествоПМ <> 0 И стрпп.Количество <> 0 Тогда
							стрпп.КвМетровЗасчитано = стрпп.ПогМетровЗасчитано * стрпп.НарезкаРазмер / 1000;
							стрпп.ЭтикетокЗасчитано = РассчитатьТиражНаСервере(стрпп.ПогМетровЗасчитано);
						КонецЕсли;
					ИначеЕсли ТипЗнч(ЗначениеСоответствияТекБланк) = Тип("Соответствие") Тогда 
						Если Выборка.НомерПриложения = 0 Тогда
							// Нужно просуммировать ??? ИЛИ НЕ НУЖНО ЭТО? пока решил оставить
							стрпп.ЭтикетокЗасчитано = 0;
							Для каждого ЭлементСоответствияТекПриложение из ЗначениеСоответствияТекБланк Цикл
								стрпп.ЭтикетокЗасчитано = стрпп.ЭтикетокЗасчитано + ЭлементСоответствияТекПриложение.Значение;
							КонецЦикла;
						Иначе
							// Нужно найти свое приложение
							ЗначениеСоответствияТекПриложение = ЗначениеСоответствияТекБланк.Получить(Выборка.НомерПриложения);
							Если ЗначениеСоответствияТекПриложение <> Неопределено Тогда
								стрпп.ЭтикетокЗасчитано = ЗначениеСоответствияТекПриложение;
								ЗначениеСоответствияТекБланк.Удалить(Выборка.НомерПриложения);
							КонецЕсли;
						КонецЕсли;
						Если стрпп.КоличествоПМ <> 0 И стрпп.Количество <> 0 И стрпп.ЭтикетокЗасчитано <> 0 Тогда
							стрпп.ПогМетровЗасчитано = РассчитатьМетражНаСервере(стрпп.ЭтикетокЗасчитано * 1000, Выборка.ВидРабочегоЦентра);
							стрпп.КвМетровЗасчитано = стрпп.ПогМетровЗасчитано * стрпп.НарезкаРазмер / 1000; 
						КонецЕсли;
					Иначе
						стрпп.ЭтикетокЗасчитано = ЗначениеСоответствияТекБланк;
						Если стрпп.КоличествоПМ <> 0 И стрпп.Количество <> 0 И стрпп.ЭтикетокЗасчитано <> 0 Тогда
							стрпп.ПогМетровЗасчитано = РассчитатьМетражНаСервере(стрпп.ЭтикетокЗасчитано * 1000, Выборка.ВидРабочегоЦентра);
							стрпп.КвМетровЗасчитано = стрпп.ПогМетровЗасчитано * стрпп.НарезкаРазмер / 1000; 
						КонецЕсли;
					КонецЕсли;
					Если Выборка.НомерПриложения = 0 Тогда // Если номер приложения не равен 0, то строки уже удалились выше по номеру приложения
						// Удалим из соответствия, чтобы данные не попали в другие строки по этому же номеру бланка
						СоответствиеБланковИЗасчЭт.Удалить(Выборка.НомерБланка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// <-- Конец Лико Ефимов ЕВВ 07.07.2023
		КонецЦикла;
		
		// --> Начало Лико Ефимов ЕВВ 10.12.2025
		// Нужно обработать строки с расходом материала, но без выпуска
		Производство.Сортировать("НомерПроката,НомерБланка,НомерСтроки,Дата,Сотрудник"); // На всякий случай отсортируем, вдруг заполняют только новые. Номер строки в середине, чтобы старые записи были выше новых
		Для каждого Строка из Производство Цикл
			Если Строка.НомерПроката <> ВыборкаНомерПроката.НомерПроката Тогда
				// Нам нужен только текущий номер проката, пропустим эту строку
				Продолжить;
			КонецЕсли;
			Если НЕ ТекРцСклейкаТермоусадки
				И НЕ ТекРЦОмега18
				И НЕ ЗначениеЗаполнено(Строка.КартаСнятия) // Нет карты снятия
				И Строка.КоличествоПМ <> 0 // Есть расход
				И Строка.КоличествоНастроек = 0 // Нет настройки
				И Строка.ЭтикетокНапечатано = 0 // Нет выпуска
				Тогда
				// Не было карты снятия, был расход, не было настройки, но не было выпуска, поменяем сотрудника на сотрудника из следующего бланка
				
				// --> Начало Лико Ефимов ЕВВ 15.01.2026
				// Переделаю алгоритм, т.к. нужно искать не просто строку следующего бланка, а следующую строку с настройкой
				
				//Отбор = Новый Структура("НомерПроката,НомерБланка", Строка.НомерПроката, Строка.НомерБланка + 1);
				//СтрокиСледующегоБланка = Производство.НайтиСтроки(Отбор);
				//Если СтрокиСледующегоБланка.Количество() > 0 Тогда
				//	Если НЕ ЗначениеЗаполнено(Строка.СотрудникПоБланку) Тогда
				//		Строка.СотрудникПоБланку = Строка.Сотрудник; // Запоминаем сотрудника по бланку
				//	КонецЕсли;
				//	Строка.Сотрудник = СтрокиСледующегоБланка[0].Сотрудник; // Меняем сотрудника на сотрудника из следующего бланка
				//КонецЕсли; 
				
				СледующаяСтрокаСНастройкой = Неопределено;
				Для СчПоискаСлСтрокиСНастройкой = Производство.Индекс(Строка)+1 по Производство.Количество()-1 Цикл // Цикл со следующей строки до конца ТЧ
					ТекСтрокаПоиска = Производство[СчПоискаСлСтрокиСНастройкой];
					Если ТекСтрокаПоиска.НомерПроката <> ВыборкаНомерПроката.НомерПроката Тогда
						Продолжить;
					КонецЕсли;
					Если ТекСтрокаПоиска.КоличествоНастроек <> 0 Тогда
						СледующаяСтрокаСНастройкой = ТекСтрокаПоиска;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если СледующаяСтрокаСНастройкой <> Неопределено Тогда
					Если НЕ ЗначениеЗаполнено(Строка.СотрудникПоБланку) Тогда
						Строка.СотрудникПоБланку = Строка.Сотрудник; // Запоминаем сотрудника по бланку
					КонецЕсли;
					Строка.Сотрудник = СледующаяСтрокаСНастройкой.Сотрудник; // Меняем сотрудника на сотрудника из следующего бланка
					Строка.Сотрудник2 = СледующаяСтрокаСНастройкой.Сотрудник2; // Меняем сотрудника2 на сотрудника2 из следующего бланка
				КонецЕсли;
				// <-- Конец Лико Ефимов ЕВВ 15.01.2026
			КонецЕсли;	
		КонецЦикла;
       	// <-- Конец Лико Ефимов ЕВВ 10.12.2025
	КонецЦикла;
	
	// В конце попробуем заполнить поперечную резку
	НайденныеСтроки = Цвета.НайтиСтроки(Новый Структура("ВидСекции", Справочники.Лико_ВидыСекций.ПоперечнаяРезка));
	Если НайденныеСтроки.Количество() <> 0 И МассивПрокатов.Найти(НайденныеСтроки[0].НомерПроката) <> Неопределено И ЗначениеЗаполнено(Ссылка) Тогда
		ТекНомерПроката = НайденныеСтроки[0].НомерПроката;
		Если НЕ ТолькоНовые И Производство.НайтиСтроки(Новый Структура("НомерПроката", ТекНомерПроката)).Количество() > 0 Тогда
			// Данные уже заполнились выше, такого быть не должно, но на всякий случай проверили
			Возврат;
		КонецЕсли;
		
		КоличествоЭтикетокВРолике = 0;
		Для каждого Строка из Товары Цикл
			Если ЗначениеЗаполнено(Строка.КоличествоЭтикетокВРолике) Тогда
				КоличествоЭтикетокВРолике = Строка.КоличествоЭтикетокВРолике;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(КоличествоЭтикетокВРолике) Тогда
			Возврат;
		КонецЕсли;
		
		СоответствиеБланковИЗасчЭт = Лико_Дополнительно.ПолучитьКоличествоЗасчитанныхЭтикетокПоЗаказу(Ссылка);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЭтапыЗаказа.Период КАК Период,
		|	Лико_ЭтапыЗаказа.Заказ КАК Заказ,
		|	Лико_ЭтапыЗаказа.НомерБланка КАК НомерБланка,
		|	Лико_ЭтапыЗаказа.РабочийЦентр КАК РабочийЦентр,
		|	Лико_ЭтапыЗаказа.Ответственный КАК Ответственный,
		|	Лико_ЭтапыЗаказа.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
		|ГДЕ
		|	Лико_ЭтапыЗаказа.Заказ = &Заказ
		|	И Лико_ЭтапыЗаказа.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.ПоперечнаяРезка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лико_ЭтапыЗаказа.НомерБланка,
		|	Лико_ЭтапыЗаказа.Период";

		Запрос.УстановитьПараметр("Заказ", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекНомерПриложения = Неопределено;
			ТекПозицияПриложения = СтрНайти(Выборка.Комментарий, "прил. ", НаправлениеПоиска.СКонца);
			Если ТекПозицияПриложения <> 0 Тогда
				Попытка
					ТекНомерПриложения = Число(Сред(Выборка.Комментарий, ТекПозицияПриложения + 6, 1));
				Исключение
					Возврат;
				КонецПопытки;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекНомерПриложения) Тогда
				Возврат;
			КонецЕсли;
			ТекСотрудник = Лико_Дополнительно.ПолучитьСотрудникаПоФизЛицу(Выборка.Ответственный, Площадка);
			Если НЕ ЗначениеЗаполнено(ТекСотрудник) Тогда
				Возврат;
			КонецЕсли;
			
			// Проверим, нет ли такой строки в производстве. Если есть, то пропустим
			НайденныеСтроки = Производство.НайтиСтроки(Новый Структура("Сотрудник,НомерБланка,НомерПроката", ТекСотрудник, Выборка.НомерБланка, ТекНомерПроката));
			Если НайденныеСтроки.Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			стрпп = Производство.Добавить();
			стрпп.КлючСтроки =  Новый УникальныйИдентификатор;
			стрпп.Сотрудник = ТекСотрудник;
			стрпп.Дата = НачалоДня(Выборка.Период);
			стрпп.НомерБланка = Выборка.НомерБланка;
			стрпп.РабочийЦентр = Выборка.РабочийЦентр;
			стрпп.НомерПроката = ТекНомерПроката; 
			
			ЗначениеСоответствияТекБланк = СоответствиеБланковИЗасчЭт.Получить(Выборка.НомерБланка);
			Если ЗначениеСоответствияТекБланк <> Неопределено Тогда
				// Нужно найти свое приложение
				ЗначениеСоответствияТекПриложение = ЗначениеСоответствияТекБланк.Получить(ТекНомерПриложения);
				Если ЗначениеСоответствияТекПриложение <> Неопределено Тогда
					стрпп.ЭтикетокЗасчитано = ЗначениеСоответствияТекПриложение / КоличествоЭтикетокВРолике;
					ЗначениеСоответствияТекБланк.Удалить(ТекНомерПриложения);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		

КонецПроцедуры


Функция СформироватьСоответствиеЗасчитанныхЭтикетокПоВыпускуТекущегоПроката(ТекНомерПроката)

	СоответствиеБланковИЗасчЭт = Новый Соответствие; 

	ЗапросПМ = Новый Запрос;
	ЗапросПМ.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапа.НомерБланка КАК НомерБланка,
	|	Лико_БланкЭтапа.ЗаказПокупателя КАК ЗаказКлиента,
	|	СУММА(Лико_БланкЭтапаВыпуск.Количество) КАК Количество
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|		ПО Лико_БланкЭтапа.Ссылка = Лико_БланкЭтапаВыпуск.Ссылка
	|ГДЕ
	|	Лико_БланкЭтапа.Проведен
	|	И НЕ Лико_БланкЭтапа.ПометкаУдаления
	|	И Лико_БланкЭтапа.ЗаказПокупателя = &ЗаказКлиента
	|	И Лико_БланкЭтапа.НомерПроката = &НомерПроката
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапа.ЗаказПокупателя,
	|	Лико_БланкЭтапа.НомерБланка";
	
	ЗапросПМ.УстановитьПараметр("ЗаказКлиента", Ссылка);
	ЗапросПМ.УстановитьПараметр("НомерПроката", ТекНомерПроката);
	
	ВыборкаПМ = ЗапросПМ.Выполнить().Выбрать();
	Если ВыборкаПМ.Количество() > 0 Тогда
		Пока ВыборкаПМ.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПМ.Количество) Тогда
				ЗначениеСоответствия = Новый Структура;
				ЗначениеСоответствия.Вставить("ТипДанных", "ПогМетры");
				ЗначениеСоответствия.Вставить("Значение", ВыборкаПМ.Количество);
				СоответствиеБланковИЗасчЭт.Вставить(ВыборкаПМ.НомерБланка, ЗначениеСоответствия);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Возврат СоответствиеБланковИЗасчЭт;
КонецФункции

Функция СформироватьСоответствиеЗасчитанныхЭтикетокПоПотреблениюСледующегоПроката(ТекНомерПроката)

	СоответствиеБланковИЗасчЭт = Новый Соответствие; 
	Если ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
		// Смотрим ПМ материала, закрытого на РЦ вида Термоусадка и делим на Количество ручьев печати из заказа (т.к. на печатной машине нарезка широкая, а на склейку приходит узкая)
		НужноДелитьНаРучьи = Истина;
	ИначеЕсли ТипЗаказа = Перечисления.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка Тогда
		// Чистые метры - это метры, потребленные следующей машиной
		НужноДелитьНаРучьи = Ложь;
	Иначе
		Возврат СоответствиеБланковИЗасчЭт;
	КонецЕсли;
	
	ЗапросПМ = Новый Запрос;
	ЗапросПМ.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапа.НомерБланка КАК НомерБланка,
	|	Лико_БланкЭтапа.ЗаказПокупателя КАК ЗаказКлиента,
	|	Лико_БланкЭтапа.ЗаказПокупателя.РучьиПечати КАК РучьиПечати,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК КоличествоРасход,
	|	МАКСИМУМ(Лико_БланкЭтапа.РабочийЦентр.ВидРабочегоЦентра) КАК ВидРабочегоЦентра
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|		ПО Лико_БланкЭтапа.Ссылка = Лико_БланкЭтапаТовары.Ссылка
	|			И (Лико_БланкЭтапаТовары.Списать)
	|			И (ВЫБОР
	|				КОГДА &ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Термоусадка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|			КОНЕЦ)
	|			И (Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал)
	|ГДЕ
	|	Лико_БланкЭтапа.Проведен
	|	И НЕ Лико_БланкЭтапа.ПометкаУдаления
	|	И Лико_БланкЭтапа.ЗаказПокупателя = &ЗаказКлиента
	|	И Лико_БланкЭтапа.НомерПроката = &НомерПроката
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапа.ЗаказПокупателя,
	|	Лико_БланкЭтапа.ЗаказПокупателя.РучьиПечати,
	|	Лико_БланкЭтапа.НомерБланка";
	
	ЗапросПМ.УстановитьПараметр("ТипЗаказа", ТипЗаказа);
	ЗапросПМ.УстановитьПараметр("ЗаказКлиента", Ссылка);
	ЗапросПМ.УстановитьПараметр("НомерПроката", ТекНомерПроката + 1);
	
	ВыборкаПМ = ЗапросПМ.Выполнить().Выбрать();
	Если ВыборкаПМ.Количество() > 0 Тогда
		Пока ВыборкаПМ.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПМ.КоличествоРасход) Тогда
				ЗначениеСоответствия = Новый Структура;
				ЗначениеСоответствия.Вставить("ТипДанных", "ПогМетры");
				ЗначениеСоответствия.Вставить("Значение", ВыборкаПМ.КоличествоРасход / ?(НужноДелитьНаРучьи И ВыборкаПМ.РучьиПечати <> 0 И ВыборкаПМ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки, ВыборкаПМ.РучьиПечати, 1));
				СоответствиеБланковИЗасчЭт.Вставить(ВыборкаПМ.НомерБланка, ЗначениеСоответствия);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Возврат СоответствиеБланковИЗасчЭт;
	
КонецФункции

Функция РассчитатьТиражНаСервере(ПогонныйМетраж, ВидРЦ = Неопределено) Экспорт
	
	ТекТираж = 0;
	
	Если ЕдиницаИзмеренияЗаказа = Справочники.Лико_ПредопределенныеЗначения.ЕИТысШт.ЗначениеПараметра Тогда 
		// --> Начало Лико Ефимов ЕВВ 09.04.2025
		Если ВидРЦ <> Неопределено И ВидРЦ = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки Тогда
			// На собрании по ТУ договорились, что для склейки пог.м. = КоличествоТысШт * ВысотаЭтикетки
			ТекТираж = ?(ДлинаЭтикетки = 0, 0, ПогонныйМетраж / ДлинаЭтикетки);	
		Иначе
		// <-- Конец Лико Ефимов ЕВВ 09.04.2025
			ТекТираж =  Лико_ТиражМетраж.РассчитатьТираж(ПогонныйМетраж, Нарезка, ШтКВМ);
		КонецЕсли;
	ИначеЕсли ЕдиницаИзмеренияЗаказа = Справочники.Лико_ПредопределенныеЗначения.ЕИПогМетр.ЗначениеПараметра Тогда
		ТекТираж =  ПогонныйМетраж;
	ИначеЕсли ЕдиницаИзмеренияЗаказа = Справочники.Лико_ПредопределенныеЗначения.ЕИКвадрМетр.ЗначениеПараметра Тогда
		ТекТираж =  ПогонныйМетраж*Нарезка.Размер / 1000;		
	КонецЕсли;
		
	Возврат ТекТираж;
	
КонецФункции 	

Функция РассчитатьМетражНаСервере(Количество, ВидРЦ = Неопределено) Экспорт
	
	Если ЕдиницаИзмеренияЗаказа = Справочники.Лико_ПредопределенныеЗначения.ЕИТысШт.ЗначениеПараметра Тогда
		// --> Начало Лико Ефимов ЕВВ 09.04.2025
		Если ВидРЦ <> Неопределено И ВидРЦ = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки Тогда
			// На собрании по ТУ договорились, что для склейки пог.м. = КоличествоТысШт * ВысотаЭтикетки
			ТекМетражПМ = Количество * ДлинаЭтикетки / 1000;	
		Иначе
		// <-- Конец Лико Ефимов ЕВВ 09.04.2025
			ТекМетражПМ = Лико_ТиражМетраж.РассчитатьМетраж(количество, Нарезка, ШтКВМ);
		КонецЕсли;
	ИначеЕсли ЕдиницаИзмеренияЗаказа = Справочники.Лико_ПредопределенныеЗначения.ЕИПогМетр.ЗначениеПараметра Тогда
		ТекМетражПМ = количество/1000;
	ИначеЕсли ЕдиницаИзмеренияЗаказа = Справочники.Лико_ПредопределенныеЗначения.ЕИКвадрМетр.ЗначениеПараметра Тогда
		ТекМетражПМ =  количество/Нарезка.Размер;		
	КонецЕсли;
	
	Возврат ТекМетражПМ;
	
КонецФункции	

Функция СформироватьСоответствиеЗасчитанныхЭтикетокПоПередачеСПоперечнойРезкиНаВК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЭтапыЗаказа.Заказ КАК Заказ,
		|	Лико_ЭтапыЗаказа.НомерБланка КАК НомерБланка,
		|	Лико_ЭтапыЗаказа.Комментарий КАК Комментарий,
		|	Лико_ЭтапыЗаказа.Количество КАК Количество,
		|	0 КАК НомерПриложения
		|ИЗ
		|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
		|ГДЕ
		|	Лико_ЭтапыЗаказа.Заказ = &Заказ
		|	И Лико_ЭтапыЗаказа.Этап = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.ПоперечнаяРезка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лико_ЭтапыЗаказа.НомерБланка,
		|	Лико_ЭтапыЗаказа.Период
		|ИТОГИ ПО
		|	НомерБланка";
	
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерБланка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеБланков = Новый Соответствие;
	
	Пока ВыборкаНомерБланка.Следующий() Цикл
		СоответствиеПриложений = Новый Соответствие;
		Выборка = ВыборкаНомерБланка.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекНомерПриложения = Неопределено;
			ТекПозицияПриложения = СтрНайти(Выборка.Комментарий, "прил. ", НаправлениеПоиска.СКонца);
			Если ТекПозицияПриложения <> 0 Тогда
				Попытка
					ТекНомерПриложения = Число(Сред(Выборка.Комментарий, ТекПозицияПриложения + 6, 1));
				Исключение
					ТекНомерПриложения = 0;
				КонецПопытки;
			КонецЕсли;
			ТекЗначениеСоответствия = СоответствиеПриложений.Получить(ТекНомерПриложения);
			Если ТекЗначениеСоответствия = Неопределено Тогда
				СоответствиеПриложений.Вставить(ТекНомерПриложения, Выборка.Количество); 
			Иначе
				СоответствиеПриложений.Вставить(ТекНомерПриложения, ТекЗначениеСоответствия + Выборка.Количество); 
			КонецЕсли;
		КонецЦикла;
		СоответствиеБланков.Вставить(ВыборкаНомерБланка.НомерБланка, СоответствиеПриложений);
	КонецЦикла;

	Возврат СоответствиеБланков;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
