#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение перечисления по имени значения.
//
// Параметры:
//  ИмяЗначения	- Строка - имя значения, как оно передается через API
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыТарифов - значение перечисления по имени.
//
Функция ЗначениеПоИмени(ИмяЗначения) Экспорт
	
	Если ИмяЗначения = "basic" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыТарифов.Основной");
	ИначеЕсли ИмяЗначения = "extension" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыТарифов.Расширение");
	ИначеЕсли ИмяЗначения = "upgrade" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыТарифов.Апгрейд");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.РолиПользователейАбонентов.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли