
&НаКлиенте
Процедура ОтправитьВСУП(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед отправкой нужно записать задачу");
		Возврат;
	КонецЕсли;
	
	ОтправитьВСУПНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВСУПНаСервере()

	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Сообщить("Передавать задачу в СУП разрешено только полным правам");
		Возврат;
	КонецЕсли;
	
	СервисСУП = Справочники.HTTPСервисы.SMP;
	НазваниеСервиса = СервисСУП.Наименование;
	Настройки = Справочники.HTTPConnections.Settings(СервисСУП);
	
	Если НЕ Настройки.Свойство("username") ИЛИ НЕ ЗначениеЗаполнено(Настройки.username) Тогда
		Сообщить("Не найден ""username"" для сервиса " + НазваниеСервиса);
		Возврат;
	КонецЕсли;
	Если НЕ Настройки.Свойство("password") ИЛИ НЕ ЗначениеЗаполнено(Настройки.password) Тогда
		Сообщить("Не найден ""password"" для сервиса " + НазваниеСервиса);
		Возврат;
	КонецЕсли;
	Если НЕ Настройки.Свойство("domain") ИЛИ НЕ ЗначениеЗаполнено(Настройки.domain) Тогда
		Сообщить("Не найден ""domain"" для сервиса " + НазваниеСервиса);
		Возврат;
	КонецЕсли;
	Если НЕ Настройки.Свойство("ApiEndPoint") ИЛИ НЕ ЗначениеЗаполнено(Настройки.ApiEndPoint) Тогда
		Сообщить("Не найден ""ApiEndPoint"" для сервиса " + НазваниеСервиса);
		Возврат;
	КонецЕсли;

	Структура = Новый Структура;
	Структура.Вставить("ProcName", "CreateTaskFromErp");
	Структура.Вставить("UnId", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Структура.Вставить("Дата", Строка(Объект.Дата));
	Структура.Вставить("Наименование", Объект.Наименование);
	Структура.Вставить("Автор", Строка(Объект.Автор));
	Структура.Вставить("АвторПочта", ПолучитьПочтуПользователя(Объект.Автор));
	Структура.Вставить("Цель", Объект.Цель);
	Структура.Вставить("ОписаниеПроцесса", Объект.ОписаниеПроцесса);
	Структура.Вставить("ТЗ", Объект.ТЗ);
	Структура.Вставить("Представление", Строка(Объект.Ссылка));
	
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализациииJSON); 	
	ТелоЗапроса = ЗаписьJSON.Закрыть();

	Попытка
		СоединениеHTTP = Новый HTTPСоединение(Настройки.domain,, Настройки.username, Настройки.password);
	Исключение
		Сообщить("");
		Возврат;
	КонецПопытки; 
	
	HTTPЗапрос = Новый HTTPЗапрос(Настройки.ApiEndPoint);

	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
  
	Попытка
		HTTPОтвет = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;	

	ЧтениеJSON = Новый ЧтениеJSON; 	
	ЧтениеJSON.УстановитьСтроку(Ответ);	
	Результат = ПрочитатьJSON(ЧтениеJSON,,,ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();

	Если Результат.Свойство("Сообщение") Тогда
		Сообщить("" + Результат.Сообщение); 
	Иначе
		Сообщить("Ошибка. Обратитесь к программистам");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПочтуПользователя(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПользователиКонтактнаяИнформация.Представление) КАК Представление
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|ГДЕ
		|	ПользователиКонтактнаяИнформация.Ссылка = &Пользователь
		|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
		|	И ПользователиКонтактнаяИнформация.Представление <> """"";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Представление;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции
