

&Вместо("ПолучитьМежэтикеточноеРасстояние")
Функция Лико_ПолучитьМежэтикеточноеРасстояние(Заказ, текВидВырубки, СпецификацияСсылка)
		Если текВидВырубки = 1 ИЛИ текВидВырубки = 13 Тогда
		Если Заказ.ДлинаПечати = 0 ИЛИ Заказ.ЭтикетокНаЛистеПечати = 0 ИЛИ Заказ.РучьиПечати = 0 Тогда
			Возврат 0;
		Иначе
			Возврат Заказ.ДлинаПечати / (Заказ.ЭтикетокНаЛистеПечати / Заказ.РучьиПечати);	
		КонецЕсли;
	ИначеЕсли текВидВырубки = 2 ИЛИ текВидВырубки = 3 ИЛИ текВидВырубки = 7 ИЛИ текВидВырубки = 8 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 11
		ИЛИ текВидВырубки = 12 ИЛИ текВидВырубки = 14 ИЛИ текВидВырубки = 15 Тогда
		Если Заказ.ШагПечати = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0 ИЛИ Заказ.Ручьи = 0 Тогда
			Возврат 0;
		Иначе		
			Возврат Заказ.ШагПечати / (Заказ.ЭтикетокНаЛисте / Заказ.Ручьи);
		КонецЕсли
	// <-- Начало Лико Яцун С. В. 13.06.2023	
	ИначеЕсли текВидВырубки = 16 ИЛИ текВидВырубки = 17 Тогда
		Возврат 0.4826 / Цел(0.4826/(Заказ.ШиринаЭтикетки / 1000 + 0.0027));	
	// <-- Конец Лико Яцун С. В. 13.06.2023
	ИначеЕсли текВидВырубки = 5 Тогда 
		Если ЭтоТермоусадка(Заказ, СпецификацияСсылка) Тогда
			Возврат Заказ.ДлинаЭтикетки * 0.001;
		Иначе 
			ДлинаИлиШирина = ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;
			Если Заказ.ДлинаПечати = 0 ИЛИ Цел(Заказ.ДлинаПечати / ДлинаИлиШирина) = 0 Тогда 
				Возврат 0;
			Иначе		
				Возврат Заказ.ДлинаПечати / Цел(Заказ.ДлинаПечати / ДлинаИлиШирина);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли текВидВырубки = 6 Тогда 
		Возврат ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;	
	КонецЕсли;
	
	Возврат 0;

КонецФункции

&Вместо("ОчиститьНеИспользуемыПараметрыШтампа")
Процедура Лико_ОчиститьНеИспользуемыПараметрыШтампа(Заказ, текВидВырубки)
	Если текВидВырубки = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если текВидВырубки = 2 ИЛИ (текВидВырубки = 8 И Заказ.РабочийЦентр.ВидРабочегоЦентра <> Справочники.ВидыРабочихЦентров.Weigang) ИЛИ текВидВырубки = 10 Тогда
		Заказ.Z = Справочники.Лико_ZКоличествоЗубьев.ПустаяСсылка();
	ИначеЕсли ТекВидВырубки = 4 Тогда
		//Заказ.ШиринаЭтикетки 	= 0;
		//Заказ.ДлинаЭтикетки  	= 0;
		Заказ.ЭтМЭР				= 0;
	ИначеЕсли ТекВидВырубки = 5 ИЛИ ТекВидВырубки = 6 Тогда
		Заказ.ШагПечати = 0;
		Заказ.ЭтикетокНаЛисте = 0;
		Заказ.Ручьи = 0;
	КонецЕсли;

КонецПроцедуры

&Вместо("СравнитьИВыбратьРаппорт")
Функция Лико_СравнитьИВыбратьРаппорт(Заказ, МассивРаппортов)

	Если МассивРаппортов.Количество() = 1 Тогда
		Возврат МассивРаппортов[0].Раппорт;  
	КонецЕсли;

	КоличествоФорм = Заказ.Цвета.НайтиСтроки(Новый Структура("РабочийЦентр,Цветоделение",Справочники.РабочиеЦентры.НайтиПоРеквизиту("ВидРабочегоЦентра",Справочники.ВидыРабочихЦентров.Omet),Истина)).Количество();
	Если КоличествоФорм = 0 Тогда
		Сообщить("Не удалось подобрать Раппорт. Сначала укажите цвтоделение");
		Возврат Неопределено;
	КонецЕсли;
	Нарезка = Заказ.Нарезка.Размер / 1000;
	ЦенаПолимера = Лико_Планирование.ЦенаЦеновойГруппы(Справочники.ЦеновыеГруппы.ПолимерДляФлексоКлише, ТекущаяДата() , Заказ.Площадка.Организация);
	Тираж = Заказ.Тираж * 1000;
	СтоимостьТиража = ?(ЗначениеЗаполнено(Заказ.СуммаДокумента),Заказ.СуммаДокумента,1);
	НужныйРаппорт = Неопределено;
	ДлинаПечатиКороткая = Неопределено;
	НеточностьРаппортаКороткойФормы = Неопределено;
	Для каждого ЭлСтруктуры Из МассивРаппортов Цикл
		КоличествоФорм = КоличествоФорм;
		ДлинаПечатиДлинная = ?(ЗначениеЗаполнено(ДлинаПечатиКороткая),ЭлСтруктуры.Раппорт.ДлинаПечати,Неопределено);
		ДлинаПечатиКороткая = ?(ЗначениеЗаполнено(ДлинаПечатиКороткая),ДлинаПечатиКороткая,ЭлСтруктуры.Раппорт.ДлинаПечати);
		ПлощадьКороткойФормы = КоличествоФорм * Нарезка * ДлинаПечатиКороткая / 1000;
		ПлощадьДлиннойФормы = ?(ЗначениеЗаполнено(ДлинаПечатиДлинная),КоличествоФорм * Нарезка * ДлинаПечатиДлинная / 1000,Неопределено);
		ЦенаПолимера = ЦенаПолимера;
		СтоимостьКороткойФормы = ЦенаПолимера * ПлощадьКороткойФормы;
		СтоимостьДлиннойФормы = ?(ЗначениеЗаполнено(ПлощадьДлиннойФормы),ЦенаПолимера * ПлощадьДлиннойФормы,Неопределено);
		Разница = ?(ЗначениеЗаполнено(СтоимостьДлиннойФормы),Макс(СтоимостьДлиннойФормы,СтоимостьКороткойФормы) - Мин(СтоимостьДлиннойФормы,СтоимостьКороткойФормы),Неопределено); 
		РазницаСтоимость = ?(ЗначениеЗаполнено(Разница),Разница / СтоимостьТиража,Неопределено); 
		КоэффициентПоДлине = Справочники.Лико_КоэффициентыДляРасчетов.КоэффициентФормы.Значение;
		ИтогоКороткаяФорма = ?(ЗначениеЗаполнено(РазницаСтоимость),РазницаСтоимость * КоэффициентПоДлине,Неопределено);
		НеточностьРаппортаДлиннойФормы = ?(ЗначениеЗаполнено(НеточностьРаппортаКороткойФормы),ЭлСтруктуры.НеточностьРаппорта,Неопределено);
		НеточностьРаппортаКороткойФормы = ?(ЗначениеЗаполнено(НеточностьРаппортаКороткойФормы),НеточностьРаппортаКороткойФормы,ЭлСтруктуры.НеточностьРаппорта);
		РазницаВНеточностиРаппорта = ?(ЗначениеЗаполнено(НеточностьРаппортаДлиннойФормы),Макс(НеточностьРаппортаДлиннойФормы,НеточностьРаппортаКороткойФормы) - Мин(НеточностьРаппортаДлиннойФормы,НеточностьРаппортаКороткойФормы),Неопределено);
		КоэффициентПоНеточности = Справочники.Лико_КоэффициентыДляРасчетов.КоэффициентНеточности.Значение;
		ИтогоДлиннаяФорма = ?(ЗначениеЗаполнено(РазницаВНеточностиРаппорта),РазницаВНеточностиРаппорта * КоэффициентПоНеточности,Неопределено);
		Если НЕ ЗначениеЗаполнено(НужныйРаппорт) Тогда
			НужныйРаппорт = ЭлСтруктуры.Раппорт;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ИтогоДлиннаяФорма) И ИтогоДлиннаяФорма > ИтогоКороткаяФорма Тогда 
			ДлинаПечатиКороткая = ЭлСтруктуры.Раппорт.ДлинаПечати;
			НеточностьРаппортаКороткойФормы = ЭлСтруктуры.НеточностьРаппорта;
			НужныйРаппорт = ЭлСтруктуры.Раппорт;
		КонецЕсли;
	КонецЦикла; 
	Возврат НужныйРаппорт;

КонецФункции
