
&После("СформироватьСписокРегистровДляКонтроля")
Процедура Лико_СформироватьСписокРегистровДляКонтроля()
	Массив = Новый Массив();
	ДополнительныеСвойства.ДляПроведения.РегистрыДляКонтроля= Массив; 
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура Лико_ОбработкаУдаленияПроведения(Отказ)
	
	//ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);

	////ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//
	////ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	////СформироватьСписокРегистровДляКонтроля();
	//
	//ОтчетДавальцуЛокализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

	////ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ПараметрыРегистрации = Документы.ОтчетДавальцу.ПараметрыРегистрацииСчетовФактурВыданных(ЭтотОбъект);
	//УчетНДСУП.АктуализироватьСчетаФактурыВыданныеПриУдаленииПроведения(ПараметрыРегистрации);
	//
	////ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//
	//РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	////ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	////
	////ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

    ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ПараметрыРегистрации = Документы.ОтчетДавальцу.ПараметрыРегистрацииСчетовФактурВыданных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыВыданныеПриУдаленииПроведения(ПараметрыРегистрации);
	
	ОтчетДавальцуЛокализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);      
	
	// --> Начало Лико Иванова Анна 20190619
	Если НЕ ДополнительныеСвойства.Свойство("Лико_ЭтоПерепроведениеДокументаБезИзменений") Тогда
		Лико_Планирование.ОчиститьДанныеПоОтгрузке(Ссылка);
	КонецЕсли;
	// <-- Конец Лико Иванова Анна 20190619

КонецПроцедуры
