 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
 
 #Область ПрограммныйИнтерфейс
 
 Функция СоздатьПеремещение( Паллет, Адрес) Экспорт
	 УстановитьПривилегированныйРежим(Истина);  
	 
	 // Создаем новый документ
	 НовыйДокумент = СоздатьДокумент();
	 
	 // Заполняем документ согласно стандартам 1С
	 НовыйДокумент.Заполнить(Неопределено);
	 
	 // Устанавливаем реквизиты
	 НовыйДокумент.Дата 			= ТекущаяДатаСеанса();
	 НовыйДокумент.Паллет 			= Паллет;
	 НовыйДокумент.АдресХранения 	= Адрес;
	 
	 // Сохранение документа с обработкой ошибок
	 Попытка
		 НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	 Исключение
		 ОшибкаСообщение = "Ошибка при сохранении документа Лико_ПеремещениеПаллета2_0: " + ОписаниеОшибки();
		 ВызватьИсключение ОшибкаСообщение;
	 КонецПопытки;
	 
	 Возврат НовыйДокумент.Ссылка;
	 
 КонецФункции
 
 #КонецОбласти
 
 #Область СлужебныйПрограммныйИнтерфейс
 
 // Код процедур и функций 
 
 #КонецОбласти
 
 #Область СлужебныеПроцедурыИФункции
 
 // Код процедур и функций
 
 #КонецОбласти

 #КонецЕсли