#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает актуальные форматы файлов обмена по зарплатным проектам на текущий момент
//
// Возвращаемое значение:
//  Массив из Перечисления.ФорматыФайловОбменаПоЗарплатнымПроектам
// 
Функция АктуальныеФорматы() Экспорт
	
	ФорматыФайлов = Новый Массив;
	ФорматыФайлов.Добавить(Перечисления.ФорматыФайловОбменаПоЗарплатномуПроекту.Версия36);
	ФорматыФайлов.Добавить(Перечисления.ФорматыФайловОбменаПоЗарплатномуПроекту.Версия37);
	
	Возврат ФорматыФайлов;
	
КонецФункции

#КонецОбласти

#КонецЕсли