#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СтатусыПозволяющиеРедактироватьДокументы() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(ПустаяСсылка());
	Массив.Добавить(ВРаботе);
	Массив.Добавить(Подготовлен);
	Массив.Добавить(НеПринятФСС);
	Массив.Добавить(Аннулирован);
	Возврат Массив;
КонецФункции

Функция СтатусыНеПозволяющиеРедактироватьДокументы() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(ПереданВФСС);
	Массив.Добавить(ПринятФСС);
	Возврат Массив;
КонецФункции

// Превращает состояние отправки регламентированного отчета в состояние реестра прямых выплат.
//
// Параметры:
//   СтатусОтправки - ПеречислениеСсылка.СтатусыОтправки
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтатусыЗаявленийИРеестровНаВыплатуПособий
//
Функция ИзСтатусаОтправки(СтатусОтправки) Экспорт
	СостоянияБРО = Перечисления.СтатусыОтправки;
	Если СтатусОтправки = СостоянияБРО.Доставлен Тогда
		Возврат ПереданВФСС;
	ИначеЕсли СтатусОтправки = СостоянияБРО.Отправлен Тогда
		Возврат ПереданВФСС;
	ИначеЕсли СтатусОтправки = СостоянияБРО.Сдан Тогда
		Возврат ПринятФСС;
	ИначеЕсли СтатусОтправки = СостоянияБРО.НеПринят Тогда
		Возврат НеПринятФСС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
