
&Вместо("ВывестиШтрихкодВТабличныйДокумент")
Процедура Лико_ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Объект, ИмяМакета)
	//+ Лико m.shenderov 21.02.2018
	 УстановитьПривилегированныйРежим(Истина); 
	//- Лико m.shenderov 21.02.2018
	
		НастройкаПечатиШтрихКодаПоКлассификатору = ПолучитьНастройкуОбъектаПоКлассификаторуСА(Объект, , ИмяМакета);
	Если НастройкаПечатиШтрихКодаПоКлассификатору = Неопределено Или ТипЗнч(ТабДокумент) = Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
    		
	// Передаем выборку или структуру с параметрами формирования ШК. Пока только [код.номер.дата], после сделаем настраиваемый состав ШК!
	ЗначениеШтрихКода = ПолучитьЗначениеШтрихКодаПоОбъекту(НастройкаПечатиШтрихКодаПоКлассификатору, Объект);
	ПоложениеШтрихКода = НастройкаПечатиШтрихКодаПоКлассификатору.ПоложениеШтрихКода;	
	РазмерШрифтаШК = Справочники.СА_Настройки.ПолучитьЗначение("РазмерШрифтаДляШтрихкода","Число",16);
	УстановитьПараметрыТабличногоДокумента(ТабДокумент,Объект,ИмяМакета);
	ОтступОтКрая = 4;	/// отступ (количество символов) штрихкода от края страницы
	СтрокаОтступа = "";
	Для й=1 По ОтступОтКрая Цикл
		СтрокаОтступа = СтрокаОтступа+"  ";
	КонецЦикла;
	ТабДокумент.ВерхнийКолонтитул.ТекстСлева  = "";
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа = "";
	ТабДокумент.НижнийКолонтитул.ТекстСлева   = "";
	ТабДокумент.НижнийКолонтитул.ТекстСправа  = "";
	Если ПоложениеШтрихКода = 1 Тогда
		// Выводим в начале табличного документа
		ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;
		//ТабДокумент.ВерхнийКолонтитул.ТекстСлева = СтрокаОтступа+БарКод(ЗначениеШтрихКода);
		//+ Лико m.shenderov 25.02.2020
		ТабДокумент.ВерхнийКолонтитул.ТекстСлева = БарКод(ЗначениеШтрихКода);

		//- Лико m.shenderov 25.02.2020
		
		ТабДокумент.ВерхнийКолонтитул.Шрифт = Новый Шрифт("Barcode", РазмерШрифтаШК);
		
		//евгенов сканархив 30.03.2016 +++  просьба не устанавливать штрихкод снизу от Сергея
		Если НЕ ИмяМакета = "ОтчетПечатника" Тогда
			ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
			ТабДокумент.НижнийКолонтитул.Выводить = Истина;
			ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
			ТабДокумент.НижнийКолонтитул.ТекстСправа = "*P[&НомерСтраницы]$" + Строка(ТабДокумент.КоличествоСтраниц()) + "*";
			ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Free 3 of 9", РазмерШрифтаШК);
		КонецЕслИ;
		//евгенов сканархив 30.03.2016 ---
	ИначеЕсли ПоложениеШтрихКода = 2 Тогда
		// Выводим в конце табличного документа
		ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
		ТабДокумент.НижнийКолонтитул.Выводить = Истина;
		ТабДокумент.НижнийКолонтитул.ТекстСлева = СтрокаОтступа+БарКод(ЗначениеШтрихКода);
		ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Barcode", РазмерШрифтаШК);
		
		ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 1;
		ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;
		ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
		ТабДокумент.ВерхнийКолонтитул.ТекстСправа = "*P[&НомерСтраницы]$" + Строка(ТабДокумент.КоличествоСтраниц()) + "*";
		ТабДокумент.ВерхнийКолонтитул.Шрифт = Новый Шрифт("Free 3 of 9", РазмерШрифтаШК);
	КонецЕсли;
	//+ Лико m.shenderov 21.02.2018
	 УстановитьПривилегированныйРежим(Ложь); 
	//- Лико m.shenderov 21.02.2018
	

КонецПроцедуры
