
&НаКлиенте
Процедура Лико_ТоварыХарактеристикаПриИзмененииПосле(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Серия=Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокШтрихКодов,
	"Характеристика",
	Элементы.Товары.ТекущиеДанные.Характеристика,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Истина);
	
	//+m.shenderov 10.07.2017 
	Лико_СкладыКлиент.ЗаполнениеУпаковкиПоХарактеристики (ЭтаФорма,Элемент);
	КоличествоУпаковокПриИзменении(Элемент);
	//-m.shenderov 10.07.2017	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыПриНачалеРедактированияПеред(Элемент, НоваяСтрока, Копирование)
	//+m.shenderov 10.07.2017
	//Убиваем серию при коприовании
	Если Копирование Тогда
		Элементы.Товары.ТекущиеДанные.Серия=Неопределено;
		Если   Элементы.Товары.ТекущиеДанные.СтатусУказанияСерий=8 Тогда
			Элементы.Товары.ТекущиеДанные.СтатусУказанияСерий=7;
		КонецЕсли;
		
		
	КонецЕсли;
	//-m.shenderov 10.07.2017
	
	
КонецПроцедуры

&НаКлиенте
&После("ОткрытьПодборСерийЗавершение")
Процедура Лико_ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры)
	
	//+m.shenderov 10.07.2017
	Для каждого Товар Из Объект.Товары Цикл
		Элементы.Товары.ТекущаяСтрока = Товар.ПолучитьИдентификатор();		
		Характеристика=Товар.Характеристика;
		Нарезка=ПолучитьНарезку(Характеристика);
		Если ЗначениеЗаполнено(Нарезка) Тогда
			Упаковка=ПолучитьУпаковку(Нарезка);
			Если ЗначениеЗаполнено(Упаковка) и Элементы.Товары.ТекущиеДанные.Упаковка<>Упаковка Тогда 
				Элементы.Товары.ТекущиеДанные.Упаковка=Упаковка;
				Элементы.Товары.ТекущиеДанные.Количество=0;
				КоличествоУпаковокПриИзменении(Элементы.Товары.ТекущиеДанные);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 	
	//-m.shenderov 10.07.2017
	
КонецПроцедуры

//+m.shenderov 10.07.2017  
#Область Дополнительно
&НаСервереБезКонтекста
Функция ПолучитьНарезку (Характеристика)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,"ЯССМ_Нарезка")	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУпаковку(Нарезка)
	Возврат	Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка)
	
КонецФункции


&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);		
КонецФункции 




&НаКлиенте
Процедура ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры)
	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	КоличествоЭкземпляров=0;
	
	ТабДокумент=Лико_Дополнительно.ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры,,БыстраяПечать);
	//!ТабДокумент.ИмяПринтера = ИмяПринтера;
	
	//
	//ТабДокумент.АвтоМасштаб = Истина;
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.ПолеСлева = 1;
	//ТабДокумент.ПолеСправа = 0;
	//ТабДокумент.ПолеСнизу = 0;
	//ТабДокумент.ПолеСверху = 1;
	////
	//ТабДокумент.РазмерСтраницы="Custom";//нестандартный размер бумаги
	//ТабДокумент.ВысотаСтраницы=64;
	//ТабДокумент.ШиринаСтраницы=90; 		
	
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ТабДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если БыстраяПечать Тогда
		ТабДокумент.Напечатать();
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте


&НаКлиенте
Процедура Лико_ПодборСерийЗавершение(РезультатФорма,ПараметрыФорма) Экспорт 
	
	Если ТипЗнч(РезультатФорма)=Тип("Массив") Тогда
		
		Для каждого ОбъектНоменклатуры Из РезультатФорма  Цикл
			
			СтруктураНоменклатуры=ПолучитьСтруктуруОбъектНоменклатуры(ОбъектНоменклатуры);
			
			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура",СтруктураНоменклатуры.Номенклатура);
			СтруктураОтбора.Вставить("Характеристика",СтруктураНоменклатуры.Характеристика);
			СтруктураОтбора.Вставить("Серия",ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
			
			СтрокиСПустымиСериями=Объект.Товары.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаСПустйСерией Из СтрокиСПустымиСериями Цикл				
				Объект.Товары.Удалить(Объект.Товары.Индекс(СтрокаСПустйСерией));				
			КонецЦикла;
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 				 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатуры);
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");      
				
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер();
		
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруОбъектНоменклатуры(Ссылка) //+Лико m.shenderov 24.10.2017
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Неопределено);
	Структура.Вставить("Характеристика",Неопределено);
	Структура.Вставить("КоличествоУпаковок",Неопределено);
	Структура.Вставить("Серия",Неопределено);
	Структура.Вставить("Упаковка",Неопределено);
	Структура.Вставить("Количество",Неопределено); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия,
	|	ЯССМ_ОбъектыНоменклатуры.Характеристика КАК Характеристика,
	|	ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	ЯССМ_ОбъектыНоменклатуры.Количество КАК КоличествоУпаковок,
	|	ЯССМ_ОбъектыНоменклатуры.Количество * ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК Количество
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.10.2017

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер() //+Лико m.shenderov 25.10.2017
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары();
	
КонецПроцедуры  //-Лико m.shenderov 25.10.2017

&НаСервере
Процедура Лико_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("BRC_Подпись") Тогда
		BRC_Подпись=Истина;
	КонецЕсли;
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		Объект.Лико_Организация=
		Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", Параметрысеанса.ТекущийПользователь); 			
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Если Объект.Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ Тогда
			Элементы.ТоварыСерияОбъектНоменклатуры.Видимость=Истина;
			Элементы.ТоварыСерия.Видимость=Ложь;
			
		Иначе
			Элементы.ТоварыСерияОбъектНоменклатуры.Видимость=Ложь;
			Элементы.ТоварыСерия.Видимость=Истина; 
		КонецЕсли;
		
	КонецЕсли;
	СразуНаПринтер=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);	
	ПечатьПриходногоОрдера=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьПриходногоОрдера",Ложь);	
	Если  РольДоступна("АдминистраторСистемы") Тогда
		
		Элементы.АвторДокумента.Вид=ВидПоляФормы.ПолеВвода;
		Элементы.РабочееМесто.Вид=ВидПоляФормы.ПолеВвода;
	Иначе
		Элементы.АвторДокумента.Вид=ВидПоляФормы.ПолеНадписи;
		Элементы.РабочееМесто.Вид=ВидПоляФормы.ПолеНадписи;
		
		
	КонецЕсли;
	//
	Если ТипЗнч(Объект.Распоряжение)=Тип("ДокументСсылка.ЗаказПоставщику") ТОгда
		
		Объект.Лико_Интеркампани=Лико_Дополнительно.ПриходПоИнтеркампани(Объект.Распоряжение.Организация,Объект.Распоряжение.Контрагент);
		Если Объект.Лико_Интеркампани и Объект.Лико_ОтражатьВБухгалтерскомУчете тогда
			Объект.Лико_ОтражатьВБухгалтерскомУчете=Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Организация=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b");
	Организация=Объект.Распоряжение.Организация;
	BRC=?(ЗначениеЗаполнено(Организация),УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC"),Ложь);	
	Если Объект.Склад.Лико_ТипСклада<>Перечисления.Лико_ТипСклада.СИМ ТОгда 
		BRC=Ложь;		
	КонецЕсли;
	
	Если BRC Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Лико_ВидКонтактаСПищевойПродукцией)и ТипЗнч(Объект.Распоряжение)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Объект.Лико_ВидКонтактаСПищевойПродукцией=Объект.Распоряжение.Лико_ВидКонтактаСПищевойПродукцией;
		КонецЕсли;
		Если Объект.Товары.Количество()>0 и   
			Объект.Лико_ВидКонтактаСПищевойПродукцией<>Объект.Товары[0].Номенклатура.Лико_ВидКонтактаСПищевойПродукцией Тогда
			Объект.Лико_ВидКонтактаСПищевойПродукцией=Объект.Товары[0].Номенклатура.Лико_ВидКонтактаСПищевойПродукцией;
		КонецЕсли;
		СформироватьТаблицуУпаковокBRC();
		
		Если BRC_Подпись Тогда
			Элементы.BRCТоварыBRC_РешениеОПриемке.ТолькоПросмотр=Ложь;
			Элементы.BRC_РешениеОПриемке.ТолькоПросмотр=Ложь;
			Элементы.Лико_ПараметрыВходногоКонтроля.ТолькоПросмотр=Истина;
			
		Иначе
			Элементы.BRCТоварыBRC_РешениеОПриемке.ТолькоПросмотр=Истина;
			Элементы.BRC_РешениеОПриемке.ТолькоПросмотр=Истина;
			Если РольДоступна("ПолныеПрава") или РольДоступна("Лико_ВходнойКонтроль") Тогда
				
				Элементы.Лико_ПараметрыВходногоКонтроля.ТолькоПросмотр=Ложь;
			Иначе
				Элементы.Лико_ПараметрыВходногоКонтроля.ТолькоПросмотр=Истина;
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		Элементы.Лико_ВидКонтактаСПищевойПродукцией.Видимость=Истина;
		Если  Объект.Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ Тогда
			Элементы.ГруппаBRC.Видимость=Истина;
			
		КонецЕсли;
		АктБрака=ПолучитьАктзабраковки();
		ЗаполнитьКритерииДляВходногоКонтроля();	
	Иначе
		Элементы.ГруппаBRC.Видимость=Ложь;
		Элементы.Лико_ВидКонтактаСПищевойПродукцией.Видимость=Ложь;
		
	КонецЕсли; 
	
	Лико_ТоварыВПути = Объект.Склад.Лико_ТипСклада = Перечисления.Лико_ТипСклада.ТоварыВПути;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПриОткрытииПеред(Отказ)
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор) и НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ОчиститьСообщения(); 	
		//ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","ПриходныйОрдерНаТовары");
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		Отказ=Истина;
	КонецЕсли; 
	
	
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор) и  ЗначениеЗаполнено(Объект.Ссылка) и НЕ ЗначениеЗаполнено(Объект.Лико_АвторДокумента) Тогда
		//ОчиститьСообщения(); 	
		//ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","ПриходныйОрдерНаТовары");
		Структура.Вставить("Ключ",Объект.Ссылка);
		
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		Отказ=Истина;
	КонецЕсли; 
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Лико_АвторДокумента=ГлЛико_Оператор;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(	Объект.Лико_АвторДокумента) Тогда 
		Объект.Лико_АвторДокумента=ГлЛико_Оператор;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(	Объект.Лико_РабочееМесто) Тогда 
		Объект.Лико_РабочееМесто=ПолучитьРабочееМестоНаСервере();
	КонецЕсли;
	
	
	ЕСли 	Объект.Лико_СтатусОбмена=2 Тогда
		Объект.Лико_СтатусОбмена=1;
	КонецЕсли;
	Если Объект.Лико_СтатусОбмена=2 Тогда
		Объект.Лико_СтатусОбмена=1;
	КонецЕсли;
	
	ПоказатьКартинкуКритерия();
	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьРабочееМестоНаСервере() //+Лико m.shenderov 02.09.2018  
	Возврат ПараметрыСеанса.Лико_РабочееМесто;
КонецФункции  //-Лико m.shenderov 02.09.2018



&НаКлиенте
Процедура Лико_ТоварыВыборПеред(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Лико_СкладыКлиент.ПоказатьФормуОбъектаНоменклатуры(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка,"ТоварыСерияОбъектНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если Объект.Проведен  И ПечатьПриходногоОрдера ТОгда
		
		ВыполняемаяОбработка=НайтиПФ("Печатная форма документа ""Приходный ордер на товары"" (внутренний документ поступления)");
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ОбъектыНазначения=Новый Массив;
		ОбъектыНазначения.Добавить(Объект.Ссылка);
		//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
		ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
		ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
		ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
		ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ВнутреннийДокументПоступления";
		ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
		
		
	КонецЕсли;
	
	Если BRC Тогда
		АктБрака=ПолучитьАктзабраковки();
		ЗаполнитьЗначенияВходногоКонтроляBRCТаблицы();
		
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция НайтиПФ(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 05.03.2018
	Если Объект.Лико_Интеркампани Тогда
		Элементы.Лико_ОтражатьВБухгалтерскомУчете.Видимость	=Ложь;
		Элементы.Лико_Интеркампани.Видимость				=Истина;
		Элементы.Лико_РаспоряжениеИнтеркампани.Видимость	=Истина;
	Иначе
		Элементы.Лико_ОтражатьВБухгалтерскомУчете.Видимость	=Истина;
		Элементы.Лико_Интеркампани.Видимость				=Ложь;
		Элементы.Лико_РаспоряжениеИнтеркампани.Видимость	=Ложь;
		
	КонецЕсли; 
	
	Если Лико_ТоварыВПути Тогда
		Элементы.ТоварыГруппаЛикоЦены.Видимость = Истина;
		Элементы.Лико_ВалютаТоваровВПути.Видимость = Истина;
	Иначе
	    Элементы.ТоварыГруппаЛикоЦены.Видимость = Ложь;	
		Элементы.Лико_ВалютаТоваровВПути.Видимость = Ложь;

	КонецЕсли;
	
	
	
	Если Объект.Лико_ОтражатьВБухгалтерскомУчете Тогда
		Элементы.ГруппаЛикоБУ.Видимость=Истина;
	Иначе
		Элементы.ГруппаЛикоБУ.Видимость=Ложь;
	КонецЕсли;
	
	Если BRC Тогда
		Если Объект.Лико_ВидКонтактаСПищевойПродукцией=ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтакта") Тогда
			Элементы.BRC_СанитарноеСостояниеТранспорта.Видимость	=Ложь;
			Элементы.BRC_ЗагрязненияВнешнейУпаковки.Видимость		=Ложь;
			Элементы.BRC_ПаллетСоответствуетТребованиям.Видимость	=Ложь; 			
			//ИначеЕсли Объект.Лико_ВидКонтактаСПищевойПродукцией=Справочники.Лико_ВидыКонтактовСПищевойПродукцией.НепрямойКонтакт Тогда
			//ИначеЕсли Объект.Лико_ВидКонтактаСПищевойПродукцией=Справочники.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт Тогда
		КонецЕсли; 		
	КонецЕсли;
	Если BRC_Подпись ТОгда
		Элементы.ФормаПровестиИЗакрыть.Видимость=Ложь;
		Элементы.ФормаЗаписать.Видимость=Ложь;
		Элементы.ФормаПровести.Видимость=Ложь;
		Элементы.ФормаПодписатьДокумент.Видимость=Истина;
		Элементы.ФормаПодписатьДокумент.КнопкаПоУмолчанию=Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.ГруппаBRC;
		
	Иначе
		
		Элементы.ФормаПровестиИЗакрыть.Видимость=Истина;
		Элементы.ФормаЗаписать.Видимость=Истина;
		Элементы.ФормаПровести.Видимость=Истина;
		Элементы.ФормаПодписатьДокумент.Видимость=Ложь;
		
		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 05.03.2018

&НаКлиенте
Процедура Лико_Лико_ОтражатьВБухгалтерскомУчетеПриИзмененииВместо(Элемент)
	ЗаполнитьТаблицуСЦенами();
	УстановитьВидимость();
	ЛК_СформироватьБухгалтерскиеДокументы=Объект.Лико_ОтражатьВБухгалтерскомУчете;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуСЦенами() //+Лико m.shenderov 24.02.2018
	Если Объект.Лико_ОтражатьВБухгалтерскомУчете Тогда
		ТзНоменклатура=Объект.Товары.Выгрузить();
		ТзНоменклатура.Свернуть("Номенклатура","Количество");
		Объект.Лико_ЦеныНоменклатуры.Загрузить(ТзНоменклатура);
	Иначе
		Объект.Лико_ЦеныНоменклатуры.Очистить();		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 24.02.2018

&НаКлиенте
Процедура Лико_Лико_ЦеныНоменклатурыЦенаПриИзмененииПосле(Элемент)
	ТекСтр=Элементы.Лико_ЦеныНоменклатуры.ТекущиеДанные;
	ЕСли  ТекСтр.Количество<>0 Тогда
		ТекСтр.Цена_0=ТекСтр.Цена/ТекСтр.Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ЦеныНоменклатурыЦена_0ПриИзмененииПосле(Элемент)
	ТекСтр=Элементы.Лико_ЦеныНоменклатуры.ТекущиеДанные;
	
	ТекСтр.Цена=ТекСтр.Цена_0*ТекСтр.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ДоговорНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Структура = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("ВалютаВзаиморасчетов",Объект.Лико_Валюта);
	Отбор.Вставить("Контрагент",	Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Контрагент"));
	Отбор.Вставить("Организация",	Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Организация"));
	Отбор.Вставить("Партнер",		Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Партнер"));
	Структура.Вставить("Отбор",		Отбор);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора",Структура,Элементы.Лико_Договор);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыНоменклатураПриИзмененииПеред(Элемент)
	Элементы.Товары.ТекущиеДанные.Серия=Неопределено; 
КонецПроцедуры

&НаКлиенте
Процедура Лико_BRC_СоответствуетПриИзмененииПосле(Элемент)
	Объект.BRC_НеСоответствует=Не Объект.BRC_Соответствует;
КонецПроцедуры

&НаКлиенте
Процедура Лико_BRC_НеСоответствуетПриИзмененииПосле(Элемент)
	Объект.BRC_Соответствует=Не Объект.BRC_НеСоответствует;
КонецПроцедуры


&НаСервере
Функция ПолучитьАктзабраковки() //+Лико m.shenderov 15.05.2020  
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|ГДЕ
	|	Лико_ПередачаТоваров.ПриходныйОрдер = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
КонецФункции  //-Лико m.shenderov 15.05.2020

&НаКлиенте
Процедура ФайлКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПросмотретьПрисоединенныйФайл("ФайлКартинкиКритерия", "АдресКартинкиКритерия",
	НСтр("ru='Отсутствует изображение для просмотра'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл(ИмяРеквизитаОбъекта, ИмяРеквизитаФормы, ТекстСообщенияОбОшибке)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизитаОбъекта]) Тогда
		РаботаСФайламиКлиент.ОткрытьФайл(
		РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(
		ЭтаФорма[ИмяРеквизитаОбъекта],
		УникальныйИдентификатор));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке,, ИмяРеквизитаФормы);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьКартинкуКритерия() //+Лико m.shenderov 28.04.2020
	ЕСли Элементы.Лико_ПараметрыВходногоКонтроля.ТекущиеДанные<>Неопределено Тогда
		ФайлКартинкиКритерия = НайтиКартинкуКритерия(Элементы.Лико_ПараметрыВходногоКонтроля.ТекущиеДанные.Критерий);
		Если ЗначениеЗаполнено(ФайлКартинкиКритерия) Тогда
			АдресКартинкиКритерия = НавигационнаяСсылкаКартинки(ФайлКартинкиКритерия, УникальныйИдентификатор);
		Иначе
			АдресКартинкиКритерия = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //-Ли


Функция НайтиКартинкуКритерия(Критерий) //+Лико m.shenderov 28.04.2020
	УстановитьПривилегированныйРежим(Истина);
	Возврат Критерий.ФайлКартинки;	
КонецФункции //-Лико m.shenderov 28.04.2020 

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинкиКритерия, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинкиКритерия, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

&НаКлиенте
Процедура Лико_Лико_ПараметрыВходногоКонтроляПриАктивизацииСтрокиПосле(Элемент)
	ПоказатьКартинкуКритерия();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКритерииДляВходногоКонтроля() //+Лико m.shenderov 23.06.2020
	УстановитьПривилегированныйРежим(Истина);
	УдалитьКритерииНеКонтакта();
	ДобавитьКритерииКонтакта();
	
КонецПроцедуры  //-Лико m.shenderov 23.06.2020

&НаСервере
Процедура УдалитьКритерииНеКонтакта() //+Лико m.shenderov 23.06.2020
	
	Массив = Новый Массив();
	Для каждого ПараметрВК Из Объект.Лико_ПараметрыВходногоКонтроля Цикл
		Если  ПараметрВК.Критерий.ДляУпаковки Тогда 
			//Или Объект.Лико_ВидКонтактаСПищевойПродукцией<>ПараметрВК.Критерий.ВидКонтакта ТОгда
			
			Массив.Добавить(ПараметрВК);
		КонецЕсли;	  
		
		
	КонецЦикла;
	
	Для каждого Индекс Из Массив Цикл
		Объект.Лико_ПараметрыВходногоКонтроля.Удалить(Индекс);
		
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 23.06.2020

Процедура ДобавитьКритерииКонтакта() //+Лико m.shenderov 23.06.2020
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_КритерииВходногоКонтроля.Ссылка КАК Критерий
	|ИЗ
	|	Справочник.Лико_КритерииВходногоКонтроля.ВидыКонтактов КАК Лико_КритерииВходногоКонтроля
	|ГДЕ
	|	НЕ Лико_КритерииВходногоКонтроля.Ссылка.ДляУпаковки
	| И Лико_КритерииВходногоКонтроля.ВидКонтакта=&ВидКонтакта";
	Запрос.УстановитьПараметр("ВидКонтакта",Объект.Лико_ВидКонтактаСПищевойПродукцией);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Критерий",Выборка.Критерий);
		Если Объект.Лико_ПараметрыВходногоКонтроля.НайтиСтроки(Структура).Количество()=0 Тогда
			НовыйЭлемент=Объект.Лико_ПараметрыВходногоКонтроля.Добавить();
			НовыйЭлемент.Критерий=Выборка.Критерий;
		КонецЕсли;
		
	КонецЦикла; 
	ТзКритерии=РезультатЗапроса.Выгрузить();
	Массив = Новый Массив();
	Для каждого СтрКритерий Из Объект.Лико_ПараметрыВходногоКонтроля Цикл
		
		Если ТзКритерии.Найти(СтрКритерий.Критерий,"Критерий")=Неопределено Тогда
			Массив.Добавить(СтрКритерий);
		КонецЕсли; 		
	КонецЦикла;
	
	Для каждого Индекс Из Массив  Цикл
		    Объект.Лико_ПараметрыВходногоКонтроля.Удалить(Индекс);
	КонецЦикла;
	
	
	
КонецПроцедуры //-Лико m.shenderov 23.06.2020

&НаКлиенте
Процедура Лико_Лико_ПараметрыВходногоКонтроляНесоответствиеВыявленоПриИзмененииПосле(Элемент)
	Элементы.Лико_ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеНеВыявлено=              
	Не Элементы.Лико_ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеВыявлено;
КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ПараметрыВходногоКонтроляНесоответствиеНеВыявленоПриИзмененииПосле(Элемент)
	Элементы.Лико_ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеВыявлено=              
	Не Элементы.Лико_ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеНеВыявлено;
КонецПроцедуры

&НаКлиенте
Процедура Лико_СоответсвуетВКПосле(Команда)
	Для каждого СтрКр Из объект.Лико_ПараметрыВходногоКонтроля  Цикл
		
		СтрКр.НесоответствиеНеВыявлено=Истина;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Лико_НеСоответсвуетПосле(Команда)
	Для каждого СтрКр Из объект.Лико_ПараметрыВходногоКонтроля  Цикл
		
		СтрКр.НесоответствиеНеВыявлено=Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьТаблицуУпаковокBRC() //+Лико m.shenderov 16.07.2020
	
	
	РезультатЗапроса = КритерииДляУпаковки();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		Реквизит="BRC"+Выборка.Код;
		нРеквизиты = Новый Массив;
		нРеквизиты.Добавить(Новый РеквизитФормы("BRC"+Выборка.Код, Новый ОписаниеТипов("Булево"), "Объект.Товары",Выборка.Наименование));
		ИзменитьРеквизиты(нРеквизиты);
		
		нЭлемент = Элементы.Добавить(Реквизит, Тип("ПолеФормы"), Элементы.BRCТовары); 
		нЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
		нЭлемент.ПутьКДанным = "Объект.Товары."+Реквизит;
		нЭлемент.УстановитьДействие("ПриИзменении", "ИзменениеТаблицыBRC");
		Если BRC_Подпись Тогда
			нЭлемент.ТолькоПросмотр=Истина;
		Иначе
			Если РольДоступна("ПолныеПрава") или РольДоступна("Лико_ВходнойКонтроль") Тогда
				нЭлемент.ТолькоПросмотр=Ложь;
			Иначе
				нЭлемент.ТолькоПросмотр=Истина;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла; 
	
	ЗаполнитьЗначенияВходногоКонтроляBRCТаблицы();
	
КонецПроцедуры //-Лико m.shenderov 16.07.2020

Функция КритерииДляУпаковки() //+Лико m.shenderov 16.07.2020
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_КритерииВходногоКонтроля.Ссылка.Код КАК Код,
	|	Лико_КритерииВходногоКонтроля.Ссылка КАК Критерий,
	|	Лико_КритерииВходногоКонтроля.Ссылка.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Лико_КритерииВходногоКонтроля.ВидыКонтактов КАК Лико_КритерииВходногоКонтроля
	|ГДЕ
	|Лико_КритерииВходногоКонтроля.Ссылка.ДляУпаковки
	|И Лико_КритерииВходногоКонтроля.ВидКонтакта=&ВидКонтакта 
	|";
	Запрос.УстановитьПараметр("ВидКонтакта",Объект.Лико_ВидКонтактаСПищевойПродукцией);
	
	Возврат Запрос.Выполнить();
	
КонецФункции //-Лико m.shenderov 16.07.2020 


Процедура ЗаполнитьЗначенияВходногоКонтроляBRCТаблицы() //+Лико m.shenderov 16.07.2020
	
	Для каждого Товар Из Объект.Товары Цикл
		Для каждого Критерий Из Товар.Серия.ЯССМ_ОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля Цикл
			Попытка
			Реквизит="BRC"+Критерий.Критерий.Код;
			Товар[Реквизит]=Критерий.НесоответствиеНеВыявлено; 	
			Исключение
			    //ОписаниеОшибки()
			КонецПопытки;
					
		КонецЦикла;	
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 16.07.2020




&НаКлиенте
Процедура ИзменениеТаблицыBRC(Элемент)
	ТД=Элементы.BRCТовары.ТекущиеДанные;
	ИмяЭ=Элемент.Имя;
	ИзменениеТаблицыBRCНаСервере(Сред(ИмяЭ,4),ТД.Серия,ТД[ИмяЭ]);
КонецПроцедуры

&НаСервере
Процедура ИзменениеТаблицыBRCНаСервере(Код,Серия,Значение) //+Лико m.shenderov 16.07.2020
	Критерий=Справочники.Лико_КритерииВходногоКонтроля.НайтиПоКоду(Код);
	ОбъектОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
	СтруктураПоиска = Новый Структура;
	
	СтруктураПоиска.Вставить("Критерий",Критерий);
	НайденныеСтроки=ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля.НайтиСтроки(СтруктураПоиска);
	Если  НайденныеСтроки.Количество()=0 Тогда
		НовыйКритерий=ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля.Добавить();
		НовыйКритерий.Критерий=Критерий;
		НовыйКритерий.НесоответствиеНеВыявлено=Значение;
		
	Иначе
		НайденныеСтроки[0].НесоответствиеНеВыявлено=Значение;
	КонецЕсли;	
	ОбъектОбъектНоменклатуры.Записать();
	
	
КонецПроцедуры  //-Лико m.shenderov 16.07.2020

&НаКлиенте
Процедура Лико_СоответсвуетВК1После(Команда)
	ТД=Элементы.BRCТовары.ТекущиеДанные;
	УстановитьЗначениеКритерия(ТД.Серия,Истина);
	ЗаполнитьЗначенияВходногоКонтроляBRCТаблицы();
	//Элементы.BRCТовары.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Лико_НеСоответсвуетВК1После(Команда)
	ТД=Элементы.BRCТовары.ТекущиеДанные;
	
	УстановитьЗначениеКритерия(ТД.Серия,Ложь);
	ЗаполнитьЗначенияВходногоКонтроляBRCТаблицы();
	
	//Элементы.BRCТовары.Обновить();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьЗначениеКритерия(Серия,Значение) //+Лико m.shenderov 16.07.2020
	
	ОбъектОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
	ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля.Очистить();
	
	РезультатЗапроса = КритерииДляУпаковки();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовыйКритерий= ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля.Добавить();
		
		НовыйКритерий.Критерий=Выборка.Критерий;
		
		НовыйКритерий.НесоответствиеНеВыявлено=Значение;
		
	КонецЦикла;
	
	ОбъектОбъектНоменклатуры.Записать();
	
	
КонецПроцедуры  //-Лико m.shenderov 16.07.2020

&НаКлиенте
Процедура Лико_ПодписатьДокументПосле(Команда)
	Отказ=Ложь;
	Для каждого Товар Из Объект.Товары Цикл
		Если Не Товар.BRC_Соответствует и НЕ ЗначениеЗаполнено(Товар.BRC_РешениеОПриемке) Тогда
			Отказ=Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо указать решение о приемке!";
			Сообщение.Поле = "Объект.Товары["+Товар.ПолучитьИдентификатор()+"].BRC_РешениеОПриемке"; //имя реквизита 
			Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
			Сообщение.Сообщить();
			
			
		КонецЕсли;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НесоответствиеНеВыявлено",Ложь);
		
	КонецЦикла;	
	
	Если   Объект.Лико_ПараметрыВходногоКонтроля.НайтиСтроки(СтруктураПоиска).Количество()>0 И
		Не ЗначениеЗаполнено(Объект.BRC_РешениеОПриемке)Тогда
		Отказ=Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо указать решение о приемке!";
		Сообщение.Поле = "Объект.BRC_РешениеОПриемке"; //имя реквизита 
		Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	
	
	Если Не Отказ Тогда	
		ПодписатьДокументНаСервере();
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если BRC_Подпись Тогда
		СтандартнаяОбработка	=Ложь;
		Модифицированность		=Ложь;
		Закрыть(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодписатьДокументНаСервере () //+Лико m.shenderov 16.07.2020
	ОбъектСсылка=РеквизитФормыВЗначение("Объект");
	ОбъектСсылка.ОбменДанными.Загрузка=Истина;
	НачатьТранзакцию();
	ОбъектСсылка.Записать();
	Для каждого Товар Из Объект.Товары Цикл
		ОбъектОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
		ОбъектОбъектНоменклатуры.Записать();
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры  //-Лико m.shenderov 16.07.2020

&НаКлиенте
Процедура Лико_BRCТоварыBRC_РешениеОПриемкеПриИзмененииПосле(Элемент)
	ТД=Элементы.BRCТовары.ТекущиеДанные;
	
	BRC_РешениеОПриемкеПриИзмененииНаСервере(ТД.Серия,ТД.BRC_РешениеОПриемке);
	
КонецПроцедуры


&НаСервере
Процедура BRC_РешениеОПриемкеПриИзмененииНаСервере(Серия,РешениеОПриемке) //+Лико m.shenderov 17.07.2020
	ОбъектОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
	
	ОбъектОбъектНоменклатуры.BRC_РешениеОПриемке=РешениеОПриемке;
	ОбъектОбъектНоменклатуры.Записать();
КонецПроцедуры  //-Лико m.shenderov 17.07.2020

&НаКлиенте
Процедура Лико_BRC_РешениеОПриемкеПриИзмененииПосле(Элемент)
	ЕСли Объект.BRC_РешениеОПриемке=ПредопределенноеЗначение("Перечисление.BRC_РешенияОПриемке.ВернутьПоставщику") Тогда
		Для каждого Товар Из  Объект.Товары Цикл
			Товар.BRC_РешениеОПриемке= ПредопределенноеЗначение("Перечисление.BRC_РешенияОПриемке.ВернутьПоставщикУ");
			BRC_РешениеОПриемкеПриИзмененииНаСервере(Товар.Серия,Товар.BRC_РешениеОПриемке);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	Если BRC Тогда
		ЗаполнитьЗначенияВходногоКонтроляBRCТаблицы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Лико_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПроверитьНаличииКритериевВУпаковке();
КонецПроцедуры

Процедура ПроверитьНаличииКритериевВУпаковке()
	Если BRC Тогда
		КритерииДляУпаковки=КритерииДляУпаковки();
		Для каждого Товар Из Объект.Товары Цикл
			УстановитьЗначениеНедастающихКритерив(Товар.Серия,КритерииДляУпаковки)
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры


Процедура УстановитьЗначениеНедастающихКритерив(Серия,КритерииДляУпаковки) //+Лико m.shenderov 16.07.2020
	
	ОбъектОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();	
	
	РезультатЗапроса = КритерииДляУпаковки;
	Выборка = РезультатЗапроса.Выбрать();
	ЗаписатьОбъект=ЛОжь;
	Пока Выборка.Следующий() Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("Критерий",Выборка.Критерий);
		Если  ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля.НайтиСтроки(Структура).Количество()=0 ТОгда
			
			НовыйКритерий= ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля.Добавить();
			
			НовыйКритерий.Критерий=Выборка.Критерий;
			
			ЗаписатьОбъект=Истина;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ТзКритериев=РезультатЗапроса.Выгрузить();
	Массив = Новый Массив();
	Для каждого СтрКВК Из ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля Цикл
		Если   ТзКритериев.Найти(СтрКВК.Критерий,"Критерий")=Неопределено Тогда
			ЗаписатьОбъект=Истина;
			Массив.Добавить(СтрКВК);
		КонецЕсли; 	
	КонецЦикла;
	Для каждого Индекс Из Массив Цикл
		ОбъектОбъектНоменклатуры.Лико_ПараметрыВходногоКонтроля.Удалить(Индекс);
	КонецЦикла;
	
	Если ЗаписатьОбъект Тогда
		ОбъектОбъектНоменклатуры.Записать();
	КонецЕсли;
	
	
	
КонецПроцедуры  //-Лико m.shenderov 16.07

&НаКлиенте
&Вместо("ОткрытьПодборСерий")
Процедура Лико_ОткрытьПодборСерий(Текст, ТекущиеДанные)
	//+ ---> Лико m.shenderov 29.04.2022
	Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Склад,"Лико_ТипСклада")=ПредопределенноеЗначение("Перечисление.Лико_ТипСклада.СИМ") Тогда
		//Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,"", Неопределено) Тогда

		Товар=Элементы.Товары.ТекущиеДанные;	
		Структура = Новый Структура;
		Структура.Вставить("ВидОперации","ДобавитьВОрдер");

		Структура.Вставить("Номенклатура",Товар.Номенклатура);

		Структура.Вставить("Характеристика",Товар.Характеристика);
		Если Товар<>Неопределено и  УчетПоСериям(Товар.Номенклатура) Тогда  

			Структура.Вставить("Количество",Товар.Количество);
			Структура.Вставить("КоличествоУпаковок",Товар.КоличествоУпаковок);

			Структура.Вставить("Упаковка",Товар.Упаковка);
		КонецЕсли;

		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ПодборСерийЗавершение",ЭтаФорма);
		ОткрытьФорму("Обработка.Лико_СозданиеОбъектовНоменклатурыГрупповое.Форма.Форма",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		//КонецЕсли;
		Возврат;
	КонецЕсли; 
	//- <--- Лико m.shenderov 29.04.2022

	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма, ПараметрыУказанияСерий, Текст, ТекущиеДанные)Тогда
		
		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;

		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);
		
		ЗначениеВозврата = Неопределено;

		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение",
														ЭтотОбъект,
														Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий));
		
		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,
						ПараметрыФормыУказанияСерий,
						ЭтаФорма
						,
						,
						,
						,
						ОписаниеОповещения,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура Лико_ЗарезервироватьПодКлиентаПосле(Команда)
	
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		ГлЛико_Оператор=СотрудникПоF2НаСервере();		
	КонецЕсли;

	
	Если Не Объект.Проведен Тогда
		
		ПоказатьПредупреждение(,"Документ должен быть проведен!");		
		Возврат; 	
		
	КонецЕсли; 
	
	 		
	Партнер = Объект.Отправитель;
	
	Если ТипЗнч(Партнер)<> Тип("СправочникСсылка.Партнеры") Тогда
		
		Партнер=Неопределено;
		
		Партнер =Ждать ВвестиЗначениеАсинх(ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"),"Укажите клиента");
		
	КонецЕсли;
	
	Если  Не ЗначениеЗаполнено(Партнер) Тогда
		Возврат;
	КонецЕсли;
	
	 Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(НСтр("ru = 'Зарезервировать материал?';"
         + " en = 'Do you want to continue?'"), Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Партнер",Партнер);
	ПараметрыЗаполнения.Вставить("Сотрудник",ГлЛико_Оператор);
	
	
	ПодготовитьМассивСерийСервер(ПараметрыЗаполнения);
	
		ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ПараметрыЗаполнения);
		
	
	
	ОписаниеОповещение= Новый ОписаниеОповещения("ЗарезервироватьПодКлиентаЗавершение",ЭтаФорма);
	ОткрытьФорму("Документ.Лико_УстановкаРезерваМатериалов.Форма.ФормаДокумента",ПараметрыФормы,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	

КонецПроцедуры 

&НаСервере
Процедура ПодготовитьМассивСерийСервер(ПараметрыЗаполнения) //+Лико m.shenderov 16.01.2023
    МассивСерий= Новый Массив;
	Для каждого Данные Из Объект.Товары Цикл
		
		ОбъектНоменклатуры=Данные.Серия.Яссм_ОбъектНоменклатуры;  
		
		Если Не  ОбъектНоменклатуры.Уникальный  Тогда
			Продолжить;
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ОбъектНоменклатуры.Номенклатура);
		Структура.Вставить("Характеристика",ОбъектНоменклатуры.Характеристика);
		Структура.Вставить("Упаковка",ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);
		Структура.Вставить("Серия",ОбъектНоменклатуры.Серия); 
		Структура.Вставить("СтатусУказанияСерий",8);
		Структура.Вставить("КоличествоУпаковок",ОбъектНоменклатуры.Количество);
		Структура.Вставить("Количество",ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);
		Структура.Вставить("АдресХранения",Объект.ЗонаПриемки);
		Структура.Вставить("ВидНастроечногоМатериала",ОбъектНоменклатуры.ВидНастроечногоМатериала); 		
		МассивСерий.Добавить(Структура);
		
	КонецЦикла; 
	ПараметрыЗаполнения.Вставить("МассивСерий",МассивСерий);
	

	
КонецПроцедуры  //-Лико m.shenderov 16.01.2023


  &НаКлиенте
Процедура ЗарезервироватьПодКлиентаЗавершение(прРезультат,прПараметры) Экспорт//+Лико m.shenderov 18/11/2019
	
	Элементы.Товары.Обновить();
		
КонецПроцедуры //-Лико m.shenderov 18/11/2019

&НаСервере
Функция СотрудникПоF2НаСервере()
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СотрудникПоF2",Неопределено);
		
КонецФункции


&НаКлиенте
Процедура Лико_Лико_ДоговорАвтоПодборВместо(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	СЗ = Новый СписокЗначений;
	
	СЗ.ЗагрузитьЗначения(ПолучитьПодборДоговоровСервер(Текст,Объект.Распоряжение));
	ДанныеВыбора=СЗ;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПодборДоговоровСервер(Текст,Распоряжение) //+Лико m.shenderov 18.04.2023
     Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ ПЕРВЫЕ 10
	 |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 |ГДЕ
	 |	ДоговорыКонтрагентов.Контрагент = &Контрагент
	 |	И ДоговорыКонтрагентов.Наименование ПОДОБНО &Наименование
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ДоговорыКонтрагентов.Дата УБЫВ";
	 Запрос.УстановитьПараметр("Контрагент",Распоряжение.Контрагент );
	 Запрос.УстановитьПараметр("Наименование","%"+Текст+"%" );
	 
Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	 
	    
	
КонецФункции  //-Лико m.shenderov 18.04.2023


&НаКлиенте
Процедура Лико_ТоварыЛико_ЦенаПриИзмененииПосле(Элемент)
	Лико_ПересчитатьСуммуИЦену("Цена");
КонецПроцедуры


&НаКлиенте
Процедура Лико_ТоварыЛико_СуммаПриИзмененииПосле(Элемент)
	Лико_ПересчитатьСуммуИЦену("Сумма");

КонецПроцедуры


&НаКлиенте
Процедура Лико_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	Лико_ПересчитатьСуммуИЦену("Количество");

КонецПроцедуры 

&НаКлиенте
Процедура Лико_ПересчитатьСуммуИЦену(Тип)
	ТД = Элементы.Товары.ТекущиеДанные;
	
	Если Тип ="Цена" Или Тип ="Количество"  Тогда
		ТД.Лико_Сумма =  ТД.Лико_Цена*Тд.Количество;
	КонецЕсли;
	
	Если Тип ="Сумма" Тогда
		ТД.Лико_Цена =  ТД.Лико_Сумма/Тд.Количество;
	КонецЕсли; 	
	
КонецПроцедуры



