#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИсточникиКатегорийДляМаркетплейса.ВидНоменклатуры"), НСтр("ru = 'Вид номенклатуры';
																															|en = 'Product kind'"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИсточникиКатегорийДляМаркетплейса.ИерархияНоменклатуры"), НСтр("ru = 'Иерархия номенклатуры';
																																|en = 'Items hierarchy'"));

	Если ПолучитьФункциональнуюОпцию("ИспользоватьТоварныеКатегории") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИсточникиКатегорийДляМаркетплейса.ТоварнаяКатегория"), НСтр("ru = 'Товарная категория';
																																|en = 'Product category'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли