
Функция Get(Запрос)
КонецФункции

Функция Post(Запрос)
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;      
		ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
		ПараметрыPOST = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		Возврат HttpВернутьОшибку(400, "Необходимо передать параметр 'ProcName'");
	КонецПопытки;
	
	Если ЕстьСвойство(ПараметрыPOST, "Debug") И ПараметрыPOST.Debug = 1 Тогда
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Liko_Rest: Post'"),
		УровеньЖурналаРегистрации.Предупреждение,,,
		"Тело запроса: " + ТелоЗапроса);
	КонецЕсли;
	
	Если ЕстьСвойство(ПараметрыPOST, "ProcName") Тогда
		Возврат ВызовМетода(ПараметрыPOST.ProcName, ПараметрыPOST);
	КонецЕсли;
	
	Возврат HttpВернутьОшибку(400, "Необходимо передать параметр 'ProcName'");
КонецФункции

#Область REST_функции
  
Функция Users(ПараметрыPOST)
	Запрос1c = Новый Запрос;
	Запрос1c.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПользователиКонтактнаяИнформация.Ссылка КАК Ref,
	|	ПользователиКонтактнаяИнформация.Ссылка.Наименование КАК Name,
	|	""0000-0000-0000-0000-0000-0000-0000-0000"" КАК UserOS,
	|	""0000-0000-0000-0000-0000-0000-0000-0000"" КАК Guid,
	|	ПользователиКонтактнаяИнформация.АдресЭП КАК Mail
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Вид = &Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Наименование КАК Name,
	|	Пользователи.Ссылка КАК Ref,
	|	""0000-0000-0000-0000-0000-0000-0000-0000"" КАК UserOS,
	|	""0000-0000-0000-0000-0000-0000-0000-0000"" КАК Guid,
	|	ЕСТЬNULL(ВременнаяТаблица.Mail, """") КАК Mail
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (ВременнаяТаблица.Ref = Пользователи.Ссылка)
	|ГДЕ
	|	Пользователи.Наименование <> """"
	|	И Пользователи.Наименование <> ""<Не указан>""";
	
	Запрос1c.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.EmailПользователя);	
	Тз = Запрос1c.Выполнить().Выгрузить();
	
	Для каждого СтрТЗ Из Тз Цикл 		
		СвойстваПользователя	=	Пользователи.СвойстваПользователяИБ(СтрТЗ.Name); 		
		
		СтрТЗ.Guid=СтрТЗ.Ref.УникальныйИдентификатор();	
		СтрТЗ.UserOS="";
		Если СвойстваПользователя<>Неопределено Тогда 
			СтрТЗ.UserOS 	= 	СвойстваПользователя.ПользовательОС;			 
		КонецЕсли;		
	КонецЦикла;  
	
	Тз.Колонки.Удалить(1);
	
	//Если ЕстьСвойство(ПараметрыPOST, "UserOS") Тогда
	//	UserOS = ПараметрыPOST.UserOS;
	//	Запрос1с2 = Новый Запрос;
	//	Запрос1с2.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ТЗ.UserOS КАК UserOS,
	//	|	ТЗ.Name КАК Name,
	//	|	ТЗ.Guid КАК Mail,
	//	|	ТЗ.Guid КАК Guid
	//	|ПОМЕСТИТЬ Вт
	//	|ИЗ
	//	|	&ТЗ КАК ТЗ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	Вт.UserOS КАК UserOS,
	//	|	Вт.Name КАК Name,
	//	|	Вт.Mail КАК Mail,
	//	|	Вт.Guid КАК Guid
	//	|ИЗ
	//	|	Вт КАК Вт
	//	|ГДЕ
	//	|	Вт.UserOS ПОДОБНО &UserOS";
	//	Запрос1с2.УстановитьПараметр("ТЗ",Тз);
	//	Запрос1с2.УстановитьПараметр("UserOS","%"+UserOS+"%");
	//	Тз = Запрос1с2.Выполнить().Выгрузить();		
	//КонецЕсли;	
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
КонецФункции

Функция UserAccess(ПараметрыPOST)
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	UserOS = ПараметрыPOST.UserOS;		
	Пользователь=ПолучитьПользователя(UserOS);
	ДоступКСайту=УправлениеСвойствами.ЗначениеСвойства(Пользователь,"Лико_ДоступКСайту");
	ТЗ = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("Access", Новый ОписаниеТипов("Булево"));
	СтрТз=Тз.Добавить();
	СтрТз.Access=ЗначениеЗаполнено(ДоступКСайту);
	Возврат HttpВернутьТзКакJSON(ТЗ);	
КонецФункции

Функция GetToken(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserOS");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	UserOS 			= ПараметрыPOST.UserOS;		
	Пользователь	= ПолучитьПользователя(UserOS);
	
	Структура = Новый Структура;
	Структура.Вставить("Token",Лико_HTTP_Сервер.GetToken(Пользователь));
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(Структура));
	
КонецФункции

Функция ProdSiteList(ПараметрыPOST)
	////УстановитьПривилегированныйРежим(Истина);
	
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПользователиЛико_Площадки.Организация.Наименование КАК SiteName,
	|	ПользователиЛико_Площадки.Организация.ИНН КАК SiteInn
	|ИЗ
	|	Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|ГДЕ
	|	ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь";
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователь);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//ТЗ = Новый ТаблицаЗначений;
	//Тз.Колонки.Добавить("SiteName", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	//Тз.Колонки.Добавить("SiteInn", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	//
	//СтрТз=Тз.Добавить();
	//СтрТз.SiteName=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра.Наименование;
	//СтрТз.SiteInn=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра.ИНН;
	//
	//СтрТз=Тз.Добавить();
	//СтрТз.SiteName=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра.Наименование;
	//СтрТз.SiteInn=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра.ИНН;
	//
	//СтрТз=Тз.Добавить();
	//СтрТз.SiteName=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра.Наименование;
	//СтрТз.SiteInn=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра.ИНН;
	//
	//СтрТз=Тз.Добавить();
	//СтрТз.SiteName=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра.Наименование;
	//СтрТз.SiteInn=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра.ИНН;
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции                                 

Функция SectionsAccess(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	UserOS = ПараметрыPOST.UserOS;		
	Пользователь = ПолучитьПользователя(UserOS);
	ТЗ = Новый ТаблицаЗначений; 
	Тз.Колонки.Добавить("Access", Новый ОписаниеТипов("Булево"));
	Тз.Колонки.Добавить("Section", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
	
	СвойстваПользователя	=	ПолучитьСписокРолей(Пользователь);	
	
	Если Не ЗначениеЗаполнено(СвойстваПользователя) Тогда		
		Возврат HttpВернутьТзКакJSON(ТЗ); 		
	КонецЕсли;
	
	СтрТз=Тз.Добавить();
	СтрТз.Section="Показатели";
	СтрТз.Access=СвойстваПользователя.Найти("Лико_ДоступКРазделуСайтаПоказатели")<>Неопределено;
	
	СтрТз=Тз.Добавить();
	СтрТз.Section="ПланированиеРЦ";
	СтрТз.Access=СвойстваПользователя.Найти("Лико_ДоступКРазделуСайтаПланированиеРЦ")<>Неопределено;
	
	СтрТз=Тз.Добавить();
	СтрТз.Section="СостояниеМашин";
	СтрТз.Access=СвойстваПользователя.Найти("Лико_ДоступКРазделуСайтаСостояниеМашин")<>Неопределено;
	
	СтрТз=Тз.Добавить();
	СтрТз.Section="ОстаткиСГП";
	СтрТз.Access=СвойстваПользователя.Найти("Лико_ДоступКРазделуСайтаОстакткиСГП")<>Неопределено;
	
	СтрТз=Тз.Добавить();
	СтрТз.Section="Продажи";
	СтрТз.Access=СвойстваПользователя.Найти("Лико_ДоступКРазделуСайтаПродажи")<>Неопределено;
	
	СтрТз=Тз.Добавить();
	СтрТз.Section="Отгрузки";
	СтрТз.Access=СвойстваПользователя.Найти("Лико_ДоступКРазделуСайтаОтгрузки")<>Неопределено;
	
	СтрТз=Тз.Добавить();
	СтрТз.Section="Отчеты";
	СтрТз.Access=СвойстваПользователя.Найти("Лико_ДоступКРазделуСайтаОтчеты")<>Неопределено;
	
	
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции

Функция ReportAccess(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	UserOS = ПараметрыPOST.UserOS;		
	Пользователь=ПолучитьПользователя(UserOS);
	Если Пользователь=Неопределено Тогда
		Пользователь=Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	ТЗ =ПолучитьДоступныеОтчеты(Пользователь);	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции



Функция WRP(ПараметрыPOST)
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;
	

	
	Если Пользователь.Лико_Площадки.Количество() <3  Тогда
		Если SiteInn="" Тогда 
			//SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН;
			Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка;
			
		//ИначеЕсли SiteInn<> Пользователь.Лико_Площадки[0].Организация.ИНН Тогда 
			ИначеЕсли Лико_Площадка<> Пользователь.Лико_Площадки[0].Площадка Тогда 
			Возврат HttpВернутьОшибку(403, "Данные по площадке не доступны");						
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрыPOST.Свойство("Manager") Тогда
		Manager="";
	Иначе
		Manager    = ПараметрыPOST.Manager;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Manager",Manager);
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
	Если ЕстьСвойство(ПараметрыPOST, "PartnerCode") Тогда 
		
		PartnerCode = ПараметрыPOST.PartnerCode;
		
		Если Не ЕстьСвойство(ПараметрыPOST, "Period") Тогда
			Period=1;
		Иначе
			Period=Число(ПараметрыPOST.Period);
		КонецЕсли;
		
		#Область Запрос_остатков_СГП_по_отдельному_клиенту_и_периоду
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(ТоварыНаСкладахОстатки.Серия.Лико_ДатаВыпуска) КАК ДатаВыпуска,
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыНаСкладахОстатки.Серия) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
		|				И Характеристика.Лико_ЗаказНоменклатуры.Партнер.Код = &ПартнерКод
		|				И Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|				И Склад.Наименование <> ""Не ордерный""
		|				И ВЫБОР
		|					КОГДА &Лико_Площадка = """"
		|						ТОГДА ИСТИНА
		//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
		|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Manager = """"
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Менеджер.Наименование = &Manager
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				Ячейка В
		|					(ВЫБРАТЬ
		|						СкладыДополнительныеРеквизиты.Значение КАК Ячейка
		|					ИЗ
		|						Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|					ГДЕ
		|						СкладыДополнительныеРеквизиты.Свойство.Имя = ""ЯчейкаРастарка""
		|					СГРУППИРОВАТЬ ПО
		|						СкладыДополнительныеРеквизиты.Значение)) КАК ТоварыВЯчейкахОстатки
		|		ПО ТоварыНаСкладахОстатки.Серия = ТоварыВЯчейкахОстатки.Серия
		|			И ТоварыНаСкладахОстатки.Склад = ТоварыВЯчейкахОстатки.Ячейка.Владелец
		|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|	И ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры,
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Период,
		|	ВТОстатки.Заказ КАК Заказ,
		|	СУММА(ВТОстатки.Количество) КАК Количество,
		|	ВТОстатки.Склад КАК Склад,
		|	ВТОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ВТОстатки.КоличествоКоробок) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТОстаткиПериод
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НомерПериода = 0
		|				ТОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			КОГДА &НомерПериода = 1
		|				ТОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|						И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			КОГДА &НомерПериода = 2
		|				ТОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|						И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			КОГДА &НомерПериода = 3
		|				ТОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстатки.Заказ,
		|	ВТОстатки.Склад,
		|	ВТОстатки.Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ
		|ПОМЕСТИТЬ ВТОстаткиНеОрдерные
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
		|				И НЕ Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|				И Характеристика.Лико_ЗаказНоменклатуры.Партнер.Код = &ПартнерКод
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|				И Склад.Наименование <> ""Не ордерный""
		|				И ВЫБОР
		|					КОГДА &Лико_Площадка = """"
		|						ТОГДА ИСТИНА
		//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
		|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Manager = """"
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Менеджер.Наименование = &Manager
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОбороты.Склад КАК Склад,
		|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
		|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(ТоварыНаСкладахОбороты.Период) КАК ПериодПрихода
		|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(
		|			,
		|			,
		|			День,
		|			Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|				И Склад.Наименование <> ""Не ордерный""
		|				И (Номенклатура, Характеристика.Лико_ЗаказНоменклатуры) В
		|					(ВЫБРАТЬ
		|						Т.Номенклатура,
		|						Т.Заказ
		|					ИЗ
		|						ВТОстаткиНеОрдерные КАК Т)) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.ВНаличииПриход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры,
		|	ТоварыНаСкладахОбороты.Номенклатура,
		|	ТоварыНаСкладахОбороты.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Номенклатура КАК Номенклатура,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ КАК Заказ,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад КАК Склад,
		|	ВЫБОР
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПериодПрихода
		|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
		|ИЗ
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НомерПериода = 0
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			КОГДА &НомерПериода = 1
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|						И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			КОГДА &НомерПериода = 2
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|						И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			КОГДА &НомерПериода = 3
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Номенклатура,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад,
		|	ВЫБОР
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТОстаткиПериод.Склад КАК Склад,
		|	ВТОстаткиПериод.Заказ КАК Заказ,
		|	ВТОстаткиПериод.Номенклатура КАК Номенклатура,
		|	ВТОстаткиПериод.Период КАК ДатаВыпуска,
		|	ВТОстаткиПериод.Количество КАК Количество,
		|	ВТОстаткиПериод.КоличествоКоробок КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТОстаткиПериод КАК ВТОстаткиПериод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ВТОстаткиНеОрдерные.Склад,
		|	ВТОстаткиНеОрдерные.Заказ,
		|	ВТОстаткиНеОрдерные.Номенклатура,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.ПериодПрихода,
		|	ВТОстаткиНеОрдерные.Количество,
		|	0
		|ИЗ
		|	ВТОстаткиНеОрдерные КАК ВТОстаткиНеОрдерные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
		|		ПО ВТОстаткиНеОрдерные.Склад = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Склад
		|			И ВТОстаткиНеОрдерные.Номенклатура = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Номенклатура
		|			И ВТОстаткиНеОрдерные.Заказ = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Заказ КАК Заказ,
		|	СУММА(ВТ.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТОстаткиПоЗаказам
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТОстаткиПоЗаказам.Заказ КАК Заказ,
		|	ВТОстаткиПоЗаказам.Количество КАК КоличествоОстатокПоЗаказу,
		|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК КоличествоВыпуск
		|ПОМЕСТИТЬ ВТВыпуск
		|ИЗ
		|	ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ВыпускГП.Обороты(
		|				,
		|				,
		|				,
		|				Заказ В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТОстаткиПоЗаказам.Заказ КАК Заказ
		|					ИЗ
		|						ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам)) КАК Лико_ВыпускГПОбороты
		|		ПО ВТОстаткиПоЗаказам.Заказ = Лико_ВыпускГПОбороты.Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстаткиПоЗаказам.Заказ,
		|	ВТОстаткиПоЗаказам.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТОстатки.Заказ.Партнер.Код КАК PartnerCode,
		|	ВТОстатки.Заказ.Партнер.Наименование КАК PartnerName,
		|	ЕСТЬNULL(ВТОстатки.Заказ.Менеджер.Наименование, """") КАК Manager,
		|	ВТОстатки.Заказ.НомерБезПрефикса КАК Order,
		|	ВТОстатки.Склад.Наименование КАК Stock,
		|	ВТОстатки.Номенклатура.Наименование КАК Nom,
		|	ВТОстатки.Заказ.ЦенаСредняя КАК Price,
		|	СУММА(ВТОстатки.КоличествоКоробок) КАК Places,
		|	СУММА(ВЫРАЗИТЬ(ВТОстатки.Количество КАК ЧИСЛО(15, 2))) КАК Quantity,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ВТОстатки.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
		|						И ВТОстатки.Заказ.ШтКВМ > 0
		|					ТОГДА ВТОстатки.Количество * 1000 / ВТОстатки.Заказ.ШтКВМ
		|				КОГДА ВТОстатки.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
		|					ТОГДА ВТОстатки.Количество * ВТОстатки.Заказ.Нарезка.Размер / 1000
		|				КОГДА ВТОстатки.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
		|					ТОГДА ВТОстатки.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК Square,
		|	СУММА(ВЫБОР
		|			КОГДА ВТОстатки.Заказ.СуммаДокумента > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТОстатки.Заказ.Тираж
		|							ТОГДА ВЫБОР
		|									КОГДА ВТОстатки.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
		|										ТОГДА ВЫРАЗИТЬ(ВТОстатки.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТОстатки.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						ИНАЧЕ ВЫРАЗИТЬ(ВТОстатки.Количество * ВТОстатки.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Cost,
		|	ВТОстатки.ДатаВыпуска КАК Date
		|ИЗ
		|	ВТ КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыпуск КАК ВТВыпуск
		|		ПО ВТОстатки.Заказ = ВТВыпуск.Заказ,
		|	Справочник.Лико_ПредопределенныеЗначения КАК ТысШт,
		|	Справочник.Лико_ПредопределенныеЗначения КАК ПМ,
		|	Справочник.Лико_ПредопределенныеЗначения КАК КВМ
		|ГДЕ
		|	ТысШт.ИмяПредопределенныхДанных = ""ЕИТысШт""
		|	И ПМ.ИмяПредопределенныхДанных = ""ЕИПогМетр""
		|	И КВМ.ИмяПредопределенныхДанных = ""ЕИКвадрМетр""
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстатки.Заказ.НомерБезПрефикса,
		|	ВТОстатки.Заказ.ЦенаСредняя,
		|	ВТОстатки.Склад.Наименование,
		|	ВТОстатки.Заказ.Партнер.Код,
		|	ВТОстатки.Заказ.Партнер.Наименование,
		|	ВТОстатки.Номенклатура.Наименование,
		|	ВТОстатки.ДатаВыпуска,
		|	ЕСТЬNULL(ВТОстатки.Заказ.Менеджер.Наименование, """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Cost УБЫВ";
		
		#КонецОбласти	
		
		
		Запрос.УстановитьПараметр("ПартнерКод", PartnerCode);
		Запрос.УстановитьПараметр("НомерПериода", Period);  		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Возврат HttpВернутьТзКакJSON(ТЗ);
	КонецЕсли;
	
	
	#Область Запрос_остатков_СГП_по_клиентам
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	МИНИМУМ(ТоварыНаСкладахОстатки.Серия.Лико_ДатаВыпуска) КАК ДатаВыпуска,
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
	|				И Склад.Наименование <> ""Не ордерный""
	|				И ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn 
	|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Manager = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Менеджер.Наименование = &Manager
	|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Ячейка В
	|					(ВЫБРАТЬ
	|						СкладыДополнительныеРеквизиты.Значение КАК Ячейка
	|					ИЗ
	|						Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|					ГДЕ
	|						СкладыДополнительныеРеквизиты.Свойство.Имя = ""ЯчейкаРастарка""
	|					СГРУППИРОВАТЬ ПО
	|						СкладыДополнительныеРеквизиты.Значение)) КАК ТоварыВЯчейкахОстатки
	|		ПО ТоварыНаСкладахОстатки.Серия = ТоварыВЯчейкахОстатки.Серия
	|			И ТоварыНаСкладахОстатки.Склад = ТоварыВЯчейкахОстатки.Ячейка.Владелец
	|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
	|			И ТоварыНаСкладахОстатки.Назначение = ТоварыВЯчейкахОстатки.Назначение
	|			И ТоварыНаСкладахОстатки.Помещение = ТоварыВЯчейкахОстатки.Ячейка.Помещение
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры,
	|	ТоварыНаСкладахОстатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОстатки.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Период,
	|	СУММА(ВТОстатки.Количество) КАК Количество,
	|	ВТОстатки.Склад КАК Склад
	|ПОМЕСТИТЬ ВТОстаткиПериод
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстатки.Заказ,
	|	ВТОстатки.Склад,
	|	ВЫБОР
	|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад
	|ПОМЕСТИТЬ ВТОстаткиНеОрдерные
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
	|				И НЕ Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
	|				И Склад.Наименование <> ""Не ордерный""
	|				И ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn 
	|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Manager = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Менеджер.Наименование = &Manager
	|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры,
	|	ТоварыНаСкладахОстатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОбороты.Склад КАК Склад,
	|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	МИНИМУМ(ТоварыНаСкладахОбороты.Период) КАК ПериодПрихода
	|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			,
	|			,
	|			День,
	|			Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ
	|						Т.Заказ
	|					ИЗ
	|						ВТОстаткиНеОрдерные КАК Т)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
	|				И Склад.Наименование <> ""Не ордерный"") КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.ВНаличииПриход <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры,
	|	ТоварыНаСкладахОбороты.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад КАК Склад,
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ПериодПрихода
	|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
	|ИЗ
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад,
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОстатки.Заказ КАК Заказ,
	|	ВТОстатки.Период КАК Период,
	|	ВТОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТОстаткиПериод КАК ВТОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ВТОстаткиНеОрдерные.Заказ,
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.ПериодПрихода,
	|	ВТОстаткиНеОрдерные.Количество
	|ИЗ
	|	ВТОстаткиНеОрдерные КАК ВТОстаткиНеОрдерные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
	|		ПО ВТОстаткиНеОрдерные.Заказ = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Заказ
	|			И ВТОстаткиНеОрдерные.Склад = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Заказ КАК Заказ,
	|	СУММА(ВТ.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиПоЗаказам
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК КоличествоВыпуск,
	|	ВТОстаткиПоЗаказам.Количество КАК КоличествоОстатокПоЗаказу
	|ПОМЕСТИТЬ ВТВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			,
	|			,
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ.Заказ КАК Заказ
	|				ИЗ
	|					ВТ КАК ВТ)) КАК Лико_ВыпускГПОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам
	|		ПО Лико_ВыпускГПОбороты.Заказ = ВТОстаткиПоЗаказам.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	ВТОстаткиПоЗаказам.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Заказ.Партнер.Наименование КАК PartnerName,
	|	ВТ.Заказ.Партнер.Код КАК PartnerCode,
	|	СУММА(ВЫРАЗИТЬ(ВТ.Количество КАК ЧИСЛО(15, 2))) КАК Quantity,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|						И ВТ.Заказ.ШтКВМ > 0
	|					ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|				КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|					ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|				КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|					ТОГДА ВТ.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК Square,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Заказ.СуммаДокумента > 0
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|										ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Cost,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 0
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month1,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month2,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 3
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month3,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 0
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 1
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square1,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 2
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square2,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 3
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square3,
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Наименование, """") КАК Manager,
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Подразделение.Наименование, """") КАК Region
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыпуск КАК ВТВыпуск
	|		ПО ВТ.Заказ = ВТВыпуск.Заказ,
	|	Справочник.Лико_ПредопределенныеЗначения КАК ТысШт,
	|	Справочник.Лико_ПредопределенныеЗначения КАК ПМ,
	|	Справочник.Лико_ПредопределенныеЗначения КАК КВМ
	|ГДЕ
	|	ТысШт.ИмяПредопределенныхДанных = ""ЕИТысШт""
	|	И ПМ.ИмяПредопределенныхДанных = ""ЕИПогМетр""
	|	И КВМ.ИмяПредопределенныхДанных = ""ЕИКвадрМетр""
	|	И НЕ ВТ.Заказ.Партнер.Наименование ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Заказ.Партнер.Наименование,
	|	ВТ.Заказ.Партнер.Код,
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Наименование, """"),
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Подразделение.Наименование, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ"   ;
	
	#КонецОбласти	
	
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции  


Функция WRM(ПараметрыPOST)
		
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//Запрос.УстановитьПараметр("Manager",Manager);
	
		
//Остатки на складах Материалы
#Область  Остатки_На_складах_Материалы
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Организация.Наименование, """") КАК OrganizationName,
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Организация.ИНН, """") КАК OrganizationCode,
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Вид, """") КАК kind,
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Тип, """") КАК Group,
	|	СУММА(ВЫРАЗИТЬ(Лико_ОстаткиМатериаловДляСайта.Количество КАК ЧИСЛО(15, 0))) КАК quantity,
	|	СУММА(ВЫРАЗИТЬ(Лико_ОстаткиМатериаловДляСайта.Стоимость КАК ЧИСЛО(15, 0))) КАК Cost,
	|	СУММА(ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Аванс, 0)) КАК Advance
	|ИЗ
	|	РегистрСведений.Лико_ОстаткиМатериаловДляСайта КАК Лико_ОстаткиМатериаловДляСайта
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Организация.Наименование, """"),
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Организация.ИНН, """"),
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Вид, """"),
	|	ЕСТЬNULL(Лико_ОстаткиМатериаловДляСайта.Тип, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ";

	
#КонецОбласти

	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции  


Функция WRMDetailПлощадка(ПараметрыPOST)
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "OrganizationCode, Kind, Group");
	Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыPOST.OrganizationCode));

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//Запрос.УстановитьПараметр("OrganizationCode", ПараметрыPOST.OrganizationCode);
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
    Запрос.УстановитьПараметр("Kind", ПараметрыPOST.Kind);
	Запрос.УстановитьПараметр("Group",ПараметрыPOST.Group); 
	
	
	
		
//Остатки на складах Материалы расшифровка
#Область  Остатки_На_складах_Материалы_Расшифровка
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Ячейка.Лико_Организация КАК Организация,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель / ТоварыВЯчейкахОстатки.Упаковка.Знаменатель) КАК ОстатокВЯчейках
	|ПОМЕСТИТЬ ВТОстаткиВЯчейках
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			&Дата,
	|			ВЫБОР
	|					КОГДА &kind = ""Рулонные материалы""
	|						ТОГДА Номенклатура.ВидНоменклатуры.Наименование В (&kind, ""Переработка"", ""Полуфабрикаты"")
	|					ИНАЧЕ Номенклатура.ВидНоменклатуры.Наименование = &kind
	|				КОНЕЦ
	|				И &kind В (""Рулонные материалы"", ""Краска"")
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Ячейка.Лико_Площадка = &Лико_Площадка
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул В (""МатериалВид"", ""КраскаВидПечати""))
	|			И (НоменклатураДополнительныеРеквизиты.Значение.Наименование = &GRoup)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка.Лико_Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСписокНом
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""ЗапчастиОснасткаВид""
	|	И НоменклатураДополнительныеРеквизиты.Значение.Наименование = &Group
	|	И НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры.Наименование = ""Запчасти Оснастка""
	|	И &kind = ""Запчасти Оснастка""
	|	И НЕ НоменклатураДополнительныеРеквизиты.Ссылка.ЦеноваяГруппа В (ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Clicks), ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Clicks_Расходка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЦеноваяГруппа.Наименование = &Group
	|	И &kind В (""Краска"", ""Скотч"", ""Упаковочные материалы"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.Организация КАК Организация,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория КАК Склад
	|ПОМЕСТИТЬ ВТОстаткиВЯчейкахКлики
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			&Дата,
	|			АналитикаУчетаНоменклатуры.Номенклатура В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТСписокНом.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТСписокНом КАК ВТСписокНом)
	|				И ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И НЕ АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ПомещениеБрака) КАК ТоварыОрганизацийОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрганизацийОстатки.Организация,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиВЯчейкахКлики.Организация КАК Организация,
	|	ВТОстаткиВЯчейкахКлики.Номенклатура КАК Номенклатура,
	|	ВТОстаткиВЯчейкахКлики.КоличествоОстаток КАК КоличествоОстаток,
	|	МАКСИМУМ(ВЫРАЗИТЬ(СтоимостьТоваровСрезПоследних.Стоимость КАК ЧИСЛО(15, 2))) КАК Цена
	|ПОМЕСТИТЬ ВТКликиСЦенами
	|ИЗ
	|	ВТОстаткиВЯчейкахКлики КАК ВТОстаткиВЯчейкахКлики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров.СрезПоследних(
	|				&Дата,
	|				РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|					И АналитикаУчетаНоменклатуры.Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВТСписокНом.Ссылка КАК Ссылка
	|						ИЗ
	|							ВТСписокНом КАК ВТСписокНом)
	|					И АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_Площадка = &Лико_Площадка) КАК СтоимостьТоваровСрезПоследних
	|		ПО ВТОстаткиВЯчейкахКлики.Организация = СтоимостьТоваровСрезПоследних.Организация
	|			И ВТОстаткиВЯчейкахКлики.Номенклатура = СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТОстаткиВЯчейкахКлики.Склад = СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстаткиВЯчейкахКлики.Организация,
	|	ВТОстаткиВЯчейкахКлики.Номенклатура,
	|	ВТОстаткиВЯчейкахКлики.КоличествоОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Номенклатура КАК Номенклатура,
	|	СУММА(Лико_ЗаказыПоставщиковПриходыОплаты.СуммаОстатокВВалютеУпр) КАК ЗаказаноОплаченоВВалютеУпр,
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТЗаказаноОплачено
	|ИЗ
	|	РегистрСведений.Лико_ЗаказыПоставщиковПриходыОплаты КАК Лико_ЗаказыПоставщиковПриходыОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Номенклатура,
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ВидНоменклатуры.Наименование, """") КАК kind,
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение.Наименование, """") КАК Sort,
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ЦеноваяГруппа.Код, """") КАК PriceCurrencyCode,
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Наименование, """") КАК NomName,
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Код, """") КАК NomCode,
	|	СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках КАК ЧИСЛО(15, 2)), 0)) КАК quantity,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""978""
	|					ТОГДА ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2))
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""643""
	|					ТОГДА ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|			КОНЕЦ, 0)) КАК Cost,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта.Наименование, """") КАК Сurrency,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""978""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2))
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""643""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|		КОНЕЦ, 0) КАК Price,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК PriceSupplier,
	|	СУММА(ЕСТЬNULL(ВТЗаказаноОплачено.ЗаказаноОплаченоВВалютеУпр, 0)) КАК Advance
	|ИЗ
	|	ВТОстаткиВЯчейках КАК ВТОстаткиВЯчейках
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&Дата, ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ЦенаПоставщика)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	|			ПО Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ПО ВТОстаткиВЯчейках.Номенклатура.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|			И ВТОстаткиВЯчейках.Организация = Лико_ЦеныГруппНоменклатурыСрезПоследних.Площадка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ВТОстаткиВЯчейках.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул В (""МатериалПоверхность"", ""КраскаВид""))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказаноОплачено КАК ВТЗаказаноОплачено
	|		ПО ВТОстаткиВЯчейках.Номенклатура = ВТЗаказаноОплачено.Номенклатура
	|			И ВТОстаткиВЯчейках.Организация.Наименование = ВТЗаказаноОплачено.Организация,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта.Наименование = ""EUR"") КАК КурсыВалютСрезПоследних1
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ВидНоменклатуры.Наименование, """"),
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение.Наименование, """"),
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Наименование, """"),
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Код, """"),
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ЦеноваяГруппа.Код, """"),
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта.Наименование, """"),
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""978""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2))
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""643""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|		КОНЕЦ, 0),
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ВЫБОР
	|		КОГДА ВТКликиСЦенами.Номенклатура.ЦеноваяГруппа В (ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Clicks), ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.CLICKS_Расходка))
	|			ТОГДА ""Краска""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.ЦеноваяГруппа.Наименование, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.ЦеноваяГруппа.Код, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.Наименование, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.Код, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.КоличествоОстаток, 0),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТКликиСЦенами.Цена, 0) * ЕСТЬNULL(ВТКликиСЦенами.КоличествоОстаток, 0) КАК ЧИСЛО(15, 0)),
	|	""EUR"",
	|	ЕСТЬNULL(ВТКликиСЦенами.Цена, 0),
	|	ЕСТЬNULL(ВТКликиСЦенами.Цена, 0),
	|	ЕСТЬNULL(ВТЗаказаноОплачено.ЗаказаноОплаченоВВалютеУпр, 0)
	|ИЗ
	|	ВТКликиСЦенами КАК ВТКликиСЦенами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказаноОплачено КАК ВТЗаказаноОплачено
	|		ПО ВТКликиСЦенами.Организация.Наименование = ВТЗаказаноОплачено.Организация
	|			И ВТКликиСЦенами.Номенклатура = ВТЗаказаноОплачено.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ" ;
#КонецОбласти



	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции  

Функция WRMDetail(ПараметрыPOST)
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "OrganizationCode, Kind, Group");
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("OrganizationCode", ПараметрыPOST.OrganizationCode);
    Запрос.УстановитьПараметр("Kind", ПараметрыPOST.Kind);
	Запрос.УстановитьПараметр("Group",ПараметрыPOST.Group);
	
		
//Остатки на складах Материалы расшифровка
#Область  Остатки_На_складах_Материалы_Расшифровка
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Ячейка.Лико_Организация КАК Организация,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель / ТоварыВЯчейкахОстатки.Упаковка.Знаменатель) КАК ОстатокВЯчейках
	|ПОМЕСТИТЬ ВТОстаткиВЯчейках
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			&Дата,
	|			ВЫБОР
	|					КОГДА &kind = ""Рулонные материалы""
	|						ТОГДА Номенклатура.ВидНоменклатуры.Наименование В (&kind, ""Переработка"", ""Полуфабрикаты"")
	|					ИНАЧЕ Номенклатура.ВидНоменклатуры.Наименование = &kind
	|				КОНЕЦ
	|				И &kind В (""Рулонные материалы"", ""Краска"")
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И ВЫБОР
	|					КОГДА &OrganizationCode = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Ячейка.Лико_Организация.ИНН = &OrganizationCode
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул В (""МатериалВид"", ""КраскаВидПечати""))
	|			И (НоменклатураДополнительныеРеквизиты.Значение.Наименование = &GRoup)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка.Лико_Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСписокНом
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""ЗапчастиОснасткаВид""
	|	И НоменклатураДополнительныеРеквизиты.Значение.Наименование = &Group
	|	И НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры.Наименование = ""Запчасти Оснастка""
	|	И &kind = ""Запчасти Оснастка""
	|	И НЕ НоменклатураДополнительныеРеквизиты.Ссылка.ЦеноваяГруппа В (ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Clicks), ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Clicks_Расходка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЦеноваяГруппа.Наименование = &Group
	|	И &kind В (""Краска"", ""Скотч"", ""Упаковочные материалы"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.Организация КАК Организация,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория КАК Склад
	|ПОМЕСТИТЬ ВТОстаткиВЯчейкахКлики
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			&Дата,
	|			АналитикаУчетаНоменклатуры.Номенклатура В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТСписокНом.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТСписокНом КАК ВТСписокНом)
	|				И ВЫБОР
	|					КОГДА &OrganizationCode = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация.ИНН = &OrganizationCode
	|				КОНЕЦ
	|				И НЕ АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ПомещениеБрака) КАК ТоварыОрганизацийОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрганизацийОстатки.Организация,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиВЯчейкахКлики.Организация КАК Организация,
	|	ВТОстаткиВЯчейкахКлики.Номенклатура КАК Номенклатура,
	|	ВТОстаткиВЯчейкахКлики.КоличествоОстаток КАК КоличествоОстаток,
	|	МАКСИМУМ(ВЫРАЗИТЬ(СтоимостьТоваровСрезПоследних.Стоимость КАК ЧИСЛО(15, 2))) КАК Цена
	|ПОМЕСТИТЬ ВТКликиСЦенами
	|ИЗ
	|	ВТОстаткиВЯчейкахКлики КАК ВТОстаткиВЯчейкахКлики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров.СрезПоследних(
	|				&Дата,
	|				РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|					И АналитикаУчетаНоменклатуры.Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВТСписокНом.Ссылка КАК Ссылка
	|						ИЗ
	|							ВТСписокНом КАК ВТСписокНом)
	|					И Организация.ИНН = &OrganizationCode) КАК СтоимостьТоваровСрезПоследних
	|		ПО ВТОстаткиВЯчейкахКлики.Организация = СтоимостьТоваровСрезПоследних.Организация
	|			И ВТОстаткиВЯчейкахКлики.Номенклатура = СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТОстаткиВЯчейкахКлики.Склад = СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстаткиВЯчейкахКлики.Организация,
	|	ВТОстаткиВЯчейкахКлики.Номенклатура,
	|	ВТОстаткиВЯчейкахКлики.КоличествоОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Номенклатура КАК Номенклатура,
	|	СУММА(Лико_ЗаказыПоставщиковПриходыОплаты.СуммаОстатокВВалютеУпр) КАК ЗаказаноОплаченоВВалютеУпр,
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТЗаказаноОплачено
	|ИЗ
	|	РегистрСведений.Лико_ЗаказыПоставщиковПриходыОплаты КАК Лико_ЗаказыПоставщиковПриходыОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Номенклатура,
	|	Лико_ЗаказыПоставщиковПриходыОплаты.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ВидНоменклатуры.Наименование, """") КАК kind,
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение.Наименование, """") КАК Sort,
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ЦеноваяГруппа.Код, """") КАК PriceCurrencyCode,
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Наименование, """") КАК NomName,
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Код, """") КАК NomCode,
	|	СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках КАК ЧИСЛО(15, 2)), 0)) КАК quantity,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""978""
	|					ТОГДА ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2))
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""643""
	|					ТОГДА ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|				ИНАЧЕ ВЫРАЗИТЬ(ВТОстаткиВЯчейках.ОстатокВЯчейках * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|			КОНЕЦ, 0)) КАК Cost,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта.Наименование, """") КАК Сurrency,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""978""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2))
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""643""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|		КОНЕЦ, 0) КАК Price,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК PriceSupplier,
	|	СУММА(ЕСТЬNULL(ВТЗаказаноОплачено.ЗаказаноОплаченоВВалютеУпр, 0)) КАК Advance
	|ИЗ
	|	ВТОстаткиВЯчейках КАК ВТОстаткиВЯчейках
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&Дата, ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ЦенаПоставщика)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	|			ПО Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ПО ВТОстаткиВЯчейках.Номенклатура.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|			И ВТОстаткиВЯчейках.Организация = Лико_ЦеныГруппНоменклатурыСрезПоследних.Площадка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ВТОстаткиВЯчейках.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул В (""МатериалПоверхность"", ""КраскаВид""))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказаноОплачено КАК ВТЗаказаноОплачено
	|		ПО ВТОстаткиВЯчейках.Номенклатура = ВТЗаказаноОплачено.Номенклатура
	|			И ВТОстаткиВЯчейках.Организация.Наименование = ВТЗаказаноОплачено.Организация,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта.Наименование = ""EUR"") КАК КурсыВалютСрезПоследних1
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ВидНоменклатуры.Наименование, """"),
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение.Наименование, """"),
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Наименование, """"),
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.Код, """"),
	|	ЕСТЬNULL(ВТОстаткиВЯчейках.Номенклатура.ЦеноваяГруппа.Код, """"),
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта.Наименование, """"),
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""978""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2))
	|			КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта.Код, """") = ""643""
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / КурсыВалютСрезПоследних1.Курс КАК ЧИСЛО(15, 2))
	|		КОНЕЦ, 0),
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ВЫБОР
	|		КОГДА ВТКликиСЦенами.Номенклатура.ЦеноваяГруппа В (ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Clicks), ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.CLICKS_Расходка))
	|			ТОГДА ""Краска""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.ЦеноваяГруппа.Наименование, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.ЦеноваяГруппа.Код, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.Наименование, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.Номенклатура.Код, """"),
	|	ЕСТЬNULL(ВТКликиСЦенами.КоличествоОстаток, 0),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТКликиСЦенами.Цена, 0) * ЕСТЬNULL(ВТКликиСЦенами.КоличествоОстаток, 0) КАК ЧИСЛО(15, 0)),
	|	""EUR"",
	|	ЕСТЬNULL(ВТКликиСЦенами.Цена, 0),
	|	ЕСТЬNULL(ВТКликиСЦенами.Цена, 0),
	|	ЕСТЬNULL(ВТЗаказаноОплачено.ЗаказаноОплаченоВВалютеУпр, 0)
	|ИЗ
	|	ВТКликиСЦенами КАК ВТКликиСЦенами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказаноОплачено КАК ВТЗаказаноОплачено
	|		ПО ВТКликиСЦенами.Организация.Наименование = ВТЗаказаноОплачено.Организация
	|			И ВТКликиСЦенами.Номенклатура = ВТЗаказаноОплачено.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ" ;
#КонецОбласти



	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции  


Функция OrdersSuppliers(ПараметрыPOST)
		
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	//Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//Запрос.УстановитьПараметр("Manager",Manager);
	
		
//Заказы поставщикам с оплатами 
#Область  ЗаказыПоставщикамСОплатами
Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	|	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК Сумма,
	|	ЗаказПоставщикуТовары.Ссылка.Договор КАК Договор
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовПоставщикам КАК СостоянияЗаказовПоставщикам
	|		ПО ЗаказПоставщикуТовары.Ссылка = СостоянияЗаказовПоставщикам.Заказ
	|			И (СостоянияЗаказовПоставщикам.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовПоставщикам.Закрыт))
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Лико_Предзаказ
	|	И СостоянияЗаказовПоставщикам.Заказ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Ссылка.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказы.Договор КАК Договор,
	|	СУММА(ВТЗаказы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТСуммыДоговоров
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаказы.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОбороты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	СУММА(РасчетыСПоставщикамиОбороты.СуммаПриход) КАК Сумма
	|ПОМЕСТИТЬ ВТОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(
	|			{(&ДатаНачала)},
	|			{(&ДатаОкончания)},
	|			,
	|			АналитикаУчетаПоПартнерам.Договор В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТЗаказы.Договор КАК Договор
	|				ИЗ
	|					ВТЗаказы КАК ВТЗаказы
	|				ГДЕ
	|					НЕ ВТЗаказы.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))) КАК РасчетыСПоставщикамиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОбороты.АналитикаУчетаПоПартнерам.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.ЗаказПоставщику.Договор КАК Договор,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.Номенклатура КАК Номенклатура,
	|	СУММА(Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.КоличествоРасход) КАК Количество,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.ЗаказПоставщику.Лико_Основание КАК Предзаказ,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.ЗаказПоставщику КАК ЗаказПоставщику
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКПоступлениюПоЗаказамПоставщику.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказПоставщику.Договор В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТЗаказы.Договор КАК Договор
	|				ИЗ
	|					ВТЗаказы КАК ВТЗаказы)) КАК Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты
	|ГДЕ
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.КоличествоРасход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.ЗаказПоставщику.Договор,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.Номенклатура,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.ЗаказПоставщику.Лико_Основание,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОбороты.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказы.Номенклатура.Код КАК NomCode,
	|	ВТЗаказы.Номенклатура.Наименование КАК NomName,
	|	ЕСТЬNULL(ВТЗаказы.Договор.Наименование, """") КАК Contract,
	|	ВТЗаказы.Количество - ЕСТЬNULL(ВТПриходы.Количество, 0) КАК Quantity,
	|	ВТЗаказы.Сумма / ВТЗаказы.Количество * (ВТЗаказы.Количество - ЕСТЬNULL(ВТПриходы.Количество, 0)) КАК Cost,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТОплаты.Сумма, 0) * ВТЗаказы.Сумма / ВТСуммыДоговоров.Сумма / ВТЗаказы.Количество * (ВТЗаказы.Количество - ЕСТЬNULL(ВТПриходы.Количество, 0)) КАК ЧИСЛО(15, 2)) КАК Paid,
	|	ВТЗаказы.Ссылка.Партнер.Наименование КАК SupplierName,
	|	ВТЗаказы.Ссылка.Партнер.Код КАК SupplierCode
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСуммыДоговоров КАК ВТСуммыДоговоров
	|		ПО ВТЗаказы.Договор = ВТСуммыДоговоров.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	|		ПО ВТЗаказы.Договор = ВТОплаты.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК ВТПриходы
	|		ПО ВТЗаказы.Номенклатура = ВТПриходы.Номенклатура
	|			И ВТЗаказы.Ссылка = ВТПриходы.Предзаказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	SupplierName,
	|	Cost УБЫВ" ;
#КонецОбласти


	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции  




Функция ShipmentsDailyAverage(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	
	Запрос = Новый Запрос;
#Область Среднедневные_Отгрузки_20210823
	Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МЕСЯЦ(Лико_ДанныеОтчетов.Период) КАК Month,
		|	Лико_ДанныеОтчетов.Площадка.ИНН КАК OrganizationCode,
		|	Лико_ДанныеОтчетов.Площадка.Наименование КАК OrganizationName,
		|	Лико_ДанныеОтчетов.Группа.Код КАК GroupCode,
		|	Лико_ДанныеОтчетов.Группа.Наименование КАК GroupName,
		|	Лико_ДанныеОтчетов.ЧислоДней КАК Days,
		|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Сумма КАК ЧИСЛО(15, 0))) КАК Sum,
		|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Площадь КАК ЧИСЛО(15, 0))) КАК Square,
		|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Стоимость КАК ЧИСЛО(15, 0))) КАК AverageEuro,
		|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Метраж КАК ЧИСЛО(15, 0))) КАК AverageM,
		|	СУММА(0) КАК Quantity
		|ИЗ
		|	РегистрСведений.Лико_ДанныеОтчетов КАК Лико_ДанныеОтчетов
		|ГДЕ
		|	Лико_ДанныеОтчетов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Лико_ДанныеОтчетов.ВидОтчета = ЗНАЧЕНИЕ(Справочник.Лико_ВидыОтчетов.ОтгрузкаСреднедневная)
		|
		|СГРУППИРОВАТЬ ПО
		|	МЕСЯЦ(Лико_ДанныеОтчетов.Период),
		|	Лико_ДанныеОтчетов.Площадка.ИНН,
		|	Лико_ДанныеОтчетов.Площадка.Наименование,
		|	Лико_ДанныеОтчетов.ЧислоДней,
		|	Лико_ДанныеОтчетов.Группа.Код,
		|	Лико_ДанныеОтчетов.Группа.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Month" ;

#КонецОбласти
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Дата(DateEnd)));
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	
	МассивВозврата = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
КонецФункции

Функция SalesDailyAverage(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	DateStart = ПараметрыPOST.DateStart;
	DateEnd = ПараметрыPOST.DateEnd;
		
		
	Запрос = Новый Запрос;
	
#Область Среднедневные_Продажи_ПоОплате
//По месяцам   Выручка+Расчеты с клиентами по документам
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МЕСЯЦ(Лико_ДанныеОтчетов.Период) КАК Month,
	|	Лико_ДанныеОтчетов.Площадка.ИНН КАК OrganizationCode,
	|	Лико_ДанныеОтчетов.Площадка.Наименование КАК OrganizationName,
	|	Лико_ДанныеОтчетов.Группа.Код КАК GroupCode,
	|	Лико_ДанныеОтчетов.Группа.Наименование КАК GroupName,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Сумма КАК ЧИСЛО(15, 0))) КАК Sum,
	|	Лико_ДанныеОтчетов.ЧислоДней КАК Days,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Стоимость КАК ЧИСЛО(15, 0))) КАК AverageEuro,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Площадь КАК ЧИСЛО(15, 0))) КАК Square,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Метраж КАК ЧИСЛО(15, 0))) КАК AverageM,
	|	СУММА(0) КАК Quantity,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.СуммаРегл КАК ЧИСЛО(15, 0))) КАК SumRub,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.СтоимостьРегл КАК ЧИСЛО(15, 0))) КАК AverageRub
	|ИЗ
	|	РегистрСведений.Лико_ДанныеОтчетов КАК Лико_ДанныеОтчетов
	|ГДЕ
	|	Лико_ДанныеОтчетов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Лико_ДанныеОтчетов.ВидОтчета = ЗНАЧЕНИЕ(Справочник.Лико_ВидыОтчетов.ПродажиСреднедневные)
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(Лико_ДанныеОтчетов.Период),
	|	Лико_ДанныеОтчетов.Площадка.ИНН,
	|	Лико_ДанныеОтчетов.Площадка.Наименование,
	|	Лико_ДанныеОтчетов.ЧислоДней,
	|	Лико_ДанныеОтчетов.Группа.Код,
	|	Лико_ДанныеОтчетов.Группа.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Month";

#КонецОбласти	
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Дата(DateEnd)));
		
	ТЗ = Запрос.Выполнить().Выгрузить();	
	
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
КонецФункции

Функция ProductionDailyAverage(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	DateStart = ПараметрыPOST.DateStart;
	DateEnd = ПараметрыPOST.DateEnd;
	
	Запрос = Новый Запрос;
#Область Среднедневный_Выпуск
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МЕСЯЦ(Лико_ДанныеОтчетов.Период) КАК Month,
	|	Лико_ДанныеОтчетов.Площадка.ИНН КАК OrganizationCode,
	|	Лико_ДанныеОтчетов.Площадка.Наименование КАК OrganizationName,
	|	Лико_ДанныеОтчетов.Группа.Код КАК GroupCode,
	|	Лико_ДанныеОтчетов.Группа.Наименование КАК GroupName,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Сумма КАК ЧИСЛО(15, 0))) КАК Sum,
	|	Лико_ДанныеОтчетов.ЧислоДней КАК Days,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Стоимость КАК ЧИСЛО(15, 0))) КАК AverageEuro,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Площадь КАК ЧИСЛО(15, 0))) КАК Square,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.Метраж КАК ЧИСЛО(15, 0))) КАК AverageM,
	|	СУММА(0) КАК Quantity,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.СуммаРегл КАК ЧИСЛО(15, 0))) КАК SumRub,
	|	СУММА(ВЫРАЗИТЬ(Лико_ДанныеОтчетов.СтоимостьРегл КАК ЧИСЛО(15, 0))) КАК AverageRub
	|ИЗ
	|	РегистрСведений.Лико_ДанныеОтчетов КАК Лико_ДанныеОтчетов
	|ГДЕ
	|	Лико_ДанныеОтчетов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Лико_ДанныеОтчетов.ВидОтчета = ЗНАЧЕНИЕ(Справочник.Лико_ВидыОтчетов.ВыпускСреднедневный)
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(Лико_ДанныеОтчетов.Период),
	|	Лико_ДанныеОтчетов.Площадка.ИНН,
	|	Лико_ДанныеОтчетов.Площадка.Наименование,
	|	Лико_ДанныеОтчетов.ЧислоДней,
	|	Лико_ДанныеОтчетов.Группа.Код,
	|	Лико_ДанныеОтчетов.Группа.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Month";
	
#КонецОбласти
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Дата(DateEnd)));
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
КонецФункции

Функция MoneyDailyAverage(ПараметрыPOST)
	УстановитьПривилегированныйРежим(Истина);

	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	SiteInn="";
	//Если Пользователь.Лико_Площадки.Количество() <3  Тогда
	//	SiteInn= Пользователь.Лико_Площадки[0].Площадка.ИНН;
	//КонецЕсли;
	
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	#Область ЕРП
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваБезналичные.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	|			ТОГДА &ДатаОкончания
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ДенежныеСредстваБезналичные.Период, МЕСЯЦ)
	|	КОНЕЦ КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА ДенежныеСредстваБезналичные.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	|				ТОГДА -ДенежныеСредстваБезналичные.СуммаУпр
	|			ИНАЧЕ ДенежныеСредстваБезналичные.СуммаУпр
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредстваБезналичные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ДенежныеСредстваБезналичные.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ДенежныеСредстваБезналичные.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДенежныеСредстваБезналичные.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту))
	|	И ПартнерыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА &SiteInn = """"
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДенежныеСредстваБезналичные.Организация.ИНН = &SiteInn
	|		КОНЕЦ
	|	И (ДенежныеСредстваБезналичные.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка В
	|				(ВЫБРАТЬ
	|					ПользователиЛико_Площадки.Площадка КАК Площадка
	|				ИЗ
	|					Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|				ГДЕ
	|					ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|			ИЛИ ДенежныеСредстваБезналичные.Организация В
	|				(ВЫБРАТЬ
	|					ПользователиЛико_Площадки.Площадка КАК Площадка
	|				ИЗ
	|					Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|				ГДЕ
	|					ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваБезналичные.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	|			ТОГДА &ДатаОкончания
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ДенежныеСредстваБезналичные.Период, МЕСЯЦ)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МЕСЯЦ(ВТДанные.Период) КАК Month,
	|	ВЫРАЗИТЬ(ВТДанные.Сумма КАК ЧИСЛО(15, 0)) КАК Sum,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТДанные.Период, МЕСЯЦ), ВТДанные.Период, ДЕНЬ) + 1 КАК Days,
	|	ВЫРАЗИТЬ(ВТДанные.Сумма / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТДанные.Период, МЕСЯЦ), ВТДанные.Период, ДЕНЬ) + 1) КАК ЧИСЛО(15, 0)) КАК AverageEuro
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Month";
	
	
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	
	Запрос.УстановитьПараметр("SiteInn", SiteInn);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	#КонецОбласти
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецФункции

Функция SalesUpd2(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
			
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
					
		
#Область Продажи_ПоОплате
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК Площадь,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВТПродажиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|				И ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ОтчетДавальцу) ССЫЛКА Документ.ОтчетДавальцу
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВыручкаИСебестоимостьПродажОбороты.Период < ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0)
	|				ТОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = "" Ликофлекс""
	|						ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)),
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоВозврат,
	|	ВТПродажиПоЗаказу.Количество КАК Количество
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|			И ВТПродажиПоЗаказу.Заказ = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|			И ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ВозвратТоваровОтКлиента) ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ИЛИ ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.КорректировкаРеализации) ССЫЛКА Документ.КорректировкаРеализации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Заказ,
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТВозвраты.Регистратор КАК Регистратор,
	|	ВТВозвраты.Заказ КАК Заказ,
	|	(ВТВозвраты.Количество + ВТВозвраты.КоличествоВозврат) / ВТВозвраты.Количество КАК КоэффициентВозврата
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	ВТВозвраты КАК ВТВозвраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродаже,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеБезНДС
	|ПОМЕСТИТЬ ВТПродажи
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|ГДЕ
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа <> 0
	|	И НЕ ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток, 0)) КАК ОстатокРасчетов
	|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки КАК РасчетыСКлиентамиПоСрокамОстатки
	|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ДолгУпр, 0)) КАК Оплата
	|ПОМЕСТИТЬ ВТОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО (ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент)
	|			И (РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)))
	|			И (РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) КАК Остаток,
	|	СУММА(ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0)) КАК Выручка
	|ПОМЕСТИТЬ ВТРасчеты
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	|		ПО ВТПродажи.Регистратор = ВТОплаты.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
	|		ПО ВТПродажи.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0),
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0),
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Период КАК Период,
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиЗаказа,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиБезНДСЗаказа,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТПродажиПоЗаказу.Площадь * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК Площадь,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказа
	|ПОМЕСТИТЬ ВТКоэффициенты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВТПродажи.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Возвраты
	|		ПО ВТПродажиПоЗаказу.Регистратор = Возвраты.Регистратор
	|			И ВТПродажиПоЗаказу.Заказ = Возвраты.Заказ
	|ГДЕ
	|	ВТПродажи.ВыручкаПоПродаже <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка КАК Площадка,
	|	ВТКоэффициенты.Период КАК Период,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ВТРасчеты.Регистратор КАК Регистратор,
	|	ВТКоэффициенты.Заказ КАК Заказ,
	|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
	|	СУММА(ВТКоэффициенты.Площадь) КАК МетражКВМПродано,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиЗаказа КАК ЧИСЛО(15, 2))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиБезНДСЗаказа КАК ЧИСЛО(15, 2))) КАК ВыручкаБезНДС,
	|	СУММА(0) КАК МетражКВМСписано,
	|	СУММА(ВТКоэффициенты.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	МАКСИМУМ(1) КАК Тип
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТРасчеты КАК ВТРасчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициенты КАК ВТКоэффициенты
	|		ПО ВТРасчеты.Регистратор = ВТКоэффициенты.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор,
	|	ВТКоэффициенты.Заказ,
	|	ВТРасчеты.Регистратор,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка,
	|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)),
	|	ВТКоэффициенты.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
	|	NULL,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))),
	|	СУММА(0),
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка 
	|				КОНЕЦ
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
	|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры ЕСТЬ NULL) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанные.Площадка КАК Площадка,
	|	ВТДанные.Партнер КАК Партнер,
	|	ВТДанные.РабочийЦентр КАК РабочийЦентр,
	|	СУММА(ВТДанные.МетражКВМПродано) КАК МетражКВМПродано,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.Выручка КАК ЧИСЛО(15, 0))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Себестоимость,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК СебестоимостьПлан,
	|	СУММА((ВЫРАЗИТЬ(0.87 * ВТДанные.Выручка КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК ДоходПлан,
	|	СУММА((ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК Доход,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВТДанные.Тип = 3
	|					ТОГДА ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 0))) КАК СебестоимостьБрака,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВТДанные.Тип = 2
	|					ТОГДА ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 0))) КАК СебестоимостьПробников,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.МетражКВМСписано КАК ЧИСЛО(15, 0))) КАК МетражКВМСписано,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.МатериалыОборот, 0) КАК ЧИСЛО(15, 0))) КАК Материалы,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.АмортизацияОборот, 0) КАК ЧИСЛО(15, 0))) КАК Амортизация,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.ЗППрямаяОборот, 0) КАК ЧИСЛО(15, 0))) КАК ЗППрямая,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.КосвенныеОборот, 0) КАК ЧИСЛО(15, 0))) КАК Косвенные,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.РемонтыОборот, 0) КАК ЧИСЛО(15, 0))) КАК Ремонты,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.ТранспортРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.ТранспортОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Транспорт,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.ПродажиОборот, 0) КАК ЧИСЛО(15, 0))) КАК Продажи,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаПоПродажеЗаказаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаПоПродажеЗаказаБезНДС
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_СебестоимостьЗаказов.Обороты(, , Регистратор, ) КАК Лико_СебестоимостьЗаказовОбороты
	|		ПО ВТДанные.Регистратор = Лико_СебестоимостьЗаказовОбороты.Регистратор
	|			И ВТДанные.Заказ = Лико_СебестоимостьЗаказовОбороты.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.Площадка,
	|	ВТДанные.Партнер,
	|	ВТДанные.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ.Партнер.Код, """") КАК PartnerCode,
	|	ЕСТЬNULL(ВТ.Партнер.Наименование, """") КАК PartnerName,
	|	ЕСТЬNULL(ВТ.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
	|	ЕСТЬNULL(ВТ.РабочийЦентр.Наименование, """") КАК WorkCenterName,
	|	ЕСТЬNULL(ВТ.МетражКВМПродано, 0) КАК Square,
	|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
	|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
	|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
	|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Доход / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfit,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.Выручка > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ДоходПлан / ВТ.Выручка КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfitPlan,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Материалы / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentMaterials,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Продажи / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentSales,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Транспорт / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentTransport,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ЗППрямая / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentSalary,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Косвенные / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentIndirect,
	|	ЕСТЬNULL(ВТ.СебестоимостьБрака, 0) КАК Marriage,
	|	ЕСТЬNULL(ВТ.СебестоимостьПробников, 0) КАК Probe
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ";

			
	#КонецОбласти
			
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
КонецФункции


Функция SalesUpd2_Old(ПараметрыPOST)   
//Использовалась до 20221129	
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	Если Пользователь.Лико_Площадки.Количество() <3  Тогда
		Если  SiteInn="" ИЛИ SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН Тогда 
			SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН;
		Иначе  SiteInn= "20202020";
		КонецЕсли;
	КонецЕсли;
	
	
	//С 2020 все данные берем из ЕРП
	Если Дата(DateStart) 	< '20200101' Тогда
		
		
		#Область УПП
		
		ssl1 = Новый ЗащищенноеСоединениеOpenSSL(
		Новый СертификатКлиентаWindows(ПредопределенноеЗначение("СпособВыбораСертификатаWindows.Авто")),
		Новый СертификатыУдостоверяющихЦентровWindows());
		ВСОпределение = Новый WSОпределения("https://1cweb.okil.ru/zakaz-ws/ws/rest2?wsdl","administrator","224");
		Прокси = Новый WSПрокси(ВСОпределение, "http://zakaz/ws", "Rest2", "Rest2Soap");		
		Прокси.Пользователь="Administrator";
		Прокси.Пароль="224";		
		СписокXDTO=Прокси.GetRatingCustomers(DateStart,DateEnd, SiteInn,"1");	
		
		ТЗ_XDTO = Новый ТаблицаЗначений; 		
		ТЗ_XDTO.Колонки.Добавить("PartnerCode",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
		ТЗ_XDTO.Колонки.Добавить("PartnerID",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
		ТЗ_XDTO.Колонки.Добавить("PartnerName",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(12, ДопустимаяДлина.Переменная)));
		ТЗ_XDTO.Колонки.Добавить("Square",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой)));
		ТЗ_XDTO.Колонки.Добавить("Cost",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой)));
		ТЗ_XDTO.Колонки.Добавить("CostNoTax",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой)));
		
		ТЗ_XDTO.Колонки.Добавить("WorkCenterNumber",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой)));
		
		
		Для каждого СтрXDTO Из СписокXDTO.Состав Цикл
			НоваяСтрокаТз=ТЗ_XDTO.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТз,СтрXDTO)
		КонецЦикла;
		
		#КонецОбласти
		
		#Область ЕРП
		//Продажи
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТУПП.PartnerCode КАК PartnerCode,
		|	ВТУПП.PartnerName КАК PartnerName,
		|	ВТУПП.PartnerId КАК PartnerId,
		|	ВТУПП.Cost КАК Cost,
		|	ВТУПП.Square КАК Square,
		|	ВТУПП.WorkCenterNumber КАК WorkCenterNumber
		|ПОМЕСТИТЬ ВТУПП
		|ИЗ
		|	&ВТУПП КАК ВТУПП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТУПП.PartnerCode КАК PartnerCode,
		|	ВТУПП.PartnerName КАК PartnerName,
		|	ЕСТЬNULL(Партнеры.Ссылка, Контрагенты.Партнер) КАК Партнер
		|ПОМЕСТИТЬ ВТПартнеры
		|ИЗ
		|	ВТУПП КАК ВТУПП
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
		|		ПО ВТУПП.PartnerCode = Партнеры.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ВТУПП.PartnerId = Контрагенты.ИНН
		|			И (Контрагенты.ИНН <> """")
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТУПП.PartnerCode,
		|	ВТУПП.PartnerName,
		|	ЕСТЬNULL(Партнеры.Ссылка, Контрагенты.Партнер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
		|	ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Регистратор,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеПомашине,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеБезНДСПомашине,
		|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК Площадь
		|ПОМЕСТИТЬ ВТПродажиПоМашинам
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			ВЫБОР
		|					КОГДА &SiteInn = """"
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Организация.ИНН = &SiteInn
		|				КОНЕЦ
		|				И АналитикаУчетаПоПартнерам.Договор.Лико_Площадка В
		|					(ВЫБРАТЬ
		|						ПользователиЛико_Площадки.Площадка КАК Площадка
		|					ИЗ
		|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
		|					ГДЕ
		|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
		|				И ВЫБОР
		|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ВыручкаИСебестоимостьПродажОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
		|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &SiteInn = ""7817314085""
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.Регистратор,
		|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер,
		|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТПродажиПоМашинам.Регистратор КАК Регистратор,
		|	ВТПродажиПоМашинам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВТПродажиПоМашинам.ВыручкаПоПродажеПомашине) КАК ВыручкаПоПродаже
		|ПОМЕСТИТЬ ВТПродажи
		|ИЗ
		|	ВТПродажиПоМашинам КАК ВТПродажиПоМашинам
		|ГДЕ
		|	ВТПродажиПоМашинам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПродажиПоМашинам.Регистратор,
		|	ВТПродажиПоМашинам.ХозяйственнаяОперация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТПродажи.Регистратор КАК Регистратор,
		|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК РасчетныйДокумент,
		|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ПредоплатаУпр, 0)) КАК Предоплата
		|ПОМЕСТИТЬ ВТРасчетныеДокументы
		|ИЗ
		|	ВТПродажи КАК ВТПродажи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
		|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоДокументам.Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПродажи.Регистратор,
		|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
		|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
		|	ЕСТЬNULL(РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток, 0) КАК ОстатокРасчетов
		|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
		|ИЗ
		|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(, ) КАК РасчетыСКлиентамиПоДокументамОстатки
		|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументамОстатки.РасчетныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
		|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
		|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ДолгУпр, 0)) КАК Оплата
		|ПОМЕСТИТЬ ВТОплаты
		|ИЗ
		|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
		|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
		|			И (РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|				ИЛИ РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности)
		|				ИЛИ РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности))
		|			И (РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРасчетныеДокументы.Регистратор,
		|	ВТРасчетныеДокументы.РасчетныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
		|	СУММА(ЕСТЬNULL(ВТРасчетныеДокументы.Предоплата, 0) + ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0)) КАК Выручка
		|ПОМЕСТИТЬ ВТВыручка
		|ИЗ
		|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
		|		ПО ВТРасчетныеДокументы.Регистратор = ВТОплаты.Регистратор
		|			И ВТРасчетныеДокументы.РасчетныйДокумент = ВТОплаты.РасчетныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
		|		ПО ВТРасчетныеДокументы.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
		|			И ВТРасчетныеДокументы.РасчетныйДокумент = ПродажиСОстаткамиРасчетов.РасчетныйДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРасчетныеДокументы.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТПродажиПоМашинам.Партнер.Код КАК PartnerCode,
		|	ВТПродажиПоМашинам.Партнер.Наименование КАК PartnerName,
		|	ВТПродажиПоМашинам.РабочийЦентр.ПорядковыйНомер КАК WorkCenterNumber,
		|	ВТПродажиПоМашинам.РабочийЦентр.Наименование КАК WorkCenterName,
		|	СУММА(ВЫРАЗИТЬ(ВТВыручка.Выручка * ВТПродажиПоМашинам.ВыручкаПоПродажеПомашине / ВТПродажи.ВыручкаПоПродаже КАК ЧИСЛО(15, 2))) КАК Cost,
		|	СУММА(ВЫРАЗИТЬ(ВТВыручка.Выручка * ВТПродажиПоМашинам.ВыручкаПоПродажеБезНДСПомашине / ВТПродажи.ВыручкаПоПродаже КАК ЧИСЛО(15, 2))) КАК CostNoTax,
		|	СУММА(ВТПродажиПоМашинам.Площадь) КАК Square
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТПродажиПоМашинам КАК ВТПродажиПоМашинам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
		|		ПО ВТПродажиПоМашинам.Регистратор = ВТПродажи.Регистратор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыручка КАК ВТВыручка
		|		ПО ВТПродажиПоМашинам.Регистратор = ВТВыручка.Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПродажиПоМашинам.Партнер.Код,
		|	ВТПродажиПоМашинам.Партнер.Наименование,
		|	ВТПродажиПоМашинам.РабочийЦентр.ПорядковыйНомер,
		|	ВТПродажиПоМашинам.РабочийЦентр.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ВТПродажиПоМашинам.Партнер.Код,
		|	ВТПродажиПоМашинам.Партнер.Наименование,
		|	ВТПродажиПоМашинам.РабочийЦентр.ПорядковыйНомер,
		|	ВТПродажиПоМашинам.РабочийЦентр.Наименование,
		|	СУММА(ВТПродажиПоМашинам.ВыручкаПоПродажеПомашине),
		|	СУММА(ВТПродажиПоМашинам.ВыручкаПоПродажеБезНДСПомашине),
		|	СУММА(ВТПродажиПоМашинам.Площадь)
		|ИЗ
		|	ВТПродажиПоМашинам КАК ВТПродажиПоМашинам
		|ГДЕ
		|	ВТПродажиПоМашинам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПродажиПоМашинам.Партнер.Код,
		|	ВТПродажиПоМашинам.РабочийЦентр.ПорядковыйНомер,
		|	ВТПродажиПоМашинам.Партнер.Наименование,
		|	ВТПродажиПоМашинам.РабочийЦентр.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ВЫБОР
		|		КОГДА ВТПартнеры.Партнер ЕСТЬ NULL
		|			ТОГДА ВТПартнеры.PartnerCode
		|		ИНАЧЕ ВТПартнеры.Партнер.Код
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТПартнеры.Партнер ЕСТЬ NULL
		|			ТОГДА ВТПартнеры.PartnerName
		|		ИНАЧЕ ВТПартнеры.Партнер.Наименование
		|	КОНЕЦ,
		|	ЕСТЬNULL(РабочиеЦентры.ПорядковыйНомер, 0),
		|	ЕСТЬNULL(РабочиеЦентры.Наименование, """"),
		|	СУММА(ВТУПП.Cost),
		|	СУММА(0),
		|	СУММА(ВТУПП.Square)
		|ИЗ
		|	ВТУПП КАК ВТУПП,
		|	ВТПартнеры КАК ВТПартнеры,
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВТПартнеры.Партнер ЕСТЬ NULL
		|			ТОГДА ВТПартнеры.PartnerCode
		|		ИНАЧЕ ВТПартнеры.Партнер.Код
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТПартнеры.Партнер ЕСТЬ NULL
		|			ТОГДА ВТПартнеры.PartnerName
		|		ИНАЧЕ ВТПартнеры.Партнер.Наименование
		|	КОНЕЦ,
		|	ЕСТЬNULL(РабочиеЦентры.ПорядковыйНомер, 0),
		|	ЕСТЬNULL(РабочиеЦентры.Наименование, """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.PartnerCode КАК PartnerCode,
		|	ВТ.PartnerName КАК PartnerName,
		|	ЕСТЬNULL(ВТ.WorkCenterNumber, 0) КАК WorkCenterNumber,
		|	ЕСТЬNULL(ВТ.WorkCenterName, """") КАК WorkCenterName,
		|	СУММА(ВТ.Cost) КАК Cost,
		|	СУММА(ВТ.CostNoTax) КАК CostNoTax,
		|	СУММА(ЕСТЬNULL(ВТ.Square, 0)) КАК Square,
		|	СУММА(0) КАК EstimatedGrossProfit,
		|	СУММА(0) КАК EstimatedGrossProfitPlan
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.PartnerCode,
		|	ВТ.PartnerName,
		|	ЕСТЬNULL(ВТ.WorkCenterNumber, 0),
		|	ЕСТЬNULL(ВТ.WorkCenterName, """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Cost УБЫВ";
		
		
		
		
		Запрос.УстановитьПараметр("ВТУПП", ТЗ_XDTO);
		
	Иначе		
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда	
			#Область ВзаиморасчетыОнЛайн			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
			|	ВЫБОР
			|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
			|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
			|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
			|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
			|	КОНЕЦ КАК Регистратор,
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
			|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК Площадь,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество
			|ПОМЕСТИТЬ ВТПродажиПоЗаказу
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Регистратор,
			|			ВЫБОР
			|					КОГДА &SiteInn = """"
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Организация.ИНН = &SiteInn
			|				КОНЕЦ
			|				И ВЫБОР
			|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
			|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
			|					ИНАЧЕ ИСТИНА
			|				КОНЕЦ
			|				И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
			|				И АналитикаУчетаПоПартнерам.Договор.Лико_Площадка В
			|					(ВЫБРАТЬ
			|						ПользователиЛико_Площадки.Площадка КАК Площадка
			|					ИЗ
			|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
			|					ГДЕ
			|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
			|				И ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)) КАК ВыручкаИСебестоимостьПродажОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
			|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ОтчетДавальцу) ССЫЛКА Документ.ОтчетДавальцу
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА ВыручкаИСебестоимостьПродажОбороты.Период < ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0)
			|				ТОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = "" Ликофлекс""
			|						ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
			|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)),
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
			|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
			|	ВЫБОР
			|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
			|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
			|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
			|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
			|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоВозврат,
			|	ВТПродажиПоЗаказу.Количество КАК Количество
			|ПОМЕСТИТЬ ВТВозвраты
			|ИЗ
			|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
			|		ПО ВТПродажиПоЗаказу.Регистратор = ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
			|			И ВТПродажиПоЗаказу.Заказ = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
			|			И ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам
			|ГДЕ
			|	(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ВозвратТоваровОтКлиента) ССЫЛКА Документ.ВозвратТоваровОтКлиента
			|			ИЛИ ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.КорректировкаРеализации) ССЫЛКА Документ.КорректировкаРеализации)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПродажиПоЗаказу.Заказ,
			|	ВТПродажиПоЗаказу.Регистратор,
			|	ВТПродажиПоЗаказу.Количество
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТВозвраты.Регистратор КАК Регистратор,
			|	ВТВозвраты.Заказ КАК Заказ,
			|	(ВТВозвраты.Количество + ВТВозвраты.КоличествоВозврат) / ВТВозвраты.Количество КАК КоэффициентВозврата
			|ПОМЕСТИТЬ Возвраты
			|ИЗ
			|	ВТВозвраты КАК ВТВозвраты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
			|	ВТПродажиПоЗаказу.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродаже,
			|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеБезНДС
			|ПОМЕСТИТЬ ВТПродажи
			|ИЗ
			|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
			|ГДЕ
			|	ВТПродажиПоЗаказу.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
			|	И ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа <> 0
			|	И НЕ ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПродажиПоЗаказу.Регистратор,
			|	ВТПродажиПоЗаказу.ХозяйственнаяОперация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажи.Регистратор КАК Регистратор,
			|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток, 0)) КАК ОстатокРасчетов
			|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
			|ИЗ
			|	ВТПродажи КАК ВТПродажи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки КАК РасчетыСКлиентамиПоСрокамОстатки
			|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПродажи.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажи.Регистратор КАК Регистратор,
			|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ДолгУпр, 0)) КАК Оплата
			|ПОМЕСТИТЬ ВТОплаты
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
			|		ПО (ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент)
			|			И (РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)))
			|			И (РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПродажи.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажи.Регистратор КАК Регистратор,
			|	ЕСТЬNULL(ВТОплаты.Оплата, 0) КАК Оплата,
			|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) КАК Остаток,
			|	СУММА(ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0)) КАК Выручка
			|ПОМЕСТИТЬ ВТРасчеты
			|ИЗ
			|	ВТПродажи КАК ВТПродажи
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
			|		ПО ВТПродажи.Регистратор = ВТОплаты.Регистратор
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
			|		ПО ВТПродажи.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0),
			|	ЕСТЬNULL(ВТОплаты.Оплата, 0),
			|	ВТПродажи.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажиПоЗаказу.Период КАК Период,
			|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
			|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиЗаказа,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиБезНДСЗаказа,
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ВТПродажиПоЗаказу.Площадь * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК Площадь,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказаБезНДС,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказа
			|ПОМЕСТИТЬ ВТКоэффициенты
			|ИЗ
			|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
			|		ПО ВТПродажиПоЗаказу.Регистратор = ВТПродажи.Регистратор
			|		ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Возвраты
			|		ПО ВТПродажиПоЗаказу.Регистратор = Возвраты.Регистратор
			|			И ВТПродажиПоЗаказу.Заказ = Возвраты.Заказ
			|ГДЕ
			|	ВТПродажи.ВыручкаПоПродаже <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка КАК Площадка,
			|	ВТКоэффициенты.Период КАК Период,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
			|	ВТРасчеты.Регистратор КАК Регистратор,
			|	ВТКоэффициенты.Заказ КАК Заказ,
			|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
			|	СУММА(ВТКоэффициенты.Площадь) КАК МетражКВМПродано,
			|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиЗаказа КАК ЧИСЛО(15, 2))) КАК Выручка,
			|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиБезНДСЗаказа КАК ЧИСЛО(15, 2))) КАК ВыручкаБезНДС,
			|	СУММА(0) КАК МетражКВМСписано,
			|	СУММА(ВТКоэффициенты.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
			|	МАКСИМУМ(1) КАК Тип
			|ПОМЕСТИТЬ ВТДанные
			|ИЗ
			|	ВТРасчеты КАК ВТРасчеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициенты КАК ВТКоэффициенты
			|		ПО ВТРасчеты.Регистратор = ВТКоэффициенты.Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор,
			|	ВТКоэффициенты.Заказ,
			|	ВТРасчеты.Регистратор,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка,
			|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)),
			|	ВТКоэффициенты.Период
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
			|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
			|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
			|	СебестоимостьТоваровОбороты.Регистратор,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
			|	NULL,
			|	СУММА(0),
			|	СУММА(0),
			|	СУММА(ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))),
			|	СУММА(0),
			|	ВЫБОР
			|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
			|			ТОГДА 2
			|		ИНАЧЕ 3
			|	КОНЕЦ
			|ИЗ
			|	РегистрНакопления.СебестоимостьТоваров.Обороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Регистратор,
			|			ВЫБОР
			|					КОГДА &SiteInn = """"
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
			|				КОНЕЦ
			|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
			|				И АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка В
			|					(ВЫБРАТЬ
			|						ПользователиЛико_Площадки.Площадка КАК Площадка
			|					ИЗ
			|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
			|					ГДЕ
			|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
			|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры ЕСТЬ NULL) КАК СебестоимостьТоваровОбороты
			|ГДЕ
			|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
			|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
			|
			|СГРУППИРОВАТЬ ПО
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
			|	СебестоимостьТоваровОбороты.Регистратор,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
			|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
			|	ВЫБОР
			|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
			|			ТОГДА 2
			|		ИНАЧЕ 3
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТДанные.Площадка КАК Площадка,
			|	ВТДанные.Партнер КАК Партнер,
			|	ВТДанные.РабочийЦентр КАК РабочийЦентр,
			|	СУММА(ВТДанные.МетражКВМПродано) КАК МетражКВМПродано,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.Выручка КАК ЧИСЛО(15, 0))) КАК Выручка,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаБезНДС,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Себестоимость,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК СебестоимостьПлан,
			|	СУММА((ВЫРАЗИТЬ(0.87 * ВТДанные.Выручка КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК ДоходПлан,
			|	СУММА((ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК Доход,
			|	СУММА(ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ВТДанные.Тип = 3
			|					ТОГДА ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот, 0)
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК ЧИСЛО(15, 0))) КАК СебестоимостьБрака,
			|	СУММА(ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ВТДанные.Тип = 2
			|					ТОГДА ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот, 0)
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК ЧИСЛО(15, 0))) КАК СебестоимостьПробников,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.МетражКВМСписано КАК ЧИСЛО(15, 0))) КАК МетражКВМСписано,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.МатериалыОборот, 0) КАК ЧИСЛО(15, 0))) КАК Материалы,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.АмортизацияОборот, 0) КАК ЧИСЛО(15, 0))) КАК Амортизация,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.ЗППрямаяОборот, 0) КАК ЧИСЛО(15, 0))) КАК ЗППрямая,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.КосвенныеОборот, 0) КАК ЧИСЛО(15, 0))) КАК Косвенные,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.РемонтыОборот, 0) КАК ЧИСЛО(15, 0))) КАК Ремонты,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.ТранспортРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.ТранспортОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Транспорт,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.ПродажиОборот, 0) КАК ЧИСЛО(15, 0))) КАК Продажи,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаПоПродажеЗаказаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаПоПродажеЗаказаБезНДС
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	ВТДанные КАК ВТДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_СебестоимостьЗаказов.Обороты(, , Регистратор, ) КАК Лико_СебестоимостьЗаказовОбороты
			|		ПО ВТДанные.Регистратор = Лико_СебестоимостьЗаказовОбороты.Регистратор
			|			И ВТДанные.Заказ = Лико_СебестоимостьЗаказовОбороты.Заказ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТДанные.Площадка,
			|	ВТДанные.Партнер,
			|	ВТДанные.РабочийЦентр
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ВТ.Партнер.Код, """") КАК PartnerCode,
			|	ЕСТЬNULL(ВТ.Партнер.Наименование, """") КАК PartnerName,
			|	ЕСТЬNULL(ВТ.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
			|	ЕСТЬNULL(ВТ.РабочийЦентр.Наименование, """") КАК WorkCenterName,
			|	ЕСТЬNULL(ВТ.МетражКВМПродано, 0) КАК Square,
			|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
			|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
			|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
			|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Доход / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentProfit,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.Выручка > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ДоходПлан / ВТ.Выручка КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentProfitPlan,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Материалы / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentMaterials,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Продажи / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentSales,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Транспорт / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentTransport,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ЗППрямая / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentSalary,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Косвенные / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentIndirect,
			|	ЕСТЬNULL(ВТ.СебестоимостьБрака, 0) КАК Marriage,
			|	ЕСТЬNULL(ВТ.СебестоимостьПробников, 0) КАК Probe
			|ИЗ
			|	ВТ КАК ВТ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Cost УБЫВ";
			
			
			#КонецОбласти
			
		Иначе
			#Область ВзаиморасчетыОфЛайн
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
			|	ВЫБОР
			|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
			|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
			|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
			|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
			|	КОНЕЦ КАК Регистратор,
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
			|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК Площадь
			|ПОМЕСТИТЬ ВТПродажиПоЗаказу
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Регистратор,
			|			ВЫБОР
			|					КОГДА &SiteInn = """"
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Организация.ИНН = &SiteInn
			|				КОНЕЦ
			|				И ВЫБОР
			|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
			|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
			|					ИНАЧЕ ИСТИНА
			|				КОНЕЦ
			|				И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
			|				И АналитикаУчетаПоПартнерам.Договор.Лико_Площадка В
			|					(ВЫБРАТЬ
			|						ПользователиЛико_Площадки.Площадка КАК Площадка
			|					ИЗ
			|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
			|					ГДЕ
			|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)) КАК ВыручкаИСебестоимостьПродажОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
			|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ОтчетДавальцу
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА ВыручкаИСебестоимостьПродажОбороты.Период < ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0)
			|				ТОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = "" Ликофлекс""
			|						ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
			|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)),
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
			|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
			|	ВЫБОР
			|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
			|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
			|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
			|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
			|	ВТПродажиПоЗаказу.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродаже,
			|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеБезНДС
			|ПОМЕСТИТЬ ВТПродажи
			|ИЗ
			|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
			|ГДЕ
			|	ВТПродажиПоЗаказу.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
			|	И ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа <> 0
			|	И НЕ ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПродажиПоЗаказу.Регистратор,
			|	ВТПродажиПоЗаказу.ХозяйственнаяОперация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажи.Регистратор КАК Регистратор,
			|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК РасчетныйДокумент,
			|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ПредоплатаУпр, 0)) КАК Предоплата
			|ПОМЕСТИТЬ ВТРасчетныеДокументы
			|ИЗ
			|	ВТПродажи КАК ВТПродажи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
			|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоДокументам.Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПродажи.Регистратор,
			|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
			|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
			|	ЕСТЬNULL(РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток, 0) КАК ОстатокРасчетов
			|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
			|ИЗ
			|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки({(&ТекущаяДата)}, ) КАК РасчетыСКлиентамиПоДокументамОстатки
			|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументамОстатки.РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
			|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
			|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ДолгУпр, 0)) КАК Оплата
			|ПОМЕСТИТЬ ВТОплаты
			|ИЗ
			|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
			|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
			|			И (РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
			|				ИЛИ РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности)
			|				ИЛИ РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности))
			|			И (РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРасчетныеДокументы.Регистратор,
			|	ВТРасчетныеДокументы.РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
			|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
			|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ДолгУпр, 0)) КАК Возврат
			|ПОМЕСТИТЬ ВТВозвраты
			|ИЗ
			|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
			|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
			|			И (РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровотКлиента))
			|			И (РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРасчетныеДокументы.Регистратор,
			|	ВТРасчетныеДокументы.РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
			|	ЕСТЬNULL(ВТРасчетныеДокументы.Предоплата, 0) КАК Предоплата,
			|	ЕСТЬNULL(ВТОплаты.Оплата, 0) КАК Оплата,
			|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) КАК Остаток,
			|	СУММА(ЕСТЬNULL(ВТРасчетныеДокументы.Предоплата, 0) + ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0) + ЕСТЬNULL(ВТВозвраты.Возврат, 0)) КАК Выручка,
			|	ЕСТЬNULL(ВТВозвраты.Возврат, 0) КАК Возврат
			|ПОМЕСТИТЬ ВТРасчеты
			|ИЗ
			|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
			|		ПО ВТРасчетныеДокументы.Регистратор = ВТОплаты.Регистратор
			|			И ВТРасчетныеДокументы.РасчетныйДокумент = ВТОплаты.РасчетныйДокумент
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
			|		ПО ВТРасчетныеДокументы.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
			|			И ВТРасчетныеДокументы.РасчетныйДокумент = ПродажиСОстаткамиРасчетов.РасчетныйДокумент
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВозвраты КАК ВТВозвраты
			|		ПО ВТРасчетныеДокументы.Регистратор = ВТВозвраты.Регистратор
			|			И ВТРасчетныеДокументы.РасчетныйДокумент = ВТВозвраты.РасчетныйДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТРасчетныеДокументы.Регистратор,
			|	ЕСТЬNULL(ВТРасчетныеДокументы.Предоплата, 0),
			|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0),
			|	ЕСТЬNULL(ВТОплаты.Оплата, 0),
			|	ЕСТЬNULL(ВТВозвраты.Возврат, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТПродажиПоЗаказу.Период КАК Период,
			|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
			|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа / ВТПродажи.ВыручкаПоПродаже КАК КоэффициентПродажиЗаказа,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС / ВТПродажи.ВыручкаПоПродаже КАК КоэффициентПродажиБезНДСЗаказа,
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	ВТПродажиПоЗаказу.Площадь КАК Площадь,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС КАК ВыручкаПоПродажеЗаказаБезНДС,
			|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа КАК ВыручкаПоПродажеЗаказа
			|ПОМЕСТИТЬ ВТКоэффициенты
			|ИЗ
			|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
			|		ПО ВТПродажиПоЗаказу.Регистратор = ВТПродажи.Регистратор
			|ГДЕ
			|	ВТПродажи.ВыручкаПоПродаже <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка КАК Площадка,
			|	ВТКоэффициенты.Период КАК Период,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
			|	ВТРасчеты.Регистратор КАК Регистратор,
			|	ВТКоэффициенты.Заказ КАК Заказ,
			|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
			|	СУММА(ВТКоэффициенты.Площадь) КАК МетражКВМПродано,
			|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиЗаказа КАК ЧИСЛО(15, 2))) КАК Выручка,
			|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиБезНДСЗаказа КАК ЧИСЛО(15, 2))) КАК ВыручкаБезНДС,
			|	СУММА(0) КАК МетражКВМСписано,
			|	СУММА(ВТКоэффициенты.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
			|	МАКСИМУМ(1) КАК Тип
			|ПОМЕСТИТЬ ВТДанные
			|ИЗ
			|	ВТРасчеты КАК ВТРасчеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициенты КАК ВТКоэффициенты
			|		ПО ВТРасчеты.Регистратор = ВТКоэффициенты.Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор,
			|	ВТКоэффициенты.Заказ,
			|	ВТРасчеты.Регистратор,
			|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка,
			|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)),
			|	ВТКоэффициенты.Период
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка,
			|	ВТПродажиПоЗаказу.Период,
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер,
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор,
			|	ВТПродажиПоЗаказу.Регистратор,
			|	ВТПродажиПоЗаказу.Заказ,
			|	ЕСТЬNULL(ВТПродажиПоЗаказу.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)),
			|	СУММА(ВТПродажиПоЗаказу.Площадь),
			|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа),
			|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС),
			|	СУММА(0),
			|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС),
			|	МАКСИМУМ(1)
			|ИЗ
			|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
			|ГДЕ
			|	(ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
			|			ИЛИ ВТПродажиПоЗаказу.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту))
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер,
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор,
			|	ВТПродажиПоЗаказу.Регистратор,
			|	ВТПродажиПоЗаказу.Заказ,
			|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка,
			|	ЕСТЬNULL(ВТПродажиПоЗаказу.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)),
			|	ВТПродажиПоЗаказу.Период
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
			|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
			|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
			|	СебестоимостьТоваровОбороты.Регистратор,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
			|	NULL,
			|	СУММА(0),
			|	СУММА(0),
			|	СУММА(ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))),
			|	СУММА(0),
			|	ВЫБОР
			|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
			|			ТОГДА 2
			|		ИНАЧЕ 3
			|	КОНЕЦ
			|ИЗ
			|	РегистрНакопления.СебестоимостьТоваров.Обороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Регистратор,
			|			ВЫБОР
			|					КОГДА &SiteInn = """"
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
			|				КОНЕЦ
			|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
			|				И АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка В
			|					(ВЫБРАТЬ
			|						ПользователиЛико_Площадки.Площадка КАК Площадка
			|					ИЗ
			|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
			|					ГДЕ
			|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
			|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры ЕСТЬ NULL) КАК СебестоимостьТоваровОбороты
			|ГДЕ
			|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
			|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
			|
			|СГРУППИРОВАТЬ ПО
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
			|	СебестоимостьТоваровОбороты.Регистратор,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
			|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
			|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
			|	ВЫБОР
			|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
			|			ТОГДА 2
			|		ИНАЧЕ 3
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТДанные.Площадка КАК Площадка,
			|	ВТДанные.Партнер КАК Партнер,
			|	ВТДанные.РабочийЦентр КАК РабочийЦентр,
			|	СУММА(ВТДанные.МетражКВМПродано) КАК МетражКВМПродано,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.Выручка КАК ЧИСЛО(15, 0))) КАК Выручка,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаБезНДС,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Себестоимость,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК СебестоимостьПлан,
			|	СУММА((ВЫРАЗИТЬ(0.87 * ВТДанные.Выручка КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК ДоходПлан,
			|	СУММА((ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК Доход,
			|	СУММА(ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ВТДанные.Тип = 3
			|					ТОГДА ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот, 0)
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК ЧИСЛО(15, 0))) КАК СебестоимостьБрака,
			|	СУММА(ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ВТДанные.Тип = 2
			|					ТОГДА ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот, 0)
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК ЧИСЛО(15, 0))) КАК СебестоимостьПробников,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.МетражКВМСписано КАК ЧИСЛО(15, 0))) КАК МетражКВМСписано,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.МатериалыОборот, 0) КАК ЧИСЛО(15, 0))) КАК Материалы,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.АмортизацияОборот, 0) КАК ЧИСЛО(15, 0))) КАК Амортизация,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.ЗППрямаяОборот, 0) КАК ЧИСЛО(15, 0))) КАК ЗППрямая,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.КосвенныеОборот, 0) КАК ЧИСЛО(15, 0))) КАК Косвенные,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.РемонтыОборот, 0) КАК ЧИСЛО(15, 0))) КАК Ремонты,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
			|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА Лико_СебестоимостьЗаказовОбороты.ТранспортРасход
			|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.ТранспортОборот
			|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Транспорт,
			|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(-1 * Лико_СебестоимостьЗаказовОбороты.ПродажиОборот, 0) КАК ЧИСЛО(15, 0))) КАК Продажи,
			|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаПоПродажеЗаказаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаПоПродажеЗаказаБезНДС
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	ВТДанные КАК ВТДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_СебестоимостьЗаказов.Обороты(, , Регистратор, ) КАК Лико_СебестоимостьЗаказовОбороты
			|		ПО ВТДанные.Регистратор = Лико_СебестоимостьЗаказовОбороты.Регистратор
			|			И ВТДанные.Заказ = Лико_СебестоимостьЗаказовОбороты.Заказ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТДанные.Площадка,
			|	ВТДанные.Партнер,
			|	ВТДанные.РабочийЦентр
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ВТ.Партнер.Код, """") КАК PartnerCode,
			|	ЕСТЬNULL(ВТ.Партнер.Наименование, """") КАК PartnerName,
			|	ЕСТЬNULL(ВТ.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
			|	ЕСТЬNULL(ВТ.РабочийЦентр.Наименование, """") КАК WorkCenterName,
			|	ЕСТЬNULL(ВТ.МетражКВМПродано, 0) КАК Square,
			|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
			|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
			|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
			|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Доход / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentProfit,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.Выручка > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ДоходПлан / ВТ.Выручка КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentProfitPlan,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Материалы / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentMaterials,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Продажи / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentSales,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Транспорт / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentTransport,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ЗППрямая / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentSalary,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ВТ.ВыручкаБезНДС > 0
			|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Косвенные / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК PercentIndirect,
			|	ЕСТЬNULL(ВТ.СебестоимостьБрака, 0) КАК Marriage,
			|	ЕСТЬNULL(ВТ.СебестоимостьПробников, 0) КАК Probe
			|ИЗ
			|	ВТ КАК ВТ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Cost УБЫВ";
			
			#КонецОбласти
		КонецЕсли;
		
		
		
		
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	
	
	Запрос.УстановитьПараметр("SiteInn", SiteInn);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	#КонецОбласти
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
КонецФункции


Функция SalesDetail(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd,PartnerCode, WorkCenterNumber ");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если ЕстьСвойство(ПараметрыPOST, "PartnerCode") Тогда 
		PartnerCode = ПараметрыPOST.PartnerCode;
	КонецЕсли;
	
	Если ЕстьСвойство(ПараметрыPOST, "WorkCenterNumber") Тогда 
		WorkCenterNumber = Число(ПараметрыPOST.WorkCenterNumber);
	КонецЕсли;
	
	#Область Продажи_ПоОплате_Расшифровка
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК Площадь,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВТПродажиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|				И ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|				И АналитикаУчетаПоПартнерам.Партнер.Код = &ПартнерКод) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ОтчетДавальцу) ССЫЛКА Документ.ОтчетДавальцу
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)),
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоВозврат,
	|	ВТПродажиПоЗаказу.Количество КАК Количество
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|			И ВТПродажиПоЗаказу.Заказ = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|			И ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ВозвратТоваровОтКлиента) ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ИЛИ ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.КорректировкаРеализации) ССЫЛКА Документ.КорректировкаРеализации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Заказ,
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТВозвраты.Регистратор КАК Регистратор,
	|	ВТВозвраты.Заказ КАК Заказ,
	|	(ВТВозвраты.Количество + ВТВозвраты.КоличествоВозврат) / ВТВозвраты.Количество КАК КоэффициентВозврата
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	ВТВозвраты КАК ВТВозвраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродаже,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеБезНДС
	|ПОМЕСТИТЬ ВТПродажи
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|ГДЕ
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа <> 0
	|	И НЕ ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток, 0)) КАК ОстатокРасчетов
	|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки КАК РасчетыСКлиентамиПоСрокамОстатки
	|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ДолгУпр, 0)) КАК Оплата
	|ПОМЕСТИТЬ ВТОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО (ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент)
	|			И (РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)))
	|			И (РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) КАК Остаток,
	|	СУММА(ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0)) КАК Выручка
	|ПОМЕСТИТЬ ВТРасчеты
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	|		ПО ВТПродажи.Регистратор = ВТОплаты.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
	|		ПО ВТПродажи.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0),
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0),
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Период КАК Период,
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиЗаказа,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиБезНДСЗаказа,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТПродажиПоЗаказу.Площадь * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК Площадь,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказа
	|ПОМЕСТИТЬ ВТКоэффициенты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВТПродажи.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Возвраты
	|		ПО ВТПродажиПоЗаказу.Регистратор = Возвраты.Регистратор
	|			И ВТПродажиПоЗаказу.Заказ = Возвраты.Заказ
	|ГДЕ
	|	ВТПродажи.ВыручкаПоПродаже <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка КАК Площадка,
	|	ВТКоэффициенты.Период КАК Период,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ВТРасчеты.Регистратор КАК Регистратор,
	|	ВТКоэффициенты.Заказ КАК Заказ,
	|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
	|	СУММА(ВТКоэффициенты.Площадь) КАК МетражКВМПродано,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиЗаказа КАК ЧИСЛО(15, 2))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиБезНДСЗаказа КАК ЧИСЛО(15, 2))) КАК ВыручкаБезНДС,
	|	СУММА(0) КАК МетражКВМСписано,
	|	СУММА(ВТКоэффициенты.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТРасчеты КАК ВТРасчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициенты КАК ВТКоэффициенты
	|		ПО ВТРасчеты.Регистратор = ВТКоэффициенты.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор,
	|	ВТКоэффициенты.Заказ,
	|	ВТРасчеты.Регистратор,
	|	ВТКоэффициенты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка,
	|	ЕСТЬNULL(ВТКоэффициенты.Заказ.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)),
	|	ВТКоэффициенты.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
	|	NULL,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
	|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры ЕСТЬ NULL
	|				И АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер.Код = &ПартнерКод) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанные.Площадка КАК Площадка,
	|	ВТДанные.Партнер КАК Партнер,
	|	ВТДанные.РабочийЦентр КАК РабочийЦентр,
	|	СУММА(ВТДанные.МетражКВМПродано) КАК МетражКВМПродано,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.Выручка КАК ЧИСЛО(15, 0))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Себестоимость,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК СебестоимостьПлан,
	|	СУММА((ВЫРАЗИТЬ(0.85 * ВТДанные.Выручка КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК ДоходПлан,
	|	СУММА((ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК Доход,
	|	ВТДанные.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_СебестоимостьЗаказов.Обороты(, , Регистратор, ) КАК Лико_СебестоимостьЗаказовОбороты
	|		ПО ВТДанные.Регистратор = Лико_СебестоимостьЗаказовОбороты.Регистратор
	|			И ВТДанные.Заказ = Лико_СебестоимостьЗаказовОбороты.Заказ
	|ГДЕ
	|	ВТДанные.РабочийЦентр.ПорядковыйНомер = &РЦПорядковыйНомер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.Площадка,
	|	ВТДанные.Партнер,
	|	ВТДанные.РабочийЦентр,
	|	ВТДанные.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ.Партнер.Код, """") КАК PartnerCode,
	|	ЕСТЬNULL(ВТ.Партнер.Наименование, """") КАК PartnerName,
	|	ЕСТЬNULL(ВТ.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
	|	ЕСТЬNULL(ВТ.РабочийЦентр.Наименование, """") КАК WorkCenterName,
	|	ЕСТЬNULL(ВТ.МетражКВМПродано, 0) КАК Square,
	|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
	|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
	|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
	|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Доход / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfit,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.Выручка > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ДоходПлан / ВТ.Выручка КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfitPlan,
	|	ВТ.Заказ.Номер КАК _order_num,
	|	ВТ.Заказ.Дата КАК _order_date,
	|	ВТ.Заказ.НомерБезПрефикса КАК Order
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ";	
	
	#КонецОбласти

	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ПартнерКод", PartnerCode);
	Запрос.УстановитьПараметр("РЦПорядковыйНомер",WorkCenterNumber);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
КонецФункции

Функция Shipments(ПараметрыPOST)
	
		// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, SiteInn, UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	//
	//Если Пользователь.Лико_Площадки.Количество() <3  Тогда
	//	Если  SiteInn="" ИЛИ SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН Тогда 
	//		SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН;
	//	Иначе  SiteInn= "20202020";
	//	КонецЕсли;
	//КонецЕсли;  
	
	
		Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;
    	
	Если Пользователь.Лико_Площадки.Количество() <3  Тогда
		Если Лико_Площадка="" Или  Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка Тогда 
			Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка;			
		Иначе  Лико_Площадка= "20202020";					
		КонецЕсли;
	КонецЕсли;

	

#Область Отгрузки

//С 2020 - только ЕРП    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_Отгрузки.Заказ.Партнер.Код КАК ПартнерКод,
	|	Лико_Отгрузки.Заказ.Партнер.Наименование КАК ПартнерНаименование,
	|	СУММА(Лико_Отгрузки.МетражКВМ) КАК МетражКВМ,
	|	СУММА(Лико_Отгрузки.Стоимость) КАК Сумма,
	|	NULL КАК СтоимостьУслугОборот,
	|	NULL КАК СтоимостьОборот
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.Лико_Отгрузки КАК Лико_Отгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО Лико_Отгрузки.Заказ.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	Лико_Отгрузки.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫБОР
	//|			КОГДА &SiteInn = ""7817314085""
	|			КОГДА &Лико_Площадка = Значение(Справочник.Лико_Площадки.ИксПак)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Лико_Площадка = """"
	|				ТОГДА ИСТИНА
	//|			ИНАЧЕ Лико_Отгрузки.Заказ.Площадка.Организация.ИНН = &SiteInn
	|			ИНАЧЕ Лико_Отгрузки.Заказ.Площадка = &Лико_Площадка
	|		КОНЕЦ
	|	И Лико_Отгрузки.Заказ.Площадка В
	|			(ВЫБРАТЬ
	|				ПользователиЛико_Площадки.Площадка КАК Площадка
	|			ИЗ
	|				Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|			ГДЕ
	|				ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|	И ВЫБОР
	|			КОГДА Лико_Отгрузки.Заказ.Площадка.Наименование <> ""ОКИЛ-САТО Икс-Пак ООО""
	|				ТОГДА Лико_Отгрузки.ДатаОтгрузки < ДАТАВРЕМЯ(2020, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_Отгрузки.Заказ.Партнер.Код,
	|	Лико_Отгрузки.Заказ.Партнер.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Лико_Отгрузки2Обороты.Заказ.Партнер.Код, Лико_Отгрузки2Обороты.ДокументОтгрузки.Партнер.Код),
	|	ЕСТЬNULL(Лико_Отгрузки2Обороты.Заказ.Партнер.Наименование, Лико_Отгрузки2Обороты.ДокументОтгрузки.Партнер.Наименование),
	|	ВЫБОР
	|		КОГДА Лико_Отгрузки2Обороты.Заказ.Ф1
	|				И Лико_Отгрузки2Обороты.МетражКВМОборот = 0
	|			ТОГДА Лико_Отгрузки2Обороты.МетражКВМСписаноОборот
	|		ИНАЧЕ Лико_Отгрузки2Обороты.МетражКВМОборот
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_Отгрузки2Обороты.Заказ.Ф1
	|				И Лико_Отгрузки2Обороты.КоличествоСписаноОборот <> 0
	|			ТОГДА Лико_Отгрузки2Обороты.КоличествоСписаноОборот * Лико_Отгрузки2Обороты.Заказ.ЦенаСредняя
	|		ИНАЧЕ Лико_Отгрузки2Обороты.СтоимостьОборот + Лико_Отгрузки2Обороты.СтоимостьУслугОборот
	|	КОНЕЦ,
	|	Лико_Отгрузки2Обороты.СтоимостьУслугОборот,
	|	Лико_Отгрузки2Обороты.СтоимостьОборот
	|ИЗ
	|	РегистрНакопления.Лико_Отгрузки2.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			,
	|			Заказ.Площадка В
	|					(ВЫБРАТЬ
	|						ПользователиЛико_Площадки.Площадка КАК Площадка
	|					ИЗ
	|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|					ГДЕ
	|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|				ИЛИ ДокументОтгрузки.Договор.Лико_Площадка В
	|					(ВЫБРАТЬ
	|						ПользователиЛико_Площадки.Площадка КАК Площадка
	|					ИЗ
	|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|					ГДЕ
	|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)) КАК Лико_Отгрузки2Обороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Лико_Площадка = """"
	|				ТОГДА ИСТИНА
	//|			ИНАЧЕ Лико_Отгрузки2Обороты.Заказ.Площадка.Организация.ИНН = &SiteInn
	|			ИНАЧЕ Лико_Отгрузки2Обороты.Заказ.Площадка = &Лико_Площадка
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ.ПартнерКод, """") КАК PartnerCode,
	|	ЕСТЬNULL(ВТ.ПартнерНаименование, """") КАК PartnerName,
	|	СУММА(ЕСТЬNULL(ВТ.МетражКВМ, 0)) КАК Square,
	|	СУММА(ЕСТЬNULL(ВТ.Сумма, 0)) КАК Cost
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ.ПартнерКод, """"),
	|	ЕСТЬNULL(ВТ.ПартнерНаименование, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ";


	
#КонецОбласти

		
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn); 
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
	
	
КонецФункции

Функция ShipmentsPlan(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	//ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, SiteInn, UserOS");   
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, SiteInn");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;

		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкиОстатки.ДокументОприходования.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЕСТЬNULL(Лико_ПараметрыОтрузки.Контрагент, ЗаявкиОстатки.ЗаказКлиента.Контрагент) КАК Контрагент,
	|	ЗаявкиОстатки.ЗаказКлиента.Партнер КАК Партнер,
	|	СУММА(ЗаявкиОстатки.КоличествоКонечныйОстаток * ЕСТЬNULL(Лико_ПараметрыОтрузки.Цена, 0)) КАК Сумма,
	|	ЕСТЬNULL(Лико_ПараметрыОтрузки.Валюта, &ВалютаУпр) КАК Валюта
	|ПОМЕСТИТЬ ВТ_ОстаткиПоОтгрузкамСвернуто
	|ИЗ
	|	РегистрНакопления.Лико_ЗаявкиНаОтгрузку.ОстаткиИОбороты(
	|			ДАТАВРЕМЯ(3999, 12, 31),
	|			,
	|			День,
	|			ДвиженияИГраницыПериода,
	//|			ДокументОприходования.Организация = &Площадка
	|			ЗаказКлиента.Площадка = &Лико_Площадка
	|				И (ДокументОприходования.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|				И НЕ ДокументОприходования.ТипОтгрузки В (ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения))) КАК ЗаявкиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыОтрузки КАК Лико_ПараметрыОтрузки
	|		ПО ЗаявкиОстатки.ЗаказКлиента = Лико_ПараметрыОтрузки.ЗаказКлиента
	|			И ЗаявкиОстатки.Номенклатура = Лико_ПараметрыОтрузки.Номенклатура
	|			И ЗаявкиОстатки.Характеристика = Лико_ПараметрыОтрузки.Характеристика
	|			И ЗаявкиОстатки.ДокументОприходования = Лико_ПараметрыОтрузки.Регистратор
	|			И ЗаявкиОстатки.Город = Лико_ПараметрыОтрузки.Город
	|			И ЗаявкиОстатки.Намотка = Лико_ПараметрыОтрузки.Намотка
	|			И ЗаявкиОстатки.Грузополучатель = Лико_ПараметрыОтрузки.Грузополучатель
	|			И ЗаявкиОстатки.НомерПоставки = Лико_ПараметрыОтрузки.НомерПоставки
	|			И ЗаявкиОстатки.КодЭтикеткиЗаказчика = Лико_ПараметрыОтрузки.КодЭтикеткиЗаказчика
	|			И ЗаявкиОстатки.ЧестныйЗнак = Лико_ПараметрыОтрузки.ЧестныйЗнак
	|ГДЕ
	|	ЗаявкиОстатки.КоличествоКонечныйОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкиОстатки.ДокументОприходования.ДатаОтгрузки,
	|	ЕСТЬNULL(Лико_ПараметрыОтрузки.Контрагент, ЗаявкиОстатки.ЗаказКлиента.Контрагент),
	|	ЗаявкиОстатки.ЗаказКлиента.Партнер,
	|	ЕСТЬNULL(Лико_ПараметрыОтрузки.Валюта, &ВалютаУпр)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			,
	|			Валюта В
	|				(ВЫБРАТЬ
	|					Т.Валюта
	|				ИЗ
	|					ВТ_ОстаткиПоОтгрузкамСвернуто КАК Т
	|				ГДЕ
	|					Т.Валюта <> &ВалютаРегл
	|				СГРУППИРОВАТЬ ПО
	|					Т.Валюта)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_КурсыВалют.Курс КАК Курс
	|ПОМЕСТИТЬ ВТ_КурсЕвро
	|ИЗ
	|	ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|ГДЕ
	|	ВТ_КурсыВалют.Валюта = &ВалютаУпр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Партнер КАК Партнер,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Партнер.Наименование КАК PartnerName,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Партнер.Код КАК PartnerCode,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Контрагент.Наименование КАК contractorname,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Контрагент.ИНН КАК contractorcode,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.ДатаОтгрузки КАК ShipmentDate,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ОстаткиПоОтгрузкамСвернуто.Валюта = &ВалютаУпр
	|				ТОГДА ВТ_ОстаткиПоОтгрузкамСвернуто.Сумма
	|			КОГДА ВТ_ОстаткиПоОтгрузкамСвернуто.Валюта = &ВалютаРегл
	|				ТОГДА ВТ_ОстаткиПоОтгрузкамСвернуто.Сумма / ВТ_КурсЕвро.Курс
	|			ИНАЧЕ ВТ_ОстаткиПоОтгрузкамСвернуто.Сумма * ВТ_КурсыВалют.Курс / ВТ_КурсЕвро.Курс
	|		КОНЕЦ) КАК Sum,
	|	ЛОЖЬ КАК Overdue
	|ИЗ
	|	ВТ_ОстаткиПоОтгрузкамСвернуто КАК ВТ_ОстаткиПоОтгрузкамСвернуто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|		ПО ВТ_ОстаткиПоОтгрузкамСвернуто.Валюта = ВТ_КурсыВалют.Валюта,
	|	ВТ_КурсЕвро КАК ВТ_КурсЕвро
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Партнер,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.ДатаОтгрузки,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Партнер.Наименование,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Контрагент.Наименование,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Партнер.Код,
	|	ВТ_ОстаткиПоОтгрузкамСвернуто.Контрагент.ИНН";
	
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить()); 
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(DateStart));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(DateEnd));
	//Запрос.УстановитьПараметр("Площадка", Справочники.Организации.НайтиПоРеквизиту("ИНН", SiteInn));
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
	ТЗОтгрузки = Запрос.Выполнить().Выгрузить();
	
	МассивПартнеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТЗОтгрузки.ВыгрузитьКолонку("Партнер"));
	ЗапросДолгов = Новый Запрос;
	ЗапросДолгов.Текст = Лико_Дополнительно.ПолучитьТекстЗапросаДолгиПоПартнерам();
	ЗапросДолгов.УстановитьПараметр("МассивПартнеров", МассивПартнеров);
	ЗапросДолгов.УстановитьПараметр("ТекДата", КонецДня(ТекущаяДата()));
	ЗапросДолгов.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	ЗапросДолгов.УстановитьПараметр("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
	ВыборкаДолгов = ЗапросДолгов.Выполнить().Выбрать();
	СоответствиеПарнеровИДолгов = Новый Соответствие;
	Пока ВыборкаДолгов.Следующий() Цикл
		СоответствиеПарнеровИДолгов.Вставить(ВыборкаДолгов.Партнер, ВыборкаДолгов.СуммаУпрДолгСУчетомПредоплаты);
	КонецЦикла;
	
	Для каждого Строка из ТЗОтгрузки Цикл
		ДолгПартнера = СоответствиеПарнеровИДолгов.Получить(Строка.Партнер); 
		Строка.Overdue = ЗначениеЗаполнено(ДолгПартнера) И ДолгПартнера > 0;
	КонецЦикла;
	
	
	Тз = ТЗОтгрузки;
	
	
	//Возврат HttpВернутьТзКакJSON(Тз); 
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Тз));
	
	
	
КонецФункции


Функция Production(ПараметрыPOST)

	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;

	
	Запрос = Новый Запрос;
	
//Выпуск по клиентам из РезультатЗаказа	
#Область Выпуск_ПоКлиентам_ИзРезультатаЗаказа
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(Лико_ВыпускГПОбороты.Период) КАК Период,
		|	МАКСИМУМ(Лико_ВыпускГПОбороты.РабочийЦентр) КАК РабочийЦентр,
		|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
		|	Лико_ВыпускГПОбороты.Заказ.Менеджер КАК Менеджер,
		|	Лико_ВыпускГПОбороты.Заказ.Партнер КАК Партнер,
		|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК Количество,
		|	СУММА(Лико_ВыпускГПОбороты.МетражКВМОборот) КАК МетражКВМ,
		|	СУММА(Лико_ВыпускГПОбороты.МетражПМОборот) КАК МетражПМ,
		|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьОборот) КАК лкСебестоимость,
		|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьПланОборот) КАК лкСебестоимостьПлан,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
		|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьОборот
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
		|						ТОГДА 0
		|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьОборот
		|				КОНЕЦ
		|		КОНЕЦ) КАК Стоимость,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
		|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
		|						ТОГДА 0
		|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьБезНДС
		|ПОМЕСТИТЬ ВТВыпуск
		|ИЗ
		|	РегистрНакопления.Лико_ВыпускГП.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			ВЫБОР
		|					КОГДА &Лико_Площадка = """"
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ РабочийЦентр.Лико_Площадка = &Лико_Площадка
		|				КОНЕЦ
		|				И НЕ Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Лико_ВыпускГПОбороты
		|ГДЕ
		|	Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ВыпускГПОбороты.Заказ,
		|	Лико_ВыпускГПОбороты.Заказ.Партнер,
		|	Лико_ВыпускГПОбороты.Заказ.Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ВТВыпуск.Партнер.Наименование ПОДОБНО ""%РПС%""
		|				ТОГДА ""Отдел продаж Москва / Moscow branch office""
		|			ИНАЧЕ ВТВыпуск.Партнер.ОсновнойМенеджер.Подразделение.Наименование
		|		КОНЕЦ, ""Производство"") КАК Region,
		|	ЕСТЬNULL(ВТВыпуск.Партнер.Наименование, """") КАК PartnerName,
		|	ЕСТЬNULL(ВТВыпуск.Менеджер.Наименование, """") КАК Manager,
		|	ЕСТЬNULL(ВТВыпуск.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТВыпуск.РабочийЦентр.Описание КАК СТРОКА(50)), """") КАК WorkCenterName,
		|	ЕСТЬNULL(ВТВыпуск.Партнер.Код, """") КАК PartnerCode,
		|	СУММА(ЕСТЬNULL(ВТВыпуск.МетражКВМ, 0)) КАК Square,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
		|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплате, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
		|			ИНАЧЕ ВТВыпуск.Стоимость
		|		КОНЕЦ) КАК Cost,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
		|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.Оплата, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
		|			ИНАЧЕ ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.Оплата, 0)
		|		КОНЕЦ) КАК Payment,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
		|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплатеБезНДС, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
		|			ИНАЧЕ ВТВыпуск.СтоимостьБезНДС
		|		КОНЕЦ) КАК CostNoTax,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
		|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.Доход, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК EstimatedGrossProfit,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
		|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ДоходТабаш, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК EstimatedGrossProfitPlan,
		|	СУММА(ВЫБОР
		|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
		|						ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплате, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
		|					ИНАЧЕ ВТВыпуск.Стоимость
		|				КОНЕЦ
		|		КОНЕЦ) КАК CostIncomePlan,
		|	СУММА(ВЫБОР
		|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
		|						ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплатеБезНДС, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
		|					ИНАЧЕ ВТВыпуск.СтоимостьБезНДС
		|				КОНЕЦ
		|		КОНЕЦ) КАК CostIncome,
		|	СУММА(ВЫБОР
		|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВТВыпуск.лкСебестоимость, 0)
		|		КОНЕЦ) КАК MaterialCost,
		|	СУММА(ВЫБОР
		|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВТВыпуск.лкСебестоимостьПлан, 0)
		|		КОНЕЦ) КАК MaterialCostPlan,
		|	ЕСТЬNULL(ВТВыпуск.Заказ.ТипЗаказа, """") КАК Type,
		|	ВЫБОР
		|		КОГДА ВТВыпуск.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Omega)
		|			ТОГДА ВЫБОР
		|					КОГДА ВТВыпуск.Заказ.Этикетки ПОДОБНО ""%Архангельская С%""
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(ВТВыпуск.Заказ.Цифровой, ЛОЖЬ)
		|	КОНЕЦ КАК Digital
		|ИЗ
		|	ВТВыпуск КАК ВТВыпуск
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ВТВыпуск.РабочийЦентр.ПорядковыйНомер, 0),
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТВыпуск.РабочийЦентр.Описание КАК СТРОКА(50)), """"),
		|	ЕСТЬNULL(ВТВыпуск.Партнер.Код, """"),
		|	ЕСТЬNULL(ВТВыпуск.Партнер.Наименование, """"),
		|	ЕСТЬNULL(ВТВыпуск.Менеджер.Наименование, """"),
		|	ЕСТЬNULL(ВТВыпуск.Заказ.ТипЗаказа, """"),
		|	ВЫБОР
		|		КОГДА ВТВыпуск.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Omega)
		|			ТОГДА ВЫБОР
		|					КОГДА ВТВыпуск.Заказ.Этикетки ПОДОБНО ""%Архангельская С%""
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(ВТВыпуск.Заказ.Цифровой, ЛОЖЬ)
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ВТВыпуск.Партнер.Наименование ПОДОБНО ""%РПС%""
		|				ТОГДА ""Отдел продаж Москва / Moscow branch office""
		|			ИНАЧЕ ВТВыпуск.Партнер.ОсновнойМенеджер.Подразделение.Наименование
		|		КОНЕЦ, ""Производство"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Cost УБЫВ" ;	
	
	
#КонецОбласти
			
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	
	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn); 
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	
	
	
	//Тз = Запрос.Выполнить().Выгрузить();
	//
	//
	//Возврат HttpВернутьТзКакJSON(Тз);
	
	 Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON( Запрос.Выполнить().Выгрузить()));

КонецФункции 


Функция ProductionDetail(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd,PartnerCode ");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
		
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;
	
	
		
	Если ЕстьСвойство(ПараметрыPOST, "PartnerCode") Тогда 
		PartnerCode = ПараметрыPOST.PartnerCode;
	КонецЕсли;
	
	Если ЕстьСвойство(ПараметрыPOST, "WorkCenterNumber") Тогда 
		WorkCenterNumber = Число(ПараметрыPOST.WorkCenterNumber);  
	Иначе
		WorkCenterNumber = 0;
	КонецЕсли;  
	
	Если ЕстьСвойство(ПараметрыPOST, "Manager") Тогда 
		Manager = ПараметрыPOST.Manager;  
	Иначе
		Manager = "";
	КонецЕсли;
	
	
	Запрос = Новый Запрос;    
	
//Выпуск по клиентам из РезультатЗаказа	
#Область Выпуск_ПоКлиентам_Расшифровка_ИзРезультатаЗаказа
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(Лико_ВыпускГПОбороты.Период) КАК Период,
	|	МАКСИМУМ(Лико_ВыпускГПОбороты.РабочийЦентр) КАК РабочийЦентр,
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(Лико_ВыпускГПОбороты.МетражКВМОборот) КАК МетражКВМ,
	|	СУММА(Лико_ВыпускГПОбороты.МетражПМОборот) КАК МетражПМ,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьОборот) КАК лкСебестоимость,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьПланОборот) КАК лкСебестоимостьПлан,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДС
	|ПОМЕСТИТЬ ВТВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ РабочийЦентр.Лико_Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ РабочийЦентр.Лико_Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И Заказ.Партнер.Код = &ПартнерКод
	|				И НЕ Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА &РЦПорядковыйНомер = 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ РабочийЦентр.ПорядковыйНомер = &РЦПорядковыйНомер
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Менеджер = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Заказ.Менеджер.Наименование = &Менеджер
	|				КОНЕЦ) КАК Лико_ВыпускГПОбороты
	|ГДЕ
	|	Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТВыпуск.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТВыпуск.РабочийЦентр.Описание КАК СТРОКА(50)), """") КАК WorkCenterName,
	|	ВТВыпуск.Заказ.Партнер.Наименование КАК PartnerName,
	|	ВТВыпуск.Заказ.Партнер.Код КАК PartnerCode,
	|	ЕСТЬNULL(ВТВыпуск.Заказ.Менеджер.Наименование, """") КАК Manager,
	|	ЕСТЬNULL(ВТВыпуск.Заказ.НомерБезПрефикса, """") КАК Order,
	|	СУММА(ЕСТЬNULL(ВТВыпуск.МетражКВМ, 0)) КАК Square,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплате, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|			ИНАЧЕ ВТВыпуск.Стоимость
	|		КОНЕЦ) КАК Cost,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.Оплата, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|			ИНАЧЕ ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.Оплата, 0)
	|		КОНЕЦ) КАК Payment,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплатеБезНДС, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|			ИНАЧЕ ВТВыпуск.СтоимостьБезНДС
	|		КОНЕЦ) КАК CostNoTax,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.Доход, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК EstimatedGrossProfit,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ДоходТабаш, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК EstimatedGrossProfitPlan,
	|	СУММА(ВЫБОР
	|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|						ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплате, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|					ИНАЧЕ ВТВыпуск.Стоимость
	|				КОНЕЦ
	|		КОНЕЦ) КАК CostIncomePlan,
	|	СУММА(ВЫБОР
	|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|						ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплатеБезНДС, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|					ИНАЧЕ ВТВыпуск.СтоимостьБезНДС
	|				КОНЕЦ
	|		КОНЕЦ) КАК CostIncome,
	|	СУММА(ВЫБОР
	|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ВТВыпуск.лкСебестоимость, 0)
	|		КОНЕЦ) КАК MaterialCost,
	|	СУММА(ВЫБОР
	|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ВТВыпуск.лкСебестоимостьПлан, 0)
	|		КОНЕЦ) КАК MaterialCostPlan,
	|	ЕСТЬNULL(ВТВыпуск.Заказ.Номер, """") КАК _order_num,
	|	ВТВыпуск.Заказ.Дата КАК _order_date
	|ИЗ
	|	ВТВыпуск КАК ВТВыпуск
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТВыпуск.РабочийЦентр.ПорядковыйНомер, 0),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТВыпуск.РабочийЦентр.Описание КАК СТРОКА(50)), """"),
	|	ВТВыпуск.Заказ.Партнер.Код,
	|	ВТВыпуск.Заказ.Партнер.Наименование,
	|	ЕСТЬNULL(ВТВыпуск.Заказ.НомерБезПрефикса, """"),
	|	ЕСТЬNULL(ВТВыпуск.Заказ.Номер, """"),
	|	ВТВыпуск.Заказ.Дата,
	|	ЕСТЬNULL(ВТВыпуск.Заказ.Менеджер.Наименование, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ" ;
	
	
	
#КонецОбласти

	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ПартнерКод", PartnerCode);
	Запрос.УстановитьПараметр("РЦПорядковыйНомер",WorkCenterNumber);
	Запрос.УстановитьПараметр("Менеджер",Manager);

	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);  
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
КонецФункции



Функция Production2(ПараметрыPOST)      //Перерасходы
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);

	
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;

	
	Запрос = Новый Запрос;
	//Выпуск по клиентам 2
#Область Выпуск_ПоКлиентам_2
Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(Лико_ВыпускГПОбороты.Период) КАК Период,
	|	МАКСИМУМ(Лико_ВыпускГПОбороты.РабочийЦентр) КАК РабочийЦентр,
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	Лико_ВыпускГПОбороты.Регистратор КАК Регистратор,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(Лико_ВыпускГПОбороты.МетражКВМОборот) КАК МетражКВМ,
	|	СУММА(Лико_ВыпускГПОбороты.МетражФактОборот) КАК МетражФакт,
	|	СУММА(Лико_ВыпускГПОбороты.МетражПланОборот) КАК МетражПлан,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|					ИЛИ Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражФактОборот - Лико_ВыпускГПОбороты.МетражПланОборот
	|		КОНЕЦ) КАК Перерасход,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражФактОборот - Лико_ВыпускГПОбороты.МетражКВМОборот
	|		КОНЕЦ) КАК Потери,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(Лико_ВыпускГПОбороты.МетражПМОборот) КАК МетражПМ,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьОборот) КАК лкСебестоимость,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|					ИЛИ Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражПланОборот
	|		КОНЕЦ) КАК МетражПланДляПерерасхода,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражФактОборот
	|		КОНЕЦ) КАК МетражФактДляПотерь,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьПланОборот) КАК лкСебестоимостьПлан
	|ПОМЕСТИТЬ ВТВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			РабочийЦентр.Лико_ОсновнаяМашина
	|				И ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ Заказ.Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ Заказ.Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И Заказ.Площадка В
	|					(ВЫБРАТЬ
	|						ПользователиЛико_Площадки.Площадка КАК Площадка
	|					ИЗ
	|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|					ГДЕ
	|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)) КАК Лико_ВыпускГПОбороты
	|ГДЕ
	|	Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	Лико_ВыпускГПОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК Количество,
	|	Лико_ВыпускГПОбороты.Заказ.Тираж КАК Тираж
	|ПОМЕСТИТЬ ВТВсегоВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			{(&ДатаНачала)},
	|			{(&ДатаОкончания)},
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТВыпуск.Заказ КАК Заказ
	|				ИЗ
	|					ВТВыпуск КАК ВТВыпуск)) КАК Лико_ВыпускГПОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	Лико_ВыпускГПОбороты.Заказ.Тираж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВыпуск.Период КАК Период,
	|	ВТВыпуск.РабочийЦентр КАК РабочийЦентр,
	|	ВТВыпуск.Заказ КАК Заказ,
	|	ВТВыпуск.Регистратор КАК Регистратор,
	|	ВТВыпуск.Количество КАК Количество,
	|	ВТВыпуск.МетражКВМ КАК МетражКВМ,
	|	ВТВыпуск.МетражФакт КАК МетражФакт,
	|	ВТВыпуск.МетражПлан КАК МетражПлан,
	|	ВТВыпуск.Перерасход КАК Перерасход,
	|	ВТВыпуск.Потери КАК Потери,
	|	ВТВыпуск.Стоимость КАК Стоимость,
	|	ВТВыпуск.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ВТВыпуск.МетражПМ КАК МетражПМ,
	|	ВТВыпуск.лкСебестоимость КАК лкСебестоимость,
	|	ВТВыпуск.МетражПланДляПерерасхода КАК МетражПланДляПерерасхода,
	|	ВТВыпуск.Количество / ВТВсегоВыпуск.Количество КАК КоэффициентВыпуска,
	|	ВТВыпуск.МетражФактДляПотерь КАК МетражФактДляПотерь,
	|	ВТВсегоВыпуск.Количество КАК КоличествоВсегоВыпуск,
	|	ВТВыпуск.Заказ.СуммаДокумента - ВТВыпуск.Заказ.СтоимостьОснастки КАК СуммаЗаказа,
	|	ВЫБОР
	|		КОГДА ВТВыпуск.Стоимость > 0
	|			ТОГДА ВТВыпуск.СтоимостьБезНДС / ВТВыпуск.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентНДС,
	|	ВТВыпуск.лкСебестоимостьПлан КАК лкСебестоимостьПлан,
	|	ВТВсегоВыпуск.Тираж КАК Тираж
	|ПОМЕСТИТЬ ВТВыпускКоэффициент
	|ИЗ
	|	ВТВыпуск КАК ВТВыпуск
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоВыпуск КАК ВТВсегоВыпуск
	|		ПО ВТВыпуск.Заказ = ВТВсегоВыпуск.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор.ЗаказДавальца.Лико_ЗаказКлиента
	|		ИНАЧЕ ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|	КОНЕЦ КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК Площадь,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) КАК СебестоимостьПрямая,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот + ВыручкаИСебестоимостьПродажОбороты.ДопРасходыОборот + ВыручкаИСебестоимостьПродажОбороты.ПостатейныеПостоянныеСНДСОборот + ВыручкаИСебестоимостьПродажОбороты.ПостатейныеПеременныеСНДСОборот) КАК Себестоимость
	|ПОМЕСТИТЬ ВТПродажиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты({(&ДатаНачала)}, {(&ДатаОкончания)}, Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимостьПродажОбороты.Регистратор) = ТИП(Документ.ОтчетДавальцу)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL
	|		КОНЕЦ
	|	И ВыручкаИСебестоимостьПродажОбороты.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВыручкаИСебестоимостьПродаж.Регистратор КАК Регистратор
	|			ИЗ
	|				РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|			ГДЕ
	|				ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВыручкаИСебестоимостьПродаж.Регистратор
	|			ИЗ
	|				РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|			ГДЕ
	|				ВыручкаИСебестоимостьПродаж.Регистратор.ЗаказДавальца.Лико_ЗаказКлиента В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор.ЗаказДавальца.Лико_ЗаказКлиента
	|		ИНАЧЕ ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ЗатратыПоЗаказуОбороты.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.Партнер КАК Клиент,
	|	СУММА(Лико_ЗатратыПоЗаказуОбороты.СуммаОборот) КАК Транспорт,
	|	СУММА(Лико_ЗатратыПоЗаказуОбороты.СуммаПланОборот) КАК ТранспортПлан,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТТранспорт
	|ИЗ
	|	РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказКлиента В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|				И СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.ТранспортныеРасходы), ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.Факторинг))) КАК Лико_ЗатратыПоЗаказуОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗатратыПоЗаказуОбороты.РабочийЦентр,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.Партнер,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Период КАК Период,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|				ТОГДА 0
	|			ИНАЧЕ ВТПродажиПоЗаказу.Количество
	|		КОНЕЦ) КАК КоличествоПродано,
	|	СУММА(ВТПродажиПоЗаказу.Площадь) КАК МетражКВМПродано,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК Выручка,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаБезНДС,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(0) КАК КоличествоСписано,
	|	СУММА(0) КАК МетражКВМСписано,
	|	МАКСИМУМ(1) КАК Тип,
	|	СУММА(0) КАК КоличествоСборка,
	|	СУММА(0) КАК МетражКВМСборка,
	|	СУММА(ВТПродажиПоЗаказу.СебестоимостьПрямая) КАК СебестоимостьПрямая,
	|	СУММА(ВТПродажиПоЗаказу.Себестоимость) КАК Себестоимость,
	|	СУММА(0) КАК МетражКВМБрак,
	|	СУММА(0) КАК СебестоимостьПрямаяБрак
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор,
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Заказ,
	|	ВТПродажиПоЗаказу.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(-1 * СебестоимостьТоваровОбороты.КоличествоОборот),
	|	СУММА(-1 * (ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2)))),
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот + СебестоимостьТоваровОбороты.ДопРасходыОборот + СебестоимостьТоваровОбороты.ПостатейныеПостоянныеСНДСОборот + СебестоимостьТоваровОбороты.ПостатейныеПеременныеСНДСОборот),
	|	СУММА(ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|				ТОГДА 0
	|			ИНАЧЕ -1 * (ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2)))
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваровОбороты.СтоимостьОборот
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			{(&ДатаНачала)},
	|			{(&ДатаОкончания)},
	|			Регистратор,
	|			АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТВыпуск.Заказ КАК Заказ
	|				ИЗ
	|					ВТВыпуск КАК ВТВыпуск)) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	МАКСИМУМ(4),
	|	СУММА(СебестоимостьТоваровОбороты.КоличествоОборот),
	|	СУММА(ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот + СебестоимостьТоваровОбороты.ДопРасходыОборот + СебестоимостьТоваровОбороты.ПостатейныеПостоянныеСНДСОборот + СебестоимостьТоваровОбороты.ПостатейныеПеременныеСНДСОборот),
	|	СУММА(0),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			{(&ДатаНачала)},
	|			{(&ДатаОкончания)},
	|			Регистратор,
	|			АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|				И РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТОварыНаСкладах)) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	(СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|				И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство))
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВТДанные.Период, МЕСЯЦ) КАК ПериодДвижения,
	|	ВТДанные.Партнер КАК Партнер,
	|	ВТДанные.Договор КАК Договор,
	|	ВТДанные.Регистратор КАК РегистраторДвижения,
	|	ВТДанные.Заказ КАК Заказ,
	|	ВТДанные.КоличествоПродано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК КоличествоПродано,
	|	ВТДанные.КоличествоСписано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК КоличествоСписано,
	|	ВТДанные.МетражКВМПродано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражКВМПродано,
	|	ВТДанные.МетражКВМСписано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражКВМСписано,
	|	ВТДанные.ВыручкаПоПродажеЗаказаБезНДС * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТВыпускКоэффициент.Период КАК ПериодВыпуска,
	|	ВТВыпускКоэффициент.Регистратор КАК РегистраторВыпуска,
	|	ВТВыпускКоэффициент.РабочийЦентр КАК РабочийЦентр,
	|	ВТДанные.КоличествоСборка * ВТВыпускКоэффициент.КоэффициентВыпуска КАК КоличествоСборка,
	|	ВТДанные.МетражКВМСборка * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражКВМСборка,
	|	ВТДанные.ВыручкаПоПродажеЗаказа * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ВыручкаПоПродажеЗаказа,
	|	ВТДанные.МетражКВМБрак * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражБрак,
	|	ВТДанные.СебестоимостьПрямаяБрак * ВТВыпускКоэффициент.КоэффициентВыпуска КАК СебестоимостьПрямаяБрак
	|ПОМЕСТИТЬ ВТДвижения
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыпускКоэффициент КАК ВТВыпускКоэффициент
	|		ПО ВТДанные.Заказ = ВТВыпускКоэффициент.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(ТоварыОрганизацийОстатки.КоличествоОстаток * ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК МетражКВМОстаток
	|ПОМЕСТИТЬ ВТОстаткиПоЗаказам
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			{(&ДатаОкончания)},
	|			АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|				И НЕ АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ТипСкладаГотовойПродукции В (ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас))
	|				И ВЫБОР
	|					КОГДА АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ТипСкладаГотовойПродукции В (ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи))
	|						ТОГДА ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыОрганизацийОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиПоЗаказам.Заказ КАК Заказ,
	|	СУММА(ВЫРАЗИТЬ(ВТОстаткиПоЗаказам.КоличествоОстаток * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ЧИСЛО(15, 2))) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(ВТОстаткиПоЗаказам.МетражКВМОстаток * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ЧИСЛО(15, 2))) КАК МетражКВМОстаток,
	|	СУММА(ВТВыпускКоэффициент.КоэффициентВыпуска * ВЫБОР
	|			КОГДА ВТВыпускКоэффициент.КоличествоВсегоВыпуск <= ВТВыпускКоэффициент.Тираж
	|				ТОГДА ВТОстаткиПоЗаказам.КоличествоОстаток * ВТВыпускКоэффициент.Стоимость / ВТВыпускКоэффициент.Количество
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток) > 0
	|						ТОГДА ВТВыпускКоэффициент.СуммаЗаказа * (ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток)) / ВТВыпускКоэффициент.Тираж
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьОстаток,
	|	СУММА(ВТВыпускКоэффициент.КоэффициентВыпуска * ВЫБОР
	|			КОГДА ВТВыпускКоэффициент.КоличествоВсегоВыпуск <= ВТВыпускКоэффициент.Тираж
	|				ТОГДА ВТОстаткиПоЗаказам.КоличествоОстаток * ВТВыпускКоэффициент.СтоимостьБезНДС / ВТВыпускКоэффициент.Количество
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток) > 0
	|						ТОГДА ВТВыпускКоэффициент.КоэффициентНДС * (ВТВыпускКоэффициент.СуммаЗаказа * (ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток)) / ВТВыпускКоэффициент.Тираж)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДСОстаток,
	|	ВТВыпускКоэффициент.Период КАК ПериодВыпуска,
	|	ВТВыпускКоэффициент.Регистратор КАК РегистраторВыпуска,
	|	ВТВыпускКоэффициент.РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	ВТВыпускКоэффициент КАК ВТВыпускКоэффициент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам
	|		ПО ВТВыпускКоэффициент.Заказ = ВТОстаткиПоЗаказам.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВыпускКоэффициент.Период,
	|	ВТВыпускКоэффициент.Регистратор,
	|	ВТВыпускКоэффициент.РабочийЦентр,
	|	ВТОстаткиПоЗаказам.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВыпускКоэффициент.РабочийЦентр КАК РабочийЦентр,
	|	ВТВыпускКоэффициент.Заказ КАК Заказ,
	|	СУММА(0) КАК СтоимостьБезНДСВыпуск,
	|	СУММА(0) КАК СтоимостьВыпуск,
	|	СУММА(ВТВыпускКоэффициент.Количество) КАК КоличествоВыпуск,
	|	СУММА(ВТВыпускКоэффициент.МетражКВМ) КАК МетражКВМВыпуск,
	|	СУММА(ВТВыпускКоэффициент.Стоимость) КАК СтоимостьВыпускПоЗаказу,
	|	СУММА(ВТВыпускКоэффициент.СтоимостьБезНДС) КАК СтоимостьБезНДСВыпускПоЗаказу,
	|	СУММА(ВТВыпускКоэффициент.МетражФакт) КАК МетражФакт,
	|	СУММА(ВТВыпускКоэффициент.МетражПлан) КАК МетражПлан,
	|	СУММА(ВТВыпускКоэффициент.Перерасход) КАК Перерасход,
	|	СУММА(ВТВыпускКоэффициент.лкСебестоимость) КАК лкСебестоимость,
	|	СУММА(ВТВыпускКоэффициент.МетражПланДляПерерасхода) КАК МетражПланДляПерерасхода,
	|	СУММА(ВТВыпускКоэффициент.МетражФактДляПотерь) КАК МетражФактДляПотерь,
	|	ВТВыпускКоэффициент.Заказ.Площадка КАК Площадка,
	|	СУММА(ВТВыпускКоэффициент.Потери) КАК Потери,
	|	СУММА(ВТВыпускКоэффициент.КоличествоВсегоВыпуск) КАК КоличествоВсегоВыпуск,
	|	СУММА(ВТВыпускКоэффициент.лкСебестоимостьПлан) КАК лкСебестоимостьПлан,
	|	СУММА(0) КАК МетражКВМПродано,
	|	СУММА(0) КАК МетражКВМОстаток
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТВыпускКоэффициент КАК ВТВыпускКоэффициент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВыпускКоэффициент.РабочийЦентр,
	|	ВТВыпускКоэффициент.Заказ,
	|	ВТВыпускКоэффициент.Заказ.Площадка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТОстатки.РабочийЦентр,
	|	ВТОстатки.Заказ,
	|	ВТОстатки.СтоимостьБезНДСОстаток,
	|	ВТОстатки.СтоимостьОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТОстатки.Заказ.Площадка,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТОстатки.МетражКВМОстаток
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДвижения.РабочийЦентр,
	|	ВТДвижения.Заказ,
	|	СУММА(ВТДвижения.ВыручкаПоПродажеЗаказаБезНДС),
	|	СУММА(ВТДвижения.ВыручкаПоПродажеЗаказа),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	ВТДвижения.Заказ.Площадка,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВТДвижения.МетражКВМПродано),
	|	СУММА(0)
	|ИЗ
	|	ВТДвижения КАК ВТДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДвижения.РабочийЦентр,
	|	ВТДвижения.Заказ,
	|	ВТДвижения.Заказ.Площадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.РабочийЦентр КАК РабочийЦентр,
	|	ВТ.Площадка КАК Площадка,
	|	ВТ.Заказ КАК Заказ,
	|	СУММА(ВТ.СтоимостьБезНДСВыпуск) КАК СтоимостьБезНДСВыпуск,
	|	СУММА(ВТ.СтоимостьВыпуск) КАК СтоимостьВыпуск,
	|	СУММА(ВТ.КоличествоВыпуск) КАК КоличествоВыпуск,
	|	СУММА(ВТ.МетражКВМВыпуск) КАК МетражКВМВыпуск,
	|	СУММА(ВТ.СтоимостьВыпускПоЗаказу) КАК СтоимостьВыпускПоЗаказу,
	|	СУММА(ВТ.СтоимостьБезНДСВыпускПоЗаказу) КАК СтоимостьБезНДСВыпускПоЗаказу,
	|	СУММА(ВТ.МетражФакт) КАК МетражФакт,
	|	СУММА(ВТ.МетражПлан) КАК МетражПлан,
	|	СУММА(ВТ.Перерасход) КАК Перерасход,
	|	СУММА(ВТ.лкСебестоимость) КАК лкСебестоимость,
	|	СУММА(ВТ.МетражПланДляПерерасхода) КАК МетражПланДляПерерасхода,
	|	СУММА(ВТ.МетражФактДляПотерь) КАК МетражФактДляПотерь,
	|	СУММА(ВТ.Потери) КАК Потери,
	|	СУММА(ВТ.КоличествоВсегоВыпуск) КАК КоличествоВсегоВыпуск,
	|	СУММА(ВТ.лкСебестоимостьПлан) КАК лкСебестоимостьПлан,
	|	СУММА(ВТ.МетражКВМПродано) КАК МетражКВМПродано,
	|	СУММА(ВТ.МетражКВМОстаток) КАК МетражКВМОстаток
	|ПОМЕСТИТЬ ВТИтог
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.РабочийЦентр,
	|	ВТ.Заказ,
	|	ВТ.Площадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИтог.РабочийЦентр КАК РабочийЦентр,
	|	ВТИтог.Заказ КАК Заказ,
	|	СУММА(ВТИтог.СтоимостьБезНДСВыпуск) КАК СтоимостьБезНДСВыпуск,
	|	СУММА(ВТИтог.СтоимостьВыпуск) КАК СтоимостьВыпуск,
	|	СУММА(ВТИтог.КоличествоВыпуск) КАК КоличествоВыпуск,
	|	СУММА(ВТИтог.МетражКВМВыпуск) КАК МетражКВМВыпуск,
	|	СУММА(ВТИтог.СтоимостьВыпускПоЗаказу) КАК СтоимостьВыпускПоЗаказу,
	|	СУММА(ВТИтог.СтоимостьБезНДСВыпускПоЗаказу) КАК СтоимостьБезНДСВыпускПоЗаказу,
	|	СУММА(ВТИтог.МетражФакт) КАК МетражФакт,
	|	СУММА(ВТИтог.МетражПлан) КАК МетражПлан,
	|	СУММА(ВТИтог.Перерасход) КАК Перерасход,
	|	СУММА(ВТИтог.лкСебестоимость) КАК лкСебестоимость,
	|	СУММА(ВТИтог.МетражПланДляПерерасхода) КАК МетражПланДляПерерасхода,
	|	СУММА(ВТИтог.МетражФактДляПотерь) КАК МетражФактДляПотерь,
	|	ВТИтог.Площадка КАК Площадка,
	|	СУММА(ВТИтог.Потери) КАК Потери,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 1) КАК КоличествоЗаказов,
	|	СУММА(ВТИтог.КоличествоВсегоВыпуск) КАК КоличествоВсегоВыпуск,
	|	ВТИтог.Заказ.Тираж КАК ТиражЗаказа,
	|	СУММА(ВЫБОР
	|			КОГДА ВТИтог.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|					И ВТИтог.КоличествоВыпуск < ВТИтог.Заказ.Тираж
	|				ТОГДА 0
	|			ИНАЧЕ ВТИтог.СтоимостьВыпуск * 0.87 - (ВТИтог.лкСебестоимостьПлан + ЕСТЬNULL(ВТТранспорт.ТранспортПлан, 0))
	|		КОНЕЦ) КАК ДоходПлан,
	|	СУММА(ВТИтог.СтоимостьБезНДСВыпуск - (ВТИтог.лкСебестоимость + ЕСТЬNULL(ВТТранспорт.Транспорт, 0))) КАК Доход,
	|	СУММА(ЕСТЬNULL(ВТИтог.МетражКВМПродано, 0) + ЕСТЬNULL(ВТИтог.МетражКВМОстаток, 0)) КАК МетражДляЦены,
	|	СУММА(ВЫБОР
	|			КОГДА ВТИтог.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|					И ВТИтог.КоличествоВыпуск < ВТИтог.Заказ.Тираж
	|				ТОГДА 0
	|			ИНАЧЕ ВТИтог.СтоимостьВыпуск
	|		КОНЕЦ) КАК CostIncomePlan,
	|	СУММА(ВЫБОР
	|			КОГДА ВТИтог.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|					И ВТИтог.КоличествоВыпуск < ВТИтог.Заказ.Тираж
	|				ТОГДА 0
	|			ИНАЧЕ ВТИтог.СтоимостьБезНДСВыпуск
	|		КОНЕЦ) КАК CostIncome
	|ПОМЕСТИТЬ ВТРЦ
	|ИЗ
	|	ВТИтог КАК ВТИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТранспорт КАК ВТТранспорт
	|		ПО ВТИтог.Заказ = ВТТранспорт.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТИтог.РабочийЦентр,
	|	ВТИтог.Заказ,
	|	ВТИтог.Площадка,
	|	ВТИтог.Заказ.Тираж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТРЦ.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТРЦ.РабочийЦентр.Описание КАК СТРОКА(50)), """") КАК WorkCenterName,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражКВМВыпуск, 0)) КАК Square,
	|	СУММА(ЕСТЬNULL(ВТРЦ.СтоимостьВыпуск, 0)) КАК Cost,
	|	СУММА(ЕСТЬNULL(ВТРЦ.СтоимостьБезНДСВыпуск, 0)) КАК CostNoTax,
	|	СУММА(ЕСТЬNULL(ВТРЦ.КоличествоЗаказов, 0)) КАК OrdersQt,
	|	СУММА(ЕСТЬNULL(ВТРЦ.Доход, 0)) КАК EstimatedGrossProfit,
	|	СУММА(ЕСТЬNULL(ВТРЦ.ДоходПлан, 0)) КАК EstimatedGrossProfitPlan,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражПланДляПерерасхода, 0)) КАК SquareOverspending,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражФактДляПотерь, 0)) КАК Squarelosses,
	|	СУММА(ЕСТЬNULL(ВТРЦ.Перерасход, 0)) КАК Overspending,
	|	СУММА(ЕСТЬNULL(ВТРЦ.Потери, 0)) КАК losses,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражДляЦены, 0)) КАК SquareForPrice,
	|	ВЫБОР
	|		КОГДА ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов = 0
	|			ТОГДА 500
	|		ИНАЧЕ ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов
	|	КОНЕЦ КАК Number,
	|	СУММА(ВТРЦ.CostIncomePlan) КАК CostIncomePlan,
	|	СУММА(ВТРЦ.CostIncome) КАК CostIncome
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТРЦ.РабочийЦентр.ПорядковыйНомер, 0),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТРЦ.РабочийЦентр.Описание КАК СТРОКА(50)), """"),
	|	ВЫБОР
	|		КОГДА ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов = 0
	|			ТОГДА 500
	|		ИНАЧЕ ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Number" ;



#КонецОбласти

	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn); 
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователь);

	//Возврат HttpВернутьТзКакJSON(Тз);
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Запрос.Выполнить().Выгрузить()));
	
КонецФункции

Функция Production2Detail(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, WorkCenterNumber ");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	//// Найдем пользователя 1с
	//UserOS = ПараметрыPOST.UserOS;
	//Если НЕ ЗначениеЗаполнено(UserOS) Тогда
	//	Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	//КонецЕсли;
	//
	//Пользователь=ПолучитьПользователя(UserOS);
	//Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
	//	Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	//Иначе
	//	Если Пользователь.Лико_Площадки.Количество() =0  Тогда
	//		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
	//	КонецЕсли;	
	//КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	
	
	Если ЕстьСвойство(ПараметрыPOST, "WorkCenterNumber") Тогда 
		WorkCenterNumber = Число(ПараметрыPOST.WorkCenterNumber);
	КонецЕсли;
	
	
	Запрос = Новый Запрос; 	
	//Выпуск по клиентам 2  Расшифровка
#Область Выпуск_ПоКлиентам_2_Расшифровка
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(Лико_ВыпускГПОбороты.Период) КАК Период,
	|	МАКСИМУМ(Лико_ВыпускГПОбороты.РабочийЦентр) КАК РабочийЦентр,
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	Лико_ВыпускГПОбороты.Регистратор КАК Регистратор,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(Лико_ВыпускГПОбороты.МетражКВМОборот) КАК МетражКВМ,
	|	СУММА(Лико_ВыпускГПОбороты.МетражФактОборот) КАК МетражФакт,
	|	СУММА(Лико_ВыпускГПОбороты.МетражПланОборот) КАК МетражПлан,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|					ИЛИ Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражФактОборот - Лико_ВыпускГПОбороты.МетражПланОборот
	|		КОНЕЦ) КАК Перерасход,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражФактОборот - Лико_ВыпускГПОбороты.МетражКВМОборот
	|		КОНЕЦ) КАК Потери,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот > 0
	|				ТОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот
	|			ИНАЧЕ Лико_ВыпускГПОбороты.ВремяУУОборот
	|		КОНЕЦ) КАК ВремяУУ,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот > 0
	|				ТОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот
	|			ИНАЧЕ Лико_ВыпускГПОбороты.Время1РЦОборот
	|		КОНЕЦ) КАК Время1РЦОборот,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(Лико_ВыпускГПОбороты.ВремяПробниковОборот) КАК ВремяПробников,
	|	СУММА(Лико_ВыпускГПОбороты.МетражПМОборот) КАК МетражПМ,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьОборот) КАК лкСебестоимость,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|					ИЛИ Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражПланОборот
	|		КОНЕЦ) КАК МетражПланДляПерерасхода,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ Лико_ВыпускГПОбороты.МетражФактОборот
	|		КОНЕЦ) КАК МетражФактДляПотерь,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ВыпускГПОбороты.Заказ) КАК КоличествоЗаказов,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьПланОборот) КАК лкСебестоимостьПлан
	|ПОМЕСТИТЬ ВТВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, РабочийЦентр.ПорядковыйНомер = &РЦПорядковыйНомер) КАК Лико_ВыпускГПОбороты
	|ГДЕ
	|	Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	Лико_ВыпускГПОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_НормативыВыпуска.Период КАК Период,
	|	Лико_НормативыВыпуска.Регистратор КАК Регистратор,
	|	Лико_НормативыВыпуска.Заказ КАК Заказ,
	|	Лико_НормативыВыпуска.РабочийЦентр КАК РабочийЦентр,
	|	СУММА(ВЫРАЗИТЬ((Лико_НормативыВыпуска.ВремяПечати + Лико_НормативыВыпуска.ВремяНаНастройку + Лико_НормативыВыпуска.ВремяНаСменуРоликов) / 60 КАК ЧИСЛО(15, 4))) КАК ВремяСледующихПеределов
	|ПОМЕСТИТЬ ВТВремяСледующихПеределов
	|ИЗ
	|	ВТВыпуск КАК ВТВыпуск
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НормативыВыпуска КАК Лико_НормативыВыпуска
	|		ПО ВТВыпуск.Период = Лико_НормативыВыпуска.Период
	|			И ВТВыпуск.РабочийЦентр = Лико_НормативыВыпуска.РабочийЦентр
	|			И ВТВыпуск.Заказ = Лико_НормативыВыпуска.Заказ
	|			И (Лико_НормативыВыпуска.НомерПроката > 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_НормативыВыпуска.Период,
	|	Лико_НормативыВыпуска.Регистратор,
	|	Лико_НормативыВыпуска.Заказ,
	|	Лико_НормативыВыпуска.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК Количество,
	|	Лико_ВыпускГПОбороты.Заказ.Тираж КАК Тираж
	|ПОМЕСТИТЬ ВТВсегоВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			{(&ДатаНачала)},
	|			{(&ДатаОкончания)},
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТВыпуск.Заказ КАК Заказ
	|				ИЗ
	|					ВТВыпуск КАК ВТВыпуск)) КАК Лико_ВыпускГПОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	Лико_ВыпускГПОбороты.Заказ.Тираж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВыпуск.Период КАК Период,
	|	ВТВыпуск.РабочийЦентр КАК РабочийЦентр,
	|	ВТВыпуск.Заказ КАК Заказ,
	|	ВТВыпуск.Регистратор КАК Регистратор,
	|	ВТВыпуск.Количество КАК Количество,
	|	ВТВыпуск.МетражКВМ КАК МетражКВМ,
	|	ВТВыпуск.МетражФакт КАК МетражФакт,
	|	ВТВыпуск.МетражПлан КАК МетражПлан,
	|	ВТВыпуск.Перерасход КАК Перерасход,
	|	ВТВыпуск.Потери КАК Потери,
	|	ВТВыпуск.ВремяУУ КАК ВремяУУ,
	|	ВТВыпуск.Время1РЦОборот + ЕСТЬNULL(ВТВремяСледующихПеределов.ВремяСледующихПеределов, 0) КАК Время1РЦОборот,
	|	ВТВыпуск.Стоимость КАК Стоимость,
	|	ВТВыпуск.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ВТВыпуск.ВремяПробников КАК ВремяПробников,
	|	ВТВыпуск.МетражПМ КАК МетражПМ,
	|	ВТВыпуск.лкСебестоимость КАК лкСебестоимость,
	|	ВТВыпуск.МетражПланДляПерерасхода КАК МетражПланДляПерерасхода,
	|	ВТВыпуск.Количество / ВТВсегоВыпуск.Количество КАК КоэффициентВыпуска,
	|	ВТВыпуск.МетражФактДляПотерь КАК МетражФактДляПотерь,
	|	ВТВыпуск.КоличествоЗаказов КАК КоличествоЗаказов,
	|	ВТВсегоВыпуск.Количество КАК КоличествоВсегоВыпуск,
	|	ВТВыпуск.Заказ.СуммаДокумента - ВТВыпуск.Заказ.СтоимостьОснастки КАК СуммаЗаказа,
	|	ВЫБОР
	|		КОГДА ВТВыпуск.Стоимость > 0
	|			ТОГДА ВТВыпуск.СтоимостьБезНДС / ВТВыпуск.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентНДС,
	|	ВТВыпуск.лкСебестоимостьПлан КАК лкСебестоимостьПлан,
	|	ВТВсегоВыпуск.Тираж КАК Тираж
	|ПОМЕСТИТЬ ВТВыпускКоэффициент
	|ИЗ
	|	ВТВыпуск КАК ВТВыпуск
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоВыпуск КАК ВТВсегоВыпуск
	|		ПО ВТВыпуск.Заказ = ВТВсегоВыпуск.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяСледующихПеределов КАК ВТВремяСледующихПеределов
	|		ПО ВТВыпуск.Период = ВТВремяСледующихПеределов.Период
	|			И ВТВыпуск.Регистратор = ВТВремяСледующихПеределов.Регистратор
	|			И ВТВыпуск.РабочийЦентр = ВТВремяСледующихПеределов.РабочийЦентр
	|			И ВТВыпуск.Заказ = ВТВремяСледующихПеределов.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор.ЗаказДавальца.Лико_ЗаказКлиента
	|		ИНАЧЕ ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|	КОНЕЦ КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК Площадь,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) КАК СебестоимостьПрямая,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот + ВыручкаИСебестоимостьПродажОбороты.ДопРасходыОборот + ВыручкаИСебестоимостьПродажОбороты.ПостатейныеПостоянныеСНДСОборот + ВыручкаИСебестоимостьПродажОбороты.ПостатейныеПеременныеСНДСОборот) КАК Себестоимость
	|ПОМЕСТИТЬ ВТПродажиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты({(&ДатаНачала)}, {(&ДатаОкончания)}, Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимостьПродажОбороты.Регистратор) = ТИП(Документ.ОтчетДавальцу)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПартнерыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL
	|		КОНЕЦ
	|	И ВыручкаИСебестоимостьПродажОбороты.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВыручкаИСебестоимостьПродаж.Регистратор КАК Регистратор
	|			ИЗ
	|				РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|			ГДЕ
	|				ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВыручкаИСебестоимостьПродаж.Регистратор
	|			ИЗ
	|				РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|			ГДЕ
	|				ВыручкаИСебестоимостьПродаж.Регистратор.ЗаказДавальца.Лико_ЗаказКлиента В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор.ЗаказДавальца.Лико_ЗаказКлиента
	|		ИНАЧЕ ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ЗатратыПоЗаказуОбороты.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.Партнер КАК Клиент,
	|	СУММА(Лико_ЗатратыПоЗаказуОбороты.СуммаОборот) КАК Транспорт,
	|	СУММА(Лико_ЗатратыПоЗаказуОбороты.СуммаПланОборот) КАК ТранспортПлан,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТТранспорт
	|ИЗ
	|	РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказКлиента В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|				И СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.ТранспортныеРасходы), ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.Факторинг))) КАК Лико_ЗатратыПоЗаказуОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗатратыПоЗаказуОбороты.РабочийЦентр,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.Партнер,
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Период КАК Период,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|				ТОГДА 0
	|			ИНАЧЕ ВТПродажиПоЗаказу.Количество
	|		КОНЕЦ) КАК КоличествоПродано,
	|	СУММА(ВТПродажиПоЗаказу.Площадь) КАК МетражКВМПродано,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК Выручка,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаБезНДС,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(0) КАК КоличествоСписано,
	|	СУММА(0) КАК МетражКВМСписано,
	|	МАКСИМУМ(1) КАК Тип,
	|	СУММА(0) КАК КоличествоСборка,
	|	СУММА(0) КАК МетражКВМСборка,
	|	СУММА(ВТПродажиПоЗаказу.СебестоимостьПрямая) КАК СебестоимостьПрямая,
	|	СУММА(ВТПродажиПоЗаказу.Себестоимость) КАК Себестоимость,
	|	СУММА(0) КАК МетражКВМБрак,
	|	СУММА(0) КАК СебестоимостьПрямаяБрак
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор,
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Заказ,
	|	ВТПродажиПоЗаказу.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(-1 * СебестоимостьТоваровОбороты.КоличествоОборот),
	|	СУММА(-1 * (ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2)))),
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот + СебестоимостьТоваровОбороты.ДопРасходыОборот + СебестоимостьТоваровОбороты.ПостатейныеПостоянныеСНДСОборот + СебестоимостьТоваровОбороты.ПостатейныеПеременныеСНДСОборот),
	|	СУММА(ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|				ТОГДА 0
	|			ИНАЧЕ -1 * (ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2)))
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваровОбороты.СтоимостьОборот
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			{(&ДатаНачала)},
	|			{(&ДатаОкончания)},
	|			Регистратор,
	|			АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТВыпуск.Заказ КАК Заказ
	|				ИЗ
	|					ВТВыпуск КАК ВТВыпуск)) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	МАКСИМУМ(4),
	|	СУММА(СебестоимостьТоваровОбороты.КоличествоОборот),
	|	СУММА(ВЫРАЗИТЬ(СебестоимостьТоваровОбороты.КоличествоОборот * СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот),
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьОборот + СебестоимостьТоваровОбороты.ДопРасходыОборот + СебестоимостьТоваровОбороты.ПостатейныеПостоянныеСНДСОборот + СебестоимостьТоваровОбороты.ПостатейныеПеременныеСНДСОборот),
	|	СУММА(0),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			{(&ДатаНачала)},
	|			{(&ДатаОкончания)},
	|			Регистратор,
	|			АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|				И РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТОварыНаСкладах)) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	(СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|				И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство))
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер,
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВТДанные.Период, МЕСЯЦ) КАК ПериодДвижения,
	|	ВТДанные.Партнер КАК Партнер,
	|	ВТДанные.Договор КАК Договор,
	|	ВТДанные.Регистратор КАК РегистраторДвижения,
	|	ВТДанные.Заказ КАК Заказ,
	|	ВТДанные.КоличествоПродано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК КоличествоПродано,
	|	ВТДанные.КоличествоСписано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК КоличествоСписано,
	|	ВТДанные.МетражКВМПродано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражКВМПродано,
	|	ВТДанные.МетражКВМСписано * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражКВМСписано,
	|	ВТДанные.ВыручкаПоПродажеЗаказаБезНДС * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТВыпускКоэффициент.Период КАК ПериодВыпуска,
	|	ВТВыпускКоэффициент.Регистратор КАК РегистраторВыпуска,
	|	ВТВыпускКоэффициент.РабочийЦентр КАК РабочийЦентр,
	|	ВТДанные.КоличествоСборка * ВТВыпускКоэффициент.КоэффициентВыпуска КАК КоличествоСборка,
	|	ВТДанные.МетражКВМСборка * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражКВМСборка,
	|	ВТДанные.ВыручкаПоПродажеЗаказа * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ВыручкаПоПродажеЗаказа,
	|	ВТДанные.МетражКВМБрак * ВТВыпускКоэффициент.КоэффициентВыпуска КАК МетражБрак,
	|	ВТДанные.СебестоимостьПрямаяБрак * ВТВыпускКоэффициент.КоэффициентВыпуска КАК СебестоимостьПрямаяБрак
	|ПОМЕСТИТЬ ВТДвижения
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыпускКоэффициент КАК ВТВыпускКоэффициент
	|		ПО ВТДанные.Заказ = ВТВыпускКоэффициент.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(ТоварыОрганизацийОстатки.КоличествоОстаток * ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 2))) КАК МетражКВМОстаток
	|ПОМЕСТИТЬ ВТОстаткиПоЗаказам
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			{(&ДатаОкончания)},
	|			АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТВыпуск.Заказ КАК Заказ
	|					ИЗ
	|						ВТВыпуск КАК ВТВыпуск)
	|				И НЕ АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ТипСкладаГотовойПродукции В (ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас))
	|				И ВЫБОР
	|					КОГДА АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ТипСкладаГотовойПродукции В (ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи))
	|						ТОГДА ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыОрганизацийОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиПоЗаказам.Заказ КАК Заказ,
	|	СУММА(ВЫРАЗИТЬ(ВТОстаткиПоЗаказам.КоличествоОстаток * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ЧИСЛО(15, 2))) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(ВТОстаткиПоЗаказам.МетражКВМОстаток * ВТВыпускКоэффициент.КоэффициентВыпуска КАК ЧИСЛО(15, 2))) КАК МетражКВМОстаток,
	|	СУММА(ВТВыпускКоэффициент.КоэффициентВыпуска * ВЫБОР
	|			КОГДА ВТВыпускКоэффициент.КоличествоВсегоВыпуск <= ВТВыпускКоэффициент.Тираж
	|				ТОГДА ВТОстаткиПоЗаказам.КоличествоОстаток * ВТВыпускКоэффициент.Стоимость / ВТВыпускКоэффициент.Количество
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток) > 0
	|						ТОГДА ВТВыпускКоэффициент.СуммаЗаказа * (ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток)) / ВТВыпускКоэффициент.Тираж
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьОстаток,
	|	СУММА(ВТВыпускКоэффициент.КоэффициентВыпуска * ВЫБОР
	|			КОГДА ВТВыпускКоэффициент.КоличествоВсегоВыпуск <= ВТВыпускКоэффициент.Тираж
	|				ТОГДА ВТОстаткиПоЗаказам.КоличествоОстаток * ВТВыпускКоэффициент.СтоимостьБезНДС / ВТВыпускКоэффициент.Количество
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток) > 0
	|						ТОГДА ВТВыпускКоэффициент.КоэффициентНДС * (ВТВыпускКоэффициент.СуммаЗаказа * (ВТВыпускКоэффициент.Тираж - (ВТВыпускКоэффициент.КоличествоВсегоВыпуск - ВТОстаткиПоЗаказам.КоличествоОстаток)) / ВТВыпускКоэффициент.Тираж)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДСОстаток,
	|	ВТВыпускКоэффициент.Период КАК ПериодВыпуска,
	|	ВТВыпускКоэффициент.Регистратор КАК РегистраторВыпуска,
	|	ВТВыпускКоэффициент.РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	ВТВыпускКоэффициент КАК ВТВыпускКоэффициент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам
	|		ПО ВТВыпускКоэффициент.Заказ = ВТОстаткиПоЗаказам.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВыпускКоэффициент.Период,
	|	ВТВыпускКоэффициент.Регистратор,
	|	ВТВыпускКоэффициент.РабочийЦентр,
	|	ВТОстаткиПоЗаказам.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВыпускКоэффициент.РабочийЦентр КАК РабочийЦентр,
	|	ВТВыпускКоэффициент.Заказ КАК Заказ,
	|	СУММА(0) КАК СтоимостьБезНДСВыпуск,
	|	СУММА(0) КАК СтоимостьВыпуск,
	|	СУММА(ВТВыпускКоэффициент.Количество) КАК КоличествоВыпуск,
	|	СУММА(ВТВыпускКоэффициент.МетражКВМ) КАК МетражКВМВыпуск,
	|	СУММА(ВТВыпускКоэффициент.Стоимость) КАК СтоимостьВыпускПоЗаказу,
	|	СУММА(ВТВыпускКоэффициент.СтоимостьБезНДС) КАК СтоимостьБезНДСВыпускПоЗаказу,
	|	СУММА(ВТВыпускКоэффициент.ВремяУУ) КАК ВремяУУ,
	|	СУММА(ВТВыпускКоэффициент.Время1РЦОборот) КАК Время1РЦ,
	|	СУММА(ВТВыпускКоэффициент.МетражФакт) КАК МетражФакт,
	|	СУММА(ВТВыпускКоэффициент.МетражПлан) КАК МетражПлан,
	|	СУММА(ВТВыпускКоэффициент.Перерасход) КАК Перерасход,
	|	СУММА(ВТВыпускКоэффициент.лкСебестоимость) КАК лкСебестоимость,
	|	СУММА(ВТВыпускКоэффициент.МетражПланДляПерерасхода) КАК МетражПланДляПерерасхода,
	|	СУММА(ВТВыпускКоэффициент.МетражФактДляПотерь) КАК МетражФактДляПотерь,
	|	ВТВыпускКоэффициент.Заказ.Площадка КАК Площадка,
	|	СУММА(ВТВыпускКоэффициент.Потери) КАК Потери,
	|	СУММА(ВТВыпускКоэффициент.КоличествоВсегоВыпуск) КАК КоличествоВсегоВыпуск,
	|	СУММА(ВТВыпускКоэффициент.лкСебестоимостьПлан) КАК лкСебестоимостьПлан,
	|	СУММА(0) КАК МетражКВМПродано,
	|	СУММА(0) КАК МетражКВМОстаток
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТВыпускКоэффициент КАК ВТВыпускКоэффициент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВыпускКоэффициент.РабочийЦентр,
	|	ВТВыпускКоэффициент.Заказ,
	|	ВТВыпускКоэффициент.Заказ.Площадка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТОстатки.РабочийЦентр,
	|	ВТОстатки.Заказ,
	|	ВТОстатки.СтоимостьБезНДСОстаток,
	|	ВТОстатки.СтоимостьОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТОстатки.Заказ.Площадка,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТОстатки.МетражКВМОстаток
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДвижения.РабочийЦентр,
	|	ВТДвижения.Заказ,
	|	СУММА(ВТДвижения.ВыручкаПоПродажеЗаказаБезНДС),
	|	СУММА(ВТДвижения.ВыручкаПоПродажеЗаказа),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	ВТДвижения.Заказ.Площадка,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВТДвижения.МетражКВМПродано),
	|	СУММА(0)
	|ИЗ
	|	ВТДвижения КАК ВТДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДвижения.РабочийЦентр,
	|	ВТДвижения.Заказ,
	|	ВТДвижения.Заказ.Площадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.РабочийЦентр КАК РабочийЦентр,
	|	ВТ.Заказ КАК Заказ,
	|	СУММА(ВТ.СтоимостьБезНДСВыпуск) КАК СтоимостьБезНДСВыпуск,
	|	СУММА(ВТ.СтоимостьВыпуск) КАК СтоимостьВыпуск,
	|	СУММА(ВТ.КоличествоВыпуск) КАК КоличествоВыпуск,
	|	СУММА(ВТ.МетражКВМВыпуск) КАК МетражКВМВыпуск,
	|	СУММА(ВТ.СтоимостьВыпускПоЗаказу) КАК СтоимостьВыпускПоЗаказу,
	|	СУММА(ВТ.СтоимостьБезНДСВыпускПоЗаказу) КАК СтоимостьБезНДСВыпускПоЗаказу,
	|	СУММА(ВТ.ВремяУУ) КАК ВремяУУ,
	|	СУММА(ВТ.Время1РЦ) КАК Время1РЦ,
	|	СУММА(ВТ.МетражФакт) КАК МетражФакт,
	|	СУММА(ВТ.МетражПлан) КАК МетражПлан,
	|	СУММА(ВТ.Перерасход) КАК Перерасход,
	|	СУММА(ВТ.лкСебестоимость) КАК лкСебестоимость,
	|	СУММА(ВТ.МетражПланДляПерерасхода) КАК МетражПланДляПерерасхода,
	|	СУММА(ВТ.МетражФактДляПотерь) КАК МетражФактДляПотерь,
	|	ВТ.Площадка КАК Площадка,
	|	СУММА(ВТ.Потери) КАК Потери,
	|	СУММА(ВТ.КоличествоВсегоВыпуск) КАК КоличествоВсегоВыпуск,
	|	СУММА(ВТ.лкСебестоимостьПлан) КАК лкСебестоимостьПлан,
	|	СУММА(ВТ.МетражКВМПродано) КАК МетражКВМПродано,
	|	СУММА(ВТ.МетражКВМОстаток) КАК МетражКВМОстаток
	|ПОМЕСТИТЬ ВТИтог
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.РабочийЦентр,
	|	ВТ.Заказ,
	|	ВТ.Площадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИтог.РабочийЦентр КАК РабочийЦентр,
	|	ВТИтог.Заказ КАК Заказ,
	|	СУММА(ВТИтог.СтоимостьБезНДСВыпуск) КАК СтоимостьБезНДСВыпуск,
	|	СУММА(ВТИтог.СтоимостьВыпуск) КАК СтоимостьВыпуск,
	|	СУММА(ВТИтог.КоличествоВыпуск) КАК КоличествоВыпуск,
	|	СУММА(ВТИтог.МетражКВМВыпуск) КАК МетражКВМВыпуск,
	|	СУММА(ВТИтог.СтоимостьВыпускПоЗаказу) КАК СтоимостьВыпускПоЗаказу,
	|	СУММА(ВТИтог.СтоимостьБезНДСВыпускПоЗаказу) КАК СтоимостьБезНДСВыпускПоЗаказу,
	|	СУММА(ВТИтог.ВремяУУ) КАК ВремяУУ,
	|	СУММА(ВТИтог.Время1РЦ) КАК Время1РЦ,
	|	СУММА(ВТИтог.МетражФакт) КАК МетражФакт,
	|	СУММА(ВТИтог.МетражПлан) КАК МетражПлан,
	|	СУММА(ВТИтог.Перерасход) КАК Перерасход,
	|	СУММА(ВТИтог.лкСебестоимость) КАК лкСебестоимость,
	|	СУММА(ВТИтог.МетражПланДляПерерасхода) КАК МетражПланДляПерерасхода,
	|	СУММА(ВТИтог.МетражФактДляПотерь) КАК МетражФактДляПотерь,
	|	ВТИтог.Площадка КАК Площадка,
	|	СУММА(ВТИтог.Потери) КАК Потери,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ 1) КАК КоличествоЗаказов,
	|	СУММА(ВТИтог.КоличествоВсегоВыпуск) КАК КоличествоВсегоВыпуск,
	|	ВТИтог.Заказ.Тираж КАК ТиражЗаказа,
	|	СУММА(ВЫБОР
	|			КОГДА ВТИтог.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|					И ВТИтог.КоличествоВыпуск < ВТИтог.Заказ.Тираж
	|				ТОГДА 0
	|			ИНАЧЕ ВТИтог.СтоимостьВыпуск * 0.87 - (ВТИтог.лкСебестоимостьПлан + ЕСТЬNULL(ВТТранспорт.ТранспортПлан, 0))
	|		КОНЕЦ) КАК ДоходПлан,
	|	СУММА(ВТИтог.СтоимостьБезНДСВыпуск - (ВТИтог.лкСебестоимость + ЕСТЬNULL(ВТТранспорт.Транспорт, 0))) КАК Доход,
	|	СУММА(ЕСТЬNULL(ВТИтог.МетражКВМПродано, 0) + ЕСТЬNULL(ВТИтог.МетражКВМОстаток, 0)) КАК МетражДляЦены,
	|	СУММА(ВЫБОР
	|			КОГДА ВТИтог.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|					И ВТИтог.КоличествоВыпуск < ВТИтог.Заказ.Тираж
	|				ТОГДА 0
	|			ИНАЧЕ ВТИтог.СтоимостьВыпуск
	|		КОНЕЦ) КАК СтоимостьВыпускДляПроцентаДохода,
	|	СУММА(ВЫБОР
	|			КОГДА ВТИтог.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|					И ВТИтог.КоличествоВыпуск < ВТИтог.Заказ.Тираж
	|				ТОГДА 0
	|			ИНАЧЕ ВТИтог.СтоимостьБезНДСВыпуск
	|		КОНЕЦ) КАК СтоимостьБезНДСВыпускДляПроцентаДохода
	|ПОМЕСТИТЬ ВТРЦ
	|ИЗ
	|	ВТИтог КАК ВТИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТранспорт КАК ВТТранспорт
	|		ПО ВТИтог.Заказ = ВТТранспорт.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТИтог.РабочийЦентр,
	|	ВТИтог.Заказ,
	|	ВТИтог.Площадка,
	|	ВТИтог.Заказ.Тираж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТРЦ.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТРЦ.РабочийЦентр.Описание КАК СТРОКА(50)), """") КАК WorkCenterName,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражКВМВыпуск, 0)) КАК Square,
	|	СУММА(ЕСТЬNULL(ВТРЦ.СтоимостьВыпуск, 0)) КАК Cost,
	|	СУММА(ЕСТЬNULL(ВТРЦ.СтоимостьБезНДСВыпуск, 0)) КАК CostNoTax,
	|	СУММА(ЕСТЬNULL(ВТРЦ.КоличествоЗаказов, 0)) КАК OrdersQt,
	|	СУММА(ЕСТЬNULL(ВТРЦ.Доход, 0)) КАК EstimatedGrossProfit,
	|	СУММА(ЕСТЬNULL(ВТРЦ.ДоходПлан, 0)) КАК EstimatedGrossProfitPlan,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражПланДляПерерасхода, 0)) КАК SquareOverspending,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражФактДляПотерь, 0)) КАК Squarelosses,
	|	СУММА(ЕСТЬNULL(ВТРЦ.Перерасход, 0)) КАК Overspending,
	|	СУММА(ЕСТЬNULL(ВТРЦ.Потери, 0)) КАК losses,
	|	СУММА(ЕСТЬNULL(ВТРЦ.МетражДляЦены, 0)) КАК SquareForPrice,
	|	ВЫБОР
	|		КОГДА ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов = 0
	|			ТОГДА 500
	|		ИНАЧЕ ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов
	|	КОНЕЦ КАК Number,
	|	ВТРЦ.Заказ.Номер КАК _order_num,
	|	ВТРЦ.Заказ.Дата КАК _order_date,
	|	ВТРЦ.Заказ.НомерБезПрефикса КАК Order,
	|	СУММА(ЕСТЬNULL(ВТРЦ.СтоимостьВыпускДляПроцентаДохода, 0)) КАК CostIncomePlan,
	|	СУММА(ЕСТЬNULL(ВТРЦ.СтоимостьБезНДСВыпускДляПроцентаДохода, 0)) КАК CostIncome
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТРЦ.РабочийЦентр.ПорядковыйНомер, 0),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТРЦ.РабочийЦентр.Описание КАК СТРОКА(50)), """"),
	|	ВЫБОР
	|		КОГДА ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов = 0
	|			ТОГДА 500
	|		ИНАЧЕ ВТРЦ.РабочийЦентр.Лико_НомерДляОтчетов
	|	КОНЕЦ,
	|	ВТРЦ.Заказ.Дата,
	|	ВТРЦ.Заказ.Номер,
	|	ВТРЦ.Заказ.НомерБезПрефикса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Overspending УБЫВ" ;



#КонецОбласти

	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("РЦПорядковыйНомер",WorkCenterNumber);	
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
КонецФункции


Функция SettlementsWithClients(ПараметрыPOST)
		
	Запрос = Новый Запрос;   

#Область Расчеты_С_Клиентами
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгУпрОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток < 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаУпрОстаток
	|		КОНЕЦ) КАК ПредоплатаУпр,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток < 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаОстаток
	|		КОНЕЦ) КАК Предоплата
	|ПОМЕСТИТЬ ВТПоДок
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			,
	|			НЕ АналитикаУчетаПоПартнерам.Партнер В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ПартнерыДополнительныеРеквизиты.Ссылка КАК Ссылка
	|						ИЗ
	|							Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|						ГДЕ
	|							ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация""
	|			
	|						ОБЪЕДИНИТЬ ВСЕ
	|			
	|						ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Партнеры.Ссылка
	|						ИЗ
	|							Справочник.Партнеры КАК Партнеры
	|						ГДЕ
	|							Партнеры.Лико_ПлатежнаяДисциплина.Наименование ПОДОБНО ""%Плохой долг%"")
	|				И НЕ ЕСТЬNULL(АналитикаУчетаПоПартнерам.Контрагент.Лико_ПлатежнаяДисциплина.Наименование, """") ПОДОБНО ""%Плохой долг%""
	|				И НЕ АналитикаУчетаПоПартнерам.Договор.СтатьяДвиженияДенежныхСредств.ПометкаУдаления
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК РасчетыСКлиентамиПоСрокамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	СУММА(ВТПоДок.ДолгУпрОстаток) КАК ДолгУпрОстаток,
	|	СУММА(ВТПоДок.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	СУММА(ВТПоДок.ДолгУпрОстаток - ВТПоДок.ПредоплатаУпр) КАК ДолгПлюсПредоплатаУпр
	|ПОМЕСТИТЬ ВТПартнеры
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(ВТПоДок.ДолгУпрОстаток) КАК ДолгУпрОстаток,
	|	СУММА(ВТПоДок.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	СУММА(ВТПоДок.ДолгУпрОстаток - ВТПоДок.ПредоплатаУпр) КАК ДолгПлюсПредоплатаУпр,
	|	СУММА(ВТПоДок.Предоплата) КАК Предоплата,
	|	СУММА(ВТПоДок.ДолгОстаток) КАК ДолгОстаток,
	|	СУММА(ВТПоДок.ДолгОстаток - ВТПоДок.Предоплата) КАК ДолгПлюсПредоплата
	|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикам
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр КАК ДолгПлюсПредоплатаУпр,
	|	МАКСИМУМ(РасчетыСКлиентами.ДатаПлатежа) КАК ДатаПлатежа,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация КАК Организация
	|ПОМЕСТИТЬ ВТДолг
	|ИЗ
	|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
	|			И (РасчетыСКлиентами.КОплате > 0)
	|			И (РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|ГДЕ
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДолг.Партнер КАК Партнер,
	|	ВТДолг.Организация КАК Организация,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|				ТОГДА ВТДолг.ДолгПлюсПредоплатаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгПросрочен,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), ДЕНЬ)
	|				ТОГДА ВТДолг.ДолгПлюсПредоплатаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПросроченБолееМесяца
	|ПОМЕСТИТЬ ВТДолгПросрочено
	|ИЗ
	|	ВТДолг КАК ВТДолг
	|ГДЕ
	|	ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДолг.Партнер,
	|	ВТДолг.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер КАК Партнер,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта.Код = ""643""
	|				ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма / КурсыВалютСрезПоследних.Курс
	|			ИНАЧЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
	|		КОНЕЦ) КАК СуммаПлатежа,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация КАК Организация,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта КАК Валюта,
	|	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТНеПроведенныеПлатежи
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта.Код = ""978"") КАК КурсыВалютСрезПоследних,
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|		ПО ПоступлениеБезналичныхДенежныхСредств.Ссылка = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка
	|ГДЕ
	|	ПоступлениеБезналичныхДенежныхСредств.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -3), ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ПоступлениеБезналичныхДенежныхСредств.Проведен = ЛОЖЬ
	|	И ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер ЕСТЬ NULL
	|	И НЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер.Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВТПартнеры.Партнер.Наименование ПОДОБНО ""%РПС%""
	|			ТОГДА ""Отдел продаж Москва / Moscow branch office""
	|		ИНАЧЕ ВТПартнеры.Партнер.ОсновнойМенеджер.Подразделение.Наименование
	|	КОНЕЦ КАК Region,
	|	ВЫБОР
	|		КОГДА ВТПартнеры.Партнер.Наименование ПОДОБНО ""%РПС%""
	|			ТОГДА ""Дымнич Денис""
	|		ИНАЧЕ ВТПартнеры.Партнер.ОсновнойМенеджер.Наименование
	|	КОНЕЦ КАК Manager,
	|	ВТПартнеры.Партнер.Код КАК PartnerCode,
	|	ВТПартнеры.Партнер КАК PartnerName,
	|	СУММА(ВТПартнеры.ДолгПлюсПредоплатаУпр - ЕСТЬNULL(ВТНеПроведенныеПлатежи.СуммаПлатежа, 0)) КАК Balance,
	|	СУММА(ЕСТЬNULL(ВТДолгПросрочено.ДолгПросрочен, 0)) КАК Overdue,
	|	СУММА(ЕСТЬNULL(ВТДолгПросрочено.ПросроченБолееМесяца, 0)) КАК OverdueMoreAMonth,
	|	СУММА(ЕСТЬNULL(ВТПартнеры.ДолгУпрОстаток, 0)) КАК Duty,
	|	СУММА(ЕСТЬNULL(ВТПартнеры.ПредоплатаУпр, 0) + ЕСТЬNULL(ВТНеПроведенныеПлатежи.СуммаПлатежа, 0)) КАК Advance
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТПартнеры КАК ВТПартнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДолгПросрочено КАК ВТДолгПросрочено
	|		ПО ВТПартнеры.Партнер = ВТДолгПросрочено.Партнер
	|			И ВТПартнеры.Организация = ВТДолгПросрочено.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеПроведенныеПлатежи КАК ВТНеПроведенныеПлатежи
	|		ПО ВТПартнеры.Партнер = ВТНеПроведенныеПлатежи.Партнер
	|			И ВТПартнеры.Организация = ВТНеПроведенныеПлатежи.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПартнеры.Партнер,
	|	ВТПартнеры.Партнер.Код,
	|	ВЫБОР
	|		КОГДА ВТПартнеры.Партнер.Наименование ПОДОБНО ""%РПС%""
	|			ТОГДА ""Отдел продаж Москва / Moscow branch office""
	|		ИНАЧЕ ВТПартнеры.Партнер.ОсновнойМенеджер.Подразделение.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТПартнеры.Партнер.Наименование ПОДОБНО ""%РПС%""
	|			ТОГДА ""Дымнич Денис""
	|		ИНАЧЕ ВТПартнеры.Партнер.ОсновнойМенеджер.Наименование
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Region КАК Region,
	|	ВТ.Manager КАК Manager,
	|	ВТ.PartnerCode КАК PartnerCode,
	|	ВТ.PartnerName КАК PartnerName,
	|	ВТ.Balance КАК Balance,
	|	ВТ.Overdue КАК Overdue,
	|	ВТ.OverdueMoreAMonth КАК OverdueMoreAMonth,
	|	ВТ.Duty КАК Duty,
	|	ВТ.Advance КАК Advance
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	НЕ(ВТ.Duty < 100
	|				И ВТ.Advance < 100)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Overdue УБЫВ";	
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	//Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	//	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	//Возврат HttpВернутьТзКакJSON(Тз);
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Тз));
	
КонецФункции

Функция SettlementsWithClientsDetail(ПараметрыPOST)
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "PartnerCode");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;  
	
	PartnerCode = ПараметрыPOST.PartnerCode;
	
	
	Запрос = Новый Запрос; 
	#Область Расчеты_С_Клиентами_Расшифровка   
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгУпрОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток < 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаУпрОстаток
	|		КОНЕЦ) КАК ПредоплатаУпр,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток > 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток < 0
	|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаОстаток
	|		КОНЕЦ) КАК Предоплата
	|ПОМЕСТИТЬ ВТПоДок
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			,
	|			НЕ АналитикаУчетаПоПартнерам.Партнер В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ПартнерыДополнительныеРеквизиты.Ссылка КАК Ссылка
	|						ИЗ
	|							Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|						ГДЕ
	|							ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация""
	|			
	|						ОБЪЕДИНИТЬ ВСЕ
	|			
	|						ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Партнеры.Ссылка
	|						ИЗ
	|							Справочник.Партнеры КАК Партнеры
	|						ГДЕ
	|							Партнеры.Лико_ПлатежнаяДисциплина.Наименование ПОДОБНО ""%Плохой долг%"")
	|				И НЕ ЕСТЬNULL(АналитикаУчетаПоПартнерам.Контрагент.Лико_ПлатежнаяДисциплина.Наименование, """") ПОДОБНО ""%Плохой долг%""
	|				И НЕ АналитикаУчетаПоПартнерам.Договор.СтатьяДвиженияДенежныхСредств.ПометкаУдаления
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|				И НЕ АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА &PartnerCode = """"
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ АналитикаУчетаПоПартнерам.Партнер.Код = &PartnerCode
	|				КОНЕЦ) КАК РасчетыСКлиентамиПоСрокамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	СУММА(ВТПоДок.ДолгУпрОстаток) КАК ДолгУпрОстаток,
	|	СУММА(ВТПоДок.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	СУММА(ВТПоДок.ДолгУпрОстаток - ВТПоДок.ПредоплатаУпр) КАК ДолгПлюсПредоплатаУпр
	|ПОМЕСТИТЬ ВТПарнетры
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(ВТПоДок.ДолгУпрОстаток) КАК ДолгУпрОстаток,
	|	СУММА(ВТПоДок.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	СУММА(ВТПоДок.ДолгУпрОстаток - ВТПоДок.ПредоплатаУпр) КАК ДолгПлюсПредоплатаУпр,
	|	СУММА(ВТПоДок.Предоплата) КАК Предоплата,
	|	СУММА(ВТПоДок.ДолгОстаток) КАК ДолгОстаток,
	|	СУММА(ВТПоДок.ДолгОстаток - ВТПоДок.Предоплата) КАК ДолгПлюсПредоплата
	|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикам
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыСКлиентами.Регистратор.Соглашение, ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяССылка)) КАК Соглашение,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр КАК ДолгПлюсПредоплатаУпр,
	|	МАКСИМУМ(РасчетыСКлиентами.ДатаПлатежа) КАК ДатаПлатежа,
	|	МИНИМУМ(РасчетыСКлиентами.Регистратор.Дата) КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТДолг
	|ИЗ
	|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
	|			И (РасчетыСКлиентами.КОплате > 0)
	|			И (РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|ГДЕ
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр,
	|	ЕСТЬNULL(РасчетыСКлиентами.Регистратор.Соглашение, ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяССылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДолг.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТДолг.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|				ТОГДА ВТДолг.ДолгПлюсПредоплатаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгПросрочен,
	|	ВТДолг.ДатаПлатежа КАК ДатаПлатежа,
	|	СУММА(ВТДолг.ДолгПлюсПредоплатаУпр) КАК Долг,
	|	ВТДолг.ДатаДокумента КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТДолгПросрочено
	|ИЗ
	|	ВТДолг КАК ВТДолг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДолг.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТДолг.АналитикаУчетаПоПартнерам,
	|	ВТДолг.ДатаПлатежа,
	|	ВТДолг.ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеБезналичныхДенежныхСредств.Партнер КАК Партнер,
	|	ПоступлениеБезналичныхДенежныхСредств.Валюта КАК Валюта,
	|	СУММА(ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента * ЕСТЬNULL(КурсыВалютСрезПоследних1.Курс, 1) / КурсыВалютСрезПоследних.Курс) КАК СуммаПлатежа,
	|	ПоступлениеБезналичныхДенежныхСредств.Организация КАК Организация,
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент КАК Контрагент,
	|	СУММА(ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента) КАК Сумма
	|ПОМЕСТИТЬ ВТНеПроведенныеПлатежи
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			,
	|			Валюта В
	|				(ВЫБРАТЬ
	|					ВалютаУправленческогоУчета.Значение КАК Значение
	|				ИЗ
	|					Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета)) КАК КурсыВалютСрезПоследних,
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних1
	|		ПО ПоступлениеБезналичныхДенежныхСредств.Валюта = КурсыВалютСрезПоследних1.Валюта
	|ГДЕ
	|	ПоступлениеБезналичныхДенежныхСредств.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -3), ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ПоступлениеБезналичныхДенежныхСредств.Проведен = ЛОЖЬ
	|	И ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &PartnerCode = """"
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПоступлениеБезналичныхДенежныхСредств.Партнер.Код = &PartnerCode
	|		КОНЕЦ
	|	И НЕ ПоступлениеБезналичныхДенежныхСредств.Партнер ЕСТЬ NULL
	|	И НЕ ПоступлениеБезналичныхДенежныхСредств.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И ПоступлениеБезналичныхДенежныхСредств.Партнер.Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеБезналичныхДенежныхСредств.Партнер,
	|	ПоступлениеБезналичныхДенежныхСредств.Организация,
	|	ПоступлениеБезналичныхДенежныхСредств.Валюта,
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Договор КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	ВТ_РасчетыПоАналитикам.ДолгУпрОстаток КАК ДолгУпрОстаток,
	|	ВТ_РасчетыПоАналитикам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр КАК ДолгПлюсПредоплатаУпр,
	|	ВТ_РасчетыПоАналитикам.ДолгОстаток КАК ДолгОстаток,
	|	ВТ_РасчетыПоАналитикам.Предоплата КАК Предоплата,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата КАК ДолгПлюсПредоплата,
	|	ЕСТЬNULL(ВТДолгПросрочено.ДолгПросрочен, 0) КАК ДолгПросрочен,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер КАК Менеджер,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер.Подразделение КАК Подразделение,
	|	0 КАК НеПроведенныйПлатеж,
	|	ВТДолгПросрочено.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Договор.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТДолгПросрочено.ДатаДокумента КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ВТДолгПросрочено.ДатаПлатежа < &Дата
	|			ТОГДА ЕСТЬNULL(РАЗНОСТЬДАТ(ВТДолгПросрочено.ДатаПлатежа, &Дата, ДЕНЬ), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДнейПросрочки,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Договор.ВалютаВзаиморасчетов.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Договор.ВалютаВзаиморасчетов
	|		ИНАЧЕ ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Договор.ВалютаВзаиморасчетов.ОсновнаяВалюта
	|	КОНЕЦ КАК ОсновнаяВалюта,
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(ВТДолгПросрочено.ДатаДокумента, ВТДолгПросрочено.ДатаПлатежа, ДЕНЬ), 0) КАК Отсрочка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДолгПросрочено КАК ВТДолгПросрочено
	|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = ВТДолгПросрочено.АналитикаУчетаПоПартнерам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ВТНеПроведенныеПлатежи.Партнер,
	|	ВТНеПроведенныеПлатежи.Организация,
	|	МАКСИМУМ(ВТНеПроведенныеПлатежи.Контрагент),
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	СУММА(0),
	|	СУММА(ВТНеПроведенныеПлатежи.СуммаПлатежа),
	|	-1 * ВТНеПроведенныеПлатежи.СуммаПлатежа,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(-1 * ВТНеПроведенныеПлатежи.Сумма),
	|	СУММА(0),
	|	ВТНеПроведенныеПлатежи.Партнер.ОсновнойМенеджер,
	|	ВТНеПроведенныеПлатежи.Партнер.ОсновнойМенеджер.Подразделение,
	|	ВТНеПроведенныеПлатежи.СуммаПлатежа,
	|	NULL,
	|	ВТНеПроведенныеПлатежи.Валюта,
	|	NULL,
	|	СУММА(0),
	|	МАКСИМУМ(ВТНеПроведенныеПлатежи.Валюта),
	|	СУММА(0)
	|ИЗ
	|	ВТНеПроведенныеПлатежи КАК ВТНеПроведенныеПлатежи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНеПроведенныеПлатежи.Партнер,
	|	ВТНеПроведенныеПлатежи.Организация,
	|	ВТНеПроведенныеПлатежи.Партнер.ОсновнойМенеджер,
	|	ВТНеПроведенныеПлатежи.Партнер.ОсновнойМенеджер.Подразделение,
	|	ВТНеПроведенныеПлатежи.СуммаПлатежа,
	|	-1 * ВТНеПроведенныеПлатежи.СуммаПлатежа,
	|	ВТНеПроведенныеПлатежи.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ.Контрагент.Наименование, """") КАК ClientName,
	|	ЕСТЬNULL(ВТ.Договор.Наименование, """") КАК ContractName,
	|	СУММА(ЕСТЬNULL(ВТ.ДолгПлюсПредоплатаУпр, 0)) КАК Balance,
	|	СУММА(ЕСТЬNULL(ВТ.ДолгПросрочен, 0)) КАК Overdue,
	|	ЕСТЬNULL(ВТ.ДнейПросрочки, 0) КАК OverduePeriod,
	|	ЕСТЬNULL(ВТ.ДатаПлатежа, ДАТАВРЕМЯ(1, 1, 1)) КАК PaymentDay
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ.Контрагент.Наименование, """"),
	|	ЕСТЬNULL(ВТ.Договор.Наименование, """"),
	|	ЕСТЬNULL(ВТ.ДнейПросрочки, 0),
	|	ЕСТЬNULL(ВТ.ДатаПлатежа, ДАТАВРЕМЯ(1, 1, 1))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Overdue УБЫВ" ;
	
	#КонецОбласти
	
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Запрос.УстановитьПараметр("PartnerCode",PartnerCode);
	//	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	//Возврат HttpВернутьТзКакJSON(Тз);
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Тз));
	
КонецФункции


Функция SettlementsWithProviders(ПараметрыPOST)
		
	Запрос = Новый Запрос;  
	//Расчеты с поставщиками 
	
	#Область Расчеты_С_Постащиками_2_Вариант
	Запрос.Текст =   
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ПредопределенныеЗначения.ЗначениеПараметра КАК Организация
	|ПОМЕСТИТЬ СибирьУрал
	|ИЗ
	|	Справочник.Лико_ПредопределенныеЗначения КАК Лико_ПредопределенныеЗначения
	|ГДЕ
	|	Лико_ПредопределенныеЗначения.Ссылка В (ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияЭкофлекс), ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер
	|ПОМЕСТИТЬ ПартнерыСобственныеОрганизации
	|ИЗ
	|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(РасчетыСПоставщикамиПоСрокамОстатки.ДолгУпрОстаток) КАК Долг,
	|	СУММА(РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаУпрОстаток) КАК Предоплата,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка > 0
	|				ТОГДА РасчетыСПоставщикамиПоСрокамОстатки.ДолгОстаток * (1 + РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка / 100)
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокамОстатки.ДолгОстаток
	|		КОНЕЦ) КАК ДолгВВалютеВзаиморасчетов,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка > 0
	|				ТОГДА 1 + РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка / 100
	|			ИНАЧЕ 1
	|		КОНЕЦ * РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаОстаток) КАК ПредоплатаВВалютеВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ КАК ОсновнаяВалюта,
	|	РасчетыСПоставщикамиПоСрокамОстатки.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТПоДок
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			,
	|			ВЫБОР
	|					КОГДА АналитикаУчетаПоПартнерам.Партнер В
	|							(ВЫБРАТЬ
	|								ПартнерыСобственныеОрганизации.Партнер КАК Партнер
	|							ИЗ
	|								ПартнерыСобственныеОрганизации КАК ПартнерыСобственныеОрганизации)
	|						ТОГДА АналитикаУчетаПоПартнерам.Организация В
	|								(ВЫБРАТЬ
	|									СибирьУрал.Организация КАК Организация
	|								ИЗ
	|									СибирьУрал КАК СибирьУрал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ ЕСТЬNULL(АналитикаУчетаПоПартнерам.Договор.СтатьяДвиженияДенежныхСредств.ПометкаУдаления, ЛОЖЬ)) КАК РасчетыСПоставщикамиПоСрокамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПоСрокамОстатки.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоСрокамОстатки.Валюта,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	РасчетыПоФинансовымИнструментамОстатки.АналитикаУчетаПоПартнерам,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток < 0
	|				ТОГДА -1 * РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток > 0
	|				ТОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток < 0
	|				ТОГДА -1 * РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток > 0
	|				ТОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта
	|		ИНАЧЕ РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ,
	|	РасчетыПоФинансовымИнструментамОстатки.Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам.Партнер В
	|					(ВЫБРАТЬ
	|						ПартнерыСобственныеОрганизации.Партнер КАК Партнер
	|					ИЗ
	|						ПартнерыСобственныеОрганизации КАК ПартнерыСобственныеОрганизации)
	|				И АналитикаУчетаПоПартнерам.Организация В
	|					(ВЫБРАТЬ
	|						СибирьУрал.Организация КАК Организация
	|					ИЗ
	|						СибирьУрал КАК СибирьУрал)) КАК РасчетыПоФинансовымИнструментамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоФинансовымИнструментамОстатки.АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта
	|		ИНАЧЕ РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ,
	|	РасчетыПоФинансовымИнструментамОстатки.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|			ТОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Контрагент
	|		ИНАЧЕ ВТПоДок.АналитикаУчетаПоПартнерам.Партнер
	|	КОНЕЦ КАК Партнер,
	|	ВТПоДок.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|	СУММА(ВТПоДок.Долг) КАК Долг,
	|	СУММА(ВТПоДок.Предоплата) КАК Предоплата,
	|	СУММА(ВТПоДок.Долг - ВТПоДок.Предоплата) КАК ДолгПлюсПредоплата
	|ПОМЕСТИТЬ ВТПарнетры
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Организация,
	|	ВТПоДок.ОсновнаяВалюта,
	|	ВЫБОР
	|		КОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|			ТОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Контрагент
	|		ИНАЧЕ ВТПоДок.АналитикаУчетаПоПартнерам.Партнер
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТПоДок.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|	СУММА(ВТПоДок.Долг) КАК Долг,
	|	СУММА(ВТПоДок.Предоплата) КАК Предоплата,
	|	СУММА(ВТПоДок.Долг - ВТПоДок.Предоплата) КАК ДолгПлюсПредоплата,
	|	СУММА(ВТПоДок.ПредоплатаВВалютеВзаиморасчетов) КАК ПредоплатаВВалютеВзаиморасчетов,
	|	СУММА(ВТПоДок.ДолгВВалютеВзаиморасчетов) КАК ДолгВВалютеВзаиморасчетов,
	|	СУММА(ВТПоДок.ДолгВВалютеВзаиморасчетов - ВТПоДок.ПредоплатаВВалютеВзаиморасчетов) КАК ДолгПлюсПредоплатаВВалютеВзаиморасчетов,
	|	ВТПоДок.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикам
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам,
	|	ВТПоДок.ОсновнаяВалюта,
	|	ВТПоДок.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата КАК ДолгПлюсПредоплата,
	|	МАКСИМУМ(РасчетыСПоставщиками.ДатаПлатежа) КАК ДатаПлатежа,
	|	МИНИМУМ(РасчетыСПоставщиками.Регистратор.Дата) КАК ДатаДокумента,
	|	ВТ_РасчетыПоАналитикам.Долг КАК Долг,
	|	ВТ_РасчетыПоАналитикам.ДолгВВалютеВзаиморасчетов КАК ДолгВВалютеВзаиморасчетов
	|ПОМЕСТИТЬ ВТДолг
	|ИЗ
	|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам
	|			И (РасчетыСПоставщиками.КОплате > 0)
	|			И (РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|ГДЕ
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата,
	|	ВТ_РасчетыПоАналитикам.Долг,
	|	ВТ_РасчетыПоАналитикам.ДолгВВалютеВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДолг.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТДолг.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|				ТОГДА ВТДолг.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгПросрочен,
	|	ВТДолг.ДатаПлатежа КАК ДатаПлатежа,
	|	СУММА(ВТДолг.Долг) КАК Долг,
	|	ВТДолг.ДатаДокумента КАК ДатаДокумента,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), ДЕНЬ)
	|				ТОГДА ВТДолг.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгПросроченБольшеМесяца,
	|	СУММА(ВТДолг.ДолгВВалютеВзаиморасчетов) КАК ДолгВВ,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|				ТОГДА ВТДолг.ДолгВВалютеВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгВВПросрочен,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), ДЕНЬ)
	|				ТОГДА ВТДолг.ДолгВВалютеВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгВВПросроченБольшеМесяца
	|ПОМЕСТИТЬ ВТДолгПросрочено
	|ИЗ
	|	ВТДолг КАК ВТДолг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДолг.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТДолг.АналитикаУчетаПоПартнерам,
	|	ВТДолг.ДатаПлатежа,
	|	ВТДолг.ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ВТ_РасчетыПоАналитикам.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|	СУММА(ВТ_РасчетыПоАналитикам.Долг) КАК Долг,
	|	СУММА(ВТ_РасчетыПоАналитикам.Предоплата) КАК Предоплата,
	|	СУММА(ВТ_РасчетыПоАналитикам.ДолгВВалютеВзаиморасчетов) КАК ДолгВВалютеВзаиморасчетов,
	|	СУММА(ВТ_РасчетыПоАналитикам.ПредоплатаВВалютеВзаиморасчетов) КАК ПредоплатВВалютеВзаиморасчетова,
	|	СУММА(ЕСТЬNULL(ВТДолгПросрочено.ДолгПросрочен, 0)) КАК ДолгПросрочен,
	|	СУММА(ЕСТЬNULL(ВТДолгПросрочено.ДолгВВПросрочен, 0)) КАК ДолгВВПросрочен
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДолгПросрочено КАК ВТДолгПросрочено
	|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = ВТДолгПросрочено.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПарнетры КАК ВТПарнетры
	|		ПО (ВЫБОР
	|				КОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|					ТОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Контрагент = ВТПарнетры.Партнер
	|				ИНАЧЕ ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер = ВТПарнетры.Партнер
	|			КОНЕЦ)
	|			И ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация = ВТПарнетры.Организация
	|			И ВТ_РасчетыПоАналитикам.ОсновнаяВалюта = ВТПарнетры.ОсновнаяВалюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоАналитикам.ОсновнаяВалюта,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанные.Организация.ИНН КАК OrganizationCode,
	|	ВТДанные.Организация.Наименование КАК OrganizationName,
	|	МАКСИМУМ(ВТДанные.Организация.ИНН) КАК BaseCurrencyCode,
	|	МАКСИМУМ(ВТДанные.Организация.Наименование) КАК BaseCurrencyName,
	|	СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.Долг КАК ЧИСЛО(15, 0)), 0)) КАК Duty,
	|	СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.Предоплата КАК ЧИСЛО(15, 0)), 0)) КАК Prepainment,
	|	СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.ДолгПросрочен КАК ЧИСЛО(15, 0)), 0)) КАК Overdue,
	|	МАКСИМУМ(1) КАК Type
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.Организация.ИНН,
	|	ВТДанные.Организация.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ВТДанные.Организация.ИНН,
	|	ВТДанные.Организация.Наименование,
	|	ВТДанные.ОсновнаяВалюта.Код,
	|	ВТДанные.ОсновнаяВалюта.Наименование,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.ДолгВВалютеВзаиморасчетов КАК ЧИСЛО(15, 0)), 0),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.ПредоплатВВалютеВзаиморасчетова КАК ЧИСЛО(15, 0)), 0),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.ДолгВВПросрочен КАК ЧИСЛО(15, 0)), 0),
	|	2
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	OrganizationName,
	|	Type";
	#КонецОбласти
	
	
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	//Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	//	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	//Возврат HttpВернутьТзКакJSON(Тз);
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Тз));
	
КонецФункции

Функция SettlementsWithProvidersDetail(ПараметрыPOST)
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "SiteInn,CurrencyCode");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	SiteInn    = ПараметрыPOST.SiteInn;
	CurrencyCode = ПараметрыPOST.CurrencyCode;
//	Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));

	//
	//// Найдем пользователя 1с
	//UserOS = ПараметрыPOST.UserOS;
	//Если НЕ ЗначениеЗаполнено(UserOS) Тогда
	//	Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	//КонецЕсли;
	//
	//Пользователь=ПолучитьПользователя(UserOS);
	//Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
	//	Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	//Иначе
	//	Если Пользователь.Лико_Площадки.Количество() =0  Тогда
	//		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
	//	КонецЕсли;	
	//КонецЕсли;
	
	
	Запрос = Новый Запрос;  
	//Расчеты с поставщиками 
	
	#Область Расчеты_С_Постащиками_Расшифровка
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ПредопределенныеЗначения.ЗначениеПараметра КАК Организация
	|ПОМЕСТИТЬ СибирьУрал
	|ИЗ
	|	Справочник.Лико_ПредопределенныеЗначения КАК Лико_ПредопределенныеЗначения
	|ГДЕ
	|	Лико_ПредопределенныеЗначения.Ссылка В (ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияЭкофлекс), ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер
	|ПОМЕСТИТЬ ПартнерыСобственныеОрганизации
	|ИЗ
	|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(РасчетыСПоставщикамиПоСрокамОстатки.ДолгУпрОстаток) КАК Долг,
	|	СУММА(РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаУпрОстаток) КАК Предоплата,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка > 0
	|				ТОГДА РасчетыСПоставщикамиПоСрокамОстатки.ДолгОстаток * (1 + РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка / 100)
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокамОстатки.ДолгОстаток
	|		КОНЕЦ) КАК ДолгВВалютеВзаиморасчетов,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка > 0
	|				ТОГДА 1 + РасчетыСПоставщикамиПоСрокамОстатки.Валюта.Наценка / 100
	|			ИНАЧЕ 1
	|		КОНЕЦ * РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаОстаток) КАК ПредоплатаВВалютеВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ КАК ОсновнаяВалюта,
	|	РасчетыСПоставщикамиПоСрокамОстатки.Валюта КАК Валюта,
	|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпрОстаток,
	|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпрОстаток
	|ПОМЕСТИТЬ ВТПоДок
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			,
	|			ВЫБОР
	|					КОГДА АналитикаУчетаПоПартнерам.Партнер В
	|							(ВЫБРАТЬ
	|								ПартнерыСобственныеОрганизации.Партнер КАК Партнер
	|							ИЗ
	|								ПартнерыСобственныеОрганизации КАК ПартнерыСобственныеОрганизации)
	|						ТОГДА АналитикаУчетаПоПартнерам.Организация В
	|								(ВЫБРАТЬ
	|									СибирьУрал.Организация КАК Организация
	|								ИЗ
	|									СибирьУрал КАК СибирьУрал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ ЕСТЬNULL(АналитикаУчетаПоПартнерам.Договор.СтатьяДвиженияДенежныхСредств.ПометкаУдаления, ЛОЖЬ)
	|				И АналитикаУчетаПоПартнерам.Организация.ИНН = &SiteInn
	//|				И АналитикаУчетаПоПартнерам.Договор.Лико_Площадка = &Лико_Площадка
	|				И (Валюта.Код = &CurrencyCode
	|					ИЛИ Валюта.ОсновнаяВалюта.Код = &CurrencyCode)) КАК РасчетыСПоставщикамиПоСрокамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПоСрокамОстатки.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоСрокамОстатки.Валюта,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыСПоставщикамиПоСрокамОстатки.Валюта
	|		ИНАЧЕ РасчетыСПоставщикамиПоСрокамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ,
	|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаУпрОстаток,
	|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгУпрОстаток
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	РасчетыПоФинансовымИнструментамОстатки.АналитикаУчетаПоПартнерам,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток < 0
	|				ТОГДА -1 * РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток > 0
	|				ТОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаУпрОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток < 0
	|				ТОГДА -1 * РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток > 0
	|				ТОГДА РасчетыПоФинансовымИнструментамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта
	|		ИНАЧЕ РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ,
	|	РасчетыПоФинансовымИнструментамОстатки.Валюта,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам.Партнер В
	|					(ВЫБРАТЬ
	|						ПартнерыСобственныеОрганизации.Партнер КАК Партнер
	|					ИЗ
	|						ПартнерыСобственныеОрганизации КАК ПартнерыСобственныеОрганизации)
	|				И АналитикаУчетаПоПартнерам.Организация В
	|					(ВЫБРАТЬ
	|						СибирьУрал.Организация КАК Организация
	|					ИЗ
	|						СибирьУрал КАК СибирьУрал)
	|				И АналитикаУчетаПоПартнерам.Организация.ИНН = &SiteInn
	//|				И АналитикаУчетаПоПартнерам.Договор.Лико_Площадка = &Лико_Площадка
	|				И (Валюта.Код = &CurrencyCode
	|					ИЛИ Валюта.ОсновнаяВалюта.Код = &CurrencyCode)) КАК РасчетыПоФинансовымИнструментамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоФинансовымИнструментамОстатки.АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыПоФинансовымИнструментамОстатки.Валюта
	|		ИНАЧЕ РасчетыПоФинансовымИнструментамОстатки.Валюта.ОсновнаяВалюта
	|	КОНЕЦ,
	|	РасчетыПоФинансовымИнструментамОстатки.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|			ТОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Контрагент
	|		ИНАЧЕ ВТПоДок.АналитикаУчетаПоПартнерам.Партнер
	|	КОНЕЦ КАК Партнер,
	|	ВТПоДок.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|	СУММА(ВТПоДок.Долг) КАК Долг,
	|	СУММА(ВТПоДок.Предоплата) КАК Предоплата,
	|	СУММА(ВТПоДок.Долг - ВТПоДок.Предоплата) КАК ДолгПлюсПредоплата
	|ПОМЕСТИТЬ ВТПарнетры
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам.Организация,
	|	ВТПоДок.ОсновнаяВалюта,
	|	ВЫБОР
	|		КОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|			ТОГДА ВТПоДок.АналитикаУчетаПоПартнерам.Контрагент
	|		ИНАЧЕ ВТПоДок.АналитикаУчетаПоПартнерам.Партнер
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПоДок.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТПоДок.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|	СУММА(ВТПоДок.Долг) КАК Долг,
	|	СУММА(ВТПоДок.Предоплата) КАК Предоплата,
	|	СУММА(ВТПоДок.Долг - ВТПоДок.Предоплата) КАК ДолгПлюсПредоплата,
	|	СУММА(ВТПоДок.ПредоплатаВВалютеВзаиморасчетов) КАК ПредоплатаВВалютеВзаиморасчетов,
	|	СУММА(ВТПоДок.ДолгВВалютеВзаиморасчетов) КАК ДолгВВалютеВзаиморасчетов,
	|	СУММА(ВТПоДок.ДолгВВалютеВзаиморасчетов - ВТПоДок.ПредоплатаВВалютеВзаиморасчетов) КАК ДолгПлюсПредоплатаВВалютеВзаиморасчетов,
	|	ВТПоДок.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикам
	|ИЗ
	|	ВТПоДок КАК ВТПоДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоДок.АналитикаУчетаПоПартнерам,
	|	ВТПоДок.ОсновнаяВалюта,
	|	ВТПоДок.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата КАК ДолгПлюсПредоплата,
	|	МАКСИМУМ(РасчетыСПоставщиками.ДатаПлатежа) КАК ДатаПлатежа,
	|	МИНИМУМ(РасчетыСПоставщиками.Регистратор.Дата) КАК ДатаДокумента,
	|	ВТ_РасчетыПоАналитикам.Долг КАК Долг,
	|	ВТ_РасчетыПоАналитикам.ДолгВВалютеВзаиморасчетов КАК ДолгВВалютеВзаиморасчетов
	|ПОМЕСТИТЬ ВТДолг
	|ИЗ
	|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам
	|			И (РасчетыСПоставщиками.КОплате > 0)
	|			И (РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|ГДЕ
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам,
	|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата,
	|	ВТ_РасчетыПоАналитикам.Долг,
	|	ВТ_РасчетыПоАналитикам.ДолгВВалютеВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДолг.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТДолг.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|				ТОГДА ВТДолг.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгПросрочен,
	|	ВТДолг.ДатаПлатежа КАК ДатаПлатежа,
	|	СУММА(ВТДолг.Долг) КАК Долг,
	|	ВТДолг.ДатаДокумента КАК ДатаДокумента,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), ДЕНЬ)
	|				ТОГДА ВТДолг.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгПросроченБольшеМесяца,
	|	СУММА(ВТДолг.ДолгВВалютеВзаиморасчетов) КАК ДолгВВ,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|				ТОГДА ВТДолг.ДолгВВалютеВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгВВПросрочен,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДолг.ДатаПлатежа < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), ДЕНЬ)
	|				ТОГДА ВТДолг.ДолгВВалютеВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгВВПросроченБольшеМесяца
	|ПОМЕСТИТЬ ВТДолгПросрочено
	|ИЗ
	|	ВТДолг КАК ВТДолг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДолг.АналитикаУчетаПоПартнерам.Партнер,
	|	ВТДолг.АналитикаУчетаПоПартнерам,
	|	ВТДолг.ДатаПлатежа,
	|	ВТДолг.ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ВТ_РасчетыПоАналитикам.ОсновнаяВалюта КАК ОсновнаяВалюта,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|			ТОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Контрагент
	|		ИНАЧЕ ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер
	|	КОНЕЦ КАК Партнер,
	|	ВТ_РасчетыПоАналитикам.Валюта КАК Валюта,
	|	СУММА(ВТ_РасчетыПоАналитикам.Долг) КАК Долг,
	|	СУММА(ВТ_РасчетыПоАналитикам.Предоплата) КАК Предоплата,
	|	СУММА(ВТ_РасчетыПоАналитикам.ДолгВВалютеВзаиморасчетов) КАК ДолгВВалютеВзаиморасчетов,
	|	СУММА(ВТ_РасчетыПоАналитикам.ПредоплатаВВалютеВзаиморасчетов) КАК ПредоплатВВалютеВзаиморасчетова,
	|	СУММА(ЕСТЬNULL(ВТДолгПросрочено.ДолгПросрочен, 0)) КАК ДолгПросрочен,
	|	СУММА(ЕСТЬNULL(ВТДолгПросрочено.ДолгВВПросрочен, 0)) КАК ДолгВВПросрочен
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДолгПросрочено КАК ВТДолгПросрочено
	|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = ВТДолгПросрочено.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПарнетры КАК ВТПарнетры
	|		ПО (ВЫБОР
	|				КОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|					ТОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Контрагент = ВТПарнетры.Партнер
	|				ИНАЧЕ ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер = ВТПарнетры.Партнер
	|			КОНЕЦ)
	|			И ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация = ВТПарнетры.Организация
	|			И ВТ_РасчетыПоАналитикам.ОсновнаяВалюта = ВТПарнетры.ОсновнаяВалюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоАналитикам.ОсновнаяВалюта,
	|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Организация,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|			ТОГДА ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Контрагент
	|		ИНАЧЕ ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам.Партнер
	|	КОНЕЦ,
	|	ВТ_РасчетыПоАналитикам.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТДанные.Организация.ИНН, """") КАК OrganizationCode,
	|	ЕСТЬNULL(ВТДанные.Организация.Наименование, """") КАК OrganizationName,
	|	ЕСТЬNULL(ВТДанные.Партнер.Код, """") КАК ProviderCode,
	|	ЕСТЬNULL(ВТДанные.Партнер.Наименование, """") КАК ProviderName,
	|	ЕСТЬNULL(ВТДанные.Валюта.Код, """") КАК CurrencyCode,
	|	ЕСТЬNULL(ВТДанные.Валюта.Наименование, """") КАК CurrencyName,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.ДолгВВалютеВзаиморасчетов КАК ЧИСЛО(15, 0)), 0) КАК Duty,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.ПредоплатВВалютеВзаиморасчетова КАК ЧИСЛО(15, 0)), 0) КАК Prepainment,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТДанные.ДолгВВПросрочен КАК ЧИСЛО(15, 0)), 0) КАК Overdue
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Duty УБЫВ";	
	#КонецОбласти
	
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("SiteInn", SiteInn);
	//Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	Запрос.УстановитьПараметр("CurrencyCode", CurrencyCode);
	//Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	//	
	
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	//Возврат HttpВернутьТзКакJSON(Тз);
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Тз));
	
КонецФункции

Функция ExchangeDifferences(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd");         //UserOS
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	//// Найдем пользователя 1с
	//UserOS = ПараметрыPOST.UserOS;
	//Если НЕ ЗначениеЗаполнено(UserOS) Тогда
	//	Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	//КонецЕсли;
	//
	//Пользователь=ПолучитьПользователя(UserOS);
	//Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
	//	Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	//Иначе
	//	Если Пользователь.Лико_Площадки.Количество() =0  Тогда
	//		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
	//	КонецЕсли;	
	//КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	
	Запрос = Новый Запрос;
	//Курсовые разницы 
	#Область Курсовые_Разницы_Онлайн
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиПоСрокам.Период КАК Период,
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор КАК Регистратор,
	|	РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоСрокам.Валюта КАК Валюта,
	|	РасчетыСПоставщикамиПоСрокам.Долг КАК Долг,
	|	РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ДолгУпр,
	|	РасчетыСПоставщикамиПоСрокам.ДолгРегл КАК ДолгРегл,
	|	РасчетыСПоставщикамиПоСрокам.Предоплата КАК Предоплата,
	|	РасчетыСПоставщикамиПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|				ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.Долг КАК ЧИСЛО(15, 4))
	|	КОНЕЦ КАК КурсОплаты,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.Долг <> 0
	|			ТОГДА ""Оплата""
	|		КОГДА РасчетыСПоставщикамиПоСрокам.Предоплата <> 0
	|			ТОГДА ""Предоплата""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипОплаты,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|							ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.Долг / РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КроссКурс,
	|	""Расчеты с поставщиками"" КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОплатыПоставщикам
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|ГДЕ
	|	РасчетыСПоставщикамиПоСрокам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (РасчетыСПоставщикамиПоСрокам.Валюта <> &ВалютаУпр
	|			ИЛИ РасчетыСПоставщикамиПоСрокам.Валюта <> &ВалютаРегл)
	|	И РасчетыСПоставщикамиПоСрокам.Долг <> 0
	|	И РасчетыСПоставщикамиПоСрокам.ДокументРегистратор <> РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент
	|	И РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСКлиентамиПоСрокам.Период КАК Период,
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
	|	РасчетыСКлиентамиПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоСрокам.Валюта КАК Валюта,
	|	РасчетыСКлиентамиПоСрокам.Долг КАК Долг,
	|	РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ДолгУпр,
	|	РасчетыСКлиентамиПоСрокам.ДолгРегл КАК ДолгРегл,
	|	РасчетыСКлиентамиПоСрокам.Предоплата КАК Предоплата,
	|	РасчетыСКлиентамиПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыСКлиентамиПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|				ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.Долг КАК ЧИСЛО(15, 4))
	|	КОНЕЦ КАК КурсОплаты,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|							ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.Долг / РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КроссКурс,
	|	""Расчеты с клиентами"" КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОплатыКлиентов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|ГДЕ
	|	РасчетыСКлиентамиПоСрокам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (РасчетыСКлиентамиПоСрокам.Валюта <> &ВалютаУпр
	|			ИЛИ РасчетыСКлиентамиПоСрокам.Валюта <> &ВалютаРегл)
	|	И РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента))
	|	И РасчетыСКлиентамиПоСрокам.Долг <> 0
	|	И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОплатыПоставщикам.Период КАК ПериодОплаты,
	|	ВТОплатыПоставщикам.Регистратор КАК РегистраторОплаты,
	|	ВТОплатыПоставщикам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	НАЧАЛОПЕРИОДА(РасчетыСПоставщикамиПоСрокам.Период, ДЕНЬ) КАК ПериодОперации,
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор КАК РегистраторОперации,
	|	ВТОплатыПоставщикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТОплатыПоставщикам.Валюта КАК Валюта,
	|	ВТОплатыПоставщикам.КурсОплаты КАК КурсОплаты,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|					ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|							ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РасчетыСПоставщикамиПоСрокам.Долг <> 0
	|						ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.Долг
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КурсОперации,
	|	ВТОплатыПоставщикам.Долг КАК Оплата,
	|	ВТОплатыПоставщикам.ДолгУпр КАК ОплатаУпр,
	|	ВТОплатыПоставщикам.ДолгРегл КАК ОплатаРегл,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.Долг
	|		ИНАЧЕ -РасчетыСПоставщикамиПоСрокам.Долг
	|	КОНЕЦ КАК Долг,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|		ИНАЧЕ -РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|	КОНЕЦ КАК ДолгУпр,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|		ИНАЧЕ -РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	ВТОплатыПоставщикам.ТипОплаты КАК ТипОплаты,
	|	ВТОплатыПоставщикам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТОплатыПоставщикам.КроссКурс КАК КроссКурс,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|								ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|							ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|						ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Долг / РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КроссКурсОперации,
	|	ВТОплатыПоставщикам.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОперацииПоОплатеПоставщикам
	|ИЗ
	|	ВТОплатыПоставщикам КАК ВТОплатыПоставщикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|		ПО ВТОплатыПоставщикам.РасчетныйДокумент = РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент
	|			И (РасчетыСПоставщикамиПоСрокам.ДокументРегистратор = РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент)
	|			И (РасчетыСПоставщикамиПоСрокам.Долг <> 0)
	|			И ВТОплатыПоставщикам.АналитикаУчетаПоПартнерам = РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	ВТОплатыПоставщикам.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОплатыКлиентов.Период КАК ПериодОплаты,
	|	ВТОплатыКлиентов.Регистратор КАК РегистраторОплаты,
	|	ВТОплатыКлиентов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	НАЧАЛОПЕРИОДА(РасчетыСКлиентамиПоСрокам.Период, ДЕНЬ) КАК ПериодОперации,
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК РегистраторОперации,
	|	ВТОплатыКлиентов.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТОплатыКлиентов.Валюта КАК Валюта,
	|	ВТОплатыКлиентов.КурсОплаты КАК КурсОплаты,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|					ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|							ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РасчетыСКлиентамиПоСрокам.Долг <> 0
	|						ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.Долг
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КурсОперации,
	|	ВТОплатыКлиентов.Долг КАК Оплата,
	|	ВТОплатыКлиентов.ДолгУпр КАК ОплатаУпр,
	|	ВТОплатыКлиентов.ДолгРегл КАК ОплатаРегл,
	|	РасчетыСКлиентамиПоСрокам.Долг КАК Долг,
	|	РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ДолгУпр,
	|	РасчетыСКлиентамиПоСрокам.ДолгРегл КАК ДолгРегл,
	|	ВТОплатыКлиентов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТОплатыКлиентов.КроссКурс КАК КроссКурс,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|								ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|							ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр
	|						ИНАЧЕ РасчетыСКлиентамиПоСрокам.Долг / РасчетыСКлиентамиПоСрокам.ДолгУпр
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КроссКурсОперации,
	|	ВТОплатыКлиентов.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОперацииПоОплатеКлиентов
	|ИЗ
	|	ВТОплатыКлиентов КАК ВТОплатыКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ПО ВТОплатыКлиентов.РасчетныйДокумент = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|			И (ВЫБОР
	|				КОГДА ВТОплатыКлиентов.РасчетныйДокумент = ВТОплатыКлиентов.Регистратор
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ДокументРегистратор <> РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|				ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|			КОНЕЦ)
	|			И (РасчетыСКлиентамиПоСрокам.Долг <> 0)
	|			И ВТОплатыКлиентов.АналитикаУчетаПоПартнерам = РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Аналитика.Организация КАК Организация,
	|	ВТОперацииПоОплатеПоставщикам.Валюта КАК Валюта,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Договор КАК Договор,
	|	ВТОперацииПоОплатеПоставщикам.ПериодОплаты КАК ПериодОплаты,
	|	ВТОперацииПоОплатеПоставщикам.ПериодОперации КАК ПериодОперации,
	|	ВТОперацииПоОплатеПоставщикам.РегистраторОплаты КАК Регистратор,
	|	ВТОперацииПоОплатеПоставщикам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТОперацииПоОплатеПоставщикам.РегистраторОперации КАК РегистраторОперации,
	|	ВТОперацииПоОплатеПоставщикам.Оплата КАК Оплата,
	|	ВТОперацииПоОплатеПоставщикам.ОплатаУпр КАК ОплатаУпр,
	|	ВТОперацииПоОплатеПоставщикам.ОплатаРегл КАК ОплатаРегл,
	|	ВТОперацииПоОплатеПоставщикам.КурсОплаты КАК КурсОплаты,
	|	ВТОперацииПоОплатеПоставщикам.КурсОперации КАК КурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА 0
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеПоставщикам.ОплатаУпр * ВТОперацииПоОплатеПоставщикам.КурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|		ИНАЧЕ ВТОперацииПоОплатеПоставщикам.Оплата * ВТОперацииПоОплатеПоставщикам.КурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|	КОНЕЦ КАК КурсовыеВРублях,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА ВТОперацииПоОплатеПоставщикам.Оплата
	|		ИНАЧЕ ВТОперацииПоОплатеПоставщикам.Оплата * ВТОперацииПоОплатеПоставщикам.КурсОперации
	|	КОНЕЦ КАК СуммаОперацииРегл,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеПоставщикам.КурсОперации <> 0
	|							ТОГДА ВЫРАЗИТЬ(ВТОперацииПоОплатеПоставщикам.ОплатаРегл / ВТОперацииПоОплатеПоставщикам.КурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаУпр КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеПоставщикам.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеПоставщикам.Оплата / ВТОперацииПоОплатеПоставщикам.КроссКурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК КурсовыеВЕвро,
	|	ВТОперацииПоОплатеПоставщикам.КроссКурс КАК КроссКурс,
	|	ВТОперацииПоОплатеПоставщикам.КроссКурсОперации КАК КроссКурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеПоставщикам.КурсОперации <> 0
	|							ТОГДА ВЫРАЗИТЬ(ВТОперацииПоОплатеПоставщикам.ОплатаРегл / ВТОперацииПоОплатеПоставщикам.КурсОперации КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеПоставщикам.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеПоставщикам.Оплата / ВТОперацииПоОплатеПоставщикам.КроссКурсОперации
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаОперацииУпр,
	|	ВТОперацииПоОплатеПоставщикам.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТОперацииПоОплатеПоставщикам КАК ВТОперацииПоОплатеПоставщикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВТОперацииПоОплатеПоставщикам.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Аналитика.Организация,
	|	ВТОперацииПоОплатеКлиентов.Валюта,
	|	Аналитика.Партнер,
	|	Аналитика.Договор,
	|	ВТОперацииПоОплатеКлиентов.ПериодОплаты,
	|	ВТОперацииПоОплатеКлиентов.ПериодОперации,
	|	ВТОперацииПоОплатеКлиентов.РегистраторОплаты,
	|	ВТОперацииПоОплатеКлиентов.РасчетныйДокумент,
	|	ВТОперацииПоОплатеКлиентов.РегистраторОперации,
	|	ВТОперацииПоОплатеКлиентов.Оплата,
	|	ВТОперацииПоОплатеКлиентов.ОплатаУпр,
	|	ВТОперацииПоОплатеКлиентов.ОплатаРегл,
	|	ВТОперацииПоОплатеКлиентов.КурсОплаты,
	|	ВТОперацииПоОплатеКлиентов.КурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА 0
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаРегл - ВТОперацииПоОплатеКлиентов.ОплатаУпр * ВТОперацииПоОплатеКлиентов.КурсОперации
	|		ИНАЧЕ ВТОперацииПоОплатеКлиентов.ОплатаРегл - ВТОперацииПоОплатеКлиентов.Оплата * ВТОперацииПоОплатеКлиентов.КурсОперации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА ВТОперацииПоОплатеКлиентов.Оплата
	|		ИНАЧЕ ВТОперацииПоОплатеКлиентов.Оплата * ВТОперацииПоОплатеКлиентов.КурсОперации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеКлиентов.КурсОперации <> 0
	|							ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаУпр - (ВЫРАЗИТЬ(ВТОперацииПоОплатеКлиентов.ОплатаРегл / ВТОперацииПоОплатеКлиентов.КурсОперации КАК ЧИСЛО(15, 2)))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеКлиентов.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаУпр - ВТОперацииПоОплатеКлиентов.Оплата / ВТОперацииПоОплатеКлиентов.КроссКурсОперации
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТОперацииПоОплатеКлиентов.КроссКурс,
	|	ВТОперацииПоОплатеКлиентов.КроссКурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеКлиентов.КурсОперации <> 0
	|							ТОГДА ВЫРАЗИТЬ(ВТОперацииПоОплатеКлиентов.ОплатаРегл / ВТОперацииПоОплатеКлиентов.КурсОперации КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеКлиентов.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеКлиентов.Оплата / ВТОперацииПоОплатеКлиентов.КроссКурсОперации
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТОперацииПоОплатеКлиентов.ТипРасчетов
	|ИЗ
	|	ВТОперацииПоОплатеКлиентов КАК ВТОперацииПоОплатеКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВТОперацииПоОплатеКлиентов.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.ТипРасчетов КАК Type,
	|	ВЫБОР
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Сибирь ООО""
	|			ТОГДА ""Сибирь""
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Урал ООО""
	|			ТОГДА ""Урал""
	|		КОГДА ВТ.Организация.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ТОГДА ""Икс-Пак""
	|		ИНАЧЕ ВТ.Организация.Наименование
	|	КОНЕЦ КАК OrganizationName,
	|	ВТ.Организация.ИНН КАК OrganizationCode,
	|	ВТ.Валюта.Наименование КАК CurrencyName,
	|	ВТ.Валюта.Код КАК CurrencyCode,
	|	СУММА(ВТ.Оплата) КАК payment,
	|	СУММА(ВТ.ОплатаУпр) КАК paymentE,
	|	СУММА(ВТ.ОплатаРегл) КАК paymentR,
	|	СУММА(ВТ.СуммаОперацииУпр) КАК SumE,
	|	СУММА(ВТ.СуммаОперацииРегл) КАК SumR,
	|	СУММА(ВТ.КурсовыеВРублях) КАК ExchangeR,
	|	СУММА(ВТ.КурсовыеВЕвро) КАК ExchangeE
	|ПОМЕСТИТЬ ВТДетали
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ТипРасчетов,
	|	ВТ.Организация.ИНН,
	|	ВТ.Валюта.Наименование,
	|	ВТ.Валюта.Код,
	|	ВЫБОР
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Сибирь ООО""
	|			ТОГДА ""Сибирь""
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Урал ООО""
	|			ТОГДА ""Урал""
	|		КОГДА ВТ.Организация.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ТОГДА ""Икс-Пак""
	|		ИНАЧЕ ВТ.Организация.Наименование
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДетали.Type КАК Type,
	|	ВТДетали.OrganizationName КАК OrganizationName,
	|	ВТДетали.OrganizationCode КАК OrganizationCode,
	|	ВТДетали.CurrencyName КАК CurrencyName,
	|	ВТДетали.CurrencyCode КАК CurrencyCode,
	|	ВТДетали.payment КАК payment,
	|	ВТДетали.paymentE КАК paymentE,
	|	ВТДетали.paymentR КАК paymentR,
	|	ВТДетали.SumE КАК SumE,
	|	ВТДетали.SumR КАК SumR,
	|	ВТДетали.ExchangeR КАК ExchangeR,
	|	ВТДетали.ExchangeE КАК ExchangeE,
	|	3 КАК Rank
	|ПОМЕСТИТЬ ВТИтог
	|ИЗ
	|	ВТДетали КАК ВТДетали
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ВТДетали.Type,
	|	ВТДетали.OrganizationName,
	|	ВТДетали.OrganizationCode,
	|	МАКСИМУМ(ВТДетали.OrganizationName),
	|	МАКСИМУМ(""""),
	|	МАКСИМУМ(0),
	|	СУММА(ВТДетали.paymentE),
	|	СУММА(ВТДетали.paymentR),
	|	СУММА(ВТДетали.SumE),
	|	СУММА(ВТДетали.SumR),
	|	СУММА(ВТДетали.ExchangeR),
	|	СУММА(ВТДетали.ExchangeE),
	|	МАКСИМУМ(2)
	|ИЗ
	|	ВТДетали КАК ВТДетали
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДетали.Type,
	|	ВТДетали.OrganizationName,
	|	ВТДетали.OrganizationCode
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ВТДетали.Type,
	|	МАКСИМУМ(""""),
	|	МАКСИМУМ(""""),
	|	МАКСИМУМ(ВТДетали.Type),
	|	МАКСИМУМ(""""),
	|	МАКСИМУМ(0),
	|	СУММА(ВТДетали.paymentE),
	|	СУММА(ВТДетали.paymentR),
	|	СУММА(ВТДетали.SumE),
	|	СУММА(ВТДетали.SumR),
	|	СУММА(ВТДетали.ExchangeR),
	|	СУММА(ВТДетали.ExchangeE),
	|	МАКСИМУМ(1)
	|ИЗ
	|	ВТДетали КАК ВТДетали
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДетали.Type
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТИтог.Type КАК Type,
	|	ВТИтог.OrganizationName КАК OrganizationName,
	|	ВТИтог.OrganizationCode КАК OrganizationCode,
	|	ВТИтог.CurrencyName КАК CurrencyName,
	|	ВТИтог.CurrencyCode КАК CurrencyCode,
	|	ВТИтог.payment КАК payment,
	|	ВТИтог.paymentE КАК paymentE,
	|	ВТИтог.paymentR КАК paymentR,
	|	ВТИтог.SumE КАК SumE,
	|	ВТИтог.SumR КАК SumR,
	|	ВТИтог.ExchangeR КАК ExchangeR,
	|	ВТИтог.ExchangeE КАК ExchangeE,
	|	ВТИтог.Rank КАК Rank
	|ИЗ
	|	ВТИтог КАК ВТИтог
	|
	|УПОРЯДОЧИТЬ ПО
	|	Type,
	|	OrganizationName,
	|	Rank";
	#КонецОбласти
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));  
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
	
	//Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Тз));
	
	
КонецФункции

Функция ExchangeDifferencesDetail(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, Type, SiteInn, CurrencyCode");         //UserOS
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат               ОшибкаВПараметрах;
	КонецЕсли;
	
	//// Найдем пользователя 1с
	//UserOS = ПараметрыPOST.UserOS;
	//Если НЕ ЗначениеЗаполнено(UserOS) Тогда
	//            Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	//КонецЕсли;
	//
	//Пользователь=ПолучитьПользователя(UserOS);
	//Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
	//            Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	//Иначе
	//            Если Пользователь.Лико_Площадки.Количество() =0  Тогда
	//                            Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");                     
	//            КонецЕсли;       
	//КонецЕсли;
	
	DateStart             = ПараметрыPOST.DateStart;
	DateEnd               = ПараметрыPOST.DateEnd;  
	Type                      = ПараметрыPOST.Type;
	SiteInn    = ПараметрыPOST.SiteInn;
	CurrencyCode = ПараметрыPOST.CurrencyCode; 
	
	Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));

	
	
	
	Запрос = Новый Запрос;
	//Курсовые разницы расшифровка //Курсовые разницы расшифровка
	#Область Курсовые_Разницы_Расшифровка
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиПоСрокам.Период КАК Период,
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор КАК Регистратор,
	|	РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоСрокам.Валюта КАК Валюта,
	|	РасчетыСПоставщикамиПоСрокам.Долг КАК Долг,
	|	РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ДолгУпр,
	|	РасчетыСПоставщикамиПоСрокам.ДолгРегл КАК ДолгРегл,
	|	РасчетыСПоставщикамиПоСрокам.Предоплата КАК Предоплата,
	|	РасчетыСПоставщикамиПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|				ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.Долг КАК ЧИСЛО(15, 4))
	|	КОНЕЦ КАК КурсОплаты,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.Долг <> 0
	|			ТОГДА ""Оплата""
	|		КОГДА РасчетыСПоставщикамиПоСрокам.Предоплата <> 0
	|			ТОГДА ""Предоплата""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипОплаты,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|							ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.Долг / РасчетыСПоставщикамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КроссКурс,
	|	""Расчеты с поставщиками"" КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОплатыПоставщикам
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|ГДЕ
	|	РасчетыСПоставщикамиПоСрокам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (РасчетыСПоставщикамиПоСрокам.Валюта <> &ВалютаУпр
	|			ИЛИ РасчетыСПоставщикамиПоСрокам.Валюта <> &ВалютаРегл)
	|	И РасчетыСПоставщикамиПоСрокам.Долг <> 0
	|	И РасчетыСПоставщикамиПоСрокам.ДокументРегистратор <> РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент
	|	И РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И &Type = ""Расчеты с поставщиками""
	//|	И РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация.ИНН = &SiteInn
	|	И РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка = &Лико_Площадка
	|	И РасчетыСПоставщикамиПоСрокам.Валюта.Код = &CurrencyCode
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСКлиентамиПоСрокам.Период КАК Период,
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
	|	РасчетыСКлиентамиПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоСрокам.Валюта КАК Валюта,
	|	РасчетыСКлиентамиПоСрокам.Долг КАК Долг,
	|	РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ДолгУпр,
	|	РасчетыСКлиентамиПоСрокам.ДолгРегл КАК ДолгРегл,
	|	РасчетыСКлиентамиПоСрокам.Предоплата КАК Предоплата,
	|	РасчетыСКлиентамиПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыСКлиентамиПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|				ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.Долг КАК ЧИСЛО(15, 4))
	|	КОНЕЦ КАК КурсОплаты,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|							ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|						ТОГДА ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.Долг / РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ЧИСЛО(15, 4))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КроссКурс,
	|	""Расчеты с клиентами"" КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОплатыКлиентов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|ГДЕ
	|	РасчетыСКлиентамиПоСрокам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (РасчетыСКлиентамиПоСрокам.Валюта <> &ВалютаУпр
	|			ИЛИ РасчетыСКлиентамиПоСрокам.Валюта <> &ВалютаРегл)
	|	И РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности))
	|	И РасчетыСКлиентамиПоСрокам.Долг <> 0
	|	И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И &Type = ""Расчеты с клиентами""
	//|	И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация.ИНН = &SiteInn  
	|	И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация.ИНН = &Лико_Площадка
	|	И РасчетыСКлиентамиПоСрокам.Валюта.Код = &CurrencyCode
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОплатыПоставщикам.Период КАК ПериодОплаты,
	|	ВТОплатыПоставщикам.Регистратор КАК РегистраторОплаты,
	|	ВТОплатыПоставщикам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	НАЧАЛОПЕРИОДА(РасчетыСПоставщикамиПоСрокам.Период, ДЕНЬ) КАК ПериодОперации,
	|	РасчетыСПоставщикамиПоСрокам.Регистратор КАК РегистраторОперации,
	|	ВТОплатыПоставщикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТОплатыПоставщикам.Валюта КАК Валюта,
	|	ВТОплатыПоставщикам.КурсОплаты КАК КурсОплаты,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|					ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|							ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РасчетыСПоставщикамиПоСрокам.Долг <> 0
	|						ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.Долг
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КурсОперации,
	|	ВТОплатыПоставщикам.Долг КАК Оплата,
	|	ВТОплатыПоставщикам.ДолгУпр КАК ОплатаУпр,
	|	ВТОплатыПоставщикам.ДолгРегл КАК ОплатаРегл,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.Долг
	|		ИНАЧЕ -РасчетыСПоставщикамиПоСрокам.Долг
	|	КОНЕЦ КАК Долг,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|		ИНАЧЕ -РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|	КОНЕЦ КАК ДолгУпр,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|		ИНАЧЕ -РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	ВТОплатыПоставщикам.ТипОплаты КАК ТипОплаты,
	|	ВТОплатыПоставщикам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТОплатыПоставщикам.КроссКурс КАК КроссКурс,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ДолгУпр <> 0
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|								ИЛИ РасчетыСПоставщикамиПоСрокам.Долг = РасчетыСПоставщикамиПоСрокам.ДолгРегл
	|							ТОГДА РасчетыСПоставщикамиПоСрокам.ДолгРегл / РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|						ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Долг / РасчетыСПоставщикамиПоСрокам.ДолгУпр
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КроссКурсОперации,
	|	ВТОплатыПоставщикам.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОперацииПоОплатеПоставщикам
	|ИЗ
	|	ВТОплатыПоставщикам КАК ВТОплатыПоставщикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|		ПО ВТОплатыПоставщикам.РасчетныйДокумент = РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент
	|			И (РасчетыСПоставщикамиПоСрокам.ДокументРегистратор = РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент)
	|			И (РасчетыСПоставщикамиПоСрокам.Долг <> 0)
	|			И ВТОплатыПоставщикам.АналитикаУчетаПоПартнерам = РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	ВТОплатыПоставщикам.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОплатыКлиентов.Период КАК ПериодОплаты,
	|	ВТОплатыКлиентов.Регистратор КАК РегистраторОплаты,
	|	ВТОплатыКлиентов.РасчетныйДокумент КАК РасчетныйДокумент,
	|	НАЧАЛОПЕРИОДА(РасчетыСКлиентамиПоСрокам.Период, ДЕНЬ) КАК ПериодОперации,
	|	РасчетыСКлиентамиПоСрокам.Регистратор КАК РегистраторОперации,
	|	ВТОплатыКлиентов.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТОплатыКлиентов.Валюта КАК Валюта,
	|	ВТОплатыКлиентов.КурсОплаты КАК КурсОплаты,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|					ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|							ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РасчетыСКлиентамиПоСрокам.Долг <> 0
	|						ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.Долг
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КурсОперации,
	|	ВТОплатыКлиентов.Долг КАК Оплата,
	|	ВТОплатыКлиентов.ДолгУпр КАК ОплатаУпр,
	|	ВТОплатыКлиентов.ДолгРегл КАК ОплатаРегл,
	|	РасчетыСКлиентамиПоСрокам.Долг КАК Долг,
	|	РасчетыСКлиентамиПоСрокам.ДолгУпр КАК ДолгУпр,
	|	РасчетыСКлиентамиПоСрокам.ДолгРегл КАК ДолгРегл,
	|	ВТОплатыКлиентов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТОплатыКлиентов.КроссКурс КАК КроссКурс,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0
	|				ТОГДА ВЫБОР
	|						КОГДА РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгУпр
	|								ИЛИ РасчетыСКлиентамиПоСрокам.Долг = РасчетыСКлиентамиПоСрокам.ДолгРегл
	|							ТОГДА РасчетыСКлиентамиПоСрокам.ДолгРегл / РасчетыСКлиентамиПоСрокам.ДолгУпр
	|						ИНАЧЕ РасчетыСКлиентамиПоСрокам.Долг / РасчетыСКлиентамиПоСрокам.ДолгУпр
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 4)) КАК КроссКурсОперации,
	|	ВТОплатыКлиентов.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТОперацииПоОплатеКлиентов
	|ИЗ
	|	ВТОплатыКлиентов КАК ВТОплатыКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ПО ВТОплатыКлиентов.РасчетныйДокумент = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|			И (ВЫБОР
	|				КОГДА ВТОплатыКлиентов.РасчетныйДокумент = ВТОплатыКлиентов.Регистратор
	|					ТОГДА РасчетыСКлиентамиПоСрокам.ДокументРегистратор <> РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|				ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДокументРегистратор = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент
	|			КОНЕЦ)
	|			И (РасчетыСКлиентамиПоСрокам.Долг <> 0)
	|			И ВТОплатыКлиентов.АналитикаУчетаПоПартнерам = РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Аналитика.Организация КАК Организация,
	|	ВТОперацииПоОплатеПоставщикам.Валюта КАК Валюта,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Договор КАК Договор,
	|	ВТОперацииПоОплатеПоставщикам.ПериодОплаты КАК ПериодОплаты,
	|	ВТОперацииПоОплатеПоставщикам.ПериодОперации КАК ПериодОперации,
	|	ВТОперацииПоОплатеПоставщикам.РегистраторОплаты КАК Регистратор,
	|	ВТОперацииПоОплатеПоставщикам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВТОперацииПоОплатеПоставщикам.РегистраторОперации КАК РегистраторОперации,
	|	ВТОперацииПоОплатеПоставщикам.Оплата КАК Оплата,
	|	ВТОперацииПоОплатеПоставщикам.ОплатаУпр КАК ОплатаУпр,
	|	ВТОперацииПоОплатеПоставщикам.ОплатаРегл КАК ОплатаРегл,
	|	ВТОперацииПоОплатеПоставщикам.КурсОплаты КАК КурсОплаты,
	|	ВТОперацииПоОплатеПоставщикам.КурсОперации КАК КурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА 0
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеПоставщикам.ОплатаУпр * ВТОперацииПоОплатеПоставщикам.КурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|		ИНАЧЕ ВТОперацииПоОплатеПоставщикам.Оплата * ВТОперацииПоОплатеПоставщикам.КурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|	КОНЕЦ КАК КурсовыеВРублях,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА ВТОперацииПоОплатеПоставщикам.Оплата
	|		ИНАЧЕ ВТОперацииПоОплатеПоставщикам.Оплата * ВТОперацииПоОплатеПоставщикам.КурсОперации
	|	КОНЕЦ КАК СуммаОперацииРегл,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеПоставщикам.КурсОперации <> 0
	|							ТОГДА ВЫРАЗИТЬ(ВТОперацииПоОплатеПоставщикам.ОплатаРегл / ВТОперацииПоОплатеПоставщикам.КурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаУпр КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеПоставщикам.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеПоставщикам.Оплата / ВТОперацииПоОплатеПоставщикам.КроссКурсОперации - ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК КурсовыеВЕвро,
	|	ВТОперацииПоОплатеПоставщикам.КроссКурс КАК КроссКурс,
	|	ВТОперацииПоОплатеПоставщикам.КроссКурсОперации КАК КроссКурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеПоставщикам.КурсОперации <> 0
	|							ТОГДА ВЫРАЗИТЬ(ВТОперацииПоОплатеПоставщикам.ОплатаРегл / ВТОперацииПоОплатеПоставщикам.КурсОперации КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеПоставщикам.Оплата = ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеПоставщикам.ОплатаУпр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеПоставщикам.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеПоставщикам.Оплата / ВТОперацииПоОплатеПоставщикам.КроссКурсОперации
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаОперацииУпр,
	|	ВТОперацииПоОплатеПоставщикам.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТОперацииПоОплатеПоставщикам КАК ВТОперацииПоОплатеПоставщикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВТОперацииПоОплатеПоставщикам.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Аналитика.Организация,
	|	ВТОперацииПоОплатеКлиентов.Валюта,
	|	Аналитика.Партнер,
	|	Аналитика.Договор,
	|	ВТОперацииПоОплатеКлиентов.ПериодОплаты,
	|	ВТОперацииПоОплатеКлиентов.ПериодОперации,
	|	ВТОперацииПоОплатеКлиентов.РегистраторОплаты,
	|	ВТОперацииПоОплатеКлиентов.РасчетныйДокумент,
	|	ВТОперацииПоОплатеКлиентов.РегистраторОперации,
	|	ВТОперацииПоОплатеКлиентов.Оплата,
	|	ВТОперацииПоОплатеКлиентов.ОплатаУпр,
	|	ВТОперацииПоОплатеКлиентов.ОплатаРегл,
	|	ВТОперацииПоОплатеКлиентов.КурсОплаты,
	|	ВТОперацииПоОплатеКлиентов.КурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА 0
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаРегл - ВТОперацииПоОплатеКлиентов.ОплатаУпр * ВТОперацииПоОплатеКлиентов.КурсОперации
	|		ИНАЧЕ ВТОперацииПоОплатеКлиентов.ОплатаРегл - ВТОперацииПоОплатеКлиентов.Оплата * ВТОперацииПоОплатеКлиентов.КурсОперации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА ВТОперацииПоОплатеКлиентов.Оплата
	|		ИНАЧЕ ВТОперацииПоОплатеКлиентов.Оплата * ВТОперацииПоОплатеКлиентов.КурсОперации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеКлиентов.КурсОперации <> 0
	|							ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаУпр - (ВЫРАЗИТЬ(ВТОперацииПоОплатеКлиентов.ОплатаРегл / ВТОперацииПоОплатеКлиентов.КурсОперации КАК ЧИСЛО(15, 2)))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеКлиентов.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаУпр - ВТОперацииПоОплатеКлиентов.Оплата / ВТОперацииПоОплатеКлиентов.КроссКурсОперации
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТОперацииПоОплатеКлиентов.КроссКурс,
	|	ВТОперацииПоОплатеКлиентов.КроссКурсОперации,
	|	ВЫБОР
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаРегл
	|			ТОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА ВТОперацииПоОплатеКлиентов.КурсОперации <> 0
	|							ТОГДА ВЫРАЗИТЬ(ВТОперацииПоОплатеКлиентов.ОплатаРегл / ВТОперацииПоОплатеКлиентов.КурсОперации КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ 0
	|					КОНЕЦ, 0)
	|		КОГДА ВТОперацииПоОплатеКлиентов.Оплата = ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|			ТОГДА ВТОперацииПоОплатеКлиентов.ОплатаУпр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОперацииПоОплатеКлиентов.КроссКурсОперации <> 0
	|					ТОГДА ВТОперацииПоОплатеКлиентов.Оплата / ВТОперацииПоОплатеКлиентов.КроссКурсОперации
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТОперацииПоОплатеКлиентов.ТипРасчетов
	|ИЗ
	|	ВТОперацииПоОплатеКлиентов КАК ВТОперацииПоОплатеКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВТОперацииПоОплатеКлиентов.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.ТипРасчетов КАК Type,
	|	ВЫБОР
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Сибирь ООО""
	|			ТОГДА ""Сибирь""
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Урал ООО""
	|			ТОГДА ""Урал""
	|		КОГДА ВТ.Организация.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ТОГДА ""Икс-Пак""
	|		ИНАЧЕ ВТ.Организация.Наименование
	|	КОНЕЦ КАК OrganizationName,
	|	ВТ.Организация.ИНН КАК OrganizationCode,
	|	ВТ.Партнер.Наименование КАК PartnerName,
	|	ВТ.Партнер.Код КАК PartnerCode,
	|	ВТ.Валюта.Наименование КАК CurrencyName,
	|	ВТ.Валюта.Код КАК CurrencyCode,
	|	СУММА(ВТ.Оплата) КАК payment,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Валюта = &ВалютаРегл
	|				ТОГДА ВТ.ОплатаУпр
	|			ИНАЧЕ ВТ.ОплатаРегл
	|		КОНЕЦ) КАК paymentCurrency,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Валюта = &ВалютаРегл
	|				ТОГДА ВТ.СуммаОперацииУпр
	|			ИНАЧЕ ВТ.СуммаОперацииРегл
	|		КОНЕЦ) КАК SumCurrency,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Валюта = &ВалютаРегл
	|				ТОГДА ВТ.КурсовыеВЕвро
	|			ИНАЧЕ ВТ.КурсовыеВРублях
	|		КОНЕЦ) КАК Exchange
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ТипРасчетов,
	|	ВТ.Организация.ИНН,
	|	ВТ.Валюта.Наименование,
	|	ВТ.Валюта.Код,
	|	ВТ.Партнер.Наименование,
	|	ВТ.Партнер.Код,
	|	ВЫБОР
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Сибирь ООО""
	|			ТОГДА ""Сибирь""
	|		КОГДА ВТ.Организация.Наименование = "" ОКИЛ-САТО Урал ООО""
	|			ТОГДА ""Урал""
	|		КОГДА ВТ.Организация.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ТОГДА ""Икс-Пак""
	|		ИНАЧЕ ВТ.Организация.Наименование
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Exchange";
	#КонецОбласти
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));  
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("Type", Type);  
	//Запрос.УстановитьПараметр("SiteInn", SiteInn); 
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
	Запрос.УстановитьПараметр("CurrencyCode", CurrencyCode);
	
	//Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(Тз));
	
	
КонецФункции



Функция PrintReport(ПараметрыPOST)
	УстановитьПривилегированныйРежим(Истина);
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DocType, DocNum, PrintName");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	Если ПараметрыPOST.PrintName="OrderStages" Тогда 
		Возврат OrderStages(ПараметрыPOST);
	КонецЕсли;
	
	
	DocType = ПараметрыPOST.DocType;
	DocNum = ПараметрыPOST.DocNum;
	Если ПараметрыPOST.Свойство("DocDate") Тогда
		DocDate = Дата(ПараметрыPOST.DocDate);
	Иначе
		DocDate = '00010101';
	КонецЕсли;
	
	DocDate 	= ПараметрыPOST.DocDate;
	PrintName 	= ПараметрыPOST.PrintName;
	
	ПечатнаяФорма = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", PrintName);
	КоллекцияПечатныхФорм	= Новый ТаблицаЗначений;
	ОбъектыПечати 			= Новый СписокЗначений;
	ПараметрыПечати			= Неопределено;
	Документ = НайтиДокумент(DocType, DocNum, DocDate);
	Парам = новый структура;
	Парам.Вставить("ИдентификаторКоманды", ПечатнаяФорма.Команды[0].Идентификатор);
	ОбъектыНазначения = новый массив;
	ОбъектыНазначения.Добавить(Документ);
	Парам.Вставить("ОбъектыНазначения", ОбъектыНазначения);
	ДополнительныеОтчетыИОбработки.ПечатьПоВнешнемуИсточнику(ПечатнаяФорма, Парам, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыПечати);
	Для каждого Стр Из КоллекцияПечатныхФорм Цикл
		ТабДокумент = стр.ТабличныйДокумент;
		ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
		ТабДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.PDF); 			
		ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
		Base64 = Base64Строка(ДвДанные);  			
		Прервать;			
	КонецЦикла;
	
	Структура = Новый Структура;
	Структура.Вставить("Content", Base64);
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
КонецФункции

Функция PrintReportSKD(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "ReportKey,ReportId");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	ReportKey 	= ПараметрыPOST.ReportKey;
	NameId 		= ПараметрыPOST.ReportId;
	DateStart	= "";
	DateEnd		= "";
	TypeReport  = "HTML5";
	ДопПараметры= Новый Структура;
	Если ПараметрыPOST.Свойство("DateStart") И  ПараметрыPOST.Свойство("DateEnd") Тогда
		DateStart	= Дата(ПараметрыPOST.DateStart);
		DateEnd		= Дата(ПараметрыPOST.DateEnd);		
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("PartnerCode") Тогда
		ДопПараметры.Вставить("PartnerCode",ПараметрыPOST.PartnerCode);
	КонецЕсли;
	
	
	Если ПараметрыPOST.Свойство("Type")  Тогда
		TypeReport	= ПараметрыPOST.Type;		
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("UserOS")  Тогда
		User	= ПолучитьПользователя(ПараметрыPOST.UserOS);		
	КонецЕсли; 
	
	Если ПараметрыPOST.Свойство("SiteInn") 
		и ТипЗнч(ПараметрыPOST.SiteInn)=Тип("Структура") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
	//	
	//	Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН",ПараметрыPOST.SiteInn.inn); 			
	//	Площадка =  Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыPOST.SiteInn.inn)); 			
	//
	//	ДопПараметры.Вставить(ПараметрыPOST.SiteInn.Name,Организация); 
		
		
		
		
		 Структура = Новый Структура;
		 Структура.Вставить("Организация");
		 Структура.Вставить("Площадка"); 
		 
		 Если Не ЗначениеЗаполнено(ПараметрыPOST.SiteInn.inn) Тогда
			 Структура.Организация = Справочники.Организации.ПустаяСсылка(); 			
			 Структура.Площадка  = Справочники.Лико_Площадки.ПустаяСсылка();
			 
		 Иначе
			 
			 Структура.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН",ПараметрыPOST.SiteInn.inn); 			
			 Структура.Площадка =  Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыPOST.SiteInn.inn)); 			
			 
		 КонецЕсли;
		ДопПараметры.Вставить(ПараметрыPOST.SiteInn.Name,Структура[ПараметрыPOST.SiteInn.Name]);

		
		
		//УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

	
	
	
	Report=Неопределено;
	ТабДокумент=Новый ТабличныйДокумент;
	ПолучитьТабличныйДокументВариантаОтчета(ReportKey,NameId,ТабДокумент,DateStart,DateEnd,User,Report,ДопПараметры);	
	ВременныйФайл = ПолучитьИмяВременногоФайла(TypeReport);
	//ТабДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.HTML5);
	ТабДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента[TypeReport]);
	
	//ТабДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.PDF);
	ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
	Base64 = Base64Строка(ДвДанные);  			
	
	Структура = Новый Структура;
	Структура.Вставить("Content", Base64);
	Структура.Вставить("DateStart", DateStart);
	Структура.Вставить("DateEnd", DateEnd);
	Структура.Вставить("Type", TypeReport);
	Структура.Вставить("FixLeft", Report.Лико_ФиксироватьСлева);
	Структура.Вставить("FixTop", Report.Лико_ФиксироватьСверху);
	
	
	УдалитьФайлы(ВременныйФайл);
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
КонецФункции

Функция StatusWorkCenters(ПараметрыPOST)
	УстановитьПривилегированныйРежим(Истина);
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	// --> Начало Лико Ефимов ЕВВ 24.02.2021
	// Найдем настройку отображения РЦ
	ОтображениеРЦ = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "ОтображениеРабочихЦентров_3aa9d025140f45bc8a59ec155d871714");
	Если НЕ ЗначениеЗаполнено(ОтображениеРЦ) Тогда
		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заполена настройка отображения РЦ для отчета");
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 24.02.2021
	
	
	Лико_Планирование.Лико_ОбновитьСтатистикуСкорости();
	
	#Область ЕРП
	Запрос = Новый Запрос;
	Запрос.Текст=	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТССтатистикаСкорости.РабочийЦентр КАК РабочийЦентр,
	|	МАКСИМУМ(ТССтатистикаСкорости.ДатаНачала) КАК ДатаНачала,
	|	ТССтатистикаСкорости.РабочийЦентр.ЛикоЯчейка КАК Адрес,
	|	МАКСИМУМ(Лико_ОтображениеРабочихЦентровРабочиеЦентры.НомерСтроки) КАК НомерСтрокиОтображение
	|ПОМЕСТИТЬ ВТРЦ
	|ИЗ
	|	РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ОтображениеРабочихЦентров.РабочиеЦентры КАК Лико_ОтображениеРабочихЦентровРабочиеЦентры
	|		ПО ТССтатистикаСкорости.РабочийЦентр = Лико_ОтображениеРабочихЦентровРабочиеЦентры.РабочийЦентр
	|ГДЕ
	|	ТССтатистикаСкорости.РабочийЦентр.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Перемотка)
	|	И ТССтатистикаСкорости.РабочееМесто.ТипРабочегоМеста = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыРабочегоМеста.Инфопад)
	|	И Лико_ОтображениеРабочихЦентровРабочиеЦентры.Ссылка = &ОтображениеРЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТССтатистикаСкорости.РабочийЦентр,
	|	ТССтатистикаСкорости.РабочийЦентр.ЛикоЯчейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ВТРЦ.РабочийЦентр КАК РабочийЦентр,
	|	ВТРЦ.Адрес КАК Адрес,
	|	ТоварыВЯчейкахОстатки.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ПОМЕСТИТЬ ВТРЦНоменклатура
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Ячейка В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТРЦ.Адрес КАК Адрес
	|					ИЗ
	|						ВТРЦ КАК ВТРЦ)
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКраска) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРЦ КАК ВТРЦ
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВТРЦ.Адрес
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РабочийЦентр,
	|	Адрес,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРЦНоменклатура.РабочийЦентр КАК РабочийЦентр,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТРЦНоменклатура.ЦеноваяГруппа) КАК КолЦГ
	|ПОМЕСТИТЬ ВтКоличествоЦГвРЦ
	|ИЗ
	|	ВТРЦНоменклатура КАК ВТРЦНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРЦНоменклатура.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ТоварыВЯчейках.Период) КАК ДатаПрихода,
	|	ВТРЦНоменклатура.РабочийЦентр КАК РабочийЦентр,
	|	ВТРЦНоменклатура.Адрес КАК Адрес,
	|	ВТРЦНоменклатура.Серия КАК Серия
	|ПОМЕСТИТЬ ВТРЦСерия
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРЦНоменклатура КАК ВТРЦНоменклатура
	|		ПО ТоварыВЯчейках.Серия = ВТРЦНоменклатура.Серия
	|			И ТоварыВЯчейках.Ячейка = ВТРЦНоменклатура.Адрес
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРЦНоменклатура.РабочийЦентр,
	|	ВТРЦНоменклатура.Адрес,
	|	ВТРЦНоменклатура.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РабочийЦентр,
	|	Серия,
	|	Адрес,
	|	ДатаПрихода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВТРЦСерия.ДатаПрихода) КАК ДатаПрихода,
	|	ВТРЦСерия.РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТРЦНоменклатураДатаПрихода
	|ИЗ
	|	ВТРЦСерия КАК ВТРЦСерия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРЦСерия.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРЦ.РабочийЦентр КАК РабочийЦентр,
	|	ВТРЦ.НомерСтрокиОтображение КАК НомерСтрокиОтображение,
	|	ВТРЦ.ДатаНачала КАК ДатаНачала,
	|	МАКСИМУМ(ТССтатистикаСкорости.ПорядковыйНомер) КАК ПорядковыйНомер,
	|	МАКСИМУМ(ТССтатистикаСкорости.РабочееМесто) КАК РабочееМесто
	|ПОМЕСТИТЬ ВТРЦПорядковыйНомерЗаписи
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|		ПО ВТРЦ.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|			И ВТРЦ.ДатаНачала = ТССтатистикаСкорости.ДатаНачала
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРЦ.РабочийЦентр,
	|	ВТРЦ.НомерСтрокиОтображение,
	|	ВТРЦ.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРЦПорядковыйНомерЗаписи.РабочийЦентр КАК РабочийЦентр,
	|	ВТРЦПорядковыйНомерЗаписи.НомерСтрокиОтображение КАК НомерСтрокиОтображение,
	|	ВТРЦПорядковыйНомерЗаписи.РабочееМесто КАК РабочееМесто,
	|	ТССтатистикаСкорости.Заказ КАК Заказ,
	|	ТССтатистикаСкорости.ЭтапПроизводства КАК ЭтапПроизводства,
	|	ТССтатистикаСкорости.Статус КАК СтатусЗаказа,
	|	ТССтатистикаСкорости.Длительность КАК Длительность,
	|	ТССтатистикаСкорости.ДатаСвертки КАК ДатаСвертки,
	|	ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку, 0) КАК МетрыНаНастройку,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.ВремяПечати, 0) + ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.ВремяНаСменуРоликов, 0) КАК ЧИСЛО(15, 0)) КАК ВремяПечати,
	|	ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку, 0) КАК ВремяНаНастройку,
	|	ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.ВремяНаСменуРоликов, 0) КАК ВремяНаСменуРоликов,
	|	ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.СкоростьПечати, 0) КАК СкоростьПечати,
	|	ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.ПроцентНаБрак, 0) КАК ПроцентНаБрак,
	|	ТССтатистикаСкорости.Скорость КАК Скорость,
	|	ТССтатистикаСкорости.ПричинаПростоя КАК ПричинаПростоя,
	|	Лико_ПараметрыПроизводстваЗаказа.СкоростьПечати КАК СкоростьПечатиПлан
	|ПОМЕСТИТЬ ВТСтатистика
	|ИЗ
	|	ВТРЦПорядковыйНомерЗаписи КАК ВТРЦПорядковыйНомерЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|			ПО ТССтатистикаСкорости.Заказ = Лико_ПараметрыПроизводстваЗаказа.Заказ
	|				И ТССтатистикаСкорости.ЭтапПроизводства.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	|		ПО ВТРЦПорядковыйНомерЗаписи.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|			И ВТРЦПорядковыйНомерЗаписи.ДатаНачала = ТССтатистикаСкорости.ДатаНачала
	|			И ВТРЦПорядковыйНомерЗаписи.ПорядковыйНомер = ТССтатистикаСкорости.ПорядковыйНомер
	|			И ВТРЦПорядковыйНомерЗаписи.РабочееМесто = ТССтатистикаСкорости.РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСтатистика.РабочийЦентр КАК РабочийЦентр,
	|	ВТСтатистика.Заказ КАК Заказ,
	|	ЗаказКлиентаЦвета.ТипКраски КАК КраскаЦГ
	|ПОМЕСТИТЬ ВтКраскиНаЗаказ
	|ИЗ
	|	ВТСтатистика КАК ВТСтатистика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО ВТСтатистика.Заказ = ЗаказКлиентаЦвета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтКраскиНаЗаказ.Заказ КАК Заказ,
	|	ВтКраскиНаЗаказ.РабочийЦентр КАК РабочийЦентр,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтКраскиНаЗаказ.КраскаЦГ) КАК КраскаЦГ
	|ПОМЕСТИТЬ ВтКоличествоВЗаказИРЦ
	|ИЗ
	|	ВТРЦНоменклатура КАК ВТРЦНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКраскиНаЗаказ КАК ВтКраскиНаЗаказ
	|		ПО ВТРЦНоменклатура.РабочийЦентр = ВтКраскиНаЗаказ.РабочийЦентр
	|			И ВТРЦНоменклатура.ЦеноваяГруппа = ВтКраскиНаЗаказ.КраскаЦГ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтКраскиНаЗаказ.Заказ,
	|	ВтКраскиНаЗаказ.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСтатистика.РабочийЦентр КАК РабочийЦентр,
	|	ВТСтатистика.Заказ КАК Заказ,
	|	ВТСтатистика.ЭтапПроизводства КАК ЭтапПроизводства,
	|	СУММА(ВЫРАЗИТЬ(ТССтатистикаСкорости.Длительность / 60 КАК ЧИСЛО(15, 0))) КАК ВремяНаНастройкуФакт,
	|	СУММА(ТССтатистикаСкорости.ПоказанияОбщегоСчетчика) КАК МетрыНаНастройкуФакт,
	|	МИНИМУМ(ТССтатистикаСкорости.ДатаНачала) КАК НачалоНастройки
	|ПОМЕСТИТЬ ВТНастройка
	|ИЗ
	|	ВТСтатистика КАК ВТСтатистика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|		ПО ВТСтатистика.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|			И ВТСтатистика.Заказ = ТССтатистикаСкорости.Заказ
	|			И ВТСтатистика.ЭтапПроизводства = ТССтатистикаСкорости.ЭтапПроизводства
	|			И (ТССтатистикаСкорости.Статус = ЗНАЧЕНИЕ(Перечисление.ТССтатусыЗаказов.Настройка))
	|			И (НЕ ТССтатистикаСкорости.ПричинаПростоя В (ЗНАЧЕНИЕ(Справочник.ТСПричиныПростояРабочегоЦентра.Профилактика), ЗНАЧЕНИЕ(Справочник.ТСПричиныПростояРабочегоЦентра.Неисправность), ЗНАЧЕНИЕ(Справочник.ТСПричиныПростояРабочегоЦентра.Перерыв), ЗНАЧЕНИЕ(Справочник.ТСПричиныПростояРабочегоЦентра.АдминистративныйПерерыв)))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтатистика.РабочийЦентр,
	|	ВТСтатистика.Заказ,
	|	ВТСтатистика.ЭтапПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСтатистика.РабочийЦентр КАК РабочийЦентр,
	|	ВТСтатистика.Заказ КАК Заказ,
	|	ВТСтатистика.ЭтапПроизводства КАК ЭтапПроизводства,
	|	СУММА(ВЫРАЗИТЬ(ТССтатистикаСкорости.Длительность / 60 КАК ЧИСЛО(15, 0))) КАК ВремяПечатиФакт,
	|	СУММА(ТССтатистикаСкорости.ПоказанияЧистогоСчетчика) КАК МетрыПечатиЧистые,
	|	СУММА(ТССтатистикаСкорости.ПоказанияОбщегоСчетчика) КАК МетрыПечатиОбщие,
	|	ИСТИНА КАК НаличиеПечати,
	|	МИНИМУМ(ТССтатистикаСкорости.ДатаНачала) КАК НачалоПечати
	|ПОМЕСТИТЬ ВТПечать
	|ИЗ
	|	ВТСтатистика КАК ВТСтатистика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
	|		ПО ВТСтатистика.РабочийЦентр = ТССтатистикаСкорости.РабочийЦентр
	|			И ВТСтатистика.Заказ = ТССтатистикаСкорости.Заказ
	|			И ВТСтатистика.ЭтапПроизводства = ТССтатистикаСкорости.ЭтапПроизводства
	|			И (ТССтатистикаСкорости.Статус = ЗНАЧЕНИЕ(Перечисление.ТССтатусыЗаказов.Печать))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтатистика.РабочийЦентр,
	|	ВТСтатистика.Заказ,
	|	ВТСтатистика.ЭтапПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСтатистика.РабочийЦентр КАК РабочийЦентр,
	|	ВТСтатистика.НомерСтрокиОтображение КАК НомерСтрокиОтображение,
	|	ВТСтатистика.РабочееМесто КАК РабочееМесто,
	|	ВТСтатистика.Заказ КАК Заказ,
	|	ВТСтатистика.СтатусЗаказа КАК СтатусЗаказа,
	|	ВТСтатистика.Длительность КАК Длительность,
	|	ВТСтатистика.ДатаСвертки КАК ДатаСвертки,
	|	ВТСтатистика.ПричинаПростоя КАК ПричинаПростоя,
	|	ВТСтатистика.МетрыНаНастройку КАК МетрыНаНастройкуПлан,
	|	ЕСТЬNULL(ВТНастройка.МетрыНаНастройкуФакт, 0) КАК МетрыНаНастройкуФакт,
	|	ЕСТЬNULL(ВТПечать.МетрыПечатиОбщие, 0) КАК МетрыПечатиОбщие,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТПечать.МетрыПечатиЧистые, 0) + ЕСТЬNULL(ВТПечать.МетрыПечатиЧистые, 0) * ВТСтатистика.ПроцентНаБрак КАК ЧИСЛО(15, 0)) КАК МетрыПечатиПлан,
	|	ВТСтатистика.ПроцентНаБрак * 100 КАК ПроцентНаБракПлан,
	|	ЕСТЬNULL(ВТСтатистика.ВремяНаНастройку, 0) КАК ВремяНаНастройкуПлан,
	|	ЕСТЬNULL(ВТНастройка.ВремяНаНастройкуФакт, 0) КАК ВремяНаНастройкуФакт,
	|	ВТСтатистика.Скорость КАК Скорость,
	|	ВТСтатистика.ВремяПечати КАК ВремяПечатиПлан,
	|	ЕСТЬNULL(ВТПечать.ВремяПечатиФакт, 0) КАК ВремяПечатиФакт,
	|	ЕСТЬNULL(ВТПечать.НаличиеПечати, ЛОЖЬ) КАК НаличиеПечати,
	|	ЕСТЬNULL(ВТПечать.МетрыПечатиЧистые, 0) КАК МетрыПечатиЧистые,
	|	ЕСТЬNULL(ВТНастройка.НачалоНастройки, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК НачалоНастройки,
	|	ЕСТЬNULL(ВТПечать.НачалоПечати, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК НачалоПечати,
	|	ВТСтатистика.СкоростьПечатиПлан КАК СкоростьПечатиПлан,
	|	ВТСтатистика.Скорость КАК СкоростьФакт,
	|	ВЫБОР
	|		КОГДА ВТРЦНоменклатураДатаПрихода.ДатаПрихода ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВТРЦНоменклатураДатаПрихода.ДатаПрихода, &ТекущаяДата, МИНУТА)
	|	КОНЕЦ КАК PaintTime,
	|	ВтКоличествоВЗаказИРЦ.КраскаЦГ КАК КраскаЦГ,
	|	ВтКоличествоЦГвРЦ.КолЦГ КАК КолЦГ,
	|	ВЫБОР
	|		КОГДА НЕ ВтКоличествоВЗаказИРЦ.КраскаЦГ ЕСТЬ NULL
	|				И НЕ ВтКоличествоЦГвРЦ.КолЦГ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВтКоличествоВЗаказИРЦ.КраскаЦГ = ВтКоличествоЦГвРЦ.КолЦГ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Paint318
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТСтатистика КАК ВТСтатистика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройка КАК ВТНастройка
	|		ПО ВТСтатистика.РабочийЦентр = ВТНастройка.РабочийЦентр
	|			И ВТСтатистика.Заказ = ВТНастройка.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПечать КАК ВТПечать
	|		ПО ВТСтатистика.РабочийЦентр = ВТПечать.РабочийЦентр
	|			И ВТСтатистика.Заказ = ВТПечать.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРЦНоменклатураДатаПрихода КАК ВТРЦНоменклатураДатаПрихода
	|		ПО ВТСтатистика.РабочийЦентр = ВТРЦНоменклатураДатаПрихода.РабочийЦентр
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКоличествоЦГвРЦ КАК ВтКоличествоЦГвРЦ
	|		ПО ВТСтатистика.РабочийЦентр = ВтКоличествоЦГвРЦ.РабочийЦентр
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКоличествоВЗаказИРЦ КАК ВтКоличествоВЗаказИРЦ
	|		ПО ВТСтатистика.РабочийЦентр = ВтКоличествоВЗаказИРЦ.РабочийЦентр
	|			И ВТСтатистика.Заказ = ВтКоличествоВЗаказИРЦ.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтатистика.СтатусЗаказа,
	|	ВТСтатистика.Заказ,
	|	ВТСтатистика.ДатаСвертки,
	|	ВТСтатистика.РабочийЦентр,
	|	ВТСтатистика.НомерСтрокиОтображение,
	|	ВТСтатистика.РабочееМесто,
	|	ВТСтатистика.ПричинаПростоя,
	|	ЕСТЬNULL(ВТНастройка.НачалоНастройки, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(ВТПечать.НаличиеПечати, ЛОЖЬ),
	|	ЕСТЬNULL(ВТПечать.НачалоПечати, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ВТСтатистика.Длительность,
	|	ВТСтатистика.МетрыНаНастройку,
	|	ЕСТЬNULL(ВТНастройка.МетрыНаНастройкуФакт, 0),
	|	ЕСТЬNULL(ВТПечать.МетрыПечатиОбщие, 0),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТПечать.МетрыПечатиЧистые, 0) + ЕСТЬNULL(ВТПечать.МетрыПечатиЧистые, 0) * ВТСтатистика.ПроцентНаБрак КАК ЧИСЛО(15, 0)),
	|	ВТСтатистика.ПроцентНаБрак * 100,
	|	ЕСТЬNULL(ВТСтатистика.ВремяНаНастройку, 0),
	|	ЕСТЬNULL(ВТНастройка.ВремяНаНастройкуФакт, 0),
	|	ВТСтатистика.Скорость,
	|	ВТСтатистика.ВремяПечати,
	|	ЕСТЬNULL(ВТПечать.ВремяПечатиФакт, 0),
	|	ЕСТЬNULL(ВТПечать.МетрыПечатиЧистые, 0),
	|	ВТСтатистика.СкоростьПечатиПлан,
	|	ВЫБОР
	|		КОГДА ВТРЦНоменклатураДатаПрихода.ДатаПрихода ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВТРЦНоменклатураДатаПрихода.ДатаПрихода, &ТекущаяДата, МИНУТА)
	|	КОНЕЦ,
	|	ВтКоличествоВЗаказИРЦ.КраскаЦГ,
	|	ВтКоличествоЦГвРЦ.КолЦГ,
	|	ВЫБОР
	|		КОГДА НЕ ВтКоличествоВЗаказИРЦ.КраскаЦГ ЕСТЬ NULL
	|				И НЕ ВтКоличествоЦГвРЦ.КолЦГ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВтКоличествоВЗаказИРЦ.КраскаЦГ = ВтКоличествоЦГвРЦ.КолЦГ
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВТСтатистика.Скорость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанные.РабочийЦентр.ПорядковыйНомер КАК WorkСenter,
	|	ВТДанные.РабочееМесто.ТССреднееВремяСменыРолика КАК AvTimeToChangeRollerSec,
	|	ЕСТЬNULL(ВТДанные.Заказ.НомерБезПрефикса, """") КАК Order,
	|	ЕСТЬNULL(ВТДанные.Заказ.Партнер.Наименование, """") КАК Customer,
	|	ЕСТЬNULL(ВТДанные.Заказ.Этикетки, """") КАК Labels,
	|	ПРЕДСТАВЛЕНИЕ(ВТДанные.СтатусЗаказа) КАК Status,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТДанные.ПричинаПростоя) = ТИП(СТРОКА)
	|				ТОГДА ВТДанные.ПричинаПростоя
	|			ИНАЧЕ ВТДанные.ПричинаПростоя.Наименование
	|		КОНЕЦ, """") КАК ReasonIdle,
	|	ВТДанные.МетрыНаНастройкуПлан КАК MetersOnSettingPlan,
	|	ВТДанные.МетрыНаНастройкуФакт КАК MetersOnSettingFact,
	|	ВЫБОР
	|		КОГДА ВТДанные.НаличиеПечати
	|				И ВТДанные.МетрыНаНастройкуФакт > 0
	|				И ВТДанные.МетрыНаНастройкуПлан > 0
	|			ТОГДА ВЫРАЗИТЬ(100 * (ВТДанные.МетрыНаНастройкуФакт - ВТДанные.МетрыНаНастройкуПлан) / ВТДанные.МетрыНаНастройкуПлан КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК OverrunSetting,
	|	ВТДанные.МетрыПечатиЧистые КАК PrintMetersClean,
	|	ВТДанные.ПроцентНаБракПлан КАК MarriageRatePlan,
	|	ВТДанные.МетрыПечатиПлан КАК PrintMetersPlan,
	|	ВТДанные.МетрыПечатиОбщие КАК PrintMetersFact,
	|	ВЫБОР
	|		КОГДА ВТДанные.МетрыПечатиОбщие > 0
	|			ТОГДА ВЫРАЗИТЬ(100 * (ВТДанные.МетрыПечатиОбщие - ВТДанные.МетрыПечатиПлан) / ВТДанные.МетрыПечатиОбщие КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК OverrunPrint,
	|	ВТДанные.ВремяНаНастройкуПлан КАК TimeSettingPlan,
	|	ВТДанные.ВремяНаНастройкуФакт КАК TimeSettingFact,
	|	ВТДанные.Скорость КАК SpeedAverage,
	|	ВЫБОР
	|		КОГДА ВТДанные.НаличиеПечати
	|			ТОГДА ВТДанные.ВремяПечатиПлан - ВТДанные.ВремяПечатиФакт
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТДанные.ВремяНаНастройкуПлан > ВТДанные.ВремяНаНастройкуФакт
	|					ТОГДА ВТДанные.ВремяНаНастройкуПлан + ВТДанные.ВремяПечатиПлан - ВТДанные.ВремяНаНастройкуФакт
	|				ИНАЧЕ ВТДанные.ВремяПечатиПлан
	|			КОНЕЦ
	|	КОНЕЦ КАК StandardTimeUntilPrinting,
	|	ВЫБОР
	|		КОГДА ВТДанные.Заказ.МетражПМ > 8000
	|			ТОГДА ВЫБОР
	|					КОГДА ВТДанные.МетрыПечатиЧистые > 4000
	|							И ВТДанные.ВремяПечатиФакт > 0
	|						ТОГДА ВЫРАЗИТЬ((ВТДанные.Заказ.МетражПМ - ВТДанные.МетрыПечатиЧистые) / (ВТДанные.МетрыПечатиЧистые / ВТДанные.ВремяПечатиФакт) КАК ЧИСЛО(15, 0))
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТДанные.МетрыПечатиЧистые > ВТДанные.Заказ.МетражПМ / 2
	|						И ВТДанные.ВремяПечатиФакт > 0
	|					ТОГДА ВЫРАЗИТЬ((ВТДанные.Заказ.МетражПМ - ВТДанные.МетрыПечатиЧистые) / (ВТДанные.МетрыПечатиЧистые / ВТДанные.ВремяПечатиФакт) КАК ЧИСЛО(15, 0))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК EstimatedTimeUntilTheEndPrint,
	|	ЕСТЬNULL(ВТДанные.Заказ.МетражПМ, 0) КАК MetersByOrder,
	|	ВТДанные.ВремяПечатиФакт КАК PrintTimeFact,
	|	ВТДанные.НачалоНастройки КАК StartSetting,
	|	ВТДанные.НачалоПечати КАК StartPrint,
	|	ВЫБОР
	|		КОГДА ВТДанные.РабочийЦентр.Лико_НомерДляОтчетов = 0
	|			ТОГДА 100
	|		ИНАЧЕ ВТДанные.РабочийЦентр.Лико_НомерДляОтчетов
	|	КОНЕЦ КАК OutputOrder,
	|	ЕСТЬNULL(ВТДанные.Заказ.Номер, """") КАК DocNum,
	|	ЕСТЬNULL(ВТДанные.Заказ.Дата, """") КАК DocDate,
	|	ВТДанные.ВремяПечатиПлан КАК TimePrintPlan,
	|	ЕСТЬNULL(ВТДанные.СкоростьПечатиПлан, 0) КАК SpeedPlan,
	|	ВТДанные.СкоростьФакт КАК SpeedFact,
	|	ВТДанные.РабочийЦентр.Наименование КАК WorkCenterName,
	|	ВЫРАЗИТЬ(ВТДанные.Длительность / 60 КАК ЧИСЛО(15, 0)) КАК Duration,
	|	ВТДанные.ДатаСвертки КАК RelevanceTime,
	|	ЕСТЬNULL(ВТДанные.PaintTime, 0) КАК PaintTime,
	|	ВТДанные.Paint318 КАК Paint318
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТДанные.НомерСтрокиОтображение";	
	//Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	Запрос.УстановитьПараметр("ОтображениеРЦ",ОтображениеРЦ);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ВидНоменклатурыКраска",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	// --> Начало Лико Ефимов ЕВВ 09.11.2021
	//Тз.Колонки.Добавить("AvTimeToChangeRollerSec", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5, 0)));
	//ДанныеПоПродолжительностиПростоев = Лико_Дополнительно.ПолучитьДанныеПоПродолжительностиПростоев(ОтображениеРЦ.РабочиеЦентры.ВыгрузитьКолонку("РабочийЦентр"));
	//Если ДанныеПоПродолжительностиПростоев.Количество() > 0 Тогда
	//	Для каждого Строка из ТЗ Цикл
	//		Если ЗначениеЗаполнено(Строка.WorkСenterLink) Тогда
	//			СтрокиВДанныхПоПродолжительностиПростоев = ДанныеПоПродолжительностиПростоев.НайтиСтроки(Новый Структура("РабочийЦентр", Строка.WorkСenterLink));
	//			Если СтрокиВДанныхПоПродолжительностиПростоев.Количество() > 0 Тогда
	//				Строка.AvTimeToChangeRollerSec = СтрокиВДанныхПоПродолжительностиПростоев[0].Продолжительность / ?(СтрокиВДанныхПоПродолжительностиПростоев[0].КоличествоВыпущенныхРоликовГП = 0, 1, СтрокиВДанныхПоПродолжительностиПростоев[0].КоличествоВыпущенныхРоликовГП);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	//Тз.Колонки.Удалить("WorkСenterLink");					
	// <-- Конец Лико Ефимов ЕВВ 09.11.2021
	
	#КонецОбласти
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Функция TouchPad_GetState(ПараметрыPOST) 	 
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "TPID");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	TPID = ПараметрыPOST.TPID;
	РабочееМесто=Справочники.Лико_РабочиеМеста.НайтиПоКоду(TPID);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТСИсторияРабочегоСтолаОператора.РабочийЦентр КАК РабочийЦентр,
	|	МАКСИМУМ(ТСИсторияРабочегоСтолаОператора.Период) КАК Период
	|ПОМЕСТИТЬ ВТРЦ
	|ИЗ
	|	РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
	|ГДЕ
	|	ТСИсторияРабочегоСтолаОператора.РабочийЦентр = &РЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСИсторияРабочегоСтолаОператора.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРЦ.РабочийЦентр КАК РабочийЦентр,
	|	ВТРЦ.Период КАК Период,
	|	ТСИсторияРабочегоСтолаОператора.РабочееМесто КАК РабочееМесто,
	|	МАКСИМУМ(ТСИсторияРабочегоСтолаОператора.ПорядковыйНомер) КАК ПорядковыйНомер
	|ПОМЕСТИТЬ ВТРЦПорядковыйНомерЗаписи
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
	|		ПО ВТРЦ.РабочийЦентр = ТСИсторияРабочегоСтолаОператора.РабочийЦентр
	|			И ВТРЦ.Период = ТСИсторияРабочегоСтолаОператора.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРЦ.РабочийЦентр,
	|	ВТРЦ.Период,
	|	ТСИсторияРабочегоСтолаОператора.РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРЦПорядковыйНомерЗаписи.РабочийЦентр КАК РабочийЦентр,
	|	ТСИсторияРабочегоСтолаОператора.Заказ КАК Заказ,
	|	ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства.НомерПроката КАК НомерПроката,
	|	ВТРЦПорядковыйНомерЗаписи.Период КАК Период,
	|	ТСИсторияРабочегоСтолаОператора.Оператор КАК Оператор
	|ПОМЕСТИТЬ ВТЗаказ
	|ИЗ
	|	ВТРЦПорядковыйНомерЗаписи КАК ВТРЦПорядковыйНомерЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
	|		ПО ВТРЦПорядковыйНомерЗаписи.РабочийЦентр = ТСИсторияРабочегоСтолаОператора.РабочийЦентр
	|			И ВТРЦПорядковыйНомерЗаписи.РабочееМесто = ТСИсторияРабочегоСтолаОператора.РабочееМесто
	|			И ВТРЦПорядковыйНомерЗаписи.Период = ТСИсторияРабочегоСтолаОператора.Период
	|			И ВТРЦПорядковыйНомерЗаписи.ПорядковыйНомер = ТСИсторияРабочегоСтолаОператора.ПорядковыйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТЗаказ.РабочийЦентр.ПорядковыйНомер КАК WorkCenterNumber,
	|	ВТЗаказ.РабочийЦентр.Наименование КАК WorkCenterName,
	|	ВТЗаказ.Период КАК Data,
	|	ВТЗаказ.Заказ.НомерБезПрефикса КАК Order,
	|	ВТЗаказ.Заказ.Дата КАК _order_date,
	|	ВТЗаказ.Заказ.Номер КАК _order_num,
	|	""ЗаказКлиента"" КАК _order_doc_name,
	|	ВТЗаказ.Оператор.Наименование КАК OperatorName,
	|	ВТЗаказ.Заказ.Партнер.Код КАК PartnerCode,
	|	ВТЗаказ.Заказ.Партнер.Наименование КАК PartnerName,
	|	ВТЗаказ.Заказ.Этикетки КАК Labels
	|ИЗ
	|	ВТЗаказ КАК ВТЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаЦвета.ВидПечати КАК ВидПечати,
	|	ЗаказКлиентаЦвета.ТипЦвета1.Наименование КАК ТипЦвета,
	|	ЗаказКлиентаЦвета.ТипКраски КАК ТипКраски,
	|	ЗаказКлиентаЦвета.Название КАК Название,
	|	ЗаказКлиентаЦвета.НомерСекции КАК НомерСекции,
	|	ЗаказКлиентаЦвета.КлючСтроки КАК КлючСтроки,
	|	ЗаказКлиентаЦвета.ТипКраски КАК ТипКраскиФакт,
	|	ЗаказКлиентаЦвета.ТипКраски.Код КАК ТипКраскиФактКод,
	|	ЗаказКлиентаЦвета.ТипКраски.Код КАК ТипКраскиКод,
	|	ЗаказКлиентаЦвета.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТЗаказ КАК ВТЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО ВТЗаказ.Заказ = ЗаказКлиентаЦвета.Ссылка
	|			И ВТЗаказ.НомерПроката = ЗаказКлиентаЦвета.НомерПроката
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки" ;   
	
	
	
	Запрос.УстановитьПараметр("РЦ", РабочееМесто.ТСРабочийЦентр); 
	Пакеты=Запрос.ВыполнитьПакет();
	Структура = Новый Структура;
	Структура.Вставить("Заказ",Лико_HTTP_Сервер.ТзВМассивСтруктур(Пакеты[3].Выгрузить()));
	Структура.Вставить("Цвета",Лико_HTTP_Сервер.ТзВМассивСтруктур(Пакеты[4].Выгрузить()));
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(Структура));
	
	
	
КонецФункции 

Функция TouchPad_SetColor(ПараметрыPOST) 	 
	
	Отказ = Ложь;
	
	error="";
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "TPID,ЗаказНомер,КлючСтроки,ШтрихКод");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	TPID = ПараметрыPOST.TPID;
	РабочееМесто=Справочники.Лико_РабочиеМеста.НайтиПоКоду(TPID);
	ЗаказНомер = ПараметрыPOST.ЗаказНомер;
	КлючСтроки = Новый УникальныйИдентификатор(ПараметрыPOST.КлючСтроки);
	ШтрихКод = ПараметрыPOST.ШтрихКод;
	ЦеноваяГруппа=Неопределено;
	Номенклатура=Неопределено;
	
	СтруктураШК=Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(ШтрихКод);
	Если СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий Тогда 
		ОбъектНоменклатуры=СтруктураШК.ОбъектНоменклатуры ;
		ЦеноваяГруппа=ОбъектНоменклатуры.Номенклатура.ЦеноваяГруппа;
		Номенклатура=ОбъектНоменклатуры.Номенклатура;
	КонецЕсли;
	
	
	
	ЗаказКлиента=Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаЦвета.КлючСтроки КАК КлючСтроки,
	|	ЗаказКлиентаЦвета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.КлючСтроки = &КлючСтроки
	|	И ЗаказКлиентаЦвета.Ссылка.Номер = &Номер";
	Запрос.УстановитьПараметр("КлючСтроки",КлючСтроки );
	Запрос.УстановитьПараметр("Номер",ЗаказНомер );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказКлиента=Выборка.Ссылка;
	КонецЦикла; 
	
	ready=Ложь;	
	
	Если ЗначениеЗаполнено(ЗаказКлиента) И ЗначениеЗаполнено(ЦеноваяГруппа) Тогда
		УстановитьПривилегированныйРежим(Истина);	
		ДокОбъект=ЗаказКлиента.ПолучитьОбъект();
		//ДокОбъект=Документы.ЗаказКлиента.СоздатьДокумент();
		ДокОбъект.ОбменДанными.Загрузка=Истина;
		НайденныеСтроки=ДокОбъект.Цвета.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтроки));
		
		
		Для каждого СтрТЗ Из НайденныеСтроки Цикл
			
			СообщениеОбОшибке=Лико_ОбщегоНазначенияСервер.ПроверкаСвойствТМЦ(Номенклатура
			,СтрТЗ.ВидТМЦ
			,СтрТЗ.ВидСекции
			,СтрТЗ.ТипКраски);
			
			Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда 
				Отказ	=	Истина;	
				error 	=	СообщениеОбОшибке;				
				ready	=	ложь;
				
				Прервать;
				
			КонецЕсли;			
			
			СтрТЗ.ТипКраски=ЦеноваяГруппа;
			
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				СтрТЗ.Номенклатура= Номенклатура;
				СтрТЗ.УтвердилОператор=Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(ПараметрыPOST.UserNumber,ДокОбъект.ДатаУтвержденияОператором); 			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не Отказ Тогда	   
		Если ПараметрыPOST.Свойство("UserNumber") Тогда 
			
			//ДокОбъект.ДатаУтвержденияОператором=ТекущаяДата();
			//ДокОбъект.УтвердилОператор=Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(ПараметрыPOST.UserNumber,ДокОбъект.ДатаУтвержденияОператором);
			
		КонецЕсли;
		
		ДокОбъект.Записать();		
		ready=Истина;
	КонецЕсли;
	
	
	Структура = Новый Структура;
	Структура.Вставить("ready", ready);
	Структура.Вставить("error", error);
	
	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
	
	
КонецФункции 

Функция TouchPad_GetWorkplaceParams (ПараметрыPOST) 	 
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "WPID");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	TPID = ПараметрыPOST.WPID ;
	РабочееМесто=Справочники.Лико_РабочиеМеста.НайтиПоКоду(TPID);
	
	functions= Новый Массив;
	Для каждого СтрФункционал Из РабочееМесто.ФункционалДляВебТерминала Цикл
		Структура = Новый Структура;
		Структура.Вставить("code",СтрФункционал.Сервис.Код); 
		Структура.Вставить("name",СтрФункционал.Сервис.Наименование); 
		functions.Добавить(Структура);		
	КонецЦикла;
	
	Структура = Новый Структура;
	Структура.Вставить("workplace",РабочееМесто.Код);
	Структура.Вставить("touchpad",РабочееМесто.ТипРабочегоМеста=Перечисления.Лико_ТипыРабочегоМеста.Инфопад);
	Структура.Вставить("functions",functions);	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(Структура));	
	
	
КонецФункции 

Функция TouchPad_WriteОffМaterials (ПараметрыPOST) 	 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "WPID,UserNumber,Мaterials");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	TPID = ПараметрыPOST.WPID ;
	РабочееМесто=Справочники.Лико_РабочиеМеста.НайтиПоКоду(TPID);	
	
	Мaterials=ПараметрыPOST.Мaterials; 
	UserNumber=ПараметрыPOST.UserNumber;
	
	
	МассивСерий = Новый Массив(); 
	МассивОбъектов = Новый Массив();
	
	
	Для каждого Мaterial Из Мaterials Цикл
		//СтруктураШК=Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(ШтрихКод); 
		СтруктураОбъектов = Новый Структура;
		
		СтруктураОбъектов.Вставить("ОбъектНоменклатуры", Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьСсылку( Новый УникальныйИдентификатор(Мaterial.Материал)));
		СтруктураОбъектов.Вставить("Адрес", Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Мaterial.Адрес)));
		СтруктураОбъектов.Вставить("Количество",Число(Мaterial.Количество)); 
		СтруктураОбъектов.Вставить("Серия",СтруктураОбъектов.ОбъектНоменклатуры.Серия);
		Если ЗначениеЗаполнено(СтруктураОбъектов.ОбъектНоменклатуры) И СтруктураОбъектов.ОбъектНоменклатуры.Уникальный Тогда 
			
			МассивСерий.Добавить(СтруктураОбъектов.Серия) ;
			
		Иначе
			
			МассивОбъектов.Добавить(СтруктураОбъектов) ; 
			
		КонецЕсли;		
	КонецЦикла;		
	
	Сотрудник=Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(UserNumber,ТекущаяДата());
	
	Структура = Новый Структура;
	Структура.Вставить("РабочееМесто",РабочееМесто);
	Структура.Вставить("Организация",УправлениеСвойствами.ЗначениеСвойства(РабочееМесто.Пользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b"));
	Структура.Вставить("Подразделение",РабочееМесто.Пользователь.Подразделение);
	Структура.Вставить("Склад",РабочееМесто.СкладСИМ);
	Структура.Вставить("АвторДокумента",?(ЗначениеЗаполнено(Сотрудник),Сотрудник,РабочееМесто.СотрудникПоF2));
	Структура.Вставить("Сотрудник",?(ЗначениеЗаполнено(Сотрудник),Сотрудник,РабочееМесто.СотрудникПоF2));
	
	Структура.Вставить("МассивСерий",МассивСерий);
	Структура.Вставить("МассивОбъектов",МассивОбъектов);
	
	
	Результат=Лико_ОбщегоНазначенияСервер.СписаниеОбъектовНоменклатурыСоСклада(Структура);
	
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("result",Число(ЗначениеЗаполнено(Результат)));
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СтруктураОтвет.Вставить("DocDate",Результат.Дата);
		СтруктураОтвет.Вставить("DocNumber",Результат.Номер);		
	КонецЕсли;
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(СтруктураОтвет));	
	
	
КонецФункции 

Функция TouchPad_MovingМaterials (ПараметрыPOST) 	 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "WPID,UserNumber,Мaterials,Address");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	TPID 			= ПараметрыPOST.WPID ;
	РабочееМесто	= Справочники.Лико_РабочиеМеста.НайтиПоКоду(TPID);	
	Мaterials		= ПараметрыPOST.Мaterials; 
	UserNumber		= ПараметрыPOST.UserNumber; 
	Address			= ПараметрыPOST.Address; 	
	
	МассивСерий 	= Новый Массив(); 
	МассивОбъектов 	= Новый Массив();	
	
	Для каждого Мaterial Из Мaterials Цикл
		
		СтруктураОбъектов = Новый Структура;		
		СтруктураОбъектов.Вставить("ОбъектНоменклатуры", Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьСсылку( Новый УникальныйИдентификатор(Мaterial.Материал)));
		СтруктураОбъектов.Вставить("Адрес", Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Мaterial.Адрес)));
		СтруктураОбъектов.Вставить("Количество",Число(Мaterial.Количество)); 
		СтруктураОбъектов.Вставить("Серия",СтруктураОбъектов.ОбъектНоменклатуры.Серия);
		
		Если ЗначениеЗаполнено(СтруктураОбъектов.ОбъектНоменклатуры) И СтруктураОбъектов.ОбъектНоменклатуры.Уникальный Тогда
			МассивСерий.Добавить(СтруктураОбъектов.Серия) ;
		Иначе
			МассивОбъектов.Добавить(СтруктураОбъектов) ;  			 
		КонецЕсли;
		
	КонецЦикла;	
	
	АдресаХранения= Справочники.СкладскиеЯчейки.ПолучитьСсылку( Новый УникальныйИдентификатор(Address)); 	
	Сотрудник=Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(UserNumber,ТекущаяДата());
	
	Структура = Новый Структура;
	Структура.Вставить("РабочееМесто",РабочееМесто);
	Структура.Вставить("Организация",УправлениеСвойствами.ЗначениеСвойства(РабочееМесто.Пользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b"));
	Структура.Вставить("Подразделение",РабочееМесто.Пользователь.Подразделение);
	Структура.Вставить("Склад",РабочееМесто.СкладСИМ);
	Структура.Вставить("АвторДокумента",?(ЗначениеЗаполнено(Сотрудник),Сотрудник,РабочееМесто.СотрудникПоF2));
	Структура.Вставить("Сотрудник",?(ЗначениеЗаполнено(Сотрудник),Сотрудник,РабочееМесто.СотрудникПоF2));
	
	Структура.Вставить("МассивСерий",МассивСерий);
	Структура.Вставить("МассивОбъектов",МассивОбъектов);	
	Структура.Вставить("АдресХранения",АдресаХранения); 
	
	Результат=Лико_ОбщегоНазначенияСервер.ПеремещениеОбъектовНоменклатуры(Структура);	
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("result",Число(ЗначениеЗаполнено(Результат)И ТипЗнч(Результат)=Тип("ДокументСсылка.Лико_ПередачаТоваров")));
	
	Если ЗначениеЗаполнено(Результат)  Тогда 
		Если ТипЗнч(Результат)=Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
			СтруктураОтвет.Вставить("DocDate",Результат.Дата);
			СтруктураОтвет.Вставить("DocNumber",Результат.Номер);
		Иначе
			СтруктураОтвет.Вставить("message",Результат);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(СтруктураОтвет));	
	
КонецФункции 




Функция PartnersList071220(ПараметрыPOST)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Партнеры.Код КАК PartnerCode,
	|	Партнеры.Наименование КАК PartnerName,
	|	Партнеры.БизнесРегион.КодРегиона КАК BusinessRegionCode,
	|	Партнеры.БизнесРегион.Наименование КАК BusinessRegionName
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.ПометкаУдаления = ЛОЖЬ
	|И	Партнеры.Клиент = ИСТИНА
	|И  Партнеры.БизнесРегион <> ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	Партнеры.Наименование";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
КонецФункции

Функция PartnersList(ПараметрыPOST)
	Запрос = Новый Запрос;
	Запрос.Текст =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Партнеры.Ссылка КАК Ссылка,
	//|	""0000-0000-0000-0000-0000-0000-0000-0000"" КАК Guid,
	//|	Партнеры.Код КАК PartnerCode,
	//|	Партнеры.Наименование КАК PartnerName,
	//|	Партнеры.БизнесРегион.КодРегиона КАК BusinessRegionCode,
	//|	Партнеры.БизнесРегион.Наименование КАК BusinessRegionName
	//|ИЗ
	//|	Справочник.Партнеры КАК Партнеры
	//|ГДЕ
	//|	Партнеры.ПометкаУдаления = ЛОЖЬ
	//|И	Партнеры.Клиент = ИСТИНА
	//|И  Партнеры.БизнесРегион <> ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)
	//|УПОРЯДОЧИТЬ ПО
	//|	Партнеры.Наименование";
	
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Партнеры.Ссылка КАК Ссылка,
	|	""0000-0000-0000-0000-0000-0000-0000-0000"" КАК Guid,
	|	Партнеры.Код КАК PartnerCode,
	|	Партнеры.Наименование КАК PartnerName,
	|	Партнеры.БизнесРегион.КодРегиона КАК BusinessRegionCode,
	|	Партнеры.БизнесРегион.Наименование КАК BusinessRegionName,
	|	Партнеры.ОсновнойМенеджер.Наименование КАК Manager,
	|	МАКСИМУМ(ПользователиКонтактнаяИнформация.АдресЭП) КАК ManagerMail
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО Партнеры.ОсновнойМенеджер = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|ГДЕ
	|	 Партнеры.Клиент = ИСТИНА
	|	И Партнеры.БизнесРегион <> ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &ФильтрПоКоду
	|				ТОГДА Партнеры.Код = &PartnerCode 	
	|			ИНАЧЕ 
	|	Партнеры.ПометкаУдаления = ЛОЖЬ  
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Партнеры.Ссылка,
	|	Партнеры.БизнесРегион.КодРегиона,
	|	Партнеры.БизнесРегион.Наименование,
	|	Партнеры.Код,
	|	Партнеры.Наименование,
	|	Партнеры.ОсновнойМенеджер.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партнеры.Наименование";
	
	
	PartnerCode="";
	Если ЕстьСвойство(ПараметрыPOST, "PartnerCode") Тогда
		PartnerCode = ПараметрыPOST.PartnerCode;
	Иначе
	КонецЕсли;
	Запрос.УстановитьПараметр("ФильтрПоКоду",ЗначениеЗаполнено(PartnerCode));
	Запрос.УстановитьПараметр("PartnerCode",PartnerCode);
	
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого стрТЗ Из ТЗ Цикл 	
		стрТЗ.guid= стрТЗ.Ссылка.УникальныйИдентификатор(); 	
		Если  Не ЗначениеЗаполнено(стрТЗ.ManagerMail) Тогда
			стрТЗ.ManagerMail="";
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(стрТЗ.Manager) Тогда
			стрТЗ.Manager="";
		КонецЕсли;
		
		
	КонецЦикла;
	Тз.Колонки.Удалить(0);
	
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
КонецФункции

Функция BusinessRegionsList(ПараметрыPOST)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БизнесРегионы.КодРегиона КАК RegionCode,
	|	БизнесРегионы.Наименование КАК RegionName
	|ИЗ
	|	Справочник.БизнесРегионы КАК БизнесРегионы
	|ГДЕ
	|	БизнесРегионы.КодРегиона > 0
	|УПОРЯДОЧИТЬ ПО
	|	БизнесРегионы.Наименование";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
КонецФункции

Функция PlanWorkCenters(ПараметрыPOST)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	КонецЕсли;
	// Проверим доступ к сайту
	ДоступКСайту = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "Лико_ДоступКСайту", Ложь);
	Если НЕ ДоступКСайту Тогда
		Возврат HttpВернутьОшибку(424, "В 1С для вашего пользователя не разрешен доступ к сайту");
	КонецЕсли;
	//+ Лико m.shenderov 14.09.2021
	//Значения DataType
	//•	1 – печать
	//•	2 – гравировка 	
	Если  ПараметрыPOST.Свойство("DataType") Тогда
		DataType=Число(ПараметрыPOST.DataType);
	Иначе
		DataType=1;
	КонецЕсли;
	//- Лико m.shenderov 14.09.2021
	
	
	// Проверим доступ к заказам
	ТипПрав = "НеВидитНичего";
	Если Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("ПолныеПрава", Пользователь) Тогда
		ТипПрав = "ВидитВсе";
	ИначеЕсли Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке", Пользователь) И Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ЗаказыКлиентов", Пользователь) Тогда
		ТипПрав = "ВидитВсеЗаказыПоПлощадкеИСвоиЗаказы";	
	ИначеЕсли Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке", Пользователь) Тогда
		ТипПрав = "ВидитВсеЗаказыПоПлощадке";	
	ИначеЕсли Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ЗаказыКлиентов", Пользователь) Тогда
		ТипПрав = "ВидитТолькоСвоиЗаказы";
	КонецЕсли;
	Если ТипПрав = "НеВидитНичего" Тогда
		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя нет прав на просмотр плана");
	КонецЕсли;
	// Найдем настройку отображения РЦ
	Если DataType=2 Тогда
		//гравировка 
		ОтображениеРЦ = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "Лико_ОтображениеРабочихЦентровГравировка");
	Иначе
		ОтображениеРЦ = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "ОтображениеРабочихЦентров_3aa9d025140f45bc8a59ec155d871714");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтображениеРЦ) Тогда
		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заполена настройка отображения РЦ");
	КонецЕсли;
	
	МассивПлощадок = Новый Массив;
	Если ТипПрав = "ВидитВсеЗаказыПоПлощадке" ИЛИ ТипПрав = "ВидитВсеЗаказыПоПлощадкеИСвоиЗаказы" Тогда
		// Определим доступные площадки
		МассивПлощадок = Пользователь.Лико_Площадки.ВыгрузитьКолонку("Площадка");
		//МассивПлощадок.Добавить(Пользователь.Лико_Площадка);
		МассивПлощадок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПлощадок);
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивПлощадок, Справочники.Организации.ПустаяСсылка());
		Если МассивПлощадок.Количество() = 0 Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");
		КонецЕсли;
	КонецЕсли;	
	
	// Получим текст запроса из обработки планирования
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Справочники.Лико_ПредопределенныеЗначения.ВнешняяОбработкаПланированиеРЦ.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С в справочнике предопределенных значений не найдена обработка планирования РЦ. Обратитесь к программистам");
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработкаПлан = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ВнешняяОбработкаПлан.ТекстЗапросаЗаполненияТаблицРЦ();
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	МассивВыбранныхРЦ = ОтображениеРЦ.РабочиеЦентры.ВыгрузитьКолонку("РабочийЦентр");
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивВыбранныхРЦ, Справочники.РабочиеЦентры.ПустаяСсылка());
	
	Условие = 	"ПооперационноеРасписание2_2.РабочийЦентр В(&МассивВыбранныхРЦ)
	|	И ПооперационноеРасписание2_2.Выполнено = 0
	|	И НЕ ПооперационноеРасписание2_2.Моделирование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	Запрос.УстановитьПараметр("СлужебнаяТекущийДень", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("МассивВыбранныхРЦ", МассивВыбранныхРЦ);
	Запрос.УстановитьПараметр("ВидЭтаповПланирования", ОтображениеРЦ.ВидЭтаповПланирования);
	
	// Получим все данные (без проверки прав) по выбранным в отображении РЦ
	ТЗДанныхИзРегистра = Запрос.Выполнить().Выгрузить();
	
	// Получим массив доступных заказов
	МассивВсехЗаказов = ТЗДанныхИзРегистра.ВыгрузитьКолонку("Заказ");
	МассивВсехЗаказов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВсехЗаказов);
	МассивДоступныхЗаказов = Новый Массив;
	Если ТипПрав = "ВидитТолькоСвоиЗаказы" Тогда
		МассивДоступныхЗаказов = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов, Пользователь);
	ИначеЕсли ТипПрав = "ВидитВсеЗаказыПоПлощадке" Тогда
		МассивДоступныхЗаказов = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов,, МассивПлощадок);
	ИначеЕсли ТипПрав = "ВидитВсеЗаказыПоПлощадкеИСвоиЗаказы" Тогда
		МассивДоступныхЗаказов = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов,, МассивПлощадок);
		МассивДоступныхЗаказовСвои = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов, Пользователь);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДоступныхЗаказов, МассивДоступныхЗаказовСвои, Истина);		
	КонецЕсли;
	
	// Обработаем полученный запрос: приведем все к стандартным типам, уберем данные по недоступным заказам
	ТЗКопияПриведенная = ТЗДанныхИзРегистра.Скопировать(Новый Структура());
	ТЗКопияПриведенная.Колонки.Добавить("ДоступнаКОтображению", Новый ОписаниеТипов("Булево"));
	ТЗКопияПриведенная.Колонки.Добавить("ПорядокРЦ", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(4, 0)));
	ТЗКопияПриведенная.Колонки.Добавить("_uniq_id", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	
	Лико_HTTP_Сервер.ПриведениеТЗКСтандартнымТипам(ТЗКопияПриведенная);
	
	Для каждого Строка из ТЗДанныхИзРегистра Цикл
		
		НоваяСтрока = ТЗКопияПриведенная.Добавить();
		НоваяСтрока.ПорядокРЦ = МассивВыбранныхРЦ.Найти(Строка.РабочийЦентр);
		НоваяСтрока._uniq_id = Новый УникальныйИдентификатор;
		
		Если ТипПрав <> "ВидитВсе" И МассивДоступныхЗаказов.Найти(Строка.Заказ) = Неопределено Тогда
			// Строка недоступна для пользователя
			НоваяСтрока.ДоступнаКОтображению = Ложь;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Начало,Окончание,ВремяПлан,ДобавленоСекунд,РабочийЦентр,Площадка");
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.ДоступнаКОтображению = Истина;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ТЗКопияПриведенная.Сортировать("ПорядокРЦ,Начало");
	
	Возврат HttpВернутьТзКакJSON(ТЗКопияПриведенная);
	
КонецФункции

Функция TableWorkCenters(ПараметрыPOST)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	КонецЕсли;
	// Проверим доступ к сайту
	ДоступКСайту = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "Лико_ДоступКСайту", Ложь);
	Если НЕ ДоступКСайту Тогда
		Возврат HttpВернутьОшибку(424, "В 1С для вашего пользователя не разрешен доступ к сайту");
	КонецЕсли;
	// Найдем настройку отображения РЦ
	ОтображениеРЦ = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "ОтображениеРабочихЦентров_3aa9d025140f45bc8a59ec155d871714");
	Если НЕ ЗначениеЗаполнено(ОтображениеРЦ) Тогда
		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заполена настройка отображения РЦ");
	КонецЕсли;
	
	//МассивВыбранныхРЦ = ОтображениеРЦ.РабочиеЦентры.ВыгрузитьКолонку("РабочийЦентр");
	//ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивВыбранныхРЦ, Справочники.РабочиеЦентры.ПустаяСсылка());
	
	// Сформируем ТЗ с машинами
	ТаблицаМашин = Новый ТаблицаЗначений;
	ТаблицаМашин.Колонки.Добавить("РабочийЦентр", Новый ОписаниеТипов("Строка"));
	ТаблицаМашин.Колонки.Добавить("Площадка", Новый ОписаниеТипов("Строка"));
	Для каждого Строка из ОтображениеРЦ.РабочиеЦентры Цикл
		НоваяСтрока = ТаблицаМашин.Добавить();
		НоваяСтрока.РабочийЦентр = Строка.РабочийЦентр;
		НоваяСтрока.Площадка = Строка.РабочийЦентр.Лико_Площадка;
	КонецЦикла;		
	
	Возврат HttpВернутьТзКакJSON(ТаблицаМашин);
	
КонецФункции

Функция SalesManagersMonth(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;

	
	//Если Пользователь.Лико_Площадки.Количество() <3  Тогда
	//	Если  SiteInn="" ИЛИ SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН Тогда 
	//		SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН;
	//	Иначе  SiteInn= "20202020";
	//	КонецЕсли;
	//КонецЕсли; 
	
	Если Пользователь.Лико_Площадки.Количество() <3  Тогда
		Если Лико_Площадка="" Или  Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка Тогда 
			Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка;			
		Иначе  Лико_Площадка= "20202020";					
		КонецЕсли;
	КонецЕсли;

	
	
 	
	#Область    ПродажиМенеджеровПоМесяцам
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВТПродажиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
	|					ИНАЧЕ АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
	|				КОНЕЦ
	|				И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|				И АналитикаУчетаПоПартнерам.Договор.Лико_Площадка В
	|					(ВЫБРАТЬ
	|						ПользователиЛико_Площадки.Площадка КАК Площадка
	|					ИЗ
	|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|					ГДЕ
	|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|				И ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА ВыручкаИСебестоимостьПродажОбороты.Период < ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0)
	|				ТОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = "" Ликофлекс""
	|						ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Менеджер.Недействителен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)),
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоВозврат,
	|	ВТПродажиПоЗаказу.Количество КАК Количество
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|			И ВТПродажиПоЗаказу.Заказ = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|			И ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ВозвратТоваровОтКлиента) ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ИЛИ ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.КорректировкаРеализации) ССЫЛКА Документ.КорректировкаРеализации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Заказ,
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТВозвраты.Регистратор КАК Регистратор,
	|	ВТВозвраты.Заказ КАК Заказ,
	|	(ВТВозвраты.Количество + ВТВозвраты.КоличествоВозврат) / ВТВозвраты.Количество КАК КоэффициентВозврата
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	ВТВозвраты КАК ВТВозвраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродаже,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеБезНДС
	|ПОМЕСТИТЬ ВТПродажи
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|ГДЕ
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа <> 0
	|	И НЕ ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток, 0)) КАК ОстатокРасчетов
	|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки КАК РасчетыСКлиентамиПоСрокамОстатки
	|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ДолгУпр, 0)) КАК Оплата
	|ПОМЕСТИТЬ ВТОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО (ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент)
	|			И (РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)))
	|			И (РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) КАК Остаток,
	|	СУММА(ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0)) КАК Выручка
	|ПОМЕСТИТЬ ВТРасчеты
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	|		ПО ВТПродажи.Регистратор = ВТОплаты.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
	|		ПО ВТПродажи.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0),
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0),
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Период КАК Период,
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиЗаказа,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиБезНДСЗаказа,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Договор.Менеджер КАК Менеджер,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказа
	|ПОМЕСТИТЬ ВТКоэффициенты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВТПродажи.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Возвраты
	|		ПО ВТПродажиПоЗаказу.Регистратор = Возвраты.Регистратор
	|			И ВТПродажиПоЗаказу.Заказ = Возвраты.Заказ
	|ГДЕ
	|	ВТПродажи.ВыручкаПоПродаже <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТКоэффициенты.Период КАК Период,
	|	ВТРасчеты.Регистратор КАК Регистратор,
	|	ВТКоэффициенты.Заказ КАК Заказ,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиЗаказа КАК ЧИСЛО(15, 2))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиБезНДСЗаказа КАК ЧИСЛО(15, 2))) КАК ВыручкаБезНДС,
	|	СУММА(ВТКоэффициенты.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТКоэффициенты.Менеджер КАК Менеджер
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТРасчеты КАК ВТРасчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициенты КАК ВТКоэффициенты
	|		ПО ВТРасчеты.Регистратор = ВТКоэффициенты.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКоэффициенты.Заказ,
	|	ВТРасчеты.Регистратор,
	|	ВТКоэффициенты.Период,
	|	ВТКоэффициенты.Менеджер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Менеджер
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
	|				И АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка В
	|					(ВЫБРАТЬ
	|						ПользователиЛико_Площадки.Площадка КАК Площадка
	|					ИЗ
	|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|					ГДЕ
	|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры ЕСТЬ NULL
	|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Менеджер.Лико_Регион = ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|	И НЕ СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Менеджер.Недействителен
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваровОбороты.Период, МЕСЯЦ),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанные.Период КАК Период,
	|	ВТДанные.Менеджер.Лико_Регион КАК Регион,
	|	ВТДанные.Менеджер КАК Менеджер,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.Выручка КАК ЧИСЛО(15, 0))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Себестоимость,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК СебестоимостьПлан,
	|	СУММА((ВЫРАЗИТЬ(0.87 * ВТДанные.Выручка КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК ДоходПлан,
	|	СУММА((ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК Доход,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанные.Регистратор) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_СебестоимостьЗаказов.Обороты(, , Регистратор, ) КАК Лико_СебестоимостьЗаказовОбороты
	|		ПО ВТДанные.Регистратор = Лико_СебестоимостьЗаказовОбороты.Регистратор
	|			И ВТДанные.Заказ = Лико_СебестоимостьЗаказовОбороты.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.Менеджер,
	|	ВТДанные.Менеджер.Лико_Регион,
	|	ВТДанные.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Менеджер КАК Менеджер,
	|	НАЧАЛОПЕРИОДА(ЗаказКлиента.ДатаОтправкиВРаботу, МЕСЯЦ) КАК Месяц,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КоличествоЗаказов
	|ПОМЕСТИТЬ ВТКоличествоЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.ДатаОтправкиВРаботу МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗаказКлиента.Состояние В (ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Менеджер,
	|	НАЧАЛОПЕРИОДА(ЗаказКлиента.ДатаОтправкиВРаботу, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Период КАК Period,
	|	ЕСТЬNULL(ВТ.Регион.Наименование, """") КАК Region,
	|	ЕСТЬNULL(ВТ.Менеджер.Наименование, """") КАК Manager,
	|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
	|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
	|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
	|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.ВыручкаБезНДС > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.Доход / ВТ.ВыручкаБезНДС КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfit,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТ.Выручка > 0
	|				ТОГДА ВЫРАЗИТЬ(100 * ВТ.ДоходПлан / ВТ.Выручка КАК ЧИСЛО(15, 1))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfitPlan,
	|	ЕСТЬNULL(ВТКоличествоЗаказов.КоличествоЗаказов, 0) КАК OrdersQt,
	|	ЕСТЬNULL(ВТ.КоличествоДокументов, 0) КАК DocsQt
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоЗаказов КАК ВТКоличествоЗаказов
	|		ПО ВТ.Менеджер = ВТКоличествоЗаказов.Менеджер
	|			И ВТ.Период = ВТКоличествоЗаказов.Месяц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ";
	
	
	#КонецОбласти
	
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn); 
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	//Возврат HttpВернутьТзКакJSON(Тз);
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON( Тз));
	
КонецФункции

Функция SalesManagers(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, UserOS, Manager ");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;
	
	//Если Пользователь.Лико_Площадки.Количество() <3  Тогда
	//	Если  SiteInn="" ИЛИ SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН Тогда 
	//		SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН;
	//	Иначе  SiteInn= "20202020";
	//	КонецЕсли;
	//КонецЕсли; 
	
	
	Если Пользователь.Лико_Площадки.Количество() <3  Тогда
		Если Лико_Площадка="" Или  Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка Тогда 
			Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка;			
		Иначе  Лико_Площадка= "20202020";					
		КонецЕсли;
	КонецЕсли; 
	
	
	Manager = ПараметрыPOST.Manager;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер КАК Менеджер,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ПОМЕСТИТЬ ВТПродажиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Организация.ИНН = &SiteInn 
	|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
	|					ИНАЧЕ АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
	|				КОНЕЦ
	|				И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|				И АналитикаУчетаПоПартнерам.Договор.Лико_Площадка В
	|					(ВЫБРАТЬ
	|						ПользователиЛико_Площадки.Площадка КАК Площадка
	|					ИЗ
	|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|					ГДЕ
	|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|				И Менеджер.Наименование = &Manager) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА ВыручкаИСебестоимостьПродажОбороты.Период < ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0)
	|				ТОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = "" Ликофлекс""
	|						ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)),
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
	|	ВыручкаИСебестоимостьПродажОбороты.Менеджер,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродаже,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеБезНДС
	|ПОМЕСТИТЬ ВТПродажи
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|ГДЕ
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа <> 0
	|	И НЕ ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ПредоплатаУпр, 0)) КАК Предоплата
	|ПОМЕСТИТЬ ВТРасчетныеДокументы
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоДокументам.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор,
	|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
	|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЕСТЬNULL(РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток, 0) КАК ОстатокРасчетов
	|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
	|ИЗ
	|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки({(&ТекущаяДата)}, ) КАК РасчетыСКлиентамиПоДокументамОстатки
	|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументамОстатки.РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
	|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ДолгУпр, 0)) КАК Оплата
	|ПОМЕСТИТЬ ВТОплаты
	|ИЗ
	|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|			И (РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности)
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности))
	|			И (РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасчетныеДокументы.Регистратор,
	|	ВТРасчетныеДокументы.РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
	|	ВТРасчетныеДокументы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоДокументам.ДолгУпр, 0)) КАК Возврат
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ПО ВТРасчетныеДокументы.РасчетныйДокумент = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|			И (РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровотКлиента))
	|			И (РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасчетныеДокументы.Регистратор,
	|	ВТРасчетныеДокументы.РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРасчетныеДокументы.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(ВТРасчетныеДокументы.Предоплата, 0) КАК Предоплата,
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) КАК Остаток,
	|	СУММА(ЕСТЬNULL(ВТРасчетныеДокументы.Предоплата, 0) + ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0) + ЕСТЬNULL(ВТВозвраты.Возврат, 0)) КАК Выручка,
	|	ЕСТЬNULL(ВТВозвраты.Возврат, 0) КАК Возврат
	|ПОМЕСТИТЬ ВТРасчеты
	|ИЗ
	|	ВТРасчетныеДокументы КАК ВТРасчетныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	|		ПО ВТРасчетныеДокументы.Регистратор = ВТОплаты.Регистратор
	|			И ВТРасчетныеДокументы.РасчетныйДокумент = ВТОплаты.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
	|		ПО ВТРасчетныеДокументы.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
	|			И ВТРасчетныеДокументы.РасчетныйДокумент = ПродажиСОстаткамиРасчетов.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВозвраты КАК ВТВозвраты
	|		ПО ВТРасчетныеДокументы.Регистратор = ВТВозвраты.Регистратор
	|			И ВТРасчетныеДокументы.РасчетныйДокумент = ВТВозвраты.РасчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасчетныеДокументы.Регистратор,
	|	ЕСТЬNULL(ВТРасчетныеДокументы.Предоплата, 0),
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0),
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0),
	|	ЕСТЬNULL(ВТВозвраты.Возврат, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Период КАК Период,
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа / ВТПродажи.ВыручкаПоПродаже КАК КоэффициентПродажиЗаказа,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС / ВТПродажи.ВыручкаПоПродаже КАК КоэффициентПродажиБезНДСЗаказа,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа КАК ВыручкаПоПродажеЗаказа,
	|	ВТПродажиПоЗаказу.Менеджер КАК Менеджер,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТКоэффициенты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВТПродажи.Регистратор
	|ГДЕ
	|	ВТПродажи.ВыручкаПоПродаже <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРасчеты.Регистратор КАК Регистратор,
	|	ВТКоэффициенты.Заказ КАК Заказ,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиЗаказа КАК ЧИСЛО(15, 2))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиБезНДСЗаказа КАК ЧИСЛО(15, 2))) КАК ВыручкаБезНДС,
	|	СУММА(ВТКоэффициенты.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТКоэффициенты.Менеджер КАК Менеджер,
	|	ВТКоэффициенты.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТРасчеты КАК ВТРасчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициенты КАК ВТКоэффициенты
	|		ПО ВТРасчеты.Регистратор = ВТКоэффициенты.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКоэффициенты.Заказ,
	|	ВТРасчеты.Регистратор,
	|	ВТКоэффициенты.Менеджер,
	|	ВТКоэффициенты.Партнер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Заказ,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа),
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС),
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС),
	|	ВТПродажиПоЗаказу.Менеджер,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|ГДЕ
	|	(ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ИЛИ ВТПродажиПоЗаказу.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Заказ,
	|	ВТПродажиПоЗаказу.Менеджер,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Менеджер,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
	|				И АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка В
	|					(ВЫБРАТЬ
	|						ПользователиЛико_Площадки.Площадка КАК Площадка
	|					ИЗ
	|						Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|					ГДЕ
	|						ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры ЕСТЬ NULL
	|				И НЕ АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Менеджер.Наименование = &Manager) КАК СебестоимостьТоваровОбороты
	|ГДЕ
	|	СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|	И СебестоимостьТоваровОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.Регистратор,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Менеджер,
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанные.Менеджер КАК Менеджер,
	|	ВТДанные.Партнер КАК Партнер,
	|	ВТДанные.Заказ.РабочийЦентр КАК РабочийЦентр,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.Выручка КАК ЧИСЛО(15, 0))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаБезНДС,
	|	СУММА((ВЫРАЗИТЬ(0.87 * ВТДанные.Выручка КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК ДоходПлан,
	|	СУММА((ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК Доход,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанные.Регистратор) КАК КоличествоДокументов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанные.Заказ) КАК КоличествоЗаказов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_СебестоимостьЗаказов.Обороты(, , Регистратор, ) КАК Лико_СебестоимостьЗаказовОбороты
	|		ПО ВТДанные.Регистратор = Лико_СебестоимостьЗаказовОбороты.Регистратор
	|			И ВТДанные.Заказ = Лико_СебестоимостьЗаказовОбороты.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.Менеджер,
	|	ВТДанные.Партнер,
	|	ВТДанные.Заказ.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ.Менеджер.Наименование, """") КАК Manager,
	|	ЕСТЬNULL(ВТ.Партнер.Код, """") КАК PartnerCode,
	|	ЕСТЬNULL(ВТ.Партнер.Наименование, """") КАК PartnerName,
	|	ЕСТЬNULL(ВТ.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
	|	ЕСТЬNULL(ВТ.РабочийЦентр.Наименование, """") КАК WorkCenterName,
	|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
	|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
	|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
	|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
	|	ВТ.КоличествоДокументов КАК DocsQt,
	|	ВТ.КоличествоЗаказов КАК OrdersQt
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Выручка > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ";
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);  
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
	Запрос.УстановитьПараметр("Manager", Manager);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
	
КонецФункции


Функция SalesStatistics(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, SiteInn ");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
		
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;

	
	#Область Статистика
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК ВыручкаПоПродажеЗаказа,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот * ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ПлощадьЧислитель КАК ЧИСЛО(15, 0))) КАК Площадь
	|ПОМЕСТИТЬ ВТПродажиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Организация.ИНН = &SiteInn 
	|					ИНАЧЕ АналитикаУчетаПоПартнерам.Договор.Лико_Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ТОГДА АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета.Наименование = ""90 услуги прочее""
	|					ИНАЧЕ АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
	|				КОНЕЦ
	|				И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|				И ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация"")
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА ВыручкаИСебестоимостьПродажОбороты.Период < ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0)
	|				ТОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = "" Ликофлекс""
	|						ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.ХозяйственнаяОперация,
	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)),
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам,
	|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|			ТОГДА ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоВозврат,
	|	ВТПродажиПоЗаказу.Количество КАК Количество
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента
	|			И ВТПродажиПоЗаказу.Заказ = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|			И ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	(ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ВозвратТоваровОтКлиента) ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ИЛИ ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.КорректировкаРеализации) ССЫЛКА Документ.КорректировкаРеализации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Заказ,
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТВозвраты.Регистратор КАК Регистратор,
	|	ВТВозвраты.Заказ КАК Заказ,
	|	(ВТВозвраты.Количество + ВТВозвраты.КоличествоВозврат) / ВТВозвраты.Количество КАК КоэффициентВозврата
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	ВТВозвраты КАК ВТВозвраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа) КАК ВыручкаПоПродаже,
	|	СУММА(ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеБезНДС
	|ПОМЕСТИТЬ ВТПродажи
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|ГДЕ
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа <> 0
	|	И НЕ ВТПродажиПоЗаказу.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажиПоЗаказу.Регистратор,
	|	ВТПродажиПоЗаказу.ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток, 0)) КАК ОстатокРасчетов
	|ПОМЕСТИТЬ ПродажиСОстаткамиРасчетов
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки КАК РасчетыСКлиентамиПоСрокамОстатки
	|		ПО ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокам.ДолгУпр, 0)) КАК Оплата
	|ПОМЕСТИТЬ ВТОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО (ВТПродажи.Регистратор = РасчетыСКлиентамиПоСрокам.РасчетныйДокумент)
	|			И (РасчетыСКлиентамиПоСрокам.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимоЗачетЗадолженности), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)))
	|			И (РасчетыСКлиентамиПоСрокам.ДолгУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажи.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) КАК Остаток,
	|	СУММА(ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0) + ЕСТЬNULL(ВТОплаты.Оплата, 0)) КАК Выручка
	|ПОМЕСТИТЬ ВТРасчеты
	|ИЗ
	|	ВТПродажи КАК ВТПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	|		ПО ВТПродажи.Регистратор = ВТОплаты.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиСОстаткамиРасчетов КАК ПродажиСОстаткамиРасчетов
	|		ПО ВТПродажи.Регистратор = ПродажиСОстаткамиРасчетов.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ПродажиСОстаткамиРасчетов.ОстатокРасчетов, 0),
	|	ЕСТЬNULL(ВТОплаты.Оплата, 0),
	|	ВТПродажи.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПродажиПоЗаказу.Период КАК Период,
	|	ВТПродажиПоЗаказу.Регистратор КАК Регистратор,
	|	ВТПродажиПоЗаказу.Заказ КАК Заказ,
	|	ВТПродажиПоЗаказу.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиЗаказа,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС / ВТПродажи.ВыручкаПоПродаже * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК КоэффициентПродажиБезНДСЗаказа,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказаБезНДС * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТПродажиПоЗаказу.ВыручкаПоПродажеЗаказа * ЕСТЬNULL(Возвраты.КоэффициентВозврата, 1) КАК ВыручкаПоПродажеЗаказа,
	|	ВТПродажиПоЗаказу.Площадь КАК Площадь
	|ПОМЕСТИТЬ ВТКоэффициенты
	|ИЗ
	|	ВТПродажиПоЗаказу КАК ВТПродажиПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПродажи КАК ВТПродажи
	|		ПО ВТПродажиПоЗаказу.Регистратор = ВТПродажи.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Возвраты
	|		ПО ВТПродажиПоЗаказу.Регистратор = Возвраты.Регистратор
	|			И ВТПродажиПоЗаказу.Заказ = Возвраты.Заказ
	|ГДЕ
	|	ВТПродажи.ВыручкаПоПродаже <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТКоэффициенты.Период КАК Период,
	|	ВТРасчеты.Регистратор КАК Регистратор,
	|	ВТКоэффициенты.Заказ КАК Заказ,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиЗаказа КАК ЧИСЛО(15, 2))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТРасчеты.Выручка * ВТКоэффициенты.КоэффициентПродажиБезНДСЗаказа КАК ЧИСЛО(15, 2))) КАК ВыручкаБезНДС,
	|	СУММА(ВТКоэффициенты.ВыручкаПоПродажеЗаказаБезНДС) КАК ВыручкаПоПродажеЗаказаБезНДС,
	|	ВТКоэффициенты.Партнер КАК Партнер,
	|	ВТКоэффициенты.Площадь КАК Площадь
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТРасчеты КАК ВТРасчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициенты КАК ВТКоэффициенты
	|		ПО ВТРасчеты.Регистратор = ВТКоэффициенты.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКоэффициенты.Заказ,
	|	ВТРасчеты.Регистратор,
	|	ВТКоэффициенты.Период,
	|	ВТКоэффициенты.Партнер,
	|	ВТКоэффициенты.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанные.Период КАК Период,
	|	ВТДанные.Партнер КАК Партнер,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.Выручка КАК ЧИСЛО(15, 0))) КАК Выручка,
	|	СУММА(ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) КАК ВыручкаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК Себестоимость,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0))) КАК СебестоимостьПлан,
	|	СУММА((ВЫРАЗИТЬ(0.87 * ВТДанные.Выручка КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаПланРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаПланОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК ДоходПлан,
	|	СУММА((ВЫРАЗИТЬ(ВТДанные.ВыручкаБезНДС КАК ЧИСЛО(15, 0))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	|					КОГДА ВТДанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА Лико_СебестоимостьЗаказовОбороты.СуммаРасход
	|					ИНАЧЕ -1 * Лико_СебестоимостьЗаказовОбороты.СуммаОборот
	|				КОНЕЦ, 0) КАК ЧИСЛО(15, 0)))) КАК Доход,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанные.Регистратор) КАК КоличествоДокументов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанные.Заказ) КАК КоличествоЗаказов,
	|	СУММА(ВТДанные.Площадь) КАК Площадь
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_СебестоимостьЗаказов.Обороты(, , Регистратор, ) КАК Лико_СебестоимостьЗаказовОбороты
	|		ПО ВТДанные.Регистратор = Лико_СебестоимостьЗаказовОбороты.Регистратор
	|			И ВТДанные.Заказ = Лико_СебестоимостьЗаказовОбороты.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.Период,
	|	ВТДанные.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Период КАК Period,
	|	ЕСТЬNULL(ВТ.Партнер.Код, """") КАК PartnerCode,
	|	ЕСТЬNULL(ВТ.Партнер.Наименование, """") КАК PartnerName,
	|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
	|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
	|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
	|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ.Доход, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.Доход, 0) / ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) * 100 КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfit,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ.ДоходПлан, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.ДоходПлан, 0) / ЕСТЬNULL(ВТ.Выручка, 0) * 100 КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfitPlan,
	|	ЕСТЬNULL(ВТ.КоличествоДокументов, 0) КАК DocsQt,
	|	ЕСТЬNULL(ВТ.КоличествоЗаказов, 0) КАК OrdersQt,
	|	ЕСТЬNULL(ВТ.Площадь, 0) КАК Square,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ.Площадь, 0) > 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.Выручка, 0) / ВТ.Площадь КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Price
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ";
	
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
	
КонецФункции



Функция ProductionStatistics(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, SiteInn ");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
		
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;
	
	
//Статистика выпуска
//ProductionStatistics 	

#Область Статистика_Выпуска
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Лико_ВыпускГПОбороты.Период, МЕСЯЦ) КАК Период,
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	Лико_ВыпускГПОбороты.Заказ.Партнер КАК Партнер,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(Лико_ВыпускГПОбороты.МетражКВМОборот) КАК МетражКВМ,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьОборот) КАК лкСебестоимость,
	|	СУММА(Лико_ВыпускГПОбороты.СебестоимостьПланОборот) КАК лкСебестоимостьПлан,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.Регистратор.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|				ТОГДА Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ВыпускГПОбороты.Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|						ТОГДА 0
	|					ИНАЧЕ Лико_ВыпускГПОбороты.СтоимостьБезНДСОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК СтоимостьБезНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ВыпускГПОбороты.Заказ) КАК КоличествоЗаказов
	|ПОМЕСТИТЬ ВТВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ Заказ.Площадка.Организация.ИНН = &SiteInn
	|					ИНАЧЕ Заказ.Площадка = &Лико_Площадка
	|				КОНЕЦ
	|				И НЕ Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Лико_ВыпускГПОбороты
	|ГДЕ
	|	Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	Лико_ВыпускГПОбороты.Заказ.Партнер,
	|	НАЧАЛОПЕРИОДА(Лико_ВыпускГПОбороты.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВыпуск.Период КАК Период,
	|	ВТВыпуск.Партнер КАК Партнер,
	|	СУММА(ЕСТЬNULL(ВТВыпуск.МетражКВМ, 0)) КАК Площадь,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплате, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ ВТВыпуск.Стоимость
	|		КОНЕЦ) КАК Выручка,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплатеБезНДС, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ ВТВыпуск.СтоимостьБезНДС
	|		КОНЕЦ) КАК ВыручкаБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.Доход, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Доход,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ДоходТабаш, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоходПлан,
	|	СУММА(ВЫБОР
	|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|						ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплате, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|					ИНАЧЕ ВТВыпуск.Стоимость
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВыручкаЗакрытыхПлан,
	|	СУММА(ВЫБОР
	|			КОГДА ВТВыпуск.Заказ.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск, 0) > 0
	|						ТОГДА ЕСТЬNULL(ВТВыпуск.Заказ.РезультатЗаказа.СтоимостьПоОплатеБезНДС, 0) * ВТВыпуск.Количество / ВТВыпуск.Заказ.РезультатЗаказа.ТиражВыпуск
	|					ИНАЧЕ ВТВыпуск.СтоимостьБезНДС
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВыручкаБезНДСЗакрытых,
	|	СУММА(ВТВыпуск.КоличествоЗаказов) КАК КоличествоЗаказов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТВыпуск КАК ВТВыпуск
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВыпуск.Период,
	|	ВТВыпуск.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Период КАК Period,
	|	ЕСТЬNULL(ВТ.Партнер.Код, """") КАК PartnerCode,
	|	ЕСТЬNULL(ВТ.Партнер.Наименование, """") КАК PartnerName,
	|	ЕСТЬNULL(ВТ.Выручка, 0) КАК Cost,
	|	ЕСТЬNULL(ВТ.ВыручкаБезНДС, 0) КАК CostNoTax,
	|	ЕСТЬNULL(ВТ.Доход, 0) КАК EstimatedGrossProfit,
	|	ЕСТЬNULL(ВТ.ДоходПлан, 0) КАК EstimatedGrossProfitPlan,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ.Доход, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.Доход, 0) / ЕСТЬNULL(ВТ.ВыручкаБезНДСЗакрытых, 0) * 100 КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfit,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ.ДоходПлан, 0) > 0
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.ДоходПлан, 0) / ЕСТЬNULL(ВТ.ВыручкаЗакрытыхПлан, 0) * 100 КАК ЧИСЛО(15, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК PercentProfitPlan,
	|	ЕСТЬNULL(ВТ.КоличествоЗаказов, 0) КАК OrdersQt,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.Площадь, 0) КАК ЧИСЛО(15, 0)) КАК Square,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ.Площадь, 0) > 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.Выручка, 0) / ВТ.Площадь КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Price
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Period,
	|	Cost УБЫВ";
	
	
#КонецОбласти
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	//Запрос.УстановитьПараметр("SiteInn", SiteInn);
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
	
КонецФункции



Функция CreateProduct030221(ПараметрыPOST)
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"PartnerCode, ArticleNumber, ProductName, ProductType, RegionCode,  UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	PartnerCode    = ПараметрыPOST.PartnerCode;
	ArticleNumber  = ПараметрыPOST.ArticleNumber;	
	ProductName    = ПараметрыPOST.ProductName;	
	ProductType    = ПараметрыPOST.ProductType;	
	RegionCode     = ПараметрыPOST.RegionCode;	
	UserOS         = ПараметрыPOST.UserOS;	
	Пользователь=ПолучитьПользователя(UserOS);
	Структура = Новый Структура;
	ТипЭтикетки=Перечисления.Лико_ТипыЭтикеток.Получить(Число(ProductType)-1);
	Партнер=Справочники.Партнеры.НайтиПоКоду(PartnerCode);
	Регион=Справочники.БизнесРегионы.НайтиПоРеквизиту("КодРегиона",RegionCode);
	Попытка
		Лико_Планирование.СоздатьНоменклатуруНаСервере(ProductName,ТипЭтикетки,Регион,Партнер,ArticleNumber,Истина);
		Структура.Вставить("result",1); 
	Исключение
		Структура.Вставить("result",0); 
	КонецПопытки;  	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);	
КонецФункции

Функция CreateProduct(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,
	"UserOS ");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("PartnerCode") Тогда 
		PartnerCode          = ПараметрыPOST.PartnerCode;
	КонецЕсли;
	
	ArticleNumber=Неопределено;
	Если ПараметрыPOST.Свойство("ArticleNumber") Тогда 
		ArticleNumber        = ПараметрыPOST.ArticleNumber;
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("ProductName") Тогда 
		
		ProductName          = ПараметрыPOST.ProductName;
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("ProductType") Тогда 
		ProductType          = ПараметрыPOST.ProductType;
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("RegionCode") Тогда
		RegionCode           = ПараметрыPOST.RegionCode;
	КонецЕсли;
	
	UserOS         		 = ПараметрыPOST.UserOS;	
	//ArticleProduct     = ПараметрыPOST.ArticleProduct;	
	
	//Если ПараметрыPOST.Свойство("TechnologyNumber") Тогда
	//	TechnologyNumber     = Число(ПараметрыPOST.TechnologyNumber);
	//Иначе
	//	TechnologyNumber     = 0;
	//КонецЕсли;
	НоменклатураDFM = Неопределено;
	
	Если ПараметрыPOST.Свойство("ProductCode") И ЗначениеЗаполнено(ПараметрыPOST.ProductCode) Тогда
		ProductCode= ПараметрыPOST.ProductCode;
		НоменклатураDFM     = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ProductCode));
	Иначе
		НоменклатураDFM     = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	
	Если ПараметрыPOST.Свойство("VersionNumber") Тогда
		Version        		= Число(ПараметрыPOST.VersionNumber);
		
	Иначе
		Version=Неопределено;
	КонецЕсли;
	
	
	//ТехнологияПечати	= Справочники.Лико_ТехнологияПечати.НайтиПоКоду(Число(TechnologyNumber));
	
	Пользователь    = ПолучитьПользователя(UserOS);
	Структура       = Новый Структура;
	Если ПараметрыPOST.Свойство("ProductType") Тогда
		
		ТипЭтикетки     = Перечисления.Лико_ТипыЭтикеток.Получить(Число(ProductType)-1);
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("PartnerCode") Тогда
		
		Партнер         = Справочники.Партнеры.НайтиПоКоду(PartnerCode);
	КонецЕсли;
	
	Если ПараметрыPOST.Свойство("RegionCode") Тогда
		
		Регион          = Справочники.БизнесРегионы.НайтиПоРеквизиту("КодРегиона",Число(RegionCode));
	КонецЕсли;
	
	
	
	
	Попытка		
		Если ЗначениеЗаполнено(НоменклатураDFM) Тогда
			СтруктураНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуру
			(Неопределено,Неопределено,Version,Неопределено,Неопределено,Неопределено,Неопределено,Истина,НоменклатураDFM,,Ложь,Документы.ЗаказКлиента.ПустаяСсылка());
		Иначе
			СтруктураНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуру
			(ProductName,ТипЭтикетки,Version,Регион,Партнер,Неопределено,Неопределено,Истина,,ArticleNumber,Ложь,Документы.ЗаказКлиента.ПустаяСсылка());	
		КонецЕсли; 		
		Структура.Вставить("result",1); 
		Структура.Вставить("ProductCode",Строка(СтруктураНоменклатуры.Номенклатура.УникальныйИдентификатор())); 
		Структура.Вставить("ProductArticle",СтруктураНоменклатуры.Артикул);
		Структура.Вставить("ProductName",СтруктураНоменклатуры.Номенклатура.Наименование);
		
		
		//Если ЗначениеЗаполнено(TechnologyNumber) ТОгда	
		//	Структура.Вставить("VersionNumber",СтруктураНоменклатуры.Версия);
		//	Структура.Вставить("TechnologyNumber",TechnologyNumber);		
		//КонецЕсли;
		
	Исключение
		
		Структура.Вставить("result",0);	
		
	КонецПопытки;  	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);	
КонецФункции

Функция ProfitabilityReport(ПараметрыPOST)
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DateStart, DateEnd, UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	DateStart 	= ПараметрыPOST.DateStart;
	DateEnd 	= ПараметрыPOST.DateEnd;
	
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;

	
	//Если Пользователь.Лико_Площадки.Количество() <3  Тогда
	//	Если  SiteInn="" ИЛИ SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН Тогда 
	//		SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН;
	//	Иначе  SiteInn= "20202020";
	//	КонецЕсли;
	//КонецЕсли; 
	
	Если Пользователь.Лико_Площадки.Количество() <3  Тогда
		Если Лико_Площадка="" Или  Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка Тогда 
			Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка;			
		Иначе  Лико_Площадка= "20202020";					
		КонецЕсли;
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.Площадка.Организация.Наименование = "" Ликофлекс""
	|			ТОГДА 1
	|		КОГДА ЗаказКлиента.Площадка.Организация.Наименование = ""ОКИЛ-САТО Икс-Пак ООО""
	|			ТОГДА 2
	|		КОГДА ЗаказКлиента.Площадка.Организация.Наименование = "" ОКИЛ-САТО Урал ООО""
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК Issue,
	|	ЗаказКлиента.Площадка.Организация.Наименование КАК OrganizationName,
	|	ЗаказКлиента.Площадка.Организация.ИНН КАК OrganizationCode,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.indigo)
	|				ИЛИ ЗаказКлиента.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Cartes)
	|				ИЛИ ЗаказКлиента.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Omega)
	|					И ЗаказКлиента.РабочийЦентр.ПорядковыйНомер <> 18
	|			ТОГДА ""2 Цифровой участок""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.ВплавляемаяЭтикетка)
	|					ТОГДА ""3 In-Mold""
	|				КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Термоусадка)
	|					ТОГДА ""4 Термоусадка""
	|				КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|					ТОГДА ""5 Полуфабрикат""
	|				ИНАЧЕ ""1 Основное пр-во""
	|			КОНЕЦ
	|	КОНЕЦ КАК Type,
	|	Лико_ПараметрыПроизводстваЗаказа.ДатаОценки КАК Date,
	|	ЗаказКлиента.Партнер.Наименование КАК Partner,
	|	ЗаказКлиента.Менеджер.Наименование КАК Manager,
	|	ЗаказКлиента.Регион.КодРегиона КАК Branch,
	|	Лико_ПараметрыПроизводстваЗаказа.Доходность КАК Profitability,
	|	Лико_ПараметрыПроизводстваЗаказа.Рентабельность КАК Efficiency,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражКвМ КАК Square,
	|	ЗаказКлиента.НомерБезПрефикса КАК Order,
	|	ЕСТЬNULL(ЗаказКлиента.РабочийЦентр.ПорядковыйНомер, 0) КАК WorkCenterNumber,
	|	ЗаказКлиента.ЦенаСредняя КАК Price,
	|	ЗаказКлиента.СуммаДокумента КАК Cost,
	|	Лико_ПараметрыПроизводстваЗаказа.Доход КАК Income,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыПроизводстваЗаказа.МетражКвМ > 0
	|			ТОГДА ВЫРАЗИТЬ(ЗаказКлиента.СуммаДокумента / Лико_ПараметрыПроизводстваЗаказа.МетражКвМ КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК PriceSqM,
	|	ЗаказКлиента.Номер КАК _order_num,
	|	ЗаказКлиента.Дата КАК _order_date,
	|	ЗаказКлиента.Этикетки КАК Labels
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ПО ЗаказКлиента.Ссылка = Лико_ПараметрыПроизводстваЗаказа.Заказ
	|			И (Лико_ПараметрыПроизводстваЗаказа.НомерПроката = 1)
	|ГДЕ
	|	ЗаказКлиента.ДатаОтправкиВРаботу МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаказКлиента.Площадка В
	|			(ВЫБРАТЬ
	|				ПользователиЛико_Площадки.Площадка КАК Площадка
	|			ИЗ
	|				Справочник.Пользователи.Лико_Площадки КАК ПользователиЛико_Площадки
	|			ГДЕ
	|				ПользователиЛико_Площадки.Ссылка = &ТекущийПользователь)
	|	И ВЫБОР
	|			КОГДА ЗаказКлиента.Площадка.Организация.ИНН = ""7817314085""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиента.ТипЗаказа <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|		КОНЕЦ
	|	И НЕ ЗаказКлиента.ВидЗаказа В (ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ЦифроваяПроба), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Оснастка), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Техобслуживание), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ТестированиеМатериалов), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПричинаРекламация))
	|	И ЗаказКлиента.Партнер.Код <> ""00-00000006""
	|	И ВЫБОР
	|			КОГДА &Лико_Площадка = """"
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиента.Площадка = &Лико_Площадка
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Issue,
	|	Type,
	|	Profitability УБЫВ"  ;
	
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата(DateStart)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(DateEnd)));
	Запрос.УстановитьПараметр("ТекущийПользователь",Пользователь);
	
	//Запрос.УстановитьПараметр("SiteInn", SiteInn); 
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);

	
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	
	Возврат HttpВернутьТзКакJSON(Тз);
	
КонецФункции



Функция Access(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	UserOS = ПараметрыPOST.UserOS;		
	Пользователь=ПолучитьПользователя(UserOS);
	Если Пользователь=Неопределено Тогда
		Пользователь=Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	ТЗ =ПолучитьДоступныеРазделы(Пользователь);	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции

Функция WssSC(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"KeyCollaboration,Type,Data");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	KeyCollaboration = ПараметрыPOST.keyCollaboration;
	Data             = ПараметрыPOST.Data;
	Type             = ПараметрыPOST.Type;
	
	
	Если ЗначениеЗаполнено(KeyCollaboration) Тогда
		Структура = Новый Структура;
		Структура.Вставить("FormGUID",Строка( Новый УникальныйИдентификатор));
		Структура.Вставить("WebSocketUUID",KeyCollaboration);
		//Структура.Вставить("ScanData",ПараметрыPOST.Data);
		Контент = Новый Структура;
		Контент.Вставить(Type,ПараметрыPOST.Data);
		
		WebSocketСервер.ОтправитьСообщение(Структура,Контент);
		
	КонецЕсли;
	//Обсуждение       = СистемаВзаимодействия.ПолучитьОбсуждение(KeyCollaboration);
	////СистемаВзаимодействия.ПолучитьОбсуждения(Новый ОтборОбсужденийСистемыВзаимодействия)
	//Сообщение        = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
	//
	//Сообщение.Данные = Data;			
	//Сообщение.Записать();
	Попытка
		
		
		
		ШтрихКод=Data.ШтрихКод;
		СтруктураШК=Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(ШтрихКод); 
		
		info="";
		data=Новый Структура;
		Если СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий Тогда 
			ОбъектНоменклатуры=СтруктураШК.ОбъектНоменклатуры ;
			ЦеновойКод=СокрЛП(ОбъектНоменклатуры.Номенклатура.ЦеноваяГруппа.Код);
			КодНоменклатуры=СокрЛП(ОбъектНоменклатуры.Номенклатура.Код);
			СтруктураОН = Новый Структура;
			СтруктураОН.Вставить("Код"	             , ОбъектНоменклатуры.Код); 
			СтруктураОН.Вставить("ЦеновойКод"	     ,ЦеновойКод); 
			СтруктураОН.Вставить("КодНоменклатуры"	 ,КодНоменклатуры); 
			СтруктураОН.Вставить("Нарезка"	 ,ОбъектНоменклатуры.Нарезка.Размер);
			
			
			
			СтруктураОН.Вставить("ОбъектНоменклатуры"	 , СтрШаблон("(%1)%2",ЦеновойКод,ОбъектНоменклатуры.Наименование));
			СтруктураОН.Вставить("ШтрихКод"	             ,ШтрихКод);
			
			СтруктураОН.Вставить("Количество"     ,	ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);  
			СтруктураОН.Вставить("Уникальный"     , ОбъектНоменклатуры.НомерПоставки);
			СтруктураОН.Вставить("Guid"     , Строка(ОбъектНоменклатуры.УникальныйИдентификатор()));
			
			
			Если  ПараметрыPOST.Свойство("WPID") И ЗначениеЗаполнено( ПараметрыPOST.WPID) Тогда
				TPID = ПараметрыPOST.WPID;
				РабочееМесто=Справочники.Лико_РабочиеМеста.НайтиПоКоду(TPID);				
				МассивАдресХранения = Лико_ОбщегоНазначенияСервер.ПолучитьКоличествоПоАдресамХраненияСерииМассив(ОбъектНоменклатуры.Серия,,РабочееМесто.СкладСИМ);
				
				ит=0;
				Для каждого АдресХранения Из МассивАдресХранения Цикл
					Структура = Новый Структура;
					Структура.Вставить("Guid",Строка(АдресХранения.Ячейка.УникальныйИдентификатор())); 
					Структура.Вставить("Name",Строка(АдресХранения.Ячейка.Код)); 
					Структура.Вставить("Количество",АдресХранения.Количество);
					
					
					МассивАдресХранения[ит]= Структура;
					
					ит=ит+1;
				КонецЦикла;
				
				СтруктураОН.Вставить("АдресХранения", МассивАдресХранения);
				
			КонецЕсли;
			
			info=Строка(СтруктураОН.ОбъектНоменклатуры);
			data.Вставить("ОбъектНоменклатуры",СтруктураОН);
		ИначеЕсли  СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_Сотрудника Тогда
			info=Строка(СтруктураШК.Сотрудник);
			data.Вставить("Сотрудник",info);
			data.Вставить("ШтрихКод",ШтрихКод);
			data.Вставить("ТабельныйНомер",Формат(Число(СтруктураШК.КодИнформации), "ЧГ=0")); 
			data.Вставить("Guid"     , Строка(СтруктураШК.Сотрудник.УникальныйИдентификатор()));
			
			
		ИначеЕсли  СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_Заказа Тогда
			info=Строка("Заказ №: "+СтруктураШК.НомерЗаказа); 
			data.Вставить("Заказ",СтруктураШК.НомерЗаказа);
			data.Вставить("pmc",НайтиФормулыПантоновПозаказу(СтруктураШК.НомерЗаказа));
			data.Вставить("ШтрихКод",ШтрихКод);
			data.Вставить("Guid"     , Строка(СтруктураШК.УникальныйИдентификатор()));
			
			
			
		ИначеЕсли СтруктураШК.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Конверта") Тогда
			
			Конверт= СтруктураШК.Конверт;
			data.Вставить("Конверт",Строка(Конверт));
			data.Вставить("ШтрихКод",ШтрихКод);
			data.Вставить("Guid"     , Строка(Конверт.УникальныйИдентификатор()));
			
			
		ИначеЕсли СтруктураШК.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
			
			info=Строка(СтруктураШК.РабочийЦентр);
			data.Вставить("РабочийЦентр",info); 
			data.Вставить("ШтрихКод",ШтрихКод);
			data.Вставить("Guid"     , Строка(СтруктураШК.РабочийЦентр.УникальныйИдентификатор()));
			
			
			
		ИначеЕсли СтруктураШК.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ СтруктураШК.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//Это ячейка
			info=Строка(СтруктураШК.АдресаХранения);
			data.Вставить("Адрес",info); 
			data.Вставить("ШтрихКод",ШтрихКод); 
			data.Вставить("Guid"     , Строка(СтруктураШК.АдресаХранения.УникальныйИдентификатор()));
			
		КонецЕсли;
	Исключение
		info="";
		data=Новый Структура;
		
	КонецПопытки;
	
	Структура = Новый Структура;
	Структура.Вставить("ready", Истина);
	Структура.Вставить("info", info);
	Структура.Вставить("data", Data);
	
	
	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
	
КонецФункции

Функция WssSСRequest(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"KeyCollaboration,FormGUID,Type,Data");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	KeyCollaboration = ПараметрыPOST.keyCollaboration;
	Data             = ПараметрыPOST.Data;
	FormGUID         = ПараметрыPOST.FormGUID;
	Type             = ПараметрыPOST.Type;
	
	
	
	Если ЗначениеЗаполнено(KeyCollaboration) Тогда
		Структура = Новый Структура;
		Структура.Вставить("FormGUID",FormGUID);
		Структура.Вставить("WebSocketUUID",KeyCollaboration);
		Контент = Новый Структура;
		Контент.Вставить(Type,ПараметрыPOST.Data);
		
		WebSocketСервер.ОтправитьСообщение(Структура,Контент);
		
	КонецЕсли;
	Структура = Новый Структура;
	Структура.Вставить("ready", Истина); 	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);	
КонецФункции


Функция WssSСMobyleClient(ПараметрыPOST)
	УстановитьПривилегированныйРежим(истина);
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"KeyCollaboration,Data");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	KeyCollaboration = ПараметрыPOST.keyCollaboration;
	Data             = ПараметрыPOST.Data;
	
	
	FormGUID=Строка( Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(KeyCollaboration) Тогда
		Структура = Новый Структура;
		Структура.Вставить("FormGUID",FormGUID);
		Структура.Вставить("WebSocketUUID",KeyCollaboration);
		Контент = Новый Структура;
		Контент.Вставить("WSMobyleClient",ПараметрыPOST.Data);
		
		WebSocketСервер.ОтправитьСообщение(Структура,Контент);
		
	КонецЕсли;
	ДатаКонтроля=ТекущаяДата()+10;
	Структура = Новый Структура;
	
	Пока ДатаКонтроля> ТекущаяДата() Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лико_WSСообщения.Данные КАК Данные
		|ИЗ
		|	РегистрСведений.Лико_WSСообщения КАК Лико_WSСообщения
		|ГДЕ
		|	Лико_WSСообщения.Гуид = &Гуид";
		Запрос.УстановитьПараметр("Гуид",FormGUID);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Структура=Выборка.Данные.Получить();
			Прервать;
		КонецЦикла; 
		Если Не РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.Лико_WSСообщения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Гуид.Установить(FormGUID);
	НаборЗаписей.Записать(Истина);
	
	
	Ответ = Новый Структура;
	Ответ.Вставить("data", Структура); 	
	Возврат HttpВернутьСтруктуруКакJSON(Ответ);	
КонецФункции





Функция WssZakazMaterialClose(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"KeyCollaboration,Data");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	KeyCollaboration = ПараметрыPOST.keyCollaboration;
	Data             = ПараметрыPOST.Data;
	РабочееМесто     = Справочники.Лико_РабочиеМеста.НайтиПоНаименованию(Data.РабочееМесто);
	Структура        = Новый Структура;
	РабочийЦентр     = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",Data.НомерРЦ);
	Сотрудник        = Справочники.ФизическиеЛица.НайтиПоКоду(Data.СотрудникКод);
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Сотрудник        = РабочееМесто.СотрудникПоF2;
	КонецЕсли;
	Пользователь     = РабочееМесто.Пользователь;
	Структура.Вставить("АвторДокумента",Сотрудник);
	Структура.Вставить("Сотрудник",ПолучитьСотрудникаПоФизЛицуСервер(Сотрудник));
	Структура.Вставить("НомерБланка",Data.НомерБланка);
	Структура.Вставить("НомерПроката",Data.НомерПроката);
	Структура.Вставить("РабочийЦентр",РабочийЦентр);
	Структура.Вставить("РабочееМесто",РабочееМесто);
	Структура.Вставить("НомерЗаказа",Число(Data.НомерЗаказа));
	Структура.Вставить("ЗаказПокупателя",Лико_Дополнительно.НайтиДокументПоНомеру7Символов(Число(Data.НомерЗаказа),"ЗаказКлиента"));
	Структура.Вставить("Склад",РабочееМесто.СкладСИМ);
	Структура.Вставить("Помещение",РабочееМесто.ПомещениеСИМ);
	Структура.Вставить("Организация",УправлениеСвойствами.ЗначениеСвойства(Пользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b"));
	Структура.Вставить("Подразделение",Пользователь.Подразделение);
	
	
	Массив = Новый Массив();
	МассивОбъектов=Новый Массив;
	Для каждого ОН Из Data.ОбъектыНоменклатуры Цикл
		СтруктураСерии = Новый Структура;
		ОбъектНоменклатуры=Справочники.ЯССМ_ОбъектыНоменклатуры.НайтиПоКоду(ОН.КодОн);
		Если ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
			МассивОбъектов.Добавить(ОбъектНоменклатуры);
		КонецЕсли;
		
		СтруктураСерии.Вставить("Серия",ОбъектНоменклатуры.Серия);
		СтруктураСерии.Вставить("Количество",Он.Количество);
		массив.Добавить(СтруктураСерии);
	КонецЦикла;
	Структура.Вставить("МассивСерий",Массив);
	
	
	
	
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("ready", ЗакрытиеОбъектовНоменклатурыВЗаказ(Структура));
	Если Ответ.ready="Выполнено успешно!" и ЗначениеЗаполнено(МассивОбъектов) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Код КАК ОбъектНоменклатуры
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия.ЯССМ_ОбъектНоменклатуры В (&МассивОбъектов)) КАК ТоварыВЯчейкахОстатки";
		Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов );
		МассивДанных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектНоменклатуры");
		Если ЗначениеЗаполнено(МассивДанных) Тогда
			Если ЗначениеЗаполнено(KeyCollaboration) Тогда
				Структура = Новый Структура;
				Структура.Вставить("FormGUID",Строка( Новый УникальныйИдентификатор));
				Структура.Вставить("WebSocketUUID",KeyCollaboration);
				//Структура.Вставить("ScanData",ПараметрыPOST.Data);
				Контент = Новый Структура;
				Контент.Вставить("PrintON",МассивДанных); 
				WebSocketСервер.ОтправитьСообщение(Структура,Контент);
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
	КонецЕсли;	
	//Структура.Вставить("info", info);
	//Структура.Вставить("data", Data);
	
	
	
	Возврат HttpВернутьСтруктуруКакJSON(Ответ);
	
	
КонецФункции


Функция WssTask(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"KeyCollaboration,Data");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	KeyCollaboration = ПараметрыPOST.keyCollaboration;
	Data             = ПараметрыPOST.Data;
	
	
	
	Если ЗначениеЗаполнено(KeyCollaboration) Тогда
		Структура = Новый Структура;
		Структура.Вставить("FormGUID",Строка( Новый УникальныйИдентификатор));
		Структура.Вставить("WebSocketUUID",KeyCollaboration);
		Контент = Новый Структура;
		Контент.Вставить("Task",ПараметрыPOST.Data);		
		WebSocketСервер.ОтправитьСообщение(Структура,Контент);
		
	КонецЕсли;
	Структура = Новый Структура;
	Структура.Вставить("ready", Истина);
	//Структура.Вставить("info", info);
	//Структура.Вставить("data", Data);
	
	
	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
	
КонецФункции


Функция CheckingAvailabilityMaterialsOrder (ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"Array,NOrder");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;  	
	Массив             = ПараметрыPOST.Array;
	Заказ              = Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",ПараметрыPOST.NOrder);
	Данные             = Лико_Дополнительно.ПроверитьВозможностьСчитыванияКраскиВЗаказМассив(Массив,Заказ);	
	
	Возврат HttpВернутьСтруктуруКакJSON(Данные); 	
КонецФункции



Функция GetProductByArticle(ПараметрыPOST) //+Лико m.shenderov 06.05.2021
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"ProductArticle,ProductType");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	ProductArticle=ПараметрыPOST.ProductArticle;
	ProductType=ПараметрыPOST.ProductType;
	Структура=ПолучитьНоменклатуруПоАртикулу(ProductArticle,ProductType);
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
КонецФункции //-Лико m.shenderov 06.05.2021 





Функция SearchClientOrder(ПараметрыPOST) //+Лико m.shenderov 06.05.2021
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"query");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	query=ПараметрыPOST.query;
	Массив=ПолучитьЗаказыПоЧастиНомера(query);
	
	Возврат HttpВернутьСтруктуруКакJSON(Массив);
	
КонецФункции //-Лико m.shenderov 06.05.2021 

Функция AttachFilesOld(ПараметрыPOST) //+Лико m.shenderov 26.10.2021
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"DocDate,DocName,DocNumber,extra,files");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	Номер=ПараметрыPOST.DocNumber;
	DocName=ПараметрыPOST.DocName;
	//Дата= ПараметрыPOST.DocDate;
	Дата= Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПараметрыPOST.DocDate,"T",""),":",""),"-",""));
	
	//Документ=Документы.Лико_ЗабраковкаМатериалов.НайтиПоНомеру(Номер,Дата);
	Документ=Документы[DocName].НайтиПоНомеру(Номер,Дата);
	
	// <-- Начало Лико Яцун С. В. 
	Если ЕстьСвойство(ПараметрыPOST, "UserNumber") Тогда
		ТабНомерСотрудника = ПараметрыPOST.UserNumber;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В.
	
	Если Документ=Неопределено Тогда
		Структура = Новый Структура;
		Структура.Вставить("error",1);
		Структура.Вставить("msg",СтрШаблон("Не найден документ %1 № %2 от %3","лк Забраковка материалов",Номер,Дата));
		
	Иначе	
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ПараметрыPOST.extra);
		wsParam=ПрочитатьJSON(ЧтениеJSON);
		uuid=wsParam.talk.uuid;
		МассивСсылок=ПараметрыPOST.files;
		ДанныеДляФайла = Новый Структура;
		
		
		Для каждого Элемент Из МассивСсылок Цикл
			
			ИмяФайла = Элемент;        
			ИмяФайлаБезРасширения = Лев(ИмяФайла,СтрНайти(ИмяФайла, ".",НаправлениеПоиска.СКонца)-1);
			РасширениеФайла = СтрЗаменить(ИмяФайла, ИмяФайлаБезРасширения + ".", "");
			ИмяФайлаБезРасширения = Прав(ИмяФайлаБезРасширения,СтрДлина(ИмяФайлаБезРасширения)-СтрНайти(ИмяФайлаБезРасширения, "/",НаправлениеПоиска.СКонца));
			
			ЗаписьЖурналаРегистрации("Загрузка2 ",,,Строка(Элемент));
			
			ДанныеДляФайла.Вставить("ИмяФайлаБезРасширения", ИмяФайлаБезРасширения);
			ДанныеДляФайла.Вставить("РасширениеФайла", РасширениеФайла);		
			ИмяВременногоФайла=ПолучитьИмяВременногоФайла(РасширениеФайла);
			КопироватьФайл(ИмяФайла,ИмяВременногоФайла);
			ДД=Новый ДвоичныеДанные(ИмяВременногоФайла);
			УдалитьФайлы(ИмяВременногоФайла);
			
			ДанныеДляФайла.Вставить("АдресДвоичныхДанныхДвоичныхДанных", ПоместитьВоВременноеХранилище(ДД));
			ДанныеДляФайла.Вставить("Документ", Документ);
			// <-- Начало Лико Яцун С. В.
			Если ЕстьСвойство(ПараметрыPOST, "UserNumber") Тогда
				ДанныеДляФайла.Вставить("ТабНомерСотрудника", ТабНомерСотрудника);
			КонецЕсли;	
			// <-- Конец Лико Яцун С. В.
			ЗаписатьФайлВЭлемент(ДанныеДляФайла);
			
		КонецЦикла;
		
		Структура = Новый Структура;
		Структура.Вставить("error",0);
		Структура.Вставить("count",МассивСсылок.Количество());
	КонецЕсли;
	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция AttachFiles(ПараметрыPOST) //+Лико m.shenderov 26.10.2021
	
	Ссылка=Неопределено;
	
	ПолучитьСсылкуДляХраненияФайлов(Ссылка,ПараметрыPOST);
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		Возврат HttpВернутьСтруктуруКакJSON(
		Новый Структура("error,msg",1,"Не найден объект для привязки файлов!"));
		
	КонецЕсли;
	
	МассивСсылок=ПараметрыPOST.files;
	
	Для каждого Элемент Из МассивСсылок Цикл
		
		ДанныеДляФайла = ДанныеДляФайла(Ссылка,Элемент,ПараметрыPOST);
		
		ЗаписатьФайлВЭлемент(ДанныеДляФайла);
		
	КонецЦикла;
	
	Возврат HttpВернутьСтруктуруКакJSON(
	Новый Структура("error,count",0,МассивСсылок.Количество()));
	
КонецФункции //-Лико m.shenderov 26.10.2021 


Процедура ПолучитьСсылкуДляХраненияФайлов(Ссылка,ПараметрыPOST) //+Лико m.shenderov 12.04.2024
	
	ПолучитьСсылкуДокументаПоНомеру(Ссылка,ПараметрыPOST);
	ПолучитьСсылкуИзШтрихКода(Ссылка,ПараметрыPOST);
	
КонецПроцедуры //-Лико m.shenderov 12.04.2024

Процедура ПолучитьСсылкуДокументаПоНомеру(Ссылка,ПараметрыPOST)

	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"DocDate,DocName,DocNumber,extra,files");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Номер     = ПараметрыPOST.DocNumber;
	DocName   = ПараметрыPOST.DocName; 
	Дата      = Дата(СтрЗаменить
	(СтрЗаменить(СтрЗаменить(ПараметрыPOST.DocDate,"T",""),":",""),"-","")); 
	
	Ссылка    = Документы[DocName].НайтиПоНомеру(Номер,Дата);
	
КонецПроцедуры

Процедура ПолучитьСсылкуИзШтрихКода(Ссылка,ПараметрыPOST)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"Barcode");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат;
	КонецЕсли;  
	
	ШтрихКод=ПараметрыPOST.Barcode;
	
	СтруктураШК=Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(ШтрихКод); 
	
	Если СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий Тогда 
		
		Ссылка=СтруктураШК.ОбъектНоменклатуры ;
		
	ИначеЕсли  СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_Сотрудника Тогда
		
		Ссылка=СтруктураШК.Сотрудник;
		
	ИначеЕсли  СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_Заказа Тогда
		
		Ссылка =Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",СтруктураШК.НомерЗаказа); 		
		
	ИначеЕсли СтруктураШК.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Конверта") Тогда
		
		Ссылка= СтруктураШК.Конверт; 	
		
	ИначеЕсли СтруктураШК.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
		
		Ссылка=СтруктураШК.РабочийЦентр;		
		
	ИначеЕсли СтруктураШК.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
		ИЛИ СтруктураШК.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
		//Это ячейка
		Ссылка=СтруктураШК.АдресаХранения;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция ДанныеДляФайла(Ссылка,Элемент,ПараметрыPOST) //+Лико m.shenderov 12.04.2024
	
			ДанныеДляФайла = Новый Структура;
			
			ИмяФайла = Элемент;        
			ИмяФайлаБезРасширения = Лев(ИмяФайла,СтрНайти(ИмяФайла, ".",НаправлениеПоиска.СКонца)-1);
			РасширениеФайла = СтрЗаменить(ИмяФайла, ИмяФайлаБезРасширения + ".", "");
			ИмяФайлаБезРасширения = Прав(ИмяФайлаБезРасширения,СтрДлина(ИмяФайлаБезРасширения)-СтрНайти(ИмяФайлаБезРасширения, "/",НаправлениеПоиска.СКонца));
			
			ЗаписьЖурналаРегистрации("Загрузка2 ",,,Строка(Элемент));
			
			ДанныеДляФайла.Вставить("ИмяФайлаБезРасширения", ИмяФайлаБезРасширения);
			ДанныеДляФайла.Вставить("РасширениеФайла", РасширениеФайла);		
			ИмяВременногоФайла=ПолучитьИмяВременногоФайла(РасширениеФайла);
			КопироватьФайл(ИмяФайла,ИмяВременногоФайла);
			ДД=Новый ДвоичныеДанные(ИмяВременногоФайла);
			УдалитьФайлы(ИмяВременногоФайла);
			
			ДанныеДляФайла.Вставить("АдресДвоичныхДанныхДвоичныхДанных", ПоместитьВоВременноеХранилище(ДД));
			ДанныеДляФайла.Вставить("Документ", Ссылка);
			// <-- Начало Лико Яцун С. В.
			Если ЕстьСвойство(ПараметрыPOST, "UserNumber") Тогда
				ДанныеДляФайла.Вставить("ТабНомерСотрудника", ПараметрыPOST.UserNumber);
			КонецЕсли;	
			// <-- Конец Лико Яцун С. В.
			
			Возврат  ДанныеДляФайла;
	
	
КонецФункции //-Лико m.shenderov 12.04.2024 




Функция QueryFree(ПараметрыPOST) //+Лико m.shenderov 26.10.2021
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST,"TextQuery,ParamsQuery");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	TextQuery=ПараметрыPOST.TextQuery;
	ParamsQuery=Новый Массив;
	Если  ПараметрыPOST.Свойство("ParamsQuery") Тогда
		ParamsQuery=ПараметрыPOST.ParamsQuery;
	КонецЕсли;
	
	
	Возврат Лико_HTTP_Сервер.QueryFree(TextQuery,ParamsQuery);
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Процедура ЗаписатьФайлВЭлемент(ДанныеДляФайла)
	
	СсылкаНаЭл = ДанныеДляФайла.Документ;
	
	Если НЕ СсылкаНаЭл = Неопределено Тогда
		ЗаписьЖурналаРегистрации("Загрузка данных",,,,СсылкаНаЭл );
		ЗаписьЖурналаРегистрации("Загрузка данных ИмяФайлаБезРасширения",,,,ДанныеДляФайла.ИмяФайлаБезРасширения);
		ЗаписьЖурналаРегистрации("Загрузка данных ИмяФайлаБезРасширения",,,,ДанныеДляФайла.АдресДвоичныхДанныхДвоичныхДанных);
		
		ПараметрыВыполнения = РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыВыполнения.Вставить("Автор", Неопределено);	
		ПараметрыВыполнения.Вставить("ВладелецФайлов", СсылкаНаЭл);
		ПараметрыВыполнения.Вставить("ИмяБезРасширения", ДанныеДляФайла.ИмяФайлаБезРасширения); 
		ПараметрыВыполнения.Вставить("РасширениеБезТочки", ДанныеДляФайла.РасширениеФайла);
		ПараметрыВыполнения.Вставить("ВремяИзмененияУниверсальное", ТекущаяДата());
		
		// --> Начало Лико Яцун 13.12.2022
		Если ТипЗнч(СсылкаНаЭл) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Если ЕстьСвойство(ДанныеДляФайла, "ТабНомерСотрудника") Тогда 
				АвторФизическоеЛицо = Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(ДанныеДляФайла.ТабНомерСотрудника, ТекущаяДата());
				ПараметрыВыполнения.Вставить("Лико_Автор", АвторФизическоеЛицо);
			Иначе
				ПараметрыВыполнения.Вставить("Лико_Автор", Неопределено);
			КонецЕсли;
			Если Найти(НРег(ДанныеДляФайла.ИмяФайлаБезРасширения),"техкарта") > 0 Тогда
				Лико_Дополнительно.УдалитьПредыдущуюВерсиюФайла(СсылкаНаЭл,ДанныеДляФайла.ИмяФайлаБезРасширения);
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Яцун 13.12.2022 
		
		РаботаСФайламиСлужебныйВызовСервера.ДобавитьФайл(ПараметрыВыполнения, ДанныеДляФайла.АдресДвоичныхДанныхДвоичныхДанных,,"Добавлено через HTTP-сервис");
		
	КонецЕсли;		
	
КонецПроцедуры

Функция PlanWorkCenters210921(ПараметрыPOST)
	
	//УстановитьПривилегированныйРежим(Истина);
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	КонецЕсли;
	// Проверим доступ к сайту
	ДоступКСайту = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "Лико_ДоступКСайту", Ложь);
	Если НЕ ДоступКСайту Тогда
		Возврат HttpВернутьОшибку(424, "В 1С для вашего пользователя не разрешен доступ к сайту");
	КонецЕсли;
	// Проверим доступ к заказам
	ТипПрав = "НеВидитНичего";
	Если Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("ПолныеПрава", Пользователь) Тогда
		ТипПрав = "ВидитВсе";
	ИначеЕсли Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке", Пользователь) И Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ЗаказыКлиентов", Пользователь) Тогда
		ТипПрав = "ВидитВсеЗаказыПоПлощадкеИСвоиЗаказы";	
	ИначеЕсли Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке", Пользователь) Тогда
		ТипПрав = "ВидитВсеЗаказыПоПлощадке";	
	ИначеЕсли Лико_ДополнительноКлиентСервер.КонкретнаяРольДоступна("Лико_ЗаказыКлиентов", Пользователь) Тогда
		ТипПрав = "ВидитТолькоСвоиЗаказы";
	КонецЕсли;
	Если ТипПрав = "НеВидитНичего" Тогда
		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя нет прав на просмотр плана");
	КонецЕсли;
	// Найдем настройку отображения РЦ
	ОтображениеРЦ = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Пользователь, "ОтображениеРабочихЦентров_3aa9d025140f45bc8a59ec155d871714");
	Если НЕ ЗначениеЗаполнено(ОтображениеРЦ) Тогда
		Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заполена настройка отображения РЦ");
	КонецЕсли;
	
	МассивПлощадок = Новый Массив;
	Если ТипПрав = "ВидитВсеЗаказыПоПлощадке" ИЛИ ТипПрав = "ВидитВсеЗаказыПоПлощадкеИСвоиЗаказы" Тогда
		// Определим доступные площадки
		МассивПлощадок = Пользователь.Лико_Площадки.ВыгрузитьКолонку("Площадка");
		//МассивПлощадок.Добавить(Пользователь.Лико_Площадка);
		МассивПлощадок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПлощадок);
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивПлощадок, Справочники.Организации.ПустаяСсылка());
		Если МассивПлощадок.Количество() = 0 Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");
		КонецЕсли;
	КонецЕсли;	
	
	// Получим текст запроса из обработки планирования
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Справочники.Лико_ПредопределенныеЗначения.ВнешняяОбработкаПланированиеРЦ.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С в справочнике предопределенных значений не найдена обработка планирования РЦ. Обратитесь к программистам");
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработкаПлан = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ВнешняяОбработкаПлан.ТекстЗапросаЗаполненияТаблицРЦ(Истина);
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	МассивВыбранныхРЦ = ОтображениеРЦ.РабочиеЦентры.ВыгрузитьКолонку("РабочийЦентр");
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивВыбранныхРЦ, Справочники.РабочиеЦентры.ПустаяСсылка());
	
	Условие = 	"ПооперационноеРасписание2_2.РабочийЦентр В(&МассивВыбранныхРЦ)
	|	И ПооперационноеРасписание2_2.Выполнено = 0
	|	И НЕ ПооперационноеРасписание2_2.Моделирование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	Запрос.УстановитьПараметр("СлужебнаяТекущийДень", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("МассивВыбранныхРЦ", МассивВыбранныхРЦ);
	Запрос.УстановитьПараметр("ВидЭтаповПланирования", ОтображениеРЦ.ВидЭтаповПланирования);
	
	// Получим все данные (без проверки прав) по выбранным в отображении РЦ
	ТЗДанныхИзРегистра = Запрос.Выполнить().Выгрузить();
	
	// Получим массив доступных заказов
	МассивВсехЗаказов = ТЗДанныхИзРегистра.ВыгрузитьКолонку("Заказ");
	МассивВсехЗаказов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВсехЗаказов);
	МассивДоступныхЗаказов = Новый Массив;
	Если ТипПрав = "ВидитТолькоСвоиЗаказы" Тогда
		МассивДоступныхЗаказов = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов, Пользователь);
	ИначеЕсли ТипПрав = "ВидитВсеЗаказыПоПлощадке" Тогда
		МассивДоступныхЗаказов = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов,, МассивПлощадок);
	ИначеЕсли ТипПрав = "ВидитВсеЗаказыПоПлощадкеИСвоиЗаказы" Тогда
		МассивДоступныхЗаказов = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов,, МассивПлощадок);
		МассивДоступныхЗаказовСвои = Лико_Дополнительно.ПолучитьМассивДоступныхЗаказовПользователя(МассивВсехЗаказов, Пользователь);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДоступныхЗаказов, МассивДоступныхЗаказовСвои, Истина);		
	КонецЕсли;
	
	// Обработаем полученный запрос: приведем все к стандартным типам, уберем данные по недоступным заказам
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТЗКопияПриведенная = ТЗДанныхИзРегистра.Скопировать(Новый Структура());
	ТЗКопияПриведенная.Колонки.Добавить("ДоступнаКОтображению", Новый ОписаниеТипов("Булево"));
	ТЗКопияПриведенная.Колонки.Добавить("ПорядокРЦ", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(4, 0)));
	ТЗКопияПриведенная.Колонки.Добавить("_uniq_id", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	МассивСтруктурКолонокКПриведению = Новый Массив;
	Для каждого Колонка из ТЗКопияПриведенная.Колонки Цикл
		Если НЕ (Колонка.ТипЗначения.СодержитТип(Тип("Строка"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Число"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Дата"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Булево"))
			)
			Тогда
			МассивСтруктурКолонокКПриведению.Добавить(Новый Структура("ИмяКолонки,Тип", Колонка.Имя, ТипСтрока));
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("NULL")) Тогда
			МассивСтруктурКолонокКПриведению.Добавить(Новый Структура("ИмяКолонки,Тип", Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null")));
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтруктураКолонки из МассивСтруктурКолонокКПриведению Цикл
		ТЗКопияПриведенная.Колонки.Удалить(СтруктураКолонки.ИмяКолонки);
	КонецЦикла;
	Для каждого СтруктураКолонки из МассивСтруктурКолонокКПриведению Цикл
		ТЗКопияПриведенная.Колонки.Добавить(СтруктураКолонки.ИмяКолонки, СтруктураКолонки.Тип);
	КонецЦикла;
	
	
	Для каждого Строка из ТЗДанныхИзРегистра Цикл
		
		НоваяСтрока = ТЗКопияПриведенная.Добавить();
		НоваяСтрока.ПорядокРЦ = МассивВыбранныхРЦ.Найти(Строка.РабочийЦентр);
		НоваяСтрока._uniq_id = Новый УникальныйИдентификатор;
		
		Если ТипПрав <> "ВидитВсе" И МассивДоступныхЗаказов.Найти(Строка.Заказ) = Неопределено Тогда
			// Строка недоступна для пользователя
			НоваяСтрока.ДоступнаКОтображению = Ложь;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Начало,Окончание,ВремяПлан,ДобавленоСекунд,РабочийЦентр,Площадка");
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.ДоступнаКОтображению = Истина;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ТЗКопияПриведенная.Сортировать("ПорядокРЦ,Начало");
	
	Возврат HttpВернутьТзКакJSON(ТЗКопияПриведенная);
	
КонецФункции

Функция GetOM(ПараметрыPOST)
	
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "OrderNum, OrderDate");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	OrderNum  = ПараметрыPOST.OrderNum;
	OrderDate = ПараметрыPOST.OrderDate;
	Если ПараметрыPOST.Свойство("OrderDate") Тогда
		OrderDate = Дата(ПараметрыPOST.OrderDate);
	Иначе
		OrderDate = '00010101';
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.ОригиналМакет КАК ОригиналМакет,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Номер = &Номер
	|	И ЗаказКлиентаТовары.Ссылка.Дата = &Дата
	|	И ЗаказКлиентаТовары.ОригиналМакет <> """"";
	Запрос.УстановитьПараметр("Номер",OrderNum );
	Запрос.УстановитьПараметр("Дата",OrderDate );
	
	Массив = Новый Массив();
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		ОМ=Выборка.ОригиналМакет;
		Для каждого Файл Из ОМ.файлы Цикл
			
			
			ДД=ПолучитьДвоичныеДанныеОригиналМакета(ОМ,Файл.ИдентификаторФайла);
			Base64 = Base64Строка(ДД); 
			Если ДД<>Неопределено Тогда
				Структура = Новый Структура;
				Структура.Вставить("article",Выборка.Артикул);
				Структура.Вставить("name",Выборка.Наименование);
				Структура.Вставить("filename",Файл.ИмяФайла);
				Структура.Вставить("content",Base64);
				
				Массив.Добавить(Структура);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла; 
	
	
	
	Возврат HttpВернутьСтруктуруКакJSON(Массив);
	
КонецФункции

Функция CuttingPlan(ПараметрыPOST) 	 
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	
	МассивДанных=ПланированиеСервер.СформироватьМассивТЗСервер();
	
	Для каждого Структура Из МассивДанных Цикл
		Структура.Таблица=Лико_HTTP_Сервер.ТзВМассивСтруктур(Структура.Таблица); 	
	КонецЦикла;
	
	
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(МассивДанных));
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция StagesОrder(ПараметрыPOST) 	 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ЭтапыВыполненияЗаказа.Код КАК StageCode,
	|	Лико_ЭтапыВыполненияЗаказа.Наименование КАК Name
	|ИЗ
	|	Справочник.Лико_ЭтапыВыполненияЗаказа КАК Лико_ЭтапыВыполненияЗаказа
	| ГДЕ
	| Лико_ЭтапыВыполненияЗаказа.Отслеживание"; 	
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON( Запрос.Выполнить().Выгрузить()));
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция TrackedOrders(ПараметрыPOST) 	 
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS); 
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.Номер КАК OrderNum,
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.Дата КАК OrderDate,
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.Партнер.Наименование КАК ClientName
	|ИЗ
	|	РегистрСведений.Лико_НастройкиОпововещенияОбЭтапахЗаказа КАК Лико_НастройкиОпововещенияОбЭтапахЗаказа
	|ГДЕ
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.КонтрольЭтапов
	|	И Лико_НастройкиОпововещенияОбЭтапахЗаказа.Пользователь = &Пользователь"; 
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON( Запрос.Выполнить().Выгрузить()));
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция StagesControl(ПараметрыPOST) 	 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "OrderNum,OrderDate,ArrayStageCode,UserOS");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	
	OrderNum  = ПараметрыPOST.OrderNum;
	OrderDate =  Дата(ПараметрыPOST.OrderDate);
	ArrayStageCode = ПараметрыPOST.ArrayStageCode;
	Заказ=Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата = &Дата
	|	И ЗаказКлиента.Номер = &Номер";
	Запрос.УстановитьПараметр("Дата",OrderDate);
	Запрос.УстановитьПараметр("Номер",OrderNum);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Заказ=Выборка.Ссылка;
	КонецЦикла; 
	
	
	НачатьТранзакцию();	
	
	НаборЗаписей = РегистрыСведений.Лико_НастройкиОпововещенияОбЭтапахЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заказ.Установить(Заказ);	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	
	Для каждого Код Из ArrayStageCode Цикл
		
		Этап= Справочники.Лико_ЭтапыВыполненияЗаказа.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(Этап) И ЗначениеЗаполнено(Заказ) Тогда
			
			Запись=НаборЗаписей.Добавить();
			Запись.Заказ=Заказ;
			Запись.Этап=Этап;
			Запись.Пользователь=Пользователь;
		КонецЕсли;
	КонецЦикла;
	
	
	НаборЗаписей.Записать(Истина); 
	ДокОбъект=Заказ.ПолучитьОбъект();
	ДокОбъект.КонтрольЭтапов=Истина;
	ДокОбъект.ОбменДанными.Загрузка =истина;			
	ДокОбъект.Записать();
	ЗафиксироватьТранзакцию();	
	
	
	Структура = Новый Структура;   	
	Структура.Вставить("result",1); 
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция CancelStagesControl(ПараметрыPOST) 	 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "OrderNum,OrderDate");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	// Найдем пользователя 1с
	
	OrderNum  = ПараметрыPOST.OrderNum;
	OrderDate =  Дата(ПараметрыPOST.OrderDate);
	Заказ=Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата = &Дата
	|	И ЗаказКлиента.Номер = &Номер";
	Запрос.УстановитьПараметр("Дата",OrderDate);
	Запрос.УстановитьПараметр("Номер",OrderNum);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Заказ=Выборка.Ссылка;
	КонецЦикла; 
	Если ЗначениеЗаполнено(Заказ) Тогда 	
		ДокОбъект=Заказ.ПолучитьОбъект();
		ДокОбъект.КонтрольЭтапов=Ложь;
		ДокОбъект.ОбменДанными.Загрузка =истина;			
		ДокОбъект.Записать();
		
	КонецЕсли;
	
	
	
	Структура = Новый Структура;   	
	Структура.Вставить("result",1); 
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция OrderStagesInfo(ПараметрыPOST) 	 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "OrderNum,OrderDate,UserOS");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	
	OrderNum  = ПараметрыPOST.OrderNum;
	OrderDate =  Дата(ПараметрыPOST.OrderDate);
	Заказ=Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Этап.Код КАК ЭтапКод
	|ИЗ
	|	РегистрСведений.Лико_НастройкиОпововещенияОбЭтапахЗаказа КАК Лико_НастройкиОпововещенияОбЭтапахЗаказа
	|ГДЕ
	|	Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.Номер = &Номер
	|	И Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.КонтрольЭтапов
	|	И Лико_НастройкиОпововещенияОбЭтапахЗаказа.Пользователь=&Пользователь
	|	И Лико_НастройкиОпововещенияОбЭтапахЗаказа.Заказ.Дата = &Дата";
	Запрос.УстановитьПараметр("Номер",OrderNum ); 
	Запрос.УстановитьПараметр("Дата",OrderDate );
	Запрос.УстановитьПараметр("Пользователь",Пользователь );
	
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON( Запрос.Выполнить().Выгрузить()));
	
	
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция OrderStages(ПараметрыPOST) 	 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DocNum,DocDate,UserOS");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	
	DocNum  = ПараметрыPOST.DocNum;
	DocDate =  Дата(ПараметрыPOST.DocDate);
	Заказ=Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата = &Дата
	|	И ЗаказКлиента.Номер = &Номер";
	Запрос.УстановитьПараметр("Дата",DocDate);
	Запрос.УстановитьПараметр("Номер",DocNum);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Заказ=Выборка.Ссылка;
	КонецЦикла; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВариантыОтчетовРазмещение.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыОтчетов.Размещение КАК ВариантыОтчетовРазмещение
	|ГДЕ
	|	ВариантыОтчетовРазмещение.Ссылка.Наименование = &НаименованиеОтчета";
	Запрос.УстановитьПараметр("НаименованиеОтчета","лк Состояние заказа" );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВариантОтчета= Выборка.Ссылка;
	КонецЦикла;  
	Структура = Новый Структура;
	Структура.Вставить("ЗаказКлиента",Заказ); 
	ТабДокумент=Лико_Дополнительно.ПолучитьТабличныйДокументВариантаОтчета(ВариантОтчета, Структура);
	
	
	Report=Неопределено;
	ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
	ТабДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.PDF);
	
	ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
	Base64 = Base64Строка(ДвДанные);  			
	
	Структура = Новый Структура;
	Структура.Вставить("Content", Base64);
	//Структура.Вставить("Type", "PDF");
	
	
	УдалитьФайлы(ВременныйФайл);
	Возврат HttpВернутьСтруктуруКакJSON(Структура); 
	
	
КонецФункции //-Лико m.shenderov 26.10.2021 

Функция WRP2(ПараметрыPOST)
	Если Не ПараметрыPOST.Свойство("SiteInn") Тогда
		SiteInn="";
	Иначе
		SiteInn    = ПараметрыPOST.SiteInn;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SiteInn) Тогда
		Лико_Площадка = Справочники.Лико_Площадки.ПолучитьСсылку(Новый УникальныйИдентификатор(SiteInn));
	Иначе
		Лико_Площадка = "";
	КонецЕсли;

	
	// Найдем пользователя 1с
	UserOS = ПараметрыPOST.UserOS;
	Если НЕ ЗначениеЗаполнено(UserOS) Тогда
		Возврат HttpВернутьОшибку(424, "Не передан UserOS");
	КонецЕсли;
	Пользователь=ПолучитьПользователя(UserOS);
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат HttpВернутьОшибку(424, "В 1С не найден пользователь с вашим UserOS");
	Иначе
		Если Пользователь.Лико_Площадки.Количество() =0  Тогда
			Возврат HttpВернутьОшибку(403, "В 1С для вашего пользователя не заданы доступные площадки");		
		КонецЕсли;	
	КонецЕсли;
	
	Если Пользователь.Лико_Площадки.Количество() <3  Тогда
		Если SiteInn="" Тогда 
			//SiteInn= Пользователь.Лико_Площадки[0].Организация.ИНН;
			Лико_Площадка= Пользователь.Лико_Площадки[0].Площадка;

		//ИначеЕсли SiteInn<> Пользователь.Лико_Площадки[0].Организация.ИНН Тогда
		ИначеЕсли Лико_Площадка<> Пользователь.Лико_Площадки[0].Площадка Тогда  

			Возврат HttpВернутьОшибку(403, "Данные по площадке не доступны");						
		КонецЕсли;
	КонецЕсли;
	
	
	
	#Область Запрос_остатков_СГП_по_отдельному_клиенту_и_периоду
	Если ЕстьСвойство(ПараметрыPOST, "PartnerCode") Тогда 
		
		PartnerCode = ПараметрыPOST.PartnerCode;
		
		Если Не ЕстьСвойство(ПараметрыPOST, "Period") Тогда
			Period=1;
		Иначе
			Period=Число(ПараметрыPOST.Period);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		//Запрос.УстановитьПараметр("SiteInn", SiteInn);
		Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(ТоварыНаСкладахОстатки.Серия.Лико_ДатаВыпуска) КАК ДатаВыпуска,
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыНаСкладахОстатки.Серия) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток = ИСТИНА
		|				И Характеристика.Лико_ЗаказНоменклатуры.Партнер.Код = &ПартнерКод
		|				И Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|				И Склад.Наименование <> ""Не ордерный""
		|				И ВЫБОР
		|					КОГДА &Лико_Площадка = """"
		|						ТОГДА ИСТИНА
		//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn
		|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				Ячейка В
		|					(ВЫБРАТЬ
		|						СкладыДополнительныеРеквизиты.Значение КАК Ячейка
		|					ИЗ
		|						Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|					ГДЕ
		|						СкладыДополнительныеРеквизиты.Свойство.Имя = ""ЯчейкаРастарка""
		|					СГРУППИРОВАТЬ ПО
		|						СкладыДополнительныеРеквизиты.Значение)) КАК ТоварыВЯчейкахОстатки
		|		ПО ТоварыНаСкладахОстатки.Серия = ТоварыВЯчейкахОстатки.Серия
		|			И ТоварыНаСкладахОстатки.Склад = ТоварыВЯчейкахОстатки.Ячейка.Владелец
		|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|	И ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры,
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Период,
		|	ВТОстатки.Заказ КАК Заказ,
		|	СУММА(ВТОстатки.Количество) КАК Количество,
		|	ВТОстатки.Склад КАК Склад,
		|	ВТОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ВТОстатки.КоличествоКоробок) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТОстаткиПериод
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НомерПериода = 0
		|				ТОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			КОГДА &НомерПериода = 1
		|				ТОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|						И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			КОГДА &НомерПериода = 2
		|				ТОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|						И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			КОГДА &НомерПериода = 3
		|				ТОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстатки.Заказ,
		|	ВТОстатки.Склад,
		|	ВТОстатки.Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТОстатки.ДатаВыпуска < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ
		|ПОМЕСТИТЬ ВТОстаткиНеОрдерные
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
		|				И НЕ Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|				И Характеристика.Лико_ЗаказНоменклатуры.Партнер.Код = &ПартнерКод
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|				И Склад.Наименование <> ""Не ордерный""
		|				И ВЫБОР
		|					КОГДА &Лико_Площадка = """"
		|						ТОГДА ИСТИНА
		//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn 
		|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОбороты.Склад КАК Склад,
		|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
		|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(ТоварыНаСкладахОбороты.Период) КАК ПериодПрихода
		|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(
		|			,
		|			,
		|			День,
		|			Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
		|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|				И Склад.Наименование <> ""Не ордерный""
		|				И (Номенклатура, Характеристика.Лико_ЗаказНоменклатуры) В
		|					(ВЫБРАТЬ
		|						Т.Номенклатура,
		|						Т.Заказ
		|					ИЗ
		|						ВТОстаткиНеОрдерные КАК Т)) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.ВНаличииПриход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры,
		|	ТоварыНаСкладахОбороты.Номенклатура,
		|	ТоварыНаСкладахОбороты.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Номенклатура КАК Номенклатура,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ КАК Заказ,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад КАК Склад,
		|	ВЫБОР
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПериодПрихода
		|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
		|ИЗ
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НомерПериода = 0
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			КОГДА &НомерПериода = 1
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|						И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			КОГДА &НомерПериода = 2
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|						И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			КОГДА &НомерПериода = 3
		|				ТОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Номенклатура,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад,
		|	ВЫБОР
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|			ТОГДА 0
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|			ТОГДА 1
		|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
		|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТОстаткиПериод.Склад КАК Склад,
		|	ВТОстаткиПериод.Заказ КАК Заказ,
		|	ВТОстаткиПериод.Номенклатура КАК Номенклатура,
		|	ВТОстаткиПериод.Период КАК ДатаВыпуска,
		|	ВТОстаткиПериод.Количество КАК Количество,
		|	ВТОстаткиПериод.КоличествоКоробок КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТОстаткиПериод КАК ВТОстаткиПериод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ВТОстаткиНеОрдерные.Склад,
		|	ВТОстаткиНеОрдерные.Заказ,
		|	ВТОстаткиНеОрдерные.Номенклатура,
		|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.ПериодПрихода,
		|	ВТОстаткиНеОрдерные.Количество,
		|	0
		|ИЗ
		|	ВТОстаткиНеОрдерные КАК ВТОстаткиНеОрдерные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
		|		ПО ВТОстаткиНеОрдерные.Склад = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Склад
		|			И ВТОстаткиНеОрдерные.Номенклатура = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Номенклатура
		|			И ВТОстаткиНеОрдерные.Заказ = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Заказ КАК Заказ,
		|	СУММА(ВТ.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТОстаткиПоЗаказам
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТОстаткиПоЗаказам.Заказ КАК Заказ,
		|	ВТОстаткиПоЗаказам.Количество КАК КоличествоОстатокПоЗаказу,
		|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК КоличествоВыпуск
		|ПОМЕСТИТЬ ВТВыпуск
		|ИЗ
		|	ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ВыпускГП.Обороты(
		|				,
		|				,
		|				,
		|				Заказ В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТОстаткиПоЗаказам.Заказ КАК Заказ
		|					ИЗ
		|						ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам)) КАК Лико_ВыпускГПОбороты
		|		ПО ВТОстаткиПоЗаказам.Заказ = Лико_ВыпускГПОбороты.Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстаткиПоЗаказам.Заказ,
		|	ВТОстаткиПоЗаказам.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТОстатки.Заказ.Партнер.Код КАК PartnerCode,
		|	ВТОстатки.Заказ.Партнер.Наименование КАК PartnerName,
		|	ЕСТЬNULL(ВТОстатки.Заказ.Менеджер.Наименование, """") КАК Manager,
		|	ВТОстатки.Заказ.НомерБезПрефикса КАК Order,
		|	ВТОстатки.Склад.Наименование КАК Stock,
		|	ВТОстатки.Номенклатура.Наименование КАК Nom,
		|	ВТОстатки.Заказ.ЦенаСредняя КАК Price,
		|	СУММА(ВТОстатки.КоличествоКоробок) КАК Places,
		|	СУММА(ВЫРАЗИТЬ(ВТОстатки.Количество КАК ЧИСЛО(15, 2))) КАК Quantity,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ВТОстатки.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
		|						И ВТОстатки.Заказ.ШтКВМ > 0
		|					ТОГДА ВТОстатки.Количество * 1000 / ВТОстатки.Заказ.ШтКВМ
		|				КОГДА ВТОстатки.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
		|					ТОГДА ВТОстатки.Количество * ВТОстатки.Заказ.Нарезка.Размер / 1000
		|				КОГДА ВТОстатки.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
		|					ТОГДА ВТОстатки.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК Square,
		|	СУММА(ВЫБОР
		|			КОГДА ВТОстатки.Заказ.СуммаДокумента > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТОстатки.Заказ.Тираж
		|							ТОГДА ВЫБОР
		|									КОГДА ВТОстатки.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
		|										ТОГДА ВЫРАЗИТЬ(ВТОстатки.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТОстатки.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						ИНАЧЕ ВЫРАЗИТЬ(ВТОстатки.Количество * ВТОстатки.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Cost,
		|	ВТОстатки.ДатаВыпуска КАК Date
		|ИЗ
		|	ВТ КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыпуск КАК ВТВыпуск
		|		ПО ВТОстатки.Заказ = ВТВыпуск.Заказ,
		|	Справочник.Лико_ПредопределенныеЗначения КАК ТысШт,
		|	Справочник.Лико_ПредопределенныеЗначения КАК ПМ,
		|	Справочник.Лико_ПредопределенныеЗначения КАК КВМ
		|ГДЕ
		|	ТысШт.ИмяПредопределенныхДанных = ""ЕИТысШт""
		|	И ПМ.ИмяПредопределенныхДанных = ""ЕИПогМетр""
		|	И КВМ.ИмяПредопределенныхДанных = ""ЕИКвадрМетр""
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстатки.Заказ.НомерБезПрефикса,
		|	ВТОстатки.Заказ.ЦенаСредняя,
		|	ВТОстатки.Склад.Наименование,
		|	ВТОстатки.Заказ.Партнер.Код,
		|	ВТОстатки.Заказ.Партнер.Наименование,
		|	ВТОстатки.Номенклатура.Наименование,
		|	ВТОстатки.ДатаВыпуска,
		|	ЕСТЬNULL(ВТОстатки.Заказ.Менеджер.Наименование, """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Cost УБЫВ";
		
		Массив = Новый Массив();
		Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоНаименованию("Упк.: Растарка"));
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("ПартнерКод", PartnerCode);
		Запрос.УстановитьПараметр("НомерПериода", Period);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Возврат HttpВернутьТзКакJSON(ТЗ);
	КонецЕсли;
	#КонецОбласти	
	
	
	#Область Запрос_остатков_СГП_по_клиентам_2
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("SiteInn", SiteInn);
	Запрос.УстановитьПараметр("Лико_Площадка", Лико_Площадка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	МИНИМУМ(ТоварыНаСкладахОстатки.Серия.Лико_ДатаВыпуска) КАК ДатаВыпуска,
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
	|				И Склад.Наименование <> ""Не ордерный""
	|				И ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn 
	|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
	|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Ячейка В
	|					(ВЫБРАТЬ
	|						СкладыДополнительныеРеквизиты.Значение КАК Ячейка
	|					ИЗ
	|						Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|					ГДЕ
	|						СкладыДополнительныеРеквизиты.Свойство.Имя = ""ЯчейкаРастарка""
	|					СГРУППИРОВАТЬ ПО
	|						СкладыДополнительныеРеквизиты.Значение)) КАК ТоварыВЯчейкахОстатки
	|		ПО ТоварыНаСкладахОстатки.Серия = ТоварыВЯчейкахОстатки.Серия
	|			И ТоварыНаСкладахОстатки.Склад = ТоварыВЯчейкахОстатки.Ячейка.Владелец
	|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
	|			И ТоварыНаСкладахОстатки.Назначение = ТоварыВЯчейкахОстатки.Назначение
	|			И ТоварыНаСкладахОстатки.Помещение = ТоварыВЯчейкахОстатки.Ячейка.Помещение
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|	И ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры,
	|	ТоварыНаСкладахОстатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОстатки.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Период,
	|	СУММА(ВТОстатки.Количество) КАК Количество,
	|	ВТОстатки.Склад КАК Склад
	|ПОМЕСТИТЬ ВТОстаткиПериод
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстатки.Заказ,
	|	ВТОстатки.Склад,
	|	ВЫБОР
	|		КОГДА ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТОстатки.ДатаВыпуска <= ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТОстатки.ДатаВыпуска > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад
	|ПОМЕСТИТЬ ВТОстаткиНеОрдерные
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				И Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток
	|				И НЕ Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
	|				И Склад.Наименование <> ""Не ордерный""
	|				И ВЫБОР
	|					КОГДА &Лико_Площадка = """"
	|						ТОГДА ИСТИНА
	//|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация.ИНН = &SiteInn 
	|					ИНАЧЕ Характеристика.Лико_ЗаказНоменклатуры.Площадка = &Лико_Площадка
	|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Характеристика.Лико_ЗаказНоменклатуры,
	|	ТоварыНаСкладахОстатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОбороты.Склад КАК Склад,
	|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	МИНИМУМ(ТоварыНаСкладахОбороты.Период) КАК ПериодПрихода
	|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			,
	|			,
	|			День,
	|			Характеристика.Лико_ЗаказНоменклатуры В
	|					(ВЫБРАТЬ
	|						Т.Заказ
	|					ИЗ
	|						ВТОстаткиНеОрдерные КАК Т)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
	|				И Склад.Лико_ТипСкладаГотовойПродукции <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
	|				И Склад.Наименование <> ""Не ордерный"") КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.ВНаличииПриход <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОбороты.Характеристика.Лико_ЗаказНоменклатуры,
	|	ТоварыНаСкладахОбороты.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад КАК Склад,
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ПериодПрихода
	|ПОМЕСТИТЬ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
	|ИЗ
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Склад,
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|			ТОГДА 0
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|			ТОГДА 1
	|		КОГДА ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода < ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -2)
	|				И ВТ_ДатыПриходаОстатковНеОрдерныхСкладов.ПериодПрихода > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОстатки.Заказ КАК Заказ,
	|	ВТОстатки.Период КАК Период,
	|	ВТОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТОстаткиПериод КАК ВТОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ВТОстаткиНеОрдерные.Заказ,
	|	ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.ПериодПрихода,
	|	ВТОстаткиНеОрдерные.Количество
	|ИЗ
	|	ВТОстаткиНеОрдерные КАК ВТОстаткиНеОрдерные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор КАК ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор
	|		ПО ВТОстаткиНеОрдерные.Заказ = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Заказ
	|			И ВТОстаткиНеОрдерные.Склад = ВТ_ДатыПриходаОстатковНеОрдерныхСкладовОтбор.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Заказ КАК Заказ,
	|	СУММА(ВТ.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиПоЗаказам
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	СУММА(Лико_ВыпускГПОбороты.КоличествоОборот) КАК КоличествоВыпуск,
	|	ВТОстаткиПоЗаказам.Количество КАК КоличествоОстатокПоЗаказу
	|ПОМЕСТИТЬ ВТВыпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			,
	|			,
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ.Заказ КАК Заказ
	|				ИЗ
	|					ВТ КАК ВТ)) КАК Лико_ВыпускГПОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиПоЗаказам КАК ВТОстаткиПоЗаказам
	|		ПО Лико_ВыпускГПОбороты.Заказ = ВТОстаткиПоЗаказам.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	ВТОстаткиПоЗаказам.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Подразделение.Наименование, """") КАК Region,
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Наименование, """") КАК Manager,
	|	СУММА(ВЫРАЗИТЬ(ВТ.Количество КАК ЧИСЛО(15, 2))) КАК Quantity,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|						И ВТ.Заказ.ШтКВМ > 0
	|					ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|				КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|					ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|				КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|					ТОГДА ВТ.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК Square,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Заказ.СуммаДокумента > 0
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|										ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Cost,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 0
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month1,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 2
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month2,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 3
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.Заказ.СуммаДокумента > 0
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ВТВыпуск.КоличествоВыпуск, 0) > ВТ.Заказ.Тираж
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.Заказ.Тираж > ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу
	|													ТОГДА ВЫРАЗИТЬ(ВТ.Заказ.СуммаДокумента - (ВТВыпуск.КоличествоВыпуск - ВТВыпуск.КоличествоОстатокПоЗаказу) * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ВЫРАЗИТЬ(ВТ.Количество * ВТ.Заказ.ЦенаСредняя КАК ЧИСЛО(15, 2))
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Month3,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 0
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square0,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 1
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square1,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 2
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square2,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.Период = 3
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	|									И ВТ.Заказ.ШтКВМ > 0
	|								ТОГДА ВТ.Количество * 1000 / ВТ.Заказ.ШтКВМ
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество * ВТ.Заказ.Нарезка.Размер / 1000
	|							КОГДА ВТ.Заказ.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	|								ТОГДА ВТ.Количество
	|							ИНАЧЕ 0
	|						КОНЕЦ КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Square3
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыпуск КАК ВТВыпуск
	|		ПО ВТ.Заказ = ВТВыпуск.Заказ,
	|	Справочник.Лико_ПредопределенныеЗначения КАК ТысШт,
	|	Справочник.Лико_ПредопределенныеЗначения КАК ПМ,
	|	Справочник.Лико_ПредопределенныеЗначения КАК КВМ
	|ГДЕ
	|	ТысШт.ИмяПредопределенныхДанных = ""ЕИТысШт""
	|	И ПМ.ИмяПредопределенныхДанных = ""ЕИПогМетр""
	|	И КВМ.ИмяПредопределенныхДанных = ""ЕИКвадрМетр""
	|	И НЕ ВТ.Заказ.Партнер.Наименование ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Подразделение.Наименование, """"),
	|	ЕСТЬNULL(ВТ.Заказ.Менеджер.Наименование, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Cost УБЫВ"   ;
	
	#КонецОбласти	
	
	
	Массив = Новый Массив();
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоНаименованию("Упк.: Растарка"));
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат HttpВернутьТзКакJSON(ТЗ);
	
	
КонецФункции

Функция GetDocsPackets(ПараметрыPOST) // --> Начало Лико Ефимов ЕВВ 11.04.2023 Список текущих пакетов
	
	ДатаНачала = ?(ПараметрыPOST.Свойство("DateStart"), Дата(ПараметрыPOST.DateStart), Дата('00010101'));	
	ДатаОкончания = ?(ПараметрыPOST.Свойство("DateEnd"), Дата(ПараметрыPOST.DateEnd), Дата('00010101'));	
	СписокСтатусов = Новый СписокЗначений;
	Если ПараметрыPOST.Свойство("States") Тогда
		Для каждого ТекСтатус из ПараметрыPOST.States Цикл
			Попытка
				ТекСтатусСсылка = XMLЗначение(Тип("ПеречислениеСсылка.Лико_СтатусыОтправкиДокументов"), ТекСтатус);
			Исключение
				Возврат HttpВернутьОшибку(424, "Не найден статус с именем """ + ТекСтатус + """");
			КонецПопытки;
			Если ТекСтатусСсылка = Неопределено Тогда	
				Возврат HttpВернутьОшибку(424, "Не найден статус с именем """ + ТекСтатус + """");
			КонецЕсли;
			СписокСтатусов.Добавить(ТекСтатусСсылка);
		КонецЦикла;
	КонецЕсли;
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Если ПараметрыPOST.Свойство("CounteragentUUID") Тогда
		Контрагент = XMLЗначение(Тип("СправочникСсылка.Контрагенты"), ПараметрыPOST.CounteragentUUID);
		Если НЕ ОбщегоНазначения.СсылкаСуществует(Контрагент) Тогда
			Возврат HttpВернутьОшибку(424, "Не найден контрагент с заданным идентификатором");
		КонецЕсли;
	КонецЕсли;

	СтруктураДляВозврата = Новый Структура;
	
	КоличествоЗаписей = 0;
	Если ПараметрыPOST.Свойство("Limit") Тогда
		КоличествоЗаписей = ПараметрыPOST.Limit;
		СтруктураДляВозврата.Вставить("Limit", ПараметрыPOST.Limit);
	КонецЕсли;
	
	НачитатьСЗаписи = 0;     
	Если ПараметрыPOST.Свойство("Offset") Тогда
		НачитатьСЗаписи = ПараметрыPOST.Offset;
		СтруктураДляВозврата.Вставить("Offset", ПараметрыPOST.Offset);
	КонецЕсли;
	
	СтруктураСортировки = Неопределено;
	Если ПараметрыPOST.Свойство("SortBy")
		И ТипЗнч(ПараметрыPOST.SortBy) = Тип("Структура")
		И ПараметрыPOST.SortBy.Свойство("Name")
		И ЗначениеЗаполнено(ПараметрыPOST.SortBy.Name)
		И ПараметрыPOST.SortBy.Свойство("Direction")
		И ЗначениеЗаполнено(ПараметрыPOST.SortBy.Direction)
		Тогда
		СтруктураСортировки = ПараметрыPOST.SortBy;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Лико_РегистрацияОтправкиДокументов.Пакет КАК Пакет,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент) = ТИП(Документ.РеализацияТоваровУслуг)
		|				ТОГДА ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг).Номер
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК РеализацияТоваровУслугНомер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент) = ТИП(Документ.ТранспортнаяНакладная)
		|				ТОГДА ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.ТранспортнаяНакладная).Номер
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК ТранспортнаяНакладнаяНомер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент) = ТИП(Документ.СчетФактураВыданный)
		|				ТОГДА ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.СчетФактураВыданный).Номер
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК СчетФактураВыданныйНомер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент) = ТИП(Документ.СчетНаОплатуКлиенту)
		|				ТОГДА ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.СчетНаОплатуКлиенту).Номер
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК СчетНаОплатуКлиентуНомер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент) = ТИП(Документ.ПриемкаТоваровНаХранение)
		|				ТОГДА ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.ПриемкаТоваровНаХранение).Номер
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК ПриемкаТоваровНаХранениеНомер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент) = ТИП(Документ.ОтгрузкаТоваровСХранения)
		|				ТОГДА ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.ОтгрузкаТоваровСХранения).Номер
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК ОтгрузкаТоваровСХраненияНомер
		|ПОМЕСТИТЬ ВТ_ПакетыЗаданногоКонтрагента
		|ИЗ
		|	РегистрСведений.Лико_РегистрацияОтправкиДокументов КАК Лико_РегистрацияОтправкиДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
		|		ПО (Лико_РегистрацияОтправкиДокументов.Пакет = (ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку)))
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Лико_РегистрацияОтправкиДокументов.Контрагент = &Контрагент
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_РегистрацияОтправкиДокументов.Пакет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_РегистрацияОтправкиДокументовСрезПоследних.Период КАК Период,
		|	ВТ_ПакетыЗаданногоКонтрагента.Пакет.Номер КАК ПакетНомер,
		|	ВТ_ПакетыЗаданногоКонтрагента.Пакет.Дата КАК ПакетДата,
		|	Лико_РегистрацияОтправкиДокументовСрезПоследних.Статус КАК СтатусСсылка,
		|	ПРЕДСТАВЛЕНИЕ(Лико_РегистрацияОтправкиДокументовСрезПоследних.Статус) КАК Статус,
		|	Лико_РегистрацияОтправкиДокументовСрезПоследних.Контрагент КАК КонтрагентСсылка,
		|	ЕСТЬNULL(Лико_РегистрацияОтправкиДокументовСрезПоследних.Контрагент.НаименованиеПолное, """") КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Лико_РегистрацияОтправкиДокументовСрезПоследних.Ответственный) = ТИП(СТРОКА)
		|			ТОГДА Лико_РегистрацияОтправкиДокументовСрезПоследних.Ответственный
		|		ИНАЧЕ Лико_РегистрацияОтправкиДокументовСрезПоследних.Ответственный.Наименование
		|	КОНЕЦ КАК Ответственный,
		|	Лико_РегистрацияОтправкиДокументовСрезПоследних.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(Лико_РегистрацияОтправкиДокументовСрезПоследних.Перевозчик.НаименованиеПолное, """") КАК Перевозчик,
		|	Лико_РегистрацияОтправкиДокументовСрезПоследних.НомерОтправления КАК НомерОтправления,
		|	ВТ_ПакетыЗаданногоКонтрагента.РеализацияТоваровУслугНомер КАК РеализацияТоваровУслугНомер,
		|	ВТ_ПакетыЗаданногоКонтрагента.ТранспортнаяНакладнаяНомер КАК ТранспортнаяНакладнаяНомер,
		|	ВТ_ПакетыЗаданногоКонтрагента.СчетФактураВыданныйНомер КАК СчетФактураВыданныйНомер,
		|	ВТ_ПакетыЗаданногоКонтрагента.СчетНаОплатуКлиентуНомер КАК СчетНаОплатуКлиентуНомер,
		|	ВТ_ПакетыЗаданногоКонтрагента.ПриемкаТоваровНаХранениеНомер КАК ПриемкаТоваровНаХранениеНомер,
		|	ВТ_ПакетыЗаданногоКонтрагента.ОтгрузкаТоваровСХраненияНомер КАК ОтгрузкаТоваровСХраненияНомер,
		|	ВТ_ПакетыЗаданногоКонтрагента.Пакет.ДатаОтгрузки КАК ДатаОтгрузки
		|ИЗ
		|	ВТ_ПакетыЗаданногоКонтрагента КАК ВТ_ПакетыЗаданногоКонтрагента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_РегистрацияОтправкиДокументов.СрезПоследних КАК Лико_РегистрацияОтправкиДокументовСрезПоследних
		|		ПО ВТ_ПакетыЗаданногоКонтрагента.Пакет = Лико_РегистрацияОтправкиДокументовСрезПоследних.Пакет
		|			И (ВЫБОР
		|				КОГДА &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Лико_РегистрацияОтправкиДокументовСрезПоследних.Период >= &ДатаНачала
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Лико_РегистрацияОтправкиДокументовСрезПоследних.Период <= &ДатаОкончания
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &СписокСтатусовЗаполнен
		|					ТОГДА Лико_РегистрацияОтправкиДокументовСрезПоследних.Статус В (&СписокСтатусов)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПакетДата"; 
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СписокСтатусовЗаполнен", СписокСтатусов.Количество() > 0);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Колонки.Добавить("КонтрагентИд", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	ТаблицаРезультат.Колонки.Добавить("СтатусИмя", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));

	КопияТаблицы = ТаблицаРезультат.Скопировать(Новый Структура);
	
	СоответствиеКонтрагентов = Новый Соответствие;
	СоответствиеСтатусов = Новый Соответствие;
	сч = 0;
	КоличествоПодобранныхЗаписей = 0;
	Для каждого Строка из ТаблицаРезультат Цикл
		сч = сч + 1;
		Если сч <= НачитатьСЗаписи Тогда
			Продолжить;
		КонецЕсли;
		Если КоличествоЗаписей <> 0 И КоличествоПодобранныхЗаписей >= КоличествоЗаписей Тогда
			Прервать;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.КонтрагентСсылка) Тогда
			ЗначениеСоответствия = СоответствиеКонтрагентов.Получить(Строка.КонтрагентСсылка);
			Если ЗначениеСоответствия = Неопределено Тогда
				ЗначениеСоответствия = XMLСтрока(Строка.КонтрагентСсылка);
				СоответствиеКонтрагентов.Вставить(Строка.КонтрагентСсылка, ЗначениеСоответствия);
			КонецЕсли;
			Строка.КонтрагентИд = ЗначениеСоответствия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.СтатусСсылка) Тогда
			ЗначениеСоответствия = СоответствиеСтатусов.Получить(Строка.СтатусСсылка);
			Если ЗначениеСоответствия = Неопределено Тогда
				ЗначениеСоответствия = XMLСтрока(Строка.СтатусСсылка);
				СоответствиеСтатусов.Вставить(Строка.СтатусСсылка, ЗначениеСоответствия);
			КонецЕсли;
			Строка.СтатусИмя = ЗначениеСоответствия;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(КопияТаблицы.Добавить(), Строка);
		КоличествоПодобранныхЗаписей = КоличествоПодобранныхЗаписей + 1;
		
	КонецЦикла;
	КопияТаблицы.Колонки.Удалить("КонтрагентСсылка");
	КопияТаблицы.Колонки.Удалить("СтатусСсылка");

	Если СтруктураСортировки <> Неопределено Тогда
		Если КопияТаблицы.Колонки.Найти(СтруктураСортировки.Name) = Неопределено Тогда
			Возврат HttpВернутьОшибку(424, "Не найден контрагент с заданным идентификатором");
		КонецЕсли;
		//Запрос.Текст = Запрос.Текст + Символы.ПС + "УПОРЯДОЧИТЬ ПО " + СтруктураСортировки.Name + ?(СтруктураСортировки.Direction = "desc", " УБЫВ", ""); 
		КопияТаблицы.Сортировать(СтруктураСортировки.Name +  ?(СтруктураСортировки.Direction = "desc", " Убыв", ""));
	КонецЕсли;

	СтруктураДляВозврата.Вставить("ОбщееКоличествоЗаписей", ТаблицаРезультат.Количество());

	//Если ТаблицаРезультат.Количество() = 0 Тогда
	//	ТЗКопияПриведенная = ТаблицаРезультат;
	//Иначе
	//	ТЗКопияПриведенная = Лико_HTTP_Сервер.КопияТЗПриведеннаяКТипамJSON(КопияТаблицы);
	//КонецЕсли;
	МассивСтруктур = Новый Массив();
	Для каждого Строка из КопияТаблицы Цикл 		
		МассивСтруктур.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Строка));		
	КонецЦикла;   	
	
	СтруктураДляВозврата.Вставить("ТаблицаРезультат", МассивСтруктур);
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(СтруктураДляВозврата));
	
КонецФункции

Функция SetDocsPacketState(ПараметрыPOST) // --> Начало Лико Ефимов ЕВВ 11.04.2023 установить пакету новый статус
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DocNumber,DocDate,State,CounteragentUUID,UserName");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	Попытка
		ДатаДокумента = Дата(ПараметрыPOST.DocDate);
	Исключение
		Возврат HttpВернутьОшибку(424, "Не удалось получить дату");
	КонецПопытки;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		Возврат HttpВернутьОшибку(424, "Не указана дата пакета");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыPOST.DocNumber) Тогда
		Возврат HttpВернутьОшибку(424, "Не указан номер пакета");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыPOST.UserName) Тогда
		Возврат HttpВернутьОшибку(424, "Не указан пользователь");
	КонецЕсли;
	
	Попытка
		НовыйСтатус = XMLЗначение(Тип("ПеречислениеСсылка.Лико_СтатусыОтправкиДокументов"), ПараметрыPOST.State);
	Исключение
		Возврат HttpВернутьОшибку(424, "Не найден статус с именем """ + ПараметрыPOST.State + """");
	КонецПопытки;
	Если НЕ ЗначениеЗаполнено(НовыйСтатус) Тогда	
		Возврат HttpВернутьОшибку(424, "Не найден статус с именем """ + ПараметрыPOST.State + """");
	КонецЕсли;

	Контрагент = XMLЗначение(Тип("СправочникСсылка.Контрагенты"), ПараметрыPOST.CounteragentUUID);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Контрагент) Тогда
		Возврат HttpВернутьОшибку(424, "Не найден контрагент с заданным идентификатором");
	КонецЕсли;
	
	Пакет = Документы.Лико_ЗаявкаНаТранспортировку.НайтиПоНомеру(ПараметрыPOST.DocNumber, ДатаДокумента); 
	
	Если НЕ ЗначениеЗаполнено(Пакет) Тогда
		Возврат HttpВернутьОшибку(424, "Не удалось найти пакет по номеру и дате");
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.Лико_РегистрацияОтправкиДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Пакет = Пакет;
	МенеджерЗаписи.Статус = НовыйСтатус;
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Ответственный = ПараметрыPOST.UserName;
	Если ПараметрыPOST.Свойство("Comment") Тогда 
		МенеджерЗаписи.Комментарий = ПараметрыPOST.Comment;
	КонецЕсли;
	Попытка
		МенеджерЗаписи.Записать(Ложь);
	Исключение
		Возврат HttpВернутьОшибку(424, "Не удалось добавить новый статус");
	КонецПопытки;
	
	Возврат GetDocsPacketInfo(ПараметрыPOST);
	
КонецФункции

Функция GetDocsPacketInfo(ПараметрыPOST) // --> Начало Лико Ефимов ЕВВ 11.04.2023 получить информацию об одном пакете

	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "DocNumber,DocDate");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	Попытка
		ДатаДокумента = Дата(ПараметрыPOST.DocDate);
	Исключение
		Возврат HttpВернутьОшибку(424, "Не удалось получить дату");
	КонецПопытки;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		Возврат HttpВернутьОшибку(424, "Не указана дата пакета");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыPOST.DocNumber) Тогда
		Возврат HttpВернутьОшибку(424, "Не указан номер пакета");
	КонецЕсли;

	Пакет = Документы.Лико_ЗаявкаНаТранспортировку.НайтиПоНомеру(ПараметрыPOST.DocNumber, ДатаДокумента); 
	
	Если НЕ ЗначениеЗаполнено(Пакет) Тогда
		Возврат HttpВернутьОшибку(424, "Не удалось найти пакет по номеру и дате");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Лико_РегистрацияОтправкиДокументов.Период КАК Период,
		|	Лико_РегистрацияОтправкиДокументов.Пакет.Номер КАК ПакетНомер,
		|	Лико_РегистрацияОтправкиДокументов.Пакет.Дата КАК ПакетДата,
		|	ПРЕДСТАВЛЕНИЕ(Лико_РегистрацияОтправкиДокументов.Статус) КАК Статус,
		|	ЕСТЬNULL(Лико_РегистрацияОтправкиДокументов.Контрагент.НаименованиеПолное, """") КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Лико_РегистрацияОтправкиДокументов.Ответственный) = ТИП(СТРОКА)
		|			ТОГДА Лико_РегистрацияОтправкиДокументов.Ответственный
		|		ИНАЧЕ Лико_РегистрацияОтправкиДокументов.Ответственный.Наименование
		|	КОНЕЦ КАК Ответственный,
		|	Лико_РегистрацияОтправкиДокументов.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(Лико_РегистрацияОтправкиДокументов.Перевозчик.НаименованиеПолное, """") КАК Перевозчик,
		|	Лико_РегистрацияОтправкиДокументов.НомерОтправления КАК НомерОтправления
		|ИЗ
		|	РегистрСведений.Лико_РегистрацияОтправкиДокументов КАК Лико_РегистрацияОтправкиДокументов
		|ГДЕ
		|	Лико_РегистрацияОтправкиДокументов.Пакет = &Пакет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Пакет", Пакет);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(ТаблицаРезультат));
	
КонецФункции

Функция GetDocsPacketsStates(ПараметрыPOST) // --> Начало Лико Ефимов ЕВВ 11.04.2023 получить все статусы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Лико_СтатусыОтправкиДокументов.Ссылка КАК СтатусСсылка,
		|	ПРЕДСТАВЛЕНИЕ(Лико_СтатусыОтправкиДокументов.Ссылка) КАК Статус
		|ИЗ
		|	Перечисление.Лико_СтатусыОтправкиДокументов КАК Лико_СтатусыОтправкиДокументов";
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Колонки.Добавить("СтатусИмя", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	
	Для каждого Строка из ТаблицаРезультат Цикл
		Строка.СтатусИмя = XMLСтрока(Строка.СтатусСсылка);
	КонецЦикла;
	
	ТаблицаРезультат.Колонки.Удалить("СтатусСсылка");
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(ТаблицаРезультат));
	
КонецФункции

Функция GetCatalogItemsByProps(ПараметрыPOST) // --> Начало Лико Ефимов ЕВВ 11.04.2023 получить элементы справочника с УИДами по отбору

	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "CatalogName,Filter,RequestedProps");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыPOST.CatalogName) Тогда
		Возврат HttpВернутьОшибку(424, "Не указано имя справочника");
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыPOST.RequestedProps) <> Тип("Массив") Тогда
		Возврат HttpВернутьОшибку(424, "Не передан массив необходимых полей");
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыPOST.Filter) <> Тип("Структура") Тогда
		Возврат HttpВернутьОшибку(424, "Не передана структура фильтров");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Таблица.Ссылка КАК Ссылка";
	Для каждого ИмяРеквизита из ПараметрыPOST.RequestedProps Цикл
		Если ВРег(ИмяРеквизита) = "UUID" Тогда
			// Ид добавим в конце, т.к. запросом его не вытащить (платформа 8.3.21)
			Продолжить;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + ", Таблица." + ИмяРеквизита + " КАК " + ИмяРеквизита;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + " ИЗ Справочник." + ПараметрыPOST.CatalogName + " КАК Таблица ГДЕ";
	
	ПервоеУсловие = Истина;
	ФильтрПоИд = Ложь;
	Для каждого ТекУсловие из ПараметрыPOST.Filter Цикл
		Если ТекУсловие.Ключ = "UUID" Тогда
			ФильтрПоИд = Истина;
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ТекУсловие.Значение) = Тип("Число") Тогда
			Запрос.Текст = Запрос.Текст + ?(ПервоеУсловие, " ", " И ") + "Таблица." + ТекУсловие.Ключ + " = " + Формат(ТекУсловие.Значение, "ЧРД=.; ЧГ=0");
		ИначеЕсли ТипЗнч(ТекУсловие.Значение) = Тип("Булево") Тогда
			Запрос.Текст = Запрос.Текст + ?(ПервоеУсловие, " ", " И ") + "Таблица." + ТекУсловие.Ключ + " = " + ?(ТекУсловие.Значение, "ИСТИНА", "ЛОЖЬ");
		Иначе
			Запрос.Текст = Запрос.Текст + ?(ПервоеУсловие, " ", " И ") + "Таблица." + ТекУсловие.Ключ + " ПОДОБНО " + """%" + ТекУсловие.Значение + "%""";
		КонецЕсли;
		ПервоеУсловие = Ложь;
	КонецЦикла;

	Если ФильтрПоИд Тогда
		Ссылка = XMLЗначение(Тип("СправочникСсылка." + ПараметрыPOST.CatalogName), ПараметрыPOST.Filter.UUID);
		Если НЕ ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
			Возврат HttpВернутьОшибку(424, "Не найдена ссылка в справочнике """ + ПараметрыPOST.CatalogName + """ с заданным идентификатором");
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + ?(ПервоеУсловие, " ", " И ") + "Таблица.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	КонецЕсли;

	Попытка
		ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Исключение
		Возврат HttpВернутьОшибку(424, "Не удалось выполнить запрос");
	КонецПопытки;		
		
	ТаблицаРезультат.Колонки.Добавить("UUID", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	
	Для каждого Строка из ТаблицаРезультат Цикл
		Строка.UUID = XMLСтрока(Строка.Ссылка);
	КонецЦикла;
	
	ТаблицаРезультат.Колонки.Удалить("Ссылка");
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.ТPJSON(ТаблицаРезультат));
	
КонецФункции

Функция exchange_changeStatus(ПараметрыPOST) //+ ---> Лико m.shenderov 05.02.2024
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "status,uuids");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли; 
	Для каждого uuid Из ПараметрыPOST.uuids Цикл
		
	РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.ИзменитьСтатус(uuid,ПараметрыPOST.status);		
	КонецЦикла;

	
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(ПараметрыPOST.uuids));
	
КонецФункции

Функция TouchPad_SetColor301023(ПараметрыPOST) 	 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "TPID,ЗаказНомер,КлючСтроки,ШтрихКод");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	TPID = ПараметрыPOST.TPID;
	РабочееМесто=Справочники.Лико_РабочиеМеста.НайтиПоКоду(TPID);
	ЗаказНомер = ПараметрыPOST.ЗаказНомер;
	КлючСтроки = Новый УникальныйИдентификатор(ПараметрыPOST.КлючСтроки);
	ШтрихКод = ПараметрыPOST.ШтрихКод;
	ЦеноваяГруппа=Неопределено;
	Номенклатура=Неопределено;
	
	СтруктураШК=Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(ШтрихКод);
	Если СтруктураШК.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий Тогда 
		ОбъектНоменклатуры=СтруктураШК.ОбъектНоменклатуры ;
		ЦеноваяГруппа=ОбъектНоменклатуры.Номенклатура.ЦеноваяГруппа;
		Номенклатура=ОбъектНоменклатуры.Номенклатура;
	КонецЕсли;
	
	
	
	ЗаказКлиента=Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаЦвета.КлючСтроки КАК КлючСтроки,
	|	ЗаказКлиентаЦвета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.КлючСтроки = &КлючСтроки
	|	И ЗаказКлиентаЦвета.Ссылка.Номер = &Номер";
	Запрос.УстановитьПараметр("КлючСтроки",КлючСтроки );
	Запрос.УстановитьПараметр("Номер",ЗаказНомер );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказКлиента=Выборка.Ссылка;
	КонецЦикла; 
	
	ready=Ложь;	
	
	Если ЗначениеЗаполнено(ЗаказКлиента) И ЗначениеЗаполнено(ЦеноваяГруппа) Тогда
		УстановитьПривилегированныйРежим(Истина);	
		ДокОбъект=ЗаказКлиента.ПолучитьОбъект();
		//ДокОбъект=Документы.ЗаказКлиента.СоздатьДокумент();
		ДокОбъект.ОбменДанными.Загрузка=Истина;
		НайденныеСтроки=ДокОбъект.Цвета.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтроки));
		Для каждого СтрТЗ Из НайденныеСтроки Цикл
			СтрТЗ.ТипКраски=ЦеноваяГруппа;
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				   СтрТЗ.Номенклатура= Номенклатура;
				   СтрТЗ.УтвердилОператор=Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(ПараметрыPOST.UserNumber,ДокОбъект.ДатаУтвержденияОператором); 			КонецЕсли;
		КонецЦикла;
		Если ПараметрыPOST.Свойство("UserNumber") Тогда 
			
		//ДокОбъект.ДатаУтвержденияОператором=ТекущаяДата();
		//ДокОбъект.УтвердилОператор=Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(ПараметрыPOST.UserNumber,ДокОбъект.ДатаУтвержденияОператором);
			
		КонецЕсли;
			
		ДокОбъект.Записать();		
		ready=Истина;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ready", ready);
	
	
	
	Возврат HttpВернутьСтруктуруКакJSON(Структура);
	
	
	
КонецФункции 

Функция ZPTable(ПараметрыPOST)
	
	УстановитьПривилегированныйРежим(Истина);
	// Проверка необходимых параметров и возврат сообщения об ошибке
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "UserNumber, PIN");
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	ТабНомер = ПараметрыPOST.UserNumber;
	ПинКод = ПараметрыPOST.PIN;
	
	текТекстОшибки 	= "";
	Попытка
		текПинКод = Число(ПинКод);
	Исключение
		текТекстОшибки = текТекстОшибки + "Введен не верный Пин-код!" + Символы.ПС;
		Возврат HttpВернутьОшибку(400, текТекстОшибки);
	КонецПопытки;
	
	текТабличныйДокумент = Новый ТабличныйДокумент;
	// Получить сведения из ЗУП
	Структура = Новый Структура;
	Структура.Вставить("ProcName",			"EmployeeDevelopment");
	Структура.Вставить("PersonnelNumbers",	ТабНомер);
	Структура.Вставить("PinCode",			текПинКод);
	
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура,НастройкиСериализациииJSON); 	
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	
	Попытка
		СоединениеHTTP = Новый HTTPСоединение("it-mshenderov",,"UserApi","Hvanadalshnukur2119");
	Исключение
		Возврат HttpВернутьОшибку(400, "");
	КонецПопытки;  	
	HTTPЗапрос = Новый HTTPЗапрос("1CZUP3/hs/LikoRest");
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Попытка
		HTTPОтвет = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
	Исключение
		Возврат HttpВернутьОшибку(400, ОписаниеОшибки());
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния = 401 И ТипЗнч(Ответ) = Тип("Строка") И Найти(Ответ,"Введен не верный Пин") <> 0 Тогда
		текТекстОшибки = "Введен не верный Пин-код!"; 
		Возврат HttpВернутьОшибку(400, текТекстОшибки);
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON; 	
	ЧтениеJSON.УстановитьСтроку(Ответ);	
	Данные = ПрочитатьJSON(ЧтениеJSON,,,ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	
	ТЗ = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Данные);
	
	ОбъектВозврата = ТЗ;	
	
	текТЗ 	= ОбъектВозврата;
	текДата = ТекущаяДата();
	Если текТЗ.Количество() > 0  Тогда
		//Получение данных из Полученной таблицы из ЗУП
		текМассивТЗ = Новый Массив;
		Для текНомер = 1 По 4 Цикл
			текОтбор = Новый Структура();
			текОтбор.Вставить("НомерТаблицы", текНомер);
			текМассивТЗ.Добавить(текТЗ.НайтиСтроки(текОтбор));
		КонецЦикла;
		текМассивРезультатов = текМассивТЗ;
		//Заполнение Табличного документа 
		текТабДок = Новый ТабличныйДокумент;
		
		текОбработкаСсылка =  Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "Лико_ДляПечатников");
		ХранилищеОбработки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текОбработкаСсылка, "ХранилищеОбработки");
		ДвоичныеДанные     = ХранилищеОбработки.Получить();
		АдресХранилища     = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		ИмяВнОбработки     = ВнешниеОбработки.Подключить(АдресХранилища, , Ложь);
		ОбработкаОбъект    = ВнешниеОбработки.Создать(ИмяВнОбработки);
		
		текМакет              = ОбработкаОбъект.ПолучитьМакет("МакетВыработкиСотрудников");
		текОбласть = текМакет.ПолучитьОбласть("ОбластьПараметрыПечати");
		текОбласть.Параметры.ДатаДень 		= Формат(текДата, "ДЛФ=D");
		текОбласть.Параметры.ДатаВремя		= Формат(текДата, "ДЛФ=T");
		текТабДок.Вывести(текОбласть);		//Выведена шапка
		
		//Заполнение Табличного документа по 1му пакету запроса
		текОбласть = текМакет.ПолучитьОбласть("Лико_Сделка");
		
		//УстановитьПривилегированныйРежим(Истина);
		
		//УстановитьПривилегированныйРежим(Ложь);	
		Если текМассивРезультатов[0].Количество() > 0  Тогда
			//заполнение параметров области из строки табличной части
			текОбласть.Параметры.Заполнить(текМассивРезультатов[0][0]);
			//Корректировка вывода % Премии
			текПрПремии = текОбласть.Параметры.ПроцентПремии;
			текОбласть.Параметры.ПроцентПремии = ?(ЗначениеЗаполнено(текПрПремии), Строка(текПрПремии * 100) + " %", "");
			//вывод сформированной области в табличный документ
			текТабДок.Вывести(текОбласть);			
		КонецЕсли;
		//Заполнение Табличного документа по 2му пакету запроса
		ЗаполнитьТаблицуМакетаЗП("Лико_ВыработкаПечатников", 1, текМакет, текТабДок, текМассивРезультатов[1]);
		//Заполнение Табличного документа по 3му пакету запроса
		ЗаполнитьТаблицуМакетаЗП("Лико_ВыработкаПеремотчиков", 2, текМакет, текТабДок,текМассивРезультатов[2]);
		
		ЗаполнитьТаблицуМакетаЗП("Лико_Депремирование", 3, текМакет, текТабДок,текМассивРезультатов[3]);
		
		текТабличныйДокумент = текТабДок;
	Иначе
		//Если документ не найден то завершаем процедуру
		текТекстОшибки = "По сотруднику " + ТабНомер + " записи не найдены!";
		Возврат HttpВернутьОшибку(400, текТекстОшибки);
	КонецЕсли;  
	//Установка параметров печати
	текТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	текТабличныйДокумент.ПолеСлева 		= 0;
	текТабличныйДокумент.ПолеСправа 	= 0;
	текТабличныйДокумент.ПолеСнизу 		= 0;
	текТабличныйДокумент.ПолеСверху 	= 0;
	текТабличныйДокумент.РазмерСтраницы = "Custom";
	текТабличныйДокумент.ШиринаСтраницы = 77;
	// С ITs в конец Таб Док добавляем картинку и узнаём её высоту, так получаем высоту Таб Док
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(текТабличныйДокумент);
	Надпись = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);    
	Надпись.Расположить(ТабличныйДокумент.Область(1,1,ТабличныйДокумент.ВысотаТаблицы,1));    
	текВысота = Цел(Надпись.Высота) + 3;
	текТабличныйДокумент.ВысотаСтраницы = текВысота;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
	текТабличныйДокумент.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.PDF); 
	
	ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
	Base64 = Base64Строка(ДвДанные); 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Content", Base64);
	Возврат HttpВернутьСтруктуруКакJSON(СтруктураВозврата);
	
КонецФункции

Процедура ЗаполнитьТаблицуМакетаЗП(пИмяТаблицы, пНомерПакета, текМакет, текТабДок, текМассивРезультатов)
	
	//Таблица по сотруднику пуста
	Если текМассивРезультатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Заполнение Табличного документа по пакету запроса
	текОбласть = текМакет.ПолучитьОбласть(пИмяТаблицы + "_Шапка");
	текТабДок.Вывести(текОбласть);		//Выведена шапка таблицы 
	
	текОбласть = текМакет.ПолучитьОбласть(пИмяТаблицы + "_Строка");
	Для каждого текЭллемент из текМассивРезультатов Цикл
		//заполнение параметров области из строки табличной части
		текОбласть.Параметры.Заполнить(текЭллемент);
		Если пНомерПакета = 1 Тогда
			Если текЭллемент.КоэффПерем <> "" И текЭллемент.КоэффПерем <> "0" Тогда 
				текОбласть.Параметры.ДатаРаботы = текЭллемент.КоэффПерем;
			Иначе 
				текОбласть.Параметры.ДатаРаботы = Формат(ПрочитатьДатуJSON(текЭллемент.ДатаРаботы, ФорматДатыJSON.ISO), "ДЛФ=D");
			КонецЕсли;
		КонецЕсли;
		//вывод сформированной области в табличный документ
		текТабДок.Вывести(текОбласть);			
	КонецЦикла;
	
КонецПроцедуры


#Область КартыПерерасхода


Функция ListOverspendingMaps(ПараметрыPOST) 

	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "Subject");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	РабочееМесто = Справочники.Лико_РабочиеМеста.НайтиПоНаименованию(ПараметрыPOST.Subject);
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		Возврат HttpВернутьОшибку(424, "Не найдено рабочее место");
	КонецЕсли; 
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("Номер");
	МассивРеквизитов.Добавить("Заказ");
	МассивРеквизитов.Добавить("НомерБланка");
	МассивРеквизитов.Добавить("Оператор");
	МассивРеквизитов.Добавить("Материал");
	МассивРеквизитов.Добавить("КоличествоЗаявлено");
	МассивРеквизитов.Добавить("КоличествоПодтверждено");
	МассивРеквизитов.Добавить("Причина");
	МассивРеквизитов.Добавить("Состояние");
	МассивРеквизитов.Добавить("НомерПроката"); 
	МассивРеквизитов.Добавить("Статус");
	МассивРеквизитов.Добавить("РабочийЦентр");
	
	МассивРеквизитовТолькоПросмотр = Новый Массив();
	МассивРеквизитовТолькоПросмотр.Добавить("Заказ");
	МассивРеквизитовТолькоПросмотр.Добавить("НомерБланка");
	МассивРеквизитовТолькоПросмотр.Добавить("Оператор");
	МассивРеквизитовТолькоПросмотр.Добавить("Состояние");
	МассивРеквизитовТолькоПросмотр.Добавить("НомерПроката"); 
	МассивРеквизитовТолькоПросмотр.Добавить("РабочийЦентр");
	МассивРеквизитовТолькоПросмотр.Добавить("КоличествоПодтверждено");
	
	МассивРеквизитовПроверкаЗаполнения = Новый Массив();
	МассивРеквизитовПроверкаЗаполнения.Добавить("Заказ");
	МассивРеквизитовПроверкаЗаполнения.Добавить("НомерБланка");
	МассивРеквизитовПроверкаЗаполнения.Добавить("Оператор");
	МассивРеквизитовПроверкаЗаполнения.Добавить("КоличествоПодтверждено");
	
	МассивРеквизитовПроверкаЗаполнения.Добавить("Причина");
	МассивРеквизитовПроверкаЗаполнения.Добавить("Состояние");
	МассивРеквизитовПроверкаЗаполнения.Добавить("НомерПроката"); 
	МассивРеквизитовПроверкаЗаполнения.Добавить("Статус");
	МассивРеквизитовПроверкаЗаполнения.Добавить("РабочийЦентр");
	
	
	
	КартыПерерасхода = Документы.Лико_КартаПерерасхода.КартыПерерасходаПоРабочемуЦентру(РабочееМесто.ТСРабочийЦентр);
	МассивКарт =  Документы.Лико_КартаПерерасхода.КартыПерерасходаВМассив(КартыПерерасхода, МассивРеквизитов, МассивРеквизитовТолькоПросмотр, МассивРеквизитовПроверкаЗаполнения); 
	
	
	
	
		
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(МассивКарт));
	
КонецФункции

Функция NewOverspendingMap(ПараметрыPOST)

	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "Subject");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли;
	
	РабочееМесто = Справочники.Лико_РабочиеМеста.НайтиПоНаименованию(ПараметрыPOST.Subject);
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		Возврат HttpВернутьОшибку(424, "Не найдено рабочее место");
	КонецЕсли; 
	
	 ДанныеПоРабочемуЦентру = РегистрыСведений.ТСИсторияРабочегоСтолаОператора.ТекущиеДанныеПоРЦ(РабочееМесто.ТСРабочийЦентр);
	 
	 НовыйДокОбъект = Документы.Лико_КартаПерерасхода.СоздатьДокумент();
	 НовыйДокОбъект.Заполнить(ДанныеПоРабочемуЦентру);
	 
	 МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("Заказ");
	МассивРеквизитов.Добавить("НомерБланка");
	МассивРеквизитов.Добавить("Оператор");
	МассивРеквизитов.Добавить("Материал");
	МассивРеквизитов.Добавить("КоличествоЗаявлено");
	МассивРеквизитов.Добавить("Причина");
	//МассивРеквизитов.Добавить("Состояние");
	МассивРеквизитов.Добавить("НомерПроката"); 
	МассивРеквизитов.Добавить("Статус");
	МассивРеквизитов.Добавить("РабочийЦентр");
	
	МассивРеквизитовТолькоПросмотр = Новый Массив();
	МассивРеквизитовТолькоПросмотр.Добавить("Заказ");
	МассивРеквизитовТолькоПросмотр.Добавить("НомерБланка");
	МассивРеквизитовТолькоПросмотр.Добавить("Оператор");
	//МассивРеквизитовТолькоПросмотр.Добавить("Состояние");
	МассивРеквизитовТолькоПросмотр.Добавить("НомерПроката"); 
	МассивРеквизитовТолькоПросмотр.Добавить("РабочийЦентр");

	МассивРеквизитовПроверкаЗаполнения = Новый Массив();
	МассивРеквизитовПроверкаЗаполнения.Добавить("Заказ");
	МассивРеквизитовПроверкаЗаполнения.Добавить("НомерБланка");
	МассивРеквизитовПроверкаЗаполнения.Добавить("Оператор");
	
	
	МассивРеквизитовПроверкаЗаполнения.Добавить("Причина");
	//МассивРеквизитовПроверкаЗаполнения.Добавить("Состояние");
	МассивРеквизитовПроверкаЗаполнения.Добавить("НомерПроката"); 
	МассивРеквизитовПроверкаЗаполнения.Добавить("Статус");
	МассивРеквизитовПроверкаЗаполнения.Добавить("РабочийЦентр");

	 
	Карта =  Документы.Лико_КартаПерерасхода.КартаПерерасходаВСтруктуру(НовыйДокОбъект
	, МассивРеквизитов
	, МассивРеквизитовТолькоПросмотр
	, МассивРеквизитовПроверкаЗаполнения);
		
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(Карта));
	
КонецФункции

Функция CreateOverspendingMap(ПараметрыPOST)
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "Subject, Заказ, ЗаказДата , НомерБланка, НомерПроката, Статус, Причина, Оператор");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		
		Возврат	ОшибкаВПараметрах;
		
	КонецЕсли;	
	
	РабочееМесто = Справочники.Лико_РабочиеМеста.НайтиПоНаименованию(ПараметрыPOST.Subject); 
	
	ДатаЗаказа= Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПараметрыPOST.ЗаказДата,"T",""),":",""),"-",""));
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Дата", ТекущаяДата());
	Параметры.Вставить("Заказ", Документы.ЗаказКлиента.НайтиПоНомеру(ПараметрыPOST.Заказ,ДатаЗаказа)); 
	Параметры.Вставить("НомерБланка",ПараметрыPOST.НомерБланка);
	Параметры.Вставить("НомерПроката",ПараметрыPOST.НомерПроката);
	Параметры.Вставить("Причина",ПараметрыPOST.Причина);
	Параметры.Вставить("Статус",Перечисления.ТССтатусыЗаказов[ПараметрыPOST.Статус]); 	
	Параметры.Вставить("КоличествоЗаявлено",?(ПараметрыPOST.Свойство("КоличествоЗаявлено"),ПараметрыPOST.КоличествоЗаявлено,0));
	Параметры.Вставить("КоличествоПодтверждено",?(ПараметрыPOST.Свойство("КоличествоПодтверждено"),ПараметрыPOST.КоличествоЗаявлено,0));	
	Параметры.Вставить("Материал",?(ПараметрыPOST.Свойство("Материал"),Справочники.Номенклатура.НайтиПоКоду(ПараметрыPOST.Материал),Неопределено));
	Параметры.Вставить("Оператор",Справочники.ФизическиеЛица.НайтиПоНаименованию(ПараметрыPOST.Оператор));	
	Параметры.Вставить("РабочийЦентр",РабочееМесто.ТСРабочийЦентр);
	
	
	
	
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		
		Возврат HttpВернутьОшибку(424, "Не найдено рабочее место");
		
	КонецЕсли; 	
	
	ДокОбъект = Документы.Лико_КартаПерерасхода.СоздатьДокумент(); 
	ДокОбъект.Заполнить(Параметры);
	
	Если Не ДокОбъект.ПроверитьЗаполнение() Тогда
		
		МассивОшибок = ПолучитьСообщенияПользователю();
		МассивОшибок = УдалениеДублейВМассивеОшибок(МассивОшибок);	
		ТекстСообщений ="";
		
		Для каждого ОШ Из МассивОшибок Цикл
			
			ТекстСообщений= ТекстСообщений+ОШ;	
			
		КонецЦикла;
		
		Ошибка =  СтрШаблон(
		НСтр("ru = 'Не удалось создать карту перерасхода по заказу: %1
		|%2'"),
		ПараметрыPOST.Заказ,
		ТекстСообщений
		);
		Результат = Новый Структура;		
		Результат.Вставить("status", "error");
		Результат.Вставить("error", Ошибка);
		
	Иначе
		
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
        Результат = Новый Структура;		
		Результат.Вставить("status", "success");
		Результат.Вставить("message", "Карта перерасхода успешно создана");
		Результат.Вставить("documentNumber", ДокОбъект.Номер);
		Результат.Вставить("documentDate", ДокОбъект.Дата);			
		
	Исключение
		
		МассивОшибок = ПолучитьСообщенияПользователю();
		МассивОшибок = УдалениеДублейВМассивеОшибок(МассивОшибок);		
				
		ТекстСообщений ="";
		
		Для каждого ОШ Из МассивОшибок Цикл
			
			ТекстСообщений= ТекстСообщений+ОШ;	
			
		КонецЦикла;
		
		Ошибка =  СтрШаблон(
		НСтр("ru = 'Не удалось создать карту перерасхода по заказу: %1
		|%2'"),
		ПараметрыPOST.Заказ,
		ТекстСообщений
		);
		Результат = Новый Структура;		
		Результат.Вставить("status", "error");
		Результат.Вставить("error", Ошибка);
		
		КонецПопытки;	
				
	КонецЕсли;	
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(Результат));
	
КонецФункции


#КонецОбласти


Функция UpdateAppFileInfo(ПараметрыPOST) 
	
	ОшибкаВПараметрах = ПроверитьОбязательныеПараметры(ПараметрыPOST, "Артикул");
	
	Если ОшибкаВПараметрах <> 0 Тогда
		Возврат	ОшибкаВПараметрах;
	КонецЕсли; 
	  ФайлСогласования=Неопределено;
	  Согласовано = Неопределено;
	  Артикул = ПараметрыPOST.Артикул;
	  Если  ПараметрыPOST.Свойство("ФайлСогласования") Тогда
		     ФайлСогласования =  ПараметрыPOST.ФайлСогласования;
		 КонецЕсли; 
		 
		   Если  ПараметрыPOST.Свойство("Согласовано") Тогда
		     Согласовано =  ПараметрыPOST.Согласовано;
		 КонецЕсли; 
		 
		ВерсияНоменклатуры = Справочники.Лико_ВерсииНоменклатуры.НайтиПоРеквизиту("Артикул",Артикул);
		Структура = Новый Структура;
		Структура.Вставить("Результат",Ложь);
		Структура.Вставить("ОписаниеОшибки","Не найден артикул");
		
		Если ЗначениеЗаполнено( ВерсияНоменклатуры) Тогда
			СпроОбъект = ВерсияНоменклатуры.ПолучитьОбъект();
			Если ФайлСогласования<> Неопределено Тогда
			СпроОбъект.ФайлСогласования = ФайлСогласования=1; 
		КонецЕсли;
		
		Если Согласовано<>Неопределено Тогда
			СпроОбъект.Согласовано = 	Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(Согласовано,"T",""),":",""),"-",""));
;
		КонецЕсли;
		
        СпроОбъект.Записать();
		
		Структура.Результат= Истина;
		Структура.ОписаниеОшибки = "";
		
		КонецЕсли;
	
	  
	
	
	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(Структура));
	
КонецФункции

#КонецОбласти



#Область Вспомогательные_функции

Функция ПолучитьДвоичныеДанныеОригиналМакета(ОМ,ИдентификаторФайла) //+Лико m.shenderov 22.04.2022
	
	
	ПараметрыСоединения =   Лико_Планирование.УстановитьСоединениеССервером("db-sql3","1cimage");
	Подключение = ПараметрыСоединения.ADOConnection;
	
	Если Подключение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Файл = Неопределено;
	ИмяТаблицы = "FileStore";
	Замещать = Истина;
	
	ИДСсылки = ЗначениеВСтрокуВнутр(ОМ);
	ИДСсылкиМакета = ЗначениеВСтрокуВнутр(ИдентификаторФайла);
	
	
	Stream = Новый COMОбъект("ADODB.Stream");
	Stream.Type = 1;
	Stream.Open();
	
	RecordSet = Новый COMОбъект("ADODB.RecordSet");
	RecordSet.CursorLocation = 3;
	RecordSet.LockType = 2;
	
	//Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUID = '" + ИДСсылки + "' AND GUIDMaket  = '" + ИДСсылкиМакета + "'";
	Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUIDOM = '" + ИДСсылки + "' AND GUIDRow  = '" + ИДСсылкиМакета + "'";
	
	RecordSet.Open(Запрос,Подключение);
	
	
	Если RecordSet.RecordCount > 0 Тогда
		//Попытка
		RecordSet.MoveFirst();
		Stream.Write(RecordSet.Fields("Data").Value);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Stream.SaveToFile(ИмяВременногоФайла);
		
		Stream.Close();
		RecordSet.Close();
		Файл = Новый ДвоичныеДанные(ИмяВременногоФайла);
		Если Файл<> Неопределено Тогда
			//Попытка			
			Возврат Файл;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 22.04.2022 


Функция ПолучитьНоменклатуруПоАртикулу(ProductArticle,ProductType)//+Лико m.shenderov 06.05.2021
	
	Структура = Новый Структура;
	Структура.Вставить("result",0);
	Структура.Вставить("ProductCode","");
	Структура.Вставить("ProductName","");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Наименование КАК ProductName
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &ProductArticle
	|	И Номенклатура.Лико_ТипЭтикетки= &ProductType";
	Запрос.УстановитьПараметр("ProductArticle",ProductArticle );
	Запрос.УстановитьПараметр("ProductType",Перечисления.Лико_ТипыЭтикеток.Получить(Число(ProductType)-1) );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество()<>1 Тогда
		Возврат Структура;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Структура.result=1;
		Структура.ProductCode=Строка(Выборка.Ссылка.УникальныйИдентификатор());
		Структура.ProductName=Выборка.ProductName;
		Возврат Структура;
		
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 06.05.2021 


Функция ПолучитьЗаказыПоЧастиНомера(query)//+Лико m.shenderov 06.05.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Номер КАК DocNum,
	|	ЗаказКлиента.Дата КАК DocDate,
	|	ЗаказКлиента.Партнер.Наименование КАК ClientName
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Номер ПОДОБНО &query
	|	И ГОД(ЗаказКлиента.Дата) > 2021";
	Запрос.УстановитьПараметр("query","%"+query+"%");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
	
	
	
КонецФункции //-Лико m.shenderov 06.05.2021 


#Область wms


// WMS-прокси — делегируют в Лико_WMS_Сервер
//+Лико m.shenderov 17.07.2026

Функция WMS_CheckConnection(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_CheckConnection(ПараметрыPOST);
КонецФункции

Функция WMS_GetWarehouses(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_GetWarehouses(ПараметрыPOST);
КонецФункции

Функция WMS_GetRacks(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_GetRacks(ПараметрыPOST);
КонецФункции

Функция WMS_GetOccupancy(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_GetOccupancy(ПараметрыPOST);
КонецФункции

Функция WMS_GetFloor(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_GetFloor(ПараметрыPOST);
КонецФункции

Функция WMS_FindCell(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_FindCell(ПараметрыPOST);
КонецФункции

Функция WMS_ValidatePlacement(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_ValidatePlacement(ПараметрыPOST);
КонецФункции

Функция WMS_MovePallet(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_MovePallet(ПараметрыPOST);
КонецФункции

Функция WMS_ExportSnapshot(ПараметрыPOST)
	Возврат Лико_WMS_Сервер.WMS_ExportSnapshot(ПараметрыPOST);
КонецФункции




#КонецОбласти


Функция HttpВернутьТзКакJSON(ТЗ)
	
	МассивВозврата = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
	
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, МассивВозврата, НастройкиСериализациииJSON); 	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8"); 	
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
	
КонецФункции

Функция HttpВернутьСтруктуруКакJSON(Структура)
	
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализациииJSON); 	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8"); 	
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
	
КонецФункции

// Проверка наличия набора параметров в POST-запросе и возврат сообщения об ошибке
Функция ПроверитьОбязательныеПараметры(Структура, ПараметрыОднойСтрокойЧерезЗапятую)
	МассивПараметров = СтрРазделить(ПараметрыОднойСтрокойЧерезЗапятую, ",", Ложь);
	МассивОтсутствующихПараметров = Новый Массив;
	
	Для Каждого Параметр Из МассивПараметров Цикл
		Параметр = СокрЛП(Параметр);
		Если Не ЕстьСвойство(Структура, Параметр) Тогда
			МассивОтсутствующихПараметров.Добавить(Параметр)
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОтсутствующихПараметров.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		СообщениеОбОшибке = "Необходимо передать следующие обязательные параметры: ";
		
		Первый = Истина;
		Для Каждого Параметр Из МассивОтсутствующихПараметров Цикл
			Если Не Первый Тогда
				СообщениеОбОшибке = СообщениеОбОшибке + ", ";
			КонецЕсли;
			СообщениеОбОшибке = СообщениеОбОшибке + "'" + Параметр + "'";
			Первый = Ложь;
		КонецЦикла;
		
		Возврат HttpВернутьОшибку(400, СообщениеОбОшибке);
	КонецЕсли
	
КонецФункции

// Проверка наличия параметра в POST-запросе
Функция ЕстьСвойство(Структура, Свойство)
	Возврат Структура.Свойство(Свойство);
КонецФункции

// Вызов метода имя которого передано через 
// параметр (POST-запроса) ProcName
Функция ВызовМетода(Метод, Параметры)
	Попытка
		// код, приводящий к вызову исключения
		Возврат Вычислить(Метод+"(Параметры)");
		
	Исключение
		// Запись события в журнал регистрации для системного администратора.
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Liko_Rest: ВызовМетода'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат HttpВернутьОшибку(405, "Метод '" + Метод + "' не определен");
	КонецПопытки;
КонецФункции

// Возврат web-клиенту ответа с сообщением об ошибке
Функция HttpВернутьОшибку(КодОшибки, Сообщение)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("message");
	ЗаписьJSON.ЗаписатьЗначение(Сообщение);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(КодОшибки);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8"); 	
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции

Функция НайтиДокумент(ДокументИмя, Номер, Дата) //+Лико m.shenderov 18.09.2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ."+ДокументИмя+" КАК Док
	|ГДЕ
	|	Док.Номер = &Номер
	|	И Док.Дата = &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Док.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК Док
	|ГДЕ
	|	Док.Номер = &Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Вт.Ссылка КАК Ссылка
	|ИЗ
	|	Вт КАК Вт";
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("Дата",Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат  Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 18.09.2019 

Функция ПолучитьПользователя(UserOS) //+Лико m.shenderov 26.09.2019
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи.ДополнительныеРеквизиты КАК Пользователи
	|ГДЕ
	|	Пользователи.Значение = &Значение
	|	И Пользователи.Свойство.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя","Лико_СертификатSSL");
	Запрос.УстановитьПараметр("Значение",UserOS);
	РезультатЗапроса = Запрос.Выполнить();	
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;
		
	КонецЦикла; 
	
КонецФункции //-Лико m.shenderov 26.09.2019 

Функция ПолучитьДоступныеОтчеты(Пользователь) //+Лико m.shenderov 26.09.2019
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Лико_ДоступКОтчетамНаСайте.Отчет КАК Отчет,
	|	ВЫБОР
	|		КОГДА Лико_ДоступКОтчетамНаСайте.Тип = """"
	|			ТОГДА ""HTML5""
	|		ИНАЧЕ Лико_ДоступКОтчетамНаСайте.Тип
	|	КОНЕЦ КАК type
	|ПОМЕСТИТЬ ВтОтчеты
	|ИЗ
	|	РегистрСведений.Лико_ДоступКОтчетамНаСайте КАК Лико_ДоступКОтчетамНаСайте
	|ГДЕ
	|	Лико_ДоступКОтчетамНаСайте.Пользователь = &Пользователь
	|	И Лико_ДоступКОтчетамНаСайте.Показывать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыОтчетовРазмещение.Ссылка.КлючВарианта КАК ReportKey,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетовРазмещение.Ссылка.Лико_НаименованиеДляСайта = """"
	|			ТОГДА ВариантыОтчетовРазмещение.Ссылка.Наименование
	|		ИНАЧЕ ВариантыОтчетовРазмещение.Ссылка.Лико_НаименованиеДляСайта
	|	КОНЕЦ КАК ReportName,
	|	ВариантыОтчетовРазмещение.Ссылка.Наименование КАК ReportNameId,
	|	ВариантыОтчетовРазмещение.Подсистема.Синоним КАК ReportGroup,
	|	ВариантыОтчетовРазмещение.Ссылка КАК Ref,
	|	""PDF"" КАК Type
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Справочник.ВариантыОтчетов.Размещение КАК ВариантыОтчетовРазмещение
	|ГДЕ
	|	ВариантыОтчетовРазмещение.Ссылка.Лико_ДляСайта
	|	И ВариантыОтчетовРазмещение.Использование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ПредопределенныеВариантыОтчетовРазмещение.Ссылка.КлючВарианта,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.Лико_НаименованиеДляСайта = """"
	|			ТОГДА ВариантыОтчетов.Наименование
	|		ИНАЧЕ ВариантыОтчетов.Лико_НаименованиеДляСайта
	|	КОНЕЦ,
	|	ВариантыОтчетов.Наименование,
	|	ПредопределенныеВариантыОтчетовРазмещение.Подсистема.Синоним,
	|	ПредопределенныеВариантыОтчетовРазмещение.Ссылка,
	|	""PDF""
	|ИЗ
	|	Справочник.ПредопределенныеВариантыОтчетов.Размещение КАК ПредопределенныеВариантыОтчетовРазмещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|		ПО ПредопределенныеВариантыОтчетовРазмещение.Ссылка = ВариантыОтчетов.ПредопределенныйВариант
	|ГДЕ
	|	ВариантыОтчетов.Лико_ДляСайта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ПредопределенныеВариантыОтчетовРасширенийРазмещение.Ссылка.КлючВарианта,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.Лико_НаименованиеДляСайта = """"
	|			ТОГДА ВариантыОтчетов.Наименование
	|		ИНАЧЕ ВариантыОтчетов.Лико_НаименованиеДляСайта
	|	КОНЕЦ,
	|	ВариантыОтчетов.Наименование,
	|	ПредопределенныеВариантыОтчетовРасширенийРазмещение.Подсистема.Синоним,
	|	ПредопределенныеВариантыОтчетовРасширенийРазмещение.Ссылка,
	|	""PDF""
	|ИЗ
	|	Справочник.ПредопределенныеВариантыОтчетовРасширений.Размещение КАК ПредопределенныеВариантыОтчетовРасширенийРазмещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|		ПО ПредопределенныеВариантыОтчетовРасширенийРазмещение.Ссылка = ВариантыОтчетов.ПредопределенныйВариант
	|ГДЕ
	|	ВариантыОтчетов.Лико_ДляСайта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.ReportKey КАК ReportKey,
	|	ВременнаяТаблица.ReportName КАК ReportName,
	|	ВременнаяТаблица.ReportNameId КАК ReportId,
	|	ВременнаяТаблица.ReportGroup КАК ReportGroup,
	|	ВтОтчеты.type КАК Type
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОтчеты КАК ВтОтчеты
	|		ПО ВременнаяТаблица.Ref = ВтОтчеты.Отчет
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.Пустаяссылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕ ВтОтчеты.Отчет ЕСТЬ NULL
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции //-Лико m.shenderov 26.09.2019 

Процедура ПолучитьТабличныйДокументВариантаОтчета(КлючВариантаОтчета, НаименованиеОтчета, ТабДок,DateStart=Неопределено, DateEnd=Неопределено,User,Report=Неопределено,ДопПараметры)
	УстановитьПривилегированныйРежим(Истина); 
	Если ДопПараметры=Неопределено ТОгда
		ДопПараметры= Новый Структура;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыОтчетовРазмещение.Ссылка.КлючВарианта КАК ReportKey,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетовРазмещение.Ссылка.Лико_НаименованиеДляСайта = """"
	|			ТОГДА ВариантыОтчетовРазмещение.Ссылка.Наименование
	|		ИНАЧЕ ВариантыОтчетовРазмещение.Ссылка.Лико_НаименованиеДляСайта
	|	КОНЕЦ КАК ReportName,
	|	ВариантыОтчетовРазмещение.Подсистема.Синоним КАК ReportGroup,
	|	ВариантыОтчетовРазмещение.Ссылка КАК Ref,
	|	""PDF"" КАК Type
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Справочник.ВариантыОтчетов.Размещение КАК ВариантыОтчетовРазмещение
	|ГДЕ
	|	ВариантыОтчетовРазмещение.Ссылка.Лико_ДляСайта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ПредопределенныеВариантыОтчетовРазмещение.Ссылка.КлючВарианта,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.Лико_НаименованиеДляСайта = """"
	|			ТОГДА ВариантыОтчетов.Наименование
	|		ИНАЧЕ ВариантыОтчетов.Лико_НаименованиеДляСайта
	|	КОНЕЦ,
	|	ПредопределенныеВариантыОтчетовРазмещение.Подсистема.Синоним,
	|	ПредопределенныеВариантыОтчетовРазмещение.Ссылка,
	|	""PDF""
	|ИЗ
	|	Справочник.ПредопределенныеВариантыОтчетов.Размещение КАК ПредопределенныеВариантыОтчетовРазмещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|		ПО ПредопределенныеВариантыОтчетовРазмещение.Ссылка = ВариантыОтчетов.ПредопределенныйВариант
	|ГДЕ
	|	ВариантыОтчетов.Лико_ДляСайта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ПредопределенныеВариантыОтчетовРасширенийРазмещение.Ссылка.КлючВарианта,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.Лико_НаименованиеДляСайта = """"
	|			ТОГДА ВариантыОтчетов.Наименование
	|		ИНАЧЕ ВариантыОтчетов.Лико_НаименованиеДляСайта
	|	КОНЕЦ,
	|	ПредопределенныеВариантыОтчетовРасширенийРазмещение.Подсистема.Синоним,
	|	ПредопределенныеВариантыОтчетовРасширенийРазмещение.Ссылка,
	|	""PDF""
	|ИЗ
	|	Справочник.ПредопределенныеВариантыОтчетовРасширений.Размещение КАК ПредопределенныеВариантыОтчетовРасширенийРазмещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|		ПО ПредопределенныеВариантыОтчетовРасширенийРазмещение.Ссылка = ВариантыОтчетов.ПредопределенныйВариант
	|ГДЕ
	|	ВариантыОтчетов.Лико_ДляСайта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.ReportKey КАК ReportKey,
	|	ВременнаяТаблица.ReportName КАК ReportName,
	|	ВременнаяТаблица.ReportGroup КАК ReportGroup,
	|	ВременнаяТаблица.Type КАК Type,
	|	ВременнаяТаблица.Ref КАК Ref
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|   ВременнаяТаблица.Ref.Наименование = &НаименованиеОтчета
	|	И ВременнаяТаблица.ReportKey = &ReportKey";
	Запрос.УстановитьПараметр("ReportKey",КлючВариантаОтчета);
	Запрос.УстановитьПараметр("НаименованиеОтчета",НаименованиеОтчета);
	
	
	РезультатЗапроса=Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Report=Выборка.Ref;  
		Период=Неопределено;
		Если Выборка.Ref.Лико_УстанавливатьПериодНаСайте Тогда
			Попытка
				Период=Выборка.Ref.Настройки.Получить().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));	
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;
		КонецЕсли;
		
		ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
		ОтборНастройки.ЗагрузитьНастройки(Выборка.Ref.Настройки.Получить());
		
		Структура = Новый Структура;
		Структура.Вставить("СсылкаВарианта",Выборка.Ref); 
		Структура.Вставить("СсылкаОтчета",Выборка.Ref.Отчет);
		Структура.Вставить("КлючВарианта",Выборка.Ref.КлючВарианта);    				  
		Структура.Вставить("СхемаМодифицирована",Истина);
		Структура.Вставить("НастройкиКД",ОтборНастройки.Настройки);
		Структура.Вставить("ПользовательскиеНастройкиКД",ОтборНастройки.ПользовательскиеНастройки);
		Структура.Вставить("Лико_Пользователь",User);
		Структура.Вставить("Лико_ДопПараметры",ДопПараметры);
		
		Если ЗначениеЗаполнено(DateStart) и ЗначениеЗаполнено(DateEnd) Тогда
			Лико_Период = Новый Структура;
			Лико_Период.Вставить("Вариант",ВариантСтандартногоПериода.ПроизвольныйПериод);
			Лико_Период.Вставить("ДатаНачала",DateStart);
			Лико_Период.Вставить("ДатаОкончания",DateEnd);
			
			Структура.Вставить("Лико_Период",Лико_Период); 
			
		ИначеЕсли Период<>Неопределено Тогда
			Попытка
				DateStart=Период.Значение.ДатаНачала;
				DateEnd=Период.Значение.ДатаОкончания;
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;
			
		КонецЕсли;
		
		Отчет1=ВариантыОтчетов.СформироватьОтчет(Структура,Ложь,Ложь);  	
		ТабДок= ОТчет1.ТабличныйДокумент;
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьСписокРолей(Пользователь) //+Лико m.shenderov 27.09.2019
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрофилиГруппДоступаРоли.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Профили
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Роль.Имя В(&Роль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрофилиГруппДоступаРоли.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыДоступа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Группы
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Профиль В
	|			(ВЫБРАТЬ
	|				ВТ_Профили.Ссылка
	|			ИЗ
	|				ВТ_Профили)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступа.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрофилиГруппДоступаРоли.Роль.Имя КАК Роль
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО (ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка)
	|ГДЕ
	|	ГруппыДоступаПользователи.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Группы.Ссылка
	|			ИЗ
	|				ВТ_Группы)
	|	И ГруппыДоступаПользователи.Пользователь = &Пользователь
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрофилиГруппДоступаРоли.Роль.Имя";
	Запрос.УстановитьПараметр("Пользователь",Пользователь );
	Массив = Новый Массив();
	Массив.Добавить("Лико_ДоступКРазделуСайтаПоказатели");
	Массив.Добавить("Лико_ДоступКРазделуСайтаПланированиеРЦ");
	Массив.Добавить("Лико_ДоступКРазделуСайтаСостояниеМашин");
	Массив.Добавить("Лико_ДоступКРазделуСайтаОстакткиСГП");
	Массив.Добавить("Лико_ДоступКРазделуСайтаПродажи");
	Массив.Добавить("Лико_ДоступКРазделуСайтаОтгрузки");
	Массив.Добавить("Лико_ДоступКРазделуСайтаОтчеты");
	Запрос.УстановитьПараметр("Роль",Массив );
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Роль");
	
	
КонецФункции //-Лико m.shenderov 27.09.2019 

Функция ПолучитьДоступныеРазделы(Пользователь) //+Лико m.shenderov 26.09.2019
	УстановитьПривилегированныйРежим(Истина);
	ОтображениеРазделовСайта=УправлениеСвойствами.ЗначениеСвойства(Пользователь,"Лико_ОтображениеРазделовСайта");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ОтображениеРазделовСайтаРазделы.Раздел.Наименование КАК SectionName,
	|	Лико_ОтображениеРазделовСайтаРазделы.Раздел.SectionCode КАК SectionCode
	|ИЗ
	|	Справочник.Лико_ОтображениеРазделовСайта.Разделы КАК Лико_ОтображениеРазделовСайтаРазделы
	|ГДЕ
	|	Лико_ОтображениеРазделовСайтаРазделы.Ссылка = &ОтображениеРазделовСайта";
	
	Запрос.УстановитьПараметр("ОтображениеРазделовСайта",ОтображениеРазделовСайта);
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции //-Лико m.shenderov 26.09.2019 

Процедура СоздатьВерсиюНоменклатураDFM(НоменклатураDFM,ArticleProduct,ArticleNumber,TechnologyNumber,Version)
	СпрОбъект						=Справочники.Лико_ВерсииНоменклатуры.СоздатьЭлемент();
	СпрОбъект.Номенклатура			=НоменклатураDFM;
	СпрОбъект.Артикул				=ArticleNumber; 	
	СпрОбъект.Версия				=Version;	
	СпрОбъект.Технология			=TechnologyNumber;	
	СпрОбъект.АртикулНоменклатуры	=ArticleProduct;
	СпрОбъект.Записать(); 
	
КонецПроцедуры  //-Лико m.shenderov 02.02.2021

Функция НайтиНоменклатуруDFM(Артикул) //+Лико m.shenderov 02.02.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &Артикул
	|	И Номенклатура.Лико_DFM";
	Запрос.УстановитьПараметр("Артикул",Артикул );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 02.02.2021 

Функция НайтиФормулыПантоновПозаказу(НомерЗаказа) //+Лико m.shenderov 06.07.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаЦвета.ФормулаПантона.Код КАК ФормулаПантонаКод
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Ссылка.НомерБезПрефикса = &НомерБезПрефикса
	|	И ЗаказКлиентаЦвета.ФормулаПантона <> ЗНАЧЕНИЕ(Справочник.Лико_ФормулыПантонов.Пустаяссылка)";
	Запрос.УстановитьПараметр("НомерБезПрефикса",НомерЗаказа );
	
	Возврат  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФормулаПантонаКод");
	
	
КонецФункции //-Лико m.shenderov 06.07.2021 


функция ЗакрытиеОбъектовНоменклатурыВЗаказ(Структура) Экспорт //+Лико m.shenderov 08.03.2021
	
	Если ТипЗнч(Структура)<>Тип("Структура") Или 
		Не Структура.Свойство("МассивСерий") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокОбъект=Документы.Лико_БланкЭтапа.СоздатьДокумент();
	ДокОбъект.ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.ЗакрытиеБланка;
	ДокОбъект.РежимЗакрытия=перечисления.Лико_РежимЗакрытияЗаказа.ОставитьНаРабочемЦентре;
	ЗаполнитьЗначенияСвойств(ДокОбъект,Структура);
	ДокОбъект.Дата					  =ТекущаяДата();
	ТзСерии = Новый ТаблицаЗначений;
	ТзСерии.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТзСерии.Колонки.Добавить("КоличествоРасходУУ",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	Для каждого Массив Из Структура.МассивСерий Цикл
		НоваяСтрокаТз=ТзСерии.Добавить();
		НоваяСтрокаТз.Серия=Массив.Серия;
		НоваяСтрокаТз.КоличествоРасходУУ=Массив.Количество;
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТзСерии.Серия КАК Серия,
	|	ТзСерии.КоличествоРасходУУ КАК КоличествоРасходУУ
	|ПОМЕСТИТЬ ВтСерии
	|ИЗ
	|	&ТзСерии КАК ТзСерии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК Списать,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК КоличествоУУ,
	|	ВтСерии.КоличествоРасходУУ / ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК КоличествоРасход,
	|	ВтСерии.КоличествоРасходУУ КАК КоличествоРасходУУ,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Адрес
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВтСерии.Серия КАК Серия
	|				ИЗ
	|					ВтСерии КАК ВтСерии)) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСерии КАК ВтСерии
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтСерии.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтОстатки.Списать КАК Списать,
	|	ВтОстатки.Номенклатура КАК Номенклатура,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Серия КАК Серия,
	|	ВтОстатки.Количество КАК Количество,
	|	ВтОстатки.КоличествоУУ КАК КоличествоУУ,
	|	ВтОстатки.КоличествоРасходУУ КАК КоличествоРасходУУ,
	|	ВтОстатки.КоличествоУУ - ВтОстатки.КоличествоРасходУУ КАК ВозвратКоличествоУУ,
	|	ВтОстатки.Количество - ВтОстатки.КоличествоРасход КАК ВозвратКоличество,
	|	ВтОстатки.КоличествоРасход КАК КоличествоРасход
	|ИЗ
	|	ВтОстатки КАК ВтОстатки";
	Запрос.УстановитьПараметр("ТзСерии",ТзСерии);
	РезультатЗапроса = Запрос.Выполнить();
	ДокОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//Пока Выборка.Следующий() Цикл 		
	//	НоваяСтрТовара					   =ДокОбъект.Товары.Добавить();
	//	НоваяСтрТовара.Номенклатура        =Выборка.Номенклатура;
	//	НоваяСтрТовара.Характеристика      =Выборка.Характеристика;
	//	НоваяСтрТовара.Серия               =Выборка.Серия;                           
	//	НоваяСтрТовара.Упаковка            =Выборка.Упаковка;
	//	НоваяСтрТовара.КоличествоУпаковок  =Выборка.КоличествоУпаковок;
	//	НоваяСтрТовара.Количество          =Выборка.Количество; 
	//	НоваяСтрТовара.АдресХранения       =Выборка.Адрес; 		
	//КонецЦикла; 
	
	
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Возврат "Выполнено успешно!";
	Исключение
		Сообщение=ОписаниеОшибки();
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + ДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки()); 
		Возврат Сообщение;
		
	КонецПопытки;
	
	
	
	
КонецФункции //-Лико m.shenderov 08.03.2021

Функция ПолучитьСотрудникаПоФизЛицуСервер(ФизЛицо) //+Лико m.shenderov 04.01.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Сотрудники.ВАрхиве
	|	И Сотрудники.ФизическоеЛицо = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо",ФизЛицо );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
	
КонецФункции  //-Лико m.shenderov 04.01.2018


Функция УдалениеДублейВМассивеОшибок( МассивОшибок) //+Лико m.shenderov 28.07.2025
	
	Тз=Новый ТаблицаЗначений;
		Тз.Колонки.Добавить("Текст",Новый ОписаниеТипов("Строка", ,
									Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
									
		Для каждого Ошибка Из МассивОшибок Цикл
			
			НоваяОшибка = Тз.Добавить();
			НоваяОшибка.Текст = Ошибка.Текст;
			
		КонецЦикла;
		
		Тз.Свернуть("Текст");
		
		Возврат  Тз.ВыгрузитьКолонку("Текст");

	
КонецФункции //-Лико m.shenderov 28.07.2025 



#КонецОбласти


