#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СписокВыбораУказан") Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияВУчетеВнеоборотныхАктивов.УправленческомИРегламентированномУчетах);
		ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияВУчетеВнеоборотныхАктивов.УправленческомУчете);
		ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияВУчетеВнеоборотныхАктивов.РегламентированномУчете);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
