
&НаСервере
Процедура ПеренестиСпецификациюИзУППНаСервере(КодУПП, НаименованиеУПП)
	Лико_Планирование.ПеренестиСпецификациюИзУППНаСервере(КодУПП, НаименованиеУПП);

КонецПроцедуры


&НаКлиенте
Процедура ПеренестиИзУПП(Команда)
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПеренестиСпецификациюИзУППВыбранКод", ЭтотОбъект),, "Введите код спецификации", 9);	

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСпецификациюИзУППВыбранКод(КодУПП, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(КодУПП) И СтрДлина(КодУПП) = 9 Тогда	
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ПеренестиСпецификациюИзУППВыбраноНаименование", ЭтотОбъект,КодУПП),, "Введите наименование спецификации", 150);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСпецификациюИзУППВыбраноНаименование(НаименованиеУПП, КодУПП) Экспорт
	
	Если ЗначениеЗаполнено(НаименованиеУПП)  Тогда
		 ПеренестиСпецификациюИзУППНаСервере(КодУПП, НаименованиеУПП);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры



