#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсточникСоставаНабораВПроизводстве = Параметры.ИсточникСоставаНабораВПроизводстве;
	
	Элементы.Спецификации.Подсказка = Перечисления.ИсточникиСоставаНаборовВПроизводстве.ПодсказкаПоИсточникуСоставаНаборов(
		Перечисления.ИсточникиСоставаНаборовВПроизводстве.Спецификации);
	Элементы.СпецификацииИлиВариантыКомплектации.Подсказка = Перечисления.ИсточникиСоставаНаборовВПроизводстве.ПодсказкаПоИсточникуСоставаНаборов(
		Перечисления.ИсточникиСоставаНаборовВПроизводстве.СпецификацииИлиВариантыКомплектации);
	Элементы.ВариантыКомплектации.Подсказка = Перечисления.ИсточникиСоставаНаборовВПроизводстве.ПодсказкаПоИсточникуСоставаНаборов(
		Перечисления.ИсточникиСоставаНаборовВПроизводстве.ВариантыКомплектации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ОповеститьОВыборе(ИсточникСоставаНабораВПроизводстве);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

