
&Вместо("ОбработкаПроведения")
Процедура Лико_ОбработкаПроведения(Отказ, РежимПроведения)

	ДополнительныеСвойства.Вставить("ПараметрыЗаполненияВидовЗапасов",  ПараметрыЗаполненияВидовЗапасов());

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	// Регистрация задания к расчету себестоимости.
	РегистрыСведений.ЗаданияКРасчетуСебестоимости.СоздатьЗаписьРегистра(Дата, Ссылка, Организация);

	//+ Лико m.shenderov 19.07.2019
	//ОтразитьЛико_РаспределениеМатериалов(ДополнительныеСвойства, Движения, Отказ);
	//- Лико m.shenderov 19.07.2019   

	РаспределениеПроизводственныхЗатратЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

КонецПроцедуры
