
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РабочийЦентр", РабочийЦентр);
	ЗаполнитьТаблицуКоробок(Параметры.ТекущаяКоробка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКоробок(ТекущаяКоробка = Неопределено)
	
	ТаблицаКоробок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.Лико_ОтчетФормщика.ТекстЗапросаОстаткаКоробокСПризнакомДоступности();
	
	Запрос.УстановитьПараметр("ЗначениеСвойстваПолимер", Справочники.Лико_ПредопределенныеЗначения.ЗначениеСвойстваПолимер.ЗначениеПараметра);
	Запрос.УстановитьПараметр("Ячейка", РабочийЦентр.ЛикоЯчейка);
	Запрос.УстановитьПараметр("РодительОбъектаНоменклатуры", Неопределено);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаКоробок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если НоваяСтрока.ОбъектНоменклатуры = ТекущаяКоробка Тогда
			Элементы.ТаблицаКоробок.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоробокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоробокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоробокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда = Неопределено)
	Если Элементы.ТаблицаКоробок.ТекущиеДанные <> Неопределено Тогда
		//Если ЗначениеЗаполнено(Элементы.ТаблицаКоробок.ТекущиеДанные.ОткрытаяКоробка) Тогда
		//	Сообщить("Есть открытая коробка с видом полимера """ + Элементы.ТаблицаКоробок.ТекущиеДанные.ВидПолимера + """ размером " + Элементы.ТаблицаКоробок.ТекущиеДанные.Длина + "*" + Элементы.ТаблицаКоробок.ТекущиеДанные.Ширина + " (" + Элементы.ТаблицаКоробок.ТекущиеДанные.ОткрытаяКоробка + ")");
		//	Возврат;
		//КонецЕсли;
		ЭтаФорма.Закрыть(Элементы.ТаблицаКоробок.ТекущиеДанные.ОбъектНоменклатуры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоробокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицуКоробок();
КонецПроцедуры
