
&НаСервереБезКонтекста
Процедура Лико_ПечатьЭтикеткиПослеНаСервере(ТабличныйДокумент,СсылкаНаОбъект)
	    ВыводИнформацииПоДокументу(ТабличныйДокумент, СсылкаНаОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПечатьЭтикеткиПосле(Команда)
	
		ОчиститьСообщения();  	
	ВыделенныеСтроки = Элементы.РабочиеЦентры.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрано ни одного рабочего центра.'");
		
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	Для каждого Стр Из ВыделенныеСтроки Цикл
		РЦ= Стр;
		ТабличныйДокумент= Новый  ТабличныйДокумент;
	Лико_ПечатьЭтикеткиПослеНаСервере(ТабличныйДокумент,РЦ);

		
		
		БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);

	КоличествоЭкземпляров=0; 		
		
	Если БыстраяПечать Тогда
		ТабличныйДокумент.Напечатать();
	Иначе
		ТабличныйДокумент.Показать();
	КонецЕсли;  	

	КонецЦикла;	
	
КонецПроцедуры





&НаСервереБезКонтекста 
Процедура ВыводИнформацииПоДокументу(ТабличныйДокумент, СсылкаНаОбъект) Экспорт
    МакетОбработки=Справочники.РабочиеЦентры.ПолучитьМакет("ПФ_MXLСтикерРабочегоЦентра");
	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеЦентры.Ссылка КАК Ссылка,
		|	РабочиеЦентры.Лико_Код КАК Лико_Код
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|ГДЕ
		|	РабочиеЦентры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);	
		РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог  		
	Областьшапка = МакетОбработки.ПолучитьОбласть("Шапка");
	
	ШК = "2" + "015" + Формат(Число(ВыборкаОбщийИтог.Лико_Код), "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0");
	КС=Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШК=ШК+КС;
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Наименование", ВыборкаОбщийИтог.Ссылка.Наименование);	
	ТабДокумент = ТабличныйДокумент;

	
	// Выводим шапку   	
	
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);


	
	Рисунок = ОбластьШапка.Рисунки.Штрихкод;
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина",          ОбластьШапка.Рисунки.Штрихкод.Ширина);
	ПараметрыШтрихкода.Вставить("Высота",          ОбластьШапка.Рисунки.Штрихкод.Высота);
	ПараметрыШтрихкода.Вставить("ТипКода",         4);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",   3);
	ПараметрыШтрихкода.Вставить("Штрихкод",        ШК);
	Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);	

	ТабДокумент.Вывести(ОбластьШапка);
	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСлева 	= 1;
	ТабДокумент.ПолеСправа 	= 0;
	ТабДокумент.ПолеСнизу 	= 0;
	ТабДокумент.ПолеСверху 	= 1;
	
	ИмяПринтера =Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераЭтикеток","");

	ТабДокумент.ИмяПринтера = ИмяПринтера; 	
	
КонецПроцедуры



