//Определяет характеристику по нарезке//
//Параметры:
//Нарезка - СправочникСсылка.ЯССМ_Нарезки-
//
// Возвращаемое значение: 
// СправочникСсылка.ХарактеристикаНоменклатуры
Функция ХарактеристикаПоНарезке(Нарезка)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец
	|	И ХарактеристикиНоменклатуры.ЯССМ_Нарезка = &Нарезка";
	Запрос.УстановитьПараметр("Нарезка",Нарезка );
	Запрос.УстановитьПараметр("Владелец",ВидНоменкатурыХарактеристики());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВОзврат Выборка.Ссылка; 
	КонецЦикла; 
	
	
КонецФункции

//Определяет упаковку по нарезке//
//Параметры:
//Нарезка - СправочникСсылка.ЯССМ_Нарезки-
//
// Возвращаемое значение: 
// СправочникСсылка.УпаковкиЕдиницыИзмерения
Функция УпаковкаПоНарезке(Нарезка)  Экспорт
	НаборУпаковки=НаборУпаковокНарезки();
	Если НаборУпаковки=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УпаковкиЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	|	И УпаковкиЕдиницыИзмерения.Числитель = &Нарезка";
	Запрос.УстановитьПараметр("Нарезка",Нарезка.Размер/1000 );
	Запрос.УстановитьПараметр("Владелец",НаборУпаковки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Спр									=	Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		Спр.Владелец						=	НаборУпаковки;		
		Спр.Числитель						=	Нарезка.Размер/1000;
		СПр.Знаменатель						=	1;
		Спр.ЕдиницаИзмерения				=	Спр.Владелец.ЕдиницаДляОтчетов;
		Спр.ЛинейныеРазмерыПредставление	=	"Безразмерная";
		Спр.СкладскаяГруппа					=	Справочники.СкладскиеГруппыУпаковок.НайтиПоНаименованию("Адресная");
		Спр.Типоразмер						=	Справочники.Лико_ПредопределенныеЗначения.ТипоразмерУпаковкиРулонногоМатериала.ЗначениеПараметра;
		Спр.ПоставляетсяВМногооборотнойТаре	=	Ложь;
		Спр.ТипИзмеряемойВеличины			=	Перечисления.ТипыИзмеряемыхВеличин.Упаковка;
		Спр.ТипУпаковки						=	Перечисления.ТипыУпаковокНоменклатуры.Конечная; 		
		Спр.Наименование 					=	ОбновитьНаименованиеУпаковки(Спр.ТипУпаковки, Спр.ЕдиницаИзмерения,Спр.Числитель,Спр.Знаменатель,Спр.Владелец.ЕдиницаИзмерения); 
		
		Спр.Записать();
		Возврат Спр.Ссылка;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВОзврат Выборка.Ссылка; 
	КонецЦикла; 
	
	
КонецФункции

Функция ВидНоменкатурыХарактеристики()
	
	Возврат Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра;
	
КонецФункции //ХарактеристикаПоНарезке

Функция НаборУпаковокНарезки()
	
	Возврат Справочники.Лико_ПредопределенныеЗначения.НаборУпаковокНарезки.ЗначениеПараметра;
	
КонецФункции //ХарактеристикаПоНарезке

//Проверяет наличие характеристики нарезки. Если нет то создает
//Параметры:
//Нарезка-СправочникСсылка.ЯССМ_Нарезки-
//
Процедура ПроверкаНаличияХарактеистикиНарезки(Нарезка)  Экспорт
	ВидНоменклатуры=ВидНоменкатурыХарактеристики();
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ХарактеристикаПоНарезке(Нарезка)=Неопределено Тогда
		Спр					=	Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		Спр.Владелец		=	ВидНоменклатуры;
		Спр.ЯССМ_Нарезка	=	Нарезка;
		Спр.Записать();
	КонецЕсли;
	
	
КонецПроцедуры //ПроверкаНаличияХарактеистикиНарезка

//Проверяет наличие упаковки нарезки. Если нет то создает
//Параметры:
//Нарезка-СправочникСсылка.ЯССМ_Нарезки-
//
Процедура ПроверкаНаличияУпаковкиНарезки(Нарезка)  Экспорт
	
	НаборУпаковки=НаборУпаковокНарезки();
	Если Не ЗначениеЗаполнено(НаборУпаковки) Тогда
		Возврат;
	КонецЕсли;
	
	Если УпаковкаПоНарезке(Нарезка)=Неопределено Тогда
		
		Спр									=	Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		Спр.Владелец						=	НаборУпаковки;		
		Спр.Числитель						=	Нарезка.Размер/1000;
		СПр.Знаменатель						=	1;
		Спр.ЕдиницаИзмерения				=	Спр.Владелец.ЕдиницаДляОтчетов;
		Спр.ЛинейныеРазмерыПредставление	=	"Безразмерная";
		Спр.СкладскаяГруппа					=	Справочники.СкладскиеГруппыУпаковок.НайтиПоНаименованию("Адресная");
		Спр.Типоразмер						=	Справочники.Лико_ПредопределенныеЗначения.ТипоразмерУпаковкиРулонногоМатериала.ЗначениеПараметра;
		Спр.ПоставляетсяВМногооборотнойТаре	=	Ложь;
		Спр.ТипИзмеряемойВеличины			=	Перечисления.ТипыИзмеряемыхВеличин.Упаковка;
		Спр.ТипУпаковки						=	Перечисления.ТипыУпаковокНоменклатуры.Конечная; 		
		Спр.Наименование 					=	ОбновитьНаименованиеУпаковки(Спр.ТипУпаковки, Спр.ЕдиницаИзмерения,Спр.Числитель,Спр.Знаменатель,Спр.Владелец.ЕдиницаИзмерения); 
		Спр.Записать();
	КонецЕсли; 	
	
КонецПроцедуры //ПроверкаНаличияХарактеистикиНарезка

Функция ОбновитьНаименованиеУпаковки(ТипУпаковки, ЕдиницаИзмерения, Числитель, Знаменатель, ЕдиницаИзмеренияВладельца) Экспорт
	Возврат Справочники.УпаковкиЕдиницыИзмерения.СформироватьНаименование(ТипУпаковки, ЕдиницаИзмерения, Числитель, Знаменатель, ЕдиницаИзмеренияВладельца);	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры



