#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс




/// <summary>
/// Создает документ "Лико_ЗаданиеНаОтборРазмещение" на основании других документов
/// </summary>
/// <param name="ДокументОснование">ДокументСсылка - Документ, на основании которого создается задание</param>
/// <param name="Паллет">СправочникСсылка.Лико_Паллеты2_0 - Паллет для отбора/размещения</param>
/// <param name="АдресОткуда">СправочникСсылка.СкладскиеЯчейки - Адрес откуда нужно отобрать товар</param>
/// <param name="АдресКуда">СправочникСсылка.СкладскиеЯчейки - Адрес куда нужно разместить товар</param>
/// <returns>DocumentRef.Лико_ЗаданиеНаОтборРазмещение - ссылка на созданный документ</returns>
Функция СоздатьЗадание(ДокументОснование, Паллет, АдресОткуда, АдресКуда) Экспорт
    	УстановитьПривилегированныйРежим(Истина);

	// Если паллет не заполнен, используем адрес откуда для поиска паллета
	Если Не ЗначениеЗаполнено(Паллет) Тогда
		Паллет = НайтиПаллетПоАдресу(АдресОткуда);
	КонецЕсли;

	// Если адрес куда не заполнен, используем функцию ПодобратьЯчейкуПоПаллету
	Если Не ЗначениеЗаполнено(АдресКуда) Тогда
		АдресКуда = Справочники.Лико_СкладскиеСекции.ПодобратьЯчейкуПоПаллету(АдресОткуда.Владелец, Паллет);
	КонецЕсли;


	// Создаем новый документ
	НовыйДокумент = СоздатьДокумент();

	// Заполняем документ согласно стандартам 1С
	НовыйДокумент.Заполнить(ДокументОснование);

	// Устанавливаем реквизиты
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ДокументОснование = ДокументОснование;
	НовыйДокумент.Паллет = Паллет;
	НовыйДокумент.АдресОткуда = АдресОткуда;
	НовыйДокумент.АдресКуда = АдресКуда;
	  
	// Сохранение документа с обработкой ошибок
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОшибкаСообщение = "Ошибка при сохранении документа Лико_ЗаданиеНаОтборРазмещение: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
	КонецПопытки;

	Возврат НовыйДокумент.Ссылка;

КонецФункции

Процедура ОбработатьЗадание(Ссылка)Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	
	СоздатьЗаданияПоЗаявке(Ссылка); 
	 СоздатьЗаданиеПоФормированию(Ссылка);
	 ИзменитьЗаданиеПоПеремещению(Ссылка);
	
КонецПроцедуры 

/// <summary>
/// Создает задания на отбор/размещение по документу Лико_ЗаявкаНаСклад
/// Группирует товары по адресам хранения, создает уникальные задания
/// Проверяет наличие паллетов в других заданиях и отменяет старые если необходимо
/// </summary>
/// <param name="ЗаявкаНаСклад">ДокументСсылка.Лико_ЗаявкаНаСклад - Заявка на склад</param>
Процедура СоздатьЗаданияПоЗаявке(ЗаявкаНаСклад) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ЗаявкаНаСклад)<>Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаСклад) Тогда
		ВызватьИсключение "Не заполнена заявка на склад";
	КонецЕсли;
	
	// Словарь для группировки адресов
	// Ключ - адрес хранения, Значение - массив паллетов
	АдресаПаллеты = Новый Соответствие;
	
	// Проходим по табличной части и группируем по адресам
	Для каждого СтрокаТовара Из ЗаявкаНаСклад.Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.АдресХранения) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресХранения = СтрокаТовара.АдресХранения;
		Склад =  АдресХранения.Владелец;
		Если Не Склад.Лико_ИспользоватьЗаданияНаОтборРазмещение Тогда
			
			Продолжить;
			
		КонецЕсли;


		
		// Инициализируем массив для адреса если его еще нет
		Если АдресаПаллеты.Получить(АдресХранения) = Неопределено Тогда
			МассивПаллетов = Новый Массив;
			АдресаПаллеты.Вставить(АдресХранения, МассивПаллетов);
		Иначе
			МассивПаллетов = АдресаПаллеты.Получить(АдресХранения);
		КонецЕсли;
		
		// Находим паллет для этого адреса
		Паллет = НайтиПаллетПоАдресу(АдресХранения);
		
		// Добавляем паллет в массив если его там еще нет
		Если ЗначениеЗаполнено(Паллет) И МассивПаллетов.Найти(Паллет) = Неопределено Тогда
			МассивПаллетов.Добавить(Паллет);
			
			// Отменяем старые задания с этим паллетом если они существуют
			//ОтменитьСтарыеЗадания(Паллет);
		КонецЕсли;
	КонецЦикла;
	
	// Создаём задания для каждого адреса
	Для каждого ЭлементАдреса Из АдресаПаллеты Цикл
		
		АдресОткуда = ЭлементАдреса.Ключ;
		МассивПаллетов = ЭлементАдреса.Значение;
		
		// Для каждого паллета по этому адресу создаем задание
		Для каждого Паллет Из МассивПаллетов Цикл
			
			Документы.Лико_ЗаданиеНаОтборРазмещение.ОтменитьСтарыеЗадания(Паллет,Документы.Лико_ЗаданиеНаОтборРазмещение.ПустаяСсылка());

			
			// Подбираем адрес куда
			АдресКуда = Склад.Лико_ПолОтгрузкиГлавный;
			
			Если ЗначениеЗаполнено(АдресКуда) Тогда
				// Создаём документ задания
				СоздатьЗадание(ЗаявкаНаСклад, Паллет, АдресОткуда, АдресКуда);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

/// <summary>
/// Создает задание на отбор/размещение по документу Лико_ФормированиеПаллета2_0
/// На один документ формирования создается одно задание
/// </summary>
/// <param name="ФормированиеПаллета">ДокументСсылка.Лико_ФормированиеПаллета2_0 - Документ формирования паллета</param>
Процедура СоздатьЗаданиеПоФормированию(ФормированиеПаллета) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ФормированиеПаллета)<>Тип("ДокументСсылка.Лико_ФормированиеПаллета2_0") Тогда
		
		Возврат;
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(ФормированиеПаллета) Тогда
		ВызватьИсключение "Не заполнен документ формирования паллета";
	КонецЕсли;
	
	Если Не ФормированиеПаллета.АдресХранения.Владелец.Лико_ИспользоватьЗаданияНаОтборРазмещение Тогда
		
		Возврат;
		
	КонецЕсли;

	Если  Не ЗначениеЗаполнено(ФормированиеПаллета.Типоразмер) Тогда 
		Возврат;
	КонецЕсли;
	
	
	// Отменяем старые задания с этим паллетом если они существуют
	//ОтменитьСтарыеЗадания(ФормированиеПаллета.Паллет);
	
	// Подбираем адрес куда
	АдресКуда = Справочники.Лико_СкладскиеСекции.ПодобратьЯчейкуПоПаллету(
		ФормированиеПаллета.АдресХранения.Владелец, ФормированиеПаллета.Паллет,ФормированиеПаллета.Типоразмер);
	
	Если ЗначениеЗаполнено(АдресКуда) Тогда
		// Создаём документ задания
		СоздатьЗадание(ФормированиеПаллета, ФормированиеПаллета.Паллет, 
			ФормированиеПаллета.АдресХранения, АдресКуда);
		КонецЕсли; 
		
		
	
КонецПроцедуры

/// <summary>
/// Создает задание на отбор/размещение по документу Лико_ПеремещениеПаллета2_0
/// На один документ перемещения создается одно задание
/// </summary>
/// <param name="ПеремещениеПаллета">ДокументСсылка.Лико_ПеремещениеПаллета2_0 - Документ перемещения паллета</param>
Процедура ИзменитьЗаданиеПоПеремещению(ПеремещениеПаллета) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ПеремещениеПаллета)<>Тип("ДокументСсылка.Лико_ПеремещениеПаллета2_0") Тогда
		
		Возврат;
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(ПеремещениеПаллета) Тогда
		ВызватьИсключение "Не заполнен документ перемещения паллета";
	КонецЕсли;
	
	
	Задание=ПаллетВЗадании(ПеремещениеПаллета.Паллет);
	
	Если Не ЗначениеЗаполнено(Задание) Тогда
		   Возврат;
	КонецЕсли;
	
	ДокОбъект= Задание.ПолучитьОбъект(); 
	
	АдресХранения = ПеремещениеПаллета.АдресХранения;
	
	Если Не ДокОбъект.Склад.Лико_ИспользоватьЗаданияНаОтборРазмещение Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	Если ЭтоТранзитныйАдрес(АдресХранения) Тогда
		
		ДокОбъект.АдресТранзит=АдресХранения;
		
	Иначе
		
		ДокОбъект.АдресКудаФакт=АдресХранения;

		
	КонецЕсли;
	ДокОбъект.ДокументПеремещения=ПеремещениеПаллета;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОшибкаСообщение = "Ошибка при сохранении документа Лико_ЗаданиеНаОтборРазмещение: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
	КонецПопытки;
	
		
КонецПроцедуры

Функция ЭтоТранзитныйАдрес(Адрес) //+Лико m.shenderov 06.04.2026
		УстановитьПривилегированныйРежим(Истина);

	Результат=Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СтеллажиЗоныПриемкиОтгрузки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Стеллажи.ЗоныПриемкиОтгрузки КАК Лико_СтеллажиЗоныПриемкиОтгрузки
	|ГДЕ
	|	Лико_СтеллажиЗоныПриемкиОтгрузки.АдресХранения = &Адрес
	|	И НЕ Лико_СтеллажиЗоныПриемкиОтгрузки.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	
Возврат Результат;	
	
КонецФункции //-Лико m.shenderov 06.04.2026 


#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

/// <summary>
/// Функция поиска паллета по адресу хранения
/// </summary>
/// <param name="Адрес">СправочникСсылка.СкладскиеЯчейки - Адрес для поиска паллета</param>
/// <returns>СправочникСсылка.Лико_Паллеты2_0 - Найденный паллет</returns>
Функция НайтиПаллетПоАдресу(Адрес) Экспорт
 	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ПаллетыВСекцияхОстатки.Паллет КАК Паллет
	|ИЗ
	|	РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(, Адрес = &Адрес) КАК Лико_ПаллетыВСекцияхОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_ПаллетыВСекцияхОстатки.Паллет.Код";

	Запрос.УстановитьПараметр("Адрес", Адрес);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Паллет;
	Иначе
		Возврат Справочники.Лико_Паллеты2_0.ПустаяСсылка();
	КонецЕсли;

КонецФункции

/// <summary>
/// Проверяет наличие паллета в других заданиях на отбор/размещение
/// </summary>
/// <param name="Паллет">СправочникСсылка.Лико_Паллеты2_0 - Паллет для проверки</param>
/// <returns>Булево - Истина если паллет найден в других заданиях</returns>
Функция ПаллетВЗадании(Паллет) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Документы.Лико_ЗаданиеНаОтборРазмещение.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Паллет) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Задания.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаданиеНаОтборРазмещение КАК Задания
	|ГДЕ
	|	Задания.Паллет = &Паллет
	|	И Задания.Проведен = ИСТИНА
	|	И (Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.Новое)
	|			ИЛИ Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.ВТранзите))
	|	И НЕ Задания.ПометкаУдаления";

	Запрос.УстановитьПараметр("Паллет", Паллет);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	   Результат = Выборка.Ссылка;
   КонецЦикла; 
   
   Возврат Результат;
КонецФункции

/// <summary>
/// Отменяет старые задания с указанным паллетом
/// Отменяет только проведенные задания в статусе Новое или ВТранзите
/// </summary>
/// <param name="Паллет">СправочникСсылка.Лико_Паллеты2_0 - Паллет для отмены заданий</param>
Процедура ОтменитьСтарыеЗадания(Паллет, ЗаданиеСсылка=Неопределено) Экспорт
  	УстановитьПривилегированныйРежим(Истина);

	Если Не ЗначениеЗаполнено(Паллет) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задания.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаданиеНаОтборРазмещение КАК Задания
	|ГДЕ
	|	Задания.Паллет = &Паллет
	|	И Задания.Проведен = ИСТИНА
	|	И (Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.Новое)
	|			ИЛИ Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.ВТранзите))
	|	И НЕ Задания.ПометкаУдаления
	|	И Задания.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("Паллет", Паллет);
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеСсылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ОбъектЗадания = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗадания.Статус = Перечисления.Лико_СтатусыЗаданийСклада.Отменено;
		
		Попытка
			ОбъектЗадания.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		ОшибкаСообщение = "Ошибка при сохранении документа Лико_ЗаданиеНаОтборРазмещение: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вспомогательные процедуры и функции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли 

