
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Площадка =АдресКуда.Лико_Площадка;
	Организация=АдресКуда.Лико_Организация;
	Склад=АдресКуда.Владелец;
	
	
	Если РежимЗаписи =РежимЗаписиДокумента.Проведение   Тогда
		
		Если Не ЗначениеЗаполнено(Статус) Тогда 
			
			Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое; 
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(АдресТранзит)
			И Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое Тогда
			
			Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите; 
			
			
		КонецЕсли;
		
		ЕСли  ЗначениеЗаполнено(АдресКудаФакт) И (Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое 
			Или Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите) Тогда 
			
			Статус=Перечисления.Лико_СтатусыЗаданийСклада.Выполнено; 
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
	
	Если РежимЗаписи =РежимЗаписиДокумента.Проведение
		И (Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое 
		Или Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите) Тогда 
		
		УчитыватьПриПодборе = Истина;
		
	Иначе
		
		УчитыватьПриПодборе = Ложь;
		
	КонецЕсли;
	
	
	Если  ЗначениеЗаполнено(АдресОткуда.Лико_Секция) И  ЗначениеЗаполнено(АдресКуда.Лико_Секция) Тогда
		ТипЗадания =Перечисления.Лико_ТипыСкладскихЗаданий.Перемещение;
	ИначеЕсли  Не ЗначениеЗаполнено(АдресОткуда.Лико_Секция) И  ЗначениеЗаполнено(АдресКуда.Лико_Секция)ТОгда
		ТипЗадания =Перечисления.Лико_ТипыСкладскихЗаданий.Размещение;
	Иначе
		ТипЗадания =Перечисления.Лико_ТипыСкладскихЗаданий.Отбор;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) 
		И Не ЗначениеЗаполнено(АвторДокумента) Тогда
		
		АвторДокумента = ДокументОснование.АвторДокумента;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус=Перечисления.Лико_СтатусЗаявокНаСклад.ВОбработке 
		
		Или Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Подготовлен Тогда
		
		Если ТипЗадания = Перечисления.Лико_ТипыСкладскихЗаданий.Перемещение 
			И  ТипЗадания = Перечисления.Лико_ТипыСкладскихЗаданий.Размещение Тогда
			
			Если ЗначениеЗаполнено(АдресКуда.Лико_Секция) Тогда
				МассивОшибок = Справочники.Лико_СкладскиеСекции.ОшибкиРазмещенияПаллетаВАдрес(АдресКуда,Паллет);
				Если МассивОшибок.Количество()>0 Тогда
					
					Отказ=Истина;
					
					Для каждого Ошибка Из МассивОшибок Цикл
						СообщитьОбОшибке(Ошибка);
					КонецЦикла;
					
		
	КонецЕсли;

			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;

		
	
	
	Если РежимПроведения=РежимПроведенияДокумента.Оперативный Тогда
		
		Если Статус=Перечисления.Лико_СтатусыЗаданийСклада.Новое 
			Или Статус=Перечисления.Лико_СтатусыЗаданийСклада.ВТранзите Тогда
			
			Документы.Лико_ЗаданиеНаОтборРазмещение.ОтменитьСтарыеЗадания(Паллет,Ссылка);
			
		КонецЕсли;
		
		
				
		
	КонецЕсли;
	
	СформироватьДвиженияПаллетыВСекциях();

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	
	Статус=Неопределено;
	АвторДокумента=Неопределено;
	УчитыватьПриПодборе=Неопределено;	
	ДокументОснование=Неопределено;
	АдресКудаФакт=Неопределено;
	ДокументПеремещения=Неопределено;
	
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура СформироватьДвиженияПаллетыВСекциях()
    Движения.Лико_ПаллетыВСекциях.Записывать = Истина;
	Если УчитыватьПриПодборе И ЗначениеЗаполнено(АдресКуда.Лико_Секция) Тогда
		
		
		// Регистрация паллеты в новом адресе
		
		ДвижениеСекции = Движения.Лико_ПаллетыВСекциях.ДобавитьПриход();
		ДвижениеСекции.Период = Дата;
		ДвижениеСекции.Паллет = Паллет;
		ДвижениеСекции.Адрес = АдресКуда;
		ДвижениеСекции.Секция = АдресКуда.Лико_Секция;
		ДвижениеСекции.Количество = 0;
		ДвижениеСекции.Заблокирован = 1; 
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	   УровеньДоступа=1;
КонецПроцедуры

// Выводит сообщение пользователю об ошибке
//
// Параметры:
//  ТекстОшибки - Строка - текст сообщения об ошибке
//
Процедура СообщитьОбОшибке(ТекстОшибки)
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстОшибки;
    Сообщение.Сообщить();
    
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
|en = 'Invalid object call on the client.'");
#КонецЕсли


