
&Вместо("ПодготовкаПоПлощадке")
Процедура Лико_ПодготовкаПоПлощадке()

	ДатаНачалаПодготовкиМатериаловПоПлощадке = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПодготовкиМатериаловПоПлощадке.ЗначениеПараметра;	

	Если ЗначениеЗаполнено(ДатаНачалаПодготовкиМатериаловПоПлощадке) 
		И ТипЗнч(ДатаНачалаПодготовкиМатериаловПоПлощадке) = Тип("Дата")
		И  ДатаНачалаПодготовкиМатериаловПоПлощадке< ТекущаяДата() Тогда
		ПодготовкаПоПлощадке = Истина;
		Лико_Площадка = Объект.ЗаказКлиента.Площадка;
		Площадка = Лико_Площадка.Организация;
		Если Объект.ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Ликофлекс
			Или Объект.ЗаказКлиента.Площадка = Справочники.Лико_Площадки.ИксПак Или Объект.ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Линкс Тогда
			Элементы.Лико_Площадка.Видимость = Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
