 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			   
#Область ПрограммныйИнтерфейс  
			   
			   
			   
#КонецОбласти
			   
#Область ОбработчикиСобытий
			   
			   
Процедура ПередЗаписью(Отказ)
	
		Код = СтрШаблон("Р%1-М(%2-%3-%4)-Э%5"
		,Ряд
		,Формат(Место,"ЧЦ=2; ЧВН=")
		,Формат(Место+1,"ЧЦ=2; ЧВН=")
		,Формат(Место+2,"ЧЦ=2; ЧВН=")
		,Формат(Этаж,"ЧЦ=2; ЧВН=")); 
		
		Наименование = СтрШаблон("Р%1-М(%2)-Э%3",Ряд,Места,Этаж);

КонецПроцедуры
			   
#КонецОбласти
			   
#Область СлужебныеПроцедурыИФункции
			   
#КонецОбласти
			   
			   
#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
			   |en = 'Invalid object call on the client.'");

#КонецЕсли
		   
		   
		   