
&Вместо("УстановитьПризнакИДатуПолученияДокументов")
Процедура Лико_УстановитьПризнакИДатуПолученияДокументов(Значение)
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		Попытка			
			Док  = Документ.ПолучитьОбъект();
			Док.ДатаПолученияДокументов = ДатаПомещения;
			Док.ОбменДанными.Загрузка=Истина;
			Док.Записать(РежимЗаписиДокумента.Запись,);

		Исключение;
			А=0;
		КонецПопытки;
	КонецЕслИ;

КонецПроцедуры
