#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработатьСообщениеОбычныйПриоритет(Сообщение, Отказ)
	ОбработатьСообщение(Сообщение, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеВысокийПриоритет(Сообщение, Отказ)
	ОбработатьСообщение(Сообщение, Отказ, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСообщение(Сообщение, Отказ, ВысокийПриоритет = Ложь)
	Попытка
		ИнтеграционнаяШина.ОбработатьСообщение(Сообщение, Отказ);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИнтеграционнаяШина.Ошибка обработки сообщения';
				|en = 'Integration bus.Message processing error'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.СервисыИнтеграции.ОбменСообщениями,,
			ТехнологияСервиса.ПодробныйТекстОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
