#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ДвиженияДокумента.Параметры.УстановитьЗначениеПараметра("Регистратор",Неопределено); 
	РабочееМесто=ПараметрыСеанса.Лико_РабочееМесто;
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	УстановкаПараметровНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановкаПараметровНаСервере()
	
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидОперации",ВидОперации);
	Список.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрВидОперации",ЗначениеЗаполнено(ВидОперации));
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрОрганизация",ЗначениеЗаполнено(Организация));
	
КонецПроцедуры




#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРеализацииТоваровУслуг

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Элементы.Список.ТекущиеДанные	<>	Неопределено Тогда
		ДвиженияДокумента.Параметры.УстановитьЗначениеПараметра("Регистратор",Элементы.Список.ТекущиеДанные.Ссылка); 
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаСервере
Процедура СотрудникПоF2НаСервере()
	ПолучитьОператора =Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СотрудникПоF2",Неопределено);
	Если ЗначениеЗаполнено(ПолучитьОператора) Тогда
		Оператор=ПолучитьОператора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПоF2(Команда)
	СотрудникПоF2НаСервере();
	ГлЛико_Оператор=Оператор;
КонецПроцедуры

&НаСервере
Процедура СотрудникПоF3НаСервере()
	ПолучитьОператора =Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СотрудникПоF3",Неопределено);
	Если ЗначениеЗаполнено(ПолучитьОператора) Тогда
		Оператор=ПолучитьОператора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПоF3(Команда)
	СотрудникПоF3НаСервере();
	ГлЛико_Оператор=Оператор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Оператор=ГлЛико_Оператор;
	
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если  ИмяСобытия="АвторизацияОператора" Тогда
		Оператор=ГлЛико_Оператор;   
	КонецЕсли;
	
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо  			
			Оператор = Результат.Сотрудник;
			ГлЛико_Оператор=Оператор;
			Оповестить("АвторизацияОператора");
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура Организация1ПриИзменении(Элемент)
	УстановкаПараметровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперации1ПриИзменении(Элемент)
	УстановкаПараметровНаСервере();
КонецПроцедуры



#КонецОбласти