#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ НЕ УТ

#Область ПрограммныйИнтерфейс

// Возвращает структуру параметров отражения показателя в бюджетировании.
//
// Возвращаемое значение:
//	Структура
//
Функция ПараметрыОтраженияПоказателя() Экспорт
	
	ПараметрыОтражения = Новый Структура;
	ПараметрыОтражения.Вставить("РесурсыУпр", Новый Массив);
	ПараметрыОтражения.Вставить("РесурсыРегл", Новый Массив);
	ПараметрыОтражения.Вставить("РесурсыВал", Новый Массив);
	ПараметрыОтражения.Вставить("РесурсыКоличество", Новый Массив);
	ПараметрыОтражения.Вставить("ВыражениеЭтоДебет", "");
	ПараметрыОтражения.Вставить("ВыражениеЭтоКредит", "");
	ПараметрыОтражения.Вставить("ПутьКДаннымИдентификаторФинЗаписи", "");
	ПараметрыОтражения.Вставить("ПутьКДаннымИдентификаторСтроки", "");
	ПараметрыОтражения.Вставить("КорИсточникиДанных", Новый Массив);
	
	Возврат ПараметрыОтражения;
	
КонецФункции

// Возвращает массив переопределяемых полей в зависимости от показателя.
//
// Возвращаемое значение:
//	Массив из Строка
//
Функция ПоляВыборкиПоОписаниюПоказателя() Экспорт
	
	ПоляВыборки = Новый Массив();
	ПоляВыборки.Добавить("Показатель");
	ПоляВыборки.Добавить("ИдентификаторФинЗаписи");
	ПоляВыборки.Добавить("ИдентификаторСтроки");
	ПоляВыборки.Добавить("ЭтоДебет");
	ПоляВыборки.Добавить("ЭтоКредит");
	ПоляВыборки.Добавить("СуммаУпр");
	ПоляВыборки.Добавить("СуммаРегл");
	ПоляВыборки.Добавить("СуммаВал");
	ПоляВыборки.Добавить("Количество");
	ПоляВыборки.Добавить("ЭтоСторно");
	ПоляВыборки.Добавить("УсловиеЗначенияРесурсов");
	
	Возврат ПоляВыборки;
	
КонецФункции

#КонецОбласти

//-- НЕ УТ

#КонецЕсли