
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПодразделениеПолучатель") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = Новый СписокЗначений;
		ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.ГотовКВыполнению);
		Если Параметры.ПодразделениеПолучатель = Справочники.ТС_Подразделения.Формщики Тогда
			ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.ВтечениеСмены);
			ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.Планово);
		Иначе
			ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.ЗапасныеФормыНаТираж);
		КонецЕсли;
	КОнецЕсли;
		
	Если Параметры.Свойство("ТекущийЭлемент") И ЗначениеЗаполнено(Параметры.ТекущийЭлемент) Тогда
    	Элементы.Список.ТекущаяСтрока = Параметры.ТекущийЭлемент;
	КонецЕсли;
	
КонецПроцедуры
