
&НаСервере
Процедура ОпределитьРезультатНаСервере()
	//Результат=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.СписаниеВЗаказ(Номенклатура);
	ТипСписания=Неопределено;
	КатегорияЭксплуатации=Неопределено;
	Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Номенклатура,ДокументРасхода);
	Если ЗначениеЗаполнено(Правило) Тогда
	ТипСписания=Правило.ТипСписания;
	КатегорияЭксплуатации=Правило.КатегорияЭксплуатации;
	
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьРезультат(Команда)
	ОпределитьРезультатНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВнутреннееПотреблениеТоваровТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ВнутреннееПотребление.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|ГДЕ
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Проведен
	|	И НЕ ВнутреннееПотреблениеТоваровТовары.Ссылка.ПометкаУдаления
	|	И ВнутреннееПотреблениеТоваровТовары.Ссылка.Склад = &Склад
	|	И ВнутреннееПотреблениеТоваровТовары.Ссылка.Организация = &Организация
	|	И ВнутреннееПотреблениеТоваровТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("Дата1",Период.ДатаНачала );
	Запрос.УстановитьПараметр("Дата2",Период.ДатаОкончания );
	
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Товары.Очистить();
	Номер=0;
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Выборка.Номенклатура)) ТОгда
			Номер=Номер+1;
			НовыйТовар=Товары.Добавить();
			НовыйТовар.Номер=Номер;
			НовыйТовар.Номенклатура=Выборка.Номенклатура;
		КонецЕсли;
		
		
		
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило2(Номенклатура,ДокументРасхода); 
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
