

Функция ПолучитьНарезку (Характеристика) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,"ЯССМ_Нарезка")	
КонецФункции


Функция ПолучитьУпаковку(Нарезка) Экспорт
	Возврат	Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка);	
КонецФункции


Процедура ТзТиповыеДокументы(Ссылка,ПоказыватьДокумент,Распоряжение=Неопределено,Распоряжение2=Неопределено,АдресВХ,ИмяСобытия) Экспорт //+Лико m.shenderov 06.06.2021
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =ПолучитьТекстЗапросаТиповыеДокументы(); 
		Запрос.УстановитьПараметр("Ссылка",Ссылка );
		Запрос.УстановитьПараметр("ПоказыватьДокумент",ПоказыватьДокумент );
		Запрос.УстановитьПараметр("Распоряжение",Распоряжение );
		Запрос.УстановитьПараметр("Распоряжение2",Распоряжение2 );

	ПоместитьВоВременноеХранилище(ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить()),АдресВх);
		
КонецПроцедуры  //-Лико m.shenderov 06.06.2021 

Функция ПолучитьТекстЗапросаТиповыеДокументOld() //+Лико m.shenderov 06.06.2021
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РеализацияТоваровУслуг.Ссылка КАК Документ
	        |ПОМЕСТИТЬ Вт
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	        |ГДЕ
	        |	РеализацияТоваровУслуг.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РеализацияТоваровУслуг.Ссылка
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	        |ГДЕ
	        |	РеализацияТоваровУслуг.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВнутреннееПотребление.Ссылка
	        |ИЗ
	        |	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
	        |ГДЕ
	        |	ВнутреннееПотребление.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВнутреннееПотребление.Ссылка
	        |ИЗ
	        |	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
	        |ГДЕ
	        |	ВнутреннееПотребление.Ссылка = &Распоряжение2
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВнутреннееПотребление.Ссылка
	        |ИЗ
	        |	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
	        |ГДЕ
	        |	ВнутреннееПотребление.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	СборкаТоваров.Ссылка
	        |ИЗ
	        |	Документ.СборкаТоваров КАК СборкаТоваров
	        |ГДЕ
	        |	СборкаТоваров.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	СборкаТоваров.Ссылка
	        |ИЗ
	        |	Документ.СборкаТоваров КАК СборкаТоваров
	        |ГДЕ
	        |	СборкаТоваров.Ссылка = &Распоряжение2
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	СборкаТоваров.Ссылка
	        |ИЗ
	        |	Документ.СборкаТоваров КАК СборкаТоваров
	        |ГДЕ
	        |	СборкаТоваров.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПриобретениеТоваровУслуг.Ссылка
	        |ИЗ
	        |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	        |ГДЕ
	        |	ПриобретениеТоваровУслуг.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПриобретениеТоваровУслуг.Ссылка
	        |ИЗ
	        |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	        |ГДЕ
	        |	ПриобретениеТоваровУслуг.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПередачаСырьяПереработчику.Ссылка
	        |ИЗ
	        |	Документ.ПередачаСырьяПереработчику КАК ПередачаСырьяПереработчику
	        |ГДЕ
	        |	ПередачаСырьяПереработчику.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПередачаСырьяПереработчику.Ссылка
	        |ИЗ
	        |	Документ.ПередачаСырьяПереработчику КАК ПередачаСырьяПереработчику
	        |ГДЕ
	        |	ПередачаСырьяПереработчику.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПередачаДавальцу.Ссылка
	        |ИЗ
	        |	Документ.ПередачаДавальцу КАК ПередачаДавальцу
	        |ГДЕ
	        |	ПередачаДавальцу.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПоступлениеОтПереработчика.Ссылка
	        |ИЗ
	        |	Документ.ПоступлениеОтПереработчика КАК ПоступлениеОтПереработчика
	        |ГДЕ
	        |	ПоступлениеОтПереработчика.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПоступлениеСырьяОтДавальца.Ссылка
	        |ИЗ
	        |	Документ.ПоступлениеСырьяОтДавальца КАК ПоступлениеСырьяОтДавальца
	        |ГДЕ
	        |	ПоступлениеСырьяОтДавальца.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ОтчетДавальцу.Ссылка
	        |ИЗ
	        |	Документ.ОтчетДавальцу КАК ОтчетДавальцу
	        |ГДЕ
	        |	ОтчетДавальцу.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВозвратСырьяДавальцу.Ссылка
	        |ИЗ
	        |	Документ.ВозвратСырьяДавальцу КАК ВозвратСырьяДавальцу
	        |ГДЕ
	        |	ВозвратСырьяДавальцу.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВозвратСырьяОтПереработчика.Ссылка
	        |ИЗ
	        |	Документ.ВозвратСырьяОтПереработчика КАК ВозвратСырьяОтПереработчика
	        |ГДЕ
	        |	ВозвратСырьяОтПереработчика.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПриходныйОрдерНаТовары.Ссылка
	        |ИЗ
	        |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	        |ГДЕ
	        |	ПриходныйОрдерНаТовары.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ДвижениеПродукцииИМатериалов.Ссылка
	        |ИЗ
	        |	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	        |ГДЕ
	        |	ДвижениеПродукцииИМатериалов.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЗаказМатериаловВПроизводство.Ссылка
	        |ИЗ
	        |	Документ.ЗаказМатериаловВПроизводство КАК ЗаказМатериаловВПроизводство
	        |ГДЕ
	        |	ЗаказМатериаловВПроизводство.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПеремещениеТоваров.Ссылка
	        |ИЗ
	        |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	        |ГДЕ
	        |	ПеремещениеТоваров.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПередачаТоваровХранителю.Ссылка
	        |ИЗ
	        |	Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	        |ГДЕ
	        |	ПередачаТоваровХранителю.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПоступлениеТоваровОтХранителя.Ссылка
	        |ИЗ
	        |	Документ.ПоступлениеТоваровОтХранителя КАК ПоступлениеТоваровОтХранителя
	        |ГДЕ
	        |	ПоступлениеТоваровОтХранителя.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Вт.Документ КАК Документ,
	        |	ВЫБОР
	        |		КОГДА НЕ Вт.Документ.Проведен
	        |				И НЕ Вт.Документ.ПометкаУдаления
	        |			ТОГДА 0
	        |		КОГДА Вт.Документ.Проведен
	        |			ТОГДА 1
	        |		КОГДА Вт.Документ.ПометкаУдаления
	        |			ТОГДА 3
	        |	КОНЕЦ КАК КартинкаДокумента
	        |ИЗ
	        |	Вт КАК Вт";
 
	
КонецФункции //-Лико m.shenderov 06.06.2021 

Функция ПолучитьТекстЗапросаТиповыеДокументы() //+Лико m.shenderov 06.06.2021
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РеализацияТоваровУслуг.Ссылка КАК Документ
	        |ПОМЕСТИТЬ Вт
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	        |ГДЕ
	        |	РеализацияТоваровУслуг.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РеализацияТоваровУслуг.Ссылка
	        |ИЗ
	        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	        |ГДЕ
	        |	РеализацияТоваровУслуг.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВнутреннееПотребление.Ссылка
	        |ИЗ
	        |	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
	        |ГДЕ
	        |	ВнутреннееПотребление.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВнутреннееПотребление.Ссылка
	        |ИЗ
	        |	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
	        |ГДЕ
	        |	ВнутреннееПотребление.Ссылка = &Распоряжение2
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВнутреннееПотребление.Ссылка
	        |ИЗ
	        |	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
	        |ГДЕ
	        |	ВнутреннееПотребление.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	СборкаТоваров.Ссылка
	        |ИЗ
	        |	Документ.СборкаТоваров КАК СборкаТоваров
	        |ГДЕ
	        |	СборкаТоваров.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	СборкаТоваров.Ссылка
	        |ИЗ
	        |	Документ.СборкаТоваров КАК СборкаТоваров
	        |ГДЕ
	        |	СборкаТоваров.Ссылка = &Распоряжение2
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	СборкаТоваров.Ссылка
	        |ИЗ
	        |	Документ.СборкаТоваров КАК СборкаТоваров
	        |ГДЕ
	        |	СборкаТоваров.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПриобретениеТоваровУслуг.Ссылка
	        |ИЗ
	        |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	        |ГДЕ
	        |	ПриобретениеТоваровУслуг.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПриобретениеТоваровУслуг.Ссылка
	        |ИЗ
	        |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	        |ГДЕ
	        |	ПриобретениеТоваровУслуг.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПередачаСырьяПереработчику.Ссылка
	        |ИЗ
	        |	Документ.ПередачаСырьяПереработчику КАК ПередачаСырьяПереработчику
	        |ГДЕ
	        |	ПередачаСырьяПереработчику.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПередачаСырьяПереработчику.Ссылка
	        |ИЗ
	        |	Документ.ПередачаСырьяПереработчику КАК ПередачаСырьяПереработчику
	        |ГДЕ
	        |	ПередачаСырьяПереработчику.Ссылка = &Распоряжение
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПередачаДавальцу.Ссылка
	        |ИЗ
	        |	Документ.ПередачаДавальцу КАК ПередачаДавальцу
	        |ГДЕ
	        |	ПередачаДавальцу.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПоступлениеОтПереработчика.Ссылка
	        |ИЗ
	        |	Документ.ПоступлениеОтПереработчика КАК ПоступлениеОтПереработчика
	        |ГДЕ
	        |	ПоступлениеОтПереработчика.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПоступлениеСырьяОтДавальца.Ссылка
	        |ИЗ
	        |	Документ.ПоступлениеСырьяОтДавальца КАК ПоступлениеСырьяОтДавальца
	        |ГДЕ
	        |	ПоступлениеСырьяОтДавальца.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ОтчетДавальцу.Ссылка
	        |ИЗ
	        |	Документ.ОтчетДавальцу КАК ОтчетДавальцу
	        |ГДЕ
	        |	ОтчетДавальцу.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВозвратСырьяДавальцу.Ссылка
	        |ИЗ
	        |	Документ.ВозвратСырьяДавальцу КАК ВозвратСырьяДавальцу
	        |ГДЕ
	        |	ВозвратСырьяДавальцу.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВозвратСырьяОтПереработчика.Ссылка
	        |ИЗ
	        |	Документ.ВозвратСырьяОтПереработчика КАК ВозвратСырьяОтПереработчика
	        |ГДЕ
	        |	ВозвратСырьяОтПереработчика.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПриходныйОрдерНаТовары.Ссылка
	        |ИЗ
	        |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	        |ГДЕ
	        |	ПриходныйОрдерНаТовары.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ДвижениеПродукцииИМатериалов.Ссылка
	        |ИЗ
	        |	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	        |ГДЕ
	        |	ДвижениеПродукцииИМатериалов.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЗаказМатериаловВПроизводство.Ссылка
	        |ИЗ
	        |	Документ.ЗаказМатериаловВПроизводство КАК ЗаказМатериаловВПроизводство
	        |ГДЕ
	        |	ЗаказМатериаловВПроизводство.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Лико_СвязиСТиповымиДокументами.ТиповойДокумент
	        |ИЗ
	        |	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
	        |ГДЕ
	        |	&ПоказыватьДокумент
	        |	И Лико_СвязиСТиповымиДокументами.Документ.Лико_Документ = &Ссылка
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПеремещениеТоваров.Ссылка
	        |ИЗ
	        |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	        |ГДЕ
	        |	ПеремещениеТоваров.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПередачаТоваровХранителю.Ссылка
	        |ИЗ
	        |	Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	        |ГДЕ
	        |	ПередачаТоваровХранителю.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПоступлениеТоваровОтХранителя.Ссылка
	        |ИЗ
	        |	Документ.ПоступлениеТоваровОтХранителя КАК ПоступлениеТоваровОтХранителя
	        |ГДЕ
	        |	ПоступлениеТоваровОтХранителя.Лико_Документ = &Ссылка
	        |	И &ПоказыватьДокумент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Вт.Документ КАК Документ,
	        |	ВЫБОР
	        |		КОГДА НЕ Вт.Документ.Проведен
	        |				И НЕ Вт.Документ.ПометкаУдаления
	        |			ТОГДА 0
	        |		КОГДА Вт.Документ.Проведен
	        |			ТОГДА 1
	        |		КОГДА Вт.Документ.ПометкаУдаления
	        |			ТОГДА 3
	        |	КОНЕЦ КАК КартинкаДокумента
	        |ИЗ
	        |	Вт КАК Вт";
 
	
КонецФункции //-Лико m.shenderov 06.06.2021 



Процедура УстановкаПризнакаСканыВРеестреДокументов(МассивСсылок) Экспорт //+Лико m.shenderov 04.08.2021

Для каждого Ссылка Из МассивСсылок Цикл
	НаборЗаписей = РегистрыСведений.РеестрДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	Для каждого Запись Из НаборЗаписей Цикл
		Запись.Лико_Сканы=Истина;		
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
КонецЦикла;
		
КонецПроцедуры //-Лико m.shenderov 04.08.2021




