
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Структура = Новый Структура;
	//Структура.Вставить("Склад",Объект.Склад);	
	Структура.Вставить("Период",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	//Структура.Вставить("ТолькоОстатки",Истина);
	
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы, ПараметрыФормы) Экспорт 	
	
	Если ТипЗнч(РезультатФормы) = Тип("Массив") Тогда
		
		Для каждого Товар Из РезультатФормы  Цикл
			
			
			СтруктураНоменклатуры = Новый Структура;
			СтруктураНоменклатуры.Вставить("Номенклатура");
			СтруктураНоменклатуры.Вставить("Серия");  
			
			
			ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры, Товар);
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество() = 0 Тогда
				НоваяСтрока = Объект.Товары.Добавить(); 			 			
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
				НоваяСтрока.Партия = Товар.НомерПартииИзготовления;  
				НоваяСтрока.КлючСтроки = новый УникальныйИдентификатор;

			КонецЕсли;
			
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры  

&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;   
КонецПроцедуры 


&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			Если ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда
				ОбработатьШКОбъектаНоменклатуры(Результат.ОбъектНоменклатуры);
			Иначе
				Сообщить("Объект номенклатуры не найден");
			КонецЕсли;
		Иначе
			Сообщить("Штрихкод вида """ + Результат.ВидШК + """ не поддерживается в данном документе");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ОбработатьШКОбъектаНоменклатуры(ОбъектНоменклатуры)
	
	Если Объект.Товары.НайтиСтроки(Новый Структура("Серия", ОбъектНоменклатуры.Серия)).Количество() = 0 Тогда 
		НоваяСтрока = Объект.Товары.Добавить();
		Модифицированность = Истина;
		НоваяСтрока.Номенклатура = ОбъектНоменклатуры.Номенклатура;
		НоваяСтрока.Серия 		 = ОбъектНоменклатуры.Серия;
		НоваяСтрока.Нарезка	     = ОбъектНоменклатуры.Нарезка;  
		НоваяСтрока.Партия	     = ОбъектНоменклатуры.НомерПартииИзготовления; 
		НоваяСтрока.КлючСтроки	  = новый УникальныйИдентификатор; 

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)

	стр = Элементы.Товары.ТекущиеДанные;
	Если стр <> Неопределено Тогда
		КлючСтроки = стр.КлючСтроки;
		Элементы.Тесты.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", КлючСтроки); 
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	УдалитьСтрокиПоКлючу(Элемент.ТекущиеДанные.КлючСтроки, "Тесты", "КлючСтроки");

КонецПроцедуры  

Процедура УдалитьСтрокиПоКлючу(КлючСтроки, ИмяТЧ, ИмяКолонки)  
	
	МассивСтрок = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяКолонки, КлючСтроки));
	
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект[ИмяТЧ].Удалить(ЭлементМассива);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		КлючСтроки = Новый УникальныйИдентификатор;
		Элемент.ТекущиеДанные.КлючСтроки = КлючСтроки;
	КонецЕсли;	

КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗначениеРеквизита(Объект, ИмяРеквизита)
	Возврат Объект[ИмяРеквизита]
КонецФункции

&НаКлиенте
Процедура ТестыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	текстр = Элементы.Товары.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		Элемент.ТекущиеДанные.КлючСтроки = текстр.КлючСтроки;
		Элементы.Тесты.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", текстр.КлючСтроки);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ОперацииТестированиеМатериалов.ВходнойКонтроль"))
		ИЛИ (Объект.Проведен И ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ОперацииТестированиеМатериалов.ВходнойКонтроль")) Тогда
		ОтправлятьПисьмо = Ложь;
		МассивКлючейСтрокДляОтправкиПисьма = Новый Массив;
		Для каждого Стр Из Объект.Товары Цикл
			Если Стр.Результат = ПредопределенноеЗначение("Перечисление.Лико_ДаНет.Нет") И НЕ Стр.ПисьмоСОтрицательнымРезультатомВКОтправлено Тогда
				ОтправлятьПисьмо = Истина;
				МассивКлючейСтрокДляОтправкиПисьма.Добавить(Стр.КлючСтроки);
			КонецЕсли;
		КонецЦикла;
		Если ОтправлятьПисьмо Тогда
			СформироватьИОтправитьПисьмоСОтрицательнымРезультатомВК(МассивКлючейСтрокДляОтправкиПисьма);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СформироватьИОтправитьПисьмоСОтрицательнымРезультатомВК(МассивКлючейСтрокДляОтправкиПисьма)
	
	Макет = Документы.Лико_ТестированиеМатериалов.ПолучитьМакет("ФормаПисьмаДляЭлектроннойПочты");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТекстШапка = Макет.ПолучитьОбласть("ТекстШапка");
	
	Заголовок = "Создан документ Тестирование материалов " + Объект.Номер+" от "+ Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " с отрицательным результатом";
		
	ТекстСообщения = Заголовок;

	ТекстСообщения = ТекстСообщения + Символы.ПС;
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Вид операции: " + Объект.ВидОперации;
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Ответственный: " + Объект.Ответственный;
	ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.ПС + Символы.ПС;

	ТекстШапка.Параметры.ТекстСообщенияШапка = ТекстСообщения;
	ТабличныйДокумент.Вывести(ТекстШапка);
	
	ТаблицаШапка = Макет.ПолучитьОбласть("ТаблицаШапка");
	ТабличныйДокумент.Вывести(ТаблицаШапка);
	
	Для каждого КлючСтр Из МассивКлючейСтрокДляОтправкиПисьма Цикл
		СтрокаТовары = Объект.Товары.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтр));
		СтрокаТесты = Объект.Тесты.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтр));
		
		СтрокаТаблицы = Макет.ПолучитьОбласть("ТаблицаСтрока");	
		Если СтрокаТовары.Количество() > 0 Тогда 
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры,СтрокаТовары[0]);
			СтрокаТаблицы.Параметры.РезультатСоответсвие = "Не соответствует";	
		КонецЕсли;
		Если СтрокаТесты.Количество() > 0 Тогда 
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры,СтрокаТесты[0]);
			СтрокаТаблицы.Параметры.РезультатТеста = СтрокаТесты[0].Результат;	
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(СтрокаТаблицы);
	КонецЦикла;	
	
	ТекстПодвал = Макет.ПолучитьОбласть("ТекстПодвал");
	ТекстПодвал.Параметры.ТекстСообщенияПодвал = "";
	ТабличныйДокумент.Вывести(ТекстПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	//Преобразование ТабДок к HTML
	ИмяФайла = ПолучитьИмяВременногоФайла("html");
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML5);
	HTMLФайл = Новый ТекстовыйДокумент;
	HTMLФайл.Прочитать(ИмяФайла);
	ТекстHTMLФайла = HTMLФайл.ПолучитьТекст();
	УдалитьФайлы(ИмяФайла);
	
	
	//Отправка Письма
	ПараметрыПисьма = Новый Структура();		
	ПараметрыПисьма.Вставить("Кому", "OArtamonova@okil-sato.ru;Vlee@okil-sato.ru;OKIL_Zakupki@okil-sato.ru");
	ПараметрыПисьма.Вставить("Тема", Заголовок);
	ПараметрыПисьма.Вставить("Тело",ТекстHTMLФайла);
	
	ПараметрыПисьма.Тело = СтрЗаменить(ПараметрыПисьма.Тело, "№", "N");
	ПараметрыПисьма.Тема = СтрЗаменить(ПараметрыПисьма.Тема, "№", "N");
	Лико_Планирование.ОтправитьПисьмо(ПараметрыПисьма.Тело, ПараметрыПисьма.Тема, ПараметрыПисьма.Кому);
	
	ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	Для каждого КлючСтр Из МассивКлючейСтрокДляОтправкиПисьма Цикл
		СтрокаТовары = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтр));
		Если СтрокаТовары.Количество() > 0 Тогда 
			СтрокаТовары[0].ПисьмоСОтрицательнымРезультатомВКОтправлено = Истина;
		КонецЕсли;
	КонецЦикла;	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	Прочитать();
			
КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	
//	// <-- Начало Лико Яцун С. В. 30.08.2024
//	//Проверка необходимости отправки письма и заполнение параметров для отправки письма
//	ПараметрыОтправкиПисьма = Новый Структура("ОтправлятьПисьмо,МассивКлючейСтрокДляОтправкиПисьма",Ложь,Неопределено);
//	МассивКлючейСтрокДляОтправкиПисьма = Новый Массив;
//	Если (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ОперацииТестированиеМатериалов.ВходнойКонтроль"))
//		ИЛИ ((ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ (Объект.Проведен И ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения)) И ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеРеквизита(Объект.Ссылка, "ВидОперации") <> Объект.ВидОперации И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ОперацииТестированиеМатериалов.ВходнойКонтроль")) 
//		ИЛИ (НЕ Объект.Проведен И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(Объект.Ссылка)) Тогда
//		СтрокиДляОтправки = Объект.Товары.НайтиСтроки(Новый Структура("Результат",ПредопределенноеЗначение("Перечисление.Лико_ДаНет.Нет")));
//		Если СтрокиДляОтправки.Количество() > 0 Тогда
//			ПараметрыОтправкиПисьма.ОтправлятьПисьмо = Истина;
//			Для каждого Стр Из СтрокиДляОтправки Цикл
//				МассивКлючейСтрокДляОтправкиПисьма.Добавить(Стр.КлючСтроки);	
//			КонецЦикла;
//			ПараметрыОтправкиПисьма.МассивКлючейСтрокДляОтправкиПисьма = МассивКлючейСтрокДляОтправкиПисьма;
//		КонецЕсли;
//	ИначеЕсли Объект.Проведен И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ОперацииТестированиеМатериалов.ВходнойКонтроль") И ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
//		Для каждого Стр Из Объект.Товары Цикл
//			ПредыдущееЗначениеРезльтата = ЗначениеРезультатаСсылка(Стр.КлючСтроки);
//			Если (ПредыдущееЗначениеРезльтата = Неопределено И Стр.Результат = ПредопределенноеЗначение("Перечисление.Лико_ДаНет.Нет")) 
//				ИЛИ (ПредыдущееЗначениеРезльтата <> Неопределено И Стр.Результат <> ПредыдущееЗначениеРезльтата И Стр.Результат = ПредопределенноеЗначение("Перечисление.Лико_ДаНет.Нет")) Тогда
//				МассивКлючейСтрокДляОтправкиПисьма.Добавить(Стр.КлючСтроки);
//				ПараметрыОтправкиПисьма.ОтправлятьПисьмо = Истина;
//			КонецЕсли;
//		КонецЦикла;
//		Если ПараметрыОтправкиПисьма.ОтправлятьПисьмо = Истина Тогда
//			ПараметрыОтправкиПисьма.МассивКлючейСтрокДляОтправкиПисьма = МассивКлючейСтрокДляОтправкиПисьма;
//		КонецЕсли;
//	КонецЕсли;
//	 
//	ПараметрыЗаписи.Вставить("ПараметрыОтправкиПисьма",ПараметрыОтправкиПисьма);
//	// <-- Конец Лико Яцун С. В. 30.08.2024
//	
//КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаТоварыИзСсылки(КлючСтрокиПоиска,ИмяРеквизита)
	
    ПредыдущееЗначениеРеквизита = Объект.Ссылка.Товары.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтрокиПоиска));
	Если ПредыдущееЗначениеРеквизита.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПредыдущееЗначениеРеквизита[0][ИмяРеквизита];
	КонецЕсли;
	
КонецФункции  


&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ПредыдущееЗначениеРеквизитаСерия = ЗначениеРеквизитаТоварыИзСсылки(ТекСтрока.КлючСтроки,"Серия");
	Если ТекСтрока.Результат = ПредопределенноеЗначение("Перечисление.Лико_ДаНет.Нет") 
		И ПредыдущееЗначениеРеквизитаСерия <> Неопределено И ПредыдущееЗначениеРеквизитаСерия <> ТекСтрока.Серия Тогда
		ТекСтрока.ПисьмоСОтрицательнымРезультатомВКОтправлено = Ложь;	
	КонецЕсли;   
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ПредыдущееЗначениеРеквизитаНоменклатура = ЗначениеРеквизитаТоварыИзСсылки(ТекСтрока.КлючСтроки,"Номенклатура");
	Если ТекСтрока.Результат = ПредопределенноеЗначение("Перечисление.Лико_ДаНет.Нет") 
		И ПредыдущееЗначениеРеквизитаНоменклатура <> Неопределено И ПредыдущееЗначениеРеквизитаНоменклатура <> ТекСтрока.Номенклатура Тогда
		ТекСтрока.ПисьмоСОтрицательнымРезультатомВКОтправлено = Ложь;	
	КонецЕсли;   
	
КонецПроцедуры

