
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		ОбработатьВведенногоСотрудника(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВведенногоСотрудника(РезультатШК)
	
	ФорматЗаписиSQLЧисло	="ЧРД=.; ЧН=0; ЧГ=0";
	
	НайденныеСтроки = Объект.СписокСотрудников.НайтиСтроки(Новый Структура("ФизЛицо", РезультатШК.Сотрудник));
	Если НайденныеСтроки.Количество() = 0 Тогда  
		НоваяСтрока = Объект.СписокСотрудников.Добавить();
		НоваяСтрока.ТабельныйНомер = РезультатШК.КодИнформации;
		НоваяСтрока.ФизЛицо = РезультатШК.Сотрудник;
	Иначе
		Сообщить("Сотрудник " + РезультатШК.Сотрудник + " уже присутсвует в списке!", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	ПерезаполнитьНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

Процедура ПерезаполнитьНаСервере()
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Справочники.Лико_ПредопределенныеЗначения.ВнешняяОбработкаВыпускПродукции.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("В справочнике предопределенных значений не найдена ""Выпуск продукции""");
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
	
	СтруктураПараметров = Новый Структура("Дата,ВидРабочегоМеста,Смена,Склад,ПроизводственноеПомещение,СкладАнгар,РабочееМесто");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект);
	
	ВнешняяОбработка.ЗаполнитьДанныеОкончанияСмены(СтруктураПараметров, Объект.СписокСотрудников); 
	
КонецПроцедуры
