
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.ВыделенныеСтроки.Очистить();		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя="Наименование" Тогда	
		Закрыть(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокКнопкаВНиз(Команда)
	
	Ссылка=Элементы.Список.ТекущаяСтрока;
	Если Ссылка<>Неопределено Тогда
		НоваяСсылка=СписокКнопкаВНизНаСервере(Ссылка);
		Если НоваяСсылка<>Неопределено Тогда
			Элементы.Список.ТекущаяСтрока=НоваяСсылка;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокКнопкаВверх(Команда)
	
	Ссылка=Элементы.Список.ТекущаяСтрока;
	Если Ссылка<>Неопределено Тогда
		НоваяСсылка=СписокКнопкаВверхНаСервере(Ссылка);
		Если НоваяСсылка<>Неопределено Тогда
			Элементы.Список.ТекущаяСтрока=НоваяСсылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  СписокКнопкаВНизНаСервере(Ссылка)
	
	Результат=Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_РешенияПоБракуМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_РешенияПоБракуМатериалов КАК Лико_РешенияПоБракуМатериалов
	|ГДЕ
	|	Лико_РешенияПоБракуМатериалов.Код > &Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_РешенияПоБракуМатериалов.Код";
	Запрос.УстановитьПараметр("Код",Ссылка.Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат=Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКнопкаВверхНаСервере(Ссылка)
	
	Результат=Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_РешенияПоБракуМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_РешенияПоБракуМатериалов КАК Лико_РешенияПоБракуМатериалов
	|ГДЕ
	|	Лико_РешенияПоБракуМатериалов.Код < &Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_РешенияПоБракуМатериалов.Код УБЫВ";
	
	Запрос.УстановитьПараметр("Код",Ссылка.Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат=Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

