Функция СтартСистемы() Экспорт  //+Лико m.shenderov 31.01.2023
	
	ДатаНачала=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаСистемыРезервированияПодКлиента.ЗначениеПараметра;
	
	Если ЗначениеЗаполнено(ДатаНачала) И ТипЗнч(ДатаНачала)=Тип("Дата") И ДатаНачала<ТекущаяДата() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //-Лико m.shenderov 31.01.2023 


Функция СтартРезевированияПодРегионы() Экспорт  //+Лико m.shenderov 31.01.2023
	
	ДатаНачала=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаРезервированияПодРегионы.ЗначениеПараметра;
	
	Если ЗначениеЗаполнено(ДатаНачала) И ТипЗнч(ДатаНачала)=Тип("Дата") И ДатаНачала<ТекущаяДата() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //-Лико m.shenderov 31.01.2023 




Процедура ПроверкаРезерваМатериалов(Отказ, РежимЗаписи,Партнер,Товары,ИмяТЗ="Товары",ИмяРеквизита="Номенклатура") Экспорт 
	
	Если Не СтартСистемы() Тогда
		Возврат;
	КонецЕсли;
	
	
	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение  Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НомерСтроки=0;
	
		
	Для каждого Товар Из Товары Цикл 
		
				
			ОбъектНоменклатуры			=	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			ОбъектНоменклатуры_Партнер	=	ОбъектНоменклатуры.Партнер;
			Номенклатура				=   ОбъектНоменклатуры.Номенклатура;
			
			Если ЗначениеЗаполнено(ОбъектНоменклатуры_Партнер) И ОбъектНоменклатуры_Партнер<> Партнер Тогда
				Отказ				=	Истина;
				Сообщение 			= 	Новый СообщениеПользователю;
				
				Сообщение.Текст 	= 	СтрШаблон("Материал: №%3 (%1) - %2 - #%4, зарезервирован под заказы клиента: ""%5""!",
				Номенклатура.Код,
				Номенклатура,
				НомерСтроки+1,
				Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
				ОбъектНоменклатуры_Партнер); 
				
				Сообщение.Поле = ИмяТЗ+"["+НомерСтроки+"]."+ИмяРеквизита; //имя реквизита
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Сообщить();
			КонецЕсли;
			
		

		НомерСтроки=НомерСтроки+1;

	КонецЦикла;



КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Лико_УстановкаРезерваМатериалов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Лико_УстановкаРезерваМатериалов.АвторДокумента,
	|	Лико_УстановкаРезерваМатериалов.Дата,
	|	Лико_УстановкаРезерваМатериалов.Комментарий,
	|	Лико_УстановкаРезерваМатериалов.Номер,
	|	Лико_УстановкаРезерваМатериалов.Организация,
	|	Лико_УстановкаРезерваМатериалов.Партнер,
	|	Лико_УстановкаРезерваМатериалов.РабочееМесто,
	|	Лико_УстановкаРезерваМатериалов.Склад,
	|	Лико_УстановкаРезерваМатериалов.Сотрудник,
	|	Лико_УстановкаРезерваМатериалов.Товары.(
	|		Номенклатура,
	|		Характеристика,
	|		Серия,
	|		КоличествоУпаковок,
	|		Количество,
	|		АдресХранения
	|	)
	|ИЗ
	|	Документ.Лико_УстановкаРезерваМатериалов КАК Лико_УстановкаРезерваМатериалов
	|ГДЕ
	|	Лико_УстановкаРезерваМатериалов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заголовок=?(Ссылка.Проведен,"Резерв материалов", "Отмена резерва материалов");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
