
&НаКлиенте
Процедура Лико_ПриОткрытииПосле(Отказ)
	
	СразуНаПринтер=Ложь;
	Попытка
		Если ТипЗнч(ЭтаФорма.ВладелецФормы)=Тип("УправляемаяФорма")Тогда
			СразуНаПринтер=ЭтаФорма.ВладелецФормы.СразуНаПринтер;
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	ИмяПринтера="";
	
	Попытка
		Если ТипЗнч(ЭтаФорма.ВладелецФормы)=Тип("УправляемаяФорма")Тогда
			ИмяПринтера=ЭтаФорма.ВладелецФормы.ИмяПринтера;
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ИмяПринтера) и не СразуНаПринтер Тогда
		ТабличныеДокументы = ТабличныеДокументыДляПечати();
		Для каждого ТабДок из ТабличныеДокументы Цикл 
			ТабДок.Значение.ИмяПринтера=ИмяПринтера;
		КонецЦикла;
		
	КонецЕсли;
	
	
	
	Если СразуНаПринтер Тогда
		ТабличныеДокументы = ТабличныеДокументыДляПечати();
		
		Для каждого ТабДок из ТабличныеДокументы Цикл
			Если ЗначениеЗаполнено(ИмяПринтера) Тогда
				ТабДок.Значение.ИмяПринтера=ИмяПринтера; 				
			КонецЕсли;
			НовыйСписок = Новый СписокЗначений;
			НовыйСписок.Добавить(ТабДок.Значение, ТабДок.Представление);
			УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(НовыйСписок, ОбъектыПечати,
			НовыйСписок.Количество() > 1, ?(НастройкиПечатныхФорм.Количество() > 1, Копий, 1));
		КонецЦикла;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ОтправитьСебеПосле(Команда)
	Если Лико_ВыбиратьФорматВложений Тогда
		Лико_ВыборФормата=Истина;
		ОткрытьФорму("ОбщаяФорма.ВыборФорматаВложений",,ЭтаФорма);
	Иначе
		ВыбранноеЗначение= ВыбранныеНастройкиФормата();
		ПараметрыОтправки = ПараметрыОтправкиПисьма(ВыбранноеЗначение);
		ПараметрыОтправки.Вставить("ОтправитьПисьмо");
		ПараметрыОтправки.Получатель=ПолучитьАдресЭлектроннойПочтыПользователя();	
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВыбранныеНастройкиФормата()
	
	ФорматыСохранения = Новый Массив;	
	ФорматыСохранения.Добавить(Строка(ТипФайлаТабличногоДокумента.XLSX));
	
	Если ТипЗнч(Лико_Формат)=Тип("Массив") ТОгда
		ФорматыСохранения=Лико_Формат;
	КонецЕсли;
	
	
	
	Результат = Новый Структура;
	Результат.Вставить("УпаковатьВАрхив", Ложь);
	Результат.Вставить("ФорматыСохранения", ФорматыСохранения);
	Результат.Вставить("ПереводитьИменаФайловВТранслит", Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресЭлектроннойПочтыПользователя() //+Лико m.shenderov 20.09.2018  
	Возврат  ВзаимодействияВызовСервера.НаименованиеИАдресаЭлектроннойПочтыКонтакта(ПараметрыСеанса.ТекущийПользователь).Адреса;
	
	
	//
	//СтруктураАдресов =  ВзаимодействияВызовСервера.НаименованиеИАдресаЭлектроннойПочтыКонтакта(ПараметрыСеанса.ТекущийПользователь).Адреса;
	//		Если СтруктураАдресов.Количество()>0 Тогда 
	//			Кому = Кому+?(ЗначениеЗаполнено(Кому),";", "")+СтруктураАдресов[0].Значение;
	//		КонецЕсли;
	
КонецФункции  //-Лико m.shenderov 20.09.2018

&НаКлиенте
Процедура Лико_Лико_ВыборФорматаВложенийПосле(Команда)
	Лико_ВыборФормата=Истина;
	ОткрытьФорму("ОбщаяФорма.ВыборФорматаВложений",,ЭтаФорма);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	ААА=222;
КонецПроцедуры

&НаКлиенте
Процедура Лико_ОбработкаВыбораВместо(ВыбранноеЗначение, ИсточникВыбора)
	Если Лико_ВыборФормата Тогда
		Лико_ВыборФормата=Ложь;
		ПараметрыОтправки = ПараметрыОтправкиПисьма(ВыбранноеЗначение);
		Если ПараметрыОтправки.Свойство("Вложения") И ПараметрыОтправки.Вложения.Количество() > 0 И Найти(ПараметрыОтправки.Вложения[0].Представление,"ТЗ на изготовление форм") <> 0 И ПараметрыОтправки.Свойство("Тема") Тогда
			ПараметрыОтправки.Тема = ПараметрыОтправки.Вложения[0].Представление;	
		КонецЕсли;
		ПараметрыОтправки.Вставить("ОтправитьПисьмо");
		ПараметрыОтправки.Получатель=ПолучитьАдресЭлектроннойПочтыПользователя();	
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	Иначе
		ПродолжитьВызов(ВыбранноеЗначение, ИсточникВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Лико_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
		Перем КоллекцияПечатныхФорм;
	
	УстановитьУсловноеОформление();
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПользовательскиеМакетыПечати) Тогда
		Элементы.КнопкаПерейтиКУправлениюМакетами.Видимость = Ложь;
	КонецЕсли;
	
	// Проверка входных параметров.
	Если Не ЗначениеЗаполнено(Параметры.ИсточникДанных) Тогда 
		ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(Параметры.ПараметрКоманды) = Тип("Массив") Или ОбщегоНазначения.ЗначениеСсылочногоТипа(Параметры.ПараметрКоманды),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
				"ru = 'Недопустимое значение параметра %1 при вызове метода %2.
				|Ожидалось: %3, %4.
				|Передано: %5';
				|en = 'Invalid parameter value. %1 parameter, %2 method.
				|Expected value: %3, %4.
				|Passed value: %5.'"),
				"ПараметрКоманды",
				"УправлениеПечатьюКлиент.ВыполнитьКомандуПечати",
				"Массив",
				"ЛюбаяСсылка",
				 ТипЗнч(Параметры.ПараметрКоманды)));
	КонецЕсли;

	// Поддержка обратной совместимости с 2.1.3.
	ПараметрыПечати = Параметры.ПараметрыПечати;
	Если Параметры.ПараметрыПечати = Неопределено Тогда
		ПараметрыПечати = Новый Структура;
	КонецЕсли;
	Если Не ПараметрыПечати.Свойство("ДополнительныеПараметры") Тогда
		Параметры.ПараметрыПечати = Новый Структура("ДополнительныеПараметры", ПараметрыПечати);
		Для Каждого ПараметрПечати Из ПараметрыПечати Цикл
			Параметры.ПараметрыПечати.Вставить(ПараметрПечати.Ключ, ПараметрПечати.Значение);
		КонецЦикла;
	КонецЕсли; 
	
	// --> Начало Лико Ефимов ЕВВ 30.11.2023
	// в релизе 2.5.12.167 разработчики 1С сделали формирование печатных форм в фоне.
	// Из-за этого они запускаются на сервере, где не заполнен параметр сеанса Лико_РабочееМесто, а мы многое из него берем. Верну обработно (без фонового выполнения)
	Если Параметры.КоллекцияПечатныхФорм = Неопределено Тогда
		Параметры.КоллекцияПечатныхФорм = СформироватьПечатныеФормы(Параметры.ИменаМакетов, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 30.11.2023
	
	Если Параметры.КоллекцияПечатныхФорм = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	Иначе
		КоллекцияПечатныхФорм = Параметры.КоллекцияПечатныхФорм;
		ИсключитьОфисныеДокументыИзКомплектов(КоллекцияПечатныхФорм);
		ОбъектыПечати = Параметры.ОбъектыПечати;
	КонецЕсли;
	
	СообщенияФоновогоЗадания = Неопределено;
	Параметры.Свойство("Сообщения", СообщенияФоновогоЗадания);
	Если СообщенияФоновогоЗадания <> Неопределено Тогда
		Для Каждого Сообщение Из СообщенияФоновогоЗадания Цикл
			ОбщегоНазначения.СообщитьПользователю(Сообщение.Текст);
		КонецЦикла;
	КонецЕсли;

	// --> Начало Лико Ефимов ЕВВ 30.11.2023
	// для внешних печатных форм у нас ПараметрыВывода уже заполнились в процедуре СформироватьПечатныеФормы (чуть выше), поэтому нам нельзя их затирать. Сделаем проверку
	Если НЕ ЗначениеЗаполнено(ПараметрыВывода) Тогда
	// <-- Конец Лико Ефимов ЕВВ 07.12.2023
	ПараметрыВывода = Неопределено;
	Параметры.Свойство("ПараметрыВывода", ПараметрыВывода);
	// --> Начало Лико Ефимов ЕВВ 30.11.2023
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 07.12.2023
	Если ПараметрыВывода = Неопределено Тогда
		//+Лико o.pukhova 26.01.18
		Если Параметры.Свойство("ПараметрыИсточника") И ТипЗнч(Параметры.ПараметрыИсточника) = Тип("Структура") И Параметры.ПараметрыИсточника.Свойство("ПараметрыВывода") Тогда
			ПараметрыВывода = Параметры.ПараметрыИсточника.ПараметрыВывода;
		Иначе
			ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
		КонецЕсли;
		//-Лико o.pukhova 26.01.18
	КонецЕсли;

	СоздатьРеквизитыИЭлементыФормыДляПечатныхФорм(КоллекцияПечатныхФорм);
	СохранитьНастройкиКомплектаПоУмолчанию();
	ЗагрузитьНастройкиКоличестваКопий();
	ЕстьРазрешенныйВывод = ЕстьРазрешенныйВывод();
	НастроитьВидимостьЭлементовФормы();
	УстановитьПризнакДоступностиВыводаВПредставленияхПечатныхФорм(ЕстьРазрешенныйВывод);
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() И ЭтоПечатьКомплекта() Тогда
		Элементы.Копий.Заголовок = НСтр("ru = 'Копий комплекта';
										|en = 'Set copies'");
	КонецЕсли;
	
	ДополнительнаяИнформация = Новый Структура("Картинка, Текст", Новый Картинка, "");
	МассивСсылок = Параметры.ПараметрКоманды;
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(МассивСсылок) Тогда
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивСсылок);
	КонецЕсли;
	
	Элементы.ДополнительнаяИнформация.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ДополнительнаяИнформация.Текст);
	Элементы.КартинкаИнформации.Картинка = ДополнительнаяИнформация.Картинка;
	Элементы.ГруппаДополнительнаяИнформация.Видимость = Не ПустаяСтрока(Элементы.ДополнительнаяИнформация.Заголовок);
	Элементы.КартинкаИнформации.Видимость = Элементы.КартинкаИнформации.Картинка.Вид <> ВидКартинки.Пустая;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.КоманднаяПанельЛеваяЧасть.Видимость = Ложь;
		Элементы.КоманднаяПанельПраваяЧасть.Видимость = Ложь;
		Элементы.НастройкиПечатныхФорм.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.КнопкаОтправитьВсеДействия.КнопкаПоУмолчанию = Истина;
		Элементы.Справка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
		Элементы.КнопкаИзменитьМакет.Видимость = Ложь;
		Элементы.ФлажокПодписьИПечать.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.НастройкаКоличестваКопий.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.Переместить(Элементы.КомандыПоказателей, Элементы.КомандыПоказателей.Родитель, Элементы.Показатель);
		Элементы.ГруппаКоманднаяПанель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	Если УправлениеПечатью.НастройкиПечати().СкрыватьПодписиИПечатиДляРедактирования Тогда
		АдресХранилищаРисунков = ПоместитьВоВременноеХранилище(ПодписиИПечатиТабличныхДокументов(), УникальныйИдентификатор);
	КонецЕсли;
	УбратьПодписьИПечать();
	
	ИнтеграцияПодсистемБСП.ПечатьДокументовПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	УправлениеПечатьюПереопределяемый.ПечатьДокументовПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность.Печать") Тогда
		МодульУправлениеПечатьюМультиязычность = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатьюМультиязычность");
		МодульУправлениеПечатьюМультиязычность.ЗаполнитьПодменюЯзык(ЭтотОбъект, , ДоступныеЯзыкиПечатныхФорм());
	КонецЕсли;
	
	УстановитьЗаголовокФормы();
	
	//+ ---> Лико m.shenderov 07.12.2023 Заглушка для темы письма по заказу поставщику
	
	Попытка
		Если ТипЗнч(Параметры.ПараметрКоманды[0])=Тип("ДокументСсылка.ЗаказПоставщику")
			ИЛИ  ТипЗнч(Параметры.ПараметрКоманды[0])=Тип("ДокументСсылка.Лико_ЗаказНаРаскрой")Тогда 
			лИмя=Строка(Параметры.ПараметрКоманды[0]);
			ПараметрыВывода.ПараметрыОтправки.Тема=лИмя;
			НастройкиПечатныхФорм[0].Название=лИмя;
		КонецЕсли;
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	//- <--- Лико m.shenderov 07.12.2023

КонецПроцедуры
