
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗаказНаОснастку") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоЗаказуОснастки", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ЗаказНаОснастку", Параметры.ЗаказНаОснастку);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоЗаказуОснастки", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ЗаказНаОснастку", Документы.Лико_ЗаказОснастки.ПустаяСсылка());
	КонецЕсли;

КонецПроцедуры
