

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ОрганизацияПоставщика;
	
КонецПроцедуры


 Процедура ОбработкаПроведения(Отказ, Режим)
	
	УдалениеТиповыхДокументов(Отказ);
	СформироватьДвижения();
	СформироватьТиповыеДокументы();
	УстановитьЦеныВзаказахКлиента();
	
КонецПроцедуры 


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УдалениеТиповыхДокументов(Отказ);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

Процедура СформироватьДвижения() 
	
	СформироватьЛико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены();

КонецПроцедуры 

Процедура СформироватьЛико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены() 
	Движения.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.Записывать = Истина;

	Если ВидДокумента = Перечисления.Лико_ВидыДокументаЛико_АктВыполненныхРабот.УстановкаДанныхДляЗаполнения Тогда
		Для Каждого ТекСтрокаЦены Из Цены Цикл
			Движение = Движения.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.Добавить();
			Движение.Период = Дата;
			Движение.ПлощадкаПоставщика = ПлощадкаПоставщика;
			Движение.ПлощадкаПокупателя = ПлощадкаПокупателя;
			
			ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаЦены);
			ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры 

Процедура СформироватьТиповыеДокументы() 
	
Если ВидДокумента = Перечисления.Лико_ВидыДокументаЛико_АктВыполненныхРабот.АктВыполненныхРабот Тогда
	
	Обработки.АктВыполненныхРаботДоп.СформироватьДокумент(ЭтотОбъект);  
	Обработки.ПриобретениеУслугПрочихАктивовДоп.СформироватьДокумент(ЭтотОбъект);
	
КонецЕсли;

КонецПроцедуры

Процедура УдалениеТиповыхДокументов(Отказ)
	
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("АктВыполненныхРабот","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПриобретениеУслугПрочихАктивов","Лико_Документ",Ссылка,Отказ);
	
	
КонецПроцедуры 

Процедура УстановитьЦеныВЗаказахКлиента()
	
	Если ВидДокумента = Перечисления.Лико_ВидыДокументаЛико_АктВыполненныхРабот.АктВыполненныхРабот Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Регистратор.ЗаказПокупателя КАК Заказ,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВтРаботы
		|ИЗ
		|	Документ.Лико_ВыполненныеРаботыМеждуОрганизациями.Работы КАК Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы
		|ГДЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.Цена КАК Цена,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.СтавкаНДС КАК СтавкаНДС,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.ЦеноваяГруппа КАК ЦеноваяГруппа
		|ПОМЕСТИТЬ ВтЦены
		|ИЗ
		|	Документ.Лико_ВыполненныеРаботыМеждуОрганизациями.Цены КАК Лико_ВыполненныеРаботыМеждуОрганизациямиЦены
		|ГДЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВтРаботы.Заказ КАК Заказ,
		|	ВтРаботы.Номенклатура КАК Номенклатура,
		|	ВтРаботы.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВтЦены.СтавкаНДС КАК СтавкаНДС,
		|	ВтЦены.Цена КАК Цена
		|ПОМЕСТИТЬ ВтЗаказЦены
		|ИЗ
		|	ВтРаботы КАК ВтРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЦены КАК ВтЦены
		|		ПО ВтРаботы.ЦеноваяГруппа = ВтЦены.ЦеноваяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтЗаказЦены.Заказ КАК Заказ,
		|	ВтЗаказЦены.Номенклатура КАК Номенклатура,
		|	ВтЗаказЦены.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВтЗаказЦены.СтавкаНДС КАК СтавкаНДС,
		|	ВтЗаказЦены.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Цена КАК ЦенаЗаказа,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДСЗаказа
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЗаказЦены КАК ВтЗаказЦены
		|		ПО ЗаказКлиентаТовары.Ссылка = ВтЗаказЦены.Заказ
		|			И ЗаказКлиентаТовары.Номенклатура = ВтЗаказЦены.Номенклатура
		|ГДЕ
		|	(ВтЗаказЦены.Цена <> ЗаказКлиентаТовары.Цена
		|			ИЛИ ВтЗаказЦены.СтавкаНДС <> ЗаказКлиентаТовары.СтавкаНДС)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура)
		|ПО
		|	Заказ";
		Запрос.УстановитьПараметр("Ссылка",Ссылка );
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			
			ЗаказОбъект = ВыборкаЗаказ.Заказ.ПолучитьОбъект();
			//ЗаказОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
			Выборка = ВыборкаЗаказ.Выбрать();
			Пока Выборка.Следующий() цикл
				НайтиСтрокиТоваров = ЗаказОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
				Для каждого Товар Из НайтиСтрокиТоваров Цикл 
					
					Товар.СтавкаНДС = Выборка.СтавкаНДС;
					Товар.Цена = Выборка.Цена; 
					ПараметрыРасчетаПересчитатьДанные(Дата, ЗаказОбъект.Площадка,Товар);
					
				КонецЦикла
			КонецЦикла;
			
			
			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказОбъект.Записать();
			
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры




Процедура ПараметрыРасчетаПересчитатьДанные(Дата, Площадка, Товар) // --> Начало Лико Яцун 14.12.2022
   // <-- Начало Лико Яцун С. В.   
	К_Дох = Лико_Планирование.ПолучитьКоэффициентНалоговВДоходности(Дата, Площадка);
	// <-- Конец Лико Яцун С. В. 

	Товар.стоимость = Товар.Цена*Товар.тираж;     
	Если ЗначениеЗаполнено(Товар.МетражКВМ) Тогда 
		Товар.ЦенаМ2 = Товар.стоимость/Товар.МетражКВМ;
    КонецЕсли;
	Товар.Доход = Товар.стоимость*К_Дох - Товар.себестоимость;   
	Если ЗначениеЗаполнено(Товар.Время) Тогда 
		Товар.Доходность = Товар.Доход/Товар.Время;    
	Иначе
		Товар.Доходность  = 0;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Товар.стоимость) Тогда 
   		Товар.рентабельность= Окр(Товар.Доход/Товар.стоимость*100,2);  
	Иначе
		Товар.рентабельность = 0;
	КонецЕсли; 
	
	Товар.ЦенаБезНДС = Товар.Цена*100/120; 
	
КонецПроцедуры // <-- Конец Лико Яцун 14.12.2022 



#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли



