
&После("ПриСозданииНаСервере")
Процедура Лико_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		//Помещать будем в свою группу, которую поместим в группу доп. реквизитов
		ГруппаДополнительныеРеквизиты = Форма.Элементы.Найти("ГруппаДополнительныеРеквизиты");
		Если ГруппаДополнительныеРеквизиты = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		//20200804 Иванова
		Элемент = Форма.Элементы.Добавить("Лико_ВесТары", Тип("ПолеФормы"), ГруппаДополнительныеРеквизиты);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Лико_ВесТары";
	КонецЕсли;        
	
	// --> Маковеева А.Ю. 06.02.2023
	Если Форма.ИмяФормы =  "Документ.ОтражениеЗарплатыВФинансовомУчете.Форма.ФормаДокумента" Тогда 
		Форма.Элементы.НачисленнаяЗарплатаИВзносыВзносыПоЕдиномуТарифу.ПутьКДаннымПодвала = "Объект.НачисленнаяЗарплатаИВзносы.ИтогВзносыПоЕдиномуТарифу";
	КонецЕсли;	       
	
	Если Форма.ИмяФормы = "Обработка.ЖурналДокументовБезналичныеПлатежи.Форма.ФормаСписка1" Тогда
		Элемент = Форма.Элементы.Добавить("Организация", Тип("ПолеФормы"), Форма.Элементы.Шапка);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.КнопкаОчистки = Истина;
		Элемент.ПутьКДанным = "Организация";
		Форма.Элементы.Переместить(Элемент, Элемент.Родитель, Форма.Элементы.БанковскийСчетОтбор);
		Элемент.УстановитьДействие("ПриИзменении", "Лико_ОрганизацияПриИзменении");
	КонецЕсли; 
	// <-- Маковеева А.Ю. 06.02.2023  
	
	Если Форма.ИмяФормы =  "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда 
		//--> Субботин Ю.В. 20.04.2023   
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Прайс", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 4)), "Объект.Товары", "Прайс", Ложь));
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
		Элемент = Форма.Элементы.Добавить("Прайс", Тип("ПолеФормы"), Форма.Элементы.Товары);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Товары.Прайс"; 
		Форма.Элементы.Переместить(Элемент, Форма.Элементы.Товары, Форма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыЦена);
        //<-- Субботин Ю.В. 20.04.2023
	КонецЕсли;  
	
	
КонецПроцедуры



