
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Партнер") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоПартнеру", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Партнер", Параметры.Партнер);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоПартнеру", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("Партнер", Справочники.Партнеры.ПустаяСсылка());
	КонецЕсли;
	Если Параметры.Свойство("Номенклатура") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНоменклатуре", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНоменклатуре", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	Если Параметры.Свойство("Город") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоГороду", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Город", Параметры.Город);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоГороду", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("Город", "");
	КонецЕсли;




КонецПроцедуры
