
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Док = Ссылка;
	НаборЗаписейПродажиДляДохода = РегистрыНакопления.Лико_ПродажиДляДохода.СоздатьНаборЗаписей();
	НаборЗаписейПродажиДляДохода.Отбор.Регистратор.Установить(Док);
	НаборЗаписейПродажиДляДохода.Записать();
	
	НаборЗаписейДоходМенеджеров = РегистрыНакопления.Лико_ДоходМенеджеров.СоздатьНаборЗаписей();
	НаборЗаписейДоходМенеджеров.Отбор.Регистратор.Установить(Док);
	НаборЗаписейДоходМенеджеров.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ДоходМенеджеровПродажи.ДатаЗакрытия КАК Период,
	|	Лико_ДоходМенеджеровПродажи.Ссылка КАК Регистратор,
	|	Лико_ДоходМенеджеровПродажи.Менеджер КАК Менеджер,
	|	Лико_ДоходМенеджеровПродажи.Заказ КАК Заказ,
	|	Лико_ДоходМенеджеровПродажи.Счет КАК Счет,
	|	Лико_ДоходМенеджеровПродажи.ДатаПродажи КАК ДатаПродажи,
	|	Лико_ДоходМенеджеровПродажи.ДокументПродажи КАК ДокументПродажи,
	|	Лико_ДоходМенеджеровПродажи.ДатаЗакрытия КАК ДатаЗакрытия,
	|	Лико_ДоходМенеджеровПродажи.Количество КАК Количество,
	|	Лико_ДоходМенеджеровПродажи.Стоимость КАК Стоимость,
	|	Лико_ДоходМенеджеровПродажи.Оплата КАК Оплата,
	|	Лико_ДоходМенеджеровПродажи.ОплатаЕвро КАК ОплатаЕвро,
	|	Лико_ДоходМенеджеровПродажи.Себестоимость КАК Себестоимость,
	|	Лико_ДоходМенеджеровПродажи.КоличествоДнейПросрочки КАК КоличествоДнейПросрочки,
	|	Лико_ДоходМенеджеровПродажи.Штраф КАК Штраф,
	|	Лико_ДоходМенеджеровПродажи.Доход КАК Доход,
	|	Лико_ДоходМенеджеровПродажи.КоличествоВыпуск КАК КоличествоВыпуск,
	|	Лико_ДоходМенеджеровПродажи.СебестоимостьВыпуск КАК СебестоимостьВыпуск,
	|	Лико_ДоходМенеджеровПродажи.МетражПлан КАК МетражПлан,
	|	Лико_ДоходМенеджеровПродажи.МетражФакт КАК МетражФакт,
	|	Лико_ДоходМенеджеровПродажи.МетражКВМ КАК МетражКВМ,
	|	Лико_ДоходМенеджеровПродажи.Выручка КАК Выручка,
	|	Лико_ДоходМенеджеровПродажи.Отгрузка КАК Отгрузка
	|ИЗ
	|	Документ.Лико_ДоходМенеджеров.Продажи КАК Лико_ДоходМенеджеровПродажи
	|ГДЕ
	|	Лико_ДоходМенеджеровПродажи.Ссылка = &ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.следующий() Цикл
		Запись =  НаборЗаписейДоходМенеджеров.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;
	НаборЗаписейДоходМенеджеров.Записать();

		

КонецПроцедуры
