#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует перечень значений - гистограмм
//
// Возвращаемое значение:
//    Массив - перечень значений.
Функция Гистограммы() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Гистограмма);
	Результат.Добавить(ГистограммаГоризонтальная);
	Результат.Добавить(ГистограммаГоризонтальнаяОбъемная);
	Результат.Добавить(ГистограммаНормированная);
	Результат.Добавить(ГистограммаНормированнаяГоризонтальная);
	Результат.Добавить(ГистограммаНормированнаяГоризонтальнаяОбъемная);
	Результат.Добавить(ГистограммаНормированнаяОбъемная);
	Результат.Добавить(ГистограммаОбъемная);
	Результат.Добавить(ГистограммаСНакоплением);
	Результат.Добавить(ГистограммаСНакоплениемГоризонтальная);
	Результат.Добавить(ГистограммаСНакоплениемГоризонтальнаяОбъемная);
	Результат.Добавить(ГистограммаСНакоплениемОбъемная);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли