
//&ИзменениеИКонтроль("ПередЗаписью")
//Процедура Лико_ПередЗаписью(Отказ)

//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;

//	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

//	Если НЕ ЗначениеЗаполнено(НаименованиеДляПечати) Тогда
//		НаименованиеДляПечати = СокрЛП(Наименование);
//	КонецЕсли;

//	ХозяйственнаяОперация = Справочники.ДоговорыКонтрагентов.ХозяйственнаяОперация(ТипДоговора, ВариантОформленияЗакупок);

//	ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиСправочника(
//	ЭтотОбъект,
//	Перечисления.СтатусыДоговоровКонтрагентов.НеСогласован);
//	Если ЗначениеЗаполнено(ДопустимаяСуммаЗадолженности) И НЕ ОграничиватьСуммуЗадолженности Тогда
//		ДопустимаяСуммаЗадолженности = 0;
//	КонецЕсли;

//	Если НЕ ЦентрализованныйДоговор Тогда
//		Филиалы.Очистить();
//	КонецЕсли;

//	ВзаиморасчетыСервер.ПередЗаписью(ЭтотОбъект, Отказ);

//	Если Не ЗаданГрафикИсполнения И ЗначениеЗаполнено(ГрафикИсполненияДоговора) Тогда
//		Попытка
//			ЗаблокироватьДанныеДляРедактирования(ГрафикИсполненияДоговора);
//			ГрафикИсполненияДоговора.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
//			ГрафикИсполненияДоговора = Неопределено;
//		Исключение
//			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//			ТекстОшибки,
//			Ссылка,,,
//			Отказ);
//		КонецПопытки;
//	КонецЕсли;

//	ОбщегоНазначенияУТ.ПодготовитьДанныеДляСинхронизацииКлючей(ЭтотОбъект, ПараметрыСинхронизацииКлючей());

//	// Отработка смены пометки удаления
//	Если Не ЭтоНовый()
//		И ПометкаУдаления <> ДополнительныеСвойства.ПометкаУдаленияДоЗаписи Тогда
//		Документы.ГрафикИсполненияДоговора.УстановитьПометкуУдаления(Ссылка, ПометкаУдаления);
//		//++ НЕ УТКА

//		//++ Устарело_Переработка24
//		УстановитьПометкуУдаленияДавальческихНазначений();
//		//-- Устарело_Переработка24

//		//-- НЕ УТКА
//	КонецЕсли;

//	ТребуетсяЗаполнениеШаблонаНазначения = Ложь;
//	ШаблонНазначения = Справочники.ДоговорыКонтрагентов.ШаблонНазначения(ЭтотОбъект);

//	Если ТипДоговора = Перечисления.ТипыДоговоров.СКомитентомНаЗакупку
//		И Константы.ВариантОбособленияТоваровВПродажах.Получить() = Перечисления.ВариантыОбособленияТоваровВПродажах.Договор Тогда

//		ТребуетсяЗаполнениеШаблонаНазначения = Истина;
//		//++ НЕ УТ
//	ИначеЕсли ТипДоговора  = Перечисления.ТипыДоговоров.СПереработчиком2_5
//		ИЛИ ТипДоговора  = Перечисления.ТипыДоговоров.СПереработчиком2_5_ЕАЭС
//		//++ НЕ УТКА
//		ИЛИ ТипДоговора  = Перечисления.ТипыДоговоров.СДавальцем2_5
//		//++ Устарело_Переработка24
//		ИЛИ ТипДоговора  = Перечисления.ТипыДоговоров.СДавальцем
//		//-- Устарело_Переработка24

//		//-- НЕ УТКА

//		//++ Устарело_Переработка24
//		ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком
//		//-- Устарело_Переработка24
//		ИЛИ Ложь Тогда

//		ТребуетсяЗаполнениеШаблонаНазначения = Истина;
//		//-- НЕ УТ
//	КонецЕсли;

//	Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(Назначение, ШаблонНазначения, ЭтотОбъект,
//	"НаправлениеДеятельности,Партнер,ТипДоговора", Отказ, Истина, НЕ ТребуетсяЗаполнениеШаблонаНазначения);

//	Если ТипДоговора = Перечисления.ТипыДоговоров.Импорт
//		//++ Устарело_Переработка24
//		Или ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком
//		//-- Устарело_Переработка24
//		Или ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5_ЕАЭС
//		Или ТипДоговора = Перечисления.ТипыДоговоров.ВвозИзЕАЭС
//		Или ТипДоговора = Перечисления.ТипыДоговоров.РеализацияЧерезКомиссионера
//		Или (ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
//		И ДоговорССамозанятым) Тогда

//		НалогообложениеНДСПоУмолчанию = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;

//		Если Перечисления.ТипыДоговоров.ЭтоДоговорПродажи(ТипДоговора) Тогда
//			ПараметрыЗаполнения = Справочники.ДоговорыКонтрагентов.ПараметрыЗаполненияНалогообложенияНДСПродажи(ЭтотОбъект);
//			УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДСПоУмолчанию, ПараметрыЗаполнения, Неопределено);
//		ИначеЕсли Перечисления.ТипыДоговоров.ЭтоДоговорЗакупки(ТипДоговора) Тогда
//			ПараметрыЗаполнения = Справочники.ДоговорыКонтрагентов.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ЭтотОбъект);
//			УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(НалогообложениеНДСПоУмолчанию, ПараметрыЗаполнения, Неопределено);
//		КонецЕсли;

//		#Вставка
//		//Маковеева А.Ю. 31.10.2025  заполняем ставку только, если она не заполнена
//		Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
//		#КонецВставки
//		УчетНДСУП.ЗаполнитьСтавкуНДСДляПлатежей(СтавкаНДС, НалогообложениеНДСПоУмолчанию, Организация, ДатаОкончанияДействия);
//		#Вставка
//		КонецЕсли;
//		#КонецВставки

//	КонецЕсли;

//	ДоговорыКонтрагентовЛокализация.ПередЗаписью(Отказ, ЭтотОбъект);
//КонецПроцедуры
