#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НайтиПоКоду(Код) Экспорт
	Если Код = "1" Тогда
		Возврат Амбулаторно;
	ИначеЕсли Код = "2" Тогда
		Возврат Стационар;
	ИначеЕсли Код = "3" Тогда
		Возврат ДневнойСтационар;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция НайтиПоСлучаюУхода(СлучайУхода) Экспорт
	Если Перечисления.СлучаиУходаЗаБольнымиДетьми.ЭтоСтационар(СлучайУхода) Тогда
		Возврат Стационар;
	Иначе
		Возврат Амбулаторно;
	КонецЕсли;
КонецФункции

Функция Код(РежимЛечения) Экспорт
	Если РежимЛечения = Амбулаторно Тогда
		Возврат "1";
	ИначеЕсли РежимЛечения = Стационар Тогда
		Возврат "2";
	ИначеЕсли РежимЛечения = ДневнойСтационар Тогда
		Возврат "3";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли