#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция Лико_ПолучитьТолькоДокументыОснованияСТоварамиУд(МассивВсехРаспоряжений, Отказ = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Валюта КАК Валюта,
	|	ДанныеДокументов.ВидКорректировки
	|
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	//++ НЕ УТ
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ОтгрузкаТоваровСХранения КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаСырьяПереработчику КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	//-- НЕ УТ
	//++ НЕ УТКА
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ПередачаДавальцу КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Валюта,
	|	ДанныеДокументов.ХозяйственнаяОперация
	|ИЗ
	|	Документ.ВозвратСырьяДавальцу КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивОбъектов)
	|
	//-- НЕ УТКА
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК ДокументОснование,
	|	ЛОЖЬ КАК Корректировочный
	|
	|ПОМЕСТИТЬ СчетаФактурыОснования
	|ИЗ
	|	ТаблицаДанныхДокументов КАК ДанныеДокументов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивВсехРаспоряжений);
	
	Запрос.Выполнить();
	
	РеализацияТоваровУслугЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ВозвратТоваровПоставщикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПеремещениеТоваровЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	//+ Лико m.shenderov 16.01.2019
	Документы.Лико_ПередачаТоваров.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
    //- Лико m.shenderov 16.01.2019

	КорректировкаРеализацииЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	
	//++ НЕ УТ
	ОтгрузкаТоваровСХраненияЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	ПередачаСырьяПереработчикуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
	//-- НЕ УТ
	
	//++ НЕ УТКА
	ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
	ПараметрыЗаполнения.ПересчитыватьВВалютуРегл = Ложь;
	ПередачаДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
	ВозвратСырьяДавальцуЛокализация.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, Ложь);
	//-- НЕ УТКА
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК Ссылка
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ДокументТовары
	|		
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК Ссылка
	|ИЗ
	|	ПередачаСырьяПереработчикуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка
	|ИЗ
	|	ОтгрузкаТоваровСХраненияТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
//-- НЕ УТ
//++ НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК Ссылка
	|ИЗ
	|	ПередачаДавальцуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка
	|ИЗ
	|	ВозвратСырьяДавальцуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар
//-- НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	ПеремещениеТоваровТаблицаТоваров КАК ПеремещениеТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка
	|ИЗ
	|	ТаблицаТоваровКорректировкаРеализации КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.ЭтоТовар
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка
	|ИЗ
	|	ВозвратТоваровПоставщикуТаблицаТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.ЭтоТовар";
		
	СтрокиТоваров = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивРаспоряженийСТоварами = Новый Массив;
	
	Пока СтрокиТоваров.Следующий() Цикл
		Если МассивРаспоряженийСТоварами.Найти(СтрокиТоваров.Ссылка) = Неопределено Тогда
			МассивРаспоряженийСТоварами.Добавить(СтрокиТоваров.Ссылка);	
		КонецЕсли;			
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивВсехРаспоряжений, Неопределено);
	
	МассивРаспоряженийБезТоваров = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивВсехРаспоряжений, МассивРаспоряженийСТоварами);
	              	
	Для Каждого РаспоряжениеБезТоваров Из МассивРаспоряженийБезТоваров Цикл
		ТекстСообщения = НСтр("ru = 'Документ ""%Документ%"" не может являться основанием для транспортной накладной, т.к. в нем отсутствует номенклатура типа ""%ТипТовар%"" или ""%ТипТара%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", РаспоряжениеБезТоваров);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипТовар%", Перечисления.ТипыНоменклатуры.Товар);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТипТара%", Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, РаспоряжениеБезТоваров,,,Отказ);
	КонецЦикла;
	
	Возврат МассивРаспоряженийСТоварами;
	
КонецФункции

#КонецЕсли
