
Процедура СоздатьDFMКоманды (Форма,Группа="DFMGroupButtons") Экспорт //+Лико m.shenderov 14.06.2021
	
	Если 	Форма.Элементы.Найти(Группа)=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.DFMGroupButtons.Вид=ВидГруппыФормы.ГруппаКнопок;
	Форма.Элементы.DFMGroupButtons.Отображение=ОтображениеГруппыКнопок.Компактное;
    
	
	// 1.Создадим команду создать продукт
    Команда		= Форма.Команды.Добавить("СоздатьНоменклатуруDFM2");
    Команда.Действие	= "СоздатьНоменклатуруDFM2";
	Команда.Заголовок   ="Новый продукт";
	Команда.Подсказка   ="Новый продукт";

	Команда.Картинка    =БиблиотекаКартинок.СкопироватьЭлементСписка;
	Команда.Отображение =ОтображениеКнопки.Картинка; 
	
	// Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("СоздатьНоменклатуруDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "СоздатьНоменклатуруDFM2";
	
	
	// 2.Создадим команду создать версию  
	   Команда		= Форма.Команды.Добавить("СоздатьВерсиюDFM2");
    Команда.Действие	= "СоздатьВерсиюDFM2";
	Команда.Заголовок   ="Изменить версию";
	Команда.Подсказка   ="Изменить версию";

	Команда.Картинка    =БиблиотекаКартинок.СкопироватьОбъект;
	Команда.Отображение =ОтображениеКнопки.Картинка;

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("СоздатьВерсиюDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "СоздатьВерсиюDFM2";
	
    // 3.Создадим команду  уведомить дизайнера  
	   Команда		= Форма.Команды.Добавить("УведомитьДизайнераDFM2");
    Команда.Действие	= "УведомитьДизайнераDFM2";
	Команда.Заголовок   ="Уведомить дизайнера";
	Команда.Подсказка   ="Уведомить дизайнера";

	Команда.Картинка    =БиблиотекаКартинок.ОтправитьСообщение;
	Команда.Отображение =ОтображениеКнопки.Картинка;

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("УведомитьДизайнераDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "УведомитьДизайнераDFM2";
	
       // 4.Создадим команду  Найти продукт  
	   Команда		= Форма.Команды.Добавить("НайтиПродуктDFM2");
    Команда.Действие	= "НайтиПродуктDFM2";
	Команда.Заголовок   ="Найти продукт";
	Команда.Подсказка   ="Найти продукт";

	Команда.Картинка    =БиблиотекаКартинок.ПравилоПоискаПримененоБЭД;
	Команда.Отображение =ОтображениеКнопки.Картинка;

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("НайтиПродуктDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "НайтиПродуктDFM2";

	
	
	  // 5.Создадим команду  Оригинал макет  
	   Команда		= Форма.Команды.Добавить("ОригиналМакетDFM2");
    Команда.Действие	= "ОригиналМакетDFM2";
	Команда.Заголовок   ="Оригинал макет";
	Команда.Подсказка   ="Оригинал макет";

	Команда.Картинка    =БиблиотекаКартинок.КарточкаТовара;
	Команда.Отображение =ОтображениеКнопки.Картинка;

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("ОригиналМакетDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "ОригиналМакетDFM2";

	

	
	
КонецПроцедуры //-Лико m.shenderov 14.06.2021


Процедура ОтправитьУведомлениеВDFMНаСервере(МассивВерсий,Дизайнер,Заказ,Комментарий) Экспорт //+Лико m.shenderov 10.06.2021

	//Ответ=Справочники.Лико_ВерсииНоменклатуры.ОтправитьУведомлениеВDFM(МассивВерсий,Дизайнер,Заказ,Комментарий);
    Ответ= Справочники.Лико_ВерсииНоменклатуры.ОтправитьУведомлениеВDFMДекоратор(МассивВерсий,Дизайнер,Заказ,Комментарий);

КонецПроцедуры  //-Лико m.shenderov 10.06.2021

Процедура СоздатьВерсиюНоменклатурыДляТехнологииАвто(Форма,Массив) Экспорт //+Лико m.shenderov 28.05.2021
        
	Если Не DFMСервер.ПроверкаЗаполненияПолей(Форма) Тогда
		Возврат
	КонецЕсли;
		ТехнологияПечати=Форма.Объект.РабочийЦентр.ВидРабочегоЦентра.лкТехнологияПечати;

	
	     Для Каждого Товар Из Массив Цикл
			
			
				
				СтруктураНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуру(
				Товар.Номенклатура.Наименование,
				Товар.Номенклатура.Лико_ТипЭтикетки,
				ТехнологияПечати,
				Товар.ВерсияНоменклатуры.Версия,
				Форма.Объект.Регион,
				Форма.Объект.Партнер,
				Форма.Объект.Менеджер,
				?(Товар.УведомитьДизайнера,Товар.Дизайнер,Неопределено),
				Истина,
				Товар.Номенклатура,
				Товар.Объект.Ссылка,
				Товар.Комментарий
);
				
				НайденныеСтроки = Форма.Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Товар.Номенклатура));
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
				
				НайденнаяСтрока.Артикул =СтруктураНоменклатуры.ВерсияНоменклатуры.Артикул;
				НайденнаяСтрока.Версия  =СтруктураНоменклатуры.Версия;
				НайденнаяСтрока.ВерсияНоменклатуры=СтруктураНоменклатуры.ВерсияНоменклатуры;
				КонецЦикла;

			//КонецЕсли;
			
				
		КонецЦикла;


		
КонецПроцедуры //-Лико m.shenderov 28.05.2021

Функция ВыполнитьПроверкуТехнологииПродукта(Форма) Экспорт 
	
	РЦ=Форма.Объект.РабочийЦентр;
	Отказ=Ложь;
	Массив = Новый Массив();
	ТехнологияПечати=РЦ.ВидРабочегоЦентра.лкТехнологияПечати;  
	Форма.Объект.НоменклатураDFM=DFMСервер.ЭтоНоменклатураDFM(Форма.Объект.РабочийЦентр,Форма.Объект.ТипЗаказа,Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.Цвета.Количество()>0,Форма.Объект.ДатаПервойОтправкиВРаботу);

	Если Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.НоменклатураDFM Тогда
		НомерСтроки=0;
		Для Каждого Товар Из Форма.Объект.Товары Цикл
			
			Если Товар.ВерсияНоменклатуры.ТехнологияПечати<>ТехнологияПечати Тогда
				Если Форма.Объект.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
				СтруктураНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуру(Товар.Номенклатура.Наименование,
				Товар.Номенклатура.Лико_ТипЭтикетки,ТехнологияПечати,Неопределено,
				Форма.Объект.Регион,Форма.Объект.Партнер,Форма.Объект.Менеджер,Форма.Объект.Дизайнер,Истина,Товар.Номенклатура,,,Форма.Объект.Заказ);	
				
				Товар.Артикул=СтруктураНоменклатуры.ВерсияНоменклатуры.Артикул;
				Товар.Версия=СтруктураНоменклатуры.Версия;
				Товар.ВерсияНоменклатуры=СтруктураНоменклатуры.ВерсияНоменклатуры;
				
				
			Иначе
				Структура = Новый Структура;
				Структура.Вставить("Номенклатура",Товар.Номенклатура);
				Структура.Вставить("ВерсияНоменклатуры",Товар.ВерсияНоменклатуры);
               Массив.Добавить(Структура); 
				
				Отказ=Истина;
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = СтрШаблон("Продукт: %1 не соответсвует технологии! Создатйте версиию продукта с технологией:%2.",Товар.Номенклатура,ТехнологияПечати);
				//Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита 
				//Сообщение.УстановитьДанные(Объект);
				//Сообщение.Сообщить();
			КонецЕсли;
			
			КонецЕсли;
			НомерСтроки=НомерСтроки+1;	
		КонецЦикла;
		
			
	КонецЕсли;
Возврат Массив;
КонецФункции

Функция ПроверкаЗаполненияПолей(Форма) Экспорт  //+Лико m.shenderov 28.04.2021
	Результат=Истина;
		СообщитьПользователю(Форма.Объект.Менеджер,"Форма.Объект.Менеджер","Менеджер",Результат);
        СообщитьПользователю(Форма.Объект.Партнер,"Форма.Объект.Партнер","Клиент",Результат); 
		//СообщитьПользователю(Объект.Дизайнер,"Объект.Дизайнер","Дизайнер",Результат); 

	Возврат Результат;	
КонецФункции //-Лико m.shenderov 28.04.2021 

Процедура СообщитьПользователю(Поле,РеквизитПоля,Текст,Результат) Экспорт 
	Если Не ЗначениеЗаполнено(Поле) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не заполнен реквизит: %1",Текст);
		Сообщение.Поле = РеквизитПоля; //имя реквизита 
		
		Сообщение.Сообщить(); 		
		Результат=Ложь;	
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТехнологиюПечати(Объект) Экспорт//+Лико m.shenderov 14.06.2021
	Если Объект.Площадка=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
		Для каждого РабочийЦентр Из Объект.РабочиеЦентры Цикл
			
			Если РабочийЦентр.ВидРабочегоЦентра= Справочники.ВидыРабочихЦентров.Comexi Тогда 
				Возврат ПолучитьТехнологиюПечатиComexi(Объект.ВидыПечати);			
			КонецЕсли;
		КонецЦикла; 
		Возврат  Справочники.Лико_ТехнологияПечати.ПустаяСсылка(); 
	КонецЕсли;
	
	Возврат Объект.РабочийЦентр.ВидРабочегоЦентра.лкТехнологияПечати; 
КонецФункции  //-Лико m.shenderov 14.06.2021

Функция ПолучитьТехнологиюПечатиComexi(ВидыПечати) Экспорт  //+Лико m.shenderov 15.03.2022
	Глубокая	= Ложь;
	Офсет		= Ложь;
	Флексо		= Ложь;   
	Для каждого ВидПечати Из ВидыПечати Цикл  
		Если ВидПечати=Перечисления.Лико_ВидыПечати.Глубокая Тогда
			Глубокая=Истина;
		ИначеЕсли  ВидПечати=Перечисления.Лико_ВидыПечати.Офсет Тогда
			Офсет = Истина;
		ИначеЕсли  ВидПечати=Перечисления.Лико_ВидыПечати.Флексо Тогда
			Флексо = Истина; 
		КонецЕсли;	
	КонецЦикла; 
	
	Если Глубокая И Офсет И Флексо Тогда 
		Возврат Справочники.Лико_ТехнологияПечати.Офсет_Флексо_Глубокая;
	ИначеЕсли Глубокая И Офсет  Тогда 
		Возврат Справочники.Лико_ТехнологияПечати.Офсет_Глубокая; 
	ИначеЕсли Глубокая И Флексо  Тогда 
		Возврат Справочники.Лико_ТехнологияПечати.Флексо_Глубокая;
	ИначеЕсли Офсет И Флексо  Тогда 
		Возврат Справочники.Лико_ТехнологияПечати.Офсет_Флексо;
	ИначеЕсли  Офсет  Тогда 
		Возврат Справочники.Лико_ТехнологияПечати.Офсет;
	ИначеЕсли  Глубокая  Тогда 
		Возврат Справочники.Лико_ТехнологияПечати.Глубокая;
	КонецЕсли;

	Возврат Справочники.Лико_ТехнологияПечати.ПустаяСсылка();
	
КонецФункции //-Лико m.shenderov 15.03.2022 


Функция СоздатьНоменклатуру(Параметры) Экспорт //+Лико m.shenderov 14.06.2021
	Возврат Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуру(
				Параметры.Товар.Номенклатура.Наименование,
				Параметры.Товар.Номенклатура.Лико_ТипЭтикетки,
				//Параметры.ТехнологияПечати,
				Параметры.Товар.ВерсияНоменклатуры.Версия,
				Параметры.Регион,
				Параметры.Партнер,
				Параметры.Менеджер,
				?(Параметры.Товар.УведомитьДизайнера,Параметры.Товар.Дизайнер,Неопределено),
				Истина,
				Параметры.Товар.Номенклатура,
				,
				,
				Параметры.Заказ,
				Параметры.Комментарий
				);
	
КонецФункции //-Лико m.shenderov 14.06.2021 

Процедура УстановитьВидимость300125(Форма,Группа="DFMGroupButtons") Экспорт //+Лико m.shenderov 14.06.2021
	Форма.Элементы.НоменклатураDFM.Видимость = Ложь;
	////КонецЕсли;
	
	Если Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.НоменклатураDFM Или Форма.ПоказатьDFM Тогда 
		Форма.Элементы[Группа].Видимость=Истина;
		Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Ложь;
		форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Ложь;
 
		Для каждого Товар Из Форма.Объект.Товары Цикл
			Если ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) Тогда
				Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Истина;
			КонецЕсли; 		
			
		КонецЦикла;
		Если Форма.Объект.Площадка<>Справочники.Лико_Площадки.Линкс 
			И  Форма.Объект.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда 
			//Форма.Элементы[Группа].Доступность      =Ложь;
			Форма.Элементы.СоздатьНоменклатуруDFM2.Доступность=Ложь;
			Форма.Элементы.СоздатьВерсиюDFM2.Доступность=Ложь; 		
			форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Истина;
			
		КонецЕсли;
		
		Если  Форма.ПоказатьDFM Тогда
			Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Истина;
			Форма.Элементы.СоздатьВерсиюDFM2.Доступность=Истина; 		
			форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Ложь; 
			Форма.Элементы.СоздатьНоменклатуруDFM2.Доступность=Истина;
			
		КонецЕсли; 	
		
	Иначе
		Форма.Элементы[Группа].Видимость=Ложь;
	КонецЕсли;	
	
КонецПроцедуры //-Лико m.shenderov 14.06.2021

Процедура УстановитьВидимость(Форма,Группа="DFMGroupButtons") Экспорт //+Лико m.shenderov 14.06.2021
	Форма.Элементы.НоменклатураDFM.Видимость = Ложь;
	////КонецЕсли;
	
	Если Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.НоменклатураDFM Или Форма.ПоказатьDFM Тогда 
		Форма.Элементы[Группа].Видимость=Истина;
		Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Ложь;
		форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Ложь;
 
		Для каждого Товар Из Форма.Объект.Товары Цикл
			Если ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) Тогда
				Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Истина;
			КонецЕсли; 		
			
		КонецЦикла;
		Если Форма.Объект.Площадка<>Справочники.Лико_Площадки.Линкс 
			И  Форма.Объект.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда 
			//Форма.Элементы[Группа].Доступность      =Ложь;
			Форма.Элементы.СоздатьНоменклатуруDFM2.Доступность=Ложь;
			Форма.Элементы.СоздатьВерсиюDFM2.Доступность=Ложь; 		
			форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Истина;
			
		КонецЕсли;
		
		Если  Форма.ПоказатьDFM Тогда
			Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Истина;
			Форма.Элементы.СоздатьВерсиюDFM2.Доступность=Истина; 		
			форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Ложь; 
			Форма.Элементы.СоздатьНоменклатуруDFM2.Доступность=Истина;
			
		КонецЕсли; 
		Если Форма.Объект.Площадка = Справочники.Лико_Площадки.Линкс Тогда
			Форма.Элементы.НайтиПродуктDFM2.Доступность=Истина;
		Иначе
			Форма.Элементы.НайтиПродуктDFM2.Доступность=Ложь;
		КонецЕсли;
		
		
	Иначе
		Форма.Элементы[Группа].Видимость=Ложь;
	КонецЕсли;	
	
КонецПроцедуры //-Лико m.shenderov 14.06.2021


Функция ЭтоНоменклатураDFM(РЦ,ТипЗаказа,ДатаНачалаУчетаDFM,ДатаПервойОтправкиВРаботу = Неопределено, Товары=Неопределено) Экспорт  //+Лико m.shenderov 15.06.2021
	Результат=Ложь;
	Если ЗначениеЗаполнено(Товары)   Тогда
		
		Для Каждого Товар Из Товары Цикл 		
			
			Если ТипЗнч(Товары)=Тип("Массив") Тогда
				
				Если Товар.Лико_DFM Тогда
					
					Возврат  Истина;
					
				КонецЕсли;
				
				
			Иначе
				
				Если Товар.Номенклатура.Лико_DFM Тогда
					
					Возврат  Истина;
					
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
	Если  РЦ.Лико_Площадка = Справочники.Лико_Площадки.Линкс
		Или РЦ.ВидРабочегоЦентра.лкТехнологияПечати = Справочники.Лико_ТехнологияПечати.GallusInkjet		
		//Или  (ДатаНачалаУчетаDFM и РЦ.ВидРабочегоЦентра.лкТехнологияПечати = Справочники.Лико_ТехнологияПечати.Comexi)
		Или  (ДатаНачалаУчетаDFM и ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка) 
		Или  (ДатаНачалаУчетаDFM и ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка) 

		Тогда		
		Результат = Истина;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 24.11.2025
	Если НЕ Результат
		И РЦ.Лико_Площадка = Справочники.Лико_Площадки.Ликофлекс 
		И (РЦ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.MPSOfset
		ИЛИ РЦ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Drent
		ИЛИ РЦ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.MO3300)
		Тогда
		ДатаПереходаНаDFMНовыхЗаказов = Справочники.Лико_ПредопределенныеЗначения.ДатаПереходаНаDFMНовыхЗаказов.ЗначениеПараметра;
		Если ДатаПервойОтправкиВРаботу <> Неопределено 
			И (ДатаПервойОтправкиВРаботу = Дата(1,1,1) И ЗначениеЗаполнено(ДатаПереходаНаDFMНовыхЗаказов) ИЛИ ЗначениеЗаполнено(ДатаПереходаНаDFMНовыхЗаказов) И ДатаПервойОтправкиВРаботу > ДатаПереходаНаDFMНовыхЗаказов) Тогда 
			Результат = Истина; 
		КонецЕсли;
	КонецЕсли;
	// <-- Начало Лико Яцун С. В. 24.11.2025
	
	Возврат Результат;
	
КонецФункции //-Лико m.shenderov 15.06.2021 

Процедура СтартDFM(Форма) Экспорт //+Лико m.shenderov 14.06.2021

//+ Лико m.shenderov 05.05.2021 	
	Если Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаСозданияНоменклатурыDFM.ЗначениеПараметра<ТекущаяДата() Тогда 
		Форма.ДатаНачалаСозданияНоменклатурыDFM=Истина;
	КонецЕсли;

		
КонецПроцедуры //-Лико m.shenderov 14.06.2021

Процедура УстановитьВидимостьСтар(Форма,Группа="DFMGroupButtons") Экспорт //+Лико m.shenderov 14.06.2021
	Форма.Элементы.НоменклатураDFM.Видимость = Ложь;
	////КонецЕсли;
	
	Если Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.НоменклатураDFM Тогда 
		Форма.Элементы[Группа].Видимость=Истина;
		Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Ложь;
		форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Ложь;
 
		Для каждого Товар Из Форма.Объект.Товары Цикл
			Если ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) Тогда
				Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Истина;
			КонецЕсли; 		
			
		КонецЦикла;
		Если Форма.Объект.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда 
			//Форма.Элементы[Группа].Доступность      =Ложь;
			Форма.Элементы.СоздатьНоменклатуруDFM2.Доступность=Ложь;
			Форма.Элементы.СоздатьВерсиюDFM2.Доступность=Ложь; 		
			форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Истина;
			
		КонецЕсли;
		
	Иначе
		Форма.Элементы[Группа].Видимость=Ложь;
	КонецЕсли;	
	
КонецПроцедуры //-Лико m.shenderov 14.06.2021

Функция ЭтоВерсияНоменклатуры(Версия,Номенклатура) Экспорт  //+Лико m.shenderov 28.02.2024
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Возврат ?(ЗначениеЗаполнено(Версия),Версия.Номенклатура=Номенклатура,Истина);
	
КонецФункции //-Лико m.shenderov 28.02.2024 

Функция ВерсияНоменклатурыСтруктура(ВерсияНоменклатуры) Экспорт  //+Лико m.shenderov 09.12.2025
  Структура = Новый Структура;
  Структура.Вставить("ФайлСогласования");
  Структура.Вставить("Согласовано");
   Структура.Вставить("Артикул");
  ЗаполнитьЗначенияСвойств(Структура,ВерсияНоменклатуры);
  Возврат Структура  
	
КонецФункции  //-Лико m.shenderov 09.12.2025

Процедура СоздатьDFMКоманды101225 (Форма,Группа="DFMGroupButtons") Экспорт //+Лико m.shenderov 14.06.2021
	
	Если 	Форма.Элементы.Найти(Группа)=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.DFMGroupButtons.Вид=ВидГруппыФормы.ГруппаКнопок;
	Форма.Элементы.DFMGroupButtons.Отображение=ОтображениеГруппыКнопок.Компактное;
    
	
	// 1.Создадим команду создать продукт
    Команда		= Форма.Команды.Добавить("СоздатьНоменклатуруDFM2");
    Команда.Действие	= "СоздатьНоменклатуруDFM2";
	Команда.Заголовок   ="Новый продукт";
	Команда.Подсказка   ="Новый продукт";

	Команда.Картинка    =БиблиотекаКартинок.СкопироватьЭлементСписка;
	Команда.Отображение =ОтображениеКнопки.Картинка; 
	
	// Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("СоздатьНоменклатуруDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "СоздатьНоменклатуруDFM2";
	
	
	// 2.Создадим команду создать версию  
	   Команда		= Форма.Команды.Добавить("СоздатьВерсиюDFM2");
    Команда.Действие	= "СоздатьВерсиюDFM2";
	Команда.Заголовок   ="Изменить версию";
	Команда.Подсказка   ="Изменить версию";

	Команда.Картинка    =БиблиотекаКартинок.СкопироватьОбъект;
	Команда.Отображение =ОтображениеКнопки.Картинка;

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("СоздатьВерсиюDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "СоздатьВерсиюDFM2";
	
    // 3.Создадим команду  уведомить дизайнера  
	   Команда		= Форма.Команды.Добавить("УведомитьДизайнераDFM2");
    Команда.Действие	= "УведомитьДизайнераDFM2";
	Команда.Заголовок   ="Уведомить дизайнера";
	Команда.Подсказка   ="Уведомить дизайнера";

	Команда.Картинка    =БиблиотекаКартинок.ОтправитьСообщение;
	Команда.Отображение =ОтображениеКнопки.Картинка;

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("УведомитьДизайнераDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "УведомитьДизайнераDFM2";
	
       // 4.Создадим команду  Найти продукт  
	   Команда		= Форма.Команды.Добавить("НайтиПродуктDFM2");
    Команда.Действие	= "НайтиПродуктDFM2";
	Команда.Заголовок   ="Найти продукт";
	Команда.Подсказка   ="Найти продукт";

	Команда.Картинка    =БиблиотекаКартинок.ПравилоПоискаПримененоБЭД;
	Команда.Отображение =ОтображениеКнопки.Картинка;

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= Форма.Элементы.Добавить("НайтиПродуктDFM2", Тип("КнопкаФормы"), Форма.Элементы.DFMGroupButtons);
    Кнопка.ИмяКоманды	= "НайтиПродуктDFM2";

	
	
КонецПроцедуры //-Лико m.shenderov 14.06.2021
