
&НаКлиенте
Процедура СформироватьИОткрытьФормуЗаказа(ВыбЗнач,Параметры)
	ФормаЗаказа = ПолучитьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента");
	ДанныеФормы = ФормаЗаказа.Объект;
	ЗаполнитьПОСпецификацииНаСервере(Параметры, ВыбЗнач, ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы,ФормаЗаказа.Объект);
	ОткрытьФорму(ФормаЗаказа);
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СформироватьИОткрытьФормуЗаказа(1, ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВарианта(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		СформироватьИОткрытьФормуЗаказа(ВыбЗнач, Параметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПОСпецификацииНаСервере(Спецификация, НомерВарианта, ДанныеФормы);

	НовыйЗаказ = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ЗаказКлиента"));
	НовыйЗаказ.Партнер	=   Спецификация.Партнер;
	НовыйЗаказ.Контрагент	=   Спецификация.Контрагент;
	НовыйЗаказ.Соглашение	=   Спецификация.Соглашение;
	НовыйЗаказ.Регион	=   Спецификация.Регион;
	НовыйЗаказ.ТипЗаказа	=   Спецификация.ТипЗаказа;
	НовыйЗаказ.Площадка	=   Спецификация.Площадка;
	НовыйЗаказ.ОсновнойМатериал	=   Спецификация.ОсновнойМатериал;
	НовыйЗаказ.цвета.Очистить();
	НовыйЗаказ.ВидыРабот.Очистить();
	НовыйЗаказ.Формы.Очистить();   
	Для каждого стртовары Из Спецификация.Товары Цикл
		стрТоварыновая = НовыйЗаказ.Товары.добавить();
		ЗаполнитьЗначенияСвойств(стрТоварыновая, стртовары);	
		стрТоварыновая.КоличествоУпаковок  =стрТовары.Количество;
	КонецЦикла;
	ОтборПоВарианту = Новый Структура("НомерВарианта", НомерВарианта);
	МассивСтрок = Спецификация.Цвета.НайтиСтроки(ОтборПоВарианту);
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		СтрЦвета = НовыйЗаказ.цвета.Добавить();
		ЗаполнитьЗначенияСвойств(стрцвета,ЭлементМассива, , "НомерВарианта, Ключстроки");
		стрЦвета.НомерВарианта = 1;
		стрЦвета.КлючСтроки = Новый УникальныйИдентификатор;
		СтрокиФорм = НовыйЗаказ.Формы.НайтиСтроки(Новый Структура("КлючСтроки", ЭлементМассива.КлючСтроки)) ;
		Для Каждого стрФорм из СтрокиФорм Цикл
			новаястрформ = НовыйЗаказ.Формы.добавить();
			ЗаполнитьЗначенияСвойств(новаястрформ, стрформ);
			новаястрформ.КлючСтроки = СтрЦвета.ключстроки;
		КонецЦикла;	
		Если не ЗначениеЗаполнено(стрЦвета.НомерПроката) Тогда 
			стрЦвета.НомерПроката = 1;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(НовыйЗаказ, Спецификация, "ШиринаЭтикетки,ДлинаЭтикетки,ЭтМЭР,Нарезка,ПлощадьКлише,ДопускМинус,ДопускПлюс,Раппорт,ШтампВырубной,
	|Ручьи,ЭтикетокНаЛисте,ШагПечати,Z,РучьиПечати,ЭтикетокНаЛистеПечати,ДлинаПечати,КоличествоЭтПоДлинеПечати,
	|КоличествоЛистовКнижки,КоличествоКликов,РучьиПечатиИндиго,ЭтикетокНаЛистеИндиго,ДлинаПечатиИндиго,
	|КоличествоЭтПоДлинеПечатиИндиго,КоличествоШтамповПоДлинеПечатиИндиго,ВидВырубки,РабочийЦентр,Книжка,КнижныйМодуль,Цифровой,
	|ЧестныйЗнак,ТипографскийАгрегат");
	
	ЗначениеВДанныеФормы(НовыйЗаказ,ДанныеФормы);

КонецПроцедуры                  