&Вместо("ЗаполнитьПараметрыИнициализации")
 Процедура Лико_ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект)
	 
	 ДокументСсылка = ДокументОбъект.Ссылка;
	 
	 Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	 Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЛикоРаспределениеРасходовПоЭтапам.Дата КАК Период,
	 |	ЛикоРаспределениеРасходовПоЭтапам.Склад КАК Склад,
	 |	ЛикоРаспределениеРасходовПоЭтапам.Получатель КАК Получатель
	 |ИЗ
	 |	Документ.ЛикоРаспределениеРасходовПоЭтапам КАК ЛикоРаспределениеРасходовПоЭтапам
	 |ГДЕ
	 |	ЛикоРаспределениеРасходовПоЭтапам.Ссылка = &Ссылка";
	 
	 Реквизиты = Запрос.Выполнить().Выбрать();
	 Реквизиты.Следующий();
	 
	 
	 Запрос.УстановитьПараметр("Период",                         Реквизиты.Период);
	 Запрос.УстановитьПараметр("Получатель",                     Реквизиты.Получатель);
	 Запрос.УстановитьПараметр("Склад",                          Реквизиты.Склад);
	 Запрос.УстановитьПараметр("Помещение",                      Справочники.СкладскиеПомещения.ПустаяСсылка());
	 Запрос.УстановитьПараметр("Действие",                      	Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить);
	 Запрос.УстановитьПараметр("Назначение",                     Справочники.Назначения.ПустаяСсылка());
	 Запрос.УстановитьПараметр("ЗаданиеНаПеревозку",             Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	 Запрос.УстановитьПараметр("СкладскаяОперация",            	Перечисления.СкладскиеОперации.ПередачаВПроизводствоОтгрузка);
	 
	 
	 
 КонецПроцедуры
