
&Вместо("СоздатьРедактироватьСписание")
Процедура Лико_СоздатьРедактироватьСписание(РежимЗаписи,Отказ) 
		Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Распоряжение) Тогда
			//Возврат;
		КонецЕсли; 	
		
		
		
		Если ЗначениеЗаполнено(Распоряжение) Тогда
			НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
			Если НовоеРаспоряжение=Неопределено Тогда
				НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
				//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
			КонецЕсли;  				
		Иначе
			НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
			//НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
		КонецЕсли;
		НовоеРаспоряжение.Организация=Организация;
		НовоеРаспоряжение.ПометкаУдаления=Ложь;
		НовоеРаспоряжение.Подразделение=Подразделение;
		НовоеРаспоряжение.Дата=КонецМесяца(Месяц);
		НовоеРаспоряжение.Склад=Склад;
		Тз=ТаблицаРаспределения.Выгрузить();
		Тз.Свернуть("Номенклатура,Характеристика,Упаковка","Количество,КоличествоУпаковок");
		НовоеРаспоряжение.Товары.Загрузить(ТЗ); 
		НовоеРаспоряжение.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		Для каждого Товар Из НовоеРаспоряжение.Товары  Цикл
			Если ЗначениеЗаполнено(Товар.Номенклатура.Лико_СтатьяРасходов) Тогда
				Товар.СтатьяРасходов=Товар.Номенклатура.Лико_СтатьяРасходов;
			Иначе
				Товар.СтатьяРасходов=Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Товар.Номенклатура);
				Если Не ЗначениеЗаполнено(Товар.СтатьяРасходов) Тогда
					Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяСписанияМатериаловНеопределена.ЗначениеПараметра;  
				КонецЕсли;
				
			КонецЕсли;
			
			
			
			
			
			Товар.АналитикаРасходов=Справочники.Лико_ПредопределенныеЗначения.АналитикаРасходовСписанияМатериалов.ЗначениеПараметра;
			//Товар.Упаковка=Товар.Номенклатура.ЕдиницаИзмерения;
			//Товар.КоличествоУпаковок=Товар.Количество;
		КонецЦикла;
		Если  НовоеРаспоряжение.Товары.Количество()=0 Тогда
			Возврат ;
		КонецЕсли;
		
		Попытка 
			
			НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 				
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + НовоеРаспоряжение + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
			
		КонецПопытки;
		Распоряжение=НовоеРаспоряжение.Ссылка;
		
		
	КонецПроцедуры 

&Вместо("ОбработкаПроведения")
	Процедура Лико_ОбработкаПроведения(Отказ, РежимПроведения)


		//+ ---> Лико2.5 m.shenderov 22.04.2022
		ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);  
		//- <--- Лико2.5 m.shenderov 22.04.2022

         СозатьНаборЗаписейРаспределения(Отказ);

	КонецПроцедуры
	
	
