Процедура ФормированиеТекстаЗапроса(Текст) //+Лико m.shenderov 19.12.2017
Текст="ВЫБРАТЬ
      |	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
      |	ПооперационноеРасписание2_2.Этап КАК Этап,
      |	ПооперационноеРасписание2_2.Этап.Распоряжение КАК ЗаказНаПроизводство,
      |	ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование КАК ЗаказКлиента,
      |	ПооперационноеРасписание2_2.Этап.НомерПроката КАК НомерПроката,
      |	ПооперационноеРасписание2_2.Начало КАК Начало,
      |	ПооперационноеРасписание2_2.Этап.ВидЭтапа КАК ВидЭтапа,
      |	ПооперационноеРасписание2_2.Окончание КАК Окончание,
      |	ВЫБОР
      |		КОГДА ПооперационноеРасписание2_2.Выполняется = 1
      |			ТОГДА ИСТИНА
      |		ИНАЧЕ ЛОЖЬ
      |	КОНЕЦ КАК НаПроизводстве
      |ПОМЕСТИТЬ ВТ_ЗагрузкаРЦ
      |ИЗ
      |	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
      |ГДЕ
      |	ПооперационноеРасписание2_2.Выполнено = 0
      |	И НЕ ПооперационноеРасписание2_2.Моделирование
      |;
      |
      |////////////////////////////////////////////////////////////////////////////////
      |ВЫБРАТЬ
      |	ВТ_ЗагрузкаРЦ.ЗаказКлиента КАК Заказ,
      |	Заказ.НомерБезПрефикса КАК НомерЗаказа,
      |	ВТ_ЗагрузкаРЦ.НомерПроката КАК НомерПроката,
      |	ВТ_ЗагрузкаРЦ.ЗаказКлиента.Партнер КАК Заказчик,
      |	Заказ.Этикетки КАК Этикетки,
      |	Заказ.МетражКВМ КАК МетражКВМ,
      |	Заказ.МетражПМ КАК МетражПМ,
      |	Заказ.Нарезка КАК Нарезка,
      |	Заказ.Z КАК Z,
      |	ВТ_ЗагрузкаРЦ.ЗаказКлиента.ОсновнойМатериал КАК Материал,
      |	Заказ.ПоставщикМатериалаЛюбой КАК ПоставщикЛюбой,
      |	Заказ.ШтампыСтрокой КАК ШтампыСтрокой,
      |	Заказ.ШтампВырубной КАК ШтампВырубной,
      |	Заказ.ЦветаСтрокой КАК ЦветаСтрокой,
      |	Заказ.Регион КАК Регион,
      |	ВТ_ЗагрузкаРЦ.Начало КАК ВремяНачала,
      |	ВТ_ЗагрузкаРЦ.РабочийЦентр КАК РабочийЦентр,
      |	Заказ.ДатаОтгрузки КАК СрокСдачи,
      |	ВТ_ЗагрузкаРЦ.Окончание КАК ВремяОкончания,
      |	РАЗНОСТЬДАТ(ВТ_ЗагрузкаРЦ.Начало, ВТ_ЗагрузкаРЦ.Окончание, ЧАС) КАК ВремяВыполнения,
      |	ВТ_ЗагрузкаРЦ.НаПроизводстве КАК НаПроизводстве,
      |	Заказ.ВидЗаказа КАК ВидЗаказа,
      |	Заказ.ФормыСтрокой КАК ФормыСтрокой,
      |	Заказ.Ручьи КАК Ручьи,
      |	Заказ.ШагПечати КАК ШагПечати,
      |	Заказ.ДлинаЭтикетки КАК ДлинаЭтикетки,
      |	Заказ.ШиринаЭтикетки КАК ШиринаЭтикетки,
      |	Заказ.ПлощадьКлише КАК ПлощадьКлише,
      |	Заказ.СрочноеЦветоделение КАК СрочноеЦветоделение,
      |	Заказ.Тираж КАК Тираж,
      |	Заказ.ДатаУтвержденияРабот КАК ДатаУтвержденияРабот,
      |	Заказ.БезЛака КАК БезЛака,
      |	ВТ_ЗагрузкаРЦ.Этап КАК Этап,
      |	ВТ_ЗагрузкаРЦ.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
      |	ВТ_ЗагрузкаРЦ.ВидЭтапа КАК ВидЭтапа,
      |	Заказ.Площадка КАК Площадка,
      |	Лико_ПодготовленныеМатериалы.ДатаПриходаМатериала КАК ДатаПриходаМатериала,
      |	Лико_ПодготовленныеМатериалы.ДатаПроверкиНаличияМатериала КАК ДатаПроверкиНаличияМатериала,
      |	Лико_ПодготовленныеМатериалы.ЗаменаМатериала КАК ЗаменаМатериала,
      |	Лико_ПодготовленныеМатериалы.ЗаменаНарезки КАК ЗаменаНарезки,
      |	Лико_ПодготовленныеМатериалы.ЗаменаДопМатериалов КАК ЗаменаДопМатериалов,
      |	Лико_ПодготовленныеМатериалы.НаличиеМатериала КАК НаличиеМатериала
      |ИЗ
      |	ВТ_ЗагрузкаРЦ КАК ВТ_ЗагрузкаРЦ
      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Заказ
      |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Заказ.Ссылка
      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПодготовленныеМатериалы КАК Лико_ПодготовленныеМатериалы
      |		ПО ВТ_ЗагрузкаРЦ.ЗаказКлиента = Лико_ПодготовленныеМатериалы.ЗаказКлиента
      |			И ВТ_ЗагрузкаРЦ.НомерПроката = Лико_ПодготовленныеМатериалы.НомерПроката
      |ГДЕ
      |	ВЫБОР
      |			КОГДА &НовыеЗаказы
      |				ТОГДА Лико_ПодготовленныеМатериалы.Регистратор ЕСТЬ NULL
      |			ИНАЧЕ НЕ Лико_ПодготовленныеМатериалы.Регистратор ЕСТЬ NULL
      |		КОНЕЦ"

		
КонецПроцедуры //-Лико m.shenderov 19.12.2017


