
&НаКлиенте
Процедура НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СписокНоменклатуры=Лико_ОбщегоНазначенияСервер.ПоискНоменклатурыПоСодержаниюТекста(Текст);
	
	Если СписокНоменклатуры.Количество()>0 Тогда
		// если 1 результат, то автоматом установим. Если больше - тогда интерактивный выбор. 
		Если СписокНоменклатуры.Количество()=1 Тогда
			Номенклатура = СписокНоменклатуры[0].Значение;
		Иначе
			Номенклатура = ЭтаФорма.ВыбратьИзСписка(СписокНоменклатуры, Элемент).Значение;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
	Иначе 	//запрос пуст!
		
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИРаспечататьОбъектНоменклатуры(Команда)
	ПроверитьНаличиеУпаковки();
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	Массив = Новый Массив();
	Для Сч=1 По КоличествоЭтикеток Цикл 
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Номенклатура",Номенклатура);
		СтруктураПараметров.Вставить("Характеристика",ХарактеристикаНоменклатуры);
		СтруктураПараметров.Вставить("Нарезка",Нарезка);
		СтруктураПараметров.Вставить("Втулка",Втулка);
		СтруктураПараметров.Вставить("Количество",Количество);
		СтруктураПараметров.Вставить("Упаковка",БазоваяЕдиницаИзмерения);
		СтруктураПараметров.Вставить("СерийныйНомер",СерийныйНомер);
		СтруктураПараметров.Вставить("Комментарий",Комментарий);
		СтруктураПараметров.Вставить("Рулонный",Рулонный);
		СтруктураПараметров.Вставить("Уникальный",Уникальный);
		СтруктураПараметров.Вставить("УпотребитьДо",УпотребитьДо);
		СтруктураПараметров.Вставить("ДатаПроизводства",ДатаПроизводства);
		СтруктураПараметров.Вставить("ВидКонтактаСПищевойПродукцией",ВидКонтактаСПищевойПродукцией);
		СтруктураПараметров.Вставить("НомерПартииИзготовления",НомерПартииИзготовления);
		СтруктураПараметров.Вставить("ПричинаОтсутствияНомераПартииИзготовления",ПричинаОтсутствияНомераПартииИзготовления);
		СтруктураПараметров.Вставить("ПричинаОтсутствияДатыИзготовления",ПричинаОтсутствияДатыИзготовления);
		
		
		
		СправочникОбъект=СоздатьОбъектНаСервере(СтруктураПараметров);
		//И ПараметрыВходногоКонтроля.НайтиСтроки(НОвый Структура("НесоответствиеВыявлено",Истина)).Количество()>0
		Если BRC  ТОгда
		ЗаписатьКритерииВОбъектНоменклатуры(СправочникОбъект);	
		КонецЕсли;
		Печать=Истина;	
		Если ВидОперации="ДобавитьВОрдер" и ПечататьБиркиПриСозданииВПриходномОрдереСервер() Тогда	
			Печать=Ложь;		
		КонецЕсли; 	
		Если  Не СразуНаПринтер Тогда
			Печать=Ложь;
		КонецЕсли;
		
		Если Печать Тогда
			Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(СправочникОбъект,,СразуНаПринтер); 
		КонецЕсли; 		
		Серия=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(СправочникОбъект,"Серия");
		Массив.Добавить(Серия); 
		ДобавитьВТаблицуТоваров(СправочникОбъект);
	КонецЦикла;
	
	Если ВидОперации="ДобавитьВОрдер" Тогда 		
		//Закрыть(Массив);
	КонецЕсли;
	
	КоличествоЭтикеток=1;
	Если ЗначениеЗаполнено(Тара) Тогда
		
	    ЗаписатьТаруВОбъектНоменклатуры(СправочникОбъект);
	КонецЕсли;	

	Если СозданиеЕдиничнойБирки Тогда
		Закрыть(СправочникОбъект);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаписатьКритерииВОбъектНоменклатуры(СправочникОбъект) //+Лико m.shenderov 25.06.2020
СправочникОбъектОбъект=СправочникОбъект.ПолучитьОбъект();

Для каждого ПФ Из ПараметрыВходногоКонтроля Цикл
				//Если  ПФ.НесоответствиеВыявлено ТОгда
					  НоваяСтр=СправочникОбъектОбъект.Лико_ПараметрыВходногоКонтроля.Добавить();
					  ЗаполнитьЗначенияСвойств(НоваяСтр,ПФ);
				//КонецЕсли;
				
				
КонецЦикла;
			СправочникОбъектОбъект.Записать();


		
КонецПроцедуры //-Лико m.shenderov 25.06.2020


Процедура ЗаписатьТаруВОбъектНоменклатуры(СправочникОбъект) //+Лико m.shenderov 25.06.2020
СправочникОбъектОбъект=СправочникОбъект.ПолучитьОбъект();

СправочникОбъектОбъект.Тара=Тара;
СправочникОбъектОбъект.ВесТары=Тара.Вес;
				

			СправочникОбъектОбъект.Записать();


		
КонецПроцедуры //-Лико m.shenderov 25.06.2020




&НаСервере
Процедура ДобавитьВТаблицуТоваров(СправочникОбъект) //+Лико m.shenderov 12.12.2017
	//Серия=Справочники.СерииНоменклатуры.СоздатьЭлемент();	
	Товар=Объект.Товары.Добавить();
	Товар.Номенклатура=СправочникОбъект;
	Товар.Количество=СправочникОбъект.Количество;
	Если Не СправочникОбъект.Уникальный Тогда
		Товар.Количество=1;
	КонецЕсли;
	
	Товар.КоличествоУУ=Товар.Количество*СправочникОбъект.БазоваяЕдиницаИзмерения.Числитель;
	
	
	
КонецПроцедуры  //-Лико m.shenderov 12.12.2017



&НаСервереБезКонтекста
Функция ПечататьБиркиПриСозданииВПриходномОрдереСервер() //+Лико m.shenderov 10.11.2017
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечататьБиркиПриСозданииВПриходномОрдере",Ложь);
	
КонецФункции  //-Лико m.shenderov 10.11.2017



&НаСервере
Процедура ЗаполнитьДанныеПоНоменклатуре() //+Лико m.shenderov 18.09.2017
	Родитель					=Номенклатура.ВидНоменклатуры;
	ЕдиницаИзмеренияУУ			=Номенклатура.ЕдиницаИзмерения;
	КодНоменклатуры				=Номенклатура.Код;
	//БазоваяЕдиницаИзмерения 	=Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка);
	//ВидУпаковки					=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(БазоваяЕдиницаИзмерения,"Владелец");
	ХарактеристикаНоменклатуры	=Справочники.ЯССМ_Нарезки.ХарактеристикаПоНарезке(Нарезка);
	//Рулонный                    =Лико_Дополнительно.ПроверкаЗначенияСвойстваУРодителей(Номенклатура.ВидНоменклатуры,"Лико_РулонныйМатериал");
	Рулонный                    =Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал;
	
	//Если Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
	//	Уникальный=Истина;
	//Иначе
	//	Уникальный=Ложь;
	//КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(Втулка) Тогда		
		Втулка=Номенклатура.Лико_Втулка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Втулка) Тогда		
		Втулка=Номенклатура.ВидНоменклатуры.Лико_Втулка;
	КонецЕсли;
	Если Не Рулонный И НЕ ЗначениеЗаполнено(ВидУпаковки) Тогда
		Если ЗначениеЗаполнено(Номенклатура.ВидНоменклатуры.Лико_УпаковкаПоУмолчанию) Тогда
			ВидУпаковки=Номенклатура.ВидНоменклатуры.Лико_УпаковкаПоУмолчанию;
		Иначе
			ВидУпаковки=Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		//ВидУпаковки=Справочники.Лико_ПредопределенныеЗначения.УпаковкаПоУмолчанию.ЗначениеПараметра;
	КонецЕсли;
	
	
	НовоеНаименование				 = СокрЛП(Номенклатура.Наименование)
	+ ?(ЗначениеЗаполнено(Номенклатура.Артикул), ", ("+Номенклатура.Артикул+")", "")
	+ ?(ЗначениеЗаполнено(Нарезка), ", Ø"+Нарезка+" ", "")
	+ ?(ЗначениеЗаполнено(Втулка), ?(ЗначениеЗаполнено(Нарезка), "", ", ")+"("+Втулка+")", "")
	+ ?(СокрЛП(Комментарий)="", "", ", " + СокрЛП(Комментарий))
	+ ?(Уникальный И ЗначениеЗаполнено(Нарезка) И Количество<>0, ", "+Количество+" "+БазоваяЕдиницаИзмерения, "");
	
	Если СокрЛП(Наименование)<>СокрЛП(НовоеНаименование) Тогда
		Наименование = НовоеНаименование;
	КонецЕсли;
	
	УстановкаУникальности();	
	
КонецПроцедуры //-Лико m.shenderov 18.09.2017

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ХарактеристикаНоменклатуры	=Неопределено;
	Нарезка						=Неопределено;
	ВидУпаковки					=Неопределено;
	Количество					=Неопределено;
	КоличествоВУпаковке			=Неопределено;
	Втулка						=Неопределено;
	ЗаполнитьДанныеПоНоменклатуре();
	УстановитьПрослеживаемостьСервер();
	УстановитьСрокГодностиСервер();
	УстановитьВидимость();
	Если BRC Тогда
		ПоказатьКартинкуНоменклатуры();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НарезкаПриИзменении(Элемент)
	БазоваяЕдиницаИзмерения 	=УпаковкаПоНарезкеСервер(Нарезка);
	
	ЗаполнитьДанныеПоНоменклатуре();
КонецПроцедуры

&НаСервереБезКонтекста
Функция УпаковкаПоНарезкеСервер(Нарезка) //+Лико m.shenderov 24.10.2017
	Возврат Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка);
	
КонецФункции  //-Лико m.shenderov 24.10.2017

Процедура УстановитьПрослеживаемостьСервер() //+Лико m.shenderov 28.03.2023
	
	Если BRC Тогда
	Прослеживаемость=Ложь;
	Возврат;
	КонецЕсли;
	Прослеживаемость = УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_ПрослеживаемостьТоваров");
	Прослеживаемость = Прослеживаемость И
	Номенклатура.Лико_КонтрольПартииПроизводстваТовара И 
	Не ЗакрытиеБланка; 
	КонтрольПартийПоризводстваНоменклатуры=Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.Старт();
		
КонецПроцедуры //-Лико m.shenderov 28.03.2023

Процедура УстановитьСрокГодностиСервер() //+Лико m.shenderov 28.03.2023
	
	Если BRC Или Прослеживаемость Тогда
	СрокГодности=0;
	Возврат;
	КонецЕсли;
	СрокГодности = РегистрыСведений.Лико_СрокиГодностиНоменклатуры. Контролировать(Площадка, Номенклатура, ТекущаяДата());
			
КонецПроцедуры //-Лико m.shenderov 28.03.2023




&НаСервереБезКонтекста
Функция СоздатьОбъектНаСервере(СтруктураПараметров) //+Лико m.shenderov 18.09.2017
	
	Возврат Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров)	
КонецФункции  //-Лико m.shenderov 18.09.2017

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b");
	Площадка = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Организация);
	Если Параметры.Свойство("ВидОперации") Тогда
		ВидОперации=Параметры.ВидОперации;
	КонецЕсли;
	
		Если Параметры.Свойство("ЗакрытиеБланка") Тогда
		ЗакрытиеБланка=Параметры.ЗакрытиеБланка;
	КонецЕсли;

	Если Параметры.Свойство("BRC") Тогда 
		BRC = Параметры.BRC;
	Иначе
		//BRC=?(ЗначениеЗаполнено(Организация)и  не Параметры.Свойство("BRC") ,УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC"),Ложь);	
	    BRC=?(ЗначениеЗаполнено(Организация),УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC"),Ложь);	
	КонецЕсли;	
	
	
	КоличествоЭтикеток 		= 1;
	КоличествоЭтикетокПФ 	= 1;
	КоличествоЭтикетокНЗП 	= 1;
	//Количество=1;
	//КоличествоВУпаковке=1;
	Уникальный = Истина;
	Объект.Товары.Очистить();	
	СразуНаПринтер=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	
	Если Параметры.Свойство("Упаковка") и ЗначениеЗаполнено(Параметры.Упаковка) Тогда	
		Если Рулонный Тогда
			
		Иначе
			
			БазоваяЕдиницаИзмерения=Параметры.Упаковка;
		КонецЕсли;
		
	КонецЕсли;
	
	
	
		
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура=Параметры.Номенклатура;
	КонецЕсли;
	Если Параметры.Свойство("Характеристика") Тогда  		
		Нарезка=Параметры.Характеристика.ЯССМ_Нарезка;
		БазоваяЕдиницаИзмерения 	=УпаковкаПоНарезкеСервер(Нарезка);	
		Если ЗначениеЗаполнено(Нарезка) Тогда
			Рулонный=Истина;
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если Параметры.Свойство("Количество")И Рулонный Тогда	
		
		Количество=Параметры.Количество;
		
		КоличествоВУпаковке=Параметры.Количество;
		
	КонецЕсли;
	
	Если Параметры.Свойство("КоличествоУпаковок")И Не Рулонный Тогда	
		
		
		
		КоличествоВУпаковке=Параметры.КоличествоУпаковок;
		Если Не ЗначениеЗаполнено(КоличествоВУпаковке) Тогда
			КоличествоВУпаковке=1;
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
	Если	 ВидОперации="ДобавитьВОрдер" Тогда
		Элементы.СтраницаПечатьШКНезавершеннойПродукции.Видимость=Ложь;
		Элементы.ГруппаТовары.Видимость=Истина;
	Иначе
		Элементы.ГруппаТовары.Видимость=Истина;
		Элементы.ДобавитьВДокумент.Видимость=Ложь;
		
	КонецЕсли;
Если Параметры.Свойство("СозданиеЕдиничнойБирки") Тогда	
	СозданиеЕдиничнойБирки=Истина;
	СразуНаПринтер=Ложь;
КонецЕсли;

	Если СозданиеЕдиничнойБирки Тогда
		Элементы.Товары.Видимость=Ложь;
		Элементы.ГруппаТоварыИтоги.Видимость=Ложь;
		Элементы.КоличествоВУпаковке.Заголовок="Нетто";
		Элементы.ВидУпаковки.Видимость=Ложь;
		Элементы.Тара.Видимость=Истина;
		Элементы.Группа1.Доступность=Ложь;
		Элементы.Весы.Видимость=Истина;

	КонецЕсли;
  УстановитьПрослеживаемостьСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура БазоваяЕдиницаИзмеренияПриИзменении(Элемент)
	ЗаполнитьДанныеПоНоменклатуре();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ЗаполнитьДанныеПоНоменклатуре();
	
КонецПроцедуры

&НаКлиенте
Процедура РулонныйПриИзменении(Элемент)
	ЗаполнитьДанныеПоНоменклатуре();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УникальныйПриИзменении(Элемент)
	ЗаполнитьДанныеПоНоменклатуре();
	
КонецПроцедуры

&НаКлиенте
Процедура ВтулкаПриИзменении(Элемент)
	ЗаполнитьДанныеПоНоменклатуре();
	
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьДлинуРолика(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Номенклатура);
	Структура.Вставить("НачальныйДиаметр",ПолучитьРазмерНаружногоДиаметра(Втулка));
	
	ОписаниеОповещения= Новый ОписаниеОповещения("РассчитатьДлиннуРоликаЗавершение",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.Лико_РасчетДлиныРолика",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

Процедура РассчитатьДлиннуРоликаЗавершение(РезультатФормы,ПараметрыФормы) Экспорт//+Лико m.shenderov 12.09.2017
	
	
	Если РезультатФормы<>Неопределено Тогда
		Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
			Количество = РезультатФормы.ДлинаРолика;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 12.09.2017


&НаСервереБезКонтекста
Функция ПолучитьРазмерНаружногоДиаметра(Втулка) //+Лико m.shenderov 19.09.2017
	Возврат Втулка.РазмерНаружногоДиаметра;
	
КонецФункции  //-Лико m.shenderov 19.09.2017


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 24.10.2017
	Если Рулонный Тогда
		Элементы.ГруппаНароезкаВтулка.Видимость			=Истина;
		Элементы.ГруппаЕдиницаИзмеренеия.Видимость		=Истина;
		Элементы.ГруппаВидУпаковки.Видимость			=Ложь;
		Элементы.ГруппаНароезкаВтулка.Видимость			=Истина;
	Иначе
		Элементы.ГруппаНароезкаВтулка.Видимость			=Ложь;
		Элементы.ГруппаЕдиницаИзмеренеия.Видимость		=Ложь;
		Элементы.ГруппаВидУпаковки.Видимость			=Истина;
		Элементы.ГруппаНароезкаВтулка.Видимость			=Ложь;
		
	КонецЕсли;
	
	Если Не Уникальный Тогда
		Кол=Неопределено;
		ПолучитьКоличествоНеУникального(Номенклатура,Кол);
		Если Кол=Неопределено Тогда
			Элементы.ВидУпаковки.ТолькоПросмотр=Ложь;
			Элементы.КоличествоВУпаковке.ТолькоПросмотр=Ложь;
			КоличествоВУпаковке=Кол;  			
		Иначе
			Элементы.ВидУпаковки.ТолькоПросмотр=Истина;
			Элементы.КоличествоВУпаковке.ТолькоПросмотр=Истина;
			КоличествоВУпаковке=1;
		КонецЕсли;
		
		Количество=1;
		
	Иначе
		Элементы.ВидУпаковки.ТолькоПросмотр=Ложь;
		Элементы.КоличествоВУпаковке.ТолькоПросмотр=Ложь;
	КонецЕсли;
	
	Если BRC Тогда
		Элементы.ГруппаBRC.Видимость=Истина;
		Элементы.ГруппаBRC2.Видимость=Истина;
		//ЗаполнитьКритерииДляВходногоКонтроля();	
	Иначе
		Элементы.ГруппаBRC.Видимость=Ложь;
		Элементы.ГруппаBRC2.Видимость=Ложь;
		
		
	КонецЕсли; 
	
	Если Прослеживаемость Тогда
		Элементы.ГруппаПрослеживаемость.Видимость=Истина;	
	Иначе
		Элементы.ГруппаПрослеживаемость.Видимость=Ложь;	
	КонецЕсли; 
	
	Если СрокГодности<>0 Тогда
		Элементы.ГруппаСрокиГодности.Видимость=Истина;
		Уникальный = Истина;
		Элементы.Уникальный.Доступность=Ложь;
	Иначе
		Элементы.ГруппаСрокиГодности.Видимость = Ложь;
		Элементы.Уникальный.Доступность = Истина;
	КонецЕсли;

	
	
	
КонецПроцедуры //-Лико m.shenderov 24.10.2017

&НаКлиенте
Процедура УстановитьСрокГодности(Тип="ДатаИзготовления") //+Лико m.shenderov 19.06.2025
	
	Если Тип="ДатаИзготовления" Тогда
		 УпотребитьДо = ДатаПроизводства+60*60*24*СрокГодности;
		 
	 Иначе
		 ДатаПроизводства =УпотребитьДо -(60*60*24*СрокГодности); 
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 19.06.2025



&НаСервереБезКонтекста
Процедура ПолучитьКоличествоНеУникального(Номенклатура,Кол) //+Лико m.shenderov 30.12.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЯССМ_ОбъектыНоменклатуры.Количество КАК Количество
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Кол=Выборка.Количество;
		
	КонецЦикла; 
	
	
КонецПроцедуры  //-Лико m.shenderov 30.12.2017


&НаСервере
Процедура ПроверитьНаличиеУпаковки() //+Лико m.shenderov 24.10.2017  
	Если ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) и Рулонный Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если КоличествоВУпаковке=1 Тогда
		//БазоваяЕдиницаИзмерения=ВидУпаковки;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	|	И УпаковкиЕдиницыИзмерения.Числитель = &Числитель
	|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	//НаименованиеВидаУпаковки=СокрЛП(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ВидУпаковки,"Наименование"));
	
	
	Запрос.УстановитьПараметр("Владелец",Номенклатура);
	Запрос.УстановитьПараметр("Числитель",КоличествоВУпаковке);
	//Запрос.УстановитьПараметр("Длина",СтрДлина(НаименованиеВидаУпаковки));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ВидУпаковки);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			БазоваяЕдиницаИзмерения=Выборка.Ссылка;
			ПроверитьНоменклатуру();			
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидУпаковки) и Количество>0  Тогда
		НоваяУпаковка=Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		
		
		НоваяУпаковка.Владелец							=	Номенклатура;		
		НоваяУпаковка.Числитель							=	КоличествоВУпаковке;
		НоваяУпаковка.Знаменатель						=	1;
		НоваяУпаковка.ЕдиницаИзмерения					=	ВидУпаковки;
		НоваяУпаковка.ЛинейныеРазмерыПредставление		=	"Безразмерная";
		НоваяУпаковка.СкладскаяГруппа					=	Справочники.СкладскиеГруппыУпаковок.НайтиПоНаименованию("Адресная");
		НоваяУпаковка.Типоразмер						=	Справочники.Лико_ПредопределенныеЗначения.ТипоразмерУпаковкиРулонногоМатериала.ЗначениеПараметра;
		НоваяУпаковка.ПоставляетсяВМногооборотнойТаре	=	Ложь;
		НоваяУпаковка.ТипИзмеряемойВеличины				=	Перечисления.ТипыИзмеряемыхВеличин.Упаковка;
		НоваяУпаковка.ТипУпаковки						=	Перечисления.ТипыУпаковокНоменклатуры.Конечная; 		
		НоваяУпаковка.Наименование     					=	СформироватьНаименование( ВидУпаковки,НоваяУпаковка.Числитель,НоваяУпаковка.Знаменатель,НоваяУпаковка.Владелец.ЕдиницаИзмерения); 
		
		НоваяУпаковка.Записать();	
		БазоваяЕдиницаИзмерения=НоваяУпаковка.Ссылка;
		
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
КонецПроцедуры  //-Лико m.shenderov 24.10.2017

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СотрудникНЗП=ГлЛико_Оператор;
	СотрудникПробник=ГлЛико_Оператор;
	Если КоличествоВУпаковке>0 Тогда
		Количество=1;	
	КонецЕсли;
	
	
	ПроверитьНаличиеУпаковки();
	
	
	
	ЗаполнитьДанныеПоНоменклатуре();
	УстановитьВидимость();
	Если Элементы.ГруппаЕдиницаИзмеренеия.Видимость=Истина Тогда
		Элементы.Количество.АктивизироватьПоУмолчанию=Истина;
	Иначе
		Элементы.КоличествоВУпаковке.АктивизироватьПоУмолчанию=Истина;
	КонецЕсли;
	Если BRC Тогда
		ПоказатьКартинкуНоменклатуры();
		ВидКонтактаСПищевойПродукцией=ПолучитьВидКонтактаНаСервере();;
		ПоказатьКартинкуВидКонтакта();
		Если ВидКонтактаСПищевойПродукцией=ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтакта") Тогда
			Элементы.НомерПартииИзготовления.Видимость	=Ложь;
			Элементы.ДатаПроизводства.Видимость			=Ложь;
			Элементы.УпотребитьДо.Видимость				=Ложь;
		КонецЕсли;
		//Если ВидКонтактаСПищевойПродукцией=ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтактаСКонтролемСрокаГодности") Тогда
		//	Элементы.НомерПартииИзготовления.Видимость	=Ложь;
		//	Элементы.ДатаПроизводства.Видимость			=Ложь;
		//	Элементы.УпотребитьДо.Видимость				=Истина;
		//КонецЕсли;

		
		ЗаполнитьКритерииДляВходногоКонтроля();	

	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьВидКонтактаНаСервере() //+Лико m.shenderov 14.05.2020  
	Возврат Номенклатура.Лико_ВидКонтактаСПищевойПродукцией;
КонецФункции  //-Лико m.shenderov 14.05.2020



&НаСервере
Процедура ПроверитьНоменклатуру() //+Лико m.shenderov 24.10.2017
	Если Не (Номенклатура.ИспользоватьУпаковки и 
		Номенклатура.НаборУпаковок=Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры) Тогда
		НоменклатураОбъект=Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.НаборУпаковок=Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры;
		НоменклатураОбъект.ИспользоватьУпаковки=Истина;
		НоменклатураОбъект.Записать();
		
	КонецЕсли;
	
	
	
КонецПроцедуры  //-Лико m.shenderov 24.10.2017




&НаСервере

Функция СформироватьНаименование(ВидУпаковки, Числитель, Знаменатель, ЕдиницаИзмеренияВладельца) Экспорт
	Возврат СокрЛП(СокрЛП(ВидУпаковки) + " (" + Формат(Числитель / Знаменатель,"ЧРД=.") + " " + СокрЛП(ЕдиницаИзмеренияВладельца) + ")");
	
КонецФункции

&НаКлиенте
Процедура КоличествоВУпаковкеПриИзменении(Элемент)
	Если КоличествоВУпаковке>0 Тогда
		Количество=1;	
	КонецЕсли;
	
	
	//ПроверитьНаличиеУпаковки();
	ЗаполнитьДанныеПоНоменклатуре(); 
	Если ЗначениеЗаполнено(Тара) Тогда
	Брутто=КоличествоВУпаковке+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тара,"Вес");
	
	КонецЕсли;
	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПерехода(ОбъектПерехода, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРолики(Команда)
	Если Не ЗначениеЗаполнено(СотрудникНЗП) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнен автор документа!";
		Сообщение.Поле = "СотрудникНЗП";
		Сообщение.УстановитьДанные(СотрудникНЗП);
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерЗаказаНЗП) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнен номер заказа!";
		Сообщение.Поле = "НомерЗаказаНЗП";
		Сообщение.УстановитьДанные(НомерЗаказаНЗП);
		Сообщение.Сообщить();		
		Возврат;
		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НарезкаНЗП) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнена нарезка!";
		Сообщение.Поле = "НарезкаНЗП";
		Сообщение.УстановитьДанные(НарезкаНЗП);
		Сообщение.Сообщить();		
		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВтулкаНЗП) Тогда
		
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнена втулка!";
		Сообщение.Поле = "ВтулкаНЗП";
		Сообщение.УстановитьДанные(ВтулкаНЗП);
		Сообщение.Сообщить();	
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КоличествоЭтикетокНЗП) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не указано количество этикеток!";
		Сообщение.Поле = "КоличествоРоликов";
		Сообщение.УстановитьДанные(КоличествоЭтикетокНЗП);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивОбъектов = СоздатьОбъектыНоменклатуры();
	Для каждого ОБъектНоменклатуры Из МассивОбъектов  Цикл
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ОБъектНоменклатуры,,СразуНаПринтер); 
		
	КонецЦикла;
	
	Если ВидОперации="ДобавитьВОрдер" Тогда 		
		ЭтаФорма.Закрыть(МассивОбъектов);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПробники(Команда)
	Если Не ЗначениеЗаполнено(СотрудникПробник) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнен автор документа!";
		Сообщение.Поле = "СотрудникПробник";
		Сообщение.УстановитьДанные(СотрудникПробник);
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерЗаказаПробник) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнен номер заказа!";
		Сообщение.Поле = "НомерЗаказаПробник";
		Сообщение.УстановитьДанные(НомерЗаказаПробник);
		Сообщение.Сообщить();		
		Возврат;
		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КоличествоЭтикетокПробников) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не указано количество этикеток!";
		Сообщение.Поле = "КоличествоЭтикетокПробников";
		Сообщение.УстановитьДанные(КоличествоЭтикетокПробников);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивОбъектов = СоздатьОбъектыНоменклатурыПробников();
	Для каждого ОБъектНоменклатуры Из МассивОбъектов  Цикл
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ОБъектНоменклатуры,,СразуНаПринтер); 
		
	КонецЦикла;
	
	Если ВидОперации="ДобавитьВОрдер" Тогда 		
		ЭтаФорма.Закрыть(МассивОбъектов);
	КонецЕсли;
	
	
КонецПроцедуры



&НаСервере
Функция СоздатьОбъектыНоменклатуры()
	ЗаказКлиента=Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказаНЗП,"ЗаказКлиента");
	МенеджерЗаказа=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ЗаказКлиента,"Менеджер");
	МассивСозданныхОбъектов = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ОбъектНоменклатураAmcor) Тогда
		
		// Ищем номенклатуру
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияСвойствОбъектов.Объект КАК Характеристика
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗначенияСвойствЗаказ.Объект КАК ХарактеристкиСЗаказом
		|		ИЗ
		|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствЗаказ
		|		ГДЕ
		|			ЗначенияСвойствЗаказ.Свойство В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
		|					ИЗ
		|						ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
		|					ГДЕ
		|						СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоЗаказ)
		|			И ЗначенияСвойствЗаказ.Значение = &NЗаказ) КАК ВложенныйЗапрос
		|		ПО ЗначенияСвойствОбъектов.Объект = ВложенныйЗапрос.ХарактеристкиСЗаказом
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
		|			ИЗ
		|				ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
		|			ГДЕ
		|				СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоХарактеристика)
		|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА
		|	И ЗначенияСвойствОбъектов.Объект.Владелец.ВидНоменклатуры = &Полуфабрикат
		|	И ЗначенияСвойствОбъектов.Объект.Владелец.Наименование ПОДОБНО &Название";
		
		Запрос.Текст ="ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ
		|	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры = &ВидНоменклатуры";
		
		Запрос.УстановитьПараметр("Заказ",ЗаказКлиента);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураНезавершенка = Неопределено;
		ХарактеристикаНезавершенка = Неопределено;
		
		//=--------- создаем незавершенку -----
		РодительНезавершенкаНоменклатура = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		РодительНезавершенка = Справочники.Лико_ПредопределенныеЗначения.ГруппаОбъектовНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			ВыборкаЗапроса.Следующий();
			
			ХарактеристикаНезавершенка = ВыборкаЗапроса.Характеристика;
			НоменклатураНезавершенка = ХарактеристикаНезавершенка.Владелец;
		Иначе 	//запрос пуст!
			
			//Если Не ЗначениеЗаполнено(РодительНезавершенкаНоменклатура) Тогда
			//	Сообщить("Не найдена группа полуфабрикатов!");
			//	Возврат Неопределено;
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(МенеджерЗаказа) Тогда
				ФИО = МенеджерЗаказа.Наименование;
				Фамилия		= ВыделитьСлово(ФИО);
				Имя			= ВыделитьСлово(ФИО);
				Отчество	= ВыделитьСлово(ФИО);
				ФИОСтрока = Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
			Иначе
				ФИОСтрока = "";
			КонецЕсли;
			//---------=
			
			Номенклатура1С = Справочники.Номенклатура.СоздатьЭлемент();
			Номенклатура1С.УстановитьНовыйКод("n");
			Номенклатура1С.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
			Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура1С);
			
			Номенклатура1С.Наименование = "Незавершенное производство по заказу №" + Формат(НомерЗаказаНЗП, "ЧГ=0") + " (" + ФИОСтрока + ")";
			Номенклатура1С.НаименованиеПолное = Номенклатура1С.Наименование;
			//Номенклатура1С.НоменклатурнаяГруппа = НомГрПроизводство;
			//Номенклатура1С.ЦеноваяГруппа = Справочники.ЦеновыеГруппы.Полуфабрикат;
			//Номенклатура1С.ВесовойКоэффициентВхождения = 100;
			
			Если Не РодительНезавершенкаНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
				Номенклатура1С.Родитель = РодительНезавершенкаНоменклатура;			
				//Номенклатура1С.ВидНоменклатуры = РодительНезавершенкаНоменклатура.ВидНоменклатуры;
				//ПрисвоитьСтЗатратОтСоседа(Номенклатура1С, РодительНезавершенкаНоменклатура);
			Иначе
				//Номенклатура1С.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004"); //Полуфабрикате
			КонецЕсли;
			//Если Номенклатура1С.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004") Тогда
			//	Номенклатура1С.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("00003");	
			//	Номенклатура1С.НаправлениеВыпуска = Перечисления.НаправленияВыпуска.НаСклад;
			//КонецЕсли;
			//Номенклатура1С.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055"); //м2
			//Номенклатура1С.Артикул = "";
			//Номенклатура1С.Комментарий = "";
			//Номенклатура1С.Записать();
			//Номенклатура1С.ЕдиницаХраненияОстатков = НайтиИлиСоздатьЕдиницуИзмерения(Номенклатура1С.Ссылка);
			//Номенклатура1С.ЕдиницаДляОтчетов = НайтиИлиСоздатьЕдиницуИзмерения(Номенклатура1С.Ссылка);
			Номенклатура1С.Записать();
			
			НоменклатураНезавершенка = Номенклатура1С.Ссылка;
			
			//=--------- создаем ему характеристику -----
			/// создадим ХарКу
			//СтрНоменклатура = Новый Структура("Номенклатура", НоменклатураНезавершенка);
			//СтрХарактеристика = Новый Структура("OrderNum", НомерЗаказа);
			//СтрХарактеристика.Вставить("NКонтракта" ,"");
			//СтрХарактеристика.Вставить("КодЭтикетки","");
			//
			//ЛикоМодулиРаботыСоСкладами.СоздатьХарактеристику(СтрХарактеристика,,СтрНоменклатура,Истина);
			ХарактеристикаНезавершенка=Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНезавершенка.Владелец=НоменклатураНезавершенка;
			ХарактеристикаНезавершенка.Лико_ЗаказНоменклатуры=ЗаказКлиента;
			ХарактеристикаНезавершенка.Записать();
			
		КонецЕсли;
		
		Если НоменклатураНезавершенка<>Неопределено И ХарактеристикаНезавершенка<>Неопределено Тогда
			//=--------- находим или создаем ед. изм. УУ -----
			
			//БазоваяЕдиницаИзмеренияНезавершенка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("018"); //пог. м.
			//
			//Коэффициент = Нарезка.Размер / 1000;
			//
			//ЗапросЕИ = Новый Запрос;
			//ЗапросЕИ.Текст = 
			//"ВЫБРАТЬ
			//|	ЯССМ_ЕдиницыИзмерения.Ссылка
			//|ИЗ
			//|	Справочник.ЯССМ_ЕдиницыИзмерения КАК ЯССМ_ЕдиницыИзмерения
			//|ГДЕ
			//|	ЯССМ_ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
			//|	И ЯССМ_ЕдиницыИзмерения.Коэффициент = &Коэффициент
			//|	И ЯССМ_ЕдиницыИзмерения.ЕдиницаПоКлассификаторуУУ = &ЕдиницаПоКлассификаторуУУ";
			//
			//ЗапросЕИ.УстановитьПараметр("ЕдиницаПоКлассификатору", БазоваяЕдиницаИзмеренияНезавершенка);
			//ЗапросЕИ.УстановитьПараметр("ЕдиницаПоКлассификаторуУУ", НоменклатураНезавершенка.БазоваяЕдиницаИзмерения);
			//ЗапросЕИ.УстановитьПараметр("Коэффициент", Коэффициент);
			//
			//РезультатЗапросаЕИ = ЗапросЕИ.Выполнить();
			//
			//Если Не РезультатЗапросаЕИ.Пустой() Тогда
			//	ВыборкаЗапросаЕИ = РезультатЗапросаЕИ.Выбрать();
			//	ВыборкаЗапросаЕИ.Следующий();
			//	
			//	ЕдиницаИзмеренияУУНезавершенка = ВыборкаЗапросаЕИ.Ссылка;
			//Иначе 	//запрос пуст!
			//	НовыйЭлемент = Справочники.ЯССМ_ЕдиницыИзмерения.СоздатьЭлемент();
			//	НовыйЭлемент.ЕдиницаПоКлассификатору = БазоваяЕдиницаИзмеренияНезавершенка;
			//	НовыйЭлемент.ЕдиницаПоКлассификаторуУУ = НоменклатураНезавершенка.БазоваяЕдиницаИзмерения;
			//	НовыйЭлемент.Коэффициент = Коэффициент;
			//	НовыйЭлемент.Наименование = НовыйЭлемент.ЕдиницаПоКлассификатору.Наименование
			//								+ ?(ЗначениеЗаполнено(НовыйЭлемент.ЕдиницаПоКлассификатору), " (" + НовыйЭлемент.Коэффициент + " " + НовыйЭлемент.ЕдиницаПоКлассификаторуУУ + ")", "");
			//	НовыйЭлемент.Записать();
			//	
			//	ЕдиницаИзмеренияУУНезавершенка = НовыйЭлемент.Ссылка;
			//КонецЕсли;
			//
			//=--------- Создание объектов номенклатуры -----
			Для Счетчик=1 По КоличествоЭтикетокНЗП Цикл
				
				
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Номенклатура"			,НоменклатураНезавершенка);
				СтруктураПараметров.Вставить("Родитель"				,РодительНезавершенка);
				СтруктураПараметров.Вставить("Характеристика"		,ХарактеристикаНезавершенка);
				СтруктураПараметров.Вставить("Нарезка"				,Нарезка);
				СтруктураПараметров.Вставить("Втулка"				,Втулка);
				СтруктураПараметров.Вставить("Количество"			,0);
				СтруктураПараметров.Вставить("Упаковка"				,Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка));
				СтруктураПараметров.Вставить("Уникальный"			,Истина);
				СтруктураПараметров.Вставить("НомерЗаказаКлиента"	,НомерЗаказаНЗП);
				СтруктураПараметров.Вставить("НомерБланка"			,НомерЗаказаНЗП);
				СтруктураПараметров.Вставить("СерийныйНомер"		,СерийныйНомер);
				СтруктураПараметров.Вставить("Комментарий"			,"");
				СтруктураПараметров.Вставить("Ответсвенный"			,СотрудникНЗП);
				СтруктураПараметров.Вставить("Рулонный"				,Истина); 
				НовыйЭлемент=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров);	
				
				МассивСозданныхОбъектов.Добавить(НовыйЭлемент.Ссылка);
				
			КонецЦикла;
			
		Иначе
			Сообщить("Не удалось создать незавершенку!");
		КонецЕсли;
		
	Иначе // ОбъектНоменклатураAmcor
		
		//=--------- Создание объектов номенклатуры -----
		Для Счетчик=1 По КоличествоЭтикетокНЗП Цикл  			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Номенклатура"			,ОбъектНоменклатураAmcor.Номенклатура);
			СтруктураПараметров.Вставить("Родитель"				,ОбъектНоменклатураAmcor.Родитель);
			СтруктураПараметров.Вставить("Характеристика"		,ОбъектНоменклатураAmcor.Характеристика);
			СтруктураПараметров.Вставить("Нарезка"				,Нарезка);
			СтруктураПараметров.Вставить("Втулка"				,Втулка);
			СтруктураПараметров.Вставить("Количество"			,КоличествоНЗП);
			СтруктураПараметров.Вставить("Упаковка"				,Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка));
			СтруктураПараметров.Вставить("Уникальный"			,Истина);
			СтруктураПараметров.Вставить("НомерЗаказаКлиента"	,НомерЗаказаНЗП);
			СтруктураПараметров.Вставить("НомерБланка"			,НомерБланкаНЗП);
			СтруктураПараметров.Вставить("СерийныйНомер"		,СерийныйНомер);
			СтруктураПараметров.Вставить("Комментарий"			,"");
			СтруктураПараметров.Вставить("Ответсвенный"			,СотрудникНЗП);
			СтруктураПараметров.Вставить("Рулонный"				,Истина); 
			НовыйЭлемент=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров);
			
			МассивСозданныхОбъектов.Добавить(НовыйЭлемент.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоРоликов = 1;
	
	Возврат МассивСозданныхОбъектов;
	
КонецФункции //СоздатьОбъектыНоменклатуры
&НаСервере
Функция СоздатьОбъектыНоменклатурыПробников()
	ЗаказКлиента=Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказаПробник,"ЗаказКлиента");
	МенеджерЗаказа=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ЗаказКлиента,"Менеджер");
	МассивСозданныхОбъектов = Новый Массив;
	
			
		// Ищем номенклатуру
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияСвойствОбъектов.Объект КАК Характеристика
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗначенияСвойствЗаказ.Объект КАК ХарактеристкиСЗаказом
		|		ИЗ
		|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствЗаказ
		|		ГДЕ
		|			ЗначенияСвойствЗаказ.Свойство В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
		|					ИЗ
		|						ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
		|					ГДЕ
		|						СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоЗаказ)
		|			И ЗначенияСвойствЗаказ.Значение = &NЗаказ) КАК ВложенныйЗапрос
		|		ПО ЗначенияСвойствОбъектов.Объект = ВложенныйЗапрос.ХарактеристкиСЗаказом
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
		|			ИЗ
		|				ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
		|			ГДЕ
		|				СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоХарактеристика)
		|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА
		|	И ЗначенияСвойствОбъектов.Объект.Владелец.ВидНоменклатуры = &Полуфабрикат
		|	И ЗначенияСвойствОбъектов.Объект.Владелец.Наименование ПОДОБНО &Название";
		
		Запрос.Текст ="ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ
		|	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры = &ВидНоменклатуры";
		
		Запрос.УстановитьПараметр("Заказ",ЗаказКлиента);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыПробник.ЗначениеПараметра);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураПробник = Неопределено;
		ХарактеристикаПробник = Неопределено;
		
		//=--------- создаем незавершенку -----
		РодительПробникНоменклатура = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыПробник.ЗначениеПараметра;
		РодительНезавершенка = Справочники.Лико_ПредопределенныеЗначения.ГруппаОбъектовНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			ВыборкаЗапроса.Следующий();
			
			ХарактеристикаПробник = ВыборкаЗапроса.Характеристика;
			НоменклатураПробник = ХарактеристикаПробник.Владелец;
		Иначе 	//запрос пуст!
			
			//Если Не ЗначениеЗаполнено(РодительНезавершенкаНоменклатура) Тогда
			//	Сообщить("Не найдена группа полуфабрикатов!");
			//	Возврат Неопределено;
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(МенеджерЗаказа) Тогда
				ФИО = МенеджерЗаказа.Наименование;
				Фамилия		= ВыделитьСлово(ФИО);
				Имя			= ВыделитьСлово(ФИО);
				Отчество	= ВыделитьСлово(ФИО);
				ФИОСтрока = Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
			Иначе
				ФИОСтрока = "";
			КонецЕсли;
			//---------=
			
			Номенклатура1С = Справочники.Номенклатура.СоздатьЭлемент();
			Номенклатура1С.УстановитьНовыйКод("n");
			Номенклатура1С.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыПробник.ЗначениеПараметра;
			Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура1С);
			
			Номенклатура1С.Наименование = "Пробник по заказу №" + Формат(НомерЗаказаПробник, "ЧГ=0") + " (" + ФИОСтрока + ")";
			Номенклатура1С.НаименованиеПолное = Номенклатура1С.Наименование;
						
			Номенклатура1С.Записать();
			
			НоменклатураПробник = Номенклатура1С.Ссылка;
			
			//=--------- создаем ему характеристику -----
			ХарактеристикаПробник							= Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаПробник.Владелец					= НоменклатураПробник;
			ХарактеристикаПробник.Лико_ЗаказНоменклатуры	= ЗаказКлиента;
			ХарактеристикаПробник.Записать();
			
		КонецЕсли;
		
		Если НоменклатураПробник<>Неопределено И ХарактеристикаПробник<>Неопределено Тогда
			//=--------- находим или создаем ед. изм. УУ -----
			
						//
			//=--------- Создание объектов номенклатуры -----
			Для Счетчик=1 По КоличествоЭтикетокПробников Цикл
				
				
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Номенклатура"			,НоменклатураПробник);
				//СтруктураПараметров.Вставить("Родитель"				,РодительНезавершенка);
				СтруктураПараметров.Вставить("Характеристика"		,ХарактеристикаПробник);
				//СтруктураПараметров.Вставить("Нарезка"				,Нарезка);
				//СтруктураПараметров.Вставить("Втулка"				,Втулка);
				СтруктураПараметров.Вставить("Количество"			,1);
				СтруктураПараметров.Вставить("Упаковка"				,Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796"));
				СтруктураПараметров.Вставить("Уникальный"			,Истина);
				СтруктураПараметров.Вставить("НомерЗаказаКлиента"	,НомерЗаказаПробник);
				СтруктураПараметров.Вставить("НомерБланка"			,0);
				//СтруктураПараметров.Вставить("СерийныйНомер"		,СерийныйНомер);
				//СтруктураПараметров.Вставить("Комментарий"			,"");
				СтруктураПараметров.Вставить("Ответсвенный"			,СотрудникПробник);
				СтруктураПараметров.Вставить("Рулонный"				,Ложь); 
				НовыйЭлемент=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров);	
				
				МассивСозданныхОбъектов.Добавить(НовыйЭлемент.Ссылка);
				
			КонецЦикла;
			
		Иначе
			Сообщить("Не удалось создать пробник!");
		КонецЕсли;
		
		
	КоличествоРоликов = 1;
	
	Возврат МассивСозданныхОбъектов;
	
КонецФункции //СоздатьОбъектыНоменклатуры


/// Функция выделяет первое слово в предложении
&НаСервере
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции


&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов() //+Лико m.shenderov 10.11.2017
	ОчиститьСообщения();	
	
	Результат=Истина;
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрана номенклатура.'"), ,
		"Номенклатура");
	КонецЕсли;
	Если Рулонный И Не ЗначениеЗаполнено(Нарезка)  Тогда 
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрана нарезка.'"), ,
		"Нарезка");
	КонецЕсли;
	
	
	Если Рулонный и Количество=0 Тогда 		
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено количество.'"), ,
		"Количество");		
	КонецЕсли;  
	
	Если Не Рулонный и КоличествоВУпаковке=0 Тогда 		
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено количество.'"), ,
		"КоличествоВУпаковке");		
	КонецЕсли;   
	
	
	Если BRC 
		И НЕ ЗначениеЗаполнено(ДатаПроизводства) 
		И ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией) 
		И ВидКонтактаСПищевойПродукцией<>ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтакта")
		И ВидКонтактаСПищевойПродукцией<>ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтактаСКонтролемСрокаГодности") Тогда
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена дата изготовления.'"), ,
		"ДатаПроизводства");	
	КонецЕсли;
	
	Если BRC 
		И НЕ ЗначениеЗаполнено(УпотребитьДо) 
		И ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией)
		И ВидКонтактаСПищевойПродукцией<>ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтакта") Тогда
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена дата возможного употребления.'"), ,
		"УпотребитьДо");	
	КонецЕсли;
	
	Если BRC И НЕ ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией) Тогда
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен вид контакта с пищевой продукцией.'"), ,
		"ВидКонтактаСПищевойПродукцией");	
	КонецЕсли;
	
	Если BRC 
		И НЕ ЗначениеЗаполнено(НомерПартииИзготовления) 
		И ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией)
		И ВидКонтактаСПищевойПродукцией<>ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтакта")
		И ВидКонтактаСПищевойПродукцией<>ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтактаСКонтролемСрокаГодности") Тогда
		Результат=Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен номер партии изготовления.'"), ,
		"НомерПартииИзготовления");	
	КонецЕсли;
	
	//Если Прослеживаемость И НЕ ЗначениеЗаполнено(ДатаПроизводства)  Тогда
	//	//Результат=Ложь;		
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена дата изготовления.'"), ,
	//	"ДатаПроизводства");	
	//КонецЕсли;
	//
	//Если  Прослеживаемость И НЕ ЗначениеЗаполнено(УпотребитьДо)  Тогда
	//	//Результат=Ложь;		
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена дата возможного употребления.'"), ,
	//	"УпотребитьДо");	
	//КонецЕсли;
	//
	//Если Прослеживаемость И НЕ ЗначениеЗаполнено(НомерПартииИзготовления) Тогда
	//	//Результат=Ложь;		
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен номер партии изготовления.'"), ,
	//	"НомерПартииИзготовления");	
	//КонецЕсли;
	
	Если Прослеживаемость Тогда
		ЕстьПартия=(ЗначениеЗаполнено(НомерПартииИзготовления) Или ЗначениеЗаполнено(ПричинаОтсутствияНомераПартииИзготовления)) И
		(ЗначениеЗаполнено(ДатаПроизводства) Или ЗначениеЗаполнено(ПричинаОтсутствияДатыИзготовления));
		
		Если Не ЕстьПартия Тогда
			Если КонтрольПартийПоризводстваНоменклатуры Тогда 
				Результат=Ложь;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не корректно заполнены  реквизиты ""Номер партии изготовления"" и ""Дата изготовления"".'"), ,
			"НомерПартииИзготовления");				
		КонецЕсли; 	
	КонецЕсли;
	
	Если СрокГодности<>0 Тогда
		ЕстьЗаполнение=ЗначениеЗаполнено(ДатаПроизводства) И ЗначениеЗаполнено(УпотребитьДо);
		
		Если Не ЕстьЗаполнение Тогда
			
			Результат=Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не корректно заполнены  реквизиты ""Дата изготовления"" и ""Дата возможного употребления"".'"), ,
			"НомерПартииИзготовления");				
			
		КонецЕсли;
	КонецЕсли;

	
	Возврат Результат;
КонецФункции  //-Лико m.shenderov 10.11.2017

&НаКлиенте
Процедура ВидУпаковкиПриИзменении(Элемент)
	ЗаполнитьДанныеПоНоменклатуре();  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОбработку(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	Если  ВидОперации="ДобавитьВОрдер" Тогда
		Массив = Новый Массив();
		Для каждого Товар Из Объект.Товары Цикл
			Массив.Добавить(Товар.Номенклатура); 		
		КонецЦикла;
		
		
		//Если ВидОперации="ДобавитьВОрдер" Тогда 		
		Закрыть(Массив);
		//КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановкаУникальности() //+Лико m.shenderov 05.01.2018
	Элементы.Уникальный.ТолькоПросмотр	=Ложь;
	
	Возврат ;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЯССМ_ОбъектыНоменклатуры.Уникальный КАК Уникальный
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Уникальный							=Выборка.Уникальный;
		Элементы.Уникальный.ТолькоПросмотр	=Ложь;
		
		//Элементы.Уникальный.ТолькоПросмотр	=Истина;
		Возврат;
	КонецЦикла;
	
	Уникальный							=Истина;
	
	
	Элементы.Уникальный.ТолькоПросмотр	=Ложь;
	
	
	
	
КонецПроцедуры  //-Лико m.shenderov 05.01.2018



&НаКлиенте
Процедура ПоказатьКартинкуНоменклатуры() //+Лико m.shenderov 28.04.2020
	
	ФайлКартинкиНоменклатура = НайтиКартинкуBRC(Номенклатура);
	Если ЗначениеЗаполнено(ФайлКартинкиНоменклатура) Тогда
		АдресКартинкиНоменклатура = НавигационнаяСсылкаКартинки(ФайлКартинкиНоменклатура, УникальныйИдентификатор);
	Иначе
		АдресКартинкиНоменклатура = "";
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 28.04.2020


&НаКлиенте
Процедура ПоказатьКартинкуВидКонтакта() //+Лико m.shenderov 28.04.2020
	
	ФайлКартинкиВидКонтакта = НайтиКартинкуВидКонтактаBRC();
	Если ЗначениеЗаполнено(ФайлКартинкиВидКонтакта) Тогда
		АдресКартинкиВидКонтакта = НавигационнаяСсылкаКартинки(ФайлКартинкиВидКонтакта, УникальныйИдентификатор);
	Иначе
		АдресКартинкиВидКонтакта = "";
	КонецЕсли;
	
КонецПроцедуры //-Ли

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

&НаКлиенте
Процедура ФайлКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПросмотретьПрисоединенныйФайл("ФайлКартинкиНоменклатура", "АдресКартинкиНоменклатура",
	НСтр("ru='Отсутствует изображение для просмотра'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлКартинкиВидКонтактаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПросмотретьПрисоединенныйФайл("ФайлКартинкиВидКонтакта", "АдресКартинкиВидКонтакта",
	НСтр("ru='Отсутствует изображение для просмотра'"));
	
КонецПроцедуры


&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл(ИмяРеквизитаОбъекта, ИмяРеквизитаФормы, ТекстСообщенияОбОшибке)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизитаОбъекта]) Тогда
		РаботаСФайламиКлиент.ОткрытьФайл(
		РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(
		ЭтаФорма[ИмяРеквизитаОбъекта],
		УникальныйИдентификатор));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке,, ИмяРеквизитаФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиКартинкуBRC(Номенклатура) //+Лико m.shenderov 28.04.2020
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|ГДЕ
	|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &Номенклатура
	|	И НоменклатураПрисоединенныеФайлы.Лико_Тип.Тип = &Лико_ТипФайла";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("Лико_ТипФайла",Перечисления.Лико_ТипыФайлов.BRCБирка );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
КонецФункции  //-Лико m.shenderov 28.04.2020


Функция НайтиКартинкуВидКонтактаBRC() //+Лико m.shenderov 28.04.2020
	Возврат ВидКонтактаСПищевойПродукцией.ФайлКартинки;	
КонецФункции //-Лико m.shenderov 28.04.2020 

&НаКлиенте
Процедура ВидКонтактаСПищевойПродукциейПриИзменении(Элемент)
	ПоказатьКартинкуВидКонтакта();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваПриИзменении(Элемент)
	УстановитьУпотребитьДоНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьУпотребитьДоНаСервере() //+Лико m.shenderov 15.05.2020
	Если ЗначениеЗаполнено(Номенклатура.Лико_СрокГодности) Тогда
	УпотребитьДо=ДатаПроизводства+Номенклатура.Лико_СрокГодности*60*60*24;
	КонецЕсли;
КонецПроцедуры  //-Лико m.shenderov 15.05.2020


&НаКлиенте
Процедура ПараметрыВходногоКонтроляПриАктивизацииСтроки(Элемент)
	ПоказатьКартинкуКритерия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКартинкуКритерия() //+Лико m.shenderov 28.04.2020
	ЕСли Элементы.ПараметрыВходногоКонтроля.ТекущиеДанные<>Неопределено Тогда
		ФайлКартинкиКритерия = НайтиКартинкуКритерия(Элементы.ПараметрыВходногоКонтроля.ТекущиеДанные.Критерий);
		Если ЗначениеЗаполнено(ФайлКартинкиКритерия) Тогда
			АдресКартинкиКритерия = НавигационнаяСсылкаКартинки(ФайлКартинкиКритерия, УникальныйИдентификатор);
		Иначе
			АдресКартинкиКритерия = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //-Ли



Функция НайтиКартинкуКритерия(Критерий) //+Лико m.shenderov 28.04.2020
	Возврат Критерий.ФайлКартинки;	
КонецФункции //-Лико m.shenderov 28.04.2020 


&НаСервере
Процедура ЗаполнитьКритерииДляВходногоКонтроля() //+Лико m.shenderov 23.06.2020
	
	УдалитьКритерииНеКонтакта();
	ДобавитьКритерииКонтакта();
	
КонецПроцедуры  //-Лико m.shenderov 23.06.2020



&НаСервере
Процедура УдалитьКритерииНеКонтакта() //+Лико m.shenderov 23.06.2020
	ПараметрыВходногоКонтроля.Очистить();
	
КонецПроцедуры  //-Лико m.shenderov 23.06.2020

&НаСервере 
Процедура ДобавитьКритерииКонтакта() //+Лико m.shenderov 23.06.2020
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_КритерииВходногоКонтроля.Ссылка КАК Критерий
	|ИЗ
	|	Справочник.Лико_КритерииВходногоКонтроля.ВидыКонтактов КАК Лико_КритерииВходногоКонтроля
	|ГДЕ
	|	Лико_КритерииВходногоКонтроля.Ссылка.ДляУпаковки
	| И Лико_КритерииВходногоКонтроля.ВидКонтакта=&ВидКонтакта";
	Запрос.УстановитьПараметр("ВидКонтакта",ВидКонтактаСПищевойПродукцией);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовыйЭлемент=ПараметрыВходногоКонтроля.Добавить();
		НовыйЭлемент.Критерий=Выборка.Критерий;
		
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлКартинкиКритерияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПросмотретьПрисоединенныйФайлКритерия("ФайлКартинкиКритерия", "АдресКартинкиКритерия",
	НСтр("ru='Отсутствует изображение для просмотра'"));



КонецПроцедуры


&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайлКритерия(ИмяРеквизитаОбъекта, ИмяРеквизитаФормы, ТекстСообщенияОбОшибке)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизитаОбъекта]) Тогда
		РаботаСФайламиКлиент.ОткрытьФайл(
		РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(
		ЭтаФорма[ИмяРеквизитаОбъекта],
		УникальныйИдентификатор));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке,, ИмяРеквизитаФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВходногоКонтроляНесоответствиВыявленоПриИзменении(Элемент)
		Элементы.ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеНеВыявлено=              
	Не Элементы.ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеВыявлено;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВходногоКонтроляНесоответствиеНеВыявленоПриИзменении(Элемент)
		Элементы.ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеВыявлено=              
	Не Элементы.ПараметрыВходногоКонтроля.ТекущиеДанные.НесоответствиеНеВыявлено;

КонецПроцедуры

&НаКлиенте
Процедура НеСоответсвуетВК(Команда)
 Для каждого СтрКр Из ПараметрыВходногоКонтроля Цикл
		
		 СтрКр.НесоответствиеНеВыявлено=Ложь;
		 
	 КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоответсвуетВК(Команда)
 Для каждого СтрКр Из ПараметрыВходногоКонтроля  Цикл
		
		 СтрКр.НесоответствиеНеВыявлено=Истина;
		 
	 КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Весы(Команда)
	
	Брутто=Лико_ОбщегоНазначенияСервер.SoсketПолучитьВес();
    Если ЗначениеЗаполнено(Тара) Тогда
	КоличествоВУпаковке=Брутто-Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тара,"Вес");
Иначе
	КоличествоВУпаковке=Брутто;

КонецЕсли;
	Если КоличествоВУпаковке>0 Тогда
		Количество=1;	
	КонецЕсли;
	


КонецПроцедуры

&НаКлиенте
Процедура ТараПриИзменении(Элемент)
		Если ЗначениеЗаполнено(Тара) Тогда
	Брутто=КоличествоВУпаковке+Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тара,"Вес");
	
	КонецЕсли;
	Если КоличествоВУпаковке>0 Тогда
		Количество=1;	
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтсутствияНомераПартииИзготовленияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПричинаОтсутствияНомераПартииИзготовления) Тогда
		НомерПартииИзготовленияПрослеживаемость=Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПартииИзготовленияПрослеживаемостьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(НомерПартииИзготовления) Тогда
		ПричинаОтсутствияНомераПартииИзготовления=Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтсутствияДатыИзготовленияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПричинаОтсутствияДатыИзготовления) Тогда
		ДатаПроизводства=Неопределено;
	    УстановитьУпотребитьДоНаСервере(); 
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ДатаПроизводстваПрослеживаемостьПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДатаПроизводства) Тогда
		ПричинаОтсутствияДатыИзготовления=Неопределено;
	   	КонецЕсли;
    УстановитьУпотребитьДоНаСервере(); 

КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваСрокиГодностиПриИзменении(Элемент)
	УстановитьСрокГодности();
КонецПроцедуры

&НаКлиенте
Процедура УпотребитьДоСрокигодностиПриИзменении(Элемент)
	УстановитьСрокГодности("УпотребитьДо");

КонецПроцедуры

&НаСервере
Процедура СоздатьПаллетыНаСервере()
	
	Если КоличествоПаллет>0 Тогда
		
		Пока КоличествоПаллет>0 Цикл			
			НовыйПаллет = Справочники.Лико_Паллеты2_0.НовыйПаллет(ТипПаллета);
			НоваяСтр = Паллеты.Добавить();
			НоваяСтр.Паллет = НовыйПаллет;
			КоличествоПаллет=КоличествоПаллет-1; 		
		КонецЦикла; 		
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПаллеты(Команда)
	СоздатьПаллетыНаСервере();
КонецПроцедуры


&НаСервере
Функция НайтиСоздатьТипоразмерПаллета() //+Лико m.shenderov 08.04.2026  
	Если ЗначениеЗаполнено(ВысотаПаллета)
		И ЗначениеЗаполнено(ШиринаПаллета)
		и ЗначениеЗаполнено(ГлубинаПаллета)
		И ЗначениеЗаполнено(ВесПаллета) Тогда
   ТипоразмерПаллета = Справочники.Лико_ТипоразмерыПаллет.НайтиСоздатьТипоразмер(ВысотаПаллета,ШиринаПаллета,ГлубинаПаллета,ВесПаллета);
	КонецЕсли;
ВыводШКТипоразмерПаллета();	
КонецФункции  //-Лико m.shenderov 08.04.2026

&НаКлиенте
Процедура ВысотапаллетаПриИзменении(Элемент)
	НайтиСоздатьТипоразмерПаллета();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПаллетаПриИзменении(Элемент)
	НайтиСоздатьТипоразмерПаллета();
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаПаллетаПриИзменении(Элемент)
	НайтиСоздатьТипоразмерПаллета();

КонецПроцедуры

&НаКлиенте
Процедура ВесПаллетаПриИзменении(Элемент)
	НайтиСоздатьТипоразмерПаллета();

КонецПроцедуры

&НаКлиенте
Процедура ПечатьТипоразмера(Команда)
	
	НайтиСоздатьТипоразмерПаллета(); 
	
		ВыполняемаяОбработка=НайтиПФ("Печатная форма ""Бирка типоразмера паллета""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(ТипоразмерПаллета);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="БиркаТипоразмераПаллета";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 


КонецПроцедуры 

&НаСервереБезКонтекста
Функция НайтиПФ(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции

&НаКлиенте
Процедура ПечатьПаллета(Команда)
	Для каждого Паллет Из Паллеты Цикл
		
		
			ВыполняемаяОбработка=НайтиПФ("Печатная форма ""Бирка  паллета 2_0""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Паллет.Паллет);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="БиркаПаллета2_0";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 

		
	КонецЦикла;
КонецПроцедуры



Процедура ВыводШКТипоразмерПаллета() Экспорт
	
	ТипоРазмерПаллетаШК.Очистить();
	
	Если Не ЗначениеЗаполнено(ТипоразмерПаллета) Тогда
		Возврат;
	КонецЕсли;
	
	
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	
	МакетОбработки = ОбъектОбработки.ПолучитьМакет("ПФ_MXL_БиркаТипоразмераПаллета");   
	
	СсылкаНаОбъект = ТипоразмерПаллета;
	
	НомерДокумента = 0;
	
	
	
	ТабДокумент = ТипоРазмерПаллетаШК;
	
	Макет = МакетОбработки;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьШК = Макет.ПолучитьОбласть("ШК");
	
	
	//ОбластьШапка.Параметры.Наименование = СсылкаНаОбъект.Наименование;
	
	
	// {{ DGavrilov
	
	ШК = Справочники.Лико_ТипоразмерыПаллет.ШтрихКод(СсылкаНаОбъект);		
	
	ОбластьШапка.Параметры.ШтрихКодСтрокой=Справочники.Лико_ТипоразмерыПаллет.ШтрихКодСтрокой(СсылкаНаОбъект);
	
	
	
	Рисунок = ОбластьШапка.Рисунки.Штрихкод;
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина",          ОбластьШапка.Рисунки.Штрихкод.Ширина);
	ПараметрыШтрихкода.Вставить("Высота",          ОбластьШапка.Рисунки.Штрихкод.Высота);
	ПараметрыШтрихкода.Вставить("ТипКода",         4);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    18);
	ПараметрыШтрихкода.Вставить("Штрихкод",        ШК);
	Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);	
	//ТабДокумент.Вывести(ОбластьШК);
	ТабДокумент.Вывести(ОбластьШапка);
	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ПолеСлева = 1;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ПолеСнизу = 0;
	ТабДокумент.ПолеСверху = 1;
	
	
	ИмяПринтера=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераЭтикеток","");	
	ТабДокумент.ИмяПринтера = ИмяПринтера;	
	
	
		
КонецПроцедуры


