
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Док = Ссылка;
	НаборЗаписейЗатраты = РегистрыНакопления.Лико_ЗатратыПоЗаказу.СоздатьНаборЗаписей();
	НаборЗаписейЗатраты.Отбор.Регистратор.Установить(Док);
	НаборЗаписейЗатраты.Записать();

#Область АмортизацияЗПЗапчасти  
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	Лико_ВыпускГПОбороты.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ВыпускГПОбороты.Регистратор КАК Регистратор,
	|	МАКСИМУМ(1) КАК НомерПроката,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот > 0
	|				ТОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот
	|			ИНАЧЕ Лико_ВыпускГПОбороты.Время1РЦОборот
	|		КОНЕЦ) КАК Время1РЦ,
	|	МИНИМУМ(Лико_ВыпускГПОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Выпуск
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Заказ.Площадка.Организация = &Организация
	|				И НЕ РабочийЦентр.ВидРабочегоЦентра В (ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Прочее), ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Перемотка), ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПоперечнаяРезка))) КАК Лико_ВыпускГПОбороты
	|ГДЕ
	|	НЕ Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.Заказ,
	|	Лико_ВыпускГПОбороты.РабочийЦентр,
	|	Лико_ВыпускГПОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выпуск.Регистратор КАК Регистратор,
	|	ВТ_Выпуск.Заказ КАК Заказ,
	|	Лико_НормативыВыпуска.РабочийЦентр КАК РабочийЦентр,
	|	СУММА(ВЫРАЗИТЬ((Лико_НормативыВыпуска.ВремяПечати + Лико_НормативыВыпуска.ВремяНаНастройку + Лико_НормативыВыпуска.ВремяНаСменуРоликов) / 60 КАК ЧИСЛО(15, 2))) КАК ВремяСледующихПеределов,
	|	Лико_НормативыВыпуска.НомерПроката КАК НомерПроката,
	|	ВТ_Выпуск.Период КАК Период
	|ПОМЕСТИТЬ ВТ_СледующиеПеределы
	|ИЗ
	|	ВТ_Выпуск КАК ВТ_Выпуск
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НормативыВыпуска КАК Лико_НормативыВыпуска
	|		ПО ВТ_Выпуск.Заказ = Лико_НормативыВыпуска.Заказ
	|			И ВТ_Выпуск.Регистратор = Лико_НормативыВыпуска.Регистратор
	|ГДЕ
	|	Лико_НормативыВыпуска.РабочийЦентр.Лико_Площадка.Организация = &Организация
	|	И Лико_НормативыВыпуска.НомерПроката > 1
	|	И НЕ Лико_НормативыВыпуска.РабочийЦентр.ВидРабочегоЦентра В (ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Прочее), ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Перемотка), ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПоперечнаяРезка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выпуск.Регистратор,
	|	ВТ_Выпуск.Заказ,
	|	Лико_НормативыВыпуска.РабочийЦентр,
	|	Лико_НормативыВыпуска.НомерПроката,
	|	ВТ_Выпуск.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выпуск.РабочийЦентр КАК РабочийЦентр,
	|	ВТ_Выпуск.Регистратор КАК Регистратор,
	|	ВТ_Выпуск.Заказ КАК Заказ,
	|	ВТ_Выпуск.НомерПроката КАК НомерПроката,
	|	СУММА(ВТ_Выпуск.Время1РЦ) КАК Время,
	|	ВТ_Выпуск.Период КАК Период
	|ПОМЕСТИТЬ ВТ_РЦ
	|ИЗ
	|	ВТ_Выпуск КАК ВТ_Выпуск
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Выпуск.РабочийЦентр,
	|	ВТ_Выпуск.Регистратор,
	|	ВТ_Выпуск.Заказ,
	|	ВТ_Выпуск.НомерПроката,
	|	ВТ_Выпуск.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СледующиеПеределы.РабочийЦентр,
	|	ВТ_СледующиеПеределы.Регистратор,
	|	ВТ_СледующиеПеределы.Заказ,
	|	ВТ_СледующиеПеределы.НомерПроката,
	|	СУММА(ВТ_СледующиеПеределы.ВремяСледующихПеределов),
	|	ВТ_СледующиеПеределы.Период
	|ИЗ
	|	ВТ_СледующиеПеределы КАК ВТ_СледующиеПеределы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СледующиеПеределы.РабочийЦентр,
	|	ВТ_СледующиеПеределы.Регистратор,
	|	ВТ_СледующиеПеределы.Заказ,
	|	ВТ_СледующиеПеределы.НомерПроката,
	|	ВТ_СледующиеПеределы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РЦ.Регистратор КАК Регистратор,
	|	ВТ_РЦ.Заказ КАК Заказ,
	|	ВТ_РЦ.РабочийЦентр КАК РабочийЦентр,
	|	СУММА(ВТ_РЦ.Время) КАК КоличествоНЧ,
	|	ВТ_РЦ.НомерПроката КАК НомерПроката,
	|	ВТ_РЦ.Период КАК Период
	|ПОМЕСТИТЬ ВТВремя
	|ИЗ
	|	ВТ_РЦ КАК ВТ_РЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РЦ.Регистратор,
	|	ВТ_РЦ.Заказ,
	|	ВТ_РЦ.НомерПроката,
	|	ВТ_РЦ.Период,
	|	ВТ_РЦ.РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВремя.Период КАК Период,
	|	Лико_КорректировкаЗатратЗарплатаПрямая.Ссылка КАК Регистратор,
	|	ВТВремя.Заказ КАК ЗаказКлиента,
	|	ВТВремя.РабочийЦентр КАК РабочийЦентр,
	|	ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.ЗарплатаПроизводственныйПерсонал) КАК СтатьяЗатрат,
	|	ВТВремя.НомерПроката КАК НомерПроката,
	|	ВТВремя.КоличествоНЧ КАК Количество,
	|	Лико_КорректировкаЗатратЗарплатаПрямая.СтоимостьНЧ * ВТВремя.КоличествоНЧ КАК Сумма
	|ИЗ
	|	ВТВремя КАК ВТВремя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.ЗарплатаПрямая КАК Лико_КорректировкаЗатратЗарплатаПрямая
	|		ПО (ВЫБОР
	|				КОГДА ВТВремя.РабочийЦентр.Лико_ОсновнаяМашина
	|					ТОГДА ВТВремя.РабочийЦентр = Лико_КорректировкаЗатратЗарплатаПрямая.РабочийЦентр
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТВремя.РабочийЦентр.ПорядковыйНомер = 140
	|							ТОГДА Лико_КорректировкаЗатратЗарплатаПрямая.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.ВидыРабочихцентров.Omega)
	|						ИНАЧЕ ВТВремя.РабочийЦентр.ВидРабочегоЦентра = Лико_КорректировкаЗатратЗарплатаПрямая.РабочийЦентр
	|					КОНЕЦ
	|			КОНЕЦ)
	|ГДЕ
	|	Лико_КорректировкаЗатратЗарплатаПрямая.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТВремя.Период,
	|	Лико_КорректировкаЗатратВалы.Ссылка,
	|	ВТВремя.Заказ,
	|	ВТВремя.РабочийЦентр,
	|	ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.Валы),
	|	ВТВремя.НомерПроката,
	|	ВТВремя.КоличествоНЧ,
	|	Лико_КорректировкаЗатратВалы.СтоимостьНЧ * ВТВремя.КоличествоНЧ
	|ИЗ
	|	ВТВремя КАК ВТВремя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.Валы КАК Лико_КорректировкаЗатратВалы
	|		ПО (ВЫБОР
	|				КОГДА ВТВремя.РабочийЦентр.Лико_ОсновнаяМашина
	|					ТОГДА ВТВремя.РабочийЦентр = Лико_КорректировкаЗатратВалы.РабочийЦентр
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТВремя.РабочийЦентр.ПорядковыйНомер = 140
	|							ТОГДА Лико_КорректировкаЗатратВалы.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.ВидыРабочихцентров.Omega)
	|						ИНАЧЕ ВТВремя.РабочийЦентр.ВидРабочегоЦентра = Лико_КорректировкаЗатратВалы.РабочийЦентр
	|					КОНЕЦ
	|			КОНЕЦ)
	|ГДЕ
	|	Лико_КорректировкаЗатратВалы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТВремя.Период,
	|	Лико_КорректировкаЗатратЗапчасти.Ссылка,
	|	ВТВремя.Заказ,
	|	ВТВремя.РабочийЦентр,
	|	ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.Запчасти),
	|	ВТВремя.НомерПроката,
	|	ВТВремя.КоличествоНЧ,
	|	Лико_КорректировкаЗатратЗапчасти.СтоимостьНЧ * ВТВремя.КоличествоНЧ
	|ИЗ
	|	ВТВремя КАК ВТВремя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.Запчасти КАК Лико_КорректировкаЗатратЗапчасти
	|		ПО (ВЫБОР
	|				КОГДА ВТВремя.РабочийЦентр.Лико_ОсновнаяМашина
	|					ТОГДА ВТВремя.РабочийЦентр = Лико_КорректировкаЗатратЗапчасти.РабочийЦентр
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТВремя.РабочийЦентр.ПорядковыйНомер = 140
	|							ТОГДА Лико_КорректировкаЗатратЗапчасти.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.ВидыРабочихцентров.Omega)
	|						ИНАЧЕ ВТВремя.РабочийЦентр.ВидРабочегоЦентра = Лико_КорректировкаЗатратЗапчасти.РабочийЦентр
	|					КОНЕЦ
	|			КОНЕЦ)
	|ГДЕ
	|	Лико_КорректировкаЗатратЗапчасти.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТВремя.Период,
	|	NULL,
	|	ВТВремя.Заказ,
	|	ВТВремя.РабочийЦентр,
	|	ЗНАЧЕНИЕ(Справочник.Лико_статьиЗатрат.АмортизацияПрямая),
	|	ВТВремя.НомерПроката,
	|	ВТВремя.КоличествоНЧ,
	|	Лико_КорректировкаЗатратАмортизация.СтоимостьНЧ * ВТВремя.КоличествоНЧ
	|ИЗ
	|	ВТВремя КАК ВТВремя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.Амортизация КАК Лико_КорректировкаЗатратАмортизация
	|		ПО (ВЫБОР
	|				КОГДА ВТВремя.РабочийЦентр.Лико_ОсновнаяМашина
	|					ТОГДА ВТВремя.РабочийЦентр = Лико_КорректировкаЗатратАмортизация.РабочийЦентр
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТВремя.РабочийЦентр.ПорядковыйНомер = 140
	|							ТОГДА Лико_КорректировкаЗатратАмортизация.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.ВидыРабочихцентров.Omega)
	|						ИНАЧЕ ВТВремя.РабочийЦентр.ВидРабочегоЦентра = Лико_КорректировкаЗатратАмортизация.РабочийЦентр
	|					КОНЕЦ
	|			КОНЕЦ)
	|ГДЕ
	|	Лико_КорректировкаЗатратАмортизация.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"   ;
	Запрос.УстановитьПараметр("НачалоПериода", Док.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Док.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Док.Организация);
	Запрос.УстановитьПараметр("Ссылка", Док.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписейЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;

#КонецОбласти

#Область Косвенные

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВыпускГПОбороты.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ВыпускГПОбороты.Заказ КАК Заказ,
	|	МАКСИМУМ(1) КАК НомерПроката,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот > 0
	|				ТОГДА Лико_ВыпускГПОбороты.ВремяПробниковОборот
	|			ИНАЧЕ Лико_ВыпускГПОбороты.Время1РЦОборот
	|		КОНЕЦ) КАК Время,
	|	МИНИМУМ(Лико_ВыпускГПОбороты.ДатаВыпуска) КАК ДатаВыпуска
	|ПОМЕСТИТЬ ВТ_Время
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			&НачалоПериода,
	|			&Конецпериода,
	|			Регистратор,
	|			Заказ.Площадка.Организация = &Организация
	|				И РабочийЦентр.Лико_ОсновнаяМашина
	|				И НЕ РабочийЦентр.ПорядковыйНомер В (142)) КАК Лико_ВыпускГПОбороты
	|ГДЕ
	|	НЕ Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВыпускГПОбороты.РабочийЦентр,
	|	Лико_ВыпускГПОбороты.Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_НормативыВыпуска.РабочийЦентр,
	|	Лико_НормативыВыпуска.Заказ,
	|	Лико_НормативыВыпуска.НомерПроката,
	|	СУММА((Лико_НормативыВыпуска.ВремяПечати + Лико_НормативыВыпуска.ВремяНаНастройку + Лико_НормативыВыпуска.ВремяНаСменуРоликов) / 60),
	|	МИНИМУМ(Лико_НормативыВыпуска.ДатаВыпуска)
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП.Обороты(
	|			&НачалоПериода,
	|			&Конецпериода,
	|			Регистратор,
	|			Заказ.Площадка.Организация = &Организация
	|				И РабочийЦентр.Лико_ОсновнаяМашина) КАК Лико_ВыпускГПОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НормативыВыпуска КАК Лико_НормативыВыпуска
	|		ПО Лико_ВыпускГПОбороты.Регистратор = Лико_НормативыВыпуска.Регистратор
	|			И Лико_ВыпускГПОбороты.ДатаВыпуска = Лико_НормативыВыпуска.ДатаВыпуска
	|ГДЕ
	|	НЕ Лико_НормативыВыпуска.РабочийЦентр.ПорядковыйНомер В (142)
	|	И Лико_НормативыВыпуска.НомерПроката > 1
	|	И Лико_НормативыВыпуска.РабочийЦентр.Лико_ОсновнаяМашина
	|	И Лико_НормативыВыпуска.РабочийЦентр.Лико_Площадка = &Организация
	|	И НЕ Лико_ВыпускГПОбороты.Регистратор.Лико_ЭтоОбщийЭтапНаМесяц
	|	И ВЫБОР
	|			КОГДА Лико_НормативыВыпуска.РабочийЦентр.ПорядковыйНомер В (8, 19)
	|				ТОГДА Лико_НормативыВыпуска.РабочийЦентр = Лико_ВыпускГПОбороты.РабочийЦентр
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_НормативыВыпуска.РабочийЦентр,
	|	Лико_НормативыВыпуска.НомерПроката,
	|	Лико_НормативыВыпуска.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Время.РабочийЦентр КАК РабочийЦентр,
	|	СУММА(ВЫРАЗИТЬ(ВТ_Время.Время КАК ЧИСЛО(15, 2))) КАК Время,
	|	ВТ_Время.НомерПроката КАК НомерПроката,
	|	ВТ_Время.Заказ КАК Заказ,
	|	ВТ_Время.ДатаВыпуска КАК ДатаВыпуска
	|ПОМЕСТИТЬ ВТ_РЦ
	|ИЗ
	|	ВТ_Время КАК ВТ_Время
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Время.РабочийЦентр,
	|	ВТ_Время.НомерПроката,
	|	ВТ_Время.Заказ,
	|	ВТ_Время.ДатаВыпуска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РЦ.ДатаВыпуска КАК Период,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка КАК Регистратор,
	|	ВТ_РЦ.Заказ КАК ЗаказКлиента,
	|	ВТ_РЦ.РабочийЦентр КАК РабочийЦентр,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_РЦ.НомерПроката КАК НомерПроката,
	|	ВТ_РЦ.Время КАК Количество,
	|	ВТ_РЦ.Время * Лико_КорректировкаЗатратСтоимостьКосвенных.СтоимостьНЧ КАК Сумма
	|ИЗ
	|	ВТ_РЦ КАК ВТ_РЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.СтоимостьКосвенных КАК Лико_КорректировкаЗатратСтоимостьКосвенных
	|		ПО ВТ_РЦ.РабочийЦентр = Лико_КорректировкаЗатратСтоимостьКосвенных.РабочийЦентр
	|ГДЕ
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка = &ссылка
	|	И Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КосвенныеРасходы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РЦ.ДатаВыпуска,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка,
	|	ВТ_РЦ.Заказ,
	|	ВТ_РЦ.РабочийЦентр,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат,
	|	ВТ_РЦ.НомерПроката,
	|	ВТ_РЦ.Время,
	|	ВТ_РЦ.Время * Лико_КорректировкаЗатратСтоимостьКосвенных.СтоимостьНЧ
	|ИЗ
	|	ВТ_РЦ КАК ВТ_РЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.СтоимостьКосвенных КАК Лико_КорректировкаЗатратСтоимостьКосвенных
	|		ПО ВТ_РЦ.РабочийЦентр = Лико_КорректировкаЗатратСтоимостьКосвенных.РабочийЦентр
	|ГДЕ
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка = &ссылка
	|	И Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЗарплатаПрочийПерсонал)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РЦ.ДатаВыпуска,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка,
	|	ВТ_РЦ.Заказ,
	|	ВТ_РЦ.РабочийЦентр,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат,
	|	ВТ_РЦ.НомерПроката,
	|	ВТ_РЦ.Время,
	|	ВТ_РЦ.Время * Лико_КорректировкаЗатратСтоимостьКосвенных.СтоимостьНЧ
	|ИЗ
	|	ВТ_РЦ КАК ВТ_РЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.СтоимостьКосвенных КАК Лико_КорректировкаЗатратСтоимостьКосвенных
	|		ПО ВТ_РЦ.РабочийЦентр = Лико_КорректировкаЗатратСтоимостьКосвенных.РабочийЦентр
	|ГДЕ
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка = &ссылка
	|	И Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.АмортизацияКосвенная)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РЦ.ДатаВыпуска,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка,
	|	ВТ_РЦ.Заказ,
	|	ВТ_РЦ.РабочийЦентр,
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат,
	|	ВТ_РЦ.НомерПроката,
	|	ВТ_РЦ.Время,
	|	ВТ_РЦ.Время * Лико_КорректировкаЗатратСтоимостьКосвенных.СтоимостьНЧ
	|ИЗ
	|	ВТ_РЦ КАК ВТ_РЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_КорректировкаЗатрат.СтоимостьКосвенных КАК Лико_КорректировкаЗатратСтоимостьКосвенных
	|		ПО ВТ_РЦ.РабочийЦентр = Лико_КорректировкаЗатратСтоимостьКосвенных.РабочийЦентр
	|ГДЕ
	|	Лико_КорректировкаЗатратСтоимостьКосвенных.Ссылка = &ссылка
	|	И Лико_КорректировкаЗатратСтоимостьКосвенных.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ПрочиеМатериалы)"     ;
	
	Запрос.УстановитьПараметр("НачалоПериода", Док.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Док.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Док.Организация);
	Запрос.УстановитьПараметр("Ссылка", Док.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписейЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;

	
	
	НаборЗаписейЗатраты.Записать();
	

#КонецОбласти
		
	
КонецПроцедуры
