Функция ПолучитьПочтовыеАдреса(ТипСобощений,Знач Площадка) Экспорт //+Лико m.shenderov 14.05.2020
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Площадка) = Тип("СправочникСсылка.Организации") Тогда 
		
		Площадка = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Площадка);
		
	КонецЕсли;
	
	Адресат="";
	//ТипСобощений=Справочники.Лико_ТипыСообщений.СоздатьЭлемент();
	Структура = Новый Структура;
	Структура.Вставить("Площадка",Площадка);
	НайденныеКонтакты= ТипСобощений.Площадки.НайтиСтроки(Структура);
	Адреса= Новый Массив;
	Для каждого Контакт Из НайденныеКонтакты  Цикл
		ОбщийМассив=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Контакт.Контакты,";",Истина);
		Для каждого Адрес Из ОбщийМассив Цикл
			Если СтрНайти(Адрес,"@")>0 Тогда
				Адреса.Добавить(Адрес);
			КонецЕсли; 			
		КонецЦикла;		
	КонецЦикла;
	
	Для каждого Адрес Из Адреса Цикл
			 Адресат=Адресат + Адрес+";";
	КонецЦикла;
		
	Возврат ?(СтрДлина(Адресат)>0,Лев(Адресат,СтрДлина(Адресат)-1),Адресат);

		
КонецФункции //-Лико m.shenderov 14.05.2020 
