
&НаСервере
&Вместо("ЗаписатьНаСервере")
Функция Лико_ЗаписатьНаСервере()

	УстановитьПривилегированныйРежим(Истина);

	НачатьТранзакцию();

	ДокОбъект = Документ.ПолучитьОбъект();
	ТребуетсяСохранение = Ложь;
	ТребуетсяПересчетВыработки = Ложь;

	Для каждого Строка из ТаблицаДанных Цикл
		СтрокаДокумента = ДокОбъект[Этап.ИмяПредопределенныхДанных].Найти(Строка.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если СтрокаДокумента <> Неопределено Тогда
			Если СтрокаДокумента.Количество <> Строка.Количество ИЛИ СтрокаДокумента.НомерБланка <> Строка.НомерБланка ИЛИ СтрокаДокумента.Растарка <> Строка.Растарка Тогда
				Если СтрокаДокумента.Количество <> Строка.Количество Тогда
					ТребуетсяПересчетВыработки = Истина;	
				КонецЕсли;
				ТребуетсяСохранение = Истина;
				// Сначала обновим данные в регистре Этапы заказов
				МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Заказ = Документ.ЗаказКлиента;
				МенеджерЗаписи.Площадка = МенеджерЗаписи.Заказ.Площадка;
				МенеджерЗаписи.Период = СтрокаДокумента.Дата;
				МенеджерЗаписи.Прочитать();
				Если Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.ВыходнойКонтроль Тогда
					ЭтапВРегистре = Справочники.Лико_ЭтапыВыполненияЗаказа.Упаковка;
				ИначеЕсли Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Перемотка Тогда
					ЭтапВРегистре = Справочники.Лико_ЭтапыВыполненияЗаказа.ВыходнойКонтроль;
				КонецЕсли;

				Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.Этап = ЭтапВРегистре Тогда
					МенеджерЗаписи.Количество = Строка.Количество;
					МенеджерЗаписи.НомерБланка = Строка.НомерБланка; 
					Если СтрокаДокумента.Растарка <> Строка.Растарка Тогда
						Если СтрокаДокумента.Растарка Тогда
							// Попробуем убрать из комментария слово "Растарка"
							МенеджерЗаписи.Комментарий = СтрЗаменить(МенеджерЗаписи.Комментарий, "Растарка. ", "");
							МенеджерЗаписи.Комментарий = СтрЗаменить(МенеджерЗаписи.Комментарий, "Растарка", ""); 
						Иначе
							// Добавим слово Растарка
							МенеджерЗаписи.Комментарий = "Растарка" + ?(ЗначениеЗаполнено(МенеджерЗаписи.Комментарий), ". " + МенеджерЗаписи.Комментарий, "");
						КонецЕсли;
					КонецЕсли;
					МенеджерЗаписи.Комментарий = ?(ЗначениеЗаполнено(МенеджерЗаписи.Комментарий), МенеджерЗаписи.Комментарий + ". ", "") + "Запись изменена " + ТекущаяДата();
					Если МенеджерЗаписи.Количество = 0 Тогда
						МенеджерЗаписи.Удалить();
					Иначе
						МенеджерЗаписи.Записать(Истина);
					КонецЕсли;
				КонецЕсли;

				Если Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Перемотка Тогда
					// Нужно поменять в заказе клиента данные по выработке перемотчиков
					НайденныеСтроки = Документ.ЗаказКлиента.Перемотка.НайтиСтроки(Новый Структура("Дата,НомерБланка", СтрокаДокумента.Дата, СтрокаДокумента.НомерБланка));
					Если НайденныеСтроки.Количество() > 0 Тогда
						ЗаказОбъект = Документ.ЗаказКлиента.ПолучитьОбъект();
						// Найдем еще раз, чтобы можно было удалить
						НайденныеСтроки = ЗаказОбъект.Перемотка.НайтиСтроки(Новый Структура("Дата,НомерБланка", СтрокаДокумента.Дата, СтрокаДокумента.НомерБланка));
						Для каждого СтрокаТЧПеремотка из НайденныеСтроки Цикл
							Если Строка.Количество = 0 Тогда
								// Удаляем
								ЗаказОбъект.Перемотка.Удалить(СтрокаТЧПеремотка);
							Иначе
								// меняем
								СтрокаТЧПеремотка.НомерБланка = Строка.НомерБланка;
								// Количества заполним кодом из обработки ТСРабочийСтолПеремотка
								Если СтрокаТЧПеремотка.ТипОперации = Перечисления.Лико_ТипыОперацийПеремотки.Перемотка ИЛИ (СтрокаТЧПеремотка.ТипОперации = Перечисления.Лико_ТипыОперацийПеремотки.ПеремоткаПослеНФ И ЗаказОбъект.Площадка <> Справочники.Лико_Площадки.Сибирь) Тогда
									// Переводим штуки в пог. метры
									СтрокаТЧПеремотка.КоличествоПМ = Строка.Количество * 1000 * 1000 / ЗаказОбъект.ШтКВМ / ЗаказОбъект.Нарезка.Размер;
								Иначе
									// Здесь должно быть сразу в пог. метрах, переводить не нужно
									СтрокаТЧПеремотка.КоличествоПМ = Строка.Количество;
								КонецЕсли;
								Если ЗначениеЗаполнено(СтрокаТЧПеремотка.нарезка) Тогда 
									СтрокаТЧПеремотка.Количество = СтрокаТЧПеремотка.КоличествоПМ*СтрокаТЧПеремотка.нарезка.размер/1000;
								Иначе
									СтрокаТЧПеремотка.Количество = 0;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						Попытка
							ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись), РежимПроведенияДокумента.Неоперативный);
						Исключение
							Сообщить("Не удалось обновить данные в заказе: " + ОписаниеОшибки());
							ОтменитьТранзакцию();
							Возврат Ложь;
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;

				// Теперь поменяем строку документа
				ЗаполнитьЗначенияСвойств(СтрокаДокумента, Строка);

				// <-- Начало Лико Яцун С. В. 29.08.2025 
				Если Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Перемотка И СтрокаДокумента.Количество <> 0 И ТребуетсяПересчетВыработки Тогда
					Документы.Лико_ДвиженияЗаказаПоЭтапам.ПересчитатьВыработкуПеремотки(Документ.ЗаказКлиента,СтрокаДокумента)	
				КонецЕсли;	

				//Если СтрокаДокумента.Количество = 0 Тогда
				Если (СтрокаДокумента.Количество = 0 И НЕ Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Перемотка) 
					ИЛИ (СтрокаДокумента.Количество = 0 И Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Перемотка И СтрокаДокумента.ТипОперации <> Справочники.Лико_ТипыОперацийПеремотка.ИсправлениеБрака) 
					ИЛИ (Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Перемотка И СтрокаДокумента.Время = 0 И СтрокаДокумента.ТипОперации = Справочники.Лико_ТипыОперацийПеремотка.ИсправлениеБрака) Тогда
					// <-- Конец Лико Яцун С. В. 29.08.2025
					ДокОбъект[Этап.ИмяПредопределенныхДанных].Удалить(СтрокаДокумента);
				КонецЕсли;
				// <-- Начало Лико Яцун С. В. 29.08.2025	
			ИначеЕсли Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Перемотка И СтрокаДокумента.Время <> Строка.Время И СтрокаДокумента.ТипОперации = Справочники.Лико_ТипыОперацийПеремотка.ИсправлениеБрака Тогда
				СтрокаДокумента.Время = Строка.Время;
				Если СтрокаДокумента.Время = 0 Тогда
					ДокОбъект[Этап.ИмяПредопределенныхДанных].Удалить(СтрокаДокумента);
				КонецЕсли;
				// <-- Конец Лико Яцун С. В. 29.08.2025
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ТребуетсяСохранение Тогда
		Попытка
			ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись), РежимПроведенияДокумента.Неоперативный);
			ЗафиксироватьТранзакцию();
			Сообщить("Обновленные данные по заказу " + Документ.ЗаказКлиента.НомерБезПрефикса + " успешно сохранены");
		Исключение
			Сообщить("Не удалось обновить данные: " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
	Иначе
		ОтменитьТранзакцию();
		Сообщить("По заказу " + Документ.ЗаказКлиента.НомерБезПрефикса + " не было измененных данных");
	КонецЕсли;

	ЗаполнитьТаблицуДанных();
	Модифицированность = Ложь;

	Возврат Истина;

КонецФункции
