
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоАртикулу", Ложь); 
	Список.Параметры.УстановитьЗначениеПараметра("Артикул","");

	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ЗаказНомерБезПрефикса" Или Поле.Имя="Заказ" Тогда
		СтандартнаяОбработка=Ложь;
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Элементы.Список.ТекущиеДанные.Заказ);
		ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АртикулОтборПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Артикул) ТОгда 
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоАртикулу", Истина); 
		Список.Параметры.УстановитьЗначениеПараметра("Артикул","%"+СокрЛП(Артикул)+"%");
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоАртикулу", Ложь); 
		Список.Параметры.УстановитьЗначениеПараметра("Артикул","");

	КонецЕсли;
	Элементы.Список.Обновить();
	ОбновитьИнтерфейс();

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти