Функция ПолучитьМассивНастроек(Настройка=Неопределено) Экспорт //+Лико m.shenderov 27.12.2021
	 УстановитьПривилегированныйРежим(Истина); 	
	Массив = Новый Массив();
	Настройка = ?(Настройка=Неопределено,Справочники.НастройкиОтображенияПлана.Основная,Настройка);
	
	Для каждого Запись Из Настройка.ПоляТаблицы Цикл
		Структура = Новый Структура;
		Структура.Вставить("Имя",Запись.Имя);
		Структура.Вставить("Заголовок",Запись.Заголовок);
		Структура.Вставить("Ширина",Запись.Ширина);
		Структура.Вставить("Видимость",Запись.Видимость);
		Структура.Вставить("Шаблон",Запись.Шаблон);
		Структура.Вставить("СайтВидимость",Запись.СайтВидимость);
        Структура.Вставить("СайтВидимостьРасшифровка",Запись.СайтВидимостьРасшифровка);

		Массив.Добавить(Структура);		
	КонецЦикла; 
	
	Возврат Массив;
	
	
КонецФункции //-Лико m.shenderov 27.12.2021 
