#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Заказ=?(Параметры.Свойство("Заказ"),Параметры.Заказ,Неопределено);
	Артикул=?(Параметры.Свойство("Артикул"),Параметры.Артикул,Неопределено);
	
	ЗаполнитьТЗСервер();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЗ
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
 Процедура СоздатьЗаказОснастки(Команда)
	Массив = Новый Массив();
	
	Для каждого Оснастка Из Тз Цикл
		Если Оснастка.Выбрать Тогда
			Массив.Добавить(Оснастка.Номенклатура);
		КонецЕсли;
		
		
	КонецЦикла;
	
	Закрыть(Массив);
	 
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьЗаказОснасткиНаСервере()
	
	Массив = Новый Массив();
	
	Для каждого СтрТз Из ТЗ Цикл
		
		Если СтрТз.Выбрать Тогда			
			Массив.Добавить(СтрТз.Номенклатура);
		КонецЕсли;
		
		
	КонецЦикла;
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Заказ",Заказ);
	ДанныеЗаполнения.Вставить("МассивНоменклатур",Массив);
	
	ЗаказОснасткиОбъект=Документы.Лико_ЗаказОснастки.СоздатьДокумент();
	ЗаказОснасткиОбъект.Заполнить(ДанныеЗаполнения);
	ЗаказОснасткиОбъект.Дата=ТекущаяДата();
	НачатьТранзакцию();
	Для каждого ТД Из ЗаказОснасткиОбъект.Оснастка Цикл
		ТД.Статус=Перечисления.Лико_СтатусыЗаказовНаОснастку.Подтвержден;

		Если ТД.ВнутреннийЗаказ Тогда
						Если СтрНайти(НРег(Тд.Номенклатура.Наименование),"контрматрица")>0 Тогда 
				
				Организация   = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Организация");
				Организация   = ?(ЗначениеЗаполнено(Организация),Организация,Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ЗаказОснасткиОбъект.Получатель,"Организация"));
				
				Регион=
				?(
				ЗначениеЗаполнено(ТД.Регион),
				ТД.Регион,
				Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Регион")
				);  			
				ТД.ЗаказНаПроизводство=Документы.Лико_ЗаказОснастки.СоздатьЗаказНаполуфабрикат(Организация,ЗаказОснасткиОбъект.Площадка,ТД.Заказ,ТД.Партнер,Регион,ТД.Номенклатура,ТД.Количество,Истина,Истина);
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЦикла;
	ЗаказОснасткиОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ЗафиксироватьТранзакцию();
	Возврат ЗаказОснасткиОбъект.Ссылка;
	
	
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполненияПолейКлиент() //+Лико m.shenderov 15.09.2021
	
	Для каждого СтрТз Из Тз Цикл
		
		Если СтрТз.Выбрать Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Возврат Ложь; 	
	
КонецФункции //-Лико m.shenderov 15.09.2021

&НаСервере
Процедура ЗаполнитьТзСервер() //+Лико m.shenderov 15.09.2021
	
	Запрос = Новый Запрос;
	//Документы.Лико_ЗаказОснастки.ТекстЗапросаОснасткаНаЗаказ(Запрос.Текст);
	//Запрос.УстановитьПараметр("Заказ",Заказ);
	ТекстЗапросаОснасткаНаЗаказ(Запрос.Текст);

	Запрос.УстановитьПараметр("Артикул",Артикул);

	
	Для каждого СтрТзОснастка Из Запрос.Выполнить().Выгрузить() Цикл
		
		Если СтрНайти(НРег(СтрТзОснастка.Номенклатура.Наименование),"кондуктор")<>0 Или
			СтрНайти(НРег(СтрТзОснастка.Номенклатура.Наименование),"контрматрица")<>0
			Тогда
			
			НоваяСтрТз=Тз.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрТз,СтрТзОснастка);
			
		КонецЕсли; 	
		
	КонецЦикла; 	
	
КонецПроцедуры  //-Лико m.shenderov 15.09.2021


&НаСервере
Процедура ТекстЗапросаОснасткаНаЗаказ(ТекстЗапроса) //+Лико m.shenderov 13.10.2021
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Ном.Ссылка КАК Номенклатура,
	|	Лико_ПараметрыШтампа.ТипШтампа КАК ТипШтампа
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО Лико_ПараметрыШтампа.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	Ном.Артикул = &Артикул";
	
	
	
КонецПроцедуры  //-Лико m.shenderov 13.10.2021




#КонецОбласти