
&Вместо("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ)
		Если  ЭтоГруппа Тогда
		
		Если  ЭтоНовый() И Не ЗначениеЗаполнено(Код) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(ЦеновыеГруппы.Код) КАК Код
			|ИЗ
			|	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
			|ГДЕ
			|	ЦеновыеГруппы.ЭтоГруппа";
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				МаксКод=Число(Выборка.Код);
				МаксКод=МаксКод+1;
				
				Код=Формат(МаксКод,"ЧЦ=9; ЧВН=; ЧГ=");
				
			КонецЦикла; 
		КонецЕсли;
		
		
		
		
	Иначе
		
		
		Если ЭтоНовый() и Metal Тогда 	
			текст = СтрШаблон( "в 1С добавлен новый металлизированный материал c кодом %1, наименование %2" , Код, Наименование); 
			Лико_Планирование.ОтправитьПисьмо(текст, "Добавлен новый металлизированный материал", "mlipatov@okil-sato.ru; iivanov@okil-sato.ru; mbuyanov@okil-sato.ru"); 
		КонецЕсли;
		
		РегистрыСведений.Лико_АвтоРасчетЦенЦГ.Установить(Ссылка,,Лико_АвтоРасчетЦены);
		
	КонецЕсли;
	

КонецПроцедуры
