Функция ДобавитьСобытие(listener="dfm",event="СозданиеНоменклатуры",dataJson) Экспорт  //+Лико m.shenderov 26.01.2024
	
УстановитьПривилегированныйРежим(Истина);

	ТипыСобытий=ТипыСобытийОбмена();
	
	uuid = Строка(Новый УникальныйИдентификатор);	
	
	НаборЗаписей = РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.uuid.Установить(uuid);
	
	Запись=НаборЗаписей.Добавить();
	Запись.uuid=uuid;
	Запись.created_at=ТекущаяДата();
	Запись.listener=listener;  
	Запись.event=ТипыСобытий[event];
	Запись.data=dataJson;
	НаборЗаписей.Записать(Истина);
	
	Возврат uuid;
	
КонецФункции //-Лико m.shenderov 26.01.2024


Функция ТипыСобытийОбмена() Экспорт  //+Лико m.shenderov 09.01.2024
	
	Структура = Новый Структура;
	Структура.Вставить("СозданиеНоменклатуры","create_article"); 
	Структура.Вставить("НаправитьЗаказВРаботу","send_order_to_work"); 
	Структура.Вставить("ОтправитьСообщение","send_notify");
	Структура.Вставить("ИзменитьНаименование","rename_product");

	
	Возврат Структура;
КонецФункции //-Лико m.shenderov 09.01.2024 


Процедура НаправитьЗаказВРаботу(Заказ) Экспорт  //+Лико m.shenderov 26.01.2024
УстановитьПривилегированныйРежим(Истина);	
	dataJson=Лико_HTTP_Сервер.СтруктураВJSON(
	Новый Структура("order_number,order_version,order_time",Заказ.Номер,Заказ.Версия,Заказ.Дата)
	); 
	
	
	uuid=ДобавитьСобытие(,"НаправитьЗаказВРаботу",dataJson); 
	
КонецПроцедуры //-Лико m.shenderov 26.01.2024

Процедура ИзменитьСтатус(uuid,status) Экспорт //+Лико m.shenderov 05.02.2024
УстановитьПривилегированныйРежим(Истина);	
		
		НаборЗаписей = РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.uuid.Установить(uuid);
		НаборЗаписей.Прочитать();
		Для каждого Запись Из НаборЗаписей Цикл 
			Запись.modified_at=ТекущаяДата();
			Запись.status=status;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		


	
	
КонецПроцедуры //-Лико m.shenderov 05.02.2024 

