
Функция HttpResponsGet(host,slug,port="",ssl=Неопределено) Экспорт //+Лико m.shenderov 07.05.2021
	Если ТипЗнч(ssl)=Тип("ЗащищенноеСоединениеOpenSSL") Тогда
		СоединениеHTTP = Новый HTTPСоединение(host,port,,,,,ssl);
	Иначе
		СоединениеHTTP = Новый HTTPСоединение(host,port);
	КонецЕсли;	
		HTTPЗапрос = Новый HTTPЗапрос(slug);
				
		HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос);
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();		
	 Возврат   Ответ; 
 КонецФункции //-Лико m.shenderov 07.05.2021
 

Функция HttpResponsPost(host,slug,json,ssl=Неопределено,port="",header="") Экспорт //+Лико m.shenderov 07.05.2021
	Если ТипЗнч(ssl)=Тип("ЗащищенноеСоединениеOpenSSL") Тогда
		СоединениеHTTP = Новый HTTPСоединение(host,port,,,,,ssl);
	Иначе
		СоединениеHTTP = Новый HTTPСоединение(host,port);
	КонецЕсли;
	
		HTTPЗапрос = Новый HTTPЗапрос(slug);
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		Если ТипЗнч(header)=Тип("Массив") Тогда
			 Для каждого Структура Из header Цикл 			
				   Для каждого Ключ Из  Структура Цикл
				   	     HTTPЗапрос.Заголовки.Вставить(Ключ.Ключ, Ключ.Значение);
				   КонецЦикла;
			   КонецЦикла;
		КонецЕсли;	   
		HTTPЗапрос.УстановитьТелоИзСтроки(json);		
	 Возврат СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
КонецФункции //-Лико m.shenderov 07.05.2021 


Функция TimestampВДату( Timestamp) Экспорт  
 Попытка
 Возврат Дата("19700101")+?(ТипЗнч(Timestamp) = Тип("Строка"), Число(Timestamp), Timestamp);
 Исключение
 Возврат Неопределено;
 КонецПопытки;
КонецФункции
 

Функция СтруктураВJSON(Структура) Экспорт //+Лико m.shenderov 07.05.2021
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура,НастройкиСериализациииJSON); 	
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	 Возврат ТелоЗапроса; 
КонецФункции //-Лико m.shenderov 07.05.2021


Функция ПолучитьОтветJSON(HTTPОтвет) Экспорт //+Лико m.shenderov 07.05.2021
		ПотокОтветаJSON  = HTTPОтвет.ПолучитьТелоКакПоток();
		ЧтениеПотокаJSON = Новый ЧтениеJSON;
		ЧтениеПотокаJSON.ОткрытьПоток(ПотокОтветаJSON, КодировкаТекста.UTF8);
		Результат=ПрочитатьJSON(ЧтениеПотокаJSON);
		ЧтениеПотокаJSON.Закрыть();
		Возврат Результат; 
КонецФункции //-Лико m.shenderov 07.05.2021 



Процедура ПриведениеТЗКСтандартнымТипам(ТЗ) Экспорт //+Лико m.shenderov 14.09.2021
	
	// Обработаем полученный запрос: приведем все к стандартным типам, уберем данные по недоступным заказам
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТЗКопияПриведенная = ТЗ.Скопировать(Новый Структура());
	МассивСтруктурКолонокКПриведению = Новый Массив;
	Для каждого Колонка из ТЗКопияПриведенная.Колонки Цикл
		Если НЕ (Колонка.ТипЗначения.СодержитТип(Тип("Строка"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Число"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Дата"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Булево"))
			)
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Строка"))
			Тогда
			МассивСтруктурКолонокКПриведению.Добавить(Новый Структура("ИмяКолонки,Тип", Колонка.Имя, ТипСтрока));
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("NULL")) Тогда
			МассивСтруктурКолонокКПриведению.Добавить(Новый Структура("ИмяКолонки,Тип", Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null")));
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтруктураКолонки из МассивСтруктурКолонокКПриведению Цикл
		ТЗКопияПриведенная.Колонки.Удалить(СтруктураКолонки.ИмяКолонки);
	КонецЦикла;
	Для каждого СтруктураКолонки из МассивСтруктурКолонокКПриведению Цикл
		ТЗКопияПриведенная.Колонки.Добавить(СтруктураКолонки.ИмяКолонки, СтруктураКолонки.Тип);
	КонецЦикла;
	
	Для каждого Строка из ТЗ Цикл
		НоваяСтрока = ТЗКопияПриведенная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ТЗ = ТЗКопияПриведенная;
	
КонецПроцедуры //-Лико m.shenderov 14.09.2021 

Функция ВернутьТзКакJSON(ТЗ) Экспорт //+Лико m.shenderov 14.09.2021
	
	МассивВозврата = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
	
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, МассивВозврата, НастройкиСериализациииJSON); 	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8"); 	
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
	
КонецФункции

Функция ТPJSON(ТЗ) Экспорт //+Лико m.shenderov 14.09.2021
	
	
	
	ТЗКопияПриведенная = КопияТЗПриведеннаяКТипамJSON(ТЗ);	
	
	Массив = Новый Массив();
	НоваяСтрока = ТЗКопияПриведенная.Добавить();
	
	Для каждого Строка из ТЗ Цикл 		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НоваяСтрока));		
	КонецЦикла;   	
	
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Массив, НастройкиСериализациииJSON); 	
	Возврат  ЗаписьJSON.Закрыть();
	
	
КонецФункции //-Лико m.shenderov 14.09.2021 

Функция Ответ(Body) Экспорт //+Лико m.shenderov 14.09.2021
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8"); 	
	Ответ.УстановитьТелоИзСтроки(Body, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

	
КонецФункции //-Лико m.shenderov 14.09.2021 

Функция КопияТЗПриведеннаяКТипамJSON(ТЗ)//+Лико m.shenderov 14.09.2021
	
		ТЗКопияПриведенная = ТЗ.Скопировать(Новый Структура());
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	МассивСтруктурКолонокКПриведению = Новый Массив;
	Для каждого Колонка из ТЗКопияПриведенная.Колонки Цикл
		Если НЕ (Колонка.ТипЗначения.СодержитТип(Тип("Строка"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Число"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Дата"))
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Булево"))
			)
			ИЛИ Колонка.ТипЗначения.СодержитТип(Тип("Строка"))
			Тогда
			МассивСтруктурКолонокКПриведению.Добавить(Новый Структура("ИмяКолонки,Тип", Колонка.Имя, ТипСтрока));
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("NULL")) Тогда
			МассивСтруктурКолонокКПриведению.Добавить(Новый Структура("ИмяКолонки,Тип", Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null")));
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтруктураКолонки из МассивСтруктурКолонокКПриведению Цикл
		ТЗКопияПриведенная.Колонки.Удалить(СтруктураКолонки.ИмяКолонки);
	КонецЦикла;
	Для каждого СтруктураКолонки из МассивСтруктурКолонокКПриведению Цикл
		ТЗКопияПриведенная.Колонки.Добавить(СтруктураКолонки.ИмяКолонки, СтруктураКолонки.Тип);
	КонецЦикла;

	 Возврат ТзКопияПриведенная;
КонецФункции //-Лико m.shenderov 14.09.2021 

Функция ТзВМассивСтруктур(Тз) Экспорт //+Лико m.shenderov 16.06.2022
	
	ТЗКопияПриведенная=КопияТЗПриведеннаяКТипамJSON(ТЗ);
	
	Массив = Новый Массив();
	НоваяСтрока = ТЗКопияПриведенная.Добавить();
	
	Для каждого Строка из ТЗ Цикл 		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НоваяСтрока));		
	КонецЦикла; 
	
	Возврат Массив;

КонецФункции //-Лико m.shenderov 16.06.2022 

Функция QueryFree(TextQuery,ParamsQuery) Экспорт  //+Лико m.shenderov 27.09.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст = TextQuery;
		
	Для каждого КлючЗначение  Из ParamsQuery Цикл
		
		Запрос.УстановитьПараметр(КлючЗначение.Ключ,КлючЗначение.Значение );
		
		
	КонецЦикла;
	Возврат Ответ(ТPJSON(Запрос.Выполнить().Выгрузить()));
	
	
КонецФункции //-Лико m.shenderov 27.09.2022 

Функция GetToken(Пользователь,Сервис="Liko_Rest") Экспорт
	
	Дата1970 = Дата(1970,1,1,1,0,0);
	ВремяСоздания =НачалоДня(ТекущаяДата())-Дата1970; 
	//ВремяСоздания =ТекущаяДата()-Дата1970-60*60*2; 

	ВремяЖизни = 60*60*24; // 24 часа
	
	//ВремяЖизни = 60*5; // 24 часа

	КлючПодписи = GetKeyJWT();
	АлгоритмПодписи = АлгоритмПодписиТокенаДоступа.HS256;
    ТокенДоступа = Новый ТокенДоступа;
    ТокенДоступа.Заголовки.Вставить("alg", Строка(АлгоритмПодписи));
    ТокенДоступа.Эмитент = "ssl";  // прибито гвоздями как минимум в 8.3.21.1302        
    
    //ТокенДоступа.Получатели.Добавить("testservis"); // вот так указано в примерах в документации - работать не будет. 
// нужно вот так
    МассивПолучателей = Новый Массив;
    МассивПолучателей.Добавить(Сервис); // имя http-сервиса из default.vrd
	ТокенДоступа.Получатели = МассивПолучателей;

    Имя = СвойстваПользователяИБ(Пользователь);
    ТокенДоступа.КлючСопоставленияПользователя = Имя; // имя пользователя 1С, у которого должна стоять галочка "Аутентификация токеном доступа"
    ТокенДоступа.ВремяСоздания = ВремяСоздания; // в примерах от 1С ляп, токен создается в Москве на 3 часа в будущем и сразу не работает из-за использованнного способа получения timestamp
    ТокенДоступа.ВремяЖизни = ВремяЖизни; 
    ТокенДоступа.Идентификатор = Строка(Новый УникальныйИдентификатор);
    ТокенДоступа.Подписать(АлгоритмПодписи, КлючПодписи); // ключик из default.vrd
     Возврат Строка(ТокенДоступа); // получим токен строкой   // Через параметр запроса "AccessToken" или в заголовке "Authorization"
  
КонецФункции  

Функция GetKeyJWT() Экспорт  //+Лико m.shenderov 17.11.2022
 Возврат "0KHQuNC60YDQtdGC0L3Ri9C5INC60LvRjtGH0Yw=";		
КонецФункции //-Лико m.shenderov 17.11.2022 

Функция СвойстваПользователяИБ(Пользователь) Экспорт  //+Лико m.shenderov 16.11.2022
	
	СвойстваПользователя=Пользователи.СвойстваПользователяИБ(Пользователь.ИдентификаторПользователяИБ);
	
	Возврат СвойстваПользователя.Имя;  
	//Возврат СтрЗаменить(СвойстваПользователя.ПользовательОС,"\\","");
	
КонецФункции  //-Лико m.shenderov 16.11.2022



 Функция ОтправитьПоHttp1с (СтруктураЗапроса,МассивДата=Неопределено,Настройки=Неопределено) Экспорт //+Лико m.shenderov 23.03.2021
	 
	 Если Настройки=Неопределено Тогда
		Settings=Settings(Справочники.HTTPСервисы._1С);
	Иначе
		Settings=Settings(Настройки);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	#Если НЕ ВебКлиент Тогда	
		ТелоЗапроса=Лико_HTTP_Сервер.СтруктураВJSON(СтруктураЗапроса);
		ssl=?(Settings.Свойство("ssl_ERP"),Settings.ssl_ERP,Неопределено);
		Попытка
			HTTPОтвет = HttpRecuest1с(
				Settings.domain,
				Settings.ApiEndPoint,
				ТелоЗапроса,
				Settings.username,
				Settings.password,
				ssl);
			Возврат ПолучитьОтветJSON(HTTPОтвет);						
		Исключение
			ТекстОшибки=ОписаниеОшибки();
			Лико_HTTP_Сервер.ВызватьИсключениеПринудительно(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Возврат Неопределено;
		КонецПопытки;	
	#КонецЕсли
	
КонецФункции //-Лико m.shenderov 23.03.2021

Функция Settings(HTTPСервис=Неопределено) Экспорт //+Лико m.shenderov 07.12.2021
	УстановитьПривилегированныйРежим(Истина);
	Структура = Новый Структура;
	
	Если HTTPСервис=Неопределено Тогда 
		HTTPСервис=Справочники.HTTPСервисы.INT;
	КонецЕсли;
	DEV=Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	HTTPConnections.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.HTTPConnections КАК HTTPConnections
	|ГДЕ
	|	HTTPConnections.Сервис = &Сервис
	|	И HTTPConnections.DEV = &DEV";
	Запрос.УстановитьПараметр("Сервис",HTTPСервис );
	Запрос.УстановитьПараметр("DEV",DEV );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		HTTPConnection=Выборка.Ссылка;  	
		Для каждого Парам Из HTTPConnection.Параметры Цикл
			Структура.Вставить(Парам.Ключ,Парам.Значение);
		КонецЦикла; 		
	Структура.Вставить("username",HTTPConnection.Пользователь); 
	Структура.Вставить("password",HTTPConnection.Пароль);
	
	КонецЦикла; 
	
	
	Возврат Структура; 	
	
КонецФункции //-Лико m.shenderov 07.12.2021 

Функция HttpRecuest1с(host,slug,json,login,password,ssl=Неопределено,port="",header="") Экспорт  //+Лико m.shenderov 07.05.2021
	
	СоединениеHTTP=Неопределено;	
	СтрКоманда=СтрШаблон("СоединениеHTTP = новый HTTPСоединение(%1,%2,%3,%4,,%5)",
    "host",
	port,
	"login",
	"password",
	?(ssl=Неопределено,"","ssl"));
	Выполнить(СтрКоманда); 	
		
		HTTPЗапрос = Новый HTTPЗапрос(slug);
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		Если ТипЗнч(header)=Тип("Массив") Тогда
			 Для каждого Структура Из header Цикл 			
				   Для каждого Ключ Из  Структура Цикл
				   	     HTTPЗапрос.Заголовки.Вставить(Ключ.Ключ, Ключ.Значение);
				   КонецЦикла;
			   КонецЦикла;
		КонецЕсли;	   
		HTTPЗапрос.УстановитьТелоИзСтроки(json);		
	 Возврат СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
 КонецФункции //-Лико m.shenderov 07.05.2021     
 
 
 Функция Запрос1с(ТексЗапроса,ПараметрыСтруктура=Неопределено,HTTPСервис) Экспорт  //+Лико m.shenderov 19.01.2024
	 
	 Если ТипЗнч(HTTPСервис)=Тип("Строка") Тогда
		 
		 HTTPСервис=Справочники.HTTPСервисы.НайтиПоНаименованию(HTTPСервис);
		 
	 КонецЕсли;
	 
	 
	 ПараметрыСтруктура=?(ПараметрыСтруктура=Неопределено,Новый Структура,ПараметрыСтруктура);
	 
	 Структура = Новый Структура;
	 Структура.Вставить("ProcName","QueryFree");
	 Структура.Вставить("TextQuery",ТексЗапроса);
	 Структура.Вставить("ParamsQuery",ПараметрыСтруктура);
	 
	 Возврат Лико_HTTP_Сервер.ОтправитьПоHttp1с(Структура,,HTTPСервис);  
	 
	 
 КонецФункции //-Лико m.shenderov 19.01.2024 
 
 