
Перем КлючиСтруктуры;
Перем ОтключитьЧастьПроверок; 

Процедура ПриКопировании(ОбъектКопирования)
	
	Комментарий = "";
	Состояние = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Организация = Площадка.Организация;
		
	Если Ссылка.Состояние = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И Ссылка.Проведен И НЕ РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;
		Сообщить("Документ уже закрыт, изменения разрешены только под полными правами");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Площадка) Тогда
		Отказ = Истина;
		Сообщить("Не заполнена площадка");
		Возврат;
	КонецЕсли;
	
	Если Товары.Количество() > 0 Тогда
		Менеджер = Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Менеджер;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Товары.Количество() = 0 Тогда
			Отказ = Истина;
			Сообщить("Таблица товаров пустая");
		КонецЕсли;
		
		// Проверим заполненность товаров
		МассивПродавцов = Новый Массив;
		МассивПробникНепробник = Новый Массив;
		Для каждого Строка из Товары Цикл
			Если НЕ ЗначениеЗаполнено(Строка.Характеристика) Тогда
				Отказ = Истина;
				Сообщить("В строке №" + Строка.НомерСтроки + " не заполнена характеристика");
			КонецЕсли;
			Заказ = Строка.Характеристика.Лико_ЗаказНоменклатуры;
			ПлощадкаЗаказа = Заказ.Площадка;
			Если ЗначениеЗаполнено(ПлощадкаЗаказа) И ПлощадкаЗаказа <> Площадка Тогда
				Отказ = Истина;
				Сообщить("В строке №" + Строка.НомерСтроки + " площадка заказа (" + ПлощадкаЗаказа + ") отличается от площадки документа (" + Площадка + ")");
			КонецЕсли;
			МассивПродавцов.Добавить(Заказ.Организация);
			МассивПробникНепробник.Добавить(?(Заказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник, Истина, Ложь));
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			// Проверим, чтобы не было дублей
			ТаблицаТоваров = Товары.Выгрузить();
			ТаблицаТоваров.Свернуть("Характеристика");
			Если ТаблицаТоваров.Количество() <> Товары.Количество() Тогда
				Отказ = Истина;
				Сообщить("В таблице товаров есть дубли");
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			МассивПродавцов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПродавцов);
			Если МассивПродавцов.Количество() > 1 Тогда
				Отказ = Истина;
				Сообщить("В одном документе могут быть только заказы с одинаковой организацией-продавцом:");
				Для каждого Строка из Товары Цикл
					Сообщить("Строка №" + Строка.НомерСтроки + " - " + Строка.Характеристика.Лико_ЗаказНоменклатуры.Организация);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			МассивПробникНепробник = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПробникНепробник);
			Если МассивПробникНепробник.Количество() > 1 Тогда
				Отказ = Истина;
				Сообщить("В одном документе не могут содержаться заказы-пробники и не пробники:");
				Для каждого Строка из Товары Цикл
					Сообщить("Строка №" + Строка.НомерСтроки + " - " + Строка.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			// Проверим, чтобы по характеристике не было уже закрытых документов Лико_ПолучениеГПИзПроизводства
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Лико_ПолучениеГПИзПроизводстваТовары.Ссылка КАК Ссылка,
				|	Лико_ПолучениеГПИзПроизводстваТовары.Характеристика КАК Характеристика,
				|	ВЫРАЗИТЬ(Лико_ПолучениеГПИзПроизводстваТовары.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура
				|ИЗ
				|	Документ.Лико_ПолучениеГПИзПроизводства.Товары КАК Лико_ПолучениеГПИзПроизводстваТовары
				|ГДЕ
				|	Лико_ПолучениеГПИзПроизводстваТовары.Ссылка.Проведен
				|	И НЕ Лико_ПолучениеГПИзПроизводстваТовары.Ссылка.ПометкаУдаления
				|	И Лико_ПолучениеГПИзПроизводстваТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаявокНаТранспортировку.Закрыт)
				|	И Лико_ПолучениеГПИзПроизводстваТовары.Характеристика В(&МассивХарактеристик)
				|	И Лико_ПолучениеГПИзПроизводстваТовары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|	И Лико_ПолучениеГПИзПроизводстваТовары.Ссылка.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("МассивХарактеристик", Товары.ВыгрузитьКолонку("Характеристика"));
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Отказ = Истина;
				Сообщить("" + ВыборкаДетальныеЗаписи.Номенклатура + " / " + ВыборкаДетальныеЗаписи.Характеристика + " уже содержится в документе " + ВыборкаДетальныеЗаписи.Ссылка);
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Отказ И Состояние = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
	
			Если НЕ ЗначениеЗаполнено(ДатаВыпуска) Тогда
				ДатаВыпуска = ТекущаяДата();
			КонецЕсли;
			
			// Проверим и актуализируем серии
			Для каждого Строка из Товары Цикл

				Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
					Строка.Количество = 1;
				КонецЕсли;

				СерияОбъект = Неопределено;
				Если НЕ ЗначениеЗаполнено(Строка.Серия) Тогда
					// Создаем новую серию
					СерияОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
				ИначеЕсли Строка.Серия.Лико_ХарактеристикаВладелец <> Строка.Характеристика ИЛИ Строка.Серия.Лико_КоличествоВУпаковке <> Строка.Количество Тогда
					СерияОбъект = Строка.Серия.ПолучитьОбъект();
				КонецЕсли;
				Если СерияОбъект <> Неопределено Тогда
					
					СтрокаТЧТовары = Строка.Характеристика.Лико_ЗаказНоменклатуры.Товары.Найти(Строка.Характеристика);
					Если СтрокаТЧТовары = Неопределено Тогда
						Отказ = Истина;
						Возврат;
					КонецЕсли;
					
					СерияОбъект.Лико_ХарактеристикаВладелец = Строка.Характеристика;
					СерияОбъект.Лико_КоличествоВУпаковке = Строка.Количество;
					СерияОбъект.ВидНоменклатуры = СерияОбъект.Лико_ХарактеристикаВладелец.ВидНоменклатуры;
					СерияОбъект.Номер = СтрокаТЧТовары.Характеристика;
					СерияОбъект.Лико_НомерКоробки = Лико_Дополнительно.ПолучитьНомерКоробкиДляНовойСерии(СерияОбъект.Лико_ХарактеристикаВладелец);
					СерияОбъект.Лико_Город = СтрокаТЧТовары.Город;
					СерияОбъект.Лико_Втулка = СтрокаТЧТовары.ВнутреннийДиаметр;
					СерияОбъект.Лико_НаправлениеНамотки = СтрокаТЧТовары.Направление;
					СерияОбъект.Лико_ДатаУпаковки = ДатаВыпуска;
					СерияОбъект.Лико_ВесКоробки = Лико_Дополнительно.РассчитатьВесКоробки(СерияОбъект.Лико_ХарактеристикаВладелец.Владелец, СерияОбъект.Лико_КоличествоВУпаковке, 1, СерияОбъект.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры);
					СерияОбъект.Лико_Упаковщик = Ответственный.ФизическоеЛицо;
					СерияОбъект.Лико_НомерПоставки = СтрокаТЧТовары.NКонтракта;
					СерияОбъект.Лико_КоличествоРоликов = 1;
					СерияОбъект.Лико_КодЭтикеткиЗаказчика = СтрокаТЧТовары.КодЭтикеткиЗаказчика;
					СерияОбъект.Лико_ЧестныйЗнак = СтрокаТЧТовары.ЧестныйЗнак;
					СерияОбъект.Лико_КоличествоКоробок = 1;
					
					Попытка
						СерияОбъект.Записать();
					Исключение
						Сообщить("Не удалось создать/изменить серию """ + СерияОбъект + """! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
						Отказ = Истина;
						Возврат;
					КонецПопытки;
					
					Строка.Серия = СерияОбъект.Ссылка;
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
	КонецЕсли;				
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Состояние = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
		Отказ = НЕ СоздатьТиповыеДокументы();
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТиповыеДокументы() Экспорт
	
	Отказ = Ложь;
	
	НачатьТранзакцию();

	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	
	//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка,, Новый Структура("РазрешеноМенятьЗакрытуюЗаявку,Лико_СозданиеИзПолученияГПИзПроизводства"));
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ОтключитьЧастьПроверок = Неопределено;
	ДополнительныеСвойства.Свойство("ОтключитьЧастьПроверок", ОтключитьЧастьПроверок);
	ОтключитьЧастьПроверок = ?(ОтключитьЧастьПроверок = Неопределено, Ложь, ОтключитьЧастьПроверок);
	
	НовыйДокументЛико_ФормированиеПаллета = СоздатьДокументЛико_ФормированиеПаллета(СтруктураТиповыхДокументов.Лико_ФормированиеПаллета);
	Если НовыйДокументЛико_ФормированиеПаллета = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
	НоваяСтрока.Документ = НовыйДокументЛико_ФормированиеПаллета;
	
	НовыйДокументЛико_ЗаявкаНаТранспортировку = СоздатьДокументЛико_ЗаявкаНаТранспортировку(СтруктураТиповыхДокументов.Лико_ЗаявкаНаТранспортировку, НовыйДокументЛико_ФормированиеПаллета);
	Если НовыйДокументЛико_ЗаявкаНаТранспортировку = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
	НоваяСтрока.Документ = НовыйДокументЛико_ЗаявкаНаТранспортировку;
	
	//Запишем типовые документы в регистр Лико_СвязиСТиповымиДокументами
	Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

Функция СоздатьДокументЛико_ФормированиеПаллета(УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.Лико_ФормированиеПаллета.СоздатьДокумент();
	НовыйДокОбъект.СозданНаОснованииПолученияГПИзПроизводства = Истина;
	НовыйДокОбъект.Дата = ДатаВыпуска;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.АвторДокумента = Ответственный.ФизическоеЛицо;
	НовыйДокОбъект.ДатаФормирования = НовыйДокОбъект.Дата;
	НовыйДокОбъект.Организация = Площадка.Организация;
	Если ЗначениеЗаполнено(УжеСозданныйДокумент) И ЗначениеЗаполнено(УжеСозданныйДокумент.Паллет) Тогда
		НовыйДокОбъект.Паллет = УжеСозданныйДокумент.Паллет;
	Иначе
		НовыйДокОбъект.Паллет = Лико_Дополнительно.СоздатьНовыйПаллет(НовыйДокОбъект.АвторДокумента);
	КонецЕсли;
	НовыйДокОбъект.Подразделение = Справочники.Лико_ПредопределенныеЗначения.ПодразделениеПроизводство.ЗначениеПараметра;
	НовыйДокОбъект.РабочееМесто = ПараметрыСеанса.Лико_РабочееМесто;
	НовыйДокОбъект.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции;
	НовыйДокОбъект.ЯчейкаПолучатель = НайтиЯчейкуУпаковкиПоОрганизации();
	НовыйДокОбъект.Площадка = НовыйДокОбъект.ЯчейкаПолучатель.Владелец.Лико_Площадка;
	
	Для каждого Строка из Товары Цикл
		НоваяСтрока = НовыйДокОбъект.Содержимое.Добавить();
		НоваяСтрока.Серия = Строка.Серия;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	НовыйДокОбъект.ДополнительныеСвойства.Вставить("Лико_НеРассчитыватьНормативныйГрафик", Истина);
	НовыйДокОбъект.ДополнительныеСвойства.Вставить("Лико_СозданиеИзПолученияГПИзПроизводства", Истина);
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция НайтиЯчейкуУпаковкиПоОрганизации()

	// Сначала найдем склад
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Лико_Площадка = &Лико_Площадка
		|	И Склады.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.ГП)
		|	И Склады.Лико_ТипСкладаГотовойПродукции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Производство)
		|	И Склады.ИспользоватьОрдернуюСхемуПриОтгрузке
		|	И НЕ Склады.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Лико_Площадка", Площадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЯчейкаУпаковка = Неопределено;
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		// Теперь найдем ячейку
		ЯчейкаУпаковка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ВыборкаДетальныеЗаписи.Ссылка, "ЯчейкаУпаковка");
	КонецЕсли;
	
	Возврат ЯчейкаУпаковка;

КонецФункции

Функция СоздатьДокументЛико_ЗаявкаНаТранспортировку(УжеСозданныйДокумент = Неопределено, ФормированиеПаллета)

	Отказ = Ложь;

	ЗаказПервойСтроки = Товары[0].Характеристика.Лико_ЗаказНоменклатуры;
	НовыйДокОбъект = Документы.Лико_ЗаявкаНаТранспортировку.СоздатьДокумент();
	НовыйДокОбъект.СозданНаОснованииПолученияГПИзПроизводства = Истина;
	НовыйДокОбъект.Дата = ДатаВыпуска;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Грузоотправитель = ЗаказПервойСтроки.Организация;
	НовыйДокОбъект.СкладГП = ФормированиеПаллета.ЯчейкаПолучатель.Владелец;
	НовыйДокОбъект.Площадка = НовыйДокОбъект.СкладГП.Лико_Площадка;
	НовыйДокОбъект.Организация = Площадка.Организация;
	НовыйДокОбъект.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт;
	Если ЗаказПервойСтроки.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда
		НовыйДокОбъект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца;
		НовыйДокОбъект.АдресДоставки = "Списание пробников";  
		// --> Начало Лико Ефимов ЕВВ 25.02.2025
		Если НовыйДокОбъект.Организация = НовыйДокОбъект.Грузоотправитель Тогда
			// Производитель и продавец совпадают, нужно найти не ордерный склад этой площадки
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Склады.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Склады КАК Склады
				|ГДЕ
				|	НЕ Склады.ПометкаУдаления
				|	И Склады.Лико_Площадка = &Площадка
				|	И Склады.Наименование ПОДОБНО &Наименование
				|	И НЕ Склады.ИспользоватьОрдернуюСхемуПриОтгрузке
				|
				|УПОРЯДОЧИТЬ ПО
				|	Склады.Ссылка";
			
			Запрос.УстановитьПараметр("Наименование", "%не ордерный%");
			Запрос.УстановитьПараметр("Площадка", НовыйДокОбъект.Площадка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				НовыйДокОбъект.СкладРегиона = Выборка.Ссылка;
			Иначе
				Сообщить("Не удалось определить склад региона");
				Возврат Неопределено;
			КонецЕсли;
		Иначе
		// <-- Конец Лико Ефимов ЕВВ 25.02.2025
			НовыйДокОбъект.СкладРегиона = Лико_Дополнительно.НайтиСкладРегиона(ЗаказПервойСтроки.Регион);
		КонецЕсли;
	Иначе
		НовыйДокОбъект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя;
	КонецЕсли;
	НовыйДокОбъект.Контрагент = ЗаказПервойСтроки.Контрагент;

	Для каждого Строка из Товары Цикл
		НоваяСтрока = НовыйДокОбъект.Продукция.Добавить();
		НоваяСтрока.Серия = Строка.Серия;
		НоваяСтрока.Характеристика = НоваяСтрока.Серия.Лико_ХарактеристикаВладелец;
		НоваяСтрока.ЗаказКлиента = НоваяСтрока.Характеристика.Лико_ЗаказНоменклатуры;
		НоваяСтрока.Номенклатура = НоваяСтрока.Характеристика.Владелец;
		НоваяСтрока.Мест = 1;
		НоваяСтрока.Количество = НоваяСтрока.Серия.Лико_КоличествоВУпаковке;
		НоваяСтрока.Втулка = НоваяСтрока.Серия.Лико_Втулка;
		НоваяСтрока.Намотка = НоваяСтрока.Серия.Лико_НаправлениеНамотки;
		НоваяСтрока.Город = НоваяСтрока.Серия.Лико_Город;
		НоваяСтрока.Контрагент = НоваяСтрока.ЗаказКлиента.Контрагент;
		НоваяСтрока.КодЭтикеткиЗаказчика = НоваяСтрока.Серия.Лико_КодЭтикеткиЗаказчика;
		НоваяСтрока.ЧестныйЗнак = НоваяСтрока.Серия.Лико_ЧестныйЗнак;
		НоваяСтрока.НомерПоставки = НоваяСтрока.Серия.Лико_НомерПоставки;
	КонецЦикла;

	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;

	НовыйДокОбъект.ДополнительныеСвойства.Вставить("РазрешеноМенятьЗакрытуюЗаявку", Истина);
	НовыйДокОбъект.ДополнительныеСвойства.Вставить("Лико_СозданиеИзПолученияГПИзПроизводства", Истина);

	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  

	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;

КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НачатьТранзакцию();
	//Пометим на удаление связанные типовые документы
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка,, Новый Структура("РазрешеноМенятьЗакрытуюЗаявку,Лико_СозданиеИзПолученияГПИзПроизводства"));
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	
КонецПроцедуры

КлючиСтруктуры =	"Лико_ЗаявкаНаТранспортировку,
					|Лико_ФормированиеПаллета";
ОтключитьЧастьПроверок = Ложь;
