
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Обработка = ПолучитьВнешнююОбработку("Печатная форма ""Приложение к внутреннему бланку заказа""");
	Если Обработка <> Неопределено Тогда 
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
		//--> Маковеева А.Ю. 31.05.2018
		ПараметрыДляПередачи = Новый Структура("ПечатьЧекЛиста", Ложь);
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыДляПередачи);
		//<-- Маковеева А.Ю. 31.05.2018
	КонецЕсли;	

КонецПроцедуры



&НаСервере
Функция ПолучитьВнешнююОбработку(Наименование)
	
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование);

	Если НЕ ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда
		Сообщить("Не Печатная форма ""Приложение к внутреннему бланку заказа""");
		Возврат Неопределено;
	КонецЕсли;
	Возврат ДополнительнаяОбработка;	
КонецФункции

