
&НаКлиенте
Процедура Добавить(Команда)
	
	ЗаполнениеНоменклатура = Неопределено;
	ПараметрыОткрытия = Новый Структура();
	Если Список.Отбор.Элементы.Количество() <> 0 Тогда
		Для каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
			Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
				ЗаполнениеНоменклатура = ЭлементОтбора.ПравоеЗначение;
				ПараметрыОткрытия.Вставить("Номенклатура",ЗаполнениеНоменклатура);
				ПараметрыОткрытия.Вставить("ВидСекции",ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая"));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.Лико_ПантоныНоменклатуры.Форма.ФормаЗаписи",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры
