#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторПлатежа   = Неопределено;
	НазначениеПлатежа = Неопределено;
	Договор = Неопределено;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	МассивРеквизитов = Новый Массив;
	
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(ЭтотОбъект, МассивРеквизитов, Новый Массив);
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(ЭтотОбъект);
	
	// --> Начало Лико Ефимов ЕВВ
	МассивПартнеров = Новый Массив;
	Для каждого Строка из Товары Цикл
		Если Строка.Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать И НЕ ЗначениеЗаполнено(Строка.Характеристика) Тогда
			Отказ = Истина;
			Сообщить("В строке №" + Строка.НомерСтроки + " не заполнена характеристика.");
		ИначеЕсли Строка.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток И Строка.Номенклатура <> Строка.Характеристика.Владелец Тогда
			Отказ = Истина;
			Сообщить("В строке №" + Строка.НомерСтроки + " выбрана характеристика другой номенклатуры.");
		КонецЕсли;
		ТекПартнер = Строка.Характеристика.Лико_ЗаказНоменклатуры.Партнер;
		Если ЗначениеЗаполнено(ТекПартнер) Тогда
			МассивПартнеров.Добавить(ТекПартнер);
		КонецЕсли;
	КонецЦикла;

	МассивПартнеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПартнеров);
	Если МассивПартнеров.Количество() > 1 И НЕ ДополнительныеСвойства.Свойство("Лико_ПрограммноеСоздание") Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Различаются партнеры в заказах:";
		Для каждого Строка из Товары Цикл
			ТекПартнер = Строка.Характеристика.Лико_ЗаказНоменклатуры.Партнер;
			Если ЗначениеЗаполнено(ТекПартнер) Тогда
				Сообщение.Текст = Сообщение.Текст + Символы.ПС + "	Строка № " + Строка.НомерСтроки + " - " + ТекПартнер;
			КонецЕсли;
		КонецЦикла;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Партнер) И МассивПартнеров.Количество() = 1 Тогда
		ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Контрагент.Партнер, "ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа_fca67e4d4a11435ca3926adb18a18d38", Ложь);
		Если Партнер <> ?(ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа, Контрагент.Партнер, МассивПартнеров[0])		
			Тогда
			Отказ = Истина;
			Сообщить("Партнер в документе отличается от партнера в " + ?(ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа, "контрагенте", "заказе"));
		КонецЕсли;
	КонецЕсли;
	
	Если Партнер <> Договор.Партнер Тогда
		Отказ = Истина;
		Сообщить("Партнер в документе отличается от партнера в договоре");
	КонецЕсли;
	
	Если Контрагент <> Договор.Контрагент Тогда
		Отказ = Истина;
		Сообщить("Контрагент в документе отличается от контрагента в договоре");
	КонецЕсли;
	
	Если Валюта <> Договор.ВалютаВзаиморасчетов Тогда
		Отказ = Истина;
		Сообщить("Валюта в документе отличается от валюты в договоре");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Договор.Номер) Тогда
		Отказ = Истина;
		Сообщить("В выбранном договоре не заполнен номер. Попробуйте воспользоваться кнопкой ""Создать договор""");
	КонецЕсли;
	СуммаДокумента = Товары.Итог("СуммаСНДС");

	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.СтавкаНДС) И ЗначениеЗаполнено(Строка.УдалитьСтавкаНДС) Тогда
			Строка.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Строка.УдалитьСтавкаНДС);
			Строка.УдалитьСтавкаНДС = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Если Контрагент <> Договор.Контрагент Тогда
		Отказ = Истина;
		Сообщить("Контрагент в документе и в договоре различается");
	КонецЕсли;
	
	Если Партнер <> Договор.Партнер Тогда
		Отказ = Истина;
		Сообщить("Партнер в документе и в договоре различается");
	КонецЕсли;

	ДополнительныеСвойства.Вставить("МассивЗаказовПередЗаписью", СформироватьМассивЗаказовВИзТабличнойЧасти(Истина));
	// <-- Конец Лико Ефимов ЕВВ 
	
	// <-- Начало Лико Яцун С. В. 27.06.2024 
	Если НЕ ЗначениеЗаполнено(Ссылка) И НЕ ЗначениеЗаполнено(НазначениеПлатежа) Тогда 
		НазначениеПлатежа = ЗаполнитьНазначениеПлатежа();	
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 27.06.2024
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Организация    = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или НЕ ДанныеЗаполнения.Свойство("Валюта") Тогда
		Валюта = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Валюта);
	КонецЕсли;
	Менеджер       = Пользователи.ТекущийПользователь();
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    		= Организация;
	СтруктураПараметров.БанковскийСчет		= БанковскийСчет;
	БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НайденныйРеквизит = ПроверяемыеРеквизиты.Найти("Товары.Характеристика");
	Если НайденныйРеквизит <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(НайденныйРеквизит);
	КонецЕсли;

	// --> Начало Лико Ефимов ЕВВ 18.04.2022
	ПроверяемыйРеквизитТоварыСтавкаНДС = ПроверяемыеРеквизиты.Найти("Товары.СтавкаНДС");
	Если ПроверяемыйРеквизитТоварыСтавкаНДС <> Неопределено И Товары.Количество() > 0 И ЗначениеЗаполнено(Товары[0].УдалитьСтавкаНДС) И НЕ ЗначениеЗаполнено(Товары[0].СтавкаНДС) Тогда
		// Это старый документ (на релизе 2.4), не будем проверять ставку, т.к. она перезаполнится перед записью
		ПроверяемыеРеквизиты.Удалить(ПроверяемыйРеквизитТоварыСтавкаНДС);
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 18.04.2022
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

Процедура ОбработкаПроведения(Отказ, РежимПроведения) // --> Начало Лико Ефимов ЕВВ 10.03.2022
	
	ЗапуститьЗаполнениеСчетаНаПредоплатуВЗаказах(Истина);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 10.03.2022

Процедура ОбработкаУдаленияПроведения(Отказ) // --> Начало Лико Ефимов ЕВВ 10.03.2022
	
	ЗапуститьЗаполнениеСчетаНаПредоплатуВЗаказах(Ложь);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 10.03.2022

Функция СформироватьМассивЗаказовВИзТабличнойЧасти(ИзСсылки = Ложь) // --> Начало Лико Ефимов ЕВВ 10.03.2022
	
	МассивЗаказов = Новый Массив;
	Для каждого Строка из ?(ИзСсылки, Ссылка.Товары, Товары) Цикл
		МассивЗаказов.Добавить(Строка.Характеристика.Лико_ЗаказНоменклатуры);
	КонецЦикла;
	МассивЗаказов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗаказов);
	Возврат МассивЗаказов;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 10.03.2022

Процедура ЗапуститьЗаполнениеСчетаНаПредоплатуВЗаказах(Проведение) // --> Начало Лико Ефимов ЕВВ 10.03.2022
	
    МассивЗаказовВЗаписи = СформироватьМассивЗаказовВИзТабличнойЧасти();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗаказовПередЗаписью, МассивЗаказовВЗаписи, Истина);
	// --> Начало Лико Ефимов ЕВВ 08.06.2023 решили отключить, чтобы не было проблем с "Данные были изменены или удалены" при открытых заказах
	//Документы.Лико_СчетНаОплатуКлиенту.ЗаполнитьСчетНаПредоплатуВЗаказах(ДополнительныеСвойства.МассивЗаказовПередЗаписью, ?(Проведение И Проведен, МассивЗаказовВЗаписи, Неопределено), Ссылка);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 10.03.2022

Функция ЗаполнитьНазначениеПлатежа() Экспорт // <-- Начало Лико Яцун С. В. 27.06.2024
		
	Если НЕ ПустаяСтрока(ДокументОснование) Тогда
		ЗначениеНазначениеПлатежа = Документы.Лико_СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
			ДокументОснование.Номер,
			ДокументОснование); 
		Возврат ЗначениеНазначениеПлатежа;
	Иначе
		ЗначениеНазначениеПлатежа = НСтр("ru='По счету № %НомерСчета% от %ДатаСчета%'");
		ЗначениеНазначениеПлатежа = СтрЗаменить(ЗначениеНазначениеПлатежа, 
			"%НомерСчета%",
		// --> Начало Лико Ефимов ЕВВ 24.01.2018
		//ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер));
		Договор.Номер);
		// <-- Конец Лико Ефимов ЕВВ 24.01.2018
		// --> Начало Лико Ефимов ЕВВ 29.10.2018
		Если ЗначениеЗаполнено(Договор.Лико_СсылкаНаРеальныйДоговор) Тогда
			ЗначениеНазначениеПлатежа = ЗначениеНазначениеПлатежа + ", " + Договор.Лико_СсылкаНаРеальныйДоговор.Наименование;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 29.10.2018
		ЗначениеНазначениеПлатежа = СтрЗаменить(ЗначениеНазначениеПлатежа, "%ДатаСчета%", Формат(Дата, "ДЛФ=D"));
		Возврат ЗначениеНазначениеПлатежа;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Яцун С. В. 27.06.2024
