
Перем КлючиСтруктуры;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Отказ = ПроверкаОтбора();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр Лико_АдресноеХранение
	Движения.Лико_АдресноеХранение.Записывать = Истина;
	Для Каждого ТекСтрокаСодержимое Из Содержимое Цикл
		Движение = Движения.Лико_АдресноеХранение.Добавить();
		Движение.Период = Дата;
		Движение.Серия = ТекСтрокаСодержимое.Серия;
		Движение.Склад = ТекСтрокаСодержимое.Ячейка.Владелец;
		Движение.Ячейка = ТекСтрокаСодержимое.Ячейка;
		Движение.Паллет = ТекСтрокаСодержимое.Паллет;
	КонецЦикла;
	
	Если НЕ ПровестиТолькоПоАдресномуХранению Тогда
		Отказ = НЕ СоздатьТиповыеДокументы();
	КонецЕсли;

КонецПроцедуры

Функция СоздатьТиповыеДокументы() Экспорт
	
	Отказ = Ложь;	
	НачатьТранзакцию();
	
	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Заказ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	
	//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	НовыйДокументПересчетТоваров = СоздатьДокументПересчетТоваров(СтруктураТиповыхДокументов.ПересчетТоваров);
	Если НовыйДокументПересчетТоваров = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
	НоваяСтрока.Документ = НовыйДокументПересчетТоваров;
	
	//Запишем типовые документы в регистр Лико_СвязиСТиповымиДокументами
	Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

Функция СоздатьДокументПересчетТоваров(УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ПересчетТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Склад = Склад;
	НовыйДокОбъект.Статус = Перечисления.СтатусыПересчетовТоваров.Подготовлено;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	
	ЗаполнитьУчетныеДанныеПересчета(НовыйДокОбъект);
	
	ТаблицаТовары = НовыйДокОбъект.Товары.Выгрузить();
	//ПредыдущийВид = Неопределено;
	//ПредыдущаяУпаковка = Неопределено;
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Для каждого Строка из Содержимое Цикл
		НоваяСтрока = ТаблицаТовары.Добавить();
		НоваяСтрока.Количество = Строка.Серия.Лико_КоличествоВУпаковке;
		НоваяСтрока.КоличествоФакт = НоваяСтрока.Количество;
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		НоваяСтрока.КоличествоУпаковокФакт = НоваяСтрока.Количество;
		НоваяСтрока.Номенклатура = Строка.Серия.Лико_ХарактеристикаВладелец.Владелец;
		//Если ПредыдущийВид = НоваяСтрока.Номенклатура.ВидНоменклатуры Тогда
		//	НоваяСтрока.Упаковка = ПредыдущаяУпаковка;
		//Иначе
		//	НоваяСтрока.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(НоваяСтрока.Номенклатура.ВидНоменклатуры);
		//КонецЕсли;
		НоваяСтрока.Упаковка = УпаковкаТысШт;
		НоваяСтрока.Характеристика = Строка.Серия.Лико_ХарактеристикаВладелец;
		НоваяСтрока.Ячейка = Строка.Ячейка;
		НоваяСтрока.Серия = Строка.Серия;
		НоваяСтрока.СтатусУказанияСерий = 8;
		
		//ПредыдущийВид = НоваяСтрока.Номенклатура.ВидНоменклатуры;
		//ПредыдущаяУпаковка = НоваяСтрока.Упаковка;
	КонецЦикла;
	ТаблицаТовары.Свернуть("Номенклатура,Упаковка,Характеристика,Назначение,Ячейка,ИзлишекПорча,Серия,СтатусУказанияСерий","Количество,КоличествоФакт,КоличествоУпаковок,КоличествоУпаковокФакт");
	НовыйДокОбъект.Товары.Загрузить(ТаблицаТовары);
	
	НовыйДокОбъект.ОтборПересчета = Новый ХранилищеЗначения(ОтборПересчета.Получить(), Новый СжатиеДанных(9));
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		//чтобы отработали проверки, документ нужно провести во всех статусах
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		НовыйДокОбъект.Статус = Перечисления.СтатусыПересчетовТоваров.ВРаботе;
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		НовыйДокОбъект.Статус = Перечисления.СтатусыПересчетовТоваров.ВнесениеРезультатов;
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//НовыйДокОбъект.Статус = Перечисления.СтатусыПересчетовТоваров.Выполнено;
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьУчетныеДанныеПересчета(Объект)
	
	//за основу взята процедура "ЗаполнитьСервер" из формы документа "Пересчет товаров"
	
	ИспользоватьАдресноеХранение = Истина;
	ОтборПересчетаСКД = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИнициализироватьКомпоновкуДанных(Ложь,Объект,ОтборПересчетаСКД,ИспользоватьАдресноеХранение);
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ПересчетТоваров));
	
	УстановитьЗначениеПараметраНастроек(ОтборПересчетаСКД.Настройки, "ДатаОстатков", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
	
	Если ИспользоватьАдресноеХранение Тогда
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоЯчейкам");
	Иначе	
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоСкладу");
	КонецЕсли;
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ТоварыВЯчейках.Упаковка", Неопределено));
	СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос = ТекстЗапроса;

	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(ОтборПересчетаСКД);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборПересчетаСКД.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Объект.Товары.Загрузить(ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных));
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НачатьТранзакцию();
	//Пометим на удаление связанные типовые документы
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию,Объект,ОтборПересчетаСКД,ИспользоватьАдресноеХранение)
	
	Если ИспользоватьАдресноеХранение Тогда
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоЯчейкам");
	Иначе
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоСкладу");
	КонецЕсли;
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПересчетаСКД.Инициализировать(ИсточникНастроек);
	
	ТекНастройки = ОтборПересчета.Получить();
	Если ТекНастройки = Неопределено
		Или ВсегдаИспользоватьНастройкиПоУмолчанию Тогда
		ОтборПересчетаСКД.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПересчетаСКД.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПересчетаСКД.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	УстановитьЗначениеПараметраНастроек(ОтборПересчетаСКД.Настройки, "Склад" , Объект.Склад);
	
КонецПроцедуры

Функция ПроверкаОтбора()
	
	Отказ = Ложь;
	
	СКД = ПолучитьМакет("СкдПроверкаЯчеек");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, ОтборПересчета.Получить(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ТЗ.Количество() = 0 Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("По установленному отбору не найдено ни одной ячейки!");
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;
		
	Для каждого Строка из Содержимое Цикл
		Если ТЗ.Найти(Строка.Ячейка, "Ячейка") = Неопределено Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Строка №" + Строка.НомерСтроки + ": ячейка """ + Строка.Ячейка + """ не соответствует установленному отбору!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
		Сообщить("Данный документ запрещено проводить");
	КОнецЕсли;
	
КонецПроцедуры

КлючиСтруктуры =	"ПересчетТоваров";
