#Область Прочее

// Получает имя дополнительного реквизита на форме, который сформировался "автоматически" типовым кодом, в виде строки из уникальных идентификаторов
//
// Параметры:
//  ИмяПредопределенногоЗначения - Строка - имя элемента предопределенных данных справочника "ЛикоПредопределенныеЗначения", в котором хранится ссылка на доп. ревизит
//  ЛеваяЧастьИмени - Строка - левая часть имени элемента.
//
//  Возвращаемое значение:
//      Строка - имя дополнительного реквизита на форме, к которому в дальнейшем можно обращаться через "Элементы[Имя]"
//
Функция ПолучитьИмяДопРеквизита(ИмяПредопределенногоЗначения, ЛеваяЧастьИмени) Экспорт // --> Начало Лико Ефимов ЕВВ 22.03.2017 9:39:30 

	
	ДопРеквизит = Справочники.Лико_ПредопределенныеЗначения[ИмяПредопределенногоЗначения].ЗначениеПараметра;
	ИмяРеквизита = ЛеваяЧастьИмени + "_" +
	СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(
	"-", 
	ВРег("" + ДопРеквизит.НаборСвойств.УникальныйИдентификатор() + "_" + ДопРеквизит.УникальныйИдентификатор()),
	"x");
	Возврат ИмяРеквизита;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 22.03.2017 9:39:34 

// Рассчитывает вес коробки по формуле, использую площадь, введенную в номенклатуру
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - элемент номенклатуры, для коробки которой рассчитывается вес.
//  КоличествоВУпаковке - Число - количество единиц в упаковке.
//  КоробокВКомплекте - Число - используется в случае, когда в одной коробке находится несколько разных изделий.
//
//  Возвращаемое значение:
//      Число - вес коробки
//
Функция РассчитатьВесКоробки(Номенклатура, КоличествоВУпаковке, КоробокВКомплекте = 1, Заказ) Экспорт // --> Начало Лико Ефимов ЕВВ 29.03.2017 
	
	Если КоробокВКомплекте = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Для правильного расчета веса необходимо заполнить номенклатуру.");
	КонецЕсли;	
	Площадь = Номенклатура.ПлощадьЧислитель / ?(Номенклатура.ПлощадьЗнаменатель = 0, 1, Номенклатура.ПлощадьЗнаменатель);
	
	Плотность = Справочники.Лико_ПредопределенныеЗначения.ПлотностьДляРасчетаВеса.ЗначениеПараметра;
	Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
		Плотность = 65;
	ИначеЕсли Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка Тогда
		Плотность = 350;
	Иначе
		Плотность = 120;
	КонецЕсли;
	
	ОсновнойМатериал = Заказ.ОсновнойМатериал;
	Если ТипЗнч(ОсновнойМатериал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
		ОсновнойМатериалНом = ОсновнойМатериал.ОсновнаяНоменклатура;
		ПлотностьИзНоменклатуры = 0;
		Попытка
			ПлотностьИзНоменклатуры = ОсновнойМатериалНом.ВесЕдиницаИзмерения.Числитель / ОсновнойМатериалНом.ВесЕдиницаИзмерения.Знаменатель * 1000 * ОсновнойМатериалНом.ВесЧислитель / ОсновнойМатериалНом.ВесЗнаменатель;
		Исключение
		КонецПопытки;
		Если ПлотностьИзНоменклатуры > 0 И ПлотностьИзНоменклатуры < 1000 Тогда
			Плотность = ПлотностьИзНоменклатуры;
		Иначе
			ПлотностьИзЦГ = ОсновнойМатериал.Лико_УдельныйВес;
			Если ЗначениеЗаполнено(ПлотностьИзЦГ) Тогда
				Плотность = ПлотностьИзЦГ;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") И НЕ ОсновнойМатериал.ВидНоменклатуры.Лико_НоменклатураЭтикеток Тогда
		ПлотностьИзНоменклатуры = 0;
		Попытка
			ПлотностьИзНоменклатуры = ОсновнойМатериал.ВесЕдиницаИзмерения.Числитель / ОсновнойМатериал.ВесЕдиницаИзмерения.Знаменатель * 1000 * ОсновнойМатериал.ВесЧислитель / ОсновнойМатериал.ВесЗнаменатель;
			Если ПлотностьИзНоменклатуры > 0 И ПлотностьИзНоменклатуры < 1000 Тогда
				Плотность = ПлотностьИзНоменклатуры;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Если ПлотностьИзНоменклатуры = 0 Тогда
			ПлотностьИзЦГ = ОсновнойМатериал.ЦеноваяГруппа.Лико_УдельныйВес;
			Если ЗначениеЗаполнено(ПлотностьИзЦГ) Тогда
				Плотность = ПлотностьИзЦГ;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	//Если ЗначениеЗаполнено(ОсновнойМатериал) И НЕ ОсновнойМатериал.ВидНоменклатуры.Лико_НоменклатураЭтикеток Тогда
	//	Попытка
	//		ПлотностьИзНоменклатуры = ОсновнойМатериал.ВесЕдиницаИзмерения.Числитель / ОсновнойМатериал.ВесЕдиницаИзмерения.Знаменатель * 1000 * ОсновнойМатериал.ВесЧислитель / ОсновнойМатериал.ВесЗнаменатель;
	//		Если ПлотностьИзНоменклатуры > 0 И ПлотностьИзНоменклатуры < 1000 Тогда
	//			Плотность = ПлотностьИзНоменклатуры;
	//		КонецЕсли;
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	//формулу взял из УПП
	Коэффициент = Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / ?(Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель = 0, 1, Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель);
	Если Коэффициент = 0 Тогда
		Сообщить("У номенклатуры """ + Номенклатура + """ (" + Номенклатура.Код + ") не заполнена площадь");
		Возврат 0;
	КонецЕсли;
	
	Вес = Окр(Площадь / Коэффициент * Плотность * КоличествоВУпаковке / 1000 + 1/КоробокВКомплекте, 1);
	
	Возврат Вес;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 29.03.2017 

// Получает значение дополнительного реквизита элемента
//
// Параметры:
//  ИмяДопРеквизитаВСправочникеПредопределенных - Строка - имя элемента предопределенных данных справочника "ЛикоПредопределенныеЗначения", в котором хранится ссылка на доп. ревизит
//  СсылкаНаЭлемент - Ссылка - ссылка на элемент, у которого нужно искать доп. реквзит.
//
//  Возвращаемое значение:
//      ПроизвольноеЗначение, Неопределено - значение дополнительного реквизита. Неопределено, если доп реквизит не найден или не заполне
//
Функция ПолучитьЗначениеДопРеквизитаЭлемента(ИмяДопРеквизитаВСправочникеПредопределенных = "", СсылкаНаЭлемент, УникальноеИмяДопРеквизитаДляРазрабочиков = "", ЗначениеПоУмолчанию = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 05.04.2017
	
	Попытка
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("Строка") Тогда
			СсылкаНаЭлемент = ПолучитьЗначениеПредопределенныхДанных(СсылкаНаЭлемент);
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяДопРеквизитаВСправочникеПредопределенных) Тогда
			ДопРеквизит = Справочники.Лико_ПредопределенныеЗначения[ИмяДопРеквизитаВСправочникеПредопределенных].ЗначениеПараметра;
		ИначеЕсли ЗначениеЗаполнено(УникальноеИмяДопРеквизитаДляРазрабочиков) Тогда
			ДопРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", УникальноеИмяДопРеквизитаДляРазрабочиков);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДопРеквизит) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕслИ;
		
		ИмяОбъекта = СсылкаНаЭлемент.Метаданные().ПолноеИмя();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Значение
		|ИЗ
		|	" + ИмяОбъекта + ".ДополнительныеРеквизиты КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка
		|	И Т.Свойство = &Свойство";
		
		Запрос.УстановитьПараметр("Свойство", ДопРеквизит);
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаЭлемент);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Значение;
		Иначе
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
	Исключение
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 05.04.2017 

// Находит последний документ по номеру из 7 символов (правых). Тип документа задается. 
//
// Параметры:
//  НомерДокумента - Строка - номер документа из 7 символов.
//  ТипДокумента - Строка - название документа, по умолчанию "ЗаказНаПроизводство2_2".
//
//  Возвращаемое значение:
//      ДокументСсылка, Неопределено - Ссылка на документ или неопределено, если документ не найден.
//
Функция НайтиДокументПоНомеру7Символов(Знач НомерДокумента, ТипДокумента = "ЗаказНаПроизводство2_2") Экспорт // --> Начало Лико Ефимов ЕВВ 05.04.2017
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(НомерДокумента) = Тип("Число") Тогда
		НомерДокумента = Формат(НомерДокумента, "ЧЦ=7; ЧВН=; ЧГ=0");
	КонецЕсли;
	НомерДокумента = СокрЛП(НомерДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка,
	|	Т.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2 КАК Т
	|ГДЕ
	|	ПОДСТРОКА(Т.Номер, 5, 7) = &НомерЗаказа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("НомерЗаказа", НомерДокумента);
	Если ТипДокумента <> "ЗаказНаПроизводство2_2" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказНаПроизводство2_2", ТипДокумента);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 05.04.2017

// Находит первую по порядку обхода зону приемки склада. 
//
// Параметры:
//  Склад - СправочникСсылка.Склады - склад, для которого происходит поиск зоны приемки.
//
//  Возвращаемое значение:
//      СправочникСсылка.СкладскиеЯчейки, Неопределено - Ссылка на складскую яччейку или неопределено, если для склада не найдена ни одна зона приемки.
//
Функция ПолучитьЗонуПриемкиПоСкладу(Склад) Экспорт // --> Начало Лико Ефимов ЕВВ 11.04.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкладскиеЯчейки.Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Владелец = &Склад
	|	И НЕ СкладскиеЯчейки.ПометкаУдаления
	|	И СкладскиеЯчейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Приемка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладскиеЯчейки.ПорядокОбхода";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 11.04.2017

// Находит первую по порядку обхода зону отгрузки склада. 
//
// Параметры:
//  Склад - СправочникСсылка.Склады - склад, для которого происходит поиск зоны отгрузки.
//
//  Возвращаемое значение:
//     СправочникСсылка.СкладскиеЯчейки, Неопределено - Ссылка на складскую ячейку или неопределено, если для склада не найдена ни одна зона отгрузки.
//
Функция ПолучитьЗонуОтгрузкиПоСкладу(Склад) Экспорт // --> Начало Лико Ефимов ЕВВ 18.04.2017 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкладскиеЯчейки.Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Владелец = &Склад
	|	И СкладскиеЯчейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Отгрузка)
	|	И НЕ СкладскиеЯчейки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладскиеЯчейки.ПорядокОбхода";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 18.04.2017 

// Получает значение предопределенных данных. Использую ее, когда нужно получить значение предопределенных данных на клиенте. 
//
// Параметры:
//  ИмяПредопределенныхДанных - Строка - ровно такая же строка, которую бы писали для получения значения на сервере.
//  Объект - ПроизвольноеЗначение - Объект, из которого будут получать данные. Например, если ИмяПредопределенныхДанных = "Результат.АдресаХранения.Владелец", то системе необходим объект Результат.
//  ИмяОбъекта - Строка - Имя объекта. Для примера выше именем объекта будет строка "Результат".
//
//  Возвращаемое значение:
//      ПроизвольноеЗначение, Неопределено - Значение предопределенных данных. Неопрделено, если не удалось получить значение
//
Функция ПолучитьЗначениеПредопределенныхДанных(ИмяПредопределенныхДанных, Объект = Неопределено, ИмяОбъекта = "") Экспорт // --> Начало Лико Ефимов ЕВВ 17.04.2017
	Попытка
		Значение = Неопределено;
		Если ИмяОбъекта <> "" И Объект <> Неопределено Тогда
			Выполнить("" + ИмяОбъекта + " = Объект;
			|Значение = " + ИмяПредопределенныхДанных);
		Иначе
			Выполнить("Значение = " + ИмяПредопределенныхДанных);
		КонецЕсли;
		Возврат Значение;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции // <-- Конец Лико Ефимов ЕВВ 17.04.2017 

Функция ПолучитьЗначенияРеквизитовСсылки(СсылкаМассивСсылок, СтрокаРеквизитов) Экспорт
	
	Попытка
		МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаРеквизитов, ",");
		МассивСтруктур = Новый Массив;
		ПереданМассив = ТипЗнч(СсылкаМассивСсылок) = Тип("Массив");
		Если ПереданМассив Тогда
			МассивСсылок = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(СсылкаМассивСсылок);
		Иначе
			МассивСсылок = Новый Массив;
			МассивСсылок.Добавить(СсылкаМассивСсылок);
		КонецЕсли;
		
		Для каждого Ссылка из МассивСсылок Цикл
			СтруктураРеквизитов = Новый Структура;
			Для каждого ИмяРеквизита из МассивРеквизитов Цикл
				СтруктураРеквизитов.Вставить(ИмяРеквизита, Ссылка[ИмяРеквизита]);
			КонецЦикла;
			СтруктураРеквизитов.Вставить("Ссылка", Ссылка);
			МассивСтруктур.Добавить(СтруктураРеквизитов);
		КонецЦикла;
		
		Если ПереданМассив Тогда
			Возврат МассивСтруктур;
		Иначе
			Возврат МассивСтруктур[0];
		КонецЕсли;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Получает упаковку для вида номенклатуры с наибольшим кодом. 
//
// Параметры:
//  ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры - вид номенклатуры, для которого получаем упаковку.
//
//  Возвращаемое значение:
//     СправочникСсылка.УпаковкиЕдиницыИзмерения, Неопределено - Ссылка на упаковку или неопределено, если упаковка не найдена.
//
//Функция ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(ВидНоменклатуры) Экспорт // --> Начало Лико Ефимов ЕВВ 17.04.2017

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
//	|ГДЕ
//	|	УпаковкиЕдиницыИзмерения.Владелец = &НаборУпаковок
//	|	И НЕ УпаковкиЕдиницыИзмерения.ПометкаУдаления
//	|	И НЕ УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО ""%рул%""
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	УпаковкиЕдиницыИзмерения.Код УБЫВ";

//	Запрос.УстановитьПараметр("НаборУпаковок", ВидНоменклатуры.НаборУпаковок);

//	РезультатЗапроса = Запрос.Выполнить();

//	Выборка = РезультатЗапроса.Выбрать();

//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Ссылка;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции // <-- Конец Лико Ефимов ЕВВ 17.04.2017

Функция УстановитьПараметрСеансаЛико_РабочееМесто(ИмяПараметра, УстановленныеПараметры, ИмяКомпьютера = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 31.08.2017
	
	Если ИмяПараметра = "Лико_РабочееМесто" Тогда
		
		Лико_РабочееМесто = Неопределено;
		Если ИмяКомпьютера = Неопределено Тогда
			ИмяКомпьютера = ИмяКомпьютера();
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_РабочиеМеста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лико_РабочиеМеста КАК Лико_РабочиеМеста
		|ГДЕ
		|	НЕ Лико_РабочиеМеста.ПометкаУдаления
		|	И Лико_РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера
		|	И Лико_РабочиеМеста.Пользователь = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Лико_РабочиеМеста.Ссылка
		|ИЗ
		|	Справочник.Лико_РабочиеМеста КАК Лико_РабочиеМеста
		|ГДЕ
		|	НЕ Лико_РабочиеМеста.ПометкаУдаления
		|	И Лико_РабочиеМеста.ИмяКомпьютера = """"
		|	И Лико_РабочиеМеста.Пользователь = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Лико_РабочиеМеста.Ссылка
		|ИЗ
		|	Справочник.Лико_РабочиеМеста КАК Лико_РабочиеМеста
		|ГДЕ
		|	НЕ Лико_РабочиеМеста.ПометкаУдаления
		|	И Лико_РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера
		|	И Лико_РабочиеМеста.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Лико_РабочееМесто = Выборка.Ссылка;
		Иначе
			Лико_РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента.Лико_РабочееМесто;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыСеанса.Лико_РабочееМесто = Лико_РабочееМесто;
		ОбновитьПовторноИспользуемыеЗначения();
		
		Если ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить("Лико_РабочееМесто");
		Иначе
			УстановленныеПараметры.Добавить("Лико_РабочееМесто");
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 31.08.2017

Функция НайтиРасположениеСерии(Серия) Экспорт // --> Начало Лико Ефимов ЕВВ 03.10.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия = &Серия) КАК ТоварыВЯчейкахОстатки";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 03.10.2017

Функция НайтиЛицоСПравомПодписи(Организация, ОтветственноеЛицо, ФизическоеЛицо, Дата = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 23.10.2017
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтветственныеЛицаОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	НЕ ОтветственныеЛицаОрганизаций.ПометкаУдаления
	|	И ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
	|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо
	|	И ОтветственныеЛицаОрганизаций.ДатаНачала <= &Дата
	|	И ВЫБОР
	|			КОГДА ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтветственныеЛицаОрганизаций.ДатаОкончания >= &Дата
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтветственныеЛицаОрганизаций.ДатаОкончания УБЫВ,
	|	ОтветственныеЛицаОрганизаций.ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 23.10.2017

Функция НайтиДолжностьФизЛица(ФизЛицо, Организация, Дата = Неопределено, НеПроверятьБезОрганизации = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 23.10.2017

	УстановитьПривилегированныйРежим(Истина);
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДляПодбораСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеДляПодбораСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДляПодбораСотрудников.ДолжностьПоШтатномуРасписанию.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	|ГДЕ
	|	ДанныеДляПодбораСотрудников.ФизическоеЛицо = &ФизическоеЛицо
	|	И ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДанныеДляПодбораСотрудников.Организация = &Организация
	|		КОНЕЦ
	|	И ДанныеДляПодбораСотрудников.Начало <= &Дата
	|	И ДанныеДляПодбораСотрудников.Окончание >= &Дата
	|	И ДанныеДляПодбораСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДляПодбораСотрудников.Начало УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Должность) Тогда
		Возврат Выборка.Должность;
	ИначеЕсли НеПроверятьБезОрганизации = Ложь Тогда
		// Попробуем найти без организации 
		Запрос.УстановитьПараметр("Организация", Неопределено);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Должность) Тогда
			Возврат Выборка.Должность;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 23.10.2017

Функция СформироватьОснованиеРеализацииПоДоговору(Договор, Дата, БезСчета = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 26.10.2017
	
	СтруктураОснования = Новый Структура("ТекстОснования,Номер,Дата");
	РеальныйДоговор = Неопределено;
	
	Если ЗначениеЗаполнено(Договор.Лико_СсылкаНаРеальныйДоговор) Тогда
		РеальныйДоговор = Договор.Лико_СсылкаНаРеальныйДоговор;
	Иначе
		// Попробуем найти реальный договор по периоду действия
		РеальныйДоговор = НайтиРеальныйДоговор(Договор.Организация, Договор.Контрагент, Дата, Договор.ВалютаВзаиморасчетов);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураОснования, Договор);
	Если ЗначениеЗаполнено(РеальныйДоговор) Тогда
		СтруктураОснования.ТекстОснования = РеальныйДоговор.Наименование +
		?(БезСчета, "", " | СЧ" + Договор.Номер + " от " + Формат(Договор.Дата, "ДЛФ=DD"));
		СтруктураОснования.Номер = РеальныйДоговор.Номер;
		СтруктураОснования.Дата = РеальныйДоговор.Дата;
	Иначе
		СтруктураОснования.ТекстОснования = "СЧ" + Договор.Номер + ?(БезСчета, "", " от " + Формат(Договор.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 27.01.2020
	Если Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,Договор.Партнер,"ДобавлятьВОснованиеДляПечатиНомерКонтракта_394daa6d0633429fa5765738cd882580", Ложь) Тогда
		ДлинаНомераЗаказа = Метаданные.Документы.ЗаказКлиента.Реквизиты.НомерБезПрефикса.Тип.КвалификаторыСтроки.Длина;
		НомерДоговора = СокрЛП(Договор.Номер);
		Если СтрДлина(НомерДоговора) > ДлинаНомераЗаказа Тогда
			НомерДоговора = Лев(НомерДоговора, ДлинаНомераЗаказа);
		КонецЕсли;
		ЗаказСсылка = Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса", НомерДоговора);
		Если ЗначениеЗаполнено(ЗаказСсылка) И ЗаказСсылка.Товары.Количество() > 0 И ЗначениеЗаполнено(ЗаказСсылка.Товары[0].NКонтракта) Тогда
			СтруктураОснования.ТекстОснования = СтруктураОснования.ТекстОснования + " | " + ЗаказСсылка.Товары[0].NКонтракта;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 27.01.2020
	
	Возврат СтруктураОснования;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 26.10.2017

Функция НайтиРеальныйДоговор(Организация, Контрагент, Дата, Валюта = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 15.11.2018
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.ДатаНачалаДействия <= &Дата
	|	И ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДоговорыКонтрагентов.ДатаОкончанияДействия >= &Дата
	|		КОНЕЦ
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Лико_ЭтоРеальныйДоговор
	|	И ВЫБОР
	|			КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.Дата УБЫВ,
	|	ДоговорыКонтрагентов.ДатаОкончанияДействия УБЫВ,
	|	ДоговорыКонтрагентов.ДатаНачалаДействия УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(Валюта) Тогда
		// Обнулим валюту и выполним запрос еще раз
		Запрос.УстановитьПараметр("Валюта", Неопределено);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 15.11.2018

Функция ТаблицаВМассивСтруктур(ТаблицаЗначений) Экспорт // --> Начало Лико Ефимов ЕВВ 21.11.2017 
	
	Результат = Новый Массив;
	
	ИменаКолонок = "";
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ИменаКолонок = ИменаКолонок + "," + Колонка.Имя;
	КонецЦикла;
	ИменаКолонок = Сред(ИменаКолонок, 2);
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		СтруктураСтроки = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
		Результат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 21.11.2017  

Процедура ДополнитьТаблицуСерийКолонкамиДляПроведенияДокументов(Таблица) Экспорт
	
	Таблица.Колонки.Добавить("КоличествоУпаковок");	
	Таблица.Колонки.Добавить("Упаковка");	
	Таблица.Колонки.Добавить("СтатусУказанияСерий");
	//ПредыдущийВид = Неопределено;
	//ПредыдущаяУпаковка = Неопределено;
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Для каждого Строка из таблица Цикл
		Строка.КоличествоУпаковок = Строка.Количество;
		Строка.СтатусУказанияСерий = 8;
		//Если ПредыдущийВид = Строка.Номенклатура.ВидНоменклатуры Тогда
		//	Строка.Упаковка = ПредыдущаяУпаковка;
		//Иначе
		//	Строка.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(Строка.Номенклатура.ВидНоменклатуры);
		//КонецЕсли;
		//ПредыдущийВид = Строка.Номенклатура.ВидНоменклатуры;
		//ПредыдущаяУпаковка = Строка.Упаковка;
		Строка.Упаковка = УпаковкаТысШт;
	КонецЦикла;
	
КонецПроцедуры

// Приводит номер (код) к требуемой длине. При этом выделяется префикс
// и числовая часть номера, остальное пространство между префиксом и
// номером заполняется нулями.
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры:
//  Стр          - преобразовываемая строка;
//  Длина        - требуемая длина строки.
//
// Возвращаемое значение:
//  Строка       - код или номер, приведенная к требуемой длине.
// 
Функция ПривестиНомерКДлине(Знач Стр, Длина, ДобавлятьНулиЕслиДлинаНеМеньшеТекущейДлиныНомера = Истина, Префикс = "") Экспорт
	
	Стр             = СокрЛП(Стр);
	ВходящаяДлинаНомера = СтрДлина(Стр);
	
	ЧисловаяЧасть   = "";
	Результат       = ПолучитьПрефиксЧислоНомера(Стр, ЧисловаяЧасть);
	
	Результат = ?(ПустаяСтрока(Префикс), Результат, Префикс);
	
	СтрокаЧисловойЧасти = Формат(ЧисловаяЧасть, "ЧГ=0");
	ДлинаЧисловойЧасти = СтрДлина(СтрокаЧисловойЧасти);
	
	Если (Длина >= ВходящаяДлинаНомера И ДобавлятьНулиЕслиДлинаНеМеньшеТекущейДлиныНомера)
		ИЛИ (Длина < ВходящаяДлинаНомера) Тогда
		
		Для ВременнаяПеременная = 1 По Длина - СтрДлина(Результат) - ДлинаЧисловойЧасти Цикл
			
			Результат = Результат + "0";
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = Результат + СтрокаЧисловойЧасти;
	
	Возврат(Результат);
	
КонецФункции // ПривестиНомерКДлине()

// Разбирает строку, выделяя из нее префикс и числовую часть.
//
// Параметры:
//  Стр            - Строка. Разбираемая строка;
//  ЧисловаяЧасть  - Число. Переменная, в которую возвратится числовая часть строки;
//  Режим          - Строка. Если "Число", то возвратит числовую часть, иначе - префикс.
//
// Возвращаемое значение:
//  Префикс строки
//
Функция ПолучитьПрефиксЧислоНомера(Знач Стр, ЧисловаяЧасть = "", Режим = "") Экспорт
	
	ЧисловаяЧасть = 0;
	Префикс = "";
	Стр = СокрЛП(Стр);
	Длина   = СтрДлина(Стр);
	
	СтроковойНомерБезПрефикса = ПолучитьСтроковыйНомерБезПрефиксов(Стр);
	ДлинаСтроковойЧасти = СтрДлина(СтроковойНомерБезПрефикса);
	Если ДлинаСтроковойЧасти > 0 Тогда
		ЧисловаяЧасть = Число(СтроковойНомерБезПрефикса);
		Префикс = Сред(Стр, 1, Длина - ДлинаСтроковойЧасти);
	Иначе
		Префикс = Стр;	
	КонецЕсли;
	
	Если Режим = "Число" Тогда
		Возврат(ЧисловаяЧасть);
	Иначе
		Возврат(Префикс);
	КонецЕсли;
	
КонецФункции // ПолучитьПрефиксЧислоНомера()

// Получает номер без префиксов по алгоритму: перебирает номер справа налево до тех пор, пока не наткнется на символ, отличный от цифры.
//
// Параметры:
//  Номер - Строка - Номер с цифрами и символами
//
//  Возвращаемое значение:
//      Строка - Строка с номером, состоящим только из цифр или пустая строка, если первый справа элемент переданного номера является не цифрой
//
Функция ПолучитьСтроковыйНомерБезПрефиксов(Номер) Экспорт
	
	Номер = СокрЛП(Номер);
	НомерБезПрефиксов = "";
	Сч = СтрДлина(Номер);
	
	Пока Сч > 0 Цикл
		
		Символ = Сред(Номер, Сч, 1);
		
		Если (Символ >= "0" И Символ <= "9") Тогда
			
			НомерБезПрефиксов = Символ + НомерБезПрефиксов;
			
		Иначе
			
			Возврат НомерБезПрефиксов;
			
		КонецЕсли;
		
		Сч = Сч - 1;
		
	КонецЦикла;
	
	Возврат НомерБезПрефиксов;
	
КонецФункции

// Получает имя значения перечисления, указанное в конфигураторе, на основании ссылки на это перечисление. 
//
// Параметры:
//  Ссылка - ПеречислениеСсылка - Ссылка на перечисление
//
//  Возвращаемое значение:
//      Строка - Имя значения перечисления
//
Функция ИмяПеречисления(Ссылка) Экспорт
	
	ИмяПеречисления = Ссылка.Метаданные().Имя;
	Индекс = Перечисления[ИмяПеречисления].Индекс(Ссылка);

	Возврат Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[Индекс].Имя;
	
КонецФункции // обИмяПеречисления()

// Печатает этикетку доп. стикера для паллета. 
//
// Параметры:
//  СтруктураПараметров - Структура - структура параметров, необходимых для заполнения табличного документа
//  ТабДокДопСтикеров - ТабличныйДокумент - табличный документ, в который будет выведен результат
//
Процедура ПечатьДопСтикера_Общий(СтруктураПараметров,ТабДокДопСтикеров) Экспорт
	
	ИнформацияОСерии = СтруктураПараметров.ИнформацияОСерии;
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_МакетДопСтикер_Общий");
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапки.Параметры.Заполнить(СтруктураПараметров); 
	ОбластьШапки.Параметры.НаименованиеПродукции = ИнформацияОСерии.Наименование;
	ОбластьШапки.Параметры.КодЭтикеткиЗаказчика = ИнформацияОСерии.КодЭтикеткиЗаказчика;
	
	ТабДокДопСтикеров.Вывести(ОбластьШапки);
	ТабДокДопСтикеров.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

// Печатает этикетку доп. стикера для паллета или для этикетки на коробку. 
//
// Параметры:
//  ПараметрыПечати - Структура - структура параметров, необходимых для заполнения табличного документа
//  ТабДок - ТабличныйДокумент - табличный документ, в который будет выведен результат
//  СтикерПаллеты - Булево - признак того, для какого объекта печатается стикер (паллет или коробка)
//
Процедура ПечатьДопСтикера_PGs(ПараметрыПечати, ТабДок, СтикерПаллеты = Ложь) Экспорт
	
	Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG
		ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Дистрибьюторская
		ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.IML
		ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.Хенкель
		ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.КодЭтикеткиЗаказчика Тогда
		Макет = ПолучитьОбщийМакет("ПФ_MXL_МакетДопСтикер_PG");
	ИначеЕсли ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Plant Тогда
		Макет = ПолучитьОбщийМакет("ПФ_MXL_МакетДопСтикер_PG_Plant");
	Иначе
		Возврат;
	КонецЕсли;
	
	ИнформацияОСерии = ПараметрыПечати.ИнформацияОСерии;	
	
	ПараметрыПечати.Вставить("ОрганизацияПродавец", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра);
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	
	Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.IML
		ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.Хенкель
		ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.КодЭтикеткиЗаказчика Тогда
		ОбластьШапкаШК	= Макет.ПолучитьОбласть("ОбластьШкIML");
	ИначеЕсли ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Дистрибьюторская Тогда
		ОбластьШапкаШК	= Макет.ПолучитьОбласть("ОбластьШКДистрибьюторская");
	Иначе
		ОбластьШапкаШК	= Макет.ПолучитьОбласть("ОбластьШК");
	КонецЕсли;
	
	Если ПараметрыПечати.ТипДопСтикераКоробки = Перечисления.ЯСГП_ТипыДополнительныхСтикеров.КодЭтикеткиЗаказчика И НЕ СтикерПаллеты Тогда
		
		ШК = СокрЛП(ПараметрыПечати.ИнформацияОСерии.КодЭтикеткиЗаказчика);
		Если НЕ ЗначениеЗаполнено(ШК) Тогда
			Сообщить("Не указан код этикетки заказчика. Доп. стикер распечатан не будет");
			Возврат;
		КонецЕсли;
		ВШКТолькоЦифры = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ШК);
		
		Рисунок = ОбластьШапкаШК.Рисунки["Штрихкод4"];
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Рисунок.Ширина);
		ПараметрыШтрихкода.Вставить("Высота",          Рисунок.Высота);
		//ПараметрыШтрихкода.Вставить("ТипКода",         ?(ВШКТолькоЦифры И СтрДлина(ШК) = 13, 1, 4));
		ПараметрыШтрихкода.Вставить("ТипКода",         ?(МенеджерОборудованияКлиентСервер.ОпределитьТипШтрихкода(ШК) = "EAN13", 1, 4));
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    18);
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШК));
		Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		ОбластьШапкаШК.Параметры["ТекстКода4"] = ШК;
		
		ТабДок.Вывести(ОбластьШапкаШК);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		Возврат;
	КонецЕсли;

	Преф = "001";
	КодЗаказчика = "464001531";   //464001531
	Если СтикерПаллеты Тогда
		
		ШКкодП =  Формат(ПараметрыПечати.Паллет.Код, "ЧЦ=7; ЧВН=; ЧГ=0");
		// --> Начало Лико Ефимов ЕВВ 25.12.2018 
		//ШКконтр = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(Преф + КодЗаказчика + ШКкодП);
		
		// Изменено по требованиям Mekaeva, Tatiana <mekaeva.tv@pg.com> письмо от 21, 12, 2018 14:21
		ШКконтр = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШКВСистемеGS1_13(Преф + КодЗаказчика + ШКкодП);
		// <-- Конец Лико Ефимов ЕВВ 25.12.2018 
		
		ШК3Текст = "(00)1" + КодЗаказчика + ШККодП + ШКконтр; //длинна штрихкода - 20 знакомест (00 + 1 + КодЗаказчика + КодПаллеты + КонтрольнаяСумма)
		
		ШК3Код = Преф + КодЗаказчика + ШККодП + ШКконтр;
	Иначе	
		НомерПаллеты_4смвНомерЗаказа = Прав(Формат(ПараметрыПечати.НомерЗаказа, "ЧГ=0"), 4);
		// --> Начало Лико Ефимов ЕВВ 20.06.2018
		// номер коробки будем формировать исходя из количество строк в заказе. Если строк в заказе 2, то к коробкам второй строки заказа будем прибавлять 50.
		// Если строки 4, то к коробкам второй строки заказа будем прибавлять 25, к коробкам 3 строки 50, к коробкам 4 строки 75 и т.д. 
		КолСтрокВЗаказе = ПараметрыПечати.Заказ.Товары.Количество();
		НомерКоробки = ИнформацияОСерии.НомерКоробки;
		Если КолСтрокВЗаказе > 1 Тогда
			СтрокаЗаказа = ПараметрыПечати.Заказ.Товары.Найти(ИнформацияОСерии.Характеристика, "Характеристика");
			Если СтрокаЗаказа <> Неопределено Тогда
				НомерСтрокиЗаказа = СтрокаЗаказа.НомерСтроки;
				Если НомерСтрокиЗаказа <> 1 Тогда
					ДобавляемоеКоличество = (НомерСтрокиЗаказа-1) * Цел(100 / КолСтрокВЗаказе);
					НомерКоробки = ДобавляемоеКоличество + НомерКоробки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 20.06.2018
		НомерПаллеты =  НомерПаллеты_4смвНомерЗаказа + Формат(НомерКоробки, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
		
		ШК3КонтрСимв = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(Преф + КодЗаказчика + НомерПаллеты);
		
		ШК3ТекстНеполный = "(00)1" + КодЗаказчика + НомерПаллеты + ШК3КонтрСимв; //длина штрихкода - 20 знакомест (00 + 1 + КодЗаказчика + КодПаллеты + КонтрольнаяСумма)
		ШК3КодНеполный = Преф + КодЗаказчика + НомерПаллеты + ШК3КонтрСимв;
		
		Попытка
			ЦифраПоследняя = 10-(((Число(Сред(ШК3КодНеполный,1,1))+Число(Сред(ШК3КодНеполный,3,1))+Число(Сред(ШК3КодНеполный,5,1))+Число(Сред(ШК3КодНеполный,7,1))+Число(Сред(ШК3КодНеполный,9,1))+Число(Сред(ШК3КодНеполный,11,1))+Число(Сред(ШК3КодНеполный,13,1))+Число(Сред(ШК3КодНеполный,15,1))+Число(Сред(ШК3КодНеполный,17,1))+Число(Сред(ШК3КодНеполный,19,1)))*3+(Число(Сред(ШК3КодНеполный,2,1))+Число(Сред(ШК3КодНеполный,4,1))+Число(Сред(ШК3КодНеполный,6,1))+Число(Сред(ШК3КодНеполный,8,1))+Число(Сред(ШК3КодНеполный,10,1))+Число(Сред(ШК3КодНеполный,12,1))+Число(Сред(ШК3КодНеполный,14,1))+Число(Сред(ШК3КодНеполный,16,1))+Число(Сред(ШК3КодНеполный,18,1))))%10);
			ШК3Текст = ШК3ТекстНеполный + СтрЗаменить(Строка(ЦифраПоследняя),"10","0");
			ШК3Код = Строка(ШК3КодНеполный) + СтрЗаменить(Строка(ЦифраПоследняя),"10","0");
		Исключение
			ШК3Текст = ШК3ТекстНеполный;
			ШК3Код = ШК3КодНеполный;
		КонецПопытки;
	КонецЕсли;
	
	КодЭтикеткиЗаказчика = СокрЛП(СтрЗаменить(ИнформацияОСерии.КодЭтикеткиЗаказчика, "code", ""));
	КодЭтикеткиЗаказчикаЧ = Лико_Дополнительно.ПривестиНомерКДлине(СокрЛП(СтрЗаменить(КодЭтикеткиЗаказчика, ":", "")), 8);
	
	КоличествоВУпаковке = ИнформацияОСерии.КоличествоВУпаковке;
	ПараметрыПечати.Вставить("КоличествоНаПаллете", КоличествоВУпаковке * 1000);
	
	ШК1Код = "91" + КодЭтикеткиЗаказчикаЧ + Символ(29) + "37" + Формат(КоличествоВУпаковке * 1000, "ЧЦ=11; ЧН=0; ЧГ=0");
	ШК1текст = "(91)" + КодЭтикеткиЗаказчикаЧ + "(37)" + Формат(КоличествоВУпаковке * 1000, "ЧЦ=11; ЧН=0; ЧГ=0");
	Если СтикерПаллеты Тогда
		Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Plant Тогда
			Лот = "OKMO" + Формат(ПараметрыПечати.НомерЗаказа, "ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ=0");
		ИначеЕсли ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.Хенкель Тогда
			Лот = Формат(ПараметрыПечати.НомерЗаказа, "ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ=0");
		Иначе
			Лот = "MSOS" + Формат(ПараметрыПечати.НомерЗаказа, "ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ=0");
		КонецЕсли;
		ТипПаллета = "NONE";
		// --> Начало Лико Ефимов ЕВВ 17.01.2024
		Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Дистрибьюторская 
			// <-- Начало Лико Яцун С. В. 31.07.2024
			И ТабДок.ИмяПараметровПечати = "ПечатьДопСтикераКоробкиPGsДистрибьюторская" Тогда
			// <-- Конец Лико Яцун С. В. 31.07.2024
			ШК2Код = "10" + Лот;
			ШК2текст = "(10)" + Лот;
		// <-- Конец Лико Ефимов ЕВВ 17.01.2024
		Иначе
			ШК2Код = "10" + Лот + Символ(29) + "90" + Лико_Дополнительно.ПривестиНомерКДлине(ТипПаллета, 4);
			ШК2текст = "(10)" + Лот + "(90)" + Лико_Дополнительно.ПривестиНомерКДлине(ТипПаллета, 4); 
		КонецЕсли;
		ПараметрыПечати.Вставить("НомерПаллеты", Формат(ПараметрыПечати.Паллет.Код, "ЧГ=0"));
		ПараметрыПечати.Вставить("ТипПаллета", ТипПаллета);
		ПараметрыПечати.Вставить("ДатаУпаковки", Формат(ИнформацияОСерии.ДатаВыпуска, "ДФ=dd.MM.yy"));
	Иначе
		Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.Хенкель Тогда
			Лот = Формат(ПараметрыПечати.НомерЗаказа, "ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ=0");
		Иначе	
			Лот = "MSOS" + Формат(ПараметрыПечати.НомерЗаказа, "ЧЦ=7; ЧДЦ=0; ЧВН=; ЧГ=0");
		КонецЕсли;
		
		Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Plant Тогда
			ТипПаллета = "NONE";
			ШК2Код = "10" + Лот + Символ(29) + "90" + Лико_Дополнительно.ПривестиНомерКДлине(ТипПаллета, 4);
			ШК2текст = "(10)" + Лот + "(90)" + Лико_Дополнительно.ПривестиНомерКДлине(ТипПаллета, 4);
		Иначе
			ТипПаллета = "";
			ШК2Код = "10" + Лот + Символ(29) + "90";
			ШК2текст = "(10)" + Лот + "(90)";
		КонецЕсли;
		Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG 
			ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Дистрибьюторская Тогда
			ПараметрыПечати.Вставить("НомерПаллеты", "NONE");
		ИначеЕсли ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Plant Тогда
			ПараметрыПечати.Вставить("НомерПаллеты", НомерПаллеты);
		КонецЕсли;
		ПараметрыПечати.Вставить("ДатаУпаковки", Формат(ИнформацияОСерии.ДатаУпаковки, "ДФ=dd.MM.yy"));
	КонецЕсли;
	
	Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.IML ИЛИ ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.Хенкель Тогда
		Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.IML Тогда
			// IML
			Штрихкод = ПолучитьШкДопСтикераIML(ИнформацияОСерии.Ссылка);
			ШтрихкодТекст = Штрихкод;
			Если НЕ ЗначениеЗаполнено(Штрихкод) Тогда
				Сообщить("Произошла ошибка при формировании штрихкода IML");
				Возврат;
			КонецЕсли;
		Иначе
			// Хенкель
			Штрихкод = "240" + СокрЛП(ИнформацияОСерии.КодЭтикеткиЗаказчика) + "10" + Лот;
			ШтрихкодТекст = "(240)" + СокрЛП(ИнформацияОСерии.КодЭтикеткиЗаказчика) + "(10)" + Лот;
			ПараметрыПечати.Вставить("Лот", Лот);
		КонецЕсли;
		
		Рисунок = ОбластьШапкаШК.Рисунки["Штрихкод4"];
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Рисунок.Ширина);
		ПараметрыШтрихкода.Вставить("Высота",          Рисунок.Высота);
		ПараметрыШтрихкода.Вставить("ТипКода",         4);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    18);
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(Штрихкод));
		Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		ОбластьШапкаШК.Параметры["ТекстКода4"] = ШтрихкодТекст;
		
		ПараметрыПечати.Вставить("КодЭтикеткиЗаказчика", СокрЛП(ИнформацияОСерии.КодЭтикеткиЗаказчика));
	Иначе
		СчPG_Дистрибьюторская = 5;
		Для сч = 1 по 3 Цикл
			Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Дистрибьюторская Тогда
				Рисунок = ОбластьШапкаШК.Рисунки["Штрихкод" + СчPG_Дистрибьюторская];
				СчPG_Дистрибьюторская = СчPG_Дистрибьюторская + 1;
			Иначе
				Рисунок = ОбластьШапкаШК.Рисунки["Штрихкод" + сч];
			КонецЕсли;
			ПараметрыШтрихкода = Новый Структура;
			Штрихкод = "";
			Выполнить("Штрихкод = ШК" + сч + "Код");
			ТекстКода = "";
			Выполнить("ТекстКода = ШК" + сч + "текст");
			//ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / ПараметрыПечати.КоличествоМиллиметровВПикселе));
			//ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / ПараметрыПечати.КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Ширина",          Рисунок.Ширина);
			ПараметрыШтрихкода.Вставить("Высота",          Рисунок.Высота);
			ПараметрыШтрихкода.Вставить("ТипКода",         4);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    18);
			ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(Штрихкод));
			Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
			ОбластьШапкаШК.Параметры["ТекстКода" + сч] = ТекстКода;
		КонецЦикла;
		
		ПараметрыПечати.Вставить("КодЭтикеткиЗаказчика", КодЭтикеткиЗаказчикаЧ);
		ПараметрыПечати.Вставить("Лот", Лот);
	КонецЕсли;
	
	ПараметрыПечати.Вставить("ТипПаллета", ТипПаллета);
	ПараметрыПечати.Вставить("НаименованиеЭтикетки", ИнформацияОСерии.Наименование);
	
	ПараметрыПечати.Вставить("CodePlant", ПараметрыПечати.CodePlant);
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
	Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.PG_Дистрибьюторская Тогда
		ТабДокPG_Дистрибьюторская = Новый ТабличныйДокумент;
		ТабДокPG_Дистрибьюторская.Вывести(ОбластьШапка);
		ТабДокPG_Дистрибьюторская.Вывести(ОбластьШапкаШК);
		//КопияТабДокPG_Дистрибьюторская = ТабДокPG_Дистрибьюторская.ПолучитьОбласть("C1:C4");
		//ТабДокPG_Дистрибьюторская.НачатьАвтогруппировкуКолонок(); 
		//ТабДокPG_Дистрибьюторская.Присоединить(КопияТабДокPG_Дистрибьюторская);
		ТабДокPG_Дистрибьюторская.ВставитьОбласть(ТабДокPG_Дистрибьюторская.Область("C1:C4"),ТабДокPG_Дистрибьюторская.Область("C5"));
		
		ТабДок.Вывести(ТабДокPG_Дистрибьюторская);
	Иначе
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьШапкаШК);
	КонецЕсли;
	Если ПараметрыПечати.ТипДопСтикераКоробки=Перечисления.ЯСГП_ТипыДополнительныхСтикеров.Хенкель Тогда
		// Нужно печатать 2D-код
		Текст2DКода = СокрЛП(ИнформацияОСерии.КодЭтикеткиЗаказчика) + ";" + Лот;
		Рисунок = ОбластьШапкаШК.Рисунки["Штрихкод4"];
		Рисунок.РазмерКартинки = РазмерКартинки.АвтоРазмер;
		Картинка2DКода = ПолучитьКартинкуШтрихкодаDataMatrix(Текст2DКода);
		Если ЗначениеЗаполнено(Картинка2DКода) Тогда
			Рисунок.Картинка = Картинка2DКода;
		Иначе
			Рисунок.Картинка = Новый Картинка;
		КонецЕсли;
		ОбластьШапкаШК.Параметры["ТекстКода4"] = Текст2DКода;
		ТабДок.Вывести(ОбластьШапкаШК);
		
		// Поменять надпись "LOT #" на "НОМЕР ПАРТИИ"
		ОбластьЛот = ТабДок.НайтиТекст("LOT #");
		Если ОбластьЛот <> Неопределено Тогда
			ОбластьЛот.Текст = "Номер партии";
		КонецЕсли;
	КонецЕсли;
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

Функция ПолучитьШкДопСтикераIML(Серия) Экспорт
	
	// шк состоит из 25 символов xxxxxxxxxxyyyyyyzzzzzwwww
	// xxxxxxxxxx (10 симоволов) - код дизайна (код этикетки заказчика)
	// yyyyyy (6 симв) - дата в формате ддммгг
	// zzzzz (5 симв) - количество этикеток
	// wwww (4 симв) - номер коробки
	КодДизайна = СокрЛП(Серия.Лико_КодЭтикеткиЗаказчика);
	Если СтрДлина(КодДизайна) > 10 Тогда
		КодДизайна = Лев(КодДизайна, 10);
	ИначеЕсли СтрДлина(КодДизайна) < 10 Тогда
		КодДизайна = Прав("0000000000", 10 - СтрДлина(КодДизайна)) + КодДизайна;
	КонецЕсли;
	ДатаУпаковкиСтрока = Формат(Серия.Лико_ДатаУпаковки, "ДФ=ddMMyy");
	КоличествоСтрока = Формат(Серия.Лико_КоличествоВУпаковке * 1000, "ЧЦ=5; ЧДЦ=; ЧВН=; ЧГ=0");
	НомерКоробкиСтрока = Формат(Серия.Лико_НомерКоробки, "ЧЦ=4; ЧДЦ=; ЧВН=; ЧГ=0");
	Штрихкод = "" + КодДизайна + ДатаУпаковкиСтрока + КоличествоСтрока + НомерКоробкиСтрока;
	Возврат Штрихкод;
	
КонецФункции

// Раскладывает строку без пробелов в строку с пробелами (например, "ЛикоЗаявкаНаТранспортировку" переделает в "Лико заявка на транспортировку"). 
//
// Параметры:
//  Строка - Строка - Строка без пробелов
//
//  Возвращаемое значение:
//      Строка - Строка с пробелами
//
Функция РазложитьСтрокуКакЭтоДелаетКонфигураторСНазваниямиОбъектовПереводяИхВСиноним(Строка) Экспорт
	
	НоваяСтрока = "";
	Для сч = 1 по СтрДлина(Строка) Цикл
		ТекСимвол = Сред(Строка, сч, 1);
		Если сч = 1 Тогда
			НоваяСтрока = ТекСимвол;
			Продолжить;
		КонецЕсли;
		Если ВРег(ТекСимвол) = ТекСимвол Тогда
			//Это большая буква
			НоваяСтрока = НоваяСтрока + " " + НРег(ТекСимвол);
		Иначе
			НоваяСтрока = НоваяСтрока + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	Возврат НоваяСтрока;
	
КонецФункции

// Вычисляет смену по переданному времени. 
//
// Параметры:
//  ТекВремя - Дата - Дата с временем
//
//  Возвращаемое значение:
//      Число - Номер смены
//
Функция ВычислитьСмену(ТекВремя) Экспорт
	Час1 = Час(ТекВремя);
	Мин1 = Минута(ТекВремя);
	Если (Час1 <= 9 и Мин1 < 30) ИЛИ (Час1 < 9) ИЛИ (Час1 >= 21 и Мин1 > 29) ИЛИ (Час1 >= 22) Тогда
		Возврат 2;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

// Вспомогательная функция для отладки печатных форм при печати через форму обработки, чтобы печатные формы выводились в типовую форму печати, а не просто ТабДок.Показать()
//
// Параметры:
//  ТабличныеДокументы - Массив - массив с табличными документами, у которых обязательно должно быть заполнено свойство ИмяПараметровПечати
//  ЛеваяЧастьИмени - Строка - левая часть имени элемента.
//
//  Возвращаемое значение:
//      Структура - структура печатных форм в типовом виде
//
Функция ПодготовитьКоллекциюПечатныхФорм(ТабличныеДокументы) Экспорт
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(Новый Массив);
	Для каждого ТабличныйДокумент из ТабличныеДокументы Цикл
		ИмяМакета = ТабличныйДокумент.ИмяПараметровПечати;
		СинонимМакета = Лико_Дополнительно.РазложитьСтрокуКакЭтоДелаетКонфигураторСНазваниямиОбъектовПереводяИхВСиноним(ИмяМакета);
		Если КоллекцияПечатныхФорм.Найти(ВРЕГ(ТабличныйДокумент.ИмяПараметровПечати), "ИмяВРЕГ") = Неопределено Тогда
			НоваяПФ = КоллекцияПечатныхФорм.Добавить();
			НоваяПФ.ИмяВРЕГ = ВРег(ИмяМакета);
			НоваяПФ.ИмяМакета = ИмяМакета;
			НоваяПФ.Экземпляров = ТабличныйДокумент.КоличествоЭкземпляров;
		КонецЕсли;
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ТабличныйДокумент);
	КонецЦикла;
	Возврат КоллекцияПечатныхФорм;
КонецФункции

// Находит дополнительную обработку по наименованию. Написана для вызова с клиента
//
// Параметры:
//  Наименование - Строка - Наименование обработки
//
//  Возвращаемое значение:
//      СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка на обработку
//
Функция НайтиДополнительнуюОбработкуПоНаименованию(Наименование) Экспорт // --> Начало Лико Ефимов ЕВВ 05.05.2017 
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование, Истина);	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 05.05.2017 

// Находит дополнительную обработку по имени объекта. Написана для вызова с клиента
//
// Параметры:
//  Наименование - Строка - Имя объекта обработки
//
//  Возвращаемое значение:
//      СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка на обработку
//
Функция НайтиДополнительнуюОбработкуПоИмениОбъекта(ИмяОбъекта) Экспорт // --> Начало Лико Ефимов ЕВВ 22.05.2018  
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбъекта);	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 22.05.2018  

// Находит обработку для открытия при начале работы системы
//
//  Возвращаемое значение:
//      Структура - Структура с данными для открытия обработки в типовом виде
//
Функция НайтиОбработкиРабочегоМестаДляОткрытияПриНачалеРаботыСистемы() Экспорт // --> Начало Лико Ефимов ЕВВ 05.05.2017
	
	Результат = Новый Массив; 
	
	Для каждого СтрокаТЧ из ПараметрыСеанса.Лико_РабочееМесто.ОбработкиДляОткрытияПриЗапуске1С Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Обработка) Тогда
			Структура = Новый Структура;
			Структура.Вставить("Ссылка", СтрокаТЧ.Обработка);
			Если ТипЗнч(Структура.Ссылка) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") И Структура.Ссылка.Команды.Количество() > 0 Тогда
				Структура.Вставить("Идентификатор", ?(ЗначениеЗаполнено(СтрокаТЧ.ИмяКоманды), СтрокаТЧ.ИмяКоманды, СтрокаТЧ.Обработка.Ссылка.Команды[0].Идентификатор));
				Структура.Вставить("ЭтоОтчет", СтрокаТЧ.Обработка.Ссылка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет);
			ИначеЕсли ТипЗнч(Структура.Ссылка) = Тип("Строка") Тогда
				// Для строки проверим, есть ли в конфе такая обработка
				Если Метаданные.Обработки.Найти(Структура.Ссылка) = Неопределено Тогда
					// В конфе такой обработки нет, пропустим строку 
					Сообщить("В базе не найдена обработка с именем """ + Структура.Ссылка + """. Обратитесь к программистам");
					Продолжить;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
			Результат.Добавить(Структура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 05.05.2017

// Создает новый элемент справочника Лико_Паллеты
//
// Параметры:
//  Автор - СправочникСсылка.ФизическиеЛица - Автор паллета
//
//  Возвращаемое значение:
//      СправочникСсылка.Лико_Паллеты, Неопределено - Ссылка на новый паллет. Неопределено, если не удалось создать
//
Функция СоздатьНовыйПаллет(Автор = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 10.05.2017
	Паллет = Справочники.Лико_Паллеты.СоздатьЭлемент();
	Паллет.Автор = Автор;
	Паллет.ДатаФормирования = ТекущаяДата();
	Попытка
		Паллет.Записать();
		Возврат Паллет.Ссылка;
	Исключение
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось создать новый паллет!");
		Возврат Неопределено;
	КонецПопытки;
КонецФункции // <-- Конец Лико Ефимов ЕВВ 10.05.2017 

// Находит последний созданный оператором паллет
//
// Параметры:
//  Оператор - СправочникСсылка.ФизическиеЛица - Автор паллета
//
//  Возвращаемое значение:
//      СправочникСсылка.Лико_Паллеты, Неопределено - Ссылка на последний паллет. Неопределено, если не удалось создать
//
Функция НайтиПоследнийПаллетОператора(Оператор) Экспорт // --> Начало Лико Ефимов ЕВВ 10.05.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_Паллеты.Ссылка
	|ИЗ
	|	Справочник.Лико_Паллеты КАК Лико_Паллеты
	|ГДЕ
	|	Лико_Паллеты.Автор = &Автор
	|	И НЕ Лико_Паллеты.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_Паллеты.ДатаФормирования УБЫВ";
	
	Запрос.УстановитьПараметр("Автор", Оператор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 10.05.2017

// Проверяет текущее рабочее место. Если ТСД, то Истина, иначе Ложь
//
//  Возвращаемое значение:
//      Булево - Признак того, что работает на ТСД
//
Функция ВызовСТСД() Экспорт // --> Начало Лико Ефимов ЕВВ 25.05.2017 
	
	Если ПараметрыСеанса.Лико_РабочееМесто.ТипРабочегоМеста = Перечисления.Лико_ТипыРабочегоМеста.КПК Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 25.05.2017 

// Процедура запускается подпиской на событие и проверяет, чтобы в введенных в заказе характеристиках заказ клиента стоял равным документу-источнику 
//
Процедура ПроверитьХарактеристикиЗаказаКлиента(Источник, Отказ, РежимПроведения) Экспорт // --> Начало Лико Ефимов ЕВВ 29.03.2017 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) <> Тип("ДокументОбъект.ЗаказКлиента") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЧ из Источник.Товары Цикл
		//Начало изменений Иванова Анна 20180214
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) ТОгда 
			Если СтрокаТЧ.номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток Тогда 
				Если ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
					Если СтрокаТЧ.Характеристика.Лико_ЗаказНоменклатуры <> Источник.Ссылка Тогда
						Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Источник + """: в характеристике """ + СтрокаТЧ.Характеристика + """ выбран заказ клиента, отличный от документа.");
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 16.06.2017

// Возвращает паллет и ячейку, в которых хранится серия на заданную дату через регистр сведений лк Адресное хранение
//
// Параметры:
//  Серия - СправочникСсылка.СерииНоменклатуры - Серия коробки
//  Дата - Дата - Дата, на которую необходим срез информации
//
//  Возвращаемое значение:
//      Структура с ключами "Паллет" и "Ячейка"
//
Функция ПолучитьПаллетИЯчейкуКоробки(Серия, Дата) Экспорт // --> Начало Лико Ефимов ЕВВ 04.07.2017 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Лико_АдресноеХранение.Ячейка КАК Ячейка,
	|	Лико_АдресноеХранение.Паллет КАК Паллет
	|ИЗ
	|	РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|			&Дата,
	|			Активность
	|				И Серия = &Серия) КАК Лико_АдресноеХранение";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Структура = Новый Структура("Паллет,Ячейка");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 04.07.2017 

Функция ПолучитьСодержимоеПаллета(Паллет, Дата = Неопределено, Документ = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 26.12.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_АдресноеХранениеСрезПоследних.Период) КАК Период,
	|	Лико_АдресноеХранениеСрезПоследних.Паллет
	|ПОМЕСТИТЬ ВТ_ПаллетСПоследнейДатой
	|ИЗ
	|	РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|			&Дата,
	|			Паллет = &Паллет
	|				И Регистратор <> &Ссылка) КАК Лико_АдресноеХранениеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_АдресноеХранениеСрезПоследних.Паллет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_АдресноеХранениеСрезПоследних.Период,
	|	Лико_АдресноеХранениеСрезПоследних.Паллет,
	|	Лико_АдресноеХранениеСрезПоследних.Ячейка,
	|	Лико_АдресноеХранениеСрезПоследних.ВыбылСоСклада,
	|	Лико_АдресноеХранениеСрезПоследних.Серия,
	|	Лико_АдресноеХранениеСрезПоследних.Склад
	|ПОМЕСТИТЬ ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр
	|ИЗ
	|	РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|			&Дата,
	|			(Период, Паллет) В
	|					(ВЫБРАТЬ
	|						Т.Период,
	|						Т.Паллет
	|					ИЗ
	|						ВТ_ПаллетСПоследнейДатой КАК Т)
	|				И Регистратор <> &Ссылка) КАК Лико_АдресноеХранениеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Период КАК Период,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Паллет КАК Паллет,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Ячейка,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.ВыбылСоСклада,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Серия КАК Серия,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Склад
	|ИЗ
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр КАК ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|				&Дата,
	|				Серия В
	|						(ВЫБРАТЬ
	|							Т.Серия
	|						ИЗ
	|							ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр КАК Т)
	|					И Регистратор <> &Ссылка) КАК Лико_АдресноеХранениеСрезПоследних
	|		ПО ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Период = Лико_АдресноеХранениеСрезПоследних.Период
	|			И ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Паллет = Лико_АдресноеХранениеСрезПоследних.Паллет
	|			И ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Серия = Лико_АдресноеХранениеСрезПоследних.Серия
	|			И ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Ячейка = Лико_АдресноеХранениеСрезПоследних.Ячейка
	|ГДЕ
	|	НЕ Лико_АдресноеХранениеСрезПоследних.Паллет ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Паллет", Паллет);
	Запрос.УстановитьПараметр("Дата", ?(НЕ ЗначениеЗаполнено(Дата) ИЛИ Дата = НачалоДня(ТекущаяДата()), ТекущаяДата(), Дата));
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 26.12.2017

// Сравнивает две одинаковые (по составу колонок) таблицы значения на полное их совпадение по содержимому
//
// Параметры:
//  Таблица0 - ТаблицаЗначений - Первая таблица
//  Таблица1 - ТаблицаЗначений - Вторая таблица
//
//  Возвращаемое значение:
//      Булево - Ложь (полностью совпадают), Истина (не совпадают)
//
Функция СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(Таблица0, Таблица1, ПроверятьПорядокСтрок = Ложь) Экспорт
	
	// взято с инфостарта
	ВсеКолонки = "";
	Для Каждого Колонка Из Таблица0.Колонки Цикл 
		ВсеКолонки = ВсеКолонки + "," + Колонка.Имя;
	КонецЦикла;
	
	ВсеКолонки = Сред(ВсеКолонки, 2);
	
	Таблица = Таблица1.Скопировать();    
	
	Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
	
	Таблица.ЗаполнитьЗначения(1, "Знак");
	
	Для Каждого Строка Из Таблица0 Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка);
	КонецЦикла;
	
	Таблица.Колонки.Добавить("Счёт");
	Таблица.ЗаполнитьЗначения(1, "Счёт");
	
	Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");
	
	Ответ = Таблица.Скопировать(Новый Структура("Счёт", 1), ВсеКолонки + ", Знак");
	
	ТаблицыРазличаются = Ответ.Количество() > 0;
	
	Если НЕ ТаблицыРазличаются И ПроверятьПорядокСтрок Тогда
		Если Таблица0.Количество() <> Таблица1.Количество() ИЛИ Таблица0.Колонки.Количество() <> Таблица1.Колонки.Количество() Тогда
			Возврат Истина;
		Иначе
			Для сч = 0 По Таблица0.Количество()-1 Цикл
				Для каждого Колонка из Таблица0.Колонки Цикл 
					Если НЕ Таблица0[сч][Колонка.Имя] = Таблица1[сч][Колонка.Имя] Тогда
						Возврат Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицыРазличаются;
	
КонецФункции

// Возвращает режим запуска основного окна в зависимости от рабочего места или других влияющих факторов
//
//  Возвращаемое значение:
//      РежимОсновногоОкнаКлиентскогоПриложения
//
Функция ПолучитьРежимОсновногоОкна() Экспорт // --> Начало Лико Ефимов ЕВВ 18.07.2017
	
	Режим = РежимОсновногоОкнаКлиентскогоПриложения.Обычный;
	Если ПараметрыСеанса.Лико_РабочееМесто.ТипРабочегоМеста = Перечисления.Лико_ТипыРабочегоМеста.КПК Тогда
		Режим = РежимОсновногоОкнаКлиентскогоПриложения.ПолноэкранноеРабочееМесто;
	КонецЕсли;
	Если ПараметрыСеанса.Лико_РабочееМесто.ТипРабочегоМеста = Перечисления.Лико_ТипыРабочегоМеста.Телевизор Тогда
		Режим = РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто;
	КонецЕсли;
	Возврат Режим;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 18.07.2017

// Работает аналогично функции НайтиСтроки, но возвращает не массив, а таблицу значений
//
//
// Параметры:
//  ТЗПоиска - ТаблицаЗначений - Таблица, в которой будем искать
//  Отбор - Структура - Задает условия поиска: ключ структуры определяет имя колонки, по которой будет осуществляться поиск, а значение структуры - искомое значение. 
//
//  Возвращаемое значение:
//      ТаблицаЗначений - Таблица с отбором. Если по отбору ничего не найдено, возвращается пустая таблица значений
//
Функция НайтиСтрокиВозвращаетТЗ(ТЗПоиска, Отбор) Экспорт // --> Начало Лико Ефимов ЕВВ 20.07.2017
	
	НайденныеСтроки = ТЗПоиска.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		НоваяТЗ = ТЗПоиска.Скопировать(НайденныеСтроки);
	Иначе
		// если строки не нашлись, вернем пустую ТЗ
		НоваяТЗ = ТЗПоиска.СкопироватьКолонки();
	КонецЕсли;
	
	Возврат НоваяТЗ;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 20.07.2017

// Считает количество коробок в таблице значений
//
//
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений - Таблица с обязательной колонкой "Серия"
//
//  Возвращаемое значение:
//      Число - Количество коробок в таблица значений
//
Функция РассчитатьКоличествоКоробокВТЗ(ТаблицаЗначений) Экспорт // --> Начало Лико Ефимов ЕВВ 13.09.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Серия
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|ВЫБРАТЬ
	|	СУММА(ВТ.Серия.Лико_КоличествоКоробок) КАК КоличествоКоробок
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ТЗ", ТаблицаЗначений);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоКоробок;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 13.09.2017

Процедура ДобавитьСериюВТЧПродукцяДокументаЗаявкаНаТранспортировку(Серия, ДокОбъект) Экспорт // --> Начало Лико Ефимов ЕВВ 06.12.2017 
	
	// --> Начало Лико Ефимов ЕВВ 09.01.2018
	// Если данная номенклатура и характеристика есть в заявках, то данные возьмем оттуда
	// <-- Конец Лико Ефимов ЕВВ 09.01.2018
	Характеристика = Серия.Лико_ХарактеристикаВладелец;
	Номенклатура = Характеристика.Владелец;
	Отбор = Новый Структура();
	Отбор.Вставить("Номенклатура", Номенклатура);
	Отбор.Вставить("Характеристика", Характеристика);
	Отбор.Вставить("Намотка", Серия.Лико_НаправлениеНамотки);
	Отбор.Вставить("Город", Серия.Лико_Город);
	Отбор.Вставить("КодЭтикеткиЗаказчика", Серия.Лико_КодЭтикеткиЗаказчика);
	Отбор.Вставить("ЧестныйЗнак", Серия.Лико_ЧестныйЗнак);
	Отбор.Вставить("НомерПоставки", Серия.Лико_НомерПоставки);
	НайденныеСтроки = ДокОбъект.ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
	//Если НайденныеСтроки.Количество() = 0 Тогда
	//	// Попробуем убрать город
	//	Отбор.Удалить("Город");
	//	НайденныеСтроки = ДокОбъект.ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
	//КонецЕсли;
	//Если НайденныеСтроки.Количество() = 0 Тогда
	//	// Попробуем убрать намотку
	//	Отбор.Удалить("Намотка");
	//	НайденныеСтроки = ДокОбъект.ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
	//КонецЕсли;
	//Если НайденныеСтроки.Количество() = 0 Тогда
	//	// Попробуем убрать КодЭтикеткиЗаказчика
	//	Отбор.Удалить("КодЭтикеткиЗаказчика");
	//	НайденныеСтроки = ДокОбъект.ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
	//КонецЕсли;
	//Если НайденныеСтроки.Количество() = 0 Тогда
	//	// Попробуем убрать НомерПоставки
	//	Отбор.Удалить("НомерПоставки");
	//	НайденныеСтроки = ДокОбъект.ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
	//КонецЕсли;
	
	НоваяСтрока = ДокОбъект.Продукция.Добавить();
	НоваяСтрока.Характеристика = Характеристика;
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Серия = Серия;
	НоваяСтрока.Мест = 1;
	НоваяСтрока.Затреб = 0;
	НоваяСтрока.Паллет = Неопределено;
	НоваяСтрока.АдресХранения = Неопределено;
	НоваяСтрока.Количество = Серия.Лико_КоличествоВУпаковке;
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока.ЗаказКлиента = НоваяСтрока.Характеристика.Лико_ЗаказНоменклатуры;
		НоваяСтрока.АдресДоставки = НоваяСтрока.ЗаказКлиента.АдресДоставки;
		НоваяСтрока.Втулка = Серия.Лико_Втулка;
		НоваяСтрока.Намотка = Серия.Лико_НаправлениеНамотки;
		НоваяСтрока.Город = Серия.Лико_Город;
		НоваяСтрока.Контрагент = НоваяСтрока.ЗаказКлиента.Контрагент;
		НоваяСтрока.КодЭтикеткиЗаказчика = Серия.Лико_КодЭтикеткиЗаказчика;
		НоваяСтрока.ЧестныйЗнак = Серия.Лико_ЧестныйЗнак;
		НоваяСтрока.НомерПоставки = Серия.Лико_НомерПоставки;
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0];
		
		НоваяСтрока.ЗаказКлиента = НайденнаяСтрока.ЗаказКлиента;
		НоваяСтрока.АдресДоставки = НайденнаяСтрока.АдресДоставки;
		НоваяСтрока.Втулка = НайденнаяСтрока.Втулка;
		НоваяСтрока.Намотка = НайденнаяСтрока.Намотка;
		НоваяСтрока.Город = НайденнаяСтрока.Город;
		НоваяСтрока.Контрагент = НайденнаяСтрока.Контрагент;
		НоваяСтрока.ЗаявкаНаОтгрузку = НайденнаяСтрока.ЗаявкаНаОтгрузку;
		НоваяСтрока.КодЭтикеткиЗаказчика = НайденнаяСтрока.КодЭтикеткиЗаказчика;
		НоваяСтрока.ЧестныйЗнак = НайденнаяСтрока.ЧестныйЗнак;
		НоваяСтрока.НомерПоставки = НайденнаяСтрока.НомерПоставки;
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 06.12.2017 

Процедура ПереместитьЭлементыМассиваИзНачалаВКонец(Массив) Экспорт // --> Начало Лико Ефимов ЕВВ 06.12.2017
	
	Если ТипЗнч(Массив) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	НовыйМассив = Новый Массив;
	
	КоличествоЭлементовВМассиве = Массив.Количество();
	Для сч = 1 по КоличествоЭлементовВМассиве Цикл
		НовыйМассив.Добавить(Массив[КоличествоЭлементовВМассиве-сч]);
	КонецЦикла;
	Массив = НовыйМассив;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 06.12.2017

Функция ПолучитьТехнологическуюОперациюИРабочийЦентрЭтапа(Этап) Экспорт // --> Начало Лико Ефимов ЕВВ 07.12.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК Ссылка,
	|	ЭтапПроизводства2_2.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ПОМЕСТИТЬ ВТ_МаршрутнаяКарта
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|ГДЕ
	|	ЭтапПроизводства2_2.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехнологическиеОперации.Ссылка КАК ТехнологическаяОперация
	|ИЗ
	|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	|ГДЕ
	|	ТехнологическиеОперации.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_МаршрутнаяКарта.МаршрутнаяКарта
	|			ИЗ
	|				ВТ_МаршрутнаяКарта)
	|	И НЕ ТехнологическиеОперации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехнологическиеОперации.НомерОперации";
	
	Запрос.УстановитьПараметр("Ссылка", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ТехнологическаяОперация;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 07.12.2017

Функция ПолучитьТехнологическуюОперациюДляРабочегоЦентра(РабочийЦентр, Подразделение = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 07.12.2017

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехнологическиеОперации.Ссылка КАК ТехнологическаяОперация
	|ИЗ
	|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	|ГДЕ
	|	НЕ ТехнологическиеОперации.ПометкаУдаления
	|	И ТехнологическиеОперации.РабочийЦентр = &РабочийЦентр
	|	И ТехнологическиеОперации.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхКарт.Действует)
	|	И ТехнологическиеОперации.Владелец.Подразделение = &Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехнологическиеОперации.Владелец.Код УБЫВ,
	|	ТехнологическиеОперации.НомерОперации";
	
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);
	Если Подразделение = Неопределено Тогда
		Запрос.УстановитьПараметр("Подразделение", РабочийЦентр.Лико_Площадка.ПодразделениеПроизводство);
	Иначе
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ТехнологическаяОперация;
	Иначе
		// Создаем новую маршрутную карту
		МаршрутнаяКартаОбъект = Справочники.МаршрутныеКарты.СоздатьЭлемент();
		МаршрутнаяКартаОбъект.Наименование = РабочийЦентр.Наименование;
		// --> Начало Лико Ефимов ЕВВ 24.06.2024
		// В типовой конфе не дает создать тех операцию, если статус маршрутной карты = действует. Поэтому поставим пока "в разработке", а потом поменяем на "Действует"
		//МаршрутнаяКартаОбъект.Статус = Перечисления.СтатусыМаршрутныхКарт.Действует 
		МаршрутнаяКартаОбъект.Статус = Перечисления.СтатусыМаршрутныхКарт.ВРазработке; 
		// <-- Конец Лико Ефимов ЕВВ 24.06.2024
		МаршрутнаяКартаОбъект.Подразделение = Подразделение;
		МаршрутнаяКартаОбъект.ЕдиницаИзмеренияПредварительногоБуфера = Перечисления.ЕдиницыИзмеренияВремени.День;
		МаршрутнаяКартаОбъект.ЕдиницаИзмеренияЗавершающегоБуфера = Перечисления.ЕдиницыИзмеренияВремени.День;
		МаршрутнаяКартаОбъект.ИспользоватьОперации = Истина;
		МаршрутнаяКартаОбъект.ИспользоватьВыходныеИзделия = Ложь;
		МаршрутнаяКартаОбъект.ИспользоватьМатериалы = Ложь;
		МаршрутнаяКартаОбъект.ИспользоватьТрудозатраты = Ложь;
		Попытка
			МаршрутнаяКартаОбъект.Записать();
		Исключение
			Сообщить("Не удалось создать маршрутную карту для РЦ " + РабочийЦентр + ": " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		// Создаем технологическую операцию
		ТехнологическаяОперацияОбъект = Справочники.ТехнологическиеОперации.СоздатьЭлемент();
		ТехнологическаяОперацияОбъект.Владелец = МаршрутнаяКартаОбъект.Ссылка;
		ТехнологическаяОперацияОбъект.Наименование = МаршрутнаяКартаОбъект.Наименование;
		ТехнологическаяОперацияОбъект.НомерОперации = 1;
		ТехнологическаяОперацияОбъект.НомерСледующейОперации = 0;
		ТехнологическаяОперацияОбъект.РабочийЦентр = РабочийЦентр;
		ТехнологическаяОперацияОбъект.ВремяШтучное = 60;
		ТехнологическаяОперацияОбъект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		ТехнологическаяОперацияОбъект.ВремяПЗЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		ТехнологическаяОперацияОбъект.Количество = 1;
		ТехнологическаяОперацияОбъект.Идентификатор = 1;
		Попытка
			ТехнологическаяОперацияОбъект.Записать();
		Исключение
			Сообщить("Не удалось создать технологическую операцию для РЦ " + РабочийЦентр + ": " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		// --> Начало Лико Ефимов ЕВВ 24.06.2024
		// поменяем статус маршрутной карты на "Действует
		МаршрутнаяКартаОбъект.Статус = Перечисления.СтатусыМаршрутныхКарт.Действует;
		Попытка
			МаршрутнаяКартаОбъект.Записать();
		Исключение
			Сообщить("Не удалось изменить статус маршрутной карты для РЦ " + РабочийЦентр + ": " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		// <-- Конец Лико Ефимов ЕВВ 24.06.2024
		
		Возврат ТехнологическаяОперацияОбъект.Ссылка;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 07.12.2017

Функция ПолучитьПараметрыКомандыВнешнегоОтчета(ИмяДопОтчетаВПредопределенныхДанных = "", НаименованиеОтчета = "", ИмяОбъектаОтчета = "") Экспорт // --> Начало Лико Ефимов ЕВВ 22.12.2017 
	
	Если ЗначениеЗаполнено(ИмяДопОтчетаВПредопределенныхДанных) Тогда 
		ДополнительныйОтчет = Справочники.Лико_ПредопределенныеЗначения[ИмяДопОтчетаВПредопределенныхДанных].ЗначениеПараметра;
	ИначеЕсли ЗначениеЗаполнено(ИмяОбъектаОтчета) Тогда
		ДополнительныйОтчет = НайтиДополнительнуюОбработкуПоИмениОбъекта(ИмяОбъектаОтчета);
	ИначеЕсли ЗначениеЗаполнено(НаименованиеОтчета) Тогда
		ДополнительныйОтчет = НайтиДополнительнуюОбработкуПоНаименованию(НаименованиеОтчета);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДополнительныйОтчет) Тогда
		Сообщить("Не заполнено предопределенное значение """ + ИмяДопОтчетаВПредопределенныхДанных + """.");
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(ДополнительныйОтчет) <> Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") ИЛИ ДополнительныйОтчет.Вид <> Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
		Сообщить("В предопределеннм значении """ + ИмяДопОтчетаВПредопределенныхДанных + """ выбраны некорректные данные.");
		Возврат Неопределено;
	КонецЕсли;
	Если ДополнительныйОтчет.Команды.Количество() = 0 Тогда
		Сообщить("В дополниельном отчете """ + ИмяДопОтчетаВПредопределенныхДанных + """ не найдено ни одной команды");
		Возврат Неопределено;
	КонецЕсли;
	Структура = Новый Структура;
	Структура.Вставить("ДополнительнаяОбработкаСсылка", ДополнительныйОтчет);
	Структура.Вставить("ИдентификаторКоманды", ДополнительныйОтчет.Команды[0].Идентификатор);
	Возврат Структура;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 22.12.2017 

Функция ПолучитьПараметрыКомандыВнешнейОбработки(ИмяДопОбработкиВПредопределенныхДанных = "", НаименованиеОбработки = "", ИмяОбъектаОбработки = "") Экспорт // --> Начало Лико Ефимов ЕВВ 22.12.2017 
	
	Если ЗначениеЗаполнено(ИмяДопОбработкиВПредопределенныхДанных) Тогда 
		ДополнительнаяОбработка = Справочники.Лико_ПредопределенныеЗначения[ИмяДопОбработкиВПредопределенныхДанных].ЗначениеПараметра;
	ИначеЕсли ЗначениеЗаполнено(ИмяОбъектаОбработки) Тогда
		ДополнительнаяОбработка = НайтиДополнительнуюОбработкуПоИмениОбъекта(ИмяОбъектаОбработки);
	ИначеЕсли ЗначениеЗаполнено(НаименованиеОбработки) Тогда
		ДополнительнаяОбработка = НайтиДополнительнуюОбработкуПоНаименованию(НаименованиеОбработки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда
		Сообщить("Не заполнено предопределенное значение """ + ИмяДопОбработкиВПредопределенныхДанных + """.");
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(ДополнительнаяОбработка) <> Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") ИЛИ ДополнительнаяОбработка.Вид <> Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка Тогда
		Сообщить("В предопределеннм значении """ + ИмяДопОбработкиВПредопределенныхДанных + """ выбраны некорректные данные.");
		Возврат Неопределено;
	КонецЕсли;
	Если ДополнительнаяОбработка.Команды.Количество() = 0 Тогда
		Сообщить("В дополниельной обработке """ + ИмяДопОбработкиВПредопределенныхДанных + """ не найдено ни одной команды");
		Возврат Неопределено;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Ссылка", ДополнительнаяОбработка);
	Структура.Вставить("Идентификатор", ДополнительнаяОбработка.Ссылка.Команды[0].Идентификатор);
	Структура.Вставить("ЭтоОтчет", ДополнительнаяОбработка.Ссылка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет);
	
	Возврат Структура;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 22.12.2017 

Функция ПолучитьПараметрыОткрытияПечатнойФормы(ИмяДопОбработкиВПредопределенныхДанных = "", НаименованиеОбработки = "", ИмяОбъектаОбработки = "", СсылкаНаОбъект) Экспорт // --> Начало Лико Ефимов ЕВВ 17.10.2018  
	
	Если ЗначениеЗаполнено(ИмяДопОбработкиВПредопределенныхДанных) Тогда 
		ДополнительнаяОбработка = Справочники.Лико_ПредопределенныеЗначения[ИмяДопОбработкиВПредопределенныхДанных].ЗначениеПараметра;
	ИначеЕсли ЗначениеЗаполнено(ИмяОбъектаОбработки) Тогда
		ДополнительнаяОбработка = НайтиДополнительнуюОбработкуПоИмениОбъекта(ИмяОбъектаОбработки);
	ИначеЕсли ЗначениеЗаполнено(НаименованиеОбработки) Тогда
		ДополнительнаяОбработка = НайтиДополнительнуюОбработкуПоНаименованию(НаименованиеОбработки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда
		Сообщить("Не заполнено предопределенное значение """ + ИмяДопОбработкиВПредопределенныхДанных + """.");
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(ДополнительнаяОбработка) <> Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") ИЛИ ДополнительнаяОбработка.Вид <> Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма Тогда
		Сообщить("В предопределеннм значении """ + ИмяДопОбработкиВПредопределенныхДанных + """ выбраны некорректные данные.");
		Возврат Неопределено;
	КонецЕсли;
	Если ДополнительнаяОбработка.Команды.Количество() = 0 Тогда
		Сообщить("В дополниельной обработке """ + ИмяДопОбработкиВПредопределенныхДанных + """ не найдено ни одной команды");
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторКоманды = ДополнительнаяОбработка.Команды[0].Идентификатор;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаНаОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИсточникДанных", ДополнительнаяОбработка);
	ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения", ИдентификаторКоманды, МассивОбъектов));
	ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
	
	Возврат ПараметрыОткрытия;	
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 17.10.2018  

Функция ПолучитьТаблицуКоробокПоНакладной(Распоряжение, СвернутьПоНоменклатуре = Ложь, ПервыйЗаход = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 25.10.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия КАК Серия,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_ВесКоробки КАК ВесКоробки,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_НомерПоставки КАК NКонтракта,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_НаправлениеНамотки КАК Намотка,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_ДатаУпаковки КАК ДатаУпаковки,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_КоличествоКоробок КАК КоличествоКоробок
	|ПОМЕСТИТЬ ВТ_ОтгруженныеСерии
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка
	|			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура
	|			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика = РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
	|	И (ВЫРАЗИТЬ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Документ.РеализацияТоваровУслуг)) = &Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтгруженныеСерии.Ссылка КАК Ссылка,
	|	ВТ_ОтгруженныеСерии.Номенклатура КАК Номенклатура,
	|	ВТ_ОтгруженныеСерии.Номенклатура.Код КАК НоменклатураКод,
	//--> Маковеева А.Ю.
	|" + ?(СвернутьПоНоменклатуре, "", "ВТ_ОтгруженныеСерии.Характеристика КАК Характеристика,") + "
	//<-- Маковеева А.Ю.
	|	СУММА(ВТ_ОтгруженныеСерии.КоличествоКоробок) КАК КоличествоКоробок,
	|	МАКСИМУМ(ВТ_ОтгруженныеСерии.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
	|	МАКСИМУМ(ВТ_ОтгруженныеСерии.NКонтракта) КАК NКонтракта,
	|	МАКСИМУМ(ВТ_ОтгруженныеСерии.ДатаУпаковки) КАК МаксимальнаяДатаУпаковки,
	|	МАКСИМУМ(ВТ_ОтгруженныеСерии.ЧестныйЗнак) КАК ЧестныйЗнак,
	|	МАКСИМУМ(ВТ_ОтгруженныеСерии.Намотка) КАК Намотка,
	|	МИНИМУМ(ВТ_ОтгруженныеСерии.ДатаУпаковки) КАК МинимальнаяДатаУпаковки,
	|	СУММА(ВТ_ОтгруженныеСерии.ВесКоробки) КАК ВесКоробок
	|ИЗ
	|	ВТ_ОтгруженныеСерии КАК ВТ_ОтгруженныеСерии
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтгруженныеСерии.Ссылка,
	|	ВТ_ОтгруженныеСерии.Номенклатура,
	|	ВТ_ОтгруженныеСерии.Номенклатура.Код
	//--> Маковеева А.Ю.
	|	" + ?(СвернутьПоНоменклатуре, "", ",ВТ_ОтгруженныеСерии.Характеристика");
	//<-- Маковеева А.Ю.
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", "ПеремещениеТоваров");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// --> Начало Лико Ефимов ЕВВ 14.10.2019
	Если РезультатЗапроса.Пустой() И ПервыйЗаход И ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Может быть это Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона, попробуем найти для этой реализации связанное перемещение, а потом для перемещения выполнить запрос еще раз	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_СвязиСТиповымиДокументамиРеализация.Документ КАК ЗаявкаНаТр,
		|	Лико_СвязиСТиповымиДокументамиРеализация.ТиповойДокумент КАК Реализация,
		|	Лико_СвязиСТиповымиДокументамиПеремещение.ТиповойДокумент КАК Перемещение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументамиРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументамиПеремещение
		|		ПО ((ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументамиРеализация.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку)) = (ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументамиПеремещение.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку)))
		|			И (Лико_СвязиСТиповымиДокументамиПеремещение.ТиповойДокумент ССЫЛКА Документ.ПеремещениеТоваров)
		|ГДЕ
		|	(ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументамиРеализация.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг)) = &Реализация
		|	И Лико_СвязиСТиповымиДокументамиРеализация.Документ ССЫЛКА Документ.Лико_ЗаявкаНаТранспортировку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Характеристика КАК Характеристика,
		|	СУММА(ТЧ.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ТЧ
		|		ПО ВТ.Реализация = ТЧ.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Характеристика КАК Характеристика,
		|	СУММА(ТЧ.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ТЧ
		|		ПО ВТ.Перемещение = ТЧ.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ЗаявкаНаТр КАК ЗаявкаНаТр,
		|	ВТ.Реализация КАК Реализация,
		|	ВТ.Перемещение КАК Перемещение
		|ИЗ
		|	ВТ КАК ВТ";
		
		Запрос.УстановитьПараметр("Реализация", Распоряжение);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		КоличествоПакетов = РезультатыЗапроса.Количество();
		ВыборкаДокументы = РезультатыЗапроса[КоличествоПакетов-1].Выбрать();
		Если ВыборкаДокументы.Следующий() Тогда
			// Перемещение найдено. На всякий случай проверим, совпадают ли таблицы товаров по количеству
			ТаблицаТоваровПеремещения = РезультатыЗапроса[КоличествоПакетов-2].Выгрузить();
			ТаблицаТоваровРеализации = РезультатыЗапроса[КоличествоПакетов-3].Выгрузить();
			Если НЕ СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТаблицаТоваровПеремещения, ТаблицаТоваровРеализации) Тогда
				// Таблицы товаров совпадают по количеству
				Возврат ПолучитьТаблицуКоробокПоНакладной(ВыборкаДокументы.Перемещение, СвернутьПоНоменклатуре, Ложь);
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 14.10.2019
	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 25.10.2017

Процедура ОтметитьВыполнениеЭтапаПлана(СтруктураИзмерений, Источник = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 21.01.2018
	
	УстановитьПривилегированныйРежим(Истина);
	// Установим Выполнено = 1
	МенеджерЗаписи = РегистрыСведений.ПооперационноеРасписание2_2.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураИзмерений);
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Выполнено = 1;
	МенеджерЗаписи.МожноВыполнять = 0;
	МенеджерЗаписи.Выполняется = 0;
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		Если Источник = Неопределено Тогда
			Сообщить("Не удалось отметить выполнение плана для документа """ + СтруктураИзмерений.Этап + """: " + ОписаниеОшибки());
		Иначе
			Сообщить("" + Источник + """ - не удалось отметить выполнение плана для документа """ + СтруктураИзмерений.Этап + """: " + ОписаниеОшибки());
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	Лико_Дополнительно.ИзменитьСтатусЭтапаПроизводстваВФоне(СтруктураИзмерений.Этап, Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);
	
	Если НЕ (ЗначениеЗаполнено(Источник) И ТипЗнч(Источник) = Тип("ДокументСсылка.Лико_ЗакрытиеЗаказа")) И НЕ МенеджерЗаписи.Моделирование Тогда
		ДействияПослеВыполненияЭтапаПлана(СтруктураИзмерений);
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 21.01.2018

Процедура ДействияПослеВыполненияЭтапаПлана(СтруктураИзмерений, ПересчитыватьМассивРЦ = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 21.01.2018

	УстановитьПривилегированныйРежим(Истина);
	
	НомерПроката = СтруктураИзмерений.Этап.НомерПроката;
	НужноСоздаватьЗапись = Ложь;
	Если НомерПроката = 1 Тогда
		ПриОкончании1ПрокатаАвтоматическиСтавить2ПрокатНаРЦИзЗаказа = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СтруктураИзмерений.РабочийЦентр, "ПриОкончании1ПрокатаАвтоматическиСтавить2ПрокатНаРЦИзЗаказа", Ложь);
		ПриОкончании1ПрокатаАвтоматическиСтавить2ПрокатНаРЦИзВида = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СтруктураИзмерений.РабочийЦентр, "ПриОкончании1ПрокатаАвтоматическиСтавить2ПрокатНаРЦИзВида_50aea5f3d5ab4aaa8f8cc54b1c38b29a", Ложь);
		Если ПриОкончании1ПрокатаАвтоматическиСтавить2ПрокатНаРЦИзЗаказа Тогда
			ЗаказКлиента = НайтиЗаказКлиентаПоЭтапу(СтруктураИзмерений.Этап);
			РабочийЦентр = НайтиРабочийЦентрВЗаказеКлиентаПоПрокату(ЗаказКлиента, НомерПроката + 1);
			Если ЗначениеЗаполнено(РабочийЦентр) Тогда
				Этап = НайтиЭтапВСвободныхПоЗаказуИНомеруПроката(ЗаказКлиента, НомерПроката + 1);
				Если ЗначениеЗаполнено(Этап) Тогда
					// Этап в свободных. Поставим его в конец рабочего центра
					НужноСоздаватьЗапись = Истина;
				КонецЕсли;		
			КонецЕсли;
		ИначеЕсли ПриОкончании1ПрокатаАвтоматическиСтавить2ПрокатНаРЦИзВида Тогда
			ЗаказКлиента = НайтиЗаказКлиентаПоЭтапу(СтруктураИзмерений.Этап);
			РабочийЦентр2Проката = НайтиРабочийЦентрВЗаказеКлиентаПоПрокату(ЗаказКлиента, НомерПроката + 1);
			Если ЗначениеЗаполнено(РабочийЦентр2Проката) Тогда
				РабочийЦентр = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, РабочийЦентр2Проката.ВидРабочегоЦентра, "РЦДляАвтоматическогоДобавленияВПлан_96d4092e2c7d4dd9b8d1a62050693235");
				Если ЗначениеЗаполнено(РабочийЦентр) Тогда
					// Поищем второй прокат по этому заказу в свободных этапах и запланируем его на выбранный РЦ
					Этап = НайтиЭтапВСвободныхПоЗаказуИНомеруПроката(ЗаказКлиента, НомерПроката + 1);
					Если ЗначениеЗаполнено(Этап) Тогда
						// Этап в свободных. Поставим его в конец рабочего центра
						НужноСоздаватьЗапись = Истина;
					КонецЕсли;		
				КонецЕсли;
			КонецЕсли;
		Иначе
			РабочийЦентр = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СтруктураИзмерений.РабочийЦентр, "ПриОкончании1ПрокатаАвтоматическиСтавить2ПрокатНа_d878d18c49ff40439d480374b4352c09");
			Если ЗначениеЗаполнено(РабочийЦентр) Тогда
				// Поищем второй прокат по этому заказу в свободных этапах и запланируем его на выбранный РЦ
				ЗаказКлиента = НайтиЗаказКлиентаПоЭтапу(СтруктураИзмерений.Этап);
				Этап = НайтиЭтапВСвободныхПоЗаказуИНомеруПроката(ЗаказКлиента, НомерПроката + 1);
				Если ЗначениеЗаполнено(Этап) Тогда
					// Этап в свободных. Поставим его в конец рабочего центра
					НужноСоздаватьЗапись = Истина;
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли НомерПроката = 2 Тогда
		ПриОкончании2ПрокатаАвтоматическиСтавить3ПрокатНаРЦИзЗаказа = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СтруктураИзмерений.РабочийЦентр, "ПриОкончании2ПрокатаАвтоматическиСтавить3ПрокатНаРЦИзЗаказа_1a6a40fe4f3c42bb8681c7539041ba21", Ложь);
		Если ПриОкончании2ПрокатаАвтоматическиСтавить3ПрокатНаРЦИзЗаказа Тогда
			ЗаказКлиента = НайтиЗаказКлиентаПоЭтапу(СтруктураИзмерений.Этап);
			РабочийЦентр = НайтиРабочийЦентрВЗаказеКлиентаПоПрокату(ЗаказКлиента, НомерПроката + 1);
			Если ЗначениеЗаполнено(РабочийЦентр) Тогда
				// Поищем третий прокат по этому заказу в свободных этапах и запланируем его на РЦ из заказа
				Этап = НайтиЭтапВСвободныхПоЗаказуИНомеруПроката(ЗаказКлиента, НомерПроката + 1);
				Если ЗначениеЗаполнено(Этап) Тогда
					// Этап в свободных. Поставим его в конец рабочего центра
					НужноСоздаватьЗапись = Истина;
				КонецЕсли;		
			КонецЕсли;		
		Иначе
			РабочийЦентр = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СтруктураИзмерений.РабочийЦентр, "ПриОкончании2ПрокатаАвтоматическиСтавить3ПрокатНа_29a734cf05614d529cdf592593127f44");
			Если ЗначениеЗаполнено(РабочийЦентр) Тогда
				// Поищем третий прокат по этому заказу в свободных этапах и запланируем его на выбранный РЦ
				ЗаказКлиента = НайтиЗаказКлиентаПоЭтапу(СтруктураИзмерений.Этап);
				Этап = НайтиЭтапВСвободныхПоЗаказуИНомеруПроката(ЗаказКлиента, НомерПроката + 1);
				Если ЗначениеЗаполнено(Этап) Тогда
					// Этап в свободных. Поставим его в конец рабочего центра
					НужноСоздаватьЗапись = Истина;
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НужноСоздаватьЗапись Тогда
		ДобавитьЭтапПроизводстваВКонецПлана(Этап, РабочийЦентр, ЗаказКлиента, НомерПроката + 1);
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 23.09.2019
	Если ПересчитыватьМассивРЦ Тогда
		МассивРЦ = Новый Массив;
		МассивРЦ.Добавить(СтруктураИзмерений.РабочийЦентр);
		ПересчитатьМассивРЦВПлане(МассивРЦ);
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 23.09.2019
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 21.01.2018

Процедура ДобавитьЭтапПроизводстваВКонецПлана(Этап, РабочийЦентр, ЗаказКлиента, НомерПроката = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если НомерПроката = Неопределено Тогда
		НомерПроката = Этап.НомерПроката;
	КонецЕсли;
	
	Подразделение = РабочийЦентр.ВидРабочегоЦентра.Подразделение;
	РеквизитыРЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочийЦентр, "ВидРабочегоЦентра,КоэффициентВремениРаботы,Лико_КоэффициентВремениПодготовки");
	Если РеквизитыРЦ.Лико_КоэффициентВремениПодготовки = 0 Тогда
		РеквизитыРЦ.Лико_КоэффициентВремениПодготовки = РеквизитыРЦ.КоэффициентВремениРаботы;
	КонецЕсли;
	//+ Лико m.shenderov 13.09.2021
	//Пока для гравировального участка ставим 60 мин.
	Если РеквизитыРЦ.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.ГравировальныйУчасток Тогда 
		ПродолжительностьМинут=60;
		ПродолжительностьПодготовкиМинут = ПродолжительностьМинут;
	Иначе
	//- Лико m.shenderov 13.09.2021
		ПараметрыРЦ = Лико_Планирование.ПараметрыПоРЦ(Этап, РабочийЦентр, ЗаказКлиента, НомерПроката);
		Если ЗначениеЗаполнено(ПараметрыРЦ) Тогда
			ПродолжительностьМинут = ПараметрыРЦ.Время * РеквизитыРЦ.КоэффициентВремениРаботы;
			ПродолжительностьПодготовкиМинут = ПараметрыРЦ.Время * РеквизитыРЦ.Лико_КоэффициентВремениПодготовки;
		Иначе
			ПродолжительностьМинут = Этап.КоэффициентМаршрутнойКарты * 60;
			ПродолжительностьПодготовкиМинут = ПродолжительностьМинут;
		КонецЕсли;
	КонецЕсли;
	
	// Проверим, что этапа сейчас нет в плане
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПооперационноеРасписание2_2.Этап КАК Этап
		|ИЗ
		|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
		|ГДЕ
		|	ПооперационноеРасписание2_2.Этап = &Этап";
	Запрос.УстановитьПараметр("Этап", Этап);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// Этап производства уже есть в плане, ничего не делаем
		Возврат;
	КонецЕсли;

	СтруктураОкончанийПредыдущейСтроки = НайтиОкончаниеПоследнейЗаписиПланаПоРЦ(РабочийЦентр);
	МенеджерЗаписи = РегистрыСведений.ПооперационноеРасписание2_2.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Этап = Этап;
	МенеджерЗаписи.Операция = ПолучитьТехнологическуюОперациюДляРабочегоЦентра(РабочийЦентр, Подразделение);
	МенеджерЗаписи.ИдентификаторОперации = 1;
	МенеджерЗаписи.НомерПартии = 1;
	МенеджерЗаписи.РабочийЦентр = РабочийЦентр;
	МенеджерЗаписи.ЭтоУдалениеОперации = Ложь;
	МенеджерЗаписи.Начало = СтруктураОкончанийПредыдущейСтроки.Окончание;
	МенеджерЗаписи.Окончание = МенеджерЗаписи.Начало + ПродолжительностьМинут * 60;
	МенеджерЗаписи.ВремяПлан = МенеджерЗаписи.Окончание - МенеджерЗаписи.Начало;
	МенеджерЗаписи.КоличествоПартии = 1;
	МенеджерЗаписи.Коэффициент = 1;
	МенеджерЗаписи.МожноВыполнять = 1;
	МенеджерЗаписи.Подразделение = Подразделение;
	МенеджерЗаписи.ЛеваяГраница = СтруктураОкончанийПредыдущейСтроки.ПраваяГраница;
	МенеджерЗаписи.ПраваяГраница = МенеджерЗаписи.ЛеваяГраница + ПродолжительностьПодготовкиМинут * 60;
	МенеджерЗаписи.ДлительностьИнтервала = МенеджерЗаписи.ПраваяГраница - МенеджерЗаписи.ЛеваяГраница;
	МенеджерЗаписи.Моделирование = Ложь;
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		Сообщить("Не удалось добавить в план этап """ + Этап + """: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиЭтапВСвободныхПоЗаказуИНомеруПроката(Заказ, НомерПроката) Экспорт // --> Начало Лико Ефимов ЕВВ 21.01.2018
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК Этап,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2ИщемЭтап.Этап ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтапЕстьВПлане
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2ИщемЭтап
	|		ПО ЭтапПроизводства2_2.Ссылка = ПооперационноеРасписание2_2ИщемЭтап.Этап
	|ГДЕ
	|	ЭтапПроизводства2_2.Лико_ЗаказКлиента = &Заказ
	|	И ЭтапПроизводства2_2.НомерПроката = &НомерПроката
	|	И ЭтапПроизводства2_2.Проведен";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если НЕ ВыборкаДетальныеЗаписи.ЭтапЕстьВПлане Тогда
			Возврат ВыборкаДетальныеЗаписи.Этап;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 21.01.2018

Функция НайтиОкончаниеПоследнейЗаписиПланаПоРЦ(РабочийЦентр) Экспорт // --> Начало Лико Ефимов ЕВВ 21.01.2018

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПооперационноеРасписание2_2.Окончание КАК Окончание,
	|	ПооперационноеРасписание2_2.ПраваяГраница КАК ПраваяГраница
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.РабочийЦентр = &РабочийЦентр
	|	И НЕ ПооперационноеРасписание2_2.ЭтоУдалениеОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Окончание УБЫВ";
	
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекущаяДата = ТекущаяДата();
	СтруктураВозврата = Новый Структура("Окончание,ПраваяГраница", ТекущаяДата, ТекущаяДата);
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Окончание = Макс(Выборка.Окончание, ТекущаяДата);
		СтруктураВозврата.ПраваяГраница = Макс(Выборка.ПраваяГраница, ТекущаяДата);
		Возврат СтруктураВозврата;
	Иначе
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 21.01.2018

Процедура ПересчитатьМассивРЦВПлане(МассивРЦ) Экспорт
	
	Попытка
		Если МассивРЦ.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("Лико_ПланированиеРабочихЦентровЕРП");
		ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
		ДвоичныеДанные.Записать(ИмяФайла);
		ВнешняяОбработкаПлан = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
		ВнешняяОбработкаПлан.ПересчитатьМассивРЦВПлане(МассивРЦ);
		УдалитьФайлы(ИмяФайла);
		а=0;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция УдалитьЭтапПроизводстваИзПлана(Этап, Комментарий = "", ПересчитыватьРЦ = Истина, ЭтоАннулированиеЗаказа = Ложь, ДобавитьВКонецПлана = Ложь, ИзОчередиКУдалению = Ложь, ОтметитьВыполнение = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		НовыйСтатус = Неопределено;
		Если НЕ ЭтоАннулированиеЗаказа И Этап.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен И НЕ ОтметитьВыполнение Тогда
			НовыйСтатус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
		ИначеЕсли (ЭтоАннулированиеЗаказа ИЛИ ОтметитьВыполнение)
			И Этап.Статус <> Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
			НовыйСтатус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(НовыйСтатус) Тогда	
			ЭтапОбъект = Этап.ПолучитьОбъект();
			ЭтапОбъект.Статус = НовыйСтатус;
			ЭтапОбъект.Комментарий = ?(ЗначениеЗаполнено(ЭтапОбъект.Комментарий), Символы.ПС, "") + "При удалении этапа из плана у документа изменен статус";
			ЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПооперационноеРасписание2_2.Этап КАК Этап,
	|	ПооперационноеРасписание2_2.Операция КАК Операция,
	|	ПооперационноеРасписание2_2.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ПооперационноеРасписание2_2.НомерПартии КАК НомерПартии,
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
	|	ПооперационноеРасписание2_2.МодельРасписания КАК МодельРасписания,
	|	ПооперационноеРасписание2_2.МодельПланирования КАК МодельПланирования,
	|	ПооперационноеРасписание2_2.ЭтоУдалениеОперации КАК ЭтоУдалениеОперации,
	|	ПооперационноеРасписание2_2.Начало КАК Начало,
	|	ПооперационноеРасписание2_2.Окончание КАК Окончание,
	|	ПооперационноеРасписание2_2.ТактПараллельнойЗагрузки КАК ТактПараллельнойЗагрузки,
	|	ПооперационноеРасписание2_2.Моделирование КАК Моделирование
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Этап = &Этап
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПооперационноеРасписание2_2.Моделирование УБЫВ";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Моделирование Тогда
			// В данный момент идет планирование, удалять записи нельзя. Нужно добавить запись в очередь к удалению
			МенеджерЗаписи = РегистрыСведений.Лико_ОчередьЭтаповДляУдаленияИзПлана.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Этап = Этап;
			МенеджерЗаписи.Комментарий = Комментарий;
			МенеджерЗаписи.ДобавитьВКонецПлана = ДобавитьВКонецПлана;
			МенеджерЗаписи.ОтметитьВыполнение = ОтметитьВыполнение;
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
			КонецПопытки;
			
			Возврат Ложь;
		ИначеЕсли ОтметитьВыполнение Тогда
			ОтметитьВыполнениеЭтапаПлана(ВыборкаДетальныеЗаписи);
		Иначе
			// Убираем запись
			МенеджерЗаписи = РегистрыСведений.ПооперационноеРасписание2_2.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
			МенеджерЗаписи.Прочитать();
			Попытка
				МенеджерЗаписи.Удалить();	
			Исключение
			КонецПопытки;
			Если ДобавитьВКонецПлана Тогда
				ДобавитьЭтапПроизводстваВКонецПлана(Этап, ВыборкаДетальныеЗаписи.РабочийЦентр, Этап.Лико_ЗаказКлиента);
			КонецЕсли;
			МассивРЦ = Новый Массив;
			МассивРЦ.Добавить(ВыборкаДетальныеЗаписи.РабочийЦентр);
			Если ПересчитыватьРЦ Тогда
				ПересчитатьМассивРЦВПлане(МассивРЦ);
			КонецЕсли;
			
			Если ЭтоАннулированиеЗаказа И НЕ ДобавитьВКонецПлана И НЕ ИзОчередиКУдалению Тогда
				// Несмотря на то, что запись получилось убрать, все равно добавим ее в регистр очереди к удалению (были случаи, когда заказ не уходил из плана)
				МенеджерЗаписи = РегистрыСведений.Лико_ОчередьЭтаповДляУдаленияИзПлана.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Этап = Этап;
				МенеджерЗаписи.Комментарий = Комментарий;
				МенеджерЗаписи.ДобавитьВКонецПлана = ДобавитьВКонецПлана;
				Попытка
					МенеджерЗаписи.Записать(Истина);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Сюда заходит обработка "Планирование рабочих центров" в момент сохранения плана в регистр в том случае, если поменялся рабочий центр
//
// Параметры:
//  Заказ - Документ.ЗаказКлиента - Заказ, на основании которого создан этап
//  Этап - Документ.ЭтапПроизводства2_2 - Этап производства, для которого поменялся рабочий центр
//  НомерПроката - Число - реквизит НомерПроката из документа Этап
//  РЦНовый - СправочникСсылка.РабочиеЦентры, Строка - Новый рабочий центр. Может быть равен строке "Свободный" или "Снятый" - это значит, что он удаляется из регистра ПооперационноеРасписание2_2
//  РЦСтарый - СправочникСсылка.РабочиеЦентры, Неопределено - Старый рабочий центр. Если этап поставили из свободных или снятых, то равен Неопределено
//
Процедура ДействияПослеИзмененияРабочегоЦентраЭтапа(Заказ, Этап, НомерПроката, РЦНовый, РЦСтарый = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 06.02.2018
	Структура = Новый Структура;
	Структура.Вставить("ЗаказКлиента",Заказ);
	Структура.Вставить("НомерПроката",НомерПроката);
	Структура.Вставить("РабочийЦентр",РЦНовый);
	
	Документы.Лико_ПодготовкаМатериалов.ФормированиеДокументаПодготовкаМатериаловПриПланированииРЦ(Структура);
	
	//+ Лико m.shenderov 15.02.2018
	АктуализацияРезерваМатериаловПоЗаказу(Заказ);
	//- Лико m.shenderov 15.02.2018
	
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 06.02.2018

Функция ПолучитьТУПроизводителя(Заказ = Неопределено, НомерЗаказа = "") Экспорт // --> Начало Лико Ефимов ЕВВ 13.02.2018 
	Перем РезультатТУ;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатТУ = Новый Структура("ТУ, ТипЭтикетки, НомерЗаказа, ГарантийныйСрок", "", "", "", "");
	
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Заказ = НайтиДокументПоНомеру7Символов(НомерЗаказа, "ЗаказКлиента");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерЗаказа) Тогда
		НомерЗаказа = Заказ.НомерБезПрефикса;
	КонецЕсли;
	
	//
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.Ликофлекс)
	|				ТОГДА ВЫБОР
	|						КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка)
	|							ТОГДА ""ТУ 9570-001-13866117-2009""
	|						КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.ВплавляемаяЭтикетка)
	|							ТОГДА ""ТУ 9570-005-13866117-2014""
	|						КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Термоусадка)
	|							ТОГДА ""ТУ 9570-003-13866117-2006""
	|						КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Упаковка)
	|							ТОГДА ""ТУ 9570-006-13866117-2014""
	|						ИНАЧЕ ДопРеквизитНомерТУ.Значение
	|					КОНЕЦ
	|			КОГДА ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.Урал)
	|				ТОГДА ВЫБОР
	|						КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка)
	|							ТОГДА ""ТУ 18.12.15-001-16891509-2017""
	|						КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Упаковка)
	|							ТОГДА ""ТУ 9572-002-16891509-01""
	|						ИНАЧЕ ДопРеквизитНомерТУ.Значение
	|					КОНЕЦ
	|			КОГДА ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.Сибирь)
	|				ТОГДА ДопРеквизитНомерТУ.Значение
	|			КОГДА ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ИксПак)
	|				ТОГДА ДопРеквизитНомерТУ.Значение
	|			КОГДА ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.Линкс)
	|				ТОГДА ДопРеквизитНомерТУ.Значение
	|		КОНЕЦ, ""ТУ 9570-001-13866117-2009"") КАК ТУ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка)
	|			ТОГДА ""самоклеящиеся""
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.ВплавляемаяЭтикетка)
	|			ТОГДА ""вплавляемые""
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Термоусадка)
	|			ТОГДА ""термоусадочные""
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Упаковка)
	|			ТОГДА ""круговые""
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Пакеты)
	|			ТОГДА ""пакеты""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипЭтикетки,
	|	ВЫБОР
	// --> Начало Лико Ефимов ЕВВ 03.06.2021 письмо 03, 06, 2021 13:39 
	|		КОГДА ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ИксПак)
	|			ТОГДА ""6 мес.""
	// <-- Конец Лико Ефимов ЕВВ 03.06.2021 
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка)
	|			ТОГДА ""1 год""
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.ВплавляемаяЭтикетка)
	|			ТОГДА ""6 мес.""
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Термоусадка)
	// --> Начало Лико Ефимов ЕВВ 03.06.2021 
	//|			ТОГДА ВЫБОР
	//|					КОГДА ЗаказКлиента.Площадка = &ОрганизацияИксПак
	//|						ТОГДА ""1 год""
	//|					ИНАЧЕ ""6 мес.""
	//|				КОНЕЦ
	|			ТОГДА ""6 мес.""
	// <-- Конец Лико Ефимов ЕВВ 03.06.2021 
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Упаковка)
	|			ТОГДА ""1 год""
	|		КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Пакеты)
	|			ТОГДА ""6 мес.""
	|		ИНАЧЕ ""1 год""
	|	КОНЕЦ КАК ГарантийныйСрок,
	|	ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
	|	ЗаказКлиента.Площадка КАК Площадка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ДополнительныеРеквизиты КАК ДопРеквизитНомерТУ
	|		ПО ЗаказКлиента.Площадка.Организация = ДопРеквизитНомерТУ.Ссылка
	|			И (ДопРеквизитНомерТУ.Свойство = &СвойствоНомерТУ)
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	//Запрос.УстановитьПараметр("ОрганизацияЛикофлекс", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);
	//Запрос.УстановитьПараметр("ОрганизацияАвантаж", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра);
	//Запрос.УстановитьПараметр("ОрганизацияЭкофлекс", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра);
	//Запрос.УстановитьПараметр("ОрганизацияИксПак", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра);
	Запрос.УстановитьПараметр("СвойствоНомерТУ", Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитОрганизацииНомерТУЭтикетки.ЗначениеПараметра);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Результат.Следующий();
	
	Если Результат <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(РезультатТУ, Результат);
		
	КонецЕсли;
	
	Возврат РезультатТУ;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 13.02.2018 

Процедура Лико_ДополнитьРезультатПоТЧДополнительнымиДанными(РезультатПоТабличнойЧастиИлиТз, МассивОбъектов = Неопределено, СНомеромКонтракта = Ложь, СКодомЭтикеткиЗаказчика = Ложь, СвернутьПоНаименованиюНоменклатуры = Ложь, ВЗаказахМогутБытьОдинаковыеКодыЭтикетокЗаказчикаИлиНомераПоставки = Ложь, МенятьКодЭтикеткиЗаказчикаНаКодНоменклатурыПриОтсутствии = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 11.02.2018

	// СКодомЭтикеткиЗаказчика нужен всегда
	//СКодомЭтикеткиЗаказчикаТек = ?(СКодомЭтикеткиЗаказчика, Истина, Ложь);
	СКодомЭтикеткиЗаказчикаТек = Истина;
	
	Если ТипЗнч(РезультатПоТабличнойЧастиИлиТз) <> Тип("ТаблицаЗначений") Тогда
		ТЗ = РезультатПоТабличнойЧастиИлиТз.Выгрузить();
	Иначе
		ТЗ = РезультатПоТабличнойЧастиИлиТз;
	КонецЕсли;
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	// Проставим номер строки
	НомерСтроки = 0;
	Для каждого Строка из ТЗ Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			НомерСтроки = 0;
			Продолжить;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
		Строка.НомерСтроки = НомерСтроки;
	КонецЦикла;
	ПерваяСтрока = ТЗ[0];
	ИтоговоеПоле = "Ссылка";
	ИмяПоляСклад = "Склад";
	Если ТЗ.Колонки.Найти("ТранспортнаяНакладная") <> Неопределено Тогда
		// Скорее всего это ТранспортнаяНакладная, у нее итог по полю ПорядковыйНомер
		ПерваяСтрока = ТЗ[1];
		Тип = "ТранспортнаяНакладная";
		Реализация = ПерваяСтрока.Ссылка;
		ИмяПоляХарактеристика = "Характеристика";
		ИтоговоеПоле = "ПорядковыйНомер";
		Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИмяПоляСклад = "СкладОтправитель";
		КонецЕсли;
	ИначеЕсли ТипЗнч(ПерваяСтрока.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Тип = "Реализация";
		Реализация = ПерваяСтрока.Ссылка;
		ИмяПоляХарактеристика = "Характеристика";
	ИначеЕсли ТипЗнч(ПерваяСтрока.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Тип = "СчетФактура";
		Реализация = ПерваяСтрока.Ссылка.ДокументОснование;
		Если ТипЗнч(Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Для каждого СтрокаОснования из ПерваяСтрока.Ссылка.ДокументыОснования Цикл
				Если ТипЗнч(СтрокаОснования.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					Реализация = СтрокаОснования.ДокументОснование;
					Прервать;
				КонецЕсли;		
			КонецЦикла;
		КонецЕсли;
		Если ТипЗнч(Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Возврат;
		КонецЕсли;
		ИмяПоляХарактеристика = "Характеристика";
	ИначеЕсли ТипЗнч(ПерваяСтрока.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуКлиенту") Тогда
		Если ТипЗнч(ПерваяСтрока.Ссылка.ДокументОснование) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Возврат;
		КонецЕсли;
		Тип = "СчетНаОплату";
		Реализация = ПерваяСтрока.Ссылка.ДокументОснование;
		ИмяПоляХарактеристика = "ХарактеристикаСсылка";
	ИначеЕсли ТипЗнч(ПерваяСтрока.Ссылка) = Тип("ДокументСсылка.Лико_СчетНаОплатуКлиенту") Тогда
		Тип = "СчетНаПредоплату";
		Реализация = Неопределено;
		ИмяПоляХарактеристика = "ХарактеристикаСсылка";
	ИначеЕсли ТипЗнч(ПерваяСтрока.Ссылка) = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения") Тогда
		// В отгрузкеТоваровСХранения итог 2 уровня
		// <-- Начало Лико Яцун С. В. 13.01.2025
		//Если нет колонки "Склад" значит печать Паспорта качества иначе МХ3
		Если ТЗ.Колонки.Найти("Склад") <> Неопределено Тогда 
			// <-- Конец Лико Яцун С. В. 13.01.2025
			ПерваяСтрока = ТЗ[2];
			ИтоговоеПоле = "Ссылка,Склад";
		КонецЕсли;
		Тип = "Реализация";
		Реализация = ПерваяСтрока.Ссылка;
		ИмяПоляХарактеристика = "Характеристика";
	Иначе
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ИмяПоляХарактеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ТаблицаТоваров.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТаблицаТоваров
	|ГДЕ
	|	НЕ ТаблицаТоваров.НомерСтроки ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Количество КАК Количество,
	|	&Реализация КАК Реализация
	|ПОМЕСТИТЬ ВТ_СРеализацией
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия КАК Серия,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_КоличествоКоробок КАК КоличествоКоробок
	|ПОМЕСТИТЬ ВТ_ССериями
	|ИЗ
	|	ВТ_СРеализацией КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|			ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка
	|				И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура
	|				И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика = РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика
	|		ПО ВТ.Реализация = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	|			И ВТ.Номенклатура = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура
	|			И ВТ.Характеристика = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	МИНИМУМ(ЕСТЬNULL(ВТ.Серия.Лико_ДатаУпаковки, ДАТАВРЕМЯ(1, 1, 1))) КАК МинимальнаяДатаУпаковки,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ.Серия.Лико_ДатаУпаковки, ДАТАВРЕМЯ(1, 1, 1))) КАК МаксимальнаяДатаУпаковки
	|ПОМЕСТИТЬ ВТ_СДатойУпаковки
	|ИЗ
	|	ВТ_ССериями КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.Реализация,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Номенклатура.Код КАК НоменклатураКод,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Серия.Лико_НомерПоставки КАК NКонтракта,
	|	ВТ.Серия.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ.Серия.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВТ.Серия.Лико_НаправлениеНамотки КАК Намотка,
	|	МИНИМУМ(ВТ_СДатойУпаковки.МинимальнаяДатаУпаковки) КАК МинимальнаяДатаУпаковки,
	|	МАКСИМУМ(ВТ_СДатойУпаковки.МаксимальнаяДатаУпаковки) КАК МаксимальнаяДатаУпаковки,
	|	СУММА(ВТ.Серия.Лико_ВесКоробки) КАК ВесКоробок,
	|	СУММА(ВТ.КоличествоКоробок) КАК КоличествоКоробок,
	|	СУММА(ВТ.Серия.Лико_КоличествоВУпаковке) КАК КоличествоВУпаковке
	|ИЗ
	|	ВТ_ССериями КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СДатойУпаковки КАК ВТ_СДатойУпаковки
	|		ПО ВТ.Ссылка = ВТ_СДатойУпаковки.Ссылка
	|			И ВТ.Реализация = ВТ_СДатойУпаковки.Реализация
	|			И ВТ.Номенклатура = ВТ_СДатойУпаковки.Номенклатура
	|			И ВТ.Характеристика = ВТ_СДатойУпаковки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.Реализация,
	|	ВТ.НомерСтроки,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика,
	|	ВТ.Серия.Лико_КодЭтикеткиЗаказчика,
	|	ВТ.Серия.Лико_ЧестныйЗнак,
	|	ВТ.Серия.Лико_НаправлениеНамотки,
	|	ВТ.Серия.Лико_НомерПоставки,
	|	ВТ.Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Номенклатура.Код КАК НоменклатураКод,
	|	ВТ.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТ.Серия.Лико_НомерПоставки) КАК NКонтракта,
	|	МАКСИМУМ(ВТ.Серия.Лико_КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
	|	МАКСИМУМ(ВТ.Серия.Лико_ЧестныйЗнак) КАК ЧестныйЗнак,
	|	МАКСИМУМ(ВТ.Серия.Лико_НаправлениеНамотки) КАК Намотка,
	|	МИНИМУМ(ВТ_СДатойУпаковки.МинимальнаяДатаУпаковки) КАК МинимальнаяДатаУпаковки,
	|	МАКСИМУМ(ВТ_СДатойУпаковки.МаксимальнаяДатаУпаковки) КАК МаксимальнаяДатаУпаковки,
	|	СУММА(ВТ.Серия.Лико_ВесКоробки) КАК ВесКоробок,
	|	СУММА(ВТ.КоличествоКоробок) КАК КоличествоКоробок,
	|	СУММА(ВТ.Серия.Лико_КоличествоВУпаковке) КАК КоличествоВУпаковке
	|ИЗ
	|	ВТ_ССериями КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СДатойУпаковки КАК ВТ_СДатойУпаковки
	|		ПО ВТ.Ссылка = ВТ_СДатойУпаковки.Ссылка
	|			И ВТ.Реализация = ВТ_СДатойУпаковки.Реализация
	|			И ВТ.Номенклатура = ВТ_СДатойУпаковки.Номенклатура
	|			И ВТ.Характеристика = ВТ_СДатойУпаковки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.Реализация,
	|	ВТ.НомерСтроки,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика,
	|	ВТ.Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Номенклатура.Код КАК НоменклатураКод,
	|	ВТ.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ЗаказКлиентаТовары.NКонтракта) КАК NКонтракта,
	|	МАКСИМУМ(ЗаказКлиентаТовары.КодЭтикеткиЗаказчика) КАК КодЭтикеткиЗаказчика,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ЧестныйЗнак) КАК ЧестныйЗнак,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Направление) КАК Намотка,
	|	МИНИМУМ(ЕСТЬNULL(Серии.Лико_ДатаУпаковки, ДАТАВРЕМЯ(1, 1, 1))) КАК МинимальнаяДатаУпаковки,
	|	МАКСИМУМ(ЕСТЬNULL(Серии.Лико_ДатаУпаковки, ДАТАВРЕМЯ(1, 1, 1))) КАК МаксимальнаяДатаУпаковки,
	|	ВТ.Количество * &ТекстЗапросаВесНоменклатуры КАК ВесКоробок,
	|	0 КАК КоличествоКоробок,
	|	0 КАК КоличествоВУпаковке
	|ИЗ
	|	ВТ_СРеализацией КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ.Характеристика.Лико_ЗаказНоменклатуры = ЗаказКлиентаТовары.Ссылка
	|			И ВТ.Характеристика = ЗаказКлиентаТовары.Характеристика
	|			И ВТ.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК Серии
	|		ПО ВТ.Характеристика = Серии.Лико_ХарактеристикаВладелец
	|			И (НЕ Серии.ПометкаУдаления
	|				И Серии.Лико_ДатаВыпуска <> ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка,
	|	ВТ.Реализация,
	|	ВТ.НомерСтроки,
	|	ВТ.Номенклатура,
	|	ВТ.Характеристика,
	|	ВТ.Количество * &ТекстЗапросаВесНоменклатуры,
	|	ВТ.Номенклатура.Код";

	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Тип", Тип);
	Запрос.УстановитьПараметр("Реализация", Реализация);
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ВТ.Номенклатура.ЕдиницаИзмерения",
	"ВТ.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяПоляХарактеристика", ИмяПоляХарактеристика);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = РезультатыЗапроса.Количество();

	Если Тип <> "СчетНаПредоплату" И Реализация[ИмяПоляСклад].ИспользоватьОрдернуюСхемуПриОтгрузке И ТипЗнч(Реализация) <> Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
		// данные из серий
		Если ВЗаказахМогутБытьОдинаковыеКодыЭтикетокЗаказчикаИлиНомераПоставки Тогда
			// По коду и номеру поставки сгруппировано
			Таблица = РезультатыЗапроса[КоличествоРезультатов-3].Выгрузить();
		Иначе
			// По коду и номеру поставки взят МАКСИМУМ из серий
			Таблица = РезультатыЗапроса[КоличествоРезультатов-2].Выгрузить();
		КонецЕсли;
	Иначе
		// данные из заказов
		Таблица = РезультатыЗапроса[КоличествоРезультатов-1].Выгрузить();
	КонецЕсли;
	Если Реализация = Неопределено Тогда
		ВыводитьВесВТОРГ12 = Ложь;
	Иначе
		ВыводитьВесВТОРГ12 = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,Реализация[ИмяПоляСклад],"ВыводитьВесВТОРГ12", Ложь);
	КонецЕсли;

	Если СНомеромКонтракта Тогда
		// нужны и код этикетки заказчика и номер поставки
	ИначеЕсли СКодомЭтикеткиЗаказчикаТек Тогда
		// номер контракта не стоит, код этикетки стоит
		Таблица.Свернуть("Ссылка,НомерСтроки,Номенклатура,Характеристика,КодЭтикеткиЗаказчика,НоменклатураКод,МинимальнаяДатаУпаковки,МаксимальнаяДатаУпаковки,ЧестныйЗнак,Намотка", "ВесКоробок,КоличествоКоробок,КоличествоВУпаковке");
		Таблица.Колонки.Добавить("NКонтракта", Новый ОписаниеТипов("СправочникСсылка.Лико_НомераПоставок"));
	Иначе
		Таблица.Свернуть("Ссылка,НомерСтроки,Номенклатура,Характеристика,НоменклатураКод,МинимальнаяДатаУпаковки,МаксимальнаяДатаУпаковки,ЧестныйЗнак,Намотка", "ВесКоробок,КоличествоКоробок,КоличествоВУпаковке");
		Таблица.Колонки.Добавить("NКонтракта", Новый ОписаниеТипов("СправочникСсылка.Лико_НомераПоставок"));
		Таблица.Колонки.Добавить("КодЭтикеткиЗаказчика", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(40)));
	КонецЕсли;
	ТЗ.Колонки.Добавить("NКонтракта", Новый ОписаниеТипов("СправочникСсылка.Лико_НомераПоставок"));
	ТЗ.Колонки.Добавить("КодЭтикеткиЗаказчика", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(40)));
	ТЗ.Колонки.Добавить("ЧестныйЗнак", Новый ОписаниеТипов("СправочникСсылка.Лико_ЧестныйЗнак"));
	ТЗ.Колонки.Добавить("Намотка", Новый ОписаниеТипов("СправочникСсылка.Лико_Намотка"));
	Если ТЗ.Колонки.Найти("КоличествоМест") = Неопределено Тогда
		ТЗ.Колонки.Добавить("КоличествоМест", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("МассаБрутто") = Неопределено Тогда
		ТЗ.Колонки.Добавить("МассаБрутто", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("МассаНетто") = Неопределено Тогда
		ТЗ.Колонки.Добавить("МассаНетто", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("КоличествоВОдномМесте") = Неопределено Тогда
		ТЗ.Колонки.Добавить("КоличествоВОдномМесте", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("СуммаБезНДС") = Неопределено Тогда
		ТЗ.Колонки.Добавить("СуммаБезНДС", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("СуммаСНДС") = Неопределено Тогда
		ТЗ.Колонки.Добавить("СуммаСНДС", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("Сумма") = Неопределено Тогда
		ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("СуммаБезСкидки") = Неопределено Тогда
		ТЗ.Колонки.Добавить("СуммаБезСкидки", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("СуммаСкидки") = Неопределено Тогда
		ТЗ.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("МинимальнаяДатаУпаковки") = Неопределено Тогда
		ТЗ.Колонки.Добавить("МинимальнаяДатаУпаковки", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	КонецЕсли;
	Если ТЗ.Колонки.Найти("МаксимальнаяДатаУпаковки") = Неопределено Тогда
		ТЗ.Колонки.Добавить("МаксимальнаяДатаУпаковки", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	КонецЕсли;

	Отбор = Новый Структура("Ссылка,НомерСтроки,Номенклатура,Характеристика");
	КоличествоСтрокТЗ = ТЗ.Количество();

	// <-- Начало Лико Ефимов ЕВВ 09.09.2024
	ТаблицаКоробок = Неопределено;
	Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И НЕ Реализация[ИмяПоляСклад].ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
		ТаблицаКоробок = Лико_Дополнительно.ПолучитьТаблицуКоробокПоНакладной(Реализация);
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 09.09.2024

	сч = 0;
	Пока сч <= КоличествоСтрокТЗ-1 Цикл
		Строка = ТЗ[сч];
		сч = сч + 1;
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		Отбор.Характеристика = Строка[ИмяПоляХарактеристика];
		НайденныеСтроки = Таблица.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
			// <-- Начало Лико Ефимов ЕВВ 09.09.2024
			//НайденнаяСтрока = НайденныеСтроки[0];
			// Попробуем найти данные из расходного ордера для отгрузок с типом РеализацияКлиентуЧерезСкладРегиона 
			НайденнаяСтрока = Неопределено;
			Если ТаблицаКоробок <> Неопределено И ТаблицаКоробок.Количество() > 0 Тогда
				ОтборТаблицыКоробок = Новый Структура("Номенклатура,Характеристика");
				ЗаполнитьЗначенияСвойств(ОтборТаблицыКоробок, Строка);
				НайденныеСтрокиТаблицыКоробок = ТаблицаКоробок.НайтиСтроки(ОтборТаблицыКоробок);
				Если НайденныеСтрокиТаблицыКоробок.Количество() = 1 Тогда
					НайденнаяСтрока = НайденныеСтрокиТаблицыКоробок[0];
				КонецЕсли;
			КонецЕсли;
			Если НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
			// <-- Конец Лико Ефимов ЕВВ 09.09.2024
			Строка.NКонтракта = НайденнаяСтрока.NКонтракта;
			Строка.МинимальнаяДатаУпаковки = НайденнаяСтрока.МинимальнаяДатаУпаковки;
			Строка.МаксимальнаяДатаУпаковки = НайденнаяСтрока.МаксимальнаяДатаУпаковки;
			Строка.КодЭтикеткиЗаказчика = СокрЛП(НайденнаяСтрока.КодЭтикеткиЗаказчика);
			Если МенятьКодЭтикеткиЗаказчикаНаКодНоменклатурыПриОтсутствии И НЕ ЗначениеЗаполнено(Строка.КодЭтикеткиЗаказчика) И НЕ СвернутьПоНаименованиюНоменклатуры Тогда
				Строка.КодЭтикеткиЗаказчика = НайденнаяСтрока.НоменклатураКод;
			КонецЕсли; 
			Строка.ЧестныйЗнак = НайденнаяСтрока.ЧестныйЗнак;
			Строка.Намотка = НайденнаяСтрока.Намотка;
			Строка.КоличествоМест = НайденнаяСтрока.КоличествоКоробок;
			Если ВыводитьВесВТОРГ12 Тогда
				Строка.МассаБрутто = НайденнаяСтрока.ВесКоробок;
				Строка.МассаНетто = НайденнаяСтрока.ВесКоробок;
			Иначе
				Строка.МассаБрутто = 0;
				Строка.МассаНетто = 0;
			КонецЕсли;
		Иначе
			// Тут сложно: придется одну строку делить на несколько, т.е. делить пропорционально количество и все суммы
			а=0;
			КоличествоСтрок = НайденныеСтроки.Количество();
			ИндексСтрокиТЗ = ТЗ.Индекс(Строка);
			КоличествоВУпаковкеИтог = 0;
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				КоличествоВУпаковкеИтог = КоличествоВУпаковкеИтог + НайденнаяСтрока.КоличествоВУпаковке;
			КонецЦикла;
			КоличествоОсталосьРаспределить = Строка.Количество;
			СуммаБезНДСОсталосьРаспределить = Строка.СуммаБезНДС;
			СуммаНДСОсталосьРаспределить = Строка.СуммаНДС;
			СуммаСНДСОсталосьРаспределить = Строка.СуммаСНДС;
			СуммаОсталосьРаспределить = Строка.Сумма;
			СуммаБезСкидкиОсталосьРаспределить = Строка.СуммаБезСкидки;
			СуммаСкидкиОсталосьРаспределить = Строка.СуммаСкидки;
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				Пропорция = НайденнаяСтрока.КоличествоВУпаковке / КоличествоВУпаковкеИтог;
				Если НайденнаяСтрока = НайденныеСтроки[КоличествоСтрок-1] Тогда
					// Это последняя строка, будем править исходную строку
					Строка.Количество = КоличествоОсталосьРаспределить;
					Строка.КоличествоМест = НайденнаяСтрока.КоличествоКоробок;
					Строка.МассаБрутто = НайденнаяСтрока.ВесКоробок;
					Строка.МассаНетто = НайденнаяСтрока.ВесКоробок;
					Строка.СуммаБезНДС = СуммаБезНДСОсталосьРаспределить;
					Строка.СуммаНДС = СуммаНДСОсталосьРаспределить;
					Строка.СуммаСНДС = СуммаСНДСОсталосьРаспределить;
					Строка.Сумма = СуммаОсталосьРаспределить;
					Строка.СуммаБезСкидки = СуммаБезСкидкиОсталосьРаспределить;
					Строка.СуммаСкидки = СуммаСкидкиОсталосьРаспределить;
					Строка.NКонтракта = НайденнаяСтрока.NКонтракта;
					Строка.КодЭтикеткиЗаказчика = СокрЛП(НайденнаяСтрока.КодЭтикеткиЗаказчика);
					Строка.ЧестныйЗнак = СокрЛП(НайденнаяСтрока.ЧестныйЗнак);
					Строка.Намотка = НайденнаяСтрока.Намотка;
					Строка.МинимальнаяДатаУпаковки = НайденнаяСтрока.МинимальнаяДатаУпаковки;
					Строка.МаксимальнаяДатаУпаковки = НайденнаяСтрока.МаксимальнаяДатаУпаковки;
					Если МенятьКодЭтикеткиЗаказчикаНаКодНоменклатурыПриОтсутствии И НЕ ЗначениеЗаполнено(Строка.КодЭтикеткиЗаказчика) Тогда
						Строка.КодЭтикеткиЗаказчика = НайденнаяСтрока.НоменклатураКод;
					КонецЕсли;
				Иначе
					НоваяСтрокаТЗ = ТЗ.Вставить(ИндексСтрокиТЗ);
					сч = сч + 1;
					КоличествоСтрокТЗ = КоличествоСтрокТЗ + 1;
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, Строка);
					НоваяСтрокаТЗ.Количество = Окр(Пропорция * Строка.Количество, 3);
					НоваяСтрокаТЗ.КоличествоМест = НайденнаяСтрока.КоличествоКоробок;
					НоваяСтрокаТЗ.МассаБрутто = НайденнаяСтрока.ВесКоробок;
					НоваяСтрокаТЗ.МассаНетто = НайденнаяСтрока.ВесКоробок;
					НоваяСтрокаТЗ.СуммаБезНДС = Окр(Пропорция * Строка.СуммаБезНДС, 2);
					НоваяСтрокаТЗ.СуммаНДС = Окр(Пропорция * Строка.СуммаНДС, 2);
					НоваяСтрокаТЗ.СуммаСНДС = Окр(Пропорция * Строка.СуммаСНДС, 2);
					НоваяСтрокаТЗ.Сумма = Окр(Пропорция * Строка.Сумма, 2);
					НоваяСтрокаТЗ.СуммаБезСкидки = Окр(Пропорция * Строка.СуммаБезСкидки, 2);
					НоваяСтрокаТЗ.СуммаСкидки = Окр(Пропорция * Строка.СуммаСкидки, 2);
					НоваяСтрокаТЗ.NКонтракта = НайденнаяСтрока.NКонтракта;
					НоваяСтрокаТЗ.КодЭтикеткиЗаказчика = СокрЛП(НайденнаяСтрока.КодЭтикеткиЗаказчика);
					НоваяСтрокаТЗ.ЧестныйЗнак = СокрЛП(НайденнаяСтрока.ЧестныйЗнак);
					НоваяСтрокаТЗ.Намотка = НайденнаяСтрока.Намотка;
					НоваяСтрокаТЗ.МинимальнаяДатаУпаковки = НайденнаяСтрока.МинимальнаяДатаУпаковки;
					НоваяСтрокаТЗ.МаксимальнаяДатаУпаковки = НайденнаяСтрока.МаксимальнаяДатаУпаковки;
					Если МенятьКодЭтикеткиЗаказчикаНаКодНоменклатурыПриОтсутствии И НЕ ЗначениеЗаполнено(НоваяСтрокаТЗ.КодЭтикеткиЗаказчика) Тогда
						НоваяСтрокаТЗ.КодЭтикеткиЗаказчика = НайденнаяСтрока.НоменклатураКод;
					КонецЕсли;

					КоличествоОсталосьРаспределить = КоличествоОсталосьРаспределить - НоваяСтрокаТЗ.Количество;
					СуммаБезНДСОсталосьРаспределить = СуммаБезНДСОсталосьРаспределить - НоваяСтрокаТЗ.СуммаБезНДС;
					СуммаНДСОсталосьРаспределить = СуммаНДСОсталосьРаспределить - НоваяСтрокаТЗ.СуммаНДС;
					СуммаСНДСОсталосьРаспределить = СуммаСНДСОсталосьРаспределить - НоваяСтрокаТЗ.СуммаСНДС;
					СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - НоваяСтрокаТЗ.Сумма;
					СуммаБезСкидкиОсталосьРаспределить = СуммаБезСкидкиОсталосьРаспределить - НоваяСтрокаТЗ.СуммаБезСкидки;
					СуммаСкидкиОсталосьРаспределить = СуммаСкидкиОсталосьРаспределить - НоваяСтрокаТЗ.СуммаСкидки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если ТЗ.Колонки.Найти("ВидЦеныИсполнителя") <> Неопределено Тогда
		ТЗ.Колонки.Удалить("ВидЦеныИсполнителя");
		ТЗ.Колонки.Добавить("ВидЦеныИсполнителя", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	КонецЕсли;
	//Если ТЗ.Колонки.Найти("КодТНВЭД") <> Неопределено Тогда
	//	ТЗ.Колонки.Удалить("КодТНВЭД");
	//	ТЗ.Колонки.Добавить("КодТНВЭД", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	//КонецЕсли;
	// Проставим номер строки
	НомерСтроки = 0;
	Для каждого Строка из ТЗ Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			НомерСтроки = 0;
			Продолжить;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
		Строка.НомерСтроки = НомерСтроки;
		Строка.КоличествоВОдномМесте = ?(ЗначениеЗаполнено(Строка.КоличествоМест), Строка.Количество / Строка.КоличествоМест, 0);
	КонецЦикла;
	
	Если ТипЗнч(РезультатПоТабличнойЧастиИлиТз) = Тип("ТаблицаЗначений") Тогда
		РезультатПоТабличнойЧастиИлиТз = ТЗ;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	НЕ ТЗ.Номенклатура ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВТ КАК ВТ
		|";
		Если Тип = "СчетФактура" Тогда
			Запрос.Текст = Запрос.Текст + "
			|
			|УПОРЯДОЧИТЬ ПО ВТ.ЕдиницаИзмерения УБЫВ, ВТ.НомерСтроки
			|"
		КонецЕсли;
		Если НЕ (Тип = "СчетНаОплату" ИЛИ Тип = "СчетНаПредоплату") Тогда
			Запрос.Текст = Запрос.Текст + "
			|ИТОГИ ПО
			|	" + ИтоговоеПоле;
		КонецЕсли;

		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		РезультатПоТабличнойЧастиИлиТз = Запрос.Выполнить();	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьАдресСклада(Склад) Экспорт // --> Начало Лико Ефимов ЕВВ 28.02.2018
	
	Структура = Новый Структура("Представление,ЗначенияПолей", "", "");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКонтактнаяИнформация.Представление КАК Представление,
	|	СкладыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|ГДЕ
	|	СкладыКонтактнаяИнформация.Ссылка = &Склад
	|	И СкладыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	Возврат Структура;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 28.02.2018

Процедура ОчиститьРегистрРезервыТоваровОрганизацийПоРегистратору(Ссылка) Экспорт // --> Начало Лико Ефимов ЕВВ 09.04.2018
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	ТипРегистра = "Накопления";
	ИмяРегистра = "РезервыТоваровОрганизаций";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Регистр.Регистратор КАК Регистратор
	|ИЗ
	|	Регистр" + ТипРегистра + "." + ИмяРегистра + " КАК Регистр
	|ГДЕ
	|	ВЫБОР КОГДА &Регистратор = НЕОПРЕДЕЛЕНО ТОГДА НЕ Регистр.Регистратор.Проведен ИНАЧЕ Регистр.Регистратор = &Регистратор КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Регистр.Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписей = Неопределено;
	
	ВЫПОЛНИТЬ("НаборЗаписей = Регистры" + ТипРегистра + "[""" + ИмяРегистра + """].СоздатьНаборЗаписей()");
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	счЗаписей = 0;
	счДокументов = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
		
		НаборЗаписей.Прочитать();
		
		счЗаписей = счЗаписей + НаборЗаписей.количество();
		НаборЗаписей.Очистить();
		
		НаборЗаписей.Записать();
		счДокументов = счДокументов + 1;
	КонецЦикла;
	//Сообщить("Удалено " + счЗаписей + " записей по " + счДокументов + " документам");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 09.04.2018

Функция ВернутьНаименованиеМатериалаИлиАльтернативноеНаименованиеПриНеобходимости(Материал, Заказ, Клиент, МестоВызова = "Сертификат") Экспорт // --> Начало Лико Ефимов ЕВВ 11.04.2018
	
	//Начало изменений Иванова А.В. 20211128  
	Если ЗначениеЗаполнено (Клиент) Тогда 
	     Если Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Клиент, "СтикерНеОтображатьМатериал", Ложь) Тогда 
		     Возврат "";  
		 КонецЕсли
	КонецЕсли;
	
	Если Заказ.НеПоказыватьКлиентуМатериал Тогда 
	    Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Материал) = Тип("СправочникСсылка.Номенклатура") Тогда
		ЦеноваяГруппа = Материал.ЦеноваяГруппа;
	ИначеЕсли ТипЗнч(Материал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
		ЦеноваяГруппа = Материал;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если Заказ.ПоказыватьКлиентуМатериалИзЗаказа Тогда 
		Возврат СокрЛП(Материал.Наименование + ?(ЗначениеЗаполнено(ЦеноваяГруппа.Лико_СтранаПроизводитель), " (" + СокрЛП(ЦеноваяГруппа.Лико_СтранаПроизводитель) + ")", ""));
	Иначе 
		Если МестоВызова = "Сертификат" Тогда 
			Если ЗначениеЗаполнено(Заказ.АльтернативноеНаименованиеМатериалаДляСертификата) Тогда 
				Возврат СокрЛП(Заказ.АльтернативноеНаименованиеМатериалаДляСертификата);
			Иначе 
				Возврат СокрЛП(ЦеноваяГруппа.Лико_НаименованиеДляПечати);
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Заказ.АльтернативноеНаименованиеМатериалаДляБирки) Тогда 
				Возврат СокрЛП(Заказ.АльтернативноеНаименованиеМатериалаДляБирки);
			Иначе 
				Возврат СокрЛП(ЦеноваяГруппа.Лико_НаименованиеДляБирки) + ?(ЗначениеЗаполнено(ЦеноваяГруппа.Лико_СтранаПроизводитель), " (" + СокрЛП(ЦеноваяГруппа.Лико_СтранаПроизводитель) + ")", "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	
	//ОтображатьАльтернативныйМатериал = Ложь;
	//Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
	//	ОтображатьАльтернативныйМатериал = Истина;
	//Иначе
	//	ОтображатьАльтернативныйМатериал = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Клиент, "ВыводитьНаПечатьАльтернативноеНаименованиеМатериала_9fa72ba86d9444b3a2c8a4ac11d226b2", Ложь);
	//КонецЕсли;
	//Если НЕ ОтображатьАльтернативныйМатериал Тогда
	//	Возврат Материал.Наименование;
	//КонецЕсли;
	//
	//Если МестоВызова = "Сертификат" И ЗначениеЗаполнено(Заказ.АльтернативноеНаименованиеМатериалаДляСертификата) Тогда
	//	Возврат СокрЛП(Заказ.АльтернативноеНаименованиеМатериалаДляСертификата);
	//ИначеЕсли МестоВызова = "Бирка" И ЗначениеЗаполнено(Заказ.АльтернативноеНаименованиеМатериалаДляБирки) Тогда
	//	Возврат СокрЛП(Заказ.АльтернативноеНаименованиеМатериалаДляБирки);
	//КонецЕсли;
	//
	//Если ТипЗнч(Материал) = Тип("СправочникСсылка.Номенклатура") Тогда
	//	ЦеноваяГруппа = Материал.ЦеноваяГруппа;
	//ИначеЕсли ТипЗнч(Материал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
	//	ЦеноваяГруппа = Материал;
	//Иначе
	//	Возврат "";
	//КонецЕсли;
	//Возврат СокрЛП(ЦеноваяГруппа.Лико_НаименованиеДляПечати);
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 11.04.2018

Функция ВернутьНаименованиеЛака(ЦеноваяГруппа) Экспорт // --> Начало Лико Субботин 12.12.2022
	
	Результат = ?(  ЗначениеЗаполнено(ЦеноваяГруппа.Лико_НаименованиеДляПечати ), ЦеноваяГруппа.Лико_НаименованиеДляПечати, ЦеноваяГруппа.Наименование  ); 
	Результат = СокрЛП(Результат);
	
	Возврат Результат

	
КонецФункции // <-- Конец Лико Субботин  12.12.2022

Функция ПроверитьНеобходимостьВопросаОПерезапускеПослеДинамики() Экспорт // --> Начало Лико Ефимов ЕВВ 18.04.2018 
	
	Если ПараметрыСеанса.Лико_РабочееМесто.ТипРабочегоМеста = Перечисления.Лико_ТипыРабочегоМеста.Телевизор ИЛИ ПараметрыСеанса.Лико_РабочееМесто.ТипРабочегоМеста = Перечисления.Лико_ТипыРабочегоМеста.Инфопад ИЛИ ПараметрыСеанса.Лико_РабочееМесто.ТипРабочегоМеста = Перечисления.Лико_ТипыРабочегоМеста.КПК Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 18.04.2018 

Процедура ИзменитьСтатусЭтапаПроизводстваВФоне(Этап, НовыйСтатус) Экспорт // --> Начало Лико Ефимов ЕВВ 19.04.2018
	
	ОтменитьАктивныеФоновыеЗаданияПоИзменениюЭтапа(Этап);
	
	ИмяМетода = "Лико_Дополнительно.ИзменитьСтатусЭтапаПроизводства";
	
	ПараметрыПроцедуры = Новый Массив();
	ПараметрыПроцедуры.Добавить(Этап);
	ПараметрыПроцедуры.Добавить(НовыйСтатус);
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ИмяМетода);
	ПараметрыЗадания.Добавить(ПараметрыПроцедуры);
	
	КлючЗадания = "Лико_ИзменениеСтатусаЭтапа" + Строка(Этап.УникальныйИдентификатор());
	
	НаименованиеЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Изменение статуса этапа производства из обработки планирования РЦ'"),
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Этап, "Представление"));
	
	Попытка
		ФоновыеЗадания.Выполнить(
		"ОбщегоНазначения.ВыполнитьМетодКонфигурации",
		ПараметрыЗадания,
		КлючЗадания,
		НаименованиеЗадания);
	Исключение
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 19.04.2018

Процедура ОтменитьАктивныеФоновыеЗаданияПоИзменениюЭтапа(Этап) // --> Начало Лико Ефимов ЕВВ 19.04.2018 
	
	ОтборЗаданий = Новый Структура;
	ОтборЗаданий.Вставить("Ключ", "Лико_ИзменениеСтатусаЭтапа" + Строка(Этап.УникальныйИдентификатор()));
	ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
	
	Для каждого Задание Из Задания Цикл
		Попытка
			Задание.Отменить();
		Исключение
			// Возможно задание как раз в этот момент закончилось и ошибки нет.
			СобытиеЖурналаРегистрации = НСтр(
			"ru = 'Изменение статуса этапа производства из обработки планирования РЦ. Отмена фонового задания'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Ошибка,
			Этап.Метаданные(),
			Этап,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 19.04.2018 

Процедура ИзменитьСтатусЭтапаПроизводства(Этап, НовыйСтатус) Экспорт // --> Начало Лико Ефимов ЕВВ 19.04.2018
	
	
	УстановитьПривилегированныйРежим(Истина);
	Если Этап.Статус = НовыйСтатус Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		ЭтапОбъект =  Этап.ПолучитьОбъект();
		ЭтапОбъект.Статус = НовыйСтатус;
		ЭтапОбъект.Записать(?(ЭтапОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		ЗафиксироватьТранзакцию();
	Исключение
		Попытка
			ЭтапОбъект =  Этап.ПолучитьОбъект();
			ЭтапОбъект.Статус = НовыйСтатус;
			ЭтапОбъект.Записать(?(ЭтапОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			ЗафиксироватьТранзакцию();
		Исключение
			Попытка
				ЭтапОбъект =  Этап.ПолучитьОбъект();
				ЭтапОбъект.Статус = НовыйСтатус;
				ЭтапОбъект.Записать(?(ЭтапОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				ЗафиксироватьТранзакцию();
			Исключение
				Попытка
					ЭтапОбъект =  Этап.ПолучитьОбъект();
					ЭтапОбъект.Статус = НовыйСтатус;
					ЭтапОбъект.Записать(?(ЭтапОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
					СобытиеЖурналаРегистрации = НСтр(
					"ru = 'Изменение статуса этапа производства из обработки планирования РЦ'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
					ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации,
					УровеньЖурналаРегистрации.Ошибка,
					Этап.Метаданные(),
					Этап,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ВызватьИсключение;
				КонецПопытки;
			КонецПопытки;
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 19.04.2018

// Формирует строку лаков в формате цифровых заказов
//
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказКлиента, ДокументОбъект.ЗаказКлиента - документ заказа, можно передавать объект документа, а не ссылку. Сделано для случаев, когда нужно получить строку
//																		перед записью документа, в этом случае в ссылке данные могут отличаться от объекта
//  СЛаминацией - Булево - Ставим Истина, если нужно к строке добавить слово "ЛАМ" в тех случаях, когда Заказ.Ламинация = Истина
//
//  Возвращаемое значение:
//      Число - Количество коробок в таблица значений
//
Функция СтрокаЛакиПоЗаказу(Заказ, СЛаминацией = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 30.05.2018 
	
	Лаки = "";
	ЗапросЛаки = Новый Запрос;
	ЗапросЛаки.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.ТипЦвета КАК ТипЦвета,
	|	ТЧ.ТипКраски КАК ТипКраски,
	|	ТЧ.Название КАК Название,
	|	ТЧ.ВидПечати КАК ВидПечати
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.ВыборочныйЛак)
	|				ИЛИ ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.ЛакБезОкна)
	|			ТОГДА ЗаказКлиентаЦвета.ТипКраски.Код
	|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.Pmc)
	|				ИЛИ ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.PmcПоФотону)
	|				ИЛИ ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.PmcПоОбразцу)
	|			ТОГДА ЗаказКлиентаЦвета.Название
	|	КОНЕЦ КАК Код,
	|	ЗаказКлиентаЦвета.ТипЦвета КАК ТипЦвета
	|ИЗ
	|	ВТ_ТЧ КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	(ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.ВыборочныйЛак)
	|			ИЛИ ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.ЛакБезОкна)
	|			ИЛИ ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.Pmc)
	|			ИЛИ ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.PmcПоФотону)
	|			ИЛИ ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.PmcПоОбразцу))
	|	И (ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Флексо)
	|			ИЛИ ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф))";
	
	ЗапросЛаки.УстановитьПараметр("ТЧ", Заказ.Цвета.Выгрузить(,"ТипЦвета,ТипКраски,Название,ВидПечати"));
	ВыборкаЛаки = ЗапросЛаки.Выполнить().Выбрать();
	Пока ВыборкаЛаки.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаЛаки.Код) Тогда 
			Лаки = Лаки + ?(ЗначениеЗаполнено(Лаки),",", "") + СокрЛП(ВыборкаЛаки.Код);
		КонецЕсли;	
	КонецЦикла;
	Если СЛаминацией И Заказ.Ламинация Тогда
		Лаки = Лаки + ?(ЗначениеЗаполнено(Лаки), ",", "") + "ЛАМ";
	КонецЕсли;
	Возврат Лаки;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 30.05.2018 

Функция НайтиЗаказКлиентаПоЭтапу(Этап) Экспорт // --> Начало Лико Ефимов ЕВВ 27.09.2018
	
	Возврат Этап.Лико_ЗаказКлиента;			
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.09.2018

Функция НайтиРабочийЦентрВЗаказеКлиентаПоПрокату(ЗаказКлиента, НомерПроката) Экспорт // --> Начало Лико Ефимов ЕВВ 27.09.2018
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр КАК РабочийЦентр
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|ГДЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	|	И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = &НомерПроката
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЦентр";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РабочийЦентр;
	Иначе
		Возврат Неопределено;
	КонецЕсли;		
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.09.2018

Функция ПодобратьДоговор(ЗаказКлиента, Основание, СоздаватьВсегдаНовый = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 29.10.2018 
	
	НомерЗаказа = ЗаказКлиента.НомерБезПрефикса;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.Дата, ГОД) >= &НачалоГода
	|	И ДоговорыКонтрагентов.Номер = &НомерДоговора
	// --> Начало Лико Ефимов ЕВВ 20.11.2024
	// Прописал тип договора, чтобы не подбирались договоры закупки
	|	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	// <-- Конец Лико Ефимов ЕВВ 20.11.2024
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор КАК Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_СчетНаОплатуКлиенту.Ссылка) КАК КоличествоДокументов
	|ПОМЕСТИТЬ ВТ_ДоговорыСКоличествомДокументов
	|ИЗ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием КАК ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_СчетНаОплатуКлиенту КАК Лико_СчетНаОплатуКлиенту
	|		ПО ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор = Лико_СчетНаОплатуКлиенту.Договор
	|			И (НЕ Лико_СчетНаОплатуКлиенту.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка)
	|ИЗ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием КАК ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор = РеализацияТоваровУслуг.Договор
	|			И (НЕ РеализацияТоваровУслуг.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктВыполненныхРабот.Ссылка)
	|ИЗ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием КАК ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ПО ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор = АктВыполненныхРабот.Договор
	|			И (НЕ АктВыполненныхРабот.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка)
	|ИЗ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием КАК ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|		ПО (ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор = (ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа КАК Справочник.ДоговорыКонтрагентов)))
	|			И (НЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор
	// --> Начало Лико Ефимов ЕВВ 14.06.2022
	// будем искать еще по вводам остатков
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВводОстатковРасчетыСПартнерами.Ссылка)
	|ИЗ
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием КАК ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатков.РасчетыСПартнерами КАК ВводОстатковРасчетыСПартнерами
	|		ПО (ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор = (ВЫРАЗИТЬ(ВводОстатковРасчетыСПартнерами.ОбъектРасчетов КАК Справочник.ДоговорыКонтрагентов)))
	|			И (НЕ ВводОстатковРасчетыСПартнерами.Ссылка.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыКонтрагентаСЗаданнымНаименованием.Договор
	// <-- Конец Лико Ефимов ЕВВ 14.06.2022
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыСКоличествомДокументов.Договор КАК Договор,
	|	СУММА(ВТ_ДоговорыСКоличествомДокументов.КоличествоДокументов) КАК КоличествоДокументов
	|ИЗ
	|	ВТ_ДоговорыСКоличествомДокументов КАК ВТ_ДоговорыСКоличествомДокументов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыСКоличествомДокументов.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоДокументов УБЫВ,
	|	ВТ_ДоговорыСКоличествомДокументов.Договор";
	
	НомерДоговора = НомерЗаказа;
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ДобавитьМесяц(Основание.Дата, -9*12))); // последние 9 лет, т.к. для года у нас всего одна цифра
	//Запрос.УстановитьПараметр("Контрагент", Реализация.Контрагент);
	//Запрос.УстановитьПараметр("Организация", Основание.Организация);
	
	Для Счетчик = 1 по 10000 Цикл
		
		Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.КоличествоДокументов > 0 Тогда
				НомерДоговора = НомерЗаказа + "/" + Формат(Счетчик,"ЧГ=");
			Иначе
				//Если ТипЗнч(Основание) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
				//	// для реализации вернем этот договор
				//	Возврат Выборка.Договор;
				//Иначе
				//	// для счета на предоплату все равно будем создавать новый договор с номером + 1
				//	НомерДоговора = НомерЗаказа + "/" + Формат(Счетчик,"ЧГ=");
				//	Продолжить;
				//КонецЕсли;
				Если СоздаватьВсегдаНовый Тогда
					// для счета на предоплату все равно будем создавать новый договор с номером + 1
					НомерДоговора = НомерЗаказа + "/" + Формат(Счетчик,"ЧГ=");
					Продолжить;
				Иначе
					// для реализации вернем этот договор
					Возврат Выборка.Договор;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Раз дошло до сюда, значит нужно создавать новый договор
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Наименование = "СЧ" + НомерДоговора;
	НовыйДоговор.НаименованиеДляПечати = "СЧ" + НомерДоговора;
	НовыйДоговор.Номер = НомерДоговора;
	НовыйДоговор.Контрагент = Основание.Контрагент;
	НовыйДоговор.Дата = Основание.Дата;
	НовыйДоговор.Организация = Основание.Организация;
	НовыйДоговор.Партнер = Основание.Партнер;
	НовыйДоговор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
	НовыйДоговор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	НовыйДоговор.Согласован = Истина;
	НовыйДоговор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	НовыйДоговор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем;
	Если НовыйДоговор.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		// не резидент, ставка НДС = 0
		НовыйДоговор.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС0);
		НовыйДоговор.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт;
	Иначе
		// резидент
		Если НовыйДоговор.Дата >= Дата('20260101') Тогда
			НовыйДоговор.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);
		ИначеЕсли НовыйДоговор.Дата >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
			НовыйДоговор.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
		Иначе
			НовыйДоговор.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
		КонецЕсли;
		НовыйДоговор.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	КонецЕсли;
	Если ТипЗнч(Основание) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		НовыйДоговор.ВалютаВзаиморасчетов = Основание.ВалютаВзаиморасчетов;
		//НовыйДоговор.ПорядокОплаты = Основание.ПорядокОплаты;
		НовыйДоговор.ГруппаФинансовогоУчета = Основание.ГруппаФинансовогоУчета;
		НовыйДоговор.Менеджер = Основание.Менеджер;
		НовыйДоговор.Подразделение = Основание.Подразделение;
		НовыйДоговор.БанковскийСчетКонтрагента = Основание.БанковскийСчетКонтрагента;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДанныеФормыСтруктура") И (ТипЗнч(Основание.Ссылка) = Тип("ДокументСсылка.Лико_СчетНаОплатуКлиенту") ИЛИ ТипЗнч(Основание.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда
		НовыйДоговор.ВалютаВзаиморасчетов = Основание.Валюта;
		//Если НовыйДоговор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить() Тогда	
		//	НовыйДоговор.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
		//Иначе
		//	Если НовыйДоговор.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДоговор.Контрагент, "ОплатаВВалютедляНерезидентов", Ложь) Тогда
		//		НовыйДоговор.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте;
		//	Иначе
		//		НовыйДоговор.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях;
		//	КонецЕсли;
		//КонецЕсли;
		НовыйДоговор.ГруппаФинансовогоУчета = НайтиГруппуФинУчетаПоВалютеИНалогообложению(НовыйДоговор.ВалютаВзаиморасчетов, НовыйДоговор.НалогообложениеНДС);
		НовыйДоговор.Менеджер = ЗаказКлиента.Менеджер;
		НовыйДоговор.Подразделение = ЗаказКлиента.Менеджер.Подразделение;
		НовыйДоговор.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(НовыйДоговор.Контрагент, Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Сообщить("Основание для подбора договора неопределено");
		Возврат Неопределено;
	КонецЕсли;
	Если НовыйДоговор.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра
		ИЛИ НовыйДоговор.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра
		ИЛИ НовыйДоговор.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра Тогда
		НовыйДоговор.Подразделение = Справочники.Лико_ПредопределенныеЗначения.ПодразделениеПроизводство.ЗначениеПараметра;
	КонецЕсли;
	НовыйДоговор.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
	НовыйДоговор.Лико_Площадка = ЗаказКлиента.Площадка;
	НовыйДоговор.НалогообложениеНДСОпределяетсяВДокументе = Ложь;
	НовыйДоговор.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;
	НовыйДоговор.Лико_СсылкаНаРеальныйДоговор = НайтиРеальныйДоговор(НовыйДоговор.Организация, НовыйДоговор.Контрагент, НовыйДоговор.Дата, НовыйДоговор.ВалютаВзаиморасчетов);
	Если ЗначениеЗаполнено(НовыйДоговор.Лико_СсылкаНаРеальныйДоговор) И ЗначениеЗаполнено(НовыйДоговор.Лико_СсылкаНаРеальныйДоговор.БанковскийСчет) Тогда
		НовыйДоговор.БанковскийСчет = НовыйДоговор.Лико_СсылкаНаРеальныйДоговор.БанковскийСчет;
	Иначе
		НовыйДоговор.БанковскийСчет = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовыйДоговор.Организация);
		Если НЕ ЗначениеЗаполнено(НовыйДоговор.БанковскийСчет) Тогда
			НовыйДоговор.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовыйДоговор.Организация, Константы.ВалютаРегламентированногоУчета.Получить());
		КонецЕсли;
	КонецЕсли;
	// --> Начало Лико Ефимов ЕВВ 12.04.2022
	НовыйДоговор.ОплатаВВалюте = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДоговор.Контрагент, "ОплатаВВалютедляНерезидентов", Ложь);
	// <-- Конец Лико Ефимов ЕВВ 12.04.2022
	// --> Начало Лико Ефимов ЕВВ 24.01.2025
	НовыйДоговор.Лико_ОсобыйПорядокРасчетаНДС = НовыйДоговор.Лико_СсылкаНаРеальныйДоговор.Лико_ОсобыйПорядокРасчетаНДС;
	// <-- Конец Лико Ефимов ЕВВ 24.01.2025
	
	Попытка
		НовыйДоговор.Записать();
		Возврат НовыйДоговор.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 29.10.2018 

Функция НайтиГруппуФинУчетаПоВалютеИНалогообложению(Валюта, НалогообложениеНДС) Экспорт // --> Начало Лико Ефимов ЕВВ 01.03.2022 новая функция для 2.5
	
	РасчетыВВалюте = Валюта <> Константы.ВалютаРегламентированногоУчета.Получить();
	ПродажаНаЭкспорт = НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт;
	ГруппаФинУчетаКлиентыЭкспортВалюта = Справочники.Лико_ПредопределенныеЗначения.ГруппаФинУчетаКлиентыЭкспортВалюта.ЗначениеПараметра;
	Если РасчетыВВалюте И ПродажаНаЭкспорт Тогда
		Возврат ГруппаФинУчетаКлиентыЭкспортВалюта;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГруппыФинансовогоУчетаРасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаРасчетов КАК ГруппыФинансовогоУчетаРасчетов
		|ГДЕ
		|	НЕ ГруппыФинансовогоУчетаРасчетов.ПометкаУдаления
		|	И ГруппыФинансовогоУчетаРасчетов.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)
		|	И НЕ ГруппыФинансовогоУчетаРасчетов.ЭтоГруппа
		|	И ГруппыФинансовогоУчетаРасчетов.РасчетыСКлиентами
		|	И ГруппыФинансовогоУчетаРасчетов.РасчетыВВалюте = &РасчетыВВалюте
		|	И ВЫБОР
		|			КОГДА &ПродажаНаЭкспорт
		|					И &РасчетыВВалюте
		|				ТОГДА ГруппыФинансовогоУчетаРасчетов.Ссылка = &ГруппаФинУчетаКлиентыЭкспортВалюта
		|			ИНАЧЕ ГруппыФинансовогоУчетаРасчетов.Ссылка <> &ГруппаФинУчетаКлиентыЭкспортВалюта
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ПродажаНаЭкспорт", ПродажаНаЭкспорт);
	Запрос.УстановитьПараметр("РасчетыВВалюте", РасчетыВВалюте);
	Запрос.УстановитьПараметр("ГруппаФинУчетаКлиентыЭкспортВалюта", ГруппаФинУчетаКлиентыЭкспортВалюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции  // <-- Конец Лико Ефимов ЕВВ 01.03.2022 

Функция ПолучитьКартинкуШтрихкодаDataMatrix(Штрихкод, SymbolSize = 5) Экспорт // --> Начало Лико Ефимов ЕВВ 14.11.2018
	
	ВнешняяКомпонента = ПодключитьВнешнююКомпонентуПечатиШтрихкодаDataMatrix();
	Если ВнешняяКомпонента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// ЕВВ: из Медицина. Больничные, редакция 2.0 (2.0.2.3)  
	
	// DataMatrix. РазмерыМатрицы:
	//   10x10 - 1
	//   12x12 - 2
	//   14x14 - 3
	//   16x16 - 4
	//   18x18 - 5
	//   20x20 - 6
	//   22x22 - 7
	//   24x24 - 8
	//   26x26 - 9
	//   32x32 - 10
	//   36x36 - 11
	//   40x40 - 12
	//   44x44 - 13
	//   48x48 - 14
	//   52x52 - 15
	//   64x64 - 16
	//   72x72 - 17
	//   80x80 - 18
	//   88x88 - 19
	//   96x96 - 20
	//   104x104 - 21
	//   120x120 - 22
	//   132x132 - 23
	//   144x144 - 24
	//   8x18 - 25
	//   8x32 - 26
	//   12x26 - 27
	//   12x36 - 28
	//   16x36 - 29
	//   16x48 - 30
	
	// DataMatrix. СхемыКодирования:
	//   AutoFast - 1
	//   AutoBest - 2
	//   Ascii - 3
	//   C40 - 4
	//   Text - 5
	//   X12 - 6
	//   Edifact - 7
	//   Base256 - 8
	
	
	// Сформируем картинку
	ВнешняяКомпонента.SymbolSize = 20;   // РазмерыМатрицы - 96x96
	ВнешняяКомпонента.EncodingScheme = 8;  // СхемыКодирования - SchemeBase256
	ВнешняяКомпонента.ModuleSize = 4;   // размер модуля в пикселях
	ВнешняяКомпонента.MarginSize = 2;   // отступ в пикселях
	
	// --> Начало Лико Ефимов ЕВВ 14.11.2018 
	//ДвоичныеДанныеКартинки = ВнешняяКомпонента.GetBarcode(Штрихкод);
	ВнешняяКомпонента.SymbolSize = SymbolSize;
	Попытка
		ДвоичныеДанныеКартинки = ВнешняяКомпонента.GetBarcode(Штрихкод);
	Исключение
		Если SymbolSize < 30 Тогда
			SymbolSize = SymbolSize + 1;
			Возврат ПолучитьКартинкуШтрихкодаDataMatrix(Штрихкод, SymbolSize);
		КонецЕсли;
	КонецПопытки;
	// <-- Конец Лико Ефимов ЕВВ 14.11.2018
	
	// Если картинка сформировалась
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		// Формируем из двоичных данных
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 14.11.2018 

Функция ПодключитьВнешнююКомпонентуПечатиШтрихкодаDataMatrix() // --> Начало Лико Ефимов ЕВВ 14.11.2018 
	
	// ЕВВ: из 1С Медицина. Больничные, редакция 2.0 (2.0.2.3) 
	
	// В зависимости от типа платформы подключим соответствующую внешнюю компоненту
	ПодключениеВыполнено = Неопределено;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовWindows32_DataMatrix", "КартинкаШтрихкодаDataMatrix", ТипВнешнейКомпоненты.Native);
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовWindows64_DataMatrix", "КартинкаШтрихкодаDataMatrix", ТипВнешнейКомпоненты.Native);
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовLinux32_DataMatrix", "КартинкаШтрихкодаDataMatrix", ТипВнешнейКомпоненты.Native);
	Иначе
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовLinux64_DataMatrix", "КартинкаШтрихкодаDataMatrix", ТипВнешнейКомпоненты.Native);
	КонецЕсли;
	
	// Создадим объект внешней компоненты
	Если ПодключениеВыполнено Тогда
		ВнешняяКомпонента = Новый("AddIn.КартинкаШтрихкодаDataMatrix.Barcode");
	Иначе
		Сообщить("Не удалось подключить компонент печати 2D-кода DataMatrix для платформы " + СистемнаяИнформация.ТипПлатформы + ". Обратитесь в отдел ИТ");
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет возможности рисовать
	Возврат ВнешняяКомпонента;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 14.11.2018 

Процедура ПроверитьНаличиеНулевыхСуммВРегистреСуммыДокументовВВалютеРеглИДобавитьНовоеЗаданиеКРасчетуПриНеобходимости(Документ, МенеджерВременныхТаблиц = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 15.01.2019

	УстановитьПривилегированныйРежим(Истина);

	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		Возврат;
	КонецЕсли;

	МассивДокументов = Новый Массив;
	Если Документ = Неопределено Тогда
		Если МенеджерВременныхТаблиц = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанныхДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	ТаблицаДанныхДокументов КАК ТаблицаДанныхДокументов
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДанныхДокументов.Ссылка";
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДокументов.Добавить(Выборка.Ссылка);	
		КонецЦикла;
	Иначе
		МассивДокументов.Добавить(Документ);
	КонецЕсли;

	Для каждого ТекДокумент ИЗ МассивДокументов Цикл
		ТипДокумента = ТипЗнч(ТекДокумент.Ссылка);
		Если НЕ (ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипДокумента = Тип("ДокументСсылка.АктВыполненныхРабот")) Тогда
			Возврат;
		КонецЕсли;
		ДокументСсылка = ТекДокумент.Ссылка;

		Если ТекДокумент.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			Возврат;
		КонецЕсли;

		ДатаДокумента = ТекДокумент.Дата;

		// --> Начало Лико Ефимов ЕВВ 01.10.2019
		Если ДатаДокумента < Дата('20190101000000') Тогда
			Возврат;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 01.10.2019 

		// Проверим, есть ли уже запись в регистре в текущем месяце по данному документу
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияКРаспределениюРасчетовСКлиентами.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами КАК ЗаданияКРаспределениюРасчетовСКлиентами
		|ГДЕ
		|	(ВЫРАЗИТЬ(ЗаданияКРаспределениюРасчетовСКлиентами.Документ КАК Документ.РеализацияТоваровУслуг)) = &Документ
		|	И ЗаданияКРаспределениюРасчетовСКлиентами.Месяц = &Месяц";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", ДокументСсылка.Метаданные().Имя);
		Запрос.УстановитьПараметр("Документ", ДокументСсылка);
		Запрос.УстановитьПараметр("Месяц", НачалоМесяца(ДатаДокумента));
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			// Запись уже есть
			Возврат;
		КонецЕсли;

		НужноДобавлятьЗапись = Ложь;

		Если НЕ НужноДобавлятьЗапись Тогда
			// Проверим, есть ли нулевые суммы
			// Проверим, сходится ли рублевая сумма у документов без предоплаты
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СуммыДокументовВВалютеРегл.Регистратор КАК Регистратор,
			|	СуммыДокументовВВалютеРегл.СуммаБезНДСРегл + СуммыДокументовВВалютеРегл.СуммаНДСРегл КАК СуммаРуб,
			|	СуммыДокументовВВалютеРегл.СуммаБезНДСРегл КАК СуммаБезНДСРегл
			|ПОМЕСТИТЬ ВТ_ДанныеРегистра
			|ИЗ
			// --> Начало Лико Ефимов ЕВВ 12.04.2022
			// Регистр переименовали в 2.5
			//|	РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыДокументовВВалютеРегл
			|	РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютеРегл 
			// <-- Конец Лико Ефимов ЕВВ 12.04.2022
			|ГДЕ
			|	(ВЫРАЗИТЬ(СуммыДокументовВВалютеРегл.Регистратор КАК Документ.РеализацияТоваровУслуг)) = &Регистратор
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	СуммыДокументовВВалютеРегл.Регистратор,
			//|	СуммыДокументовВВалютеРегл.СуммаБезНДСРегл,
			//|	СуммыДокументовВВалютеРегл.СуммаБезНДСРегл + СуммыДокументовВВалютеРегл.СуммаНДСРегл
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДанныеРегистра.Регистратор КАК Регистратор,
			|	СУММА(ВТ_ДанныеРегистра.СуммаРуб) КАК СуммаРуб
			|ИЗ
			|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ДанныеРегистра.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДанныеРегистра.Регистратор КАК Регистратор,
			|	ВТ_ДанныеРегистра.СуммаБезНДСРегл КАК СуммаБезНДСРегл
			|ИЗ
			|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
			|ГДЕ
			|	ВТ_ДанныеРегистра.СуммаБезНДСРегл = 0";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", ДокументСсылка.Метаданные().Имя);
			Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
			РезультатыЗапроса = Запрос.ВыполнитьПакет();
			РезультатыЗапросаНулевыеСуммы = РезультатыЗапроса[РезультатыЗапроса.Количество()-1];
			Если НЕ РезультатыЗапросаНулевыеСуммы.Пустой() Тогда
				// Есть нулевые строки
				НужноДобавлятьЗапись = Истина;
			КонецЕсли;

			Если НЕ НужноДобавлятьЗапись И НЕ ПоРеализацииЕстьПредоплата(ТекДокумент) Тогда
				ВыборкаСуммаРуб = РезультатыЗапроса[РезультатыЗапроса.Количество()-2].Выбрать();
				Если ВыборкаСуммаРуб.Следующий() Тогда
					Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ТекДокумент.Валюта, ДатаДокумента).Курс;
					Если Окр(ТекДокумент.СуммаДокумента * Курс, 2, РежимОкругления.Окр15как20) <> ВыборкаСуммаРуб.СуммаРуб Тогда
						// Рублевая сумма в документе не сходится с суммой евро * курс
						НужноДобавлятьЗапись = Истина;
					КонецЕсли;
				Иначе
					// Записей в регистре вообще нет, нужно добавить задание
					НужноДобавлятьЗапись = Истина;
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;	

		Если НужноДобавлятьЗапись Тогда

			// --> Начало Лико Ефимов ЕВВ 26.04.2021
			// Сначала проверим дату запрета
			ШаблонЗапретаДанных = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
			СтрокаШаблона = ШаблонЗапретаДанных.Добавить();
			СтрокаШаблона.Дата   = ДатаДокумента;
			СтрокаШаблона.Раздел = "РегламентныеОперации";
			Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ШаблонЗапретаДанных) Тогда
				Возврат;
			КонецЕсли;				
			// <-- Конец Лико Ефимов ЕВВ 26.04.2021

			// Получим АналитикаУчетаПоПартнерам (типовой механизм)
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	НАЧАЛОПЕРИОДА(Документ.Дата, МЕСЯЦ) КАК Месяц,
			|	Документ.Организация КАК Организация,
			|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
			|	Документ.Ссылка КАК Документ
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Документ
			|		ПО РасчетыСКлиентами.Регистратор = Документ.Ссылка
			|ГДЕ
			|	Документ.Ссылка = &Ссылка
			|	И РасчетыСКлиентами.Активность
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
			|	Документ.Организация,
			|	РасчетыСКлиентами.ОбъектРасчетов,
			|	Документ.Ссылка,
			|	НАЧАЛОПЕРИОДА(Документ.Дата, МЕСЯЦ)";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", ДокументСсылка.Метаданные().Имя);
			Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				// --> Маковеева А.Ю. 11.06.2021
				Лико_УдалитьДублиЗаданийКРаспределениюРасчетов(Выборка, "ЗаданияКРаспределениюРасчетовСКлиентами");
				// <-- Маковеева А.Ю. 11.06.2021
				НаборЗаписей = РегистрыСведений.ЗаданияКРаспределениюРасчетовСКлиентами.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НаборЗаписей, Выборка);			
				НаборЗаписей.НомерЗадания = Константы.НомерЗаданияКРаспределениюРасчетовСКлиентами.Получить();
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 15.01.2019

Функция ПоРеализацииЕстьПредоплата(Реализация) Экспорт // --> Начало Лико Ефимов ЕВВ 23.01.2019

	Запрос = Новый Запрос;
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК Регистратор,
		|	СУММА(РасчетыСКлиентамиПоСрокам.Предоплата) КАК Предоплата
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
		|ГДЕ
		|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСКлиентамиПоДокументам.Регистратор КАК Регистратор,
		|	СУММА(РасчетыСКлиентамиПоДокументам.Предоплата) КАК Предоплата
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
		|ГДЕ
		|	РасчетыСКлиентамиПоДокументам.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентамиПоДокументам.Регистратор";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Регистратор", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Предоплата <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 23.01.2019

Процедура ДополнитьТаблицуСерийДатойИФормированиемВыпуска(ТаблицаСерий) Экспорт // --> Начало Лико Ефимов ЕВВ 12.04.2019
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Серия КАК Серия
	|ПОМЕСТИТЬ ВТ_ТаблицаСерий
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСерий.Серия КАК Серия,
	|	МИНИМУМ(Лико_ФормированиеПаллетаСодержимое.Ссылка.Дата) КАК ДатаВыпуска
	|ПОМЕСТИТЬ Лико_СодержимоеРастаркиСДатамиВыпуска
	|ИЗ
	|	ВТ_ТаблицаСерий КАК ВТ_ТаблицаСерий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
	|		ПО ВТ_ТаблицаСерий.Серия = Лико_ФормированиеПаллетаСодержимое.Серия
	|			И (Лико_ФормированиеПаллетаСодержимое.Ссылка.Проведен)
	|			И (Лико_ФормированиеПаллетаСодержимое.Ссылка.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаСерий.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СодержимоеРастаркиСДатамиВыпуска.Серия КАК Серия,
	|	МАКСИМУМ(ЕСТЬNULL(Лико_ФормированиеПаллетаСодержимое.Ссылка, ЗНАЧЕНИЕ(Документ.Лико_ФормированиеПаллета.ПустаяСсылка))) КАК ФормированиеПаллетаВыпуск
	|ПОМЕСТИТЬ Лико_СодержимоеРастаркиСФормированиями
	|ИЗ
	|	Лико_СодержимоеРастаркиСДатамиВыпуска КАК Лико_СодержимоеРастаркиСДатамиВыпуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
	|		ПО Лико_СодержимоеРастаркиСДатамиВыпуска.Серия = Лико_ФормированиеПаллетаСодержимое.Серия
	|			И Лико_СодержимоеРастаркиСДатамиВыпуска.ДатаВыпуска = Лико_ФормированиеПаллетаСодержимое.Ссылка.Дата
	|			И (Лико_ФормированиеПаллетаСодержимое.Ссылка.Проведен)
	|			И (Лико_ФормированиеПаллетаСодержимое.Ссылка.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции))
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СодержимоеРастаркиСДатамиВыпуска.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СодержимоеРастаркиСФормированиями.Серия КАК Серия,
	|	Лико_СодержимоеРастаркиСФормированиями.ФормированиеПаллетаВыпуск КАК ФормированиеПаллетаВыпуск,
	|	ВЫБОР
	|		КОГДА Лико_СодержимоеРастаркиСФормированиями.ФормированиеПаллетаВыпуск = ЗНАЧЕНИЕ(Документ.Лико_ФормированиеПаллета.ПустаяСсылка)
	|			ТОГДА МИНИМУМ(ТоварыВЯчейкахОбороты.Период)
	|		ИНАЧЕ Лико_СодержимоеРастаркиСФормированиями.ФормированиеПаллетаВыпуск.Дата
	|	КОНЕЦ КАК ДатаВыпуска
	|ИЗ
	|	Лико_СодержимоеРастаркиСФормированиями КАК Лико_СодержимоеРастаркиСФормированиями
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				Серия В
	|					(ВЫБРАТЬ
	|						Т.Серия
	|					ИЗ
	|						Лико_СодержимоеРастаркиСФормированиями КАК Т
	|					ГДЕ
	|						Т.ФормированиеПаллетаВыпуск = ЗНАЧЕНИЕ(Документ.Лико_ФормированиеПаллета.ПустаяСсылка))) КАК ТоварыВЯчейкахОбороты
	|		ПО Лико_СодержимоеРастаркиСФормированиями.Серия = ТоварыВЯчейкахОбороты.Серия
	|			И (ТоварыВЯчейкахОбороты.ВНаличииПриход <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СодержимоеРастаркиСФормированиями.Серия,
	|	Лико_СодержимоеРастаркиСФормированиями.ФормированиеПаллетаВыпуск,
	|	Лико_СодержимоеРастаркиСФормированиями.ФормированиеПаллетаВыпуск.Дата";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаСерий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСДатами = РезультатЗапроса.Выгрузить();
	
	ТаблицаСерий.Колонки.Добавить("ФормированиеПаллетаВыпуск", Новый ОписаниеТипов("ДокументСсылка.Лико_ФормированиеПаллета"));
	ТаблицаСерий.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Для каждого Строка из ТаблицаСерий Цикл
		НайденныеСтроки = ТаблицаСДатами.НайтиСтроки(Новый Структура("Серия", Строка.Серия));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строка, НайденныеСтроки[0]);
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 12.04.2019

Функция ПолучитьХарактеристикуПоЗаказуИНоменклатуре(Номенклатура, Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец
	|	И ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Лико_ЗаказНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХарактеристикиНоменклатуры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Лико_ЗаказНоменклатуры", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НайтиИлиСоздатьОбщийВыпускающийЭтапНаМесяц(Организация, Дата, Подразделение, Характеристика = Неопределено, Склад = Неопределено) Экспорт
	
	// Нужно искать "общий" этап на текущий месяц
	ЭтапСсылка = НайтиОбщийВыпускающийЭтап(Организация, Подразделение, Дата);
	Если НЕ ЗначениеЗаполнено(ЭтапСсылка) Тогда
		// На этот месяц еще нет "общего" этапа, будем создавать
		// Сначала создадим заказ на производство
		ЗаказНаПроизводствоОбъект = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
		ЗаказНаПроизводствоОбъект.Дата = НачалоМесяца(Дата);
		ЗаказНаПроизводствоОбъект.Подразделение = Подразделение;
		ЗаказНаПроизводствоОбъект.Организация = Организация;
		ЗаказНаПроизводствоОбъект.ЗаказПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		ЗаказНаПроизводствоОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ЗаказНаПроизводствоОбъект.РазмещениеВыпуска = Перечисления.СпособыПривязкиОперацийПроизводства.КНачалу;
		ЗаказНаПроизводствоОбъект.ДатаПотребности = ЗаказНаПроизводствоОбъект.Дата;
		ЗаказНаПроизводствоОбъект.НачатьНеРанее = ЗаказНаПроизводствоОбъект.Дата;
		ЗаказНаПроизводствоОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство;
		ЗаказНаПроизводствоОбъект.ВариантОбособления = Перечисления.ВариантыОбособленияМатериаловВПроизводстве.ЭтапПроизводства;
		ЗаказНаПроизводствоОбъект.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию();
		ЗаказНаПроизводствоОбъект.Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству;
		ЗаказНаПроизводствоОбъект.Комментарий = "Заказ создан автоматически. Это ""общий"" заказ на производство для всех заказов клиентов, с момента начала печати которых прошло более 25 дней";
		ЗаказНаПроизводствоОбъект.ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка;
		Если Характеристика = Неопределено Тогда
			// Заказ создает Максим, серии у него нет. Нужно найти любую серию и вставить туда
			ЭтапСсылка = НайтиОбщийВыпускающийЭтап(Организация, Подразделение);
			Если ЭтапСсылка = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			Если ЭтапСсылка.ВыходныеИзделия.Количество() = 0 Тогда
				Возврат Неопределено;
			КонецЕсли;
			Характеристика = ЭтапСсылка.ВыходныеИзделия[0].Характеристика;
			Склад = ЭтапСсылка.ВыходныеИзделия[0].Получатель;
		КонецЕсли;
		НоваяСтрока = ЗаказНаПроизводствоОбъект.Продукция.Добавить();
		НоваяСтрока.Характеристика = Характеристика;
		НоваяСтрока.Номенклатура = НоваяСтрока.Характеристика.Владелец;
		НоваяСтрока.КоличествоУпаковок = 1;
		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Склад = Склад;
		ЗаказНаПроизводствоОбъект.Записать(РежимЗаписиДокумента.Проведение);
		// Теперь создаем этап
		ЭтапОбъект = Документы.ЭтапПроизводства2_2.СоздатьДокумент();
		ЭтапОбъект.Дата = ЗаказНаПроизводствоОбъект.Дата;
		ЭтапОбъект.Распоряжение = ЗаказНаПроизводствоОбъект.Ссылка;
		ЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
		ЭтапОбъект.ПартияПроизводства = Лико_Планирование.НайтиСоздатьПартиюПроизводства(ЭтапОбъект.Распоряжение);
		ЭтапОбъект.Подразделение = ЭтапОбъект.Распоряжение.Подразделение;
		ЭтапОбъект.Организация = Организация;
		ЭтапОбъект.ВыпускПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		ЭтапОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ЭтапОбъект.Комментарий = "Этап создан автоматически. Это ""общий"" этап для всех заказов, с момента начала печати которых прошло более 25 дней";
		ЭтапОбъект.НаименованиеЭтапа = "Упаковка";
		ЭтапОбъект.КоличествоУпаковокПлан = 1;
		ЭтапОбъект.МаршрутнаяКарта = Справочники.Лико_ПредопределенныеЗначения.МаршрутнаяКартаУпаковка.ЗначениеПараметра;
		ЭтапОбъект.КоэффициентМаршрутнойКарты = 1;
		ЭтапОбъект.ВидЭтапа = Справочники.Лико_ВидыЭтаповПроизводства.Упаковка;
		ЭтапОбъект.СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости;
		ЭтапОбъект.ЯвляетсяНазначениемПродукции = Истина;
		ЭтапОбъект.Лико_ЭтоОбщийЭтапНаМесяц = Истина;
		ЭтапОбъект.ТипПроизводственногоПроцесса = ЗаказНаПроизводствоОбъект.ТипПроизводственногоПроцесса;
		ЭтапОбъект.ЕдиницаИзмеренияДлительностиЭтапа = Перечисления.ЕдиницыИзмеренияВремени.День;
		ЭтапОбъект.ЕдиницаИзмеренияПредварительногоБуфера = Перечисления.ЕдиницыИзмеренияВремени.День;
		ЭтапОбъект.ЕдиницаИзмеренияЗавершающегоБуфера = Перечисления.ЕдиницыИзмеренияВремени.День;
		ЭтапОбъект.ХозяйственнаяОперация = ЗаказНаПроизводствоОбъект.ХозяйственнаяОперация;
		ЭтапОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		ЭтапОбъект.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		//ЭтапОбъект.ЖелаемаяДатаОбеспечения = ЭтапОбъект.Дата;
		ЭтапОбъект.ДополнительныеСвойства.Вставить("Лико_НеРассчитыватьНормативныйГрафик", Истина);
		ЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ЭтапСсылка = ЭтапОбъект.Ссылка;			
	КонецЕсли;
	Возврат ЭтапСсылка;
	
КонецФункции

Функция НайтиОбщийВыпускающийЭтап(Организация, Подразделение, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|ГДЕ
	|	ЭтапПроизводства2_2.Проведен
	|	И НЕ ЭтапПроизводства2_2.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &НачалоМесяца = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2.Дата, МЕСЯЦ) = &НачалоМесяца
	|		КОНЕЦ
	|	И ЭтапПроизводства2_2.Лико_ЭтоОбщийЭтапНаМесяц
	|	И ЭтапПроизводства2_2.Подразделение = &Подразделение
	|	И ЭтапПроизводства2_2.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &НачалоМесяца = НЕОПРЕДЕЛЕНО
	|				ТОГДА ЭтапПроизводства2_2.ВыходныеИзделия.НомерСтроки = 1
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапПроизводства2_2.Дата УБЫВ,
	|	ЭтапПроизводства2_2.Номер";
	
	Запрос.УстановитьПараметр("НачалоМесяца", ?(ЗначениеЗаполнено(Дата), НачалоМесяца(Дата), Неопределено));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьЭтоРабочаяБаза() Экспорт
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы(); //Пример: Srvr="test-1c";Ref="erp_demo";
	ДлинаСтроки = СтрДлина(СтрокаСоединения);
	//Отрежем имя базы - справа до второй кавычки
	ИмяБазы = "";
	КолКавычек = 0;
	Для сч=1 По ДлинаСтроки Цикл
		ТекСимвол = Сред(СтрокаСоединения, ДлинаСтроки-сч+1, 1);
		Если КолКавычек = 1 И ТекСимвол <> Символ(34) Тогда
			ИмяБазы = ТекСимвол + ИмяБазы;
		КонецЕсли;
		
		Если ТекСимвол = Символ(34) Тогда
			КолКавычек = КолКавычек + 1;
		КонецЕсли;
		Если КолКавычек = 2 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ВРег(ИмяБазы) = ВРег(Справочники.Лико_ПредопределенныеЗначения.ИмяРабочейБазы1с.ЗначениеПараметра) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция РольДоступнаНаСервере(ИмяРоли) Экспорт
	Возврат РольДоступна(ИмяРоли);
КонецФункции

Функция ПроверитьИспользованиеСерийНаТачпаде(МассивПроверяемыхСерий, ВернутьСтруктуруСерийСРЦ = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 24.10.2019 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СлужебныеБланкиВРаботе
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|ГДЕ
	|	Лико_БланкЭтапа.Дата >= &ДатаНачалаПроверки
	|	И НЕ Лико_БланкЭтапа.ПометкаУдаления
	|	И НЕ Лико_БланкЭтапа.Проведен
	|	И Лико_БланкЭтапа.ЭтоСлужебныйДокументДляТачпадов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	МАКСИМУМ(Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр) КАК РЦ
	|ИЗ
	|	ВТ_СлужебныеБланкиВРаботе КАК ВТ_СлужебныеБланкиВРаботе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|		ПО ВТ_СлужебныеБланкиВРаботе.Ссылка = Лико_БланкЭтапаТовары.Ссылка
	|			И (Лико_БланкЭтапаТовары.Списать)
	|			И (Лико_БланкЭтапаТовары.Серия В (&МассивПроверяемыхСерий))
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Серия";
	
	Запрос.УстановитьПараметр("МассивПроверяемыхСерий", МассивПроверяемыхСерий);
	Запрос.УстановитьПараметр("ДатаНачалаПроверки", ТекущаяДата() - 30*86400); // последние 30 дней
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСерийВРаботе = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВернутьСтруктуруСерийСРЦ Тогда
			МассивСерийВРаботе.Добавить(Новый Структура("Серия,РЦ", ВыборкаДетальныеЗаписи.Серия, ВыборкаДетальныеЗаписи.РЦ));
		Иначе
			МассивСерийВРаботе.Добавить(ВыборкаДетальныеЗаписи.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСерийВРаботе;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 24.10.2019 

Процедура ЗакрытьЭтапыИЗаказ(Заказ, Дата, УбиратьИзПлана = Истина) Экспорт// --> Начало Лико Ефимов ЕВВ 08.01.2018
	
	УстановитьПривилегированныйРежим(Истина);
	// Сначала закроем все этапы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК Ссылка,
	|	ЭтапПроизводства2_2.Статус КАК СтатусЭтапа,
	|	ЕСТЬNULL(ПооперационноеРасписание2_2.Этап, НЕОПРЕДЕЛЕНО) КАК Этап,
	|	ПооперационноеРасписание2_2.Операция КАК Операция,
	|	ПооперационноеРасписание2_2.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ПооперационноеРасписание2_2.НомерПартии КАК НомерПартии,
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
	|	ПооперационноеРасписание2_2.МодельРасписания КАК МодельРасписания,
	|	ПооперационноеРасписание2_2.МодельПланирования КАК МодельПланирования,
	|	ПооперационноеРасписание2_2.ЭтоУдалениеОперации КАК ЭтоУдалениеОперации,
	|	ПооперационноеРасписание2_2.Начало КАК Начало,
	|	ПооперационноеРасписание2_2.Окончание КАК Окончание,
	|	ПооперационноеРасписание2_2.ТактПараллельнойЗагрузки КАК ТактПараллельнойЗагрузки,
	|	ПооперационноеРасписание2_2.Моделирование КАК Моделирование
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|		ПО ЭтапПроизводства2_2.Ссылка = ПооперационноеРасписание2_2.Этап
	|			И (НЕ ПооперационноеРасписание2_2.ЭтоУдалениеОперации)
	|			И (ПооперационноеРасписание2_2.Выполнено = 0)
	|ГДЕ
	|	ЭтапПроизводства2_2.Лико_ЗаказКлиента = &ДокументОснование
	|	И ЭтапПроизводства2_2.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
	|	И НЕ ЭтапПроизводства2_2.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СтатусЭтапа <> Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Этап) И НЕ УбиратьИзПлана Тогда
				// Этап еще стоит в плане, и убирать его оттуда не нужно, поэтому и статус менять у него не будем
				Продолжить;
			КонецЕсли;
			ЭтапОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
			МассивСтрокДляУдаления = ЭтапОбъект.ВыходныеИзделия.НайтиСтроки(Новый Структура("Произведено", Ложь));
			Для каждого Строка из МассивСтрокДляУдаления Цикл
				ЭтапОбъект.ВыходныеИзделия.Удалить(Строка);
			КонецЦикла;
			Попытка
				ЭтапОбъект.Записать();
			Исключение
				Сообщить("Не удалось изменить статус документа """ + ЭтапОбъект + """ на ""Завершен"": " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Этап) Тогда
			Лико_Дополнительно.ОтметитьВыполнениеЭтапаПлана(ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;
	
	Если Заказ.ДатаЗакрытия <> Дата ИЛИ Заказ.Статус <> Перечисления.СтатусыЗаказовКлиентов.Закрыт ИЛИ Заказ.Состояние <> Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		ЗаказОбъект.ДатаЗакрытия = Дата;
		ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
		ЗаказОбъект.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт;
		Попытка
			ЗаказОбъект.Записать();
		Исключение
			Сообщить("Не удалось изменить статус документа """ + ЗаказОбъект + """ на ""Завершен"": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 08.01.2018

Функция ПолучитьМатериалыДляБиркиЧерезСлэш (Заказ,ИспользоватьАльтернативноеНаименованиеМатериалаДляСертификата = Ложь) Экспорт
	
	// --> Начало Лико Ефимов ЕВВ 06.11.2020  Функцию писала Ольга Пухова для обработки Выпуск продукции. Перенес сюда, т.к. использую ее в паспорте качества для ИксПак
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	//ПЕРВЫЕ 2 Убрал по согласованию с Анной
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Материал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЗаказКлиентаВидыРабот.Материал.ЦеноваяГруппа.Лико_НаименованиеДляБирки
	|		ИНАЧЕ ЗаказКлиентаВидыРабот.Материал.Лико_НаименованиеДляБирки
	|	КОНЕЦ КАК Материал,
	|	ЗаказКлиентаВидыРабот.Ссылка.АльтернативноеНаименованиеМатериалаДляСертификата КАК АльтернативноеНаименованиеМатериала
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
	|ГДЕ
	|	НЕ ЗаказКлиентаВидыРабот.Материал ЕСТЬ NULL
	|	И ЗаказКлиентаВидыРабот.Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ЗаказКлиентаВидыРабот.Материал <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка) 
	// --> Начало Лико Ефимов ЕВВ 17.07.2023
	// Почему-то на ТЧ Цвета незаполненных материал - неопределено, а не NULL. Хотя может быть на ВидыРабот было также, просто Оля зря проверяла на NULL
	|	И ЗаказКлиентаВидыРабот.Материал <> НЕОПРЕДЕЛЕНО
	// <-- Конец Лико Ефимов ЕВВ 17.07.2023
	|	И ЗаказКлиентаВидыРабот.Ссылка = &Заказ";
		
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Результат = Запрос.Выполнить().Выгрузить();
	СтрокаМатериалов = ?(ИспользоватьАльтернативноеНаименованиеМатериалаДляСертификата И ЗначениеЗаполнено(Заказ.АльтернативноеНаименованиеМатериалаДляСертификата),Заказ.АльтернативноеНаименованиеМатериалаДляСертификата,
	?(ТипЗнч(Заказ.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура"),Заказ.ОсновнойМатериал.ЦеноваяГруппа.Лико_НаименованиеДляБирки,Заказ.ОсновнойМатериал.Лико_НаименованиеДляБирки)) + ?(Результат.Количество() = 0, ""," / "); //Нужно будет поменять наименование на необходимый реквизит
	ИдПоследнейСтроки = Результат.Количество() - 1;
	Для каждого СтрМатериал Из Результат Цикл
		Если Результат.Индекс(СтрМатериал) < ИдПоследнейСтроки Тогда 
			СтрокаМатериалов = СтрокаМатериалов + СтрМатериал.Материал + "/ ";
		Иначе
			СтрокаМатериалов = СтрокаМатериалов + СтрМатериал.Материал;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаМатериалов;
	
КонецФункции

Процедура ЗаписатьДопРеквизитВОбъект(Ссылка, ИмяДопРеквизита, Значение) Экспорт // --> Начало Лико Ефимов ЕВВ 12.04.2021
	
	УстановитьПривилегированныйРежим(Истина);
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяДопРеквизита);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Сообщить("Не найден доп. реквизит с именем """ + ИмяДопРеквизита + """");
		Возврат;
	КонецЕсли;
	
	ТаблицаСвойств = Новый ТаблицаЗначений;
	ТаблицаСвойств.Колонки.Добавить("Свойство");
	ТаблицаСвойств.Колонки.Добавить("Значение");
	НоваяСтрока = ТаблицаСвойств.Добавить();
	НоваяСтрока.Свойство = Свойство;
	НоваяСтрока.Значение = Значение;
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Ссылка, ТаблицаСвойств);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 12.04.2021

Функция ЯчейкаПринадлежитРЦ(Ячейка, ПроверятьТолькоНаРЦСТачпадамиСоСчетчиками = Ложь) Экспорт// --> Начало Лико Ефимов ЕВВ 24.08.2021 
	
	Если НЕ ЗначениеЗаполнено(Ячейка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РабочиеЦентры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Лико_РабочиеМеста.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьТачпадСоСчетчиком
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_РабочиеМеста КАК Лико_РабочиеМеста
	|		ПО РабочиеЦентры.Ссылка = Лико_РабочиеМеста.ТСРабочийЦентр
	|			И (Лико_РабочиеМеста.ТСНомерПортаOwen <> 0)
	|			И (НЕ Лико_РабочиеМеста.ПометкаУдаления)
	|ГДЕ
	|	РабочиеЦентры.ЛикоЯчейка = &ЛикоЯчейка
	|	И НЕ РабочиеЦентры.ВидРабочегоЦентра В (&ВидыРЦИсключения)
	|	И РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.Ссылка,
	|	ВЫБОР
	|		КОГДА Лико_РабочиеМеста.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЛикоЯчейка", Ячейка);
	Запрос.УстановитьПараметр("ВидыРЦИсключения", Лико_Дополнительно.СформироватьМассивИсключенийВидовРЦДляПоискаЯчеекРЦ());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Если ПроверятьТолькоНаРЦСТачпадамиСоСчетчиками И НЕ Выборка.ЕстьТачпадСоСчетчиком Тогда
				Возврат Неопределено;
			Иначе
				Возврат Выборка.Ссылка;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 24.08.2021 

Функция СформироватьМассивИсключенийВидовРЦДляПоискаЯчеекРЦ() Экспорт // --> Начало Лико Ефимов ЕВВ 27.08.2021
	
	Массив = Новый Массив;
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Прочее);
	Массив.Добавить(Справочники.ВидыРабочихЦентров.ГравировальныйУчасток);
	
	Возврат Массив;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.08.2021 

Процедура ОчиститьВЗаказеПараметрыПеремотки(ЗаказОбъект) Экспорт // --> Начало Лико Ефимов ЕВВ 15.09.2021 
	
	Для каждого Строка из ЗаказОбъект.Товары Цикл
		Строка.Направление = Неопределено;
		Строка.МаксимальныйДиаметрРулона = Неопределено;
		Строка.ВнутреннийДиаметр = Неопределено;
		Строка.КоличествоЭтикетокВРолике = Неопределено;
		Строка.ДиаметрРоликаФакт = Неопределено;
		Строка.ПродольнаяРезка = Неопределено;
		Строка.ПоперечнаяРезка = Неопределено;
		Строка.Кромка = Неопределено;
		Строка.БезКромки = Неопределено;
		Строка.ПодрезкаКромки = Неопределено;
		Строка.Город = Неопределено;
		Строка.ДопЭтикетокВРолике = Неопределено;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 15.09.2021 

Функция НайтиСоглашениеИлиДоговорВРегистреЗаполненияРеглДок(ТипСправочника, ОрганизацияДоговора, КонтрагентДоговора, ТипДоговора = Неопределено, Валюта, ТипПродукции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаполениеРегламентированныхДокументов.Организация КАК Организация,
		|	Лико_ЗаполениеРегламентированныхДокументов.Контрагент КАК Контрагент,
		|	Лико_ЗаполениеРегламентированныхДокументов.Валюта КАК Валюта,
		|	Лико_ЗаполениеРегламентированныхДокументов.ТипОперации КАК ТипОперации,
		|	Лико_ЗаполениеРегламентированныхДокументов.ТипПродукции КАК ТипПродукции,
		|	Лико_ЗаполениеРегламентированныхДокументов.Договор КАК Договор,
		|	Лико_ЗаполениеРегламентированныхДокументов.Соглашение КАК Соглашение,
		|	Лико_ЗаполениеРегламентированныхДокументов.СпособДоставки КАК СпособДоставки
		|ИЗ
		|	РегистрСведений.Лико_ЗаполениеРегламентированныхДокументов КАК Лико_ЗаполениеРегламентированныхДокументов
		|ГДЕ
		|	Лико_ЗаполениеРегламентированныхДокументов.Организация = &Организация
		|	И Лико_ЗаполениеРегламентированныхДокументов.Контрагент = &Контрагент
		|	И Лико_ЗаполениеРегламентированныхДокументов.Валюта = &Валюта
		|	И Лико_ЗаполениеРегламентированныхДокументов.ТипПродукции = &ТипПродукции";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентДоговора);
	Запрос.УстановитьПараметр("Организация", ОрганизацияДоговора);
	Запрос.УстановитьПараметр("ТипПродукции", ТипПродукции);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ТипСправочника = "ДоговорыКонтрагентов" Тогда
			Возврат ВыборкаДетальныеЗаписи.Договор;
		Иначе
			Возврат ВыборкаДетальныеЗаписи.Соглашение;
		КонецЕсли;
	КонецЕсли;
	
	// Если дошло сюда, значит в регистре Лико_ЗаполениеРегламентированныхДокументов данные не нашлись. Попробуем найти старым методом
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Справочник
		|ГДЕ
		|	Справочник.Организация = &Организация
		|	И Справочник.Контрагент = &Контрагент
		|	И Справочник.Статус = &Статус
		|	И &ДопУсловия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Справочник.ДатаОкончанияДействия УБЫВ,
		|	Справочник.Наименование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоговорыКонтрагентов", ТипСправочника);
	Если ТипСправочника = "ДоговорыКонтрагентов" Тогда
		СтатусДоговора = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловия", " ТипДоговора = &ТипДоговора И ВалютаВзаиморасчетов = &Валюта");
		Запрос.УстановитьПараметр("ТипДоговора", ТипДоговора);
	ИначеЕсли ТипСправочника = "СоглашенияСКлиентами" Тогда
		СтатусДоговора = Перечисления.СтатусыСоглашенийСКлиентами.Действует;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловия", " Валюта = &Валюта");
	ИначеЕсли ТипСправочника = "СоглашенияСПоставщиками" Тогда
		СтатусДоговора = Перечисления.СтатусыСоглашенийСПоставщиками.Действует;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловия", " Валюта = &Валюта");
	Иначе
		Сообщить("Тип справочника """ + ТипСправочника + """ не определен.");
		Возврат Неопределено
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", ОрганизацияДоговора);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентДоговора);
	Запрос.УстановитьПараметр("Статус", СтатусДоговора);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Сообщить("Не найден " + ТипСправочника + " для организации """ + ОрганизацияДоговора + """ и контрагента """ + КонтрагентДоговора + """");
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
    
Процедура ДопровестиБланкЭтапаВФоне(ЗакрытиеБланкаСсылка) Экспорт // --> Начало Лико Ефимов ЕВВ 09.12.2021
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ЗакрытиеБланкаСсылка.ДатаПроведенияПоОбязательнымРегистрам) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		ЗакрытиеБланкаОбъект =  ЗакрытиеБланкаСсылка.ПолучитьОбъект();
		ЗакрытиеБланкаОбъект.ДатаПроведенияПоОбязательнымРегистрам = Неопределено;
		ЗакрытиеБланкаОбъект.ДополнительныеСвойства.Вставить("ЭтоТачПадРЦ");
		ЗакрытиеБланкаОбъект.Записать(?(ЗакрытиеБланкаОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		ЗафиксироватьТранзакцию();
	Исключение
		Попытка
		ЗакрытиеБланкаОбъект =  ЗакрытиеБланкаСсылка.ПолучитьОбъект();
		ЗакрытиеБланкаОбъект.ДатаПроведенияПоОбязательнымРегистрам = Неопределено;
		ЗакрытиеБланкаОбъект.ДополнительныеСвойства.Вставить("ЭтоТачПадРЦ");
		ЗакрытиеБланкаОбъект.Записать(?(ЗакрытиеБланкаОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		ЗафиксироватьТранзакцию();
		Исключение
			Попытка
		ЗакрытиеБланкаОбъект =  ЗакрытиеБланкаСсылка.ПолучитьОбъект();
		ЗакрытиеБланкаОбъект.ДатаПроведенияПоОбязательнымРегистрам = Неопределено;
		ЗакрытиеБланкаОбъект.ДополнительныеСвойства.Вставить("ЭтоТачПадРЦ");
		ЗакрытиеБланкаОбъект.Записать(?(ЗакрытиеБланкаОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		ЗафиксироватьТранзакцию();
			Исключение
				Попытка
		ЗакрытиеБланкаОбъект =  ЗакрытиеБланкаСсылка.ПолучитьОбъект();
		ЗакрытиеБланкаОбъект.ДатаПроведенияПоОбязательнымРегистрам = Неопределено;
		ЗакрытиеБланкаОбъект.ДополнительныеСвойства.Вставить("ЭтоТачПадРЦ");
		ЗакрытиеБланкаОбъект.Записать(?(ЗакрытиеБланкаОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
					СобытиеЖурналаРегистрации = НСтр(
					"ru = 'Проведение закрытия бланка в фоне'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
					ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации,
					УровеньЖурналаРегистрации.Ошибка,
					ЗакрытиеБланкаСсылка.Метаданные(),
					ЗакрытиеБланкаСсылка,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ВызватьИсключение;
				КонецПопытки;
			КонецПопытки;
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 09.12.2021

Процедура ДопровестиФормированияПаллетаВФоне(ПараметрыВыборки) Экспорт // --> Начало Лико Ефимов ЕВВ 03.11.2023
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПараметров = Новый Структура;
	Если ПараметрыВыборки.ВыпускИзРастарки Тогда 
		СтруктураПараметров.Вставить("Лико_НомерЦепочкиВРаспоряженииНаРастарку", ПараметрыВыборки.НомерЦепочкиВРаспоряженииНаРастарку);
		СтруктураПараметров.Вставить("Лико_РаспоряжениеНаРастарку", ПараметрыВыборки.РаспоряжениеНаРастарку);
		
		ЗапросДвижений = Новый Запрос;
		ЗапросДвижений.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейках.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
		|	ТоварыВЯчейках.ВНаличии КАК Количество,
		|	ТоварыВЯчейках.Серия.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку,
		|	ТоварыВЯчейках.Серия.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
		|	ТоварыВЯчейках.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейках.Серия КАК Серия,
		|	ТоварыВЯчейках.Упаковка КАК Упаковка,
		|	ТоварыВЯчейках.Характеристика КАК Характеристика,
		|	ТоварыВЯчейках.ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|ГДЕ
		|	ТоварыВЯчейках.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Заказ КАК Заказ,
		|	ВТ.Количество КАК Количество,
		|	ВТ.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку,
		|	ВТ.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Серия КАК Серия,
		|	ВТ.Упаковка КАК Упаковка,
		|	ВТ.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Заказ КАК Заказ,
		|	ВТ.Количество КАК Количество,
		|	ВТ.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку,
		|	ВТ.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Серия КАК Серия,
		|	ВТ.Упаковка КАК Упаковка,
		|	ВТ.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
		
		ЗапросДвижений.УстановитьПараметр("Регистратор", ПараметрыВыборки.КорректировкаРегистров);
		РезультатЗапросаДвижений = ЗапросДвижений.ВыполнитьПакет();
		
		СтруктураПараметров.Вставить("ТаблицаСерийВыпускаПоРаспоряжению", РезультатЗапросаДвижений[1].Выгрузить());
		СтруктураПараметров.Вставить("ТаблицаСерийРастаркиПоРаспоряжению", РезультатЗапросаДвижений[2].Выгрузить());
		
	Иначе
		СтруктураПараметров.Вставить("Заказ", ПараметрыВыборки.Заказ);	
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыВыборки);
	МенеджерЗаписи.Документ = ПараметрыВыборки.ФормированиеПаллета;
	МенеджерЗаписи.ТиповойДокумент = ПараметрыВыборки.КорректировкаРегистров;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Лико_Планирование.ОтправитьПисьмо("Ошибка при чтении РС для установки ДатаНачалаОбработки. Запись не выбрана. " + ПараметрыВыборки.ФормированиеПаллета, "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
		Возврат;
	КонецЕсли;
	Если МенеджерЗаписи.ДатаНачалаОбработки >= ПараметрыВыборки.ДатаОбработки Тогда
		//Лико_Планирование.ОтправитьПисьмо("Ошибка при проверке ДатаНачалаОбработки " + ПараметрыВыборки.ФормированиеПаллета + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
		Возврат;
	Иначе
		МенеджерЗаписи.ДатаНачалаОбработки = ТекущаяДата(); // Установим дату начала обработки, чтобы другие потоки не пытались ее изменить
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			Лико_Планирование.ОтправитьПисьмо("Ошибка при установке ДатаНачалаОбработки " + ПараметрыВыборки.ФормированиеПаллета + ": " + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	НачатьТранзакцию();
	МассивДокументовКУдалению = Новый Массив;
	МассивДокументовКУдалению.Добавить(ПараметрыВыборки.КорректировкаРегистров);
	Лико_Дополнительно.ПометитьНаУдалениеДокументыМассива(МассивДокументовКУдалению, Неопределено);
	ФормированиеПаллетаОбъект = ПараметрыВыборки.ФормированиеПаллета.ПолучитьОбъект();
	ТаблицаНовыхДокументов = ФормированиеПаллетаОбъект.СоздатьТиповыеДокументы(СтруктураПараметров);
	
	Если ТипЗнч(ТаблицаНовыхДокументов) = Тип("Булево") И ТаблицаНовыхДокументов = Ложь Тогда
		// Что-то не получилось
		//Лико_Планирование.ОтправитьПисьмо("Ошибка при допроведении " + ПараметрыВыборки.ФормированиеПаллета, "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
		ОчиститьДатуОбработкиВСвязяхСТиповымиДокументамиПриОшибке(ПараметрыВыборки);
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыВыборки);
	МенеджерЗаписи.Документ = ПараметрыВыборки.ФормированиеПаллета;
	МенеджерЗаписи.ТиповойДокумент = ПараметрыВыборки.КорректировкаРегистров;
	МенеджерЗаписи.Прочитать();
	Попытка
		МенеджерЗаписи.Удалить();	
	Исключение
		ОтменитьТранзакцию();
		Лико_Планирование.ОтправитьПисьмо("Ошибка при удалении записи о корректировке " + ПараметрыВыборки.ФормированиеПаллета + ": " + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
		ОчиститьДатуОбработкиВСвязяхСТиповымиДокументамиПриОшибке(ПараметрыВыборки);
		Возврат;	
	КонецПопытки;
	
	// Удалим документ корректировки 
	КорректировкаОбъект = ПараметрыВыборки.КорректировкаРегистров.ПолучитьОбъект();
	Попытка
		КорректировкаОбъект.Удалить();
	Исключение
		ОтменитьТранзакцию();
		//Лико_Планирование.ОтправитьПисьмо("Ошибка при удалении документа корректировки " + ПараметрыВыборки.КорректировкаРегистров + ": " + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
		ОчиститьДатуОбработкиВСвязяхСТиповымиДокументамиПриОшибке(ПараметрыВыборки);
		Возврат;	
	КонецПопытки; 

	СчНовыхДокументов = 0;
	Для каждого НовыйДокумент из ТаблицаНовыхДокументов Цикл
		МенеджерЗаписи = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыВыборки); // Здесь заполнятся старые данные
		МенеджерЗаписи.Документ = ПараметрыВыборки.ФормированиеПаллета;
		МенеджерЗаписи.ТиповойДокумент = НовыйДокумент.Документ;
		МенеджерЗаписи.НомерВЦепочке = МенеджерЗаписи.НомерВЦепочке + СчНовыхДокументов;
		Попытка
			МенеджерЗаписи.Записать();	
		Исключение
			ОтменитьТранзакцию();
			Лико_Планирование.ОтправитьПисьмо("Ошибка при добавлении новой записи в регистр " + ПараметрыВыборки.ФормированиеПаллета + ": " + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
			ОчиститьДатуОбработкиВСвязяхСТиповымиДокументамиПриОшибке(ПараметрыВыборки);
			Возврат;	
		КонецПопытки;
		СчНовыхДокументов = СчНовыхДокументов + 1;
	КонецЦикла;  
	
	ЗафиксироватьТранзакцию(); 
		
	// Перенес это в обработку Лико_ДопровестиФормированияПаллет
	// Проверим, остались ли еще корректировки регистров в этом формировании
	//ЗапросКорректировок = Новый Запрос;
	//ЗапросКорректировок.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Лико_ФормированиеПаллета.Ссылка КАК Ссылка,
	//|	Лико_ФормированиеПаллета.ДатаУпрощенногоПроведения КАК ДатаУпрощенногоПроведения,
	//|	Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Корректировка
	//|ИЗ
	//|	Документ.Лико_ФормированиеПаллета КАК Лико_ФормированиеПаллета
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
	//|		ПО (Лико_ФормированиеПаллета.Ссылка = (ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ФормированиеПаллета)))
	//|			И (Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.КорректировкаРегистров)
	//|ГДЕ
	//|	Лико_ФормированиеПаллета.Ссылка = &Документ";
	//
	//ЗапросКорректировок.УстановитьПараметр("Документ", ПараметрыВыборки.ФормированиеПаллета);
	//
	//ВыборкаЗапросаКорректировок = ЗапросКорректировок.Выполнить().Выбрать();
	//Если ВыборкаЗапросаКорректировок.Следующий()
	//	И ЗначениеЗаполнено(ВыборкаЗапросаКорректировок.ДатаУпрощенногоПроведения)
	//	И ВыборкаЗапросаКорректировок.Корректировка = NULL
	//	И НЕ ФормированиеПаллетаОбъект.Заблокирован() Тогда
	//	ОчиститьДатуУпрощенногоПроведенияВФормированииПаллета(ПараметрыВыборки.ФормированиеПаллета, ФормированиеПаллетаОбъект);
	//КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 03.11.2023

Процедура ПровестиЗаказКлиентаВФоне(ЗаказКлиентаСсылка, МассивДопСвойств) Экспорт // --> Начало Лико Ефимов ЕВВ 04.12.2023

	ЗаказОбъект = ЗаказКлиентаСсылка.ПолучитьОбъект();
	Для каждого ТекСтруктураСвойства из МассивДопСвойств Цикл
		ЗаказОбъект.ДополнительныеСвойства.Вставить(ТекСтруктураСвойства.Имя, ТекСтруктураСвойства.Значение);
	КонецЦикла;

	Попытка
		ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись), РежимПроведенияДокумента.Неоперативный);
	Исключение
		Лико_Планирование.ОтправитьПисьмо("" + ЗаказОбъект + ": " + ОписаниеОшибки(), "Не провелся заказ в фоне", "vefimov@okil.ru",,,,,, Ложь);
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 04.12.2023

Процедура ОчиститьДатуУпрощенногоПроведенияВФормированииПаллета(ФормированиеПаллетаСсылка, ФормированиеПаллетаОбъект = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 23.11.2023

	Если НЕ ЗначениеЗаполнено(ФормированиеПаллетаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ФормированиеПаллетаОбъект = Неопределено Тогда
		ФормированиеПаллетаОбъект = ФормированиеПаллетаСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ДокументЗаблокирован = Ложь;
	ДатаНачалаБлокировки = ТекущаяДата();
	Попытка
		ФормированиеПаллетаОбъект.Заблокировать();
		ДокументЗаблокирован = Истина;
	Исключение
		//Лико_Планирование.ОтправитьПисьмо("Ошибка при блокировке (" + ДатаНачалаБлокировки + " - " + ТекущаяДата() + ") " + ФормированиеПаллетаСсылка + ": " + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
		Возврат;	
	КонецПопытки;
	Если ДокументЗаблокирован Тогда
		// Корректировок не осталось, можно убрать ДатаУпрощенногоПроведения
		ФормированиеПаллетаОбъект.ДатаУпрощенногоПроведения = Неопределено;
		ФормированиеПаллетаОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ФормированиеПаллетаОбъект.Записать();
			ФормированиеПаллетаОбъект.Разблокировать();
		Исключение
			Лико_Планирование.ОтправитьПисьмо("Ошибка при очистке ДатаУпрощенногоПроведения " + ФормированиеПаллетаСсылка + ": " +  + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
			Возврат;	
		КонецПопытки; 
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 23.11.2023

Процедура ОчиститьДатуОбработкиВСвязяхСТиповымиДокументамиПриОшибке(ПараметрыВыборки) // --> Начало Лико Ефимов ЕВВ 24.11.2023

	МенеджерЗаписи = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыВыборки);
	МенеджерЗаписи.Документ = ПараметрыВыборки.ФормированиеПаллета;
	МенеджерЗаписи.ТиповойДокумент = ПараметрыВыборки.КорректировкаРегистров;
	МенеджерЗаписи.Прочитать(); 
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ДатаНачалаОбработки = Неопределено;
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			Лико_Планирование.ОтправитьПисьмо("Ошибка при очистке ДатаНачалаОбработки " + ПараметрыВыборки.ФормированиеПаллета + ": " + ОписаниеОшибки(), "Допроведение формирований паллет", "vefimov@okil.ru",,,,,, Ложь);
			Возврат;
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 24.11.2023

Процедура ЗапуститьПерепроведениеЗаказаВФоне(ЗаказСсылка) Экспорт
	
	ИмяМетода = "Лико_Дополнительно.ПровестиЗаказКлиентаВФоне";
	
	ПараметрыПроцедуры = Новый Массив();
	ПараметрыПроцедуры.Добавить(ЗаказСсылка); 
	МассивДопСвойств = Новый Массив;
	МассивДопСвойств.Добавить(Новый Структура("Имя,Значение", "Лико_ЗаполнитьВыработку", Истина));
	ПараметрыПроцедуры.Добавить(МассивДопСвойств); 
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ИмяМетода);
	ПараметрыЗадания.Добавить(ПараметрыПроцедуры);
	
	КлючЗадания = "ПровестиЗаказКлиентаВФоне" + Строка(ЗаказСсылка.УникальныйИдентификатор());
	
	НаименованиеЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Проведение заказа клиента в фоне'"),
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказСсылка, "Представление"));
	
	Попытка
		ФоновыеЗадания.Выполнить(
		"ОбщегоНазначения.ВыполнитьМетодКонфигурации",
		ПараметрыЗадания,
		КлючЗадания,
		НаименованиеЗадания);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

//+m.shenderov 02.07.2017 

//Функция проверяет значение свойства у родителей справочника.
//
//Параметры:
//  СправочникСсылка 	- СправочникСсылка 	- Ссылка, для которой необходимо проверить значение свойства у родителя.
//  ИмяСвойства 		- Строка 			- Имя свойства.
//  ЗначениеСвойства 	- Булево 			- Значение свойства. 
//
//  Возвращаемое значение:
//     Булево. 
//
Функция ПроверкаЗначенияСвойстваУРодителей(Справочникссылка,ИмяСвойства,ЗначениеСвойства=Истина)  Экспорт 
	ИмяСправочника=Справочникссылка.метаданные().Имя;
	Если  Не ЗначениеЗаполнено(СправочникСсылка) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Уровень = СправочникСсылка.Уровень();
	Объединить 	= "";
	Родитель 	= "";
	Текст 		= "";
	// --> Начало Лико Ефимов ЕВВ 30.08.2017
	// Уровень у элемента, у которого нет родителя = 0, поэтому код не отрабатывал
	//Для Номер = 1 По Уровень Цикл
	//Родитель = Родитель + ".Родитель";
	//Если Номер <> 1 Тогда
	Для Номер = 0 По Уровень Цикл
		Родитель = Родитель + ".Родитель";
		Если Номер <> 0 Тогда
			// <-- Конец Лико Ефимов ЕВВ 30.08.2017
			Объединить = "
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		Текст = Текст + Объединить + "
		|ВЫБРАТЬ "+
		ИмяСправочника + Родитель + " КАК Родитель
		|	ИЗ
		|		Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
		|	ГДЕ "+
		ИмяСправочника+ Родитель+"."+ИмяСвойства+"=&ЗначениеСвойства и "+
		ИмяСправочника+".Ссылка = &Элемент";
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	База.Родитель КАК Родитель
	|ИЗ
	|	(" + Текст + ") КАК База";
	Запрос.УстановитьПараметр("Элемент", Справочникссылка);
	Запрос.УстановитьПараметр("ЗначениеСвойства", ЗначениеСвойства);
	
	
	Возврат Не Запрос.Выполнить().Пустой();
	
	
КонецФункции //ПроверкаНаличияСвойстваУРодителей

Процедура АктуализацияРезерваМатериаловПоЗаказу(Заказ) Экспорт //+Лико m.shenderov 15.02.2018
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &Заказ
	|	И Лико_ПодготовкаМатериалов.Проведен
	|	И НЕ Лико_ПодготовкаМатериалов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Заказ",Заказ );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокОбъект=Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
	
КонецПроцедуры //-Лико m.shenderov 15.02.2018




//Заполняет служебный реквизит нарезка по номенклатуре в коллекции .
//
//Параметры:
//  КоллекцияДанных		 - ДанныеФормыКоллекция, ТаблицаЗначний	 - Таблица, в которой необходимо заполнить реквизиты
//
//
Процедура ЗаполнениеСлужебногоРеквизитаНарезкаПоНоменклатуреВКоллекции(КоллекцияДанных,ИмяСвойства="Лико_РулонныйМатериал")  Экспорт 
	Для каждого СтрДанных Из КоллекцияДанных Цикл 	
		ИмяСправочника="ВидыНоменклатуры";
		Уровень = СтрДанных.Номенклатура.ВидНоменклатуры.Уровень();
		Объединить 	= "";
		Родитель 	= "";
		Текст 		= "";
		Для Номер = 1 По Уровень Цикл
			Родитель = Родитель + ".Родитель";
			Если Номер <> 1 Тогда
				Объединить = "
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|";
			КонецЕсли;
			Текст = Текст + Объединить + "
			|ВЫБРАТЬ "+
			ИмяСправочника + Родитель + " КАК Родитель
			|	ИЗ
			|		Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
			|	ГДЕ "+
			ИмяСправочника+ Родитель+"."+ИмяСвойства+"=&ЗначениеСвойства и "+
			ИмяСправочника+".Ссылка = &Элемент";
		КонецЦикла;
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	База.Родитель КАК Родитель
		|ИЗ
		|	(" + Текст + ") КАК База";
		Запрос.УстановитьПараметр("Элемент", СтрДанных.Номенклатура.ВидНоменклатуры);
		Запрос.УстановитьПараметр("ЗначениеСвойства", Истина);
		
		
		СтрДанных.НарезкиИспользуются= Не Запрос.Выполнить().Пустой(); 
		
	КонецЦикла;
	
	
КонецПроцедуры //ПроверкаНаличияСвойстваУРодителей

// Печатает стикер объекта номенклатуры
// Параметр Количество используется в том случае, когда необходимо распечатать стикер с количеством, отличным от актуального
// К примеру, если длина роля 2 000, а печать необходима для 1 500.
Функция ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры, КоличествоЭкземпляров=1, БыстраяПечать=Ложь, ПечатьОтветственногоИНомерЗаказа=Истина, Количество=0,ИнфоКамф=Неопределено,ОбъектНабораПараметров=Неопределено,ИмяПринтера="") Экспорт
     УстановитьПривилегированныйРежим(Истина);
	//!ЯССМ_ПечататьКороткийШтрихКодОбъекта = ЯС_Общие.ПолучитьСвойствоОбъекта("ЯССМ_ПечататьКороткийШтрихКодОбъекта",ОбъектНабораПараметров , Ложь);
	ЯССМ_ПечататьКороткийШтрихКодОбъекта=Истина;

	ШКСТрокой = "";

	//!Объект = ОбъектНоменклатуры.ПолучитьОбъект();
	//!КоличествоНаПечать = ?(Количество=0, Объект.Количество, Количество);
	//!КоличествоУУНаПечать = ЯССМ_ОбщийМодуль.РассчитатьКоличествоУУ(ОбъектНоменклатуры, КоличествоНаПечать);

	КоличествоНаПечать = ?(Количество=0, ОбъектНоменклатуры.Количество, Количество);
	// начало Лико Ефимов
	Если Количество = -1 Тогда
		КоличествоНаПечать = 0;
	КонецЕсли;
	// конец Лико Ефимов
	КоличествоУУНаПечать=КоличествоНаПечать*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;

	Если ЯССМ_ПечататьКороткийШтрихКодОбъекта Тогда
		ШК = Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьКороткийШтрихКод(ОбъектНоменклатуры,ШКСтрокой, КоличествоНаПечать); //длина штрихкода - 15
	Иначе
		ШК = Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьКороткийШтрихКод(ОбъектНоменклатуры,ШКСтрокой, КоличествоНаПечать); //длина штрихкода - 30
	КонецЕсли;

	НоменклатураОбъект = ОбъектНоменклатуры.Номенклатура;

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Ответственный", ?(ПечатьОтветственногоИНомерЗаказа,ФамилияИнициалыФизЛица(ОбъектНоменклатуры.Ответственный), ""));
	//ПараметрыПечати.Вставить("Ответственный",  "");

	Если ЗначениеЗаполнено(ОбъектНоменклатуры.Ответственный) Тогда
		//ДанныеОтветственного = ПолучитьДанныеПоРаботнику(Объект.Ответственный.Ссылка, ТекущаяДата());
		ПараметрыПечати.Вставить("ТабельныйНомерОтветственного", ?(ПечатьОтветственногоИНомерЗаказа, ТабельныйНомерФизЛица(ОбъектНоменклатуры.Ответственный), ""));
	КонецЕсли;
	ВидКонтакта="";
	Попытка
		ВидКонтакта=СтрЗаменить(ОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией.Наименование,"Категория","Кат");
		Если ЗначениеЗаполнено(ВидКонтакта) Тогда
			ВидКонтакта=" ("+ВидКонтакта+")";
		КонецЕсли;

	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	ПараметрыПечати.Вставить("НомерЗаказа", ""+Формат(ОбъектНоменклатуры.НомерЗаказаКлиента, "ЧГ=0")+?(ОбъектНоменклатуры.НомерБланка<>0, "/"+ОбъектНоменклатуры.НомерБланка, ""));
	ПараметрыПечати.Вставить("НомерБланка", "Бл. "+ОбъектНоменклатуры.НомерБланка);
	
	//+ Лико m.shenderov 04.10.2021
	НомерПроката=ОбъектНоменклатуры.ЗакрытиеБланка.НомерПроката;
	Если  ЗначениеЗаполнено(НомерПроката) Тогда
		 ПараметрыПечати.Вставить("НомерБланка", "Бл."+ОбъектНоменклатуры.НомерБланка+"/Пр."+НомерПроката);
	КонецЕсли;
	//- Лико m.shenderov 04.10.2021
	
	// <-- Начало Лико Яцун С. В. 09.09.2024 
	Если ОбъектНоменклатуры.Номенклатура.ВидНоменклатуры.Наименование = "Рулонные материалы" Тогда
		ПризнакВК = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПартииПроизводства.Партия КАК Партия
		|ПОМЕСТИТЬ ВТПартия
		|ИЗ
		|	РегистрСведений.Лико_ПартииПроизводства КАК Лико_ПартииПроизводства
		|ГДЕ
		|	Лико_ПартииПроизводства.СерияОбъектНоменклатуры = &СерияОбъектНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&СерияОбъектНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПартия.Партия КАК Партия
		|ИЗ
		|	ВТПартия КАК ВТПартия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_РезультатыТестированияМатериалов КАК Лико_РезультатыТестированияМатериалов
		|		ПО (ВТПартия.Партия = Лико_РезультатыТестированияМатериалов.Серия
		|				ИЛИ ВТПартия.Партия = Лико_РезультатыТестированияМатериалов.Серия.ЯССМ_ОбъектНоменклатуры)
		|ГДЕ
		|	Лико_РезультатыТестированияМатериалов.Результат = ЗНАЧЕНИЕ(Перечисление.Лико_ДаНет.Да)
		|	И Лико_РезультатыТестированияМатериалов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ОперацииТестированиеМатериалов.ВходнойКонтроль)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПартия.Партия";
		
		Запрос.УстановитьПараметр("СерияОбъектНоменклатуры", ОбъектНоменклатуры);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПризнакВК = Истина;
		КонецЦикла;
		ПараметрыПечати.Вставить("ПризнакВК", ?(ПризнакВК,"ВК",""));
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 09.09.2024
	
	ПараметрыПечати.Вставить("НарезкаВтулка", ?(ЗначениеЗаполнено(ОбъектНоменклатуры.Нарезка), "Ø"+ОбъектНоменклатуры.Нарезка+" ", "") + ?(ЗначениеЗаполнено(ОбъектНоменклатуры.Втулка), "("+ОбъектНоменклатуры.Втулка+")", ""));
	ПараметрыПечати.Вставить("КодНоменклатуры", ОбъектНоменклатуры.КодНоменклатуры+ВидКонтакта);
	ПараметрыПечати.Вставить("Наименование", НоменклатураОбъект.Наименование);
	ПараметрыПечати.Вставить("Артикул", ?(СокрЛП(НоменклатураОбъект.Артикул)="", "", "("+НоменклатураОбъект.Артикул+")"));
	ПараметрыПечати.Вставить("Количество", "" + КоличествоНаПечать);
	ПараметрыПечати.Вставить("КоличествоУУ", "" + КоличествоУУНаПечать);
	ПараметрыПечати.Вставить("БазоваяЕдиницаИзмерения", "" + ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);
	ПараметрыПечати.Вставить("ЕдиницаИзмеренияУУ", "" + ОбъектНоменклатуры.ЕдиницаИзмеренияУУ);
	//ПараметрыПечати.Вставить("ЕдиницаИзмеренияУУПоКлассификатору", "" + ОбъектНоменклатуры.ЕдиницаИзмеренияУУ.ЕдиницаПоКлассификаторуУУ);
	ПараметрыПечати.Вставить("НомерПоставки", ?(ОбъектНоменклатуры.НомерПоставки=0, "", "#" + ОбъектНоменклатуры.НомерПоставки));
	ПараметрыПечати.Вставить("СерийныйНомер", ?(ЗначениеЗаполнено(ОбъектНоменклатуры.НомерПартииИзготовления), "№ п.: "+ОбъектНоменклатуры.НомерПартииИзготовления, ""));
	ПараметрыПечати.Вставить("Дата", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	ПараметрыПечати.Вставить("Время", Формат(ТекущаяДата(), "ДЛФ=T"));
	ПараметрыПечати.Вставить("ШК", ШК);
	ПараметрыПечати.Вставить("ДатаПроизводства",?(ЗначениеЗаполнено(ОбъектНоменклатуры.ДатаПроизводства),"Дата пр. :"+ Формат(ОбъектНоменклатуры.ДатаПроизводства, "ДФ=dd.MM.yyyy"),""));
	ПараметрыПечати.Вставить("УпотребитьДо",?(ЗначениеЗаполнено(ОбъектНоменклатуры.УпотребитьДо),"Срок год.:"+ Формат(ОбъектНоменклатуры.УпотребитьДо, "ДФ=dd.MM.yyyy"),""));
	ПараметрыПечати.Вставить("ВидНастроечногоМатериала", ОбъектНоменклатуры.ВидНастроечногоМатериала);
	ПараметрыПечати.Вставить("ЦеноваяГруппа",?(ЗначениеЗаполнено(ОбъектНоменклатуры.Номенклатура.ЦеноваяГруппа.Код),"("+СокрЛП(ОбъектНоменклатуры.Номенклатура.ЦеноваяГруппа.Код)+") ",""));
	
	// --> Начало Лико Ефимов ЕВВ 06.03.2026
	Если ЗначениеЗаполнено(ОбъектНоменклатуры.Длина) И ЗначениеЗаполнено(ОбъектНоменклатуры.Ширина) Тогда
		ПараметрыПечати.КоличествоУУ = "" + ОбъектНоменклатуры.Длина + "см*" + ОбъектНоменклатуры.Ширина + "см";
		ПараметрыПечати.ЕдиницаИзмеренияУУ = "";
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 06.03.2026


	// ЮДНИКОв
	//!Если ОбъектНоменклатуры.Праймирование Тогда
	//	ПараметрыПечати.Вставить("Праймирование" , "ПРАЙМИРОВАНИЕ");
	//	ПараметрыПечати.Вставить("ДатаПраймирования", Формат(ОбъектНоменклатуры.ДатаПраймирования, "ДФ=dd.MM.yyyy"));		
	//	ПараметрыПечати.Вставить("Праймёр", ОбщегоНазначения.ФамилияИнициалыФизЛица(ОбъектНоменклатуры.ОтветственныйЗаПраймирование));
	//Иначе
	//	ПараметрыПечати.Вставить("Праймирование" , "");
	//	ПараметрыПечати.Вставить("ДатаПраймирования", "");
	//	ПараметрыПечати.Вставить("Праймёр", "");
	//КонецЕсли;
	//+m.Shenderov 2.09.2016
	//Если ЗначениеЗаполнено(ИнфоКамф) Тогда
	Если ТипЗнч(ИнфоКамф)=Тип("Структура") Тогда
		Для каждого Ключ Из ИнфоКамф Цикл
			ПараметрыПечати.Вставить(Строка(Ключ.Ключ),Ключ.Значение);
		КонецЦикла;
	Иначе	
		ПараметрыПечати.Вставить("ИнфоКамф",ИнфоКамф);
	КонецЕсли;

     ЗаполнитьИнформДляСмеси(ОбъектНоменклатуры,ПараметрыПечати);

	//!ИмяМакета = ЯС_Общие.ПолучитьСвойствоОбъекта("ЯССМ_МакетШКОбъектаНоменклатуры", ОбъектНабораПараметров, "ТСНаклейкаОбъектаНоменклатурыУпр"); 

	ИмяМакета=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("МакетШКОбъектаНоменклатуры","ПФ_MXL_ТСНаклейкаОбъектаНоменклатуры");
	Если ПараметрыПечати.Свойство("Макет") ТОгда
		ИмяМакета=ПараметрыПечати.Макет;
	КонецЕсли;

	Если ОбъектНоменклатуры.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		ИмяМакета="ПФ_MXL_ТСНаклейкаОбъектаНоменклатурыПолуфабрикат"
	КонецЕсли;

	//ИмяМакета="ПФ_MXL_ТСНаклейкаОбъектаНоменклатуры";
	//!ЯССМ_ПечататьКороткийШтрихКодОбъекта = ЯС_Общие.ПолучитьСвойствоОбъекта("ЯССМ_ПечататьКороткийШтрихКодОбъекта",ОбъектНабораПараметров , Ложь);
	ЯССМ_ПечататьКороткийШтрихКодОбъекта=Истина;
	//-m.shenderov08-09-16	







	Объект = NULL;
	Попытка
		Макет = ПолучитьМакет(ИмяМакета);
	Исключение
		//ЯС_Общие.СообщитьДляКлиента("Не найден макет """ + ИмяМакета + """ для печати штрих-кода объекта номенклатуры! Печать невозможна.", СтатусСообщения.Важное, Ложь);
		//Возврат;
	КонецПопытки;


	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");	

	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ЯССМ_ПАРАМЕТРЫ_ПЕЧАТИ_НаклейкаОбъектаНоменклатуры";
	ТабДокумент.ИмяПараметровПечати = ИмяМакета;


	// Выводим шапку

	//Штрихкод = ОбластьШапка.Области.ШтрихКод.Объект;
	//Штрихкод.Сообщение =ПараметрыПечати.ШК;

	Рисунок = ОбластьШапка.Рисунки.Штрихкод;
	ПараметрыШтрихкода = Новый Структура;

	ПараметрыШтрихкода.Вставить("Ширина",          ОбластьШапка.Рисунки.Штрихкод.Ширина);
	ПараметрыШтрихкода.Вставить("Высота",          ОбластьШапка.Рисунки.Штрихкод.Высота);
	ПараметрыШтрихкода.Вставить("ТипКода",         4);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    18);
	ПараметрыШтрихкода.Вставить("Штрихкод",        ПараметрыПечати.ШК);
	Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	
	//+ Лико m.shenderov 04.10.2021
	Организация = РегистрыСведений.Лико_СерииНоменклатурыДоп.ОрганизацияВладельцаТовара(ОбъектНоменклатуры.Серия);

 Если Не ЗначениеЗаполнено(Организация) Тогда 	

	 Структура=Неопределено;
	ОпределеитьОрганизациюОбъектаНоменклатуры(ОбъектНоменклатуры,Структура);
	Организация=Структура.Организация;

 КонецЕсли;
	
	Если   Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
		ШКСТрокой=ШКСТрокой+" (ЛИКО)";
	ИначеЕсли Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИкспак.ЗначениеПараметра Тогда
		ШКСТрокой=ШКСТрокой+" (Х-Pack)";
		
	КонецЕсли;
	//- Лико m.shenderov 04.10.2021


	ОбластьШапка.Параметры.ШтрихКодСтрокой = ШКСТрокой;	
	ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьШапка);

	//ОбъектВывода.Защита = Истина;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСлева = 1;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ПолеСнизу = 0;
	ТабДокумент.ПолеСверху = 1;


	Если ИмяПринтера="" Тогда
		ИмяПринтера=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераЭтикеток","");

	КонецЕсли;

	//-m.shenderov 03.10.2016 	

	ТабДокумент.ИмяПринтера = ИмяПринтера;


	Возврат ТабДокумент;
КонецФункции 

Процедура ЗаполнитьИнформДляСмеси(ОбъектНоменклатуры,Структура) //+Лико m.shenderov 24.02.2021
//ОбъектНоменклатуры=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьЭлемент();


Если  ЗначениеЗаполнено(ОбъектНоменклатуры.СоставСмеси) ТОгда 
	Номер=1;
	Для каждого СтрСостава Из ОбъектНоменклатуры.СоставСмеси Цикл
		
		Структура.Вставить("Компонента"+Строка(Номер),Прав(СтрСостава.Номенклатура.Код,7)+" "+ Прав(СтрСостава.Номенклатура.Артикул,10));
		Структура.Вставить("Процент"+Строка(Номер),Строка(СтрСостава.Доля*100));
		Структура.Вставить("вес"+Строка(Номер),Строка(СтрСостава.Доля*ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель));
		Номер=Номер+1;
		Структура.Вставить("Макет","ПФ_MXL_ТСНаклейкаОбъектаНоменклатурыСмеси");
	КонецЦикла;
	
		
	
КонецЕсли


КонецПроцедуры  //-Лико m.shenderov 24.02.2021  

Процедура ОпределеитьОрганизациюОбъектаНоменклатуры131024(ОН,Структура=Неопределено) //+Лико m.shenderov 04.10.2021
	//ОН=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьЭлемент();
	Если Структура=Неопределено тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Организация");
		Структура.Вставить("Тип",0);
	КонецЕсли;
	Если НЕ ОН.Уникальный Тогда
		Возврат ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Он.ДокументЗакупки) Тогда
		Структура.Организация=Он.ДокументЗакупки.Распоряжение.Организация;
		Структура.Тип=Структура.Тип+1;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Он.ЗакрытиеБланка) Тогда 
		
		Распоряжение=Он.ЗакрытиеБланка.Распоряжение;
		Если ТипЗнч (Распоряжение)=Тип("ДокументСсылка.СборкаТоваров") И Распоряжение.Проведен ТОгда
			Структура.Организация=Распоряжение.Организация;
		    Структура.Тип=Структура.Тип+1;
			Возврат;
	
		КонецЕсли;
		
			
		НовыйОн= ПолучитьПервыйОбъектНоменклатурыДляРасхода(Он.ЗакрытиеБланка);
		Если ЗначениеЗаполнено(НовыйОн) Тогда 
			Структура.Тип= Структура.Тип+1;
			Заказ=Он.ЗакрытиеБланка.ЗаказПокупателя;
			
			Если ЗначениеЗаполнено(Заказ) Тогда
				Если Заказ.ТипЗаказа=Перечисления.Лико_ТипыЗаказов.Полуфабрикат И(
					Заказ.ДавальческоеСырье Или  
					Заказ.ВидыРабот.НайтиСтроки(Новый Структура("ДавальческоеСырье",Истина)).Количество()>0) Тогда					
				Структура.Организация=УправлениеСвойствами.ЗначениеСвойства(Заказ.Партнер,"Лико_СобственнаяОрганизация");
				Иначе
	
				Структура.Организация=Заказ.Площадка.Организация;
				КонецЕсли;
				
				Возврат;
			Иначе
				
				ОпределеитьОрганизациюОбъектаНоменклатуры(НовыйОн,Структура);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата КАК Дата,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Серия = &Серия
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ВозвратТоваровТовары.Ссылка.Дата,
	|	Лико_ВозвратТоваровТовары.Ссылка
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Серия = &Серия
	|	И Лико_ВозвратТоваровТовары.Ссылка.Проведен
	|	И Лико_ВозвратТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзпереработки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_БланкЭтапаВыпуск.Ссылка.Дата,
	|	Лико_БланкЭтапаВыпуск.Ссылка
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Серия = &Серия
	|	И Лико_БланкЭтапаВыпуск.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Серия",Он.Серия );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Ссылка)= Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда 
			Структура.Организация=Выборка.Ссылка.Распоряжение.Организация;
			Структура.Тип= Структура.Тип+1;
			
			Возврат ;
		ИначеЕсли ТипЗнч(Выборка.Ссылка)= Тип("ДокументСсылка.Лико_ВозвратТоваров") Тогда 
			Структура.Организация=Выборка.Ссылка.Организация;
			Структура.Тип= Структура.Тип+1;
			
			Возврат ;
			
		ИначеЕсли ТипЗнч(Выборка.Ссылка)= Тип("ДокументСсылка.Лико_БланкЭтапа") ТОгда
			НовыйОн= ПолучитьПервыйОбъектНоменклатурыДляРасхода(Выборка.Ссылка);
			Если ЗначениеЗаполнено(НовыйОн) Тогда 
				ОпределеитьОрганизациюОбъектаНоменклатуры(НовыйОн,Структура);	
			КонецЕсли;	
		КонецЕсли; 		
	КонецЦикла; 
	
	Если Не ЗначениеЗаполнено(Структура.Организация) Тогда
		Структура.Организация=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b");
		Структура.Тип= Структура.Тип+1;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 04.10.2021 

Процедура ОпределеитьОрганизациюОбъектаНоменклатуры(ОН,Структура=Неопределено) //+Лико m.shenderov 04.10.2021

	//ОН=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьЭлемент();
	УстановитьПривилегированныйРежим(Истина);
	Если Структура=Неопределено тогда

		Структура = Новый Структура;
		Структура.Вставить("Организация");
		Структура.Вставить("Тип",0);
	КонецЕсли;
	Если НЕ ОН.Уникальный Тогда
		Возврат ;
	КонецЕсли;

	Если ЗначениеЗаполнено(Он.ДокументЗакупки) Тогда
		Структура.Организация=Он.ДокументЗакупки.Распоряжение.Организация;
		Структура.Тип=Структура.Тип+1;
		Возврат;
	КонецЕсли;
	
	ПлощадкаЗаказа =Он.ЗакрытиеБланка.ЗаказПокупателя.Площадка.Организация;
	Если ЗначениеЗаполнено(ПлощадкаЗаказа) Тогда
		Структура.Организация=ПлощадкаЗаказа;
		Структура.Тип=Структура.Тип+1;
		Возврат;
	КонецЕсли;

	
	Если ЗначениеЗаполнено(Он.ЗакрытиеБланка) Тогда 

		Распоряжение=Он.ЗакрытиеБланка.Распоряжение;
		Если ТипЗнч (Распоряжение)=Тип("ДокументСсылка.СборкаТоваров") И Распоряжение.Проведен ТОгда
			Структура.Организация=Распоряжение.Организация;
			Структура.Тип=Структура.Тип+1;
			Возврат;

		КонецЕсли;


		НовыйОн= ПолучитьПервыйОбъектНоменклатурыДляРасхода(Он.ЗакрытиеБланка);
		Если ЗначениеЗаполнено(НовыйОн) Тогда 
			Структура.Тип= Структура.Тип+1;
			Заказ=Он.ЗакрытиеБланка.ЗаказПокупателя;

			Если ЗначениеЗаполнено(Заказ) Тогда
				Если Заказ.ТипЗаказа=Перечисления.Лико_ТипыЗаказов.Полуфабрикат И(
					Заказ.ДавальческоеСырье Или  
					Заказ.ВидыРабот.НайтиСтроки(Новый Структура("ДавальческоеСырье",Истина)).Количество()>0) Тогда					
					Структура.Организация=УправлениеСвойствами.ЗначениеСвойства(Заказ.Партнер,"Лико_СобственнаяОрганизация");
				Иначе

					Структура.Организация=Заказ.Площадка.Организация;
				КонецЕсли;

				Возврат;
			Иначе

				ОпределеитьОрганизациюОбъектаНоменклатуры(НовыйОн,Структура);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата КАК Дата,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Серия = &Серия
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ВозвратТоваровТовары.Ссылка.Дата,
	|	Лико_ВозвратТоваровТовары.Ссылка
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Серия = &Серия
	|	И Лико_ВозвратТоваровТовары.Ссылка.Проведен
	|	И Лико_ВозвратТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзпереработки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_БланкЭтапаВыпуск.Ссылка.Дата,
	|	Лико_БланкЭтапаВыпуск.Ссылка
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Серия = &Серия
	|	И Лико_БланкЭтапаВыпуск.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Серия",Он.Серия );
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если ТипЗнч(Выборка.Ссылка)= Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда 
			Структура.Организация=Выборка.Ссылка.Распоряжение.Организация;
			Структура.Тип= Структура.Тип+1;

			Возврат ;
		ИначеЕсли ТипЗнч(Выборка.Ссылка)= Тип("ДокументСсылка.Лико_ВозвратТоваров") Тогда 
			Структура.Организация=Выборка.Ссылка.Организация;
			Структура.Тип= Структура.Тип+1;

			Возврат ;

		ИначеЕсли ТипЗнч(Выборка.Ссылка)= Тип("ДокументСсылка.Лико_БланкЭтапа") ТОгда
			НовыйОн= ПолучитьПервыйОбъектНоменклатурыДляРасхода(Выборка.Ссылка);
			Если ЗначениеЗаполнено(НовыйОн) Тогда 
				ОпределеитьОрганизациюОбъектаНоменклатуры(НовыйОн,Структура);	
			КонецЕсли;	
		КонецЕсли; 		
	КонецЦикла; 

	Если Не ЗначениеЗаполнено(Структура.Организация) Тогда
		Структура.Организация=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b");
		Структура.Тип= Структура.Тип+1;
	КонецЕсли;


КонецПроцедуры


Функция ПолучитьПервыйОбъектНоменклатурыДляРасхода(ЗакрытиеБланка) //+Лико m.shenderov 04.10.2021
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный
	|	И Лико_БланкЭтапаТовары.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Ссылка",ЗакрытиеБланка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.ОбъектНоменклатуры;	
		
	КонецЦикла;		
	
КонецФункции //-Лико m.shenderov 04.10.2021 

Функция ТабельныйНомерФизЛица(ФизЛицо, Организация = Неопределено) Экспорт //+Лико m.shenderov 04.05.2018

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(Сотрудники.Код, 5, 6) КАК ТабельныйНомер,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ВАрхиве
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Сотрудники.ГоловнаяОрганизация = &Организация
	|		КОНЕЦ
	|	И Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТабельныйНомер УБЫВ";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.УстановитьПараметр("Организация", Неопределено);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Формат(Число(Выборка.ТабельныйНомер),"ЧГ=");	
	Иначе
		Запрос.УстановитьПараметр("Организация", Неопределено);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Формат(Число(Выборка.ТабельныйНомер),"ЧГ=");
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	
	
КонецФункции //-Лико m.shenderov 04.05.2018 


//+ Лико m.shenderov 04.05.2018
Функция ФамилияИнициалыФизЛица(Объект = "", Фамилия = " ", Имя = " ", Отчество = " ", НаДату = Неопределено) Экспорт
	//
	//Если Не ЗначениеЗаполнено(Фамилия) И Не ЗначениеЗаполнено(Имя) Тогда 
	//	
	//	ФИО = ФамилияИмяОтчествоФизЛица(Объект, НаДату);
	//	
	//	Фамилия = ФИО.Фамилия;
	//	Имя		= ФИО.Имя;
	//	Отчество= ФИО.Отчество;
	//	
	//КонецЕсли;	
	
	Возврат ?(НЕ ПустаяСтрока(Объект.Фамилия), 
	Объект.Фамилия + ?(НЕ ПустаяСтрока(Объект.Имя)," " + Лев(Объект.Имя,1) + "." + ?(НЕ ПустаяСтрока(Объект.Отчество),Лев(Объект.Отчество,1)+".", ""), ""),
	"");
	
КонецФункции

//- Лико m.shenderov 04.05.2018


Функция ПолучитьМакет(ИмяМакета) Экспорт
	Имя="Справочник.ЯССМ_ОбъектыНоменклатуры."+ИмяМакета;
	//Возврат Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьМакет(ИмяМакета);	
	Возврат УправлениеПечатью.МакетПечатнойФормы(Имя);
	
КонецФункции

// Функция ПолучитьСвойство
//
// Описание: Получает значение свойства рабочего места
//
// Параметры: 
// ИмяСвойства 		   - Строка          	    - (обязательный).  Пример: "Код"
// ЗначениеПоУмолчанию - Любое 					- (необязательный).Пример: "000001" . Возвращается при ненайденом значении свойства.
// Пользователь 	   - СправочникСсылка       - (необязательный).Пример: ПараметрыСеанса.ТекущийПользователь
// ИмяКомпьютера 	   - Строка 				- (необязательный).Пример: ПараметрыСеанса.РабочееМестоКлиента.ИмяКомпьютера
//
// Возвращаемое значение:
// Любое              
Функция ПолучитьСвойство(ИмяСвойства,ЗначениеПоУмолчанию=Неопределено,Знач Пользователь=Неопределено, Знач ИмяКомпьютера=Неопределено) Экспорт
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство(ИмяСвойства,ЗначениеПоУмолчанию,Пользователь,ИмяКомпьютера);	
КонецФункции

//Функция получает организацию по переданному контрагенту (у организации есть доп. реквизит "Контрагент организации").
//
//Параметры:
//  Контрагент 	- СправочникСсылка.Контрагенты 	- Ссылка на контрагента.
//
//  Возвращаемое значение:
//     СправочникСсылка.Организации или Неопределено. 
//
Функция ПолучитьОрганизациюПоКонтрагенту(Контрагент) Экспорт // --> Начало Лико Ефимов ЕВВ 27.07.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОрганизацииДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.Организации.ДополнительныеРеквизиты КАК ОрганизацииДополнительныеРеквизиты
	|ГДЕ
	|	ОрганизацииДополнительныеРеквизиты.Свойство = &ДопРеквизит
	|	И ОрганизацииДополнительныеРеквизиты.Значение = &Контрагент
	|	И НЕ ОрганизацииДополнительныеРеквизиты.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОрганизацииДополнительныеРеквизиты.Ссылка";
	
	Запрос.УстановитьПараметр("ДопРеквизит", Справочники.Лико_ПредопределенныеЗначения["ДопРеквизитОрганизацииКонтрагентОрганизации"].ЗначениеПараметра);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.07.2017 

Процедура ЗаполнитьЦеныДокументаПередачаТоваровМеждуОрганизациями(ТЧ, СтруктураПараметров) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	//+ Лико m.shenderov 23.05.2018
	Если СтруктураПараметров.ОрганизацияПолучатель=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
		ЗаполнитьЦеныДокументаПередачаТоваровМеждуОрганизациямиИксПак(ТЧ, СтруктураПараметров);
		Возврат;
	КонецЕсли;
	//- Лико m.shenderov 23.05.2018

	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ОрганизацияПолучатель) Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Необходимо выбрать организацию-получатель");
		Возврат;
	КонецЕсли;

	ВалютаДокумента = СтруктураПараметров.Валюта;
	ВалютаЕвро = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТоварыСгруппированы
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыСгруппированы.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыСгруппированы.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиРеглОборот, 0)) КАК СуммаРегл,
	|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиБезНДСОборот, 0)) КАК СуммаУпр
	|ПОМЕСТИТЬ ВТ_ТоварыСВыручкойИКоличеством
	|ИЗ
	|	ВТ_ТоварыСгруппированы КАК ВТ_ТоварыСгруппированы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Регистратор,
	|				(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|						(ВЫБРАТЬ
	|							Т.Номенклатура,
	|							Т.Характеристика
	|						ИЗ
	|							ВТ_ТоварыСгруппированы КАК Т)
	|					И АналитикаУчетаПоПартнерам.Организация = &Организация) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ПО ВТ_ТоварыСгруппированы.Номенклатура = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_ТоварыСгруппированы.Характеристика = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика
	|ГДЕ
	|	((ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями)
	|				И ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).Валюта = &Валюта
	|			ИЛИ ВЫРАЗИТЬ(ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Документ.ПередачаТоваровМеждуОрганизациями).Валюта = &Валюта)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыСгруппированы.Номенклатура,
	|	ВТ_ТоварыСгруппированы.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыСВыручкойИКоличеством.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыСВыручкойИКоличеством.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыСВыручкойИКоличеством.Характеристика.Лико_ЗаказНоменклатуры.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПробник,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТ_ТоварыСВыручкойИКоличеством.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВТ_ТоварыСВыручкойИКоличеством.СуммаРегл / ВТ_ТоварыСВыручкойИКоличеством.Количество
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаРегл,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТ_ТоварыСВыручкойИКоличеством.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВТ_ТоварыСВыручкойИКоличеством.СуммаУпр / ВТ_ТоварыСВыручкойИКоличеством.Количество
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаУпр
	|ИЗ
	|	ВТ_ТоварыСВыручкойИКоличеством КАК ВТ_ТоварыСВыручкойИКоличеством";

	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(СтруктураПараметров.КонецПериода), КонецДня(СтруктураПараметров.КонецПериода), Дата('39991231')));
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.ОрганизацияПолучатель);
	Запрос.УстановитьПараметр("Валюта", ВалютаДокумента);
	Запрос.УстановитьПараметр("Товары", ТЧ.Выгрузить(,"Номенклатура,Характеристика"));

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если ВалютаДокумента = ВалютаЕвро Тогда
		ПолеЦены = "ЦенаУпр";
	Иначе
		ПолеЦены = "ЦенаРегл";
	КонецЕсли;

	Если СтруктураПараметров.Свойство("БезОчистки") И НЕ СтруктураПараметров.БезОчистки Тогда
		// Перед заполнением очистим цены
		Для каждого СтрокаТовары ИЗ ТЧ Цикл
			Если СтрокаТовары.Сумма <> 0 ИЛИ СтрокаТовары.Цена <> 0 Тогда
				СтрокаТовары.Цена = 0;
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", СтруктураПараметров.ЦенаВключаетНДС, СтрокаТовары.СтавкаНДС));
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
				СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, Неопределено);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//ПроцентУменьшенияЦеныПродажиОкилДляПередач = Справочники.Лико_ПредопределенныеЗначения.ПроцентУменьшенияЦеныПродажиОкилДляПередач.ЗначениеПараметра;
	ПроцентУменьшенияЦеныПродажиОкилДляПередач = ПолучитьНаценкуЦенуПерепродажи(СтруктураПараметров.Дата, СтруктураПараметров.Организация, СтруктураПараметров.ОрганизацияПолучатель, ВалютаДокумента, "ГП", "Наценка");
	Если НЕ ЗначениеЗаполнено(ПроцентУменьшенияЦеныПродажиОкилДляПередач) Тогда
		//Сообщить("Не задано предопределенно значение ""ПроцентУменьшенияЦеныПродажиОкилДляПередач""");
		Возврат;
	КонецЕсли;
	//ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро = Справочники.Лико_ПредопределенныеЗначения.ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро.ЗначениеПараметра;

	// Для пробников цену берем в евро всегда, а потом переводим по текущему курсу, если необходимо
	ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро = ПолучитьНаценкуЦенуПерепродажи(СтруктураПараметров.Дата, СтруктураПараметров.Организация, СтруктураПараметров.ОрганизацияПолучатель, ВалютаЕвро, "ГП_Пробники", "Цена");
	Если НЕ ЗначениеЗаполнено(ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро) Тогда
		//Сообщить("Не задано предопределенно значение ""ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро""");
		Возврат;
	КонецЕсли;
	ДатаДокумента = ?(ЗначениеЗаполнено(СтруктураПараметров.Дата), СтруктураПараметров.Дата, ТекущаяДата());
	КурсЕвро = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаЕвро, ДатаДокумента).Курс;
	КурсВалютыДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДокумента).Курс;
	ЦенаПерепродажиПробниковМеждуОрганизациямиВРуб = ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро * КурсЕвро;
	СтавкаПоУмолчанию = ТЧ[0].СтавкаНДС;
	РазмерСтавкиПоУмолчанию = СтавкаПоУмолчанию.Ставка;

	КоэффициентЦены = (100 - ПроцентУменьшенияЦеныПродажиОкилДляПередач) / 100;
	Отбор = Новый Структура("Номенклатура,Характеристика");
	Пока Выборка.Следующий() Цикл
		Если Выборка[ПолеЦены] <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			НайденныеСтроки = ТЧ.НайтиСтроки(Отбор);
			Для каждого СтрокаТовары из НайденныеСтроки Цикл
				НужноПересчитыватьЦену = Ложь;
				Если Выборка.ЭтоПробник Тогда
					Цена = ?(ПолеЦены = "ЦенаУпр", ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро, ЦенаПерепродажиПробниковМеждуОрганизациямиВРуб);
					// --> Начало Лико Ефимов ЕВВ 22.11.2018
					// По согласованию с Капкиным: теперь если количество <= 1, то цена = ЦенаПерепродажиПробниковМеждуОрганизациями, а если > 1, то сумма = ЦенаПерепродажиПробниковМеждуОрганизациями
					Если СтрокаТовары.КоличествоУпаковок > 1 Тогда
						СтрокаТовары.Сумма = Цена;
						НужноПересчитыватьЦену = Истина;
					КонецЕсли;
					// <-- Конец Лико Ефимов ЕВВ 22.11.2018
				Иначе
					Цена = КоэффициентЦены * Выборка[ПолеЦены];
					// --> Начало Лико Ефимов ЕВВ 03.05.2024
					// В запросе выше поменял ресурсы регистра ВыручкаИСебестоимостьПродаж. Были с НДС, стали без НДС
					// Добавим к цене НДС, письмо от Капикина и Мурашовой от 03.05.24
					Цена = Цена * (100 + ?(СтрокаТовары.СтавкаНДС = СтавкаПоУмолчанию, РазмерСтавкиПоУмолчанию, СтрокаТовары.СтавкаНДС.Ставка)) / 100;
					// <-- Конец Лико Ефимов ЕВВ 03.05.2024
				КонецЕсли;
				Если ПолеЦены = "ЦенаРегл" И ВалютаДокумента <> ВалютаРуб Тогда
					// Цена вывелась в рублях, хотя валюта документа не рубли, нужно пересчитать ее в валюту документа (например, доллары)
					Цена = Цена / КурсВалютыДокумента;						
				КонецЕсли;
				СтрокаТовары.Цена = Цена;
				СтруктураДействий = Новый Структура;
				Если НужноПересчитыватьЦену Тогда
					СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах");
				Иначе
					СтруктураДействий.Вставить("ПересчитатьСумму");
				КонецЕсли;
				//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", СтруктураПараметров.НалогообложениеНДС);
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", СтруктураПараметров.ЦенаВключаетНДС, СтрокаТовары.СтавкаНДС));
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
				СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, Неопределено);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьНаценкуЦенуПерепродажи(Дата, ОрганизацияОтправитель, ОрганизацияПолучатель, Валюта, Тип, НаценкаИлиЦена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних.Период КАК Период,
	|	Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних.Организация КАК Организация,
	|	Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних.Валюта КАК Валюта,
	|	Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних.Тип КАК Тип,
	|	Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних.Наценка КАК Наценка,
	|	Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациями.СрезПоследних(
	|			&Дата,
	|			Организация = &ОрганизацияОтправитель
	|				И ОрганизацияПолучатель = &ОрганизацияПолучатель
	|				И Тип = &Тип
	|				И Валюта = &Валюта) КАК Лико_НаценкиНаТоварыПриПередачеМеждуОрганизациямиСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОрганизацияОтправитель", ОрганизацияОтправитель);
	Запрос.УстановитьПараметр("ОрганизацияПолучатель", ОрганизацияПолучатель);
	Запрос.УстановитьПараметр("Тип", Тип);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если НаценкаИлиЦена = "Наценка" Тогда
			Возврат ВыборкаДетальныеЗаписи.Наценка;
		ИначеЕсли НаценкаИлиЦена = "Цена" Тогда
			Возврат ВыборкаДетальныеЗаписи.Сумма;
		Иначе
			Сообщить("Тип НаценкаИлиЦена = " + НаценкаИлиЦена + " не определен");
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Сообщить("Не найдена """ + НаценкаИлиЦена + """ для следующих параметров: Дата = " + Дата + ", ОрганизацияОтправитель = " + ОрганизацияОтправитель + ", ОрганизацияПолучатель = " + ОрганизацияПолучатель + ", Валюта = " + Валюта + ", Тип = " + Тип); 
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьЦеныДокументаПередачаТоваровМеждуОрганизациямиИксПак(ТЧ, СтруктураПараметров) Экспорт//+ Лико m.shenderov 23.05.2018
	
	
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ОрганизацияПолучатель) Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Необходимо выбрать организацию-получатель");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура, ЗакупкиОбороты.АналитикаУчетаНоменклатуры.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика, ЗакупкиОбороты.АналитикаУчетаНоменклатуры.Характеристика) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СебестоимостьТоваровОстатки.КоличествоОстаток, 0) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЗакупкиОбороты.КоличествоОборот, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ЗакупкиОбороты.СуммаОборот / ЗакупкиОбороты.КоличествоОборот
	|				КОНЕЦ
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьОстаток / СебестоимостьТоваровОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ЦенаУпр,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток = 0
	|				ИЛИ СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЗакупкиОбороты.КоличествоОборот, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ЗакупкиОбороты.СуммаРеглОборот / ЗакупкиОбороты.КоличествоОборот
	|				КОНЕЦ
	|		ИНАЧЕ (СебестоимостьТоваровОстатки.СтоимостьРеглОстаток + ВЫБОР
	|				КОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток = 0
	|					ТОГДА 0
	|				ИНАЧЕ (СебестоимостьТоваровОстатки.СтоимостьОстаток - СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток) * (СебестоимостьТоваровОстатки.СтоимостьРеглОстаток / СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток)
	|			КОНЕЦ) / СебестоимостьТоваровОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ЦенаРегл
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И АналитикаУчетаНоменклатуры.Склад = &Склад
	|				И НЕ РазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
	|				И (АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ_Товары.Номенклатура КАК Номенклатура,
	|						ВТ_Товары.Характеристика КАК Характеристика
	|					ИЗ
	|						ВТ_Товары КАК ВТ_Товары)) КАК СебестоимостьТоваровОстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				Организация = &Организация
	|					И (АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВТ_Товары.Номенклатура КАК Номенклатура,
	|							ВТ_Товары.Характеристика КАК Характеристика
	|						ИЗ
	|							ВТ_Товары КАК ВТ_Товары)) КАК ЗакупкиОбороты
	|		ПО СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ЗакупкиОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	|			И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика = ЗакупкиОбороты.АналитикаУчетаНоменклатуры.Характеристика";
	
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(НачалоМесяца(СтруктураПараметров.НачалоПериода)-1));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураПараметров.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(СтруктураПараметров.КонецПериода));
	
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Склад", СтруктураПараметров.Склад);
	Запрос.УстановитьПараметр("Товары", ТЧ.Выгрузить(,"Номенклатура,Характеристика"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СебестоимостьТоваровОстатки.КоличествоОстаток, 0) = 0
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ЗакупкиОбороты.КоличествоОборот, 0) = 0
		|						ТОГДА 0
		|					ИНАЧЕ ЗакупкиОбороты.СуммаОборот / ЗакупкиОбороты.КоличествоОборот
		|				КОНЕЦ
		|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьОстаток / СебестоимостьТоваровОстатки.КоличествоОстаток
		|	КОНЕЦ КАК ЦенаУпр,
		|	ВЫБОР
		|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток = 0
		|				ИЛИ СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток = 0
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ЗакупкиОбороты.КоличествоОборот, 0) = 0
		|						ТОГДА 0
		|					ИНАЧЕ ЗакупкиОбороты.СуммаРеглОборот / ЗакупкиОбороты.КоличествоОборот
		|				КОНЕЦ
		|		ИНАЧЕ (СебестоимостьТоваровОстатки.СтоимостьРеглОстаток + ВЫБОР
		|				КОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток = 0
		|					ТОГДА 0
		|				ИНАЧЕ (СебестоимостьТоваровОстатки.СтоимостьОстаток - СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток) * (СебестоимостьТоваровОстатки.СтоимостьРеглОстаток / СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток)
		|			КОНЕЦ) / СебестоимостьТоваровОстатки.КоличествоОстаток
		|	КОНЕЦ КАК ЦенаРегл
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И АналитикаУчетаНоменклатуры.Склад = &Склад
		|					И НЕ РазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
		|					И АналитикаУчетаНоменклатуры.Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							ВТ_Товары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_Товары КАК ВТ_Товары)) КАК СебестоимостьТоваровОстатки
		|		ПО ВТ_Товары.Номенклатура = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки.Обороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				,
		|				Организация = &Организация
		|					И АналитикаУчетаНоменклатуры.Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							ВТ_Товары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_Товары КАК ВТ_Товары)) КАК ЗакупкиОбороты
		|		ПО ВТ_Товары.Номенклатура = ЗакупкиОбороты.АналитикаУчетаНоменклатуры.Номенклатура";
		
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(НачалоМесяца(СтруктураПараметров.НачалоПериода)-1));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураПараметров.НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(СтруктураПараметров.КонецПериода));
		
		Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
		Запрос.УстановитьПараметр("Склад", СтруктураПараметров.Склад);
		Запрос.УстановитьПараметр("Товары", ТЧ.Выгрузить(,"Номенклатура,Характеристика"));
		
		
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если СтруктураПараметров.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		ПолеЦены = "ЦенаРегл";
	Иначе
		ПолеЦены = "ЦенаУпр";
	КонецЕсли;
	
	Отбор = Новый Структура("Номенклатура,Характеристика");
	Пока Выборка.Следующий() Цикл
		Если Выборка[ПолеЦены] <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			НайденныеСтроки = ТЧ.НайтиСтроки(Отбор);
			Для каждого СтрокаТовары из НайденныеСтроки Цикл
				СтрокаТовары.Цена = 1.01 * Выборка[ПолеЦены];
				
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСумму");
				//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", СтруктураПараметров.НалогообложениеНДС);
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", СтруктураПараметров.ЦенаВключаетНДС, СтрокаТовары.СтавкаНДС));
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
				СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, Неопределено);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //- Лико m.shenderov 23.05.2018



Функция ПолучитьНомерДокументаПоРегиону(Источник, Регион, Префикс) // --> Начало Лико Ефимов ЕВВ 10.08.2017
	
	УстановитьПривилегированныйРежим(Истина);
	// Обычно типовой номер документа состоит из 11 символов: AABB-CCCCCC, где AA - префикс организации, BB - префикс информационной базы (вроде бы), CCCCCC - номер документа по порядку
	// Мы будем делать из него AABBRYCCCCC, где AA - префикс организации, BB - префикс информационной базы (вроде бы), R - код региона, Y - последняя цифра текущего года, CCCCC - номер документа по порядку  
	КодРегиона = Регион.КодРегиона;
	Если КодРегиона < 0 Тогда
		КодРегиона = - КодРегиона;
	КонецЕсли;
	// --> Начало Лико Ефимов ЕВВ 09.01.2020
	Если Источник.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра Тогда
		// Реализации Урала всегда будут начинаться на 4
		КодРегиона = 4;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 09.01.2020
	// --> Начало Лико Ефимов ЕВВ 14.12.2020 
	Если Источник.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра Тогда
		// Реализации Сибири всегда будут начинаться на 9
		КодРегиона = 9;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 14.12.2020 
	Префикс = Лев(Префикс, 4) + Формат(КодРегиона, "ЧЦ=1; ЧН=0") + Прав(Строка(Год(Источник.Дата)), 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(Документ.Номер, 7, 5) КАК Номер
	|ИЗ
	|	Документ." + Источник.Метаданные().Имя + " КАК Документ
	|ГДЕ
	|	ПОДСТРОКА(Документ.Номер, 1, 6) = &Префикс
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("Префикс", Префикс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Попытка
			НомерЧислом = Число(Выборка.Номер);
		Исключение
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В цифровой части номера документа """ + Источник + """ содержаться символы, отличные от цифр.");
			Возврат "";
		КонецПопытки;
		
		Возврат Префикс + Формат(НомерЧислом + 1, "ЧЦ=5; ЧВН=; ЧГ=0");
		
	Иначе
		Возврат Префикс + "00001";	
	КонецЕсли;
	
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 10.08.2017

Функция ПроверитьДоговорВДокументеЛико_СчетНаОплатуКлиенту(Счет, Договор)
	
	// Проверим, заполнен ли договор
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Сообщить("Не выбран договор.");
		Возврат Истина;
	КонецЕсли;
	
	НомерДоговора = СокрЛП(Договор.Номер);
	
	// Проверим, заполнен ли в договоре Номер
	Если НЕ ЗначениеЗаполнено(НомерДоговора) Тогда
		Сообщить("В выбранном договоре не заполнен номер.");
		Возврат Истина;
	КонецЕсли;
	
	// Проверим длину номера договора. Максимальный номер может быть вида "1710462/99"
	Если СтрДлина(НомерДоговора) > 10 Тогда
		Сообщить("Номер договора не может быть длиннее 10 символов.");
		Возврат Истина;
	КонецЕсли;
	
	// Проверим, нет ли в системе счетов на оплату с таким же номером договора. Проверка необходима для обеспечения уникальности номера документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговорыСЗаданнымНаименованием
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Номер = &НомерДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СчетНаОплатуКлиенту.Ссылка КАК Счет,
	|	ВТ_ДоговорыСЗаданнымНаименованием.Ссылка.Ссылка КАК Договор
	|ИЗ
	|	Документ.Лико_СчетНаОплатуКлиенту КАК Лико_СчетНаОплатуКлиенту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоговорыСЗаданнымНаименованием КАК ВТ_ДоговорыСЗаданнымНаименованием
	|		ПО Лико_СчетНаОплатуКлиенту.Договор = ВТ_ДоговорыСЗаданнымНаименованием.Ссылка
	|ГДЕ
	|	НЕ Лико_СчетНаОплатуКлиенту.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
	Запрос.УстановитьПараметр("Ссылка", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Сообщить("Уже есть счет с договором номер """ + НомерДоговора + """: " + Выборка.Счет);
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьНомерДокументаДляСчетаНаОплатуКлиенту(Источник, НомерДоговора) Экспорт // --> Начало Лико Ефимов ЕВВ 29.08.2017
	
	Префикс = "";
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксОрганизации(Источник, Ложь, Префикс);
	Возврат Префикс + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерДоговора, 10, "0");
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 29.08.2017

Функция ШтрихкодСерии(Серия) Экспорт // --> Начало Лико Ефимов ЕВВ 23.12.2019
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Лико_Серия = &Серия";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Штрихкод;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 23.12.2019 

Функция ПолучитьМассивДоступныхЗаказовПользователя(МассивПроверяемыхЗаказов, Пользователь = Неопределено, МассивПлощадок = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 25.12.2019
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НастройкаДоступаКЗаказу КАК Лико_НастройкаДоступаКЗаказу
		|		ПО (ВЫБОР
		|				КОГДА Лико_НастройкаДоступаКЗаказу.ДоступныЗаказыМенеджера ССЫЛКА Справочник.БизнесРегионы
		|					ТОГДА ВЫБОР
		|							КОГДА Лико_НастройкаДоступаКЗаказу.ДоступныЗаказыМенеджера = ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ВсеРегионы)
		|								ТОГДА ИСТИНА
		|							ИНАЧЕ Лико_НастройкаДоступаКЗаказу.ДоступныЗаказыМенеджера = ЗаказКлиента.Регион
		|						КОНЕЦ
		|				КОГДА Лико_НастройкаДоступаКЗаказу.ДоступныЗаказыМенеджера ССЫЛКА Перечисление.Лико_ТипыЗаказов
		|					ТОГДА ЗаказКлиента.ТипЗаказа = Лико_НастройкаДоступаКЗаказу.ДоступныЗаказыМенеджера
		|				ИНАЧЕ ВЫБОР
		|						КОГДА Лико_НастройкаДоступаКЗаказу.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|							ТОГДА ЗаказКлиента.Менеджер = Лико_НастройкаДоступаКЗаказу.ДоступныЗаказыМенеджера
		|						ИНАЧЕ ЗаказКлиента.Менеджер = Лико_НастройкаДоступаКЗаказу.ДоступныЗаказыМенеджера
		|								И ЗаказКлиента.Партнер = Лико_НастройкаДоступаКЗаказу.Партнер
		|					КОНЕЦ
		|			КОНЕЦ)
		|ГДЕ
		|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
		|	И ВЫБОР
		|			КОГДА &ОтбиратьПоПлощадке
		|				ТОГДА ЗаказКлиента.Площадка = &МассивПлощадок
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И Лико_НастройкаДоступаКЗаказу.Менеджер = &Пользователь";
		
		Запрос.УстановитьПараметр("ОтбиратьПоПлощадке", ЗначениеЗаполнено(МассивПлощадок));
		Запрос.УстановитьПараметр("МассивПлощадок", МассивПлощадок);
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("МассивЗаказов", МассивПроверяемыхЗаказов);
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли ЗначениеЗаполнено(МассивПлощадок) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
		|	И ЗаказКлиента.Площадка В(&МассивПлощадок)";
		
		Запрос.УстановитьПараметр("МассивПлощадок", МассивПлощадок);
		Запрос.УстановитьПараметр("МассивЗаказов", МассивПроверяемыхЗаказов);
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 25.12.2019



Функция ЗначениеРеквизитаОбъекта (Ссылка,ИмяРеквизита) Экспорт //+Лико m.shenderov 14.09.2017
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);	
КонецФункции //-Лико m.shenderov 14.09.2017   

Функция ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
КонецФункции 

//+ Лико m.shenderov 22.10.2017

Функция ПолучитьДанныеПоНаработке(ОбъектНоменклатуры, МоментВремени) Экспорт
	
	ДанныеПоНаработке = Новый Структура;
	ДанныеПоНаработке.Вставить("ОбщаяНаработка", 0);
	ДанныеПоНаработке.Вставить("Примечание", "");
	
	ЗапросДанныеПоНаработке = Новый Запрос;
	ЗапросДанныеПоНаработке.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка,
	|	ЯССМ_НаработкиОбъектовНоменклатурыСрезПоследних.Примечание
	|ИЗ
	|	РегистрСведений.Лико_НаработкиОбъектовНоменклатуры.СрезПоследних(&МоментВремени, ОбъектНоменклатуры = &ОбъектНоменклатуры) КАК ЯССМ_НаработкиОбъектовНоменклатурыСрезПоследних ";
	
	ЗапросДанныеПоНаработке.УстановитьПараметр("МоментВремени", МоментВремени);
	ЗапросДанныеПоНаработке.УстановитьПараметр("ОбъектНоменклатуры", ОбъектНоменклатуры);
	
	РезультатЗапросаДанныеПоНаработке = ЗапросДанныеПоНаработке.Выполнить();
	Если Не РезультатЗапросаДанныеПоНаработке.Пустой() Тогда
		ВыборкаЗапросаДанныеПоНаработке = РезультатЗапросаДанныеПоНаработке.Выбрать();
		ВыборкаЗапросаДанныеПоНаработке.Следующий();
		
		ДанныеПоНаработке.Вставить("ОбщаяНаработка", ВыборкаЗапросаДанныеПоНаработке.ОбщаяНаработка);
		ДанныеПоНаработке.Вставить("Примечание", ВыборкаЗапросаДанныеПоНаработке.Примечание);
	Иначе 	//запрос пуст!
	КонецЕсли;
	
	Возврат ДанныеПоНаработке;
	
КонецФункции //ПолучитьДанныеПоНаработке Экспорт

Функция ПолучитьПробегШтампаПоДаннымСчетчика(Серия, Дата = Неопределено, Ячейка, РучнойВызов = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Серия) ИЛИ НЕ ЗначениеЗаполнено(Ячейка) Тогда
		Возврат 0;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РабочийЦентр = ЯчейкаПринадлежитРЦ(Ячейка, Истина);
	Если НЕ ЗначениеЗаполнено(РабочийЦентр) Тогда
		Возврат 0;
	КонецЕсли;
	
	ОбъектНоменклатуры = Серия.ЯССМ_ОбъектНоменклатуры;
	Номенклатура = ОбъектНоменклатуры.Номенклатура;
	Артикул = Номенклатура.Артикул;
	Если НЕ ЗначениеЗаполнено(Артикул) ИЛИ Номенклатура.ВидНоменклатуры <> Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра Тогда
		Возврат 0;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = Дата('39991231235959');
	КонецЕсли;
	
	Если НЕ РучнойВызов Тогда
		// Проверим дату начала
		ДатаНачалаУчетаПробегаШтамповПоСчетчику = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, РабочийЦентр.Лико_Площадка.Организация, "ДатаНачалаУчетаПробегаШтамповПоСчетчику", Дата('00010101'));
		Если НЕ ЗначениеЗаполнено(ДатаНачалаУчетаПробегаШтамповПоСчетчику) ИЛИ Дата < ДатаНачалаУчетаПробегаШтамповПоСчетчику Тогда
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	// Найдем дату, когда штамп передали на эту машину
	ДатаПередачиНаМашину = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыВЯчейкахОбороты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Серия = &Серия
		|				И Ячейка = &Ячейка) КАК ТоварыВЯчейкахОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОбороты.ВНаличииПриход <> 0
		|	И ТоварыВЯчейкахОбороты.Период <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Период) Тогда
		ДатаПередачиНаМашину = ВыборкаДетальныеЗаписи.Период;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	//Лико_Планирование.Лико_ОбновитьСтатистикуСкорости();
	
	// Получим данные по счетчикам
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТССтатистикаСкорости.РабочееМесто КАК РабочееМесто,
		|	ТССтатистикаСкорости.РабочийЦентр КАК РабочийЦентр,
		|	ТССтатистикаСкорости.Заказ КАК Заказ,
		|	ТССтатистикаСкорости.НомерБланка КАК НомерБланка,
		|	ТССтатистикаСкорости.ЭтапПроизводства КАК ЭтапПроизводства,
		|	ТССтатистикаСкорости.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ТССтатистикаСкорости.ПоказанияОбщегоСчетчика КАК ПоказанияОбщегоСчетчика,
		|	ТССтатистикаСкорости.ДатаНачала КАК ДатаНачала,
		|	ТССтатистикаСкорости.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_Статистика
		|ИЗ
		|	РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
		|ГДЕ
		|	ТССтатистикаСкорости.РабочийЦентр = &РабочийЦентр
		|	И ТССтатистикаСкорости.ДатаНачала >= &ДатаНачала
		|	И ТССтатистикаСкорости.ДатаОкончания <= &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеЦентры.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_Статистика.РабочийЦентр ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК НетЗаписейВСтатистике
		|ПОМЕСТИТЬ ВТ_ПроверкаСтатистикиНаНаличие
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Статистика КАК ВТ_Статистика
		|		ПО РабочиеЦентры.Ссылка = ВТ_Статистика.РабочийЦентр
		|ГДЕ
		|	РабочиеЦентры.Ссылка = &РабочийЦентр
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочиеЦентры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Статистика.РабочееМесто КАК РабочееМесто,
		|	ВТ_Статистика.РабочийЦентр КАК РабочийЦентр,
		|	ВТ_Статистика.Заказ КАК Заказ,
		|	ВТ_Статистика.НомерБланка КАК НомерБланка,
		|	ВТ_Статистика.ЭтапПроизводства КАК ЭтапПроизводства,
		|	ВТ_Статистика.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ВТ_Статистика.ПоказанияОбщегоСчетчика КАК ПоказанияОбщегоСчетчика,
		|	ВТ_Статистика.ДатаНачала КАК ДатаНачала,
		|	ВТ_Статистика.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_СтатистикаПослеПроверки
		|ИЗ
		|	ВТ_Статистика КАК ВТ_Статистика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.РабочееМесто,
		|	ВложенныйЗапрос.РабочийЦентр,
		|	ВложенныйЗапрос.Заказ,
		|	ВложенныйЗапрос.НомерБланка,
		|	ВложенныйЗапрос.ЭтапПроизводства,
		|	ВложенныйЗапрос.ПорядковыйНомер,
		|	ВложенныйЗапрос.ПоказанияОбщегоСчетчика,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ТСИсторияРабочегоСтолаОператора.РабочееМесто КАК РабочееМесто,
		|		ТСИсторияРабочегоСтолаОператора.РабочийЦентр КАК РабочийЦентр,
		|		ТСИсторияРабочегоСтолаОператора.Заказ КАК Заказ,
		|		ТСИсторияРабочегоСтолаОператора.НомерБланка КАК НомерБланка,
		|		ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства КАК ЭтапПроизводства,
		|		ТСИсторияРабочегоСтолаОператора.ПорядковыйНомер КАК ПорядковыйНомер,
		|		0 КАК ПоказанияОбщегоСчетчика,
		|		ТСИсторияРабочегоСтолаОператора.Период КАК ДатаНачала,
		|		ТСИсторияРабочегоСтолаОператора.Период КАК ДатаОкончания
		|	ИЗ
		|		РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПроверкаСтатистикиНаНаличие КАК ВТ_ПроверкаСтатистикиНаНаличие
		|			ПО ТСИсторияРабочегоСтолаОператора.РабочийЦентр = ВТ_ПроверкаСтатистикиНаНаличие.Ссылка
		|				И (ВТ_ПроверкаСтатистикиНаНаличие.НетЗаписейВСтатистике)
		|	ГДЕ
		|		ТСИсторияРабочегоСтолаОператора.РабочийЦентр = &РабочийЦентр
		|		И ТСИсторияРабочегоСтолаОператора.Период >= &ДатаНачала
		|		И ТСИсторияРабочегоСтолаОператора.Период <= &ДатаОкончания
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ДатаНачала) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтатистикаПослеПроверки.РабочееМесто КАК РабочееМесто,
		|	ВТ_СтатистикаПослеПроверки.РабочийЦентр КАК РабочийЦентр,
		|	МИНИМУМ(ВТ_СтатистикаПослеПроверки.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ВТ_СтатистикаПослеПроверки.ДатаОкончания) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_СтатистикаМинМакс
		|ИЗ
		|	ВТ_СтатистикаПослеПроверки КАК ВТ_СтатистикаПослеПроверки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтатистикаПослеПроверки.РабочийЦентр,
		|	ВТ_СтатистикаПослеПроверки.РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ДО"" КАК Порядок,
		|	ТСИсторияРабочегоСтолаОператора.РабочееМесто КАК РабочееМесто,
		|	ТСИсторияРабочегоСтолаОператора.РабочийЦентр КАК РабочийЦентр,
		|	ТСИсторияРабочегоСтолаОператора.Заказ КАК Заказ,
		|	ТСИсторияРабочегоСтолаОператора.НомерБланка КАК НомерБланка,
		|	ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства КАК ЭтапПроизводства,
		|	МИНИМУМ(ТСИсторияРабочегоСтолаОператора.ПоказанияОбщегоСчетчика) КАК ПоказанияОбщегоСчетчикаМинимум,
		|	МАКСИМУМ(ТСИсторияРабочегоСтолаОператора.ПоказанияОбщегоСчетчика) КАК ПоказанияОбщегоСчетчикаМаксимум
		|ПОМЕСТИТЬ ТС_ИсторияДоИПослеСтатистики
		|ИЗ
		|	ВТ_СтатистикаМинМакс КАК ВТ_СтатистикаМинМакс
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
		|		ПО ВТ_СтатистикаМинМакс.РабочееМесто = ТСИсторияРабочегоСтолаОператора.РабочееМесто
		|			И ВТ_СтатистикаМинМакс.РабочийЦентр = ТСИсторияРабочегоСтолаОператора.РабочийЦентр
		|			И ВТ_СтатистикаМинМакс.ДатаНачала >= ТСИсторияРабочегоСтолаОператора.Период
		|			И (ТСИсторияРабочегоСтолаОператора.Период >= &ДатаНачала)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТСИсторияРабочегоСтолаОператора.РабочееМесто,
		|	ТСИсторияРабочегоСтолаОператора.РабочийЦентр,
		|	ТСИсторияРабочегоСтолаОператора.Заказ,
		|	ТСИсторияРабочегоСтолаОператора.НомерБланка,
		|	ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ПОСЛЕ"",
		|	ТСИсторияРабочегоСтолаОператора.РабочееМесто,
		|	ТСИсторияРабочегоСтолаОператора.РабочийЦентр,
		|	ТСИсторияРабочегоСтолаОператора.Заказ,
		|	ТСИсторияРабочегоСтолаОператора.НомерБланка,
		|	ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства,
		|	МИНИМУМ(ТСИсторияРабочегоСтолаОператора.ПоказанияОбщегоСчетчика),
		|	МАКСИМУМ(ТСИсторияРабочегоСтолаОператора.ПоказанияОбщегоСчетчика)
		|ИЗ
		|	ВТ_СтатистикаМинМакс КАК ВТ_СтатистикаМинМакс
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
		|		ПО ВТ_СтатистикаМинМакс.РабочееМесто = ТСИсторияРабочегоСтолаОператора.РабочееМесто
		|			И ВТ_СтатистикаМинМакс.РабочийЦентр = ТСИсторияРабочегоСтолаОператора.РабочийЦентр
		|			И ВТ_СтатистикаМинМакс.ДатаОкончания <= ТСИсторияРабочегоСтолаОператора.Период
		|			И (ТСИсторияРабочегоСтолаОператора.Период <= &ДатаОкончания)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТСИсторияРабочегоСтолаОператора.РабочееМесто,
		|	ТСИсторияРабочегоСтолаОператора.РабочийЦентр,
		|	ТСИсторияРабочегоСтолаОператора.Заказ,
		|	ТСИсторияРабочегоСтолаОператора.НомерБланка,
		|	ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТС_ИсторияДоИПослеСтатистики.РабочееМесто КАК РабочееМесто,
		|	ТС_ИсторияДоИПослеСтатистики.РабочийЦентр КАК РабочийЦентр,
		|	ТС_ИсторияДоИПослеСтатистики.Заказ КАК Заказ,
		|	ТС_ИсторияДоИПослеСтатистики.НомерБланка КАК НомерБланка,
		|	ТС_ИсторияДоИПослеСтатистики.ЭтапПроизводства КАК ЭтапПроизводства,
		|	СУММА(ТС_ИсторияДоИПослеСтатистики.ПоказанияОбщегоСчетчикаМаксимум - ТС_ИсторияДоИПослеСтатистики.ПоказанияОбщегоСчетчикаМинимум) КАК ПоказанияОбщегоСчетчика
		|ПОМЕСТИТЬ ВТ_СтатистикаСИсторией
		|ИЗ
		|	ТС_ИсторияДоИПослеСтатистики КАК ТС_ИсторияДоИПослеСтатистики
		|
		|СГРУППИРОВАТЬ ПО
		|	ТС_ИсторияДоИПослеСтатистики.РабочееМесто,
		|	ТС_ИсторияДоИПослеСтатистики.РабочийЦентр,
		|	ТС_ИсторияДоИПослеСтатистики.Заказ,
		|	ТС_ИсторияДоИПослеСтатистики.НомерБланка,
		|	ТС_ИсторияДоИПослеСтатистики.ЭтапПроизводства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СтатистикаПослеПроверки.РабочееМесто,
		|	ВТ_СтатистикаПослеПроверки.РабочийЦентр,
		|	ВТ_СтатистикаПослеПроверки.Заказ,
		|	ВТ_СтатистикаПослеПроверки.НомерБланка,
		|	ВТ_СтатистикаПослеПроверки.ЭтапПроизводства,
		|	СУММА(ВТ_СтатистикаПослеПроверки.ПоказанияОбщегоСчетчика)
		|ИЗ
		|	ВТ_СтатистикаПослеПроверки КАК ВТ_СтатистикаПослеПроверки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтатистикаПослеПроверки.РабочееМесто,
		|	ВТ_СтатистикаПослеПроверки.РабочийЦентр,
		|	ВТ_СтатистикаПослеПроверки.Заказ,
		|	ВТ_СтатистикаПослеПроверки.НомерБланка,
		|	ВТ_СтатистикаПослеПроверки.ЭтапПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтатистикаСИсторией.РабочееМесто КАК РабочееМесто,
		|	ВТ_СтатистикаСИсторией.РабочийЦентр КАК РабочийЦентр,
		|	ВТ_СтатистикаСИсторией.Заказ КАК Заказ,
		|	ВТ_СтатистикаСИсторией.НомерБланка КАК НомерБланка,
		|	ВТ_СтатистикаСИсторией.ЭтапПроизводства КАК ЭтапПроизводства,
		|	СУММА(ВТ_СтатистикаСИсторией.ПоказанияОбщегоСчетчика) КАК ПоказанияОбщегоСчетчика
		|ПОМЕСТИТЬ ВТ_СтатистикаСИсториейСумма
		|ИЗ
		|	ВТ_СтатистикаСИсторией КАК ВТ_СтатистикаСИсторией
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтатистикаСИсторией.РабочееМесто,
		|	ВТ_СтатистикаСИсторией.РабочийЦентр,
		|	ВТ_СтатистикаСИсторией.Заказ,
		|	ВТ_СтатистикаСИсторией.НомерБланка,
		|	ВТ_СтатистикаСИсторией.ЭтапПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтатистикаСИсториейСумма.Заказ КАК Заказ,
		|	ВТ_СтатистикаСИсториейСумма.ЭтапПроизводства.НомерПроката КАК НомерПроката,
		|	ВТ_СтатистикаСИсториейСумма.ЭтапПроизводства КАК ЭтапПроизводства
		|ПОМЕСТИТЬ ВТ_ВсеЗаказыСгруппированы
		|ИЗ
		|	ВТ_СтатистикаСИсториейСумма КАК ВТ_СтатистикаСИсториейСумма
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтатистикаСИсториейСумма.Заказ,
		|	ВТ_СтатистикаСИсториейСумма.ЭтапПроизводства.НомерПроката,
		|	ВТ_СтатистикаСИсториейСумма.ЭтапПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеЗаказыСгруппированы.Заказ КАК Заказ,
		|	ВТ_ВсеЗаказыСгруппированы.НомерПроката КАК НомерПроката,
		|	ВТ_ВсеЗаказыСгруппированы.ЭтапПроизводства КАК ЭтапПроизводства
		|ПОМЕСТИТЬ ВТ_ЗаказыСТакимШтампом
		|ИЗ
		|	ВТ_ВсеЗаказыСгруппированы КАК ВТ_ВсеЗаказыСгруппированы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
		|		ПО ВТ_ВсеЗаказыСгруппированы.Заказ = ЗаказКлиентаВидыРабот.Ссылка
		|			И ВТ_ВсеЗаказыСгруппированы.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
		|			И (ЗаказКлиентаВидыРабот.Оснастка.Артикул = &Артикул)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеЗаказыСгруппированы.Заказ,
		|	ВТ_ВсеЗаказыСгруппированы.НомерПроката,
		|	ВТ_ВсеЗаказыСгруппированы.ЭтапПроизводства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ВсеЗаказыСгруппированы.Заказ,
		|	ВТ_ВсеЗаказыСгруппированы.НомерПроката,
		|	ВТ_ВсеЗаказыСгруппированы.ЭтапПроизводства
		|ИЗ
		|	ВТ_ВсеЗаказыСгруппированы КАК ВТ_ВсеЗаказыСгруппированы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|		ПО ВТ_ВсеЗаказыСгруппированы.Заказ = ЗаказКлиентаЦвета.Ссылка
		|			И ВТ_ВсеЗаказыСгруппированы.НомерПроката = ЗаказКлиентаЦвета.НомерПроката
		|			И (ЗаказКлиентаЦвета.Вал = &Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеЗаказыСгруппированы.Заказ,
		|	ВТ_ВсеЗаказыСгруппированы.НомерПроката,
		|	ВТ_ВсеЗаказыСгруппированы.ЭтапПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_СтатистикаСИсториейСумма.ПоказанияОбщегоСчетчика) КАК ПоказанияОбщегоСчетчика
		|ИЗ
		|	ВТ_ЗаказыСТакимШтампом КАК ВТ_ЗаказыСТакимШтампом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатистикаСИсториейСумма КАК ВТ_СтатистикаСИсториейСумма
		|		ПО ВТ_ЗаказыСТакимШтампом.Заказ = ВТ_СтатистикаСИсториейСумма.Заказ
		|			И ВТ_ЗаказыСТакимШтампом.ЭтапПроизводства = ВТ_СтатистикаСИсториейСумма.ЭтапПроизводства";
		
	Запрос.УстановитьПараметр("ДатаНачала", ДатаПередачиНаМашину);
	Запрос.УстановитьПараметр("ДатаОкончания", Дата);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПоказанияОбщегоСчетчика) Тогда
		Возврат ВыборкаДетальныеЗаписи.ПоказанияОбщегоСчетчика;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьНаличиеУпаковки(Номенклатура,Упаковка,КоличествоВУпаковке=1,ЕдиницаИзмерения=Неопределено) Экспорт //+Лико m.shenderov 24.10.2017  
	Если Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЕдиницаИзмерения=Неопределено Тогда
		ЕдиницаИзмерения=Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	|	И УпаковкиЕдиницыИзмерения.Числитель = &Числитель
	|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Владелец",Номенклатура);
	Запрос.УстановитьПараметр("Числитель",КоличествоВУпаковке);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Упаковка=Выборка.Ссылка;
			Возврат;
		КонецЦикла;
	КонецЕсли;
	
	НоваяУпаковка=Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент(); 		
	НоваяУпаковка.Владелец						=	Номенклатура;		
	НоваяУпаковка.Числитель						=	КоличествоВУпаковке;
	НоваяУпаковка.Знаменатель						=	1;
	НоваяУпаковка.ЕдиницаИзмерения				=	ЕдиницаИзмерения;
	НоваяУпаковка.ЛинейныеРазмерыПредставление	=	"Безразмерная";
	НоваяУпаковка.СкладскаяГруппа					=	Справочники.СкладскиеГруппыУпаковок.НайтиПоНаименованию("Адресная");
	НоваяУпаковка.Типоразмер						=	Справочники.Лико_ПредопределенныеЗначения.ТипоразмерУпаковкиРулонногоМатериала.ЗначениеПараметра;
	НоваяУпаковка.ПоставляетсяВМногооборотнойТаре	=	Ложь;
	НоваяУпаковка.ТипИзмеряемойВеличины			=	Перечисления.ТипыИзмеряемыхВеличин.Упаковка;
	НоваяУпаковка.ТипУпаковки						=	Перечисления.ТипыУпаковокНоменклатуры.Конечная; 		
	НоваяУпаковка.Наименование     				=	СформироватьНаименование(ЕдиницаИзмерения,НоваяУпаковка.Числитель,НоваяУпаковка.Знаменатель,НоваяУпаковка.Владелец.ЕдиницаИзмерения); 
	
	НоваяУпаковка.Записать();	
	Упаковка=НоваяУпаковка.Ссылка;
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
КонецПроцедуры  //-Лико m.shenderov 24.10.2017


Функция СформироватьНаименование(ВидУпаковки, Числитель, Знаменатель, ЕдиницаИзмеренияВладельца) Экспорт
	Возврат СокрЛП(СокрЛП(ВидУпаковки) + " (" + Формат(Числитель / Знаменатель,"ЧРД=.") + " " + СокрЛП(ЕдиницаИзмеренияВладельца) + ")");
	
КонецФункции



Функция ОбъектНоменклатурыДляПечати(Данные) Экспорт  //+Лико m.shenderov 30.12.2017
	Если ЗначениеЗаполнено(Данные.Серия.ЯССМ_ОбъектНоменклатуры) Тогда
		Возврат  Данные.Серия.ЯССМ_ОбъектНоменклатуры;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЯССМ_ОбъектыНоменклатуры.Ссылка) КАК ОбъектНоменклатуры,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
		|ГДЕ
		|	ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
		|	И НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления";
		Запрос.УстановитьПараметр("Номенклатура",Данные.Номенклатура );
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() и Данные.Номенклатура.ВидНоменклатуры.ИспользоватьСерии=Ложь ТОгда
			Упаковка=Неопределено;
			ПроверитьНаличиеУпаковки(Данные.Номенклатура,Упаковка);
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",Данные.Номенклатура);
			Структура.Вставить("Уникальный",Ложь);
			Структура.Вставить("Количество",1);
			Структура.Вставить("Упаковка",Упаковка);
			Возврат Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(Структура);	 
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество>1 Тогда
				Возврат Неопределено;
			Иначе
				Возврат Выборка.ОбъектНоменклатуры;
			КонецЕсли;
			
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 30.12.2017 


//- Лико m.shenderov 22.10.2017

//+Лико o.pukhova 11.12.17
Процедура ЗаполнитьЦенуПоЦенеЦеновойГруппы(ДокументОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Лико_ЦеныГруппНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	|	ВЫБОР
	|		КОГДА Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена
	|	КОНЕЦ КАК Цена,
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = &ТипЦен
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО (Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа = Номенклатура.ЦеноваяГруппа)
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("ТипЦен", Перечисления.Лико_ТипЦен.ЦенаПоставщика);
	Запрос.УстановитьПараметр("Номенклатура", ДокументОбъект.Строки.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Площадка",Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДереваЗначений Из ДокументОбъект.Строки Цикл
		СтрокаЦен = ТаблицаЦен.Найти(СтрокаДереваЗначений["Номенклатура"],"Номенклатура");
		СтрокаДереваЗначений[7]= ?(СтрокаЦен=Неопределено,0,СтрокаЦен["Цена"]);
		Если СтрокаДереваЗначений.Строки.Количество()>0 Тогда 
			Для Каждого СтрокаДереваЗначений2 Из СтрокаДереваЗначений.Строки Цикл
				СтрокаЦен = ТаблицаЦен.Найти(СтрокаДереваЗначений2["Номенклатура"],"Номенклатура");
				СтрокаДереваЗначений2[7]= ?(СтрокаЦен=Неопределено,0,СтрокаЦен["Цена"]);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-Лико o.pukhova 11.12.17

//+Лико o.pukhova 07.01.18
Функция ФайлСуществует(ПутьКФайлу) Экспорт
	
	Файл = Новый Файл(ПутьКФайлу);
	Возврат Файл.Существует();
КонецФункции
//-Лико o.pukhova 07.01.18


Процедура ПереносДатыВЗакрытиеБланкаДляТиповыхДокументов (ЗаказКлиента,Дата) Экспорт //+Лико m.shenderov 23.07.2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапа.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|ГДЕ
	|	Лико_БланкЭтапа.Проведен
	|	И НЕ Лико_БланкЭтапа.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА Лико_БланкЭтапа.ДатаДляТиповыхДокументов = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Лико_БланкЭтапа.Дата > &Дата
	|			ИНАЧЕ Лико_БланкЭтапа.ДатаДляТиповыхДокументов > &Дата
	|		КОНЕЦ
	|	И Лико_БланкЭтапа.ЗаказПокупателя = &ЗаказКлиента";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );
	Запрос.УстановитьПараметр("Дата",Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект=Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ДатаДляТиповыхДокументов=Дата;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ЭтоТачПадРЦ", Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	КонецЦикла;  
	
КонецПроцедуры //-Лико m.shenderov 23.07.2019



Функция СформироватьВнешнююПечатнуюФорму(ИмяПечатнойФормы,Документ) Экспорт //+Лико m.shenderov 19.09.2019
	ТабДок = Новый ТабличныйДокумент;
	ПечатнаяФорма = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта",ИмяПечатнойФормы);
	КоллекцияПечатныхФорм	=Новый ТаблицаЗначений;
	ОбъектыПечати 			=Новый СписокЗначений;
	ПараметрыПечати			=Неопределено;
	
	ПараметрыКоманды = новый структура;
	ПараметрыКоманды.Вставить("ИдентификаторКоманды",ПечатнаяФорма.Команды[0].Идентификатор);
	ОбъектыНазначения = новый массив;
	ОбъектыНазначения.Добавить(Документ);
	ПараметрыКоманды.Вставить("ОбъектыНазначения",ОбъектыНазначения);
	ДополнительныеОтчетыИОбработки.ПечатьПоВнешнемуИсточнику(ПечатнаяФорма,ПараметрыКоманды,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыПечати);
	Для каждого Стр Из КоллекцияПечатныхФорм Цикл
		ТабДок = стр.ТабличныйДокумент;
		Прервать;
	КонецЦикла;
	Возврат ТабДок;	
КонецФункции //-Лико m.shenderov 19.09.2019 



Функция НайтиДокумент(ДокументИмя,Номер,Дата) Экспорт //+Лико m.shenderov 18.09.2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ."+ДокументИмя+" КАК Док
	|ГДЕ
	|	Док.Номер = &Номер
	|	И Док.Дата = &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК Док
	|ГДЕ
	|	Док.Номер = &Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Вт.Ссылка КАК Ссылка
	|ИЗ
	|	Вт КАК Вт";
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("Дата",Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат  Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 18.09.2019 

//+Лико o.pukhova 31.01.2020
Процедура УстановитьПрефиксОрганизации(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)
	
	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";
	
	Если УстановитьПрефиксОрганизации Тогда
		
		Организация = ?(ТипЗнч(Источник["Площадка"]) = Тип("СправочникСсылка.Организации"),Источник["Площадка"],Источник["Площадка"].Организация);
		ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаОрганизации(
		Организация, ПрефиксОрганизации);
		// Если задана пустая ссылка на организацию.
		Если ПрефиксОрганизации = Ложь Тогда
			
			ПрефиксОрганизации = "";
			
		КонецЕсли;
		
		СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПрефиксОрганизации, 2, "0", "Слева")
	КонецЕсли;
	
	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);
	
	Префикс = ШаблонПрефикса;
	
КонецПроцедуры
//-Лико o.pukhova 31.01.2020

Процедура ЗаполнитьРеквизитыПоЛикоДокументам(МассивРаспоряжений,РеквизитыТранспортнойНакладной) Экспорт //+Лико m.shenderov 17.04.2020
	
	Для каждого  Док Из МассивРаспоряжений Цикл
		
		Если ТипЗнч(Док)=Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
			ЗаполнитьЗначенияСвойств(РеквизитыТранспортнойНакладной,Док);	
		КонецЕсли; 	
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 17.04.2020

Функция ПроверитьТаблицуЦенНаСоответствиеЦенамЗаказа(Таблица, Дата, ТипОтгрузки = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 02.06.2020
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Таблица.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(Таблица.Валюта КАК Справочник.Валюты) КАК Валюта,
	|	ВЫРАЗИТЬ(Таблица.Количество КАК ЧИСЛО(15, 3)) КАК Количество,
	|	ВЫРАЗИТЬ(Таблица.Цена КАК ЧИСЛО(15, 4)) КАК Цена
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Характеристика.Лико_ЗаказНоменклатуры КАК ЗаказКлиента,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Валюта КАК Валюта,
	|	СУММА(ВТ.Количество) КАК Количество,
	|	МИНИМУМ(ВТ.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_Сгруппирована
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Характеристика,
	|	ВТ.Валюта,
	|	ВТ.Характеристика.Лико_ЗаказНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТ_Сгруппирована.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВТ_Сгруппирована.Характеристика КАК Характеристика,
	|	ВТ_Сгруппирована.Валюта КАК Валюта,
	|	ВТ_Сгруппирована.Количество КАК Количество,
	|	ВТ_Сгруппирована.Цена КАК Цена,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС, ИСТИНА)) КАК ЦенаДляДокументовВключаетНДС,
	|	МИНИМУМ(ЕСТЬNULL(ЗаказКлиентаТовары.Цена, 0)) КАК ЦенаИзЗаказа,
	|	МАКСИМУМ(ЕСТЬNULL(КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность, 0)) КАК Курс,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаказКлиентаТовары.СтавкаНДС, &СтавкаНДСПоУмолчанию)) КАК СтавкаНДС,
	|	ВТ_Сгруппирована.ЗаказКлиента КАК ЗаказКлиента,
	|	МАКСИМУМ(КурсыВалютСрезПоследнихЕвро.Курс / КурсыВалютСрезПоследнихЕвро.Кратность) КАК КурсЕвро,
	|	МАКСИМУМ(ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ЛОЖЬ)) КАК ПроверятьСредниеЦеныЗаказа,
	|	ВТ_Сгруппирована.ЗаказКлиента.ВидЗаказа КАК ВидЗаказа
	|ИЗ
	|	ВТ_Сгруппирована КАК ВТ_Сгруппирована
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ_Сгруппирована.Характеристика = ЗаказКлиентаТовары.Характеристика
	|			И ВТ_Сгруппирована.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	|		ПО ВТ_Сгруппирована.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|		ПО ВТ_Сгруппирована.ЗаказКлиента.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
	|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ПроверятьСредниеЦеныЗаказа_c12c1a007ec54cc18e3ec636fad63ebc""),
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследнихЕвро
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сгруппирована.Характеристика,
	|	ВТ_Сгруппирована.Валюта,
	|	ВТ_Сгруппирована.Количество,
	|	ВТ_Сгруппирована.Цена,
	|	ВЫРАЗИТЬ(ВТ_Сгруппирована.Характеристика.Владелец КАК Справочник.Номенклатура),
	|	ВТ_Сгруппирована.ЗаказКлиента,
	|	ВТ_Сгруппирована.ЗаказКлиента.ВидЗаказа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиента";
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Валюта", Константы.ВалютаУправленческогоУчета.Получить());
	Если Дата >= Дата('20260101') Тогда
		Запрос.УстановитьПараметр("СтавкаНДСПоУмолчанию", УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22));
	Иначе
		Запрос.УстановитьПараметр("СтавкаНДСПоУмолчанию", УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20));
	КонецЕсли;

	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	
	Сообщение = "";
	МассивСтруктурДанных = Новый Массив;
	МассивПроверенныхЗаказовПоСреднимЦенам = Новый Массив;
	Для каждого Строка из РезультатТаблица Цикл
		
		Если Строка.ЦенаИзЗаказа = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ВнутренниеНужды Тогда
			// Письмо Анны от 05.02.25 14:23
			Продолжить;
		КонецЕсли;
		
		Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца Тогда
			Если Строка.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда
				Продолжить;
			КонецЕсли;
			Строка.Цена = 0;
		КонецЕсли;
		
		НоменклатураКомплект = "";
		Если Строка.ПроверятьСредниеЦеныЗаказа И Строка.Цена <> 0 Тогда
			
			Если МассивПроверенныхЗаказовПоСреднимЦенам.Найти(Строка.ЗаказКлиента) <> Неопределено Тогда
				// Данный заказ уже проверили
				Продолжить;
			КонецЕсли;
			
			СуммаЗаказаИтог = 0;
			КоличествоЗаказаИтог = 0;
			Для каждого СтрокаТЧ из Строка.ЗаказКлиента.Товары Цикл
				СуммаЗаказаИтог = СуммаЗаказаИтог + СтрокаТЧ.Количество * СтрокаТЧ.Цена;
				КоличествоЗаказаИтог = КоличествоЗаказаИтог + СтрокаТЧ.Количество;
			КонецЦикла;
			Строка.ЦенаИзЗаказа = Окр(СуммаЗаказаИтог / КоличествоЗаказаИтог, 4);
			
			СуммаЗаказаИтог = 0;
			КоличествоЗаказаИтог = 0;
			НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("ЗаказКлиента", Строка.ЗаказКлиента));
			Для каждого СтрокаТЧ из НайденныеСтроки Цикл
				СуммаЗаказаИтог = СуммаЗаказаИтог + СтрокаТЧ.Количество * СтрокаТЧ.Цена;
				КоличествоЗаказаИтог = КоличествоЗаказаИтог + СтрокаТЧ.Количество;
				НоменклатураКомплект = НоменклатураКомплект + ?(НайденныеСтроки.Количество() = 1, СтрокаТЧ.Номенклатура, ?(ЗначениеЗаполнено(НоменклатураКомплект), ", ", "Комплект: ") + СтрокаТЧ.Номенклатура);
			КонецЦикла;
			Строка.Цена = СуммаЗаказаИтог / КоличествоЗаказаИтог;
			
			МассивПроверенныхЗаказовПоСреднимЦенам.Добавить(Строка.ЗаказКлиента);
		КонецЕсли;
		
		Если НЕ Строка.ЦенаДляДокументовВключаетНДС Тогда
			//ПроцентНДС = УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(Строка.СтавкаНДС);
			ПроцентНДС = Строка.СтавкаНДС.Ставка;
			Строка.ЦенаИзЗаказа = Окр(Строка.ЦенаИзЗаказа / (1 + ПроцентНДС / 100), 4);
		КонецЕсли;
		
		ЦенаРуб = Строка.Цена * Строка.Курс;
		ЦенаЕвро = Окр(ЦенаРуб / Строка.КурсЕвро, 4);
		
		
		РазностьЦенПроцент = (Строка.ЦенаИзЗаказа - ЦенаЕвро) / Строка.ЦенаИзЗаказа * 100; 
		Если РазностьЦенПроцент > 10 Тогда
			Сообщение = Сообщение + ?(ЗначениеЗаполнено(Сообщение), Символы.ПС, "") + "Цена в заказе " + Строка.ЗаказКлиента.НомерБезПрефикса + " (" + ?(Строка.ЦенаДляДокументовВключаетНДС, "с", "без") + " НДС) " + Строка.ЦенаИзЗаказа + " €, цена в документе " + ЦенаЕвро + " € (разница " + Окр(РазностьЦенПроцент) + "%)";
			МассивСтруктурДанных.Добавить(Новый Структура("Заказ,Номенклатура,ЦенаЗаказа,ЦенаДокумента,Процент,Количество", Строка.ЗаказКлиента, ?(ЗначениеЗаполнено(НоменклатураКомплект), НоменклатураКомплект, Строка.Номенклатура), Строка.ЦенаИзЗаказа, ЦенаЕвро, РазностьЦенПроцент, Строка.Количество)); 	
		КонецЕсли;		
		
	КонецЦикла;
	
	Результат = Новый Структура("Сообщение,МассивСтруктурДанных", Сообщение, МассивСтруктурДанных);
	
	Возврат Результат;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 02.06.2020

Процедура ЗаписатьПричинуИзмененияЦены(Ссылка, ПараметрыЗаписи) Экспорт // --> Начало Лико Ефимов ЕВВ 17.06.2020 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ПараметрыЗаписи.Свойство("Причина") Тогда
		Если ПараметрыЗаписи.Свойство("НеУдалятьПредыдущуюПричину") Тогда
			// Проверка не пройдена, но причину уже не спрашиваем (проводят второй раз без изменения цен
			Возврат;
		Иначе
			// Проверка пройдена, удалим старые ответы
			УдалитьИзРегистраИсторииИзмененияЦенДанныеПоДокументу(Ссылка);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Сначала удалим старые записи
	УдалитьИзРегистраИсторииИзмененияЦенДанныеПоДокументу(Ссылка);
	
	ЭтоЗаявкаНаОтгрузку = ТипЗнч(Ссылка) = Тип("ДокументСсылка.Лико_ЗаявкаНаОтгрузку");
	МассивКлиентов = Новый Массив;
	
	// Теперь запишем новые
	НаборЗаписей = РегистрыСведений.Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.СоздатьНаборЗаписей();
	сч = 0;
	Для каждого СтруктураДанных ИЗ ПараметрыЗаписи.РезультатПроверки.МассивСтруктурДанных Цикл
		сч = сч + 1;
		НоваяЗапись = НаборЗаписей.Добавить();
		//МенеджерЗаписи = РегистрыСведений.Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ТипДанных = Перечисления.Лико_ТипыДанныхРегистраИсторииДляРассылкиОтчетов.УменьшениеЦеныПродажи;
		НоваяЗапись.НомерВЦепочке = сч;
		НоваяЗапись.Сообщение = ПараметрыЗаписи.РезультатПроверки.Сообщение;
		НоваяЗапись.ДопДанные1 = Ссылка;
		НоваяЗапись.ДопДанные2 = "" + ПараметрыЗаписи.Причина + ?(ЗначениеЗаполнено(ПараметрыЗаписи.Комментарий), " (" + ПараметрыЗаписи.Комментарий + ")", "");
		НоваяЗапись.ДопДанные3 = СтруктураДанных.Заказ;
		НоваяЗапись.ДопДанные4 = СтруктураДанных.Номенклатура;
		НоваяЗапись.ДопДанные5 = СтруктураДанных.ЦенаЗаказа;
		НоваяЗапись.ДопДанные6 = СтруктураДанных.ЦенаДокумента;
		НоваяЗапись.ДопДанные7 = СтруктураДанных.Процент;
		НоваяЗапись.ДопДанные8 = ПараметрыСеанса.ТекущийПользователь;
		
		СтруктураДанных.Вставить("Клиент", ?(ЭтоЗаявкаНаОтгрузку, СтруктураДанных.Заказ.Партнер, Ссылка.Партнер));
		Если МассивКлиентов.Найти(СтруктураДанных.Клиент) = Неопределено Тогда
			МассивКлиентов.Добавить(СтруктураДанных.Клиент);
		КонецЕсли;
	КонецЦикла;
	
	//Попытка
	НаборЗаписей.Записать(Ложь);	
	//Исключение
	//	Сообщить("Не удалось добавить данные в историю для рассылки писем: " + ОписаниеОшибки());
	//КонецПопытки;
	
	// Отправим письма
	Если ЭтоЗаявкаНаОтгрузку Тогда
		Менеджер = Ссылка.Ответственный;
	Иначе
		Менеджер = Ссылка.Менеджер;
	КонецЕсли;
	ДиректорРегиона = Неопределено;
	Если ЗначениеЗаполнено(Менеджер.Лико_Регион) Тогда
		ДиректорРегиона = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Менеджер.Лико_Регион, "Лико_Директор");
	КонецЕсли;
	
	Для каждого Клиент из МассивКлиентов Цикл
		Тема = "Зарегистрировано отклонение цены для " + Клиент + ", менеджер " + Менеджер;
		ТекстПисьма = "Добрый день" + "<br><br>" + Символы.ПС
		+ "Зарегистрировано отклонение цены продажи более, чем на 10% в документе " + Ссылка + "<br><br>" + Символы.ПС
		+ "Клиент " + Клиент + "<br>" + Символы.ПС
		+ "Менеджер " + Менеджер + "<br><br>" + Символы.ПС;
		Для каждого СтруктураДанных ИЗ ПараметрыЗаписи.РезультатПроверки.МассивСтруктурДанных Цикл
			Если СтруктураДанных.Клиент = Клиент Тогда
				ТекстПисьма = ТекстПисьма
				+ "Заказ " + СтруктураДанных.Заказ.НомерБезПрефикса + ", " + СтруктураДанных.Номенклатура + ":" + "<br>" + Символы.ПС
				+ "Было       " + СтруктураДанных.ЦенаЗаказа + " евро (сумма " + Формат(СтруктураДанных.ЦенаЗаказа * СтруктураДанных.Количество, "ЧДЦ=2; ЧГ=0") +")" + "<br>" + Символы.ПС
				+ "Стало      " + Символы.Таб + СтруктураДанных.ЦенаДокумента + " евро (сумма " + Формат(СтруктураДанных.ЦенаДокумента * СтруктураДанных.Количество, "ЧДЦ=2; ЧГ=0") +")" + "<br>" + Символы.ПС
				+ "Отклонение " + Окр(СтруктураДанных.Процент, 0) + " %" + "<br><br>" + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		ТекстПисьма = ТекстПисьма
		+ "Причина:" + "<br>" + Символы.ПС
		+ ПараметрыЗаписи.Причина + ?(ЗначениеЗаполнено(ПараметрыЗаписи.Комментарий), " (" + ПараметрыЗаписи.Комментарий + ")", "");
		
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.Добавить("den.okulov@gmail.com");
		СписокПолучателей.Добавить(Менеджер);
		СписокПолучателей.Добавить("aivanova@okil.ru");
		//СписокПолучателей.Добавить("vefimov@okil.ru");
		ДиректорИзКлиента = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Клиент, "Директор_8e9103f4138845d5a403d22f2f25c67c");
		Если ЗначениеЗаполнено(ДиректорИзКлиента) Тогда
			СписокПолучателей.Добавить(ДиректорИзКлиента);
		ИначеЕсли ЗначениеЗаполнено(ДиректорРегиона) Тогда
			СписокПолучателей.Добавить(ДиректорРегиона);
		КонецЕсли;
		Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, Тема, СписокПолучателей);
	КонецЦикла;
	
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 17.06.2020 

Процедура УдалитьИзРегистраИсторииИзмененияЦенДанныеПоДокументу(СсылкаНаДокумент)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 10.07.2020
	// Сейчас пишем пиьсма в момент проведения, а отчет уже не показываем, поэтому удалять смысла нет
	// Уберу удаление, чтобы оставалась история
	Возврат;
	// <-- Конец Лико Ефимов ЕВВ 10.07.2020 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.Период КАК Период,
	|	Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.ТипДанных КАК ТипДанных,
	|	Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.НомерВЦепочке КАК НомерВЦепочке,
	|	Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.СлужебнаяЗапись КАК СлужебнаяЗапись
	|ИЗ
	|	РегистрСведений.Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных КАК Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных
	|ГДЕ
	|	Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.ДопДанные1 = &Ссылка
	|	И Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.ТипДанных = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыДанныхРегистраИсторииДляРассылкиОтчетов.УменьшениеЦеныПродажи)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.Лико_ИсторияДляРассылкиОтчетовПоИзменениюДанных.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Прочитать();
		Попытка
			МенеджерЗаписи.Удалить();	
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

//+Лико o.pukhova 16.07.2020
Процедура РедактироватьРеквизитСервер(Док, Реквизит, Значение) Экспорт 
	ДОкОбъект=Док.ПолучитьОбъект();
	ДОкОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект[Реквизит]=Значение;
	ДОкОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры
//-Лико o.pukhova 16.07.2020

Функция НайтиЭлектронныйАдресОтветственногоПоСкладу(СсылкаНаОбъект, ВидАдреса, пИмяОбъекта = "Справочник.Склады", ЭтоНаименование = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 27.10.2020 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Адрес
	|ИЗ
	|	" + пИмяОбъекта + ".КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ВЫБОР
	|			КОГДА &ЭтоНаименование
	|				ТОГДА КонтактнаяИнформация.Вид.Наименование = &ВидАдреса
	|			ИНАЧЕ КонтактнаяИнформация.Вид.ИдентификаторДляФормул = &ВидАдреса
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Адрес";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ВидАдреса", ВидАдреса);
	Запрос.УстановитьПараметр("ЭтоНаименование", ЭтоНаименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Адрес) Тогда
		Возврат ВыборкаДетальныеЗаписи.Адрес;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.10.2020 

Функция ПравоДоступаКСсылке(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Объект.Ссылка,
	|	Объект.ПометкаУдаления
	|
	|ИЗ
	|    " + Ссылка.Метаданные().ПолноеИмя() + " КАК Объект
	|ГДЕ
	|    Объект.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ОбновитьВЗаказеСреднееКоличествоВКоробкеИРолике(Заказ, ФормированиеПаллета = Неопределено, ЭтоОтменаПроведения = Ложь, ЗаписыватьВРежимеОбмена = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 02.03.2021
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЧДокумента.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_РастаренныеКоробки
			|ИЗ
			|	Документ.Лико_ФормированиеПаллета.СодержимоеРастарки КАК ТЧДокумента
			|ГДЕ
			|	ТЧДокумента.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры = &Заказ
			|	И (ТЧДокумента.Ссылка.Проведен
			|			ИЛИ ТЧДокумента.Ссылка = &ФормированиеПаллета)
			|	И ТЧДокумента.Ссылка.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЧДокумента.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЧДокумента.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
			|	СУММА(ТЧДокумента.Серия.Лико_КоличествоВУпаковке) КАК Количество,
			|	СУММА(ТЧДокумента.Серия.Лико_КоличествоКоробок) КАК КоличествоКоробок,
			|	СУММА(ТЧДокумента.Серия.Лико_КоличествоРоликов) КАК КоличествоРоликов
			|ИЗ
			|	Документ.Лико_ФормированиеПаллета.Содержимое КАК ТЧДокумента
			|ГДЕ
			|	ТЧДокумента.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры = &Заказ
			|	И (ТЧДокумента.Ссылка.Проведен
			|			ИЛИ ТЧДокумента.Ссылка = &ФормированиеПаллета)
			|	И ТЧДокумента.Ссылка.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции)
			|	И НЕ ТЧДокумента.Серия В
			|				(ВЫБРАТЬ
			|					Т.Серия
			|				ИЗ
			|					ВТ_РастаренныеКоробки КАК Т)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЧДокумента.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры";
			
		Запрос.УстановитьПараметр("Заказ", Заказ);
		Запрос.УстановитьПараметр("ФормированиеПаллета", ФормированиеПаллета);
		
		Если ФормированиеПаллета = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТЧДокумента.Ссылка = &ФормированиеПаллета", "ЛОЖЬ");
		ИначеЕсли ЭтоОтменаПроведения Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ ТЧДокумента.Ссылка = &ФормированиеПаллета", "И ТЧДокумента.Ссылка <> &ФормированиеПаллета");
		КонецЕсли;	
		
		Выборка = Запрос.Выполнить().Выбрать();
	
		СреднееКоличествоВКоробке = 0;
		СреднееКоличествоВРолике = 0;
			
		Если Выборка.Следующий() Тогда
			СреднееКоличествоВКоробке = Окр(Выборка.Количество / Выборка.КоличествоКоробок, Метаданные.Документы.ЗаказКлиента.Реквизиты.СреднееКоличествоВКоробке.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти);
			СреднееКоличествоВРолике = Окр(Выборка.Количество / Выборка.КоличествоРоликов, Метаданные.Документы.ЗаказКлиента.Реквизиты.СреднееКоличествоВРолике.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти);
		КонецЕсли;
		
		Если Заказ.СреднееКоличествоВКоробке <> СреднееКоличествоВКоробке ИЛИ Заказ.СреднееКоличествоВРолике <> СреднееКоличествоВРолике Тогда
			ЗаказОбъект = Заказ.ПолучитьОбъект();
			ЗаказОбъект.СреднееКоличествоВКоробке = СреднееКоличествоВКоробке;
			ЗаказОбъект.СреднееКоличествоВРолике = СреднееКоличествоВРолике;
			Если ЗаписыватьВРежимеОбмена Тогда
				ЗаказОбъект.ОбменДанными.Загрузка = Истина;
				ЗаказОбъект.Записать();
			Иначе
				ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Сообщить("Не удалось выполнить процедуру ""ОбновитьВЗаказеСреднееКоличествоВКоробкеИРолике"" для заказа " + Заказ.НомерБезПрефикса + ". Сообщите программистам");
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 02.03.2021 

Процедура УдалитьЗаписиИзРегистраЛико_ЭтапыЗаказовПоДокументу(Документ) Экспорт
	
	Возврат; // пока возврат, т.к. измерение "Документ" оказалось плохой идеей, потому что теперь при выборке среза последних по заказу система возвращает все строки с разными документами
	
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Метаданные.РегистрыСведений.Лико_ЭтапыЗаказа.Измерения.Документ.Тип.СодержитТип(ТипЗнч(Документ)) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписиУдаление = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьНаборЗаписей();		
	НаборЗаписиУдаление.Отбор.Документ.Установить(Документ);
	НаборЗаписиУдаление.Записать();	
	
КонецПроцедуры


Процедура Лико_УдалитьДублиЗаданийКРаспределениюРасчетов(Выборка, ИмяРегистра) Экспорт // --> Маковеева А.Ю. 11.06.2021
																	  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаданияКРаспределениюРасчетовСКлиентами.НомерЗадания КАК НомерЗадания,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами КАК ЗаданияКРаспределениюРасчетовСКлиентами
		|ГДЕ
		|	ЗаданияКРаспределениюРасчетовСКлиентами.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
		|	И ЗаданияКРаспределениюРасчетовСКлиентами.ОбъектРасчетов = &ОбъектРасчетов
		|	И ЗаданияКРаспределениюРасчетовСКлиентами.Документ = &Документ
		|	И ЗаданияКРаспределениюРасчетовСКлиентами.НомерЗадания < &НомерЗадания
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданияКРаспределениюРасчетовСКлиентами.ОбъектРасчетов,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.АналитикаУчетаПоПартнерам,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.Документ,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.НомерЗадания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаданияКРаспределениюРасчетовСКлиентами.НомерЗадания,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.АналитикаУчетаПоПартнерам,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.ОбъектРасчетов,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.Документ
		|ИЗ
		|	РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами КАК ЗаданияКРаспределениюРасчетовСКлиентами
		|ГДЕ
		|	ЗаданияКРаспределениюРасчетовСКлиентами.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
		|	И ЗаданияКРаспределениюРасчетовСКлиентами.ОбъектРасчетов = &ОбъектРасчетов
		|	И ЗаданияКРаспределениюРасчетовСКлиентами.Документ = НЕОПРЕДЕЛЕНО
		|	И ЗаданияКРаспределениюРасчетовСКлиентами.НомерЗадания < &НомерЗадания
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданияКРаспределениюРасчетовСКлиентами.ОбъектРасчетов,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.Документ,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.АналитикаУчетаПоПартнерам,
		|	ЗаданияКРаспределениюРасчетовСКлиентами.НомерЗадания";
	
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", 	Выборка.АналитикаУчетаПоПартнерам);
	Запрос.УстановитьПараметр("НомерЗадания", 				Константы["Номер"+ИмяРегистра].Получить());
	Запрос.УстановитьПараметр("ОбъектРасчетов", 			Выборка.ОбъектРасчетов);
	Запрос.УстановитьПараметр("Документ", 					Выборка.Документ);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаданияКРаспределениюРасчетовСКлиентами", ИмяРегистра);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДубли = РезультатЗапроса.Выбрать();
	
	Попытка
		Пока ВыборкаДубли.Следующий() Цикл
			НЗ = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НЗ.Отбор.АналитикаУчетаПоПартнерам.Установить(ВыборкаДубли.АналитикаУчетаПоПартнерам);
			НЗ.Отбор.ОбъектРасчетов.Установить(ВыборкаДубли.ОбъектРасчетов);
			НЗ.Отбор.НомерЗадания.Установить(ВыборкаДубли.НомерЗадания);
			НЗ.Отбор.Документ.Установить(ВыборкаДубли.Документ);
			НЗ.Прочитать();
			НЗ.Очистить();
			НЗ.Записать();	
		КонецЦикла;
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	// <-- Маковеева А.Ю. 11.06.2021

Процедура ОчищениеЦенВТоварыНеЗаДеньги(пСтрока) Экспорт // --> Начало Лико Митюшин МФМ 07.07.2021
		пСтрока.Цена = 0;
		пСтрока.ЦенаДляДокументов = 0;
		пСтрока.Сумма = 0;
		пСтрока.СуммаНДС = 0;
		пСтрока.СуммаСНДС = 0;
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 07.07.2021	

Функция ПроверитьВозможностьСчитыванияКраскиВЗаказ(ОбъектНоменклатурыСерияКодОбъектаНоменклатуры, Заказ, НомерПроката, МассивДоступныхКСписаниюКрасок = Неопределено) Экспорт
	
	Если ТипЗнч(ОбъектНоменклатурыСерияКодОбъектаНоменклатуры) = Тип("Число") Тогда
		// Найдем объект номенклатуры по коду
		ОбъектНоменклатуры = Справочники.ЯССМ_ОбъектыНоменклатуры.НайтиПоКоду(ОбъектНоменклатурыСерияКодОбъектаНоменклатуры);
	ИначеЕсли ТипЗнч(ОбъектНоменклатурыСерияКодОбъектаНоменклатуры) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		ОбъектНоменклатуры = ОбъектНоменклатурыСерияКодОбъектаНоменклатуры.ЯССМ_ОбъектНоменклатуры;
	Иначе
		ОбъектНоменклатуры = ОбъектНоменклатурыСерияКодОбъектаНоменклатуры;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Заказ) ИЛИ НЕ ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если МассивДоступныхКСписаниюКрасок = Неопределено Тогда
		МассивДоступныхКСписаниюКрасок = СформироватьМассивДоступныхКСписаниюКрасок(Заказ, НомерПроката);
	КонецЕсли;
	
	НайденнаяСтрока = МассивДоступныхКСписаниюКрасок.Найти(ОбъектНоменклатуры.Номенклатура);
	
	Возврат НайденнаяСтрока <> Неопределено;
	
КонецФункции

Функция ПроверитьВозможностьСчитыванияКраскиВЗаказМассив(МассивОбъектов, Заказ, НомерПроката) Экспорт
	
	МассивВозврата = Новый Массив;
	МассивДоступныхКСписаниюКрасок = СформироватьМассивДоступныхКСписаниюКрасок(Заказ, НомерПроката);
	
	Для каждого ЭлементМассива из МассивОбъектов Цикл
		Если НЕ ПроверитьВозможностьСчитыванияКраскиВЗаказ(ЭлементМассива, Заказ, НомерПроката, МассивДоступныхКСписаниюКрасок) Тогда
			МассивВозврата.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

Функция СформироватьМассивДоступныхКСписаниюКрасок(Заказ, НомерПроката) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЦвета.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &ЗаказКлиента
		|	И ЗаказКлиентаЦвета.НомерПроката = &НомерПроката
		|	И ЗаказКлиентаЦвета.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Лико_ПодготовкаМатериаловРезервирование.Номенклатура
		|ИЗ
		|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПодготовкаМатериалов.Резервирование КАК Лико_ПодготовкаМатериаловРезервирование
		|		ПО Лико_ПодготовкаМатериалов.Ссылка = Лико_ПодготовкаМатериаловРезервирование.Ссылка
		|			И (Лико_ПодготовкаМатериаловРезервирование.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКраска)
		|ГДЕ
		|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента
		|	И Лико_ПодготовкаМатериалов.НомерПроката = &НомерПроката
		|	И Лико_ПодготовкаМатериалов.Проведен
		|	И НЕ Лико_ПодготовкаМатериалов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ВидНоменклатурыКраска", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);
	Запрос.УстановитьПараметр("ЗаказКлиента", Заказ);
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

Функция НайтиСоздатьЧестныйЗнак(Gtin, ДатаЭмиссии, Создавать = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 14.05.2021 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЧестныйЗнак.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лико_ЧестныйЗнак КАК Лико_ЧестныйЗнак
		|ГДЕ
		|	Лико_ЧестныйЗнак.Gtin = &Gtin
		|	И Лико_ЧестныйЗнак.ДатаЭмиссии = &ДатаЭмиссии
		|	И НЕ Лико_ЧестныйЗнак.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Gtin", Gtin);
	Запрос.УстановитьПараметр("ДатаЭмиссии", ДатаЭмиссии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	ИначеЕсли НЕ Создавать Тогда
		Возврат Неопределено;
	Иначе
		НовыйОбъект = Справочники.Лико_ЧестныйЗнак.СоздатьЭлемент();
		НовыйОбъект.Gtin = Gtin;
		НовыйОбъект.ДатаЭмиссии = ДатаЭмиссии;
		НовыйОбъект.Наименование = Лико_ДополнительноКлиентСервер.ПолучитьНаименованиеЧестногоЗнака(НовыйОбъект);
		НовыйОбъект.Записать();
		Возврат НовыйОбъект.Ссылка;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 14.05.2021 

Процедура ПроверитьНеобходимостьИОтправитьПисьмоПоЗабраковкеМатериалов(ДокументСсылка,СтрокаОснастки) Экспорт // --> Начало Лико Ефимов ЕВВ 25.10.2021 
	
	НужноОтправлять = Ложь;
	ТипСообщения = "";
	Если НЕ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда 
		Если ЗначениеЗаполнено(ДокументСсылка.Решение) И НЕ ДокументСсылка.ПисьмоПоРешениюОтправлено Тогда
			НужноОтправлять = Истина;
			ТипСообщения = "ПоРешению";
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументСсылка.ТипВозвратаПоставщику) И НЕ ДокументСсылка.ПисьмоКладовщикамОтправлено Тогда
			НужноОтправлять = Истина;
			ТипСообщения = "Кладовщикам";
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(СтрокаОснастки.Решение) И НЕ СтрокаОснастки.ПисьмоПоРешениюОтправлено Тогда
			НужноОтправлять = Истина;
			ТипСообщения = "ПоРешению";
		КонецЕсли;
	КонецЕсли;
	
	Если НужноОтправлять Тогда
		СтруктураДляЗаполненя = ПолучитьДанныеДляОтправкиПисьмаЗаброковкиМатериалов(ДокументСсылка,СтрокаОснастки);
		Если НЕ СтруктураДляЗаполненя = Неопределено Тогда
			Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда 
				Макет = Документы.Лико_ЗабраковкаОснастки.ПолучитьМакет("ФормаПисьмаДляЭлектроннойПочты");
			Иначе	
				Макет = Документы.Лико_ЗабраковкаМатериалов.ПолучитьМакет("ФормаПисьмаДляЭлектроннойПочты");
			КонецЕсли;
			ЗаполнениеТабличногоДокументаПисьмаИОтправка(СтруктураДляЗаполненя, ТипСообщения, ПараметрыСеанса.ТекущийПользователь, Макет);
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			Если НЕ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда 
				ДокументОбъект["Письмо" + ТипСообщения + "Отправлено"] = Истина; 
			Иначе
				ДокументОбъект.Товары.НайтиСтроки(Новый Структура("Серия",СтрокаОснастки.Серия))[0].ПисьмоПоРешениюОтправлено = Истина; 
			КонецЕсли;
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 25.10.2021

Функция ЭтоЗаявкаТехнологамНаЗабраковкуМатериалов(Заявка) Экспорт // --> Начало Лико Ефимов ЕВВ 26.10.2021
	
	Если ЗначениеЗаполнено(Заявка)
		И Заявка.Секции.Количество() > 0 И Заявка.Секции[0].Причина = Справочники.ТС_ПричиныРемонтаРабочихЦентров.ЗабраковкаМатериала
		И ЗначениеЗаполнено(Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаРаботыСЗабраковкойМатериалов.ЗначениеПараметра)
		И Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаРаботыСЗабраковкойМатериалов.ЗначениеПараметра <= Заявка.Дата
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 26.10.2021  

Функция ЭтоЗаявкаТехнологамНаЗабраковкуОснастки(Заявка) Экспорт // --> Начало Лико Яцун 24.08.2022
	
	Если ЗначениеЗаполнено(Заявка)
		И Заявка.Секции.Количество() > 0 И Заявка.Секции[0].Причина = Справочники.ТС_ПричиныРемонтаРабочихЦентров.ЗабраковкаОснастки
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Яцун 24.08.2022 

Функция ПлощадкаПользователяПоУмолчанию() Экспорт
	Если ПараметрыСеанса.ТекущийПользователь.Лико_Площадки.Количество() > 0 Тогда
		Возврат ПараметрыСеанса.ТекущийПользователь.Лико_Площадки[0].Площадка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьЗаполнитьТекущуюСменуОтветственногоЛица(ТекОператор, СменаОтветственного = Ложь, Ответственный = Неопределено, ТипОтвЛица = "Технолог") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ПлощадкаПользователя = ПлощадкаПользователяПоУмолчанию();
	Если НЕ ЗначениеЗаполнено(ПлощадкаПользователя) Тогда
		Сообщить("Для вашего пользователя не заполнена площадка. Обратитесь к программистам");
		Возврат "";
	КонецЕсли;

	МассивНазванийДолжностей = Новый Массив;
	Если ТипОтвЛица = "Технолог" Тогда
		СинонимОтвЛица = "технолог";
		МассивНазванийДолжностей.Добавить("ДолжностьТехнолог");
		МассивНазванийДолжностей.Добавить("ДолжностьЗамГлТехнолога");
	ИначеЕсли ТипОтвЛица = "НачальникСменыОсновнойЦех" Тогда
		СинонимОтвЛица = "начальник смены";
		МассивНазванийДолжностей.Добавить("ДолжностьНачальникСмены");
	ИначеЕсли ТипОтвЛица = "НачальникСменыЦУ" Тогда
		СинонимОтвЛица = "начальник смены ЦУ";
		МассивНазванийДолжностей.Добавить("ДолжностьНачальникСмены");
	Иначе
		Сообщить("Тип ответственного лица """ + ТипОтвЛица + """ не предусмотрен. Обратитесь к программистам");
		Возврат "";
	КонецЕсли;
	СинонимОтвЛицаСБольшойБуквы = ВРег(Лев(СинонимОтвЛица, 1)) + Сред(СинонимОтвЛица, 2);
	
	Если ПлощадкаПользователя <> Справочники.Лико_Площадки.Ликофлекс Тогда
		Сообщить("Для площадки """ + ПлощадкаПользователя + """ заполнение " + ПолучитьСклоненияСтроки(СинонимОтвЛица,, "ПД=Родительный")[0] + " не предусмотрено");
		Возврат "";
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	ДневнаяСмена = Час(ТекущаяДата) >= 9 И Час(ТекущаяДата) < 21;
	ДатаНачалаСмены = НачалоДня(?(Час(ТекущаяДата) < 9, ТекущаяДата - 86400, ТекущаяДата));
	
	Ответственный = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_СоответствиеСменИКлючевыхСотрудников.Период КАК Период,
		|	Лико_СоответствиеСменИКлючевыхСотрудников.ДневнаяСмена КАК ДневнаяСмена,
		|	Лико_СоответствиеСменИКлючевыхСотрудников.Площадка КАК Площадка,
		|	Лико_СоответствиеСменИКлючевыхСотрудников.Технолог КАК Технолог,
		|	Лико_СоответствиеСменИКлючевыхСотрудников.НачальникСменыОсновнойЦех КАК НачальникСменыОсновнойЦех,
		|	Лико_СоответствиеСменИКлючевыхСотрудников.НачальникСменыЦУ КАК НачальникСменыЦУ
		|ИЗ
		|	РегистрСведений.Лико_СоответствиеСменИКлючевыхСотрудников КАК Лико_СоответствиеСменИКлючевыхСотрудников
		|ГДЕ
		|	Лико_СоответствиеСменИКлючевыхСотрудников.Период = &Период
		|	И Лико_СоответствиеСменИКлючевыхСотрудников.ДневнаяСмена = &ДневнаяСмена
		|	И Лико_СоответствиеСменИКлючевыхСотрудников.Площадка = &Площадка";
	
	Запрос.УстановитьПараметр("ДневнаяСмена", ДневнаяСмена);
	Запрос.УстановитьПараметр("Период", ДатаНачалаСмены);
	Запрос.УстановитьПараметр("Площадка", ПлощадкаПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи[ТипОтвЛица]) Тогда
		Ответственный = ВыборкаДетальныеЗаписи[ТипОтвЛица];	
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Ответственный) И ЗначениеЗаполнено(ТекОператор))
		ИЛИ СменаОтветственного Тогда
		ДолжностьОператора = Лико_Дополнительно.НайтиДолжностьФизЛица(ТекОператор, Неопределено);
		МассивНеобходимыхДолжностей = Новый Массив;
		Для каждого НазваниеДолжности из МассивНазванийДолжностей Цикл
			ТекДолжность = Справочники.Лико_ПредопределенныеЗначения[НазваниеДолжности].ЗначениеПараметра;
			Если ЗначениеЗаполнено(ТекДолжность) Тогда
				МассивНеобходимыхДолжностей.Добавить(ТекДолжность);
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(ДолжностьОператора) И МассивНеобходимыхДолжностей.Найти(ДолжностьОператора) <> Неопределено Тогда
			ВремяДоступностиИзмененияОтветственного = 9; // часов
			Если СменаОтветственного
				И ЗначениеЗаполнено(Ответственный)
				И ТекущаяДата > ДатаНачалаСмены + ?(ДневнаяСмена, 9, 21)*60*60 + ВремяДоступностиИзмененияОтветственного*60*60 Тогда
				Сообщить("Запрещено изменять ответственного в последние 3 часа смены. Для изменения обратитесь к программистам");
			Иначе
				// Добавим запись
				СтруктураИзмерений = Новый Структура("Период,Площадка,ДневнаяСмена", ДатаНачалаСмены, Запрос.Параметры.Площадка, ДневнаяСмена);
				МенеджерЗаписи = РегистрыСведений.Лико_СоответствиеСменИКлючевыхСотрудников.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураИзмерений);
				МенеджерЗаписи.Прочитать();
				Если НЕ МенеджерЗаписи.Выбран() Тогда
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураИзмерений);
				КонецЕсли;
				МенеджерЗаписи[ТипОтвЛица] = ТекОператор;
				МенеджерЗаписи.Записать(Истина);
				Если СменаОтветственного Тогда
					Сообщить(СинонимОтвЛицаСБольшойБуквы + " " + ?(ЗначениеЗаполнено(Ответственный), "изменен с " + Ответственный + " на " + ТекОператор, "установлен"));
				КонецЕсли;
				Ответственный = МенеджерЗаписи[ТипОтвЛица];
			КонецЕсли;
		Иначе
			Если СменаОтветственного Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Нужно ввести табельный номер сотрудника с одной из следующих должностей:";
				сч = 0;
				Для каждого ТекДолжность из МассивНеобходимыхДолжностей Цикл
					Сообщение.Текст = Сообщение.Текст + ?(сч = 0, " ", ", ") + ТекДолжность;
					сч = сч + 1;
				КонецЦикла;
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Надпись = "Текущая смена - " + Формат(ДатаНачалаСмены, "ДФ='д ММММ'");
	Если ДневнаяСмена Тогда
		Надпись = Надпись + " с 9:00 по 21:00.";
	Иначе
		Надпись = Надпись + " с 21:00 по 9:00.";
	КонецЕсли;
	
	Надпись = Надпись + " " + СинонимОтвЛицаСБольшойБуквы + ?(ЗначениеЗаполнено(Ответственный), " - " + Ответственный, " не заполнен");
	
	Возврат Надпись;
	
КонецФункции

Функция ПолучитьТабличныйДокументВариантаОтчета(ВариантОтчета, ДопПараметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Структура = Новый Структура;
	Структура.Вставить("СсылкаВарианта", ВариантОтчета); 
	Структура.Вставить("СсылкаОтчета", ВариантОтчета.Отчет);
	Структура.Вставить("КлючВарианта", ВариантОтчета.КлючВарианта);    				  
	Структура.Вставить("СхемаМодифицирована", Истина);
	ПользовательскиеНастройкиОтчета = ВариантОтчета.Настройки.Получить();
	Если ПользовательскиеНастройкиОтчета <> Неопределено Тогда
		ОтборНастройки = Новый КомпоновщикНастроекКомпоновкиДанных;
		ОтборНастройки.ЗагрузитьНастройки(ПользовательскиеНастройкиОтчета);
		Структура.Вставить("НастройкиКД", ОтборНастройки.Настройки);
		Структура.Вставить("ПользовательскиеНастройкиКД", ОтборНастройки.ПользовательскиеНастройки);
	КонецЕсли;
	Структура.Вставить("Лико_ДопПараметры", ДопПараметры);
	
	Отчет = ВариантыОтчетов.СформироватьОтчет(Структура, Ложь, Ложь);  	
	
	Возврат Отчет.ТабличныйДокумент;
	
КонецФункции
 
//Функция Лико_ВыбраннаяВалютаРазрешена(СтруктураПараметров) Экспорт // --> Начало Лико Ефимов ЕВВ 05.03.2022

//	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Клиент) Тогда
//		Сообщить("Выберите клиента");
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если СтруктураПараметров.Валюта <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
//		Возврат Истина;
//	КонецЕсли;
//	
//	Если Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СтруктураПараметров.Клиент, "РазрешенаОтгрузкаВРублях", Ложь) Тогда
//		Возврат Истина;
//	КонецЕсли;
//	
//	Сообщить("Запрещено выставлять счет на предоплату в рублях");
//	Возврат Ложь;
//	
//КонецФункции // <-- Конец Лико Ефимов ЕВВ 05.03.2022
  
Функция ПолучитьТекстЗапросаДолгиПоПартнерам() Экспорт
	
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		Возврат
		"ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ЕСТЬNULL(ВЫРАЗИТЬ(ПартнерыДополнительныеРеквизиты.Значение КАК БУЛЕВО), ЛОЖЬ)) КАК НеПроверять
		|ПОМЕСТИТЬ ВТ_Партнеры
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО Партнеры.Ссылка = ПартнерыДополнительныеРеквизиты.Ссылка
		|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""РазрешенаОтгрузкаБезПроверкиПросроченнойЗадолженности"")
		|ГДЕ
		|	Партнеры.Ссылка В(&МассивПартнеров)
		|
		|СГРУППИРОВАТЬ ПО
		|	Партнеры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток > 0
		|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток > 0
		|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгУпрОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток < 0
		|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
		|			ИНАЧЕ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаОстаток
		|		КОНЕЦ * -1) КАК ПредоплатаОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток < 0
		|				ТОГДА РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
		|			ИНАЧЕ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаУпрОстаток
		|		КОНЕЦ * -1) КАК ПредоплатаУпрОстаток
		|ПОМЕСТИТЬ ВТ_Регистр
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|			,
		|			АналитикаУчетаПоПартнерам.Партнер В
		|					(ВЫБРАТЬ
		|						Т.Ссылка
		|					ИЗ
		|						ВТ_Партнеры КАК Т
		|					ГДЕ
		|						НЕ Т.НеПроверять)
		|				И НЕ АналитикаУчетаПоПартнерам.Договор.СтатьяДвиженияДенежныхСредств.ПометкаУдаления) КАК РасчетыСКлиентамиПоСрокамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов,
		|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистр.Партнер КАК Партнер,
		|	СУММА(ВТ_Регистр.ДолгОстаток + ВТ_Регистр.ПредоплатаОстаток) КАК ДолгПлюсПредоплата,
		|	СУММА(ВТ_Регистр.ДолгУпрОстаток + ВТ_Регистр.ПредоплатаУпрОстаток) КАК ДолгПлюсПредоплатаУпр,
		|	СУММА(ВТ_Регистр.ПредоплатаОстаток * -1) КАК Предоплата,
		|	СУММА(ВТ_Регистр.ПредоплатаУпрОстаток * -1) КАК ПредоплатаУпр
		|ПОМЕСТИТЬ ВТ_РасчетыПоПартнерам
		|ИЗ
		|	ВТ_Регистр КАК ВТ_Регистр
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Регистр.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВТ_Регистр.Партнер КАК Партнер,
		|	ВТ_Регистр.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВТ_Регистр.ДолгОстаток + ВТ_Регистр.ПредоплатаОстаток КАК ДолгПлюсПредоплата,
		|	ВТ_Регистр.ДолгУпрОстаток + ВТ_Регистр.ПредоплатаУпрОстаток КАК ДолгПлюсПредоплатаУпр
		|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикам
		|ИЗ
		|	ВТ_РасчетыПоПартнерам КАК ВТ_РасчетыПоПартнерам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистр КАК ВТ_Регистр
		|		ПО ВТ_РасчетыПоПартнерам.Партнер = ВТ_Регистр.Партнер
		|ГДЕ
		|	ВТ_РасчетыПоПартнерам.ДолгПлюсПредоплата > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВТ_РасчетыПоАналитикам.Партнер КАК Партнер,
		|	ВТ_РасчетыПоАналитикам.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр КАК ДолгПлюсПредоплатаУпр,
		|	МАКСИМУМ(ЕСТЬNULL(РасчетыСКлиентами.ДатаПлатежа, &ТекДата)) КАК ДатаПлатежа
		|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикамСДатамиПлатежа
		|ИЗ
		|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
		|			И ВТ_РасчетыПоАналитикам.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов
		|			И (РасчетыСКлиентами.КОплате > 0)
		|			И (РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|ГДЕ
		|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам,
		|	ВТ_РасчетыПоАналитикам.Партнер,
		|	ВТ_РасчетыПоАналитикам.ОбъектРасчетов,
		|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа.Партнер КАК Партнер,
		|	СУММА(ВТ_РасчетыПоАналитикамСДатамиПлатежа.ДолгПлюсПредоплатаУпр) КАК ДолгПлюсПредоплатаУпр
		|ПОМЕСТИТЬ ВТ_РасчетыПоПартнерамПросроченные
		|ИЗ
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа КАК ВТ_РасчетыПоАналитикамСДатамиПлатежа
		|ГДЕ
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа.ДатаПлатежа <= &ТекДата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер КАК Партнер,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаРегл
		|					ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма / КурсыВалютСрезПоследних.Курс
		|				ИНАЧЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаПлатежа
		|ПОМЕСТИТЬ ВТ_НеПроведенныеПлатежи
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ПО ПоступлениеБезналичныхДенежныхСредств.Ссылка = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РасчетыПоПартнерамПросроченные КАК ВТ_РасчетыПоПартнерамПросроченные
		|		ПО (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер = ВТ_РасчетыПоПартнерамПросроченные.Партнер),
		|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаУпр) КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредств.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, -2) И ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, 1)
		|	И НЕ ПоступлениеБезналичныхДенежныхСредств.Проведен
		|	И НЕ ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыПоПартнерамПросроченные.Партнер КАК Партнер,
		|	ВТ_РасчетыПоПартнерамПросроченные.ДолгПлюсПредоплатаУпр КАК ДолгПлюсПредоплатаУпр,
		|	ЕСТЬNULL(ВТ_РасчетыПоПартнерам.ПредоплатаУпр, 0) КАК ПредоплатаУпр,
		|	ЕСТЬNULL(ВТ_НеПроведенныеПлатежи.СуммаПлатежа, 0) КАК НепроведеннаяПредоплатаУпр,
		|	ВТ_РасчетыПоПартнерамПросроченные.ДолгПлюсПредоплатаУпр - ЕСТЬNULL(ВТ_РасчетыПоПартнерам.ПредоплатаУпр, 0) - ЕСТЬNULL(ВТ_НеПроведенныеПлатежи.СуммаПлатежа, 0) КАК СуммаУпрДолгСУчетомПредоплаты
		|ИЗ
		|	ВТ_РасчетыПоПартнерамПросроченные КАК ВТ_РасчетыПоПартнерамПросроченные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетыПоПартнерам КАК ВТ_РасчетыПоПартнерам
		|		ПО ВТ_РасчетыПоПартнерамПросроченные.Партнер = ВТ_РасчетыПоПартнерам.Партнер
		|			И (ВТ_РасчетыПоПартнерам.Предоплата <> 0)
		|			И ВТ_РасчетыПоПартнерамПросроченные.Партнер = ВТ_РасчетыПоПартнерам.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеПроведенныеПлатежи КАК ВТ_НеПроведенныеПлатежи
		|		ПО ВТ_РасчетыПоПартнерамПросроченные.Партнер = ВТ_НеПроведенныеПлатежи.Партнер
		|			И (ВТ_НеПроведенныеПлатежи.СуммаПлатежа > 0)";
		
	Иначе
		Возврат
		"ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ЕСТЬNULL(ВЫРАЗИТЬ(ПартнерыДополнительныеРеквизиты.Значение КАК БУЛЕВО), ЛОЖЬ)) КАК НеПроверять
		|ПОМЕСТИТЬ ВТ_Партнеры
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО Партнеры.Ссылка = ПартнерыДополнительныеРеквизиты.Ссылка
		|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""РазрешенаОтгрузкаБезПроверкиПросроченнойЗадолженности"")
		|ГДЕ
		|	Партнеры.Ссылка В(&МассивПартнеров)
		|
		|СГРУППИРОВАТЬ ПО
		|	Партнеры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	РасчетыСКлиентамиПоДокументамОстатки.ЗаказКлиента КАК ЗаказКлиента,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгОстаток > 0
		|				ТОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток > 0
		|				ТОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгУпрОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгОстаток < 0
		|				ТОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгОстаток
		|			ИНАЧЕ РасчетыСКлиентамиПоДокументамОстатки.ПредоплатаОстаток
		|		КОНЕЦ) КАК ПредоплатаОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток < 0
		|				ТОГДА РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток
		|			ИНАЧЕ РасчетыСКлиентамиПоДокументамОстатки.ПредоплатаУпрОстаток
		|		КОНЕЦ) КАК ПредоплатаУпрОстаток
		|ПОМЕСТИТЬ ВТ_Регистр
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
		|			,
		|			АналитикаУчетаПоПартнерам.Партнер В
		|					(ВЫБРАТЬ
		|						Т.Ссылка
		|					ИЗ
		|						ВТ_Партнеры КАК Т
		|					ГДЕ
		|						НЕ Т.НеПроверять)
		|				И НЕ АналитикаУчетаПоПартнерам.Договор.СтатьяДвиженияДенежныхСредств.ПометкаУдаления) КАК РасчетыСКлиентамиПоДокументамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиПоДокументамОстатки.ЗаказКлиента,
		|	РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистр.Партнер КАК Партнер,
		|	СУММА(ВТ_Регистр.ДолгОстаток + ВТ_Регистр.ПредоплатаОстаток) КАК ДолгПлюсПредоплата,
		|	СУММА(ВТ_Регистр.ДолгУпрОстаток + ВТ_Регистр.ПредоплатаУпрОстаток) КАК ДолгПлюсПредоплатаУпр,
		|	СУММА(ВТ_Регистр.ПредоплатаОстаток * -1) КАК Предоплата,
		|	СУММА(ВТ_Регистр.ПредоплатаУпрОстаток * -1) КАК ПредоплатаУпр
		|ПОМЕСТИТЬ ВТ_РасчетыПоПартнерам
		|ИЗ
		|	ВТ_Регистр КАК ВТ_Регистр
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Регистр.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВТ_Регистр.Партнер КАК Партнер,
		|	ВТ_Регистр.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_Регистр.ДолгОстаток + ВТ_Регистр.ПредоплатаОстаток КАК ДолгПлюсПредоплата,
		|	ВТ_Регистр.ДолгУпрОстаток + ВТ_Регистр.ПредоплатаУпрОстаток КАК ДолгПлюсПредоплатаУпр
		|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикам
		|ИЗ
		|	ВТ_РасчетыПоПартнерам КАК ВТ_РасчетыПоПартнерам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистр КАК ВТ_Регистр
		|		ПО ВТ_РасчетыПоПартнерам.Партнер = ВТ_Регистр.Партнер
		|ГДЕ
		|	ВТ_РасчетыПоПартнерам.ДолгПлюсПредоплата > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВТ_РасчетыПоАналитикам.Партнер КАК Партнер,
		|	ВТ_РасчетыПоАналитикам.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр КАК ДолгПлюсПредоплатаУпр,
		|	МАКСИМУМ(ЕСТЬNULL(РасчетыСКлиентами.ДатаПлатежа, &ТекДата)) КАК ДатаПлатежа
		|ПОМЕСТИТЬ ВТ_РасчетыПоАналитикамСДатамиПлатежа
		|ИЗ
		|	ВТ_РасчетыПоАналитикам КАК ВТ_РасчетыПоАналитикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|		ПО ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
		|			И ВТ_РасчетыПоАналитикам.ЗаказКлиента = РасчетыСКлиентами.ОбъектРасчетов
		|			И (РасчетыСКлиентами.КОплате > 0)
		|			И (РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|ГДЕ
		|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплата > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РасчетыПоАналитикам.АналитикаУчетаПоПартнерам,
		|	ВТ_РасчетыПоАналитикам.Партнер,
		|	ВТ_РасчетыПоАналитикам.ЗаказКлиента,
		|	ВТ_РасчетыПоАналитикам.ДолгПлюсПредоплатаУпр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа.Партнер КАК Партнер,
		|	СУММА(ВТ_РасчетыПоАналитикамСДатамиПлатежа.ДолгПлюсПредоплатаУпр) КАК ДолгПлюсПредоплатаУпр
		|ПОМЕСТИТЬ ВТ_РасчетыПоПартнерамПросроченные
		|ИЗ
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа КАК ВТ_РасчетыПоАналитикамСДатамиПлатежа
		|ГДЕ
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа.ДатаПлатежа <= &ТекДата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РасчетыПоАналитикамСДатамиПлатежа.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер КАК Партнер,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаРегл
		|					ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма / КурсыВалютСрезПоследних.Курс
		|				ИНАЧЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаПлатежа
		|ПОМЕСТИТЬ ВТ_НеПроведенныеПлатежи
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ПО ПоступлениеБезналичныхДенежныхСредств.Ссылка = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РасчетыПоПартнерамПросроченные КАК ВТ_РасчетыПоПартнерамПросроченные
		|		ПО (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер = ВТ_РасчетыПоПартнерамПросроченные.Партнер),
		|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаУпр) КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредств.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, -2) И ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, 1)
		|	И НЕ ПоступлениеБезналичныхДенежныхСредств.Проведен
		|	И НЕ ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетыПоПартнерамПросроченные.Партнер КАК Партнер,
		|	ВТ_РасчетыПоПартнерамПросроченные.ДолгПлюсПредоплатаУпр КАК ДолгПлюсПредоплатаУпр,
		|	ЕСТЬNULL(ВТ_РасчетыПоПартнерам.ПредоплатаУпр, 0) КАК ПредоплатаУпр,
		|	ЕСТЬNULL(ВТ_НеПроведенныеПлатежи.СуммаПлатежа, 0) КАК НепроведеннаяПредоплатаУпр,
		|	ВТ_РасчетыПоПартнерамПросроченные.ДолгПлюсПредоплатаУпр - ЕСТЬNULL(ВТ_РасчетыПоПартнерам.ПредоплатаУпр, 0) - ЕСТЬNULL(ВТ_НеПроведенныеПлатежи.СуммаПлатежа, 0) КАК СуммаУпрДолгСУчетомПредоплаты
		|ИЗ
		|	ВТ_РасчетыПоПартнерамПросроченные КАК ВТ_РасчетыПоПартнерамПросроченные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетыПоПартнерам КАК ВТ_РасчетыПоПартнерам
		|		ПО ВТ_РасчетыПоПартнерамПросроченные.Партнер = ВТ_РасчетыПоПартнерам.Партнер
		|			И (ВТ_РасчетыПоПартнерам.Предоплата <> 0)
		|			И ВТ_РасчетыПоПартнерамПросроченные.Партнер = ВТ_РасчетыПоПартнерам.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеПроведенныеПлатежи КАК ВТ_НеПроведенныеПлатежи
		|		ПО ВТ_РасчетыПоПартнерамПросроченные.Партнер = ВТ_НеПроведенныеПлатежи.Партнер
		|			И (ВТ_НеПроведенныеПлатежи.СуммаПлатежа > 0)";
	КонецЕсли;
	
КонецФункции

Функция НайтиСотовыйНомерФизЛица(ФизЛицо) Экспорт // --> Начало Лико Ефимов ЕВВ 17.06.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
		|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление,
		|	ВЫБОР
		|		КОГДА ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка
		|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)
		|			ИЛИ ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("Ссылка", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Телефон = ВыборкаДетальныеЗаписи.НомерТелефона;
			Если НЕ ЗначениеЗаполнено(Телефон) Тогда
				Телефон = ВыборкаДетальныеЗаписи.Представление;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Телефон) Тогда
				Продолжить;
			КонецЕсли;
			// Обработаем
			Телефон = ОставитьВСтрокеТолькоЧисла(Телефон);
			Если СтрДлина(Телефон) = 10 Тогда
				Телефон = "7" + Телефон;
			КонецЕсли;
			Если СтрДлина(Телефон) = 11 Тогда
				Если Лев(Телефон, 1) = "8" Тогда
					Телефон = "7" + Прав(Телефон, 10);
				КонецЕсли;
				Возврат Телефон;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // <-- Конец Лико Ефимов ЕВВ 17.06.2022

Функция ОставитьВСтрокеТолькоЧисла(СтрокаРазличныеСимволы) Экспорт // --> Начало Лико Ефимов ЕВВ 17.06.2022

    Если СтрДлина(СтрокаРазличныеСимволы) = 0 Тогда
        Возврат "";
    КонецЕсли;

    РезультатЧисло = "";
    Для а = 1 по СтрДлина(СтрокаРазличныеСимволы) Цикл
        Символ = Сред(СтрокаРазличныеСимволы, а, 1);

        Если Найти("0123456789", Символ) = 0 Тогда
            Продолжить;
        КонецЕсли;

        РезультатЧисло = "" + РезультатЧисло + Символ;
    КонецЦикла;

    Возврат РезультатЧисло;

КонецФункции // <-- Конец Лико Ефимов ЕВВ 17.06.2022

Функция СформироватьНадписьЧасыМинуты(ЧислоСекунд, СтрокаВремяНоль = "00:00") Экспорт
	
	Если ЗначениеЗаполнено(ЧислоСекунд) Тогда
        ЧислоЧасов=Цел(ЧислоСекунд / 60 / 60);
		ЧислоМинут = Цел(ЧислоСекунд / 60);
		Если ЧислоЧасов = 0 И ЧислоМинут = 0 Тогда
			ЧислоМинут = 1;
		КонецЕсли;
        Возврат Прав("00"+Строка(ЧислоЧасов),Макс(2,СтрДлина(Строка(ЧислоЧасов)))) + ":" + Прав("00"+Строка(ЧислоМинут - ЧислоЧасов * 60),2); 
    Иначе    
        Возврат СтрокаВремяНоль;
	КонецЕсли;
	
КонецФункции

Функция СформироватьНадписьМесяцыДниЧасы(ЧислоСекунд, СтрокаВремяНоль = "00:00:00") Экспорт
	
	Если ЗначениеЗаполнено(ЧислоСекунд) Тогда
		ТекДата = ТекущаяДата();
        ЧислоЧасов=Цел(ЧислоСекунд / 60 / 60);
        ЧислоДней=Цел(ЧислоЧасов / 24);
        ЧислоМесяцев = Цел(ЧислоДней / 30);
		Если ЧислоМесяцев = 0 И ЧислоДней = 0 И ЧислоЧасов = 0 Тогда
			Возврат СтрокаВремяНоль;
		КонецЕсли;
        Возврат Прав("00"+Строка(ЧислоМесяцев),Макс(2,СтрДлина(Строка(ЧислоМесяцев)))) + ":" + Прав("00"+Строка(ЧислоДней - ЧислоМесяцев * 30),2) + ":" + Прав("00"+Строка(ЧислоЧасов - ЧислоДней * 24),2); 
    Иначе    
        Возврат СтрокаВремяНоль;
	КонецЕсли;
	
КонецФункции 

Процедура УдалитьПредыдущуюВерсиюФайла(ВладелецФайла,ИмяФайла) Экспорт // --> Начало Лико Яцун 13.12.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗаказКлиентаПрисоединенныеФайлы КАК ЗаказКлиентаПрисоединенныеФайлы
		|ГДЕ
		|	ЗаказКлиентаПрисоединенныеФайлы.Наименование ПОДОБНО &ИмяФайла + ""%""
		|	И ЗаказКлиентаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ ЗаказКлиентаПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	Запрос.УстановитьПараметр("ИмяФайла", Лев(ИмяФайла,8));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Файл = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Файл.УстановитьПометкуУдаления(Истина);
		
	КонецЦикла;
	
	ОбластьПоиска = Новый Массив;
	
	ВключитьОбъекты = Новый Массив;
	ВключитьОбъекты.Добавить("Справочник.ЗаказКлиентаПрисоединенныеФайлы");
	
	НайденныеОбъекты = НайтиПомеченныеНаУдаление(ОбластьПоиска,ВключитьОбъекты);
	
	УдалитьОбъекты(НайденныеОбъекты);
	
КонецПроцедуры // <-- Конец Лико Яцун 13.12.2022

Процедура ИзменитьРеквизитыОбъектаВРежимеОбмена(Ссылка, СтруктураРеквизитов) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект = Ссылка.ПолучитьОбъект();
	Объект.ОбменДанными.Загрузка = Истина;
	Для каждого ЭлементСтруктуры из СтруктураРеквизитов Цикл
		Попытка
			Объект[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		Исключение
			Сообщить("В функции ИзменитьРеквизитыОбъектаВРежимеОбмена произошла ошика: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		Объект.Записать();
	Исключение
		Сообщить("В функции ИзменитьРеквизитыОбъектаВРежимеОбмена произошла ошика: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// формирует ВНЕШНЮЮ ссылку объекта (с кокретной базой)
Функция СформироватьНавигационнуюСсылкуОбъекта(Ссылка) Экспорт // --> Начало Лико Ефимов ЕВВ 09.06.2023

	Попытка
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Ссылка);
		
		СтрокаСоединения = СтрокаСоединенияИнформационнойБазы(); //Пример: Srvr="test-1c";Ref="erp_demo";
		ДлинаСтроки = СтрДлина(СтрокаСоединения);
		//Отрежем имя базы - справа до второй кавычки
		ИмяБазы = "";
		КолКавычек = 0;
		Для сч=1 По ДлинаСтроки Цикл
			ТекСимвол = Сред(СтрокаСоединения, ДлинаСтроки-сч+1, 1);
			Если КолКавычек = 1 И ТекСимвол <> Символ(34) Тогда
				ИмяБазы = ТекСимвол + ИмяБазы;
			КонецЕсли;
			
			Если ТекСимвол = Символ(34) Тогда
				КолКавычек = КолКавычек + 1;
			КонецЕсли;
			Если КолКавычек = 2 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// А теперь отрежем имя сервера слева
		ИмяСервера = "";
		КолКавычек = 0;
		Для сч=1 По ДлинаСтроки Цикл
			ТекСимвол = Сред(СтрокаСоединения, сч, 1);
			Если КолКавычек = 1 И ТекСимвол <> Символ(34) Тогда
				ИмяСервера = ИмяСервера + ТекСимвол;
			КонецЕсли;
			
			Если ТекСимвол = Символ(34) Тогда
				КолКавычек = КолКавычек + 1;
			КонецЕсли;
			Если КолКавычек = 2 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// А теперь соберем внешнюю ссылку
		НавигационнаяСсылкаВнешняя = "e1c://server/" + ИмяСервера + "/" + ИмяБазы + "?Z=%2B%2C%2B" + "#" + НавигационнаяСсылка;
		
		Возврат НавигационнаяСсылкаВнешняя;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 09.06.2023

Функция ПолучитьКоличествоЗасчитанныхЭтикетокПоЗаказу(ЗаказКлиента) Экспорт // --> Начало Лико Ефимов ЕВВ 07.07.2023

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_УчетГотовыхЭтикетокОбороты.ЗаказКлиента КАК ЗаказКлиента,
		|	Лико_УчетГотовыхЭтикетокОбороты.НомерБланка КАК НомерБланка,
		|	Лико_УчетГотовыхЭтикетокОбороты.НомерПриложения КАК НомерПриложения,
		|	ВЫБОР
		|		КОГДА Лико_УчетГотовыхЭтикетокОбороты.ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.Линкс)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПлощадкаЛинкс,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_УчетГотовыхЭтикетокОбороты.Место = ЗНАЧЕНИЕ(Перечисление.Лико_МестаУчетаГотовыхЭтикеток.Перемотка)
		|				ТОГДА Лико_УчетГотовыхЭтикетокОбороты.КоличествоПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоПеремотка,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_УчетГотовыхЭтикетокОбороты.Место = ЗНАЧЕНИЕ(Перечисление.Лико_МестаУчетаГотовыхЭтикеток.ВыходнойКонтроль)
		|				ТОГДА Лико_УчетГотовыхЭтикетокОбороты.КоличествоПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоВыходнойКонтроль,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_УчетГотовыхЭтикетокОбороты.Место = ЗНАЧЕНИЕ(Перечисление.Лико_МестаУчетаГотовыхЭтикеток.Упаковка)
		|				ТОГДА Лико_УчетГотовыхЭтикетокОбороты.КоличествоПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоУпаковка
		|ИЗ
		|	РегистрНакопления.Лико_УчетГотовыхЭтикеток.Обороты(, , , ЗаказКлиента = &ЗаказКлиента) КАК Лико_УчетГотовыхЭтикетокОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_УчетГотовыхЭтикетокОбороты.ЗаказКлиента,
		|	Лико_УчетГотовыхЭтикетокОбороты.НомерБланка,
		|	Лико_УчетГотовыхЭтикетокОбороты.НомерПриложения,
		|	ВЫБОР
		|		КОГДА Лико_УчетГотовыхЭтикетокОбороты.ЗаказКлиента.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.Линкс)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИТОГИ ПО
		|	НомерБланка";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаНомерБланка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеБланков = Новый Соответствие;
	
	Пока ВыборкаНомерБланка.Следующий() Цикл
		СоответствиеПриложений = Новый Соответствие;
		ВыборкаДетальныеЗаписи = ВыборкаНомерБланка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ПлощадкаЛинкс Тогда
				Если ВыборкаДетальныеЗаписи.КоличествоУпаковка <> 0 Тогда
					ТекКоличество = ВыборкаДетальныеЗаписи.КоличествоУпаковка;
				Иначе
					ТекКоличество = ВыборкаДетальныеЗаписи.КоличествоПеремотка;
				КонецЕсли;
			Иначе
				ТекКоличество = ВыборкаДетальныеЗаписи.КоличествоВыходнойКонтроль;
			КонецЕсли;
			СоответствиеПриложений.Вставить(ВыборкаДетальныеЗаписи.НомерПриложения, ТекКоличество);
		КонецЦикла;
		СоответствиеБланков.Вставить(ВыборкаНомерБланка.НомерБланка, СоответствиеПриложений);
	КонецЦикла;

	Возврат СоответствиеБланков;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 07.07.2023

Функция НовыйМеханизмСозданияФорм(ПлощадкаОрганизация, Дата) Экспорт // --> Начало Лико Ефимов ЕВВ 24.07.2024

	Если ТипЗнч(ПлощадкаОрганизация) = Тип("СправочникСсылка.Лико_Площадки") Тогда
		Организация = ПлощадкаОрганизация.Организация;
	Иначе
		Организация = ПлощадкаОрганизация;
	КонецЕсли;
	
	ДатаНачалаНовогоМеханизмаСозданияФорм = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаНовогоМеханизмаСозданияФорм.ЗначениеПараметра;

	Если НЕ ЗначениеЗаполнено(ДатаНачалаНовогоМеханизмаСозданияФорм)
		ИЛИ Дата < ДатаНачалаНовогоМеханизмаСозданияФорм Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра
		ИЛИ Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 24.07.2024

Процедура ОтменитьЗаявкиНаФормыПриЗакрытииЗаказа(МассивЗаказов) Экспорт // --> Начало Лико Ефимов ЕВВ 30.08.2024
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_ЗаявкаНаРемонтРабочихЦентров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТС_ЗаявкаНаРемонтРабочихЦентров КАК ТС_ЗаявкаНаРемонтРабочихЦентров
		|ГДЕ
		|	НЕ ТС_ЗаявкаНаРемонтРабочихЦентров.ПометкаУдаления
		|	И ТС_ЗаявкаНаРемонтРабочихЦентров.ПодразделениеПолучатель = ЗНАЧЕНИЕ(Справочник.ТС_Подразделения.Формщики)
		|	И ТС_ЗаявкаНаРемонтРабочихЦентров.ТекущееСостояние В (ЗНАЧЕНИЕ(Перечисление.ТС_СостоянияРемонтныхРабот.ВключенВПлан), ЗНАЧЕНИЕ(Перечисление.ТС_СостоянияРемонтныхРабот.Подтвержден))
		|	И ТС_ЗаявкаНаРемонтРабочихЦентров.ЗаказКлиента В(&МассивЗаказов)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Дата = ТекущаяДата();
		ЗавершитьЭтапЗаявкиНаРемонт(Выборка.Ссылка, Дата);
		ДобавитьЭтапЗаявкиНаРемонт(Выборка.Ссылка, Перечисления.ТС_СостоянияРемонтныхРабот.СнятИзПлана, Дата, ПараметрыСеанса.ТекущийПользователь);
		
		НаборЗаписей  = РегистрыСведений.ТС_ПланированиеРемонтныхРаботРЦ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(Выборка.Ссылка);
		НаборЗаписей.Записать(Истина);
	КонецЦикла;

КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 30.08.2024
 
Процедура ДобавитьЭтапЗаявкиНаРемонт(ЗаявкаНаРемонт, Этап = Неопределено, Дата, Сотрудник) Экспорт // --> Начало Лико Ефимов ЕВВ 30.08.2024	
	
	Если Этап=Неопределено Тогда
		Этап=Перечисления.ТС_СостоянияРемонтныхРабот.ВРаботе;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.Состояние КАК Этап
		|ИЗ
		|	РегистрСведений.ТС_ЭтапыВыполненияРемонтныхРаботРЦ.СрезПоследних(, ЗаявкаНаРемонт = &ЗаявкаНаРемонт) КАК ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних";
		Запрос.УстановитьПараметр("ЗаявкаНаРемонт",ЗаявкаНаРемонт);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Этап=Выборка.Этап;
		КонецЦикла; 
		
	КонецЕсли;
	
	НачатьТранзакцию();	
	
	НаборЗаписей 				=РегистрыСведений.ТС_ЭтапыВыполненияРемонтныхРаботРЦ.СоздатьНаборЗаписей();
	НоваяЗапись					=НаборЗаписей.Добавить();
	НоваяЗапись.Период			=Дата;
	НоваяЗапись.ДатаНачала		=Дата;
	НоваяЗапись.ЗаявкаНаРемонт	=ЗаявкаНаРемонт;
	НоваяЗапись.Состояние		=Этап;
	НоваяЗапись.РабочийЦентр	=ЗаявкаНаРемонт.РабочийЦентр;
	НоваяЗапись.Сотрудник		=Сотрудник;
	НоваяЗапись.ЛожныйВызов		=ЗаявкаНаРемонт.ЛожныйВызов;
	НаборЗаписей.Записать(Ложь);
	
	Если Этап=Перечисления.ТС_СостоянияРемонтныхРабот.НеВыполнен Тогда
		РегистрыСведений.Лико_СтатусыЗаявокНаРемонтПоЗакупкамЗапчастей.НовыйСтатус(ЗаявкаНаРемонт,Перечисления.Лико_СтатусыЗакупкиЗапчастей.ВРаботеУИнженера);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 30.08.2024

Процедура ЗавершитьЭтапЗаявкиНаРемонт(ЗаявкаНаРемонт,Дата) Экспорт // --> Начало Лико Ефимов ЕВВ 30.08.2024
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.Период,
	|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.ДатаНачала,
	|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.ДатаОкончания,
	|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.Состояние,
	|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.ЗаявкаНаРемонт,
	|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.РабочийЦентр,
	|	ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних.Сотрудник
	|ИЗ
	|	РегистрСведений.ТС_ЭтапыВыполненияРемонтныхРаботРЦ.СрезПоследних(, ЗаявкаНаРемонт = &ЗаявкаНаРемонт) КАК ТС_ЭтапыВыполненияРемонтныхРаботРЦСрезПоследних";
	Запрос.УстановитьПараметр("ЗаявкаНаРемонт",ЗаявкаНаРемонт );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ТС_ЭтапыВыполненияРемонтныхРаботРЦ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(Выборка.ЗаявкаНаРемонт);
		//НаборЗаписей.Отбор.Состояние.Установить(Выборка.Состояние);
		НаборЗаписей.Прочитать();
		Для каждого Запись Из НаборЗаписей Цикл
			Запись.ДатаОкончания=Дата;
		КонецЦикла; 
		НаборЗаписей.Записать();
	КонецЦикла; 
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 30.08.2024

Процедура УдалитьИзПланаНаСервере(ЗаявкаНаРемонт,Этап,Сотрудник) Экспорт
	Если ЗаявкаНаРемонт.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	//Сотрудник	=ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	Дата		=ТекущаяДата();
	
	Этап		=Перечисления.ТС_СостоянияРемонтныхРабот[Этап];
	
	
	ЗавершитьЭтапЗаявкиНаРемонт(ЗаявкаНаРемонт,Дата);
	ДобавитьЭтапЗаявкиНаРемонт(ЗаявкаНаРемонт,Этап,Дата,Сотрудник);
	
	НаборЗаписей 					= РегистрыСведений.ТС_ПланированиеРемонтныхРаботРЦ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(ЗаявкаНаРемонт);
	НаборЗаписей.Записать(Истина);
	
	ОбновитьОчередьВПлане();
КонецПроцедуры

Процедура ДобавитьЭтапНаСервере(Исполнитель,ЗаявкаНаРемонт,Этап, Комментарий = Неопределено) Экспорт // из обработки УпралвениеЗаявкамиНаРемонт.ФормаДокумента
	
	Этап=Перечисления.ТС_СостоянияРемонтныхРабот[Этап];
	Дата=ТекущаяДата();
	ЗавершитьЭтапЗаявкиНаРемонт(ЗаявкаНаРемонт,Дата);
	ДобавитьЭтапЗаявкиНаРемонт(ЗаявкаНаРемонт,Этап,Дата,Исполнитель);
	
	// --> Начало Лико Ефимов ЕВВ 02.02.2021
	ПодразделениеМеханики = ЗаявкаНаРемонт.ПодразделениеПолучатель = Справочники.ТС_Подразделения.Механики
							ИЛИ ЗаявкаНаРемонт.ПодразделениеПолучатель = Справочники.ТС_Подразделения.МеханикиЦифра;
	Если Этап = Перечисления.ТС_СостоянияРемонтныхРабот.Выполнен
		И (ЗаявкаНаРемонт.ПодразделениеПолучатель = Справочники.ТС_Подразделения.Технологи
			ИЛИ ЗаявкаНаРемонт.ПодразделениеПолучатель = Справочники.ТС_Подразделения.Формщики
			ИЛИ ПодразделениеМеханики // --> Начало Лико Ефимов ЕВВ 10.05.2023 добавляем механиков
		) Тогда 
		НужноОповещение = Истина;
		Если ПодразделениеМеханики Тогда
			Если ЗначениеЗаполнено(ЗаявкаНаРемонт.МестоСозданияЗаявки)
				И ЗаявкаНаРемонт.МестоСозданияЗаявки <> "Тачпад" Тогда 
				// Нужно установить статус закрытия
				ЗаявкаОбъект = ЗаявкаНаРемонт.ПолучитьОбъект();
				ЗаявкаОбъект.СтатусЗакрытия = Перечисления.ТС_СтатусыЗаявокТехнологамПриЗакрытии.Авто; 
				ЗаявкаОбъект.ВыполненаПодтверждение = Истина;
				ЗаявкаОбъект.ОбменДанными.Загрузка = Истина;
				ЗаявкаОбъект.Записать(); 
				Если ЗначениеЗаполнено(Документы.ТС_ЗаявкаНаРемонтРабочихЦентров.РольМеханика(ЗаявкаНаРемонт.Автор)) Тогда
					// Заявка механику создана самими механиками. В этом случае оповещать никого не нужно
					НужноОповещение = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НужноОповещение Тогда
			ОператорКоторомуНеобходимоПоказать = Неопределено;
			Если ЗаявкаНаРемонт.МестоСозданияЗаявки = "Тачпад"
				И Документы.ТС_ЗаявкаНаРемонтРабочихЦентров.ЗаявкаБылаВНевыполненных(ЗаявкаНаРемонт) Тогда
				// Заявка в невыполненных, нужно только одного печатника
				ОператорКоторомуНеобходимоПоказать = ЗаявкаНаРемонт.Автор;
			КонецЕсли;
			Документы.ТС_ЗаявкаНаРемонтРабочихЦентров.СформироватьОповещениеОВыполненииЗаявки(ЗаявкаНаРемонт, Комментарий,, ОператорКоторомуНеобходимоПоказать);
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 02.02.2021
	
КонецПроцедуры

Процедура ОбновитьОчередьВПлане() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС_ПланированиеРемонтныхРаботРЦ.РабочийЦентр,
	|	ТС_ПланированиеРемонтныхРаботРЦ.ЗаявкаНаРемонт,
	|	ТС_ПланированиеРемонтныхРаботРЦ.НомерОчереди КАК НомерОчереди
	|ИЗ
	|	РегистрСведений.ТС_ПланированиеРемонтныхРаботРЦ КАК ТС_ПланированиеРемонтныхРаботРЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерОчереди";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	НомерОчереди=1;
	Пока Выборка.Следующий() Цикл
		Если НомерОчереди<>Выборка.НомерОчереди Тогда
			НаборЗаписей = РегистрыСведений.ТС_ПланированиеРемонтныхРаботРЦ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(Выборка.ЗаявкаНаРемонт);
			НаборЗаписей.Прочитать();
			Для каждого Запись Из НаборЗаписей  Цикл
				
				Запись.НомерОчереди=НомерОчереди;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
		НомерОчереди=НомерОчереди+1;
	КонецЦикла; 
	
КонецПроцедуры


Функция ПолучитьЗначенияДопРеквизитовКлиентаДляПечатиДокументов(Партнер = Неопределено, Контрагент = Неопределено) Экспорт // <-- Начало Лико Яцун С. В. 13.01.2025

	ДопДанные = Новый Структура();
	
	СНомеромКонтракта = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Партнер, "РеализацияКакХенкельИЮнилевер_c9569d7edf7e41eca11c538537ca726b", Ложь)
	ИЛИ Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Партнер, "ПечатьДокументовСНомеромКонтракта_2a029765662e4c61bb68bce57d313f98", Ложь)
	ИЛИ Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Контрагент, "ПечатьДокументовСНомеромКонтракта_a53e7e7bb4804cb991c655a007b2eda1", Ложь);
	СКодомЭтикеткиЗаказчика = НЕ Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Партнер, "ПечатьДокументовБезГалкиСКодомЭтикетки_af928073435546308edea7efb2fb4565", Ложь);
	
	ДопДанные.Вставить("СНомеромКонтракта",СНомеромКонтракта);
	ДопДанные.Вставить("СКодомЭтикеткиЗаказчика",СКодомЭтикеткиЗаказчика);
	
	Возврат ДопДанные;
	
КонецФункции // <-- Конец Лико Яцун С. В. 13.01.2025

Функция ЭтоСтрокаСплошнойФормы(СтрокаТчЦветаЗаказаКлиента) Экспорт // --> Начало Лико Ефимов ЕВВ 19.06.2025
	
	Если СтрокаТчЦветаЗаказаКлиента.ВидСекции.ВидПечати = Справочники.Лико_ВидыПечати.Флексо
		И (СтрокаТчЦветаЗаказаКлиента.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Лак
			ИЛИ СтрокаТчЦветаЗаказаКлиента.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Праймер
			ИЛИ СтрокаТчЦветаЗаказаКлиента.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Клей)
		И СтрокаТчЦветаЗаказаКлиента.ВидЗаливки = Перечисления.Лико_ВидЗаливки.Сплошная
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 19.06.2025

Функция СоздатьНовуюФорму(ПараметрыДляСозданияНовойФормы) Экспорт
	
	// --> Начало Лико Ефимов ЕВВ 19.06.2025 Перенес эту функцию из формы заявки на цветоделение, чтобы вызывать ее из обработки тачпада при создании сплошной формы
	
	ВидПечати = ПараметрыДляСозданияНовойФормы.ВидСекции.ВидПечати;
	НоваяФормаЦвета = Справочники.Лико_Формы.СоздатьЭлемент();
	// --> Начало Лико Ефимов ЕВВ 16.06.2025
	Если ПараметрыДляСозданияНовойФормы.Свойство("Сплошная") И ПараметрыДляСозданияНовойФормы.Сплошная Тогда
		// Спрлошные формы создаем отдельно
		НоваяФормаЦвета.Сплошная = Истина;
		НоваяФормаЦвета.Заказ = ПараметрыДляСозданияНовойФормы.Ссылка;
		НоваяФормаЦвета.ВидПечати = ВидПечати;
		НоваяФормаЦвета.Длина = ПараметрыДляСозданияНовойФормы.Длина;
		НоваяФормаЦвета.ТолщинаПолимера = ПараметрыДляСозданияНовойФормы.ТолщинаПолимера;
		НоваяФормаЦвета.Ширина = ПараметрыДляСозданияНовойФормы.Ширина;
		НоваяФормаЦвета.Площадка = ПараметрыДляСозданияНовойФормы.Площадка;
		НоваяФормаЦвета.Наименование = "Сплошная " + НоваяФормаЦвета.Длина + " / " + НоваяФормаЦвета.Ширина + " / " + НоваяФормаЦвета.ТолщинаПолимера + " (длина / ширина / толщина полимера)";
	// <-- Конец Лико Ефимов ЕВВ 16.06.2025
	Иначе
		НоваяФормаЦвета.Контрагент = ПараметрыДляСозданияНовойФормы.Контрагент; 
		НоваяФормаЦвета.Заказ = ПараметрыДляСозданияНовойФормы.Ссылка;
		НоваяФормаЦвета.ВидПечати = ВидПечати; 
		НоваяФормаЦвета.ВидСекции = ПараметрыДляСозданияНовойФормы.ВидСекции;
		Если ВидПечати = Справочники.Лико_ВидыПечати.Флексо ИЛИ ВидПечати = Справочники.Лико_ВидыПечати.Трафарет ИЛИ ПараметрыДляСозданияНовойФормы.ВидСекции = Справочники.Лико_ВидыСекций.ГлубокаяПечать Тогда
			НоваяФормаЦвета.ТипЦвета = ПараметрыДляСозданияНовойФормы.ТипЦвета1; 
			НоваяФормаЦвета.ТипКраски = ПараметрыДляСозданияНовойФормы.ТипКраски; 
			НоваяФормаЦвета.Название = ПараметрыДляСозданияНовойФормы.Название;
			НоваяФормаЦвета.Наименование = ?(ЗначениеЗаполнено(ПараметрыДляСозданияНовойФормы.ТипЦвета1), Строка(ПараметрыДляСозданияНовойФормы.ТипЦвета1)+ " ", "")+?(ЗначениеЗаполнено(ПараметрыДляСозданияНовойФормы.ТипКраски), Строка(ПараметрыДляСозданияНовойФормы.ТипКраски)+ " ", "")+ ?(ЗначениеЗаполнено(ПараметрыДляСозданияНовойФормы.Название), Строка(ПараметрыДляСозданияНовойФормы.Название), "");
		ИначеЕсли ВидПечати = Справочники.Лико_ВидыПечати.Цифровая Тогда 
			НоваяФормаЦвета.Наименование = Строка(ПараметрыДляСозданияНовойФормы.ВидСекции) + " " + ПараметрыДляСозданияНовойФормы.НомерБезПрефикса;
		КонецЕсли;
		НоваяФормаЦвета.Площадка = ПараметрыДляСозданияНовойФормы.Площадка;
		НоваяФормаЦвета.Организация = НоваяФормаЦвета.Площадка.Организация;
		
		Для каждого Эт из ПараметрыДляСозданияНовойФормы.Товары Цикл
			стрЭт = НоваяФормаЦвета.Этикетки.Добавить();
			стрэт.Номенклатура =  Эт.Номенклатура;
		КонецЦикла;
		
		// --> Начало Лико Ефимов ЕВВ 29.07.2024 
		Если ПараметрыДляСозданияНовойФормы.Свойство("Дисторт") Тогда
			НоваяФормаЦвета.ДистортФлексо = ПараметрыДляСозданияНовойФормы.Дисторт;
			НоваяФормаЦвета.ВидПолимера = ПараметрыДляСозданияНовойФормы.ВидПолимера;
			Если НЕ ПараметрыДляСозданияНовойФормы.Цветоделение И ПараметрыДляСозданияНовойФормы.ДистортВидПолимера Тогда
				// Цветоеделение не установлено, ДистортВидПолимера установлен
				// Меняем заказ на тот, который установлен в старой форме
				НоваяФормаЦвета.Заказ = ПараметрыДляСозданияНовойФормы.СтараяФорма.Заказ;
				// Заполяем код по старому телу
				ПрефиксВидПолимера = Лев(СокрЛП(ПараметрыДляСозданияНовойФормы.ВидПолимера.Префикс), 1);
				ПрефиксДисторт = ПараметрыДляСозданияНовойФормы.Дисторт.Префикс;
				НоваяФормаЦвета.Код = Лев(ПараметрыДляСозданияНовойФормы.СтараяФорма.Код, 9) + ПрефиксВидПолимера + ПрефиксДисторт; 
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 29.07.2024 
	КонецЕсли;
	
	НоваяФормаЦвета.Записать();  
	
	Возврат НоваяФормаЦвета.Ссылка	
	
КонецФункции

Функция ПолучитьПараметрыСплошнойФормы(ЗаказКлиента, РабочийЦентр)

	СтруктураВозврата = Новый Структура("Длина,ТолщинаПолимера,Ширина"); 
	
	ВидРЦ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийЦентр, "ВидРабочегоЦентра");
	РевизитыВидаРЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРЦ, "Лико_ТолщинаПолимераФлексоформ,лкМаксимальнаяНарезка");
	// Ширина = нарезка с округлением до целых сантиметров. Например, нарезка 200 - ширина 200, нарезка 205 - ширина 200, нарезка 210 - ширина 210 и т.д.
	ШиринаПоНарезке = Цел(ЗаказКлиента.Нарезка.Размер / 10) * 10;
	Если ВидРЦ = Справочники.ВидыРабочихЦентров.GallusGranitic 
		ИЛИ ВидРЦ = Справочники.ВидыРабочихЦентров.GallusInkjet
		ИЛИ ВидРЦ = Справочники.ВидыРабочихЦентров.Omet
		ИЛИ ВидРЦ = Справочники.ВидыРабочихЦентров.Comexi
		Тогда
		СтруктураВозврата.Ширина = ШиринаПоНарезке;
	ИначеЕсли ВидРЦ = Справочники.ВидыРабочихЦентров.Omega Тогда
		СтруктураВозврата.Ширина = 330;
	ИначеЕсли ЗначениеЗаполнено(РевизитыВидаРЦ.лкМаксимальнаяНарезка) Тогда
		СтруктураВозврата.Ширина = РевизитыВидаРЦ.лкМаксимальнаяНарезка; 
	Иначе
		СтруктураВозврата.Ширина = ШиринаПоНарезке;
	КонецЕсли;

	Длина = ?(ЗаказКлиента.Цифровой ИЛИ ВидРЦ = Справочники.ВидыРабочихЦентров.Omega, ЗаказКлиента.ШагПечати, ЗаказКлиента.ДлинаПечати) * 1000; // Переведем в мм
	СтруктураВозврата.Длина = ?(Длина - Цел(Длина) > 0, Цел(Длина) + 1, Длина); // Округлим всегда в большую сторону
	СтруктураВозврата.ТолщинаПолимера = РевизитыВидаРЦ.Лико_ТолщинаПолимераФлексоформ; 

	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПроверитьПодобратьСоздатьСплошнуюФорму(ЗаказОбъект, СтрокаТчЦветаЗаказаКлиента, ПараметрыДляСозданияНовойФормы) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураВозврата = Новый Структура("СозданаНоваяФорма,Модифицированность", Ложь, Ложь);
	
	ТекПараметрыСплошнойФормы = ПолучитьПараметрыСплошнойФормы(ЗаказОбъект, СтрокаТчЦветаЗаказаКлиента.РабочийЦентр);
	Если ЗначениеЗаполнено(СтрокаТчЦветаЗаказаКлиента.Форма) Тогда
		Если НЕ ПроверитьСплошнуюФормуНаСоответствиеПараметрамЗаказа(ЗаказОбъект, СтрокаТчЦветаЗаказаКлиента, ТекПараметрыСплошнойФормы) Тогда
			// Форма очистилась, поставим модифицированность
			СтруктураВозврата.Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТчЦветаЗаказаКлиента.Форма) Тогда
		// Попробуем найти форму по ключевым параметрам
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_Формы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лико_Формы КАК Лико_Формы
		|ГДЕ
		|	НЕ Лико_Формы.ПометкаУдаления
		|	И Лико_Формы.Сплошная
		|	И Лико_Формы.Ширина = &Ширина
		|	И Лико_Формы.Длина = &Длина
		|	И Лико_Формы.ТолщинаПолимера = &ТолщинаПолимера
		|	И Лико_Формы.Площадка = &Площадка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лико_Формы.Код";
		
		Запрос.УстановитьПараметр("Длина", ТекПараметрыСплошнойФормы.Длина);
		Запрос.УстановитьПараметр("ТолщинаПолимера", ТекПараметрыСплошнойФормы.ТолщинаПолимера);
		Запрос.УстановитьПараметр("Ширина", ТекПараметрыСплошнойФормы.Ширина);
		Запрос.УстановитьПараметр("Площадка", ЗаказОбъект.Площадка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			// Такая форма уже есть, подставим ее
			СтрокаТчЦветаЗаказаКлиента.Форма = Выборка.Ссылка;
			стрФ = ЗаказОбъект.Формы.Добавить();
			стрФ.Ключстроки = СтрокаТчЦветаЗаказаКлиента.ключстроки;
			стрФ.Значение = СтрокаТчЦветаЗаказаКлиента.Форма;  
			стрФ.Цветоделение = СтрокаТчЦветаЗаказаКлиента.Цветоделение;
			//Сообщить("Сплошная форма для строки №" + СтрокаТчЦветаЗаказаКлиента.НомерСтроки + " подобрана из уже существующих (" + СтрокаТчЦветаЗаказаКлиента.Форма + ")");
			СтруктураВозврата.Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТчЦветаЗаказаКлиента.Форма) Тогда
		// Нужно создать новую сплошную форму
		ПараметрыДляСозданияНовойФормы.Вставить("Сплошная", Истина);
		ПараметрыДляСозданияНовойФормы.Вставить("Длина", ТекПараметрыСплошнойФормы.Длина);
		ПараметрыДляСозданияНовойФормы.Вставить("ТолщинаПолимера", ТекПараметрыСплошнойФормы.ТолщинаПолимера);
		ПараметрыДляСозданияНовойФормы.Вставить("Ширина", ТекПараметрыСплошнойФормы.Ширина);
		НоваяФорма = СоздатьНовуюФорму(ПараметрыДляСозданияНовойФормы);
		СтрокаТчЦветаЗаказаКлиента.форма = НоваяФорма;
		СтруктураВозврата.СозданаНоваяФорма = Истина;
		СтруктураВозврата.Модифицированность = Истина;
		//Необходимо записать значение в табличную часть "Формы"
		стрФ = ЗаказОбъект.Формы.Добавить();
		стрФ.Ключстроки = СтрокаТчЦветаЗаказаКлиента.ключстроки;
		стрФ.Значение = СтрокаТчЦветаЗаказаКлиента.Форма;  
		стрФ.Цветоделение = СтрокаТчЦветаЗаказаКлиента.Цветоделение;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПроверитьСплошнуюФормуНаСоответствиеПараметрамЗаказа(ЗаказОбъект, СтрокаТчЦветаЗаказаКлиента, ПараметрыСплошнойФормы = Неопределено) Экспорт
	
	Если ПараметрыСплошнойФормы = Неопределено Тогда
		ПараметрыСплошнойФормы = ПолучитьПараметрыСплошнойФормы(ЗаказОбъект, СтрокаТчЦветаЗаказаКлиента.РабочийЦентр);
	КонецЕсли;
	
	// Проверим, соответствует ли форма параметрам строки
	Если НЕ СтрокаТчЦветаЗаказаКлиента.Форма.Сплошная
		ИЛИ СтрокаТчЦветаЗаказаКлиента.Форма.Ширина <> ПараметрыСплошнойФормы.Ширина  
		ИЛИ СтрокаТчЦветаЗаказаКлиента.Форма.Длина <> ПараметрыСплошнойФормы.Длина
		ИЛИ СтрокаТчЦветаЗаказаКлиента.Форма.ТолщинаПолимера <> ПараметрыСплошнойФормы.ТолщинаПолимера
		ИЛИ СтрокаТчЦветаЗаказаКлиента.Форма.Площадка <> ЗаказОбъект.Площадка
		Тогда
		// Форма не соответствует, очистим ее
		СтрокаТчЦветаЗаказаКлиента.Форма = Неопределено;
		// Удалим форму из ТЧ Формы
		МассивСтрокФормыКУдалению = ЗаказОбъект.Формы.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаТчЦветаЗаказаКлиента.КлючСтроки));
		Для каждого СтрокаТЧФормы Из МассивСтрокФормыКУдалению Цикл
			ЗаказОбъект.Формы.Удалить(СтрокаТЧФормы);
		КонецЦикла;
		Возврат Ложь;
	Иначе              
		// Форма соответствует
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции

Функция ЗаказСейчасНаТачпаде(Заказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТСИсторияРабочегоСтолаОператора.Заказ КАК Заказ,
		|	МАКСИМУМ(ТСИсторияРабочегоСтолаОператора.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПоследняяЗаписьПоЗаказу
		|ИЗ
		|	РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
		|ГДЕ
		|	ТСИсторияРабочегоСтолаОператора.Заказ = &Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТСИсторияРабочегоСтолаОператора.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоследняяЗаписьПоЗаказу.Заказ КАК Заказ,
		|	ВТ_ПоследняяЗаписьПоЗаказу.Период КАК Период,
		|	МАКСИМУМ(ТСИсторияРабочегоСтолаОператора.РабочийЦентр) КАК РабочийЦентр
		|ПОМЕСТИТЬ ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром
		|ИЗ
		|	ВТ_ПоследняяЗаписьПоЗаказу КАК ВТ_ПоследняяЗаписьПоЗаказу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
		|		ПО ВТ_ПоследняяЗаписьПоЗаказу.Период = ТСИсторияРабочегоСтолаОператора.Период
		|			И ВТ_ПоследняяЗаписьПоЗаказу.Заказ = ТСИсторияРабочегоСтолаОператора.Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПоследняяЗаписьПоЗаказу.Заказ,
		|	ВТ_ПоследняяЗаписьПоЗаказу.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.Заказ КАК Заказ,
		|	ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.Период КАК Период,
		|	ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.РабочийЦентр КАК РабочийЦентр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ТСИсторияРабочегоСтолаОператора.Заказ ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЗаказСейчасНаМашине
		|ИЗ
		|	ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром КАК ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
		|		ПО ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.Заказ <> ТСИсторияРабочегоСтолаОператора.Заказ
		|			И ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.Период < ТСИсторияРабочегоСтолаОператора.Период
		|			И ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.РабочийЦентр = ТСИсторияРабочегоСтолаОператора.РабочийЦентр
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.Заказ,
		|	ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.Период,
		|	ВТ_ПоследняяЗаписьПоЗаказуСРабочимЦентром.РабочийЦентр";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.ЗаказСейчасНаМашине ТОГДА
		Возврат ВыборкаДетальныеЗаписи.РабочийЦентр;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция РассчитатьДатуПлатежа(ПартнерДокумента, ДатаДокумента) Экспорт // --> Маковеева А.Ю. 28.09.2018
											   
	СвойствоДнейОтсрочки = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "КоличествоДнейОтсрочкиОплаты");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартнерыДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Ссылка = &Партнер
	|	И ПартнерыДополнительныеРеквизиты.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Партнер", 	ПартнерДокумента);
	Запрос.УстановитьПараметр("Свойство", 	СвойствоДнейОтсрочки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СдвигДат = 0;
	Иначе
		ВыборкаДнейОтсрочки = РезультатЗапроса.Выбрать();
		Пока ВыборкаДнейОтсрочки.Следующий() Цикл
			СдвигДат = ВыборкаДнейОтсрочки.Значение;	
		КонецЦикла;
	КонецЕсли;
	
	НоваяДатаПлатежа = ДатаДокумента + СдвигДат*86400;    
	Возврат НоваяДатаПлатежа;
	
КонецФункции // <-- Маковеева А.Ю. 28.09.2018	



#КонецОбласти


#Область Штрихкоды

Функция ОбработатьШтрихКодНеТовараСервер(ШК) Экспорт // --> Начало Лико Ефимов ЕВВ 30.03.2017
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	Если СтрДлина(ШК) > 0 Тогда
		
		Результат = РасшифроватьШК(ШК);
		Если СтрДлина(Результат.Ошибка) > 0 Тогда
			Возврат Результат;
		КонецЕсли;
		
		Результат = ОбработкаШК(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 30.03.2017 

Функция ОбработкаШК(ДанныеШК, ФормаКлиента=Неопределено, ГП = Ложь) Экспорт //AS
	
	Результат = ДанныеШК;
	Ош = "Штрихкод "+ДанныеШК.ШК+" не обработан.";
	
	Если ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Сотрудника Тогда // работаем со справочником сотрудников
		
		ОбработкаШК_Сотрудник(ДанныеШК, ФормаКлиента, Результат);
		Возврат Результат;
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_ЗаказаСпецификации Тогда // Заказ-спецификация
		
		ОбработкаШК_ЗаказСпецификация(ДанныеШК, ФормаКлиента, Результат);
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Заказа Тогда
		
		//Ничего делать не нужно, вся инфа уже лежит в результате
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Паллета Тогда //AS 9-паллет
		
		ОбработкаШК_Паллет(ДанныеШК, ФормаКлиента, Результат, ГП);
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Адреса Тогда //AS 18-АдресХранения
		
		ОбработкаШК_АдресХранения(ДанныеШК, ФормаКлиента, Результат);
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий Тогда //AS 18-АдресХранения (краткий)
		
		ОбработкаШК_АдресХранения(ДанныеШК, ФормаКлиента, Результат);
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий Тогда // ЯССМ Объекты номенклатуры короткий шк
		
		ОбработкаШК_ЯССМ_ОбъектНоменклатурыКороткий(ДанныеШК, ФормаКлиента, Результат);
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры Тогда
		
		ОбработкаШК_ЯССМ_ОбъектНоменклатуры(ДанныеШК, ФормаКлиента, Результат);
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_ЗаявкаНаСклад Тогда // ЯССМ заявка на склад шк
		
		ОбработкаШК_ЯССМ_ЗаявкаНаСклад(ДанныеШК, ФормаКлиента, Результат);
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Конверта Тогда // ЯССМ заявка на склад шк
		
		ОбработкаШК_Конверт(ДанныеШК, ФормаКлиента, Результат);
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_РабочегоЦентра Тогда // работаем со справочником рабочих центров
		
		ОбработкаШК_РабочийЦентр(ДанныеШК, ФормаКлиента, Результат);
		
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_ВходящихДокументов Тогда // Входящий документ
		
		ОбработкаШК_ВходящихДокументов(ДанныеШК, ФормаКлиента, Результат);
		
		// --> Начало Лико Ефимов ЕВВ 27.07.2020
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Растарки Тогда // Растарка
		
		ОбработкаШК_Растарки(ДанныеШК, Результат);
		
		// <-- Конец Лико Ефимов ЕВВ 27.07.2020
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Тара Тогда // Растарка
		
		ОбработкаШК_Тара(ДанныеШК, Результат);
		
		// <-- Начало Лико Яцун С. В. 26.05.2025 
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_КартаСнятияПерерасхода Тогда // Растарка
		
		ОбработкаШК_КартаСнятияПерерасхода(ДанныеШК, Результат);
		// <-- Конец Лико Яцун С. В. 26.05.2025 
		
	//+ ---> Лико m.shenderov 24.02.2026
				
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_ТипоразмерПаллета Тогда // ТипоразмерПаллета
		
		ОбработкаШК_ТипоразмерПаллета(ДанныеШК, Результат);
		//- <--- Лико m.shenderov 24.02.2026
	ИначеЕсли ДанныеШК.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Паллета2_0 Тогда // Паллет 2.0 
		ОбработкаШК_Паллет2_0(ДанныеШК, Результат);
		
	Иначе
		
		Результат.Ошибка = Ош;
	КонецЕсли; // обработка справочников
	
	Возврат Результат;
КонецФункции

// Функция расшифровывает ШК с проверкой контрольного символа и возвращает структуру,
// содержащую сам штрихкод, его вид, управляющий символ, вид информации.
//
// Параметры:
//  ШК				- <Строка>
//					штрихкод.
//  ТипШК			- <ПланВидовХарактеристикСсылка.ТипыШтрихкодов>
//					тип штрихкода.
//  ГУИДСканераШК	- <Строка>
//					уникальный идентификатор сканера штрихкодов.
//
// Возвращаемое значение:
//  <Структура> - Структура расшифрованных параметров.
//
Функция РасшифроватьШК(ШК, ТипШК=Неопределено, ГУИДСканераШК="") Экспорт //AS
	
	// видимо 14, 12 и 20 - это длинный ЛИКО - ШК
	
	// 12 символьное кодирование
	// УпрСимвол 		- 1 символ ШК (1 команда, 2 справочник)
	// ВидИнформации 	- 3 символа (код справочника,команды и т.п.)
	// КодИнформации;   - 7 символов Уникальный номер
	// Перем КонтрСумма - 1 символ
	
	// 14 символьное кодирование
	// УпрСимвол 		- 1 символ ШК (1 команда, 2 справочник)
	// ВидИнформации 	- 3 символа (код справочника,команды и т.п.)
	// НомерБланка		- 2 символа
	// КодИнформации;   - 7 символов Уникальный номер
	// Перем КонтрСумма - 1 символ
	
	///////////////////////////////////////////////////////
	// EPSMA штрихкоды (с примером)
	//
	// EPSMA Roll Number - Номер бобины (20 символов)
	// 00 x xxxxxx xxxxxxxxxx x       общий случай
	// 00 3 641578 9991570014 9       пример
	//  | |   |        |      |
	//  | |   |        |      |______ Контрольный символ
	//  | |   |        |_____________ Порядковый номер
	//  | |   |______________________ Индивидуальный ean-код продукта
	//  | |__________________________ Инликатор упаковщика
	//  |____________________________ Идентификатор приложения
	//
	//
	// EPSMA EAN Product Code - Код продукта (13 символов)
	// xxxxxxx xxxxx x                общий случай
	// 6415780 11589 1                пример
	//    |      |   |
	//    |      |   |_______________ Контрольный символ
	//    |      |___________________ Порядковый номер
	//    |__________________________ Индивидуальный ean-код продукта
	//
	//
	// EPSMA Roll Variables - Информация о продукте (18 символов)
	// 8001 0 xxx 0 xxxx xxx x x      общий случай
	// 8001 0 210 0 2400 076 0 0      пример
	//   |  |  |  |   |   |  | |
	//   |  |  |  |   |   |  | |_____ Количество склеек (0-7 - количество склеек, 8 - более 7, 9 - нет данных)
	//   |  |  |  |   |   |  |_______ Направление размотки (0 - лицом наружу, 1 - лицом внутрь, 9 - нет данных)
	//   |  |  |  |   |   |__________ Размер втулки
	//   |  |  |  |   |______________ Длина роля (мм)
	//   |  |  |  |__________________ [неизвестно]
	//   |  |  |_____________________ Ширина роля (мм)
	//   |  |________________________ [неизвестно]
	//   |___________________________ Идентификатор приложения (8 - управляющий символ, число(001) - вид информации)
	// 
	//
	// EPSMA Best Before Date - Употребить до (8 символов)
	// 15 xxxxxx                      общий случай
	// 15 120501                      пример
	//  |    |
	//  |    |_______________________ 2 символа - год, 2 символа - месяц, 2 символа - день
	//  |____________________________ Идентификатор приложения
	//
	//
	// EPSMA Customer Order Number - Номер заказа клиента (8 символов)     ПОПРАВИТЬ!!!!!!!!!
	// 40 xxxxxx                      общий случай
	// 40 013985                      пример
	//  |   |
	//  |   |________________________ Внутренний номер заказа клиента
	//  |____________________________ Идентификатор приложения
	//
	//
	// EPSMA Roll ID - порядковый номер бобины (12 символов) 
	//    [правая часть штрих-кода EPSMA Roll Number]
	// 
	// x xxxxxxxxxx x       общий случай
	// 8 9991570014 9       пример
	// |     |      |
	// |     |      |______ Контрольный символ
	// |     |_____________ Порядковый номер
	// |___________________ Один символ от ean-кода продукта (к примеру, 8 от 64157[8])
	// 
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Штрих-код объекта номенклатуры (30 символов)
	//
	// 6 0x xxxxxxx xxx xxxx xxxxxxx xxxxx x     общий случай
	// 6 01 0000257 210 2000 0000075 00003 9     пример
	// |  |   |      |   |      |      |   |
	// |  |   |      |   |      |      |   |___ Контрольный символ
	// |  |   |      |   |      |      |_______ Серийный номер (#)
	// |  |   |      |   |      |______________ Код объекта номенклатуры (код элемента справочника)
	// |  |   |      |   |_____________________ Количественный показатель (количество килограмм, длина в метрах, количество штук в поставке)
	// |  |   |      |_________________________ Нарезка (ширина роля) - для рулонных материалов. Для остальных - 000.
	// |  |   |________________________________ Код номенклатуры (Код родительского элемента в справочнике Номенклатура)
	// |  |____________________________________ Вид информации (код справочника, документа и пр.). 01 или 02 - код справочника ЯССМ_ОбъектыНоменклатуры (уникальный и неуникальный)
	// |_______________________________________ Управляющий символ (6 для ячеистого склада сырья и материалов)
	//
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Штрих-код заказа-спецификации (24 символов)
	//
	// 6 03 xx xxxxxxx xx xxxxxxxxx x     общий случай
	// 6 03 01 7212845 02 A00000108 0     пример
	// |  |  |    |    |      |     |
	// |  |  |    |    |      |     |__________ Контрольный символ
	// |  |  |    |    |      |________________ Код спецификации (код элемента справочника)
	// |  |  |    |    |_______________________ Номер передела
	// |  |  |    |____________________________ Номер заказа, 7 цифр
	// |  |  |_________________________________ Номер бланка, 2 цифры
	// |  |____________________________________ Вид информации (код справочника, документа и пр.). 03 - ШК заказа спецификации
	// |_______________________________________ Управляющий символ (6 для ячеистого склада сырья и материалов)
	//
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Штрих-код конверта (13 символов)
	//
	// 6 04 xxxxxxxxx xx x     общий случай
	// 6 04 L00000001 01 0     пример
	// |  |     |     |  |
	// |  |     |     |  |_______ Контрольный символ
	// |  |     |     |__________ Тип конверта (тип по размеру)
	// |  |     |________________ Код коверта (код элемента справочника)
	// |  |______________________ Вид информации (код справочника, документа и пр.). 03 - ШК заказа спецификации
	// |_________________________ Управляющий символ (6 для ячеистого склада сырья и материалов)
	//
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Короткий штрих-код объекта номенклатуры (15 символов)
	//
	// 6 05 хххх xxxxxxx x     общий случай
	// 6 05 2000 0000075 9     пример
	// |  |   |     |    |
	// |  |   |     |    |_____ Контрольный символ
	// |  |   |     |__________ Код объекта номенклатуры (код элемента справочника)
	// |  |   |________________ Количественный показатель (количество килограмм, длина в метрах, количество штук в поставке)	
	// |  |____________________ Вид информации (код справочника, документа и пр.). 01 или 02 - код справочника ЯССМ_ОбъектыНоменклатуры (уникальный и неуникальный)
	// |_______________________ Управляющий символ (6 для ячеистого склада сырья и материалов)
	//
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Новый штрих-код сотрудника (14 символов)
	//
	// 6 06 хххxxxxxxx x     общий случай
	// 6 06 0000002975 9     пример
	// |  |     |   |
	// |  |     |   |_____ Контрольный символ
	// |  |     |_________ Код сотрудника (код элемента справочника)
	// |  |_______________ Вид информации (код справочника, документа и пр.). 06 - код справочника Сотрудники
	// |__________________ Управляющий символ (6 для ячеистого склада сырья и материалов)
	//
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Штрих-код расширенного справочника "Расход[Приход] товароместа" (20 символов)
	//
	// 3 007 xxxxxxx xxxxxxxx x     общий случай [для Расход товароместа]
	// 3 007 0090813 00000002 3     пример
	// 3 008 xxxxxxx xxxxxxxx x     общий случай [для Приход товароместа]
	// 3 008 0090813 00000002 4     пример
	// |  |     |       |     |
	// |  |     |       |     |_________ Контрольный символ
	// |  |     |       |_______________ Серийный номер (#)
	// |  |     |_______________________ id упаковки товароместа
	// |  |_____________________________ Вид информации (код справочника). 7 - расход товароместа. 8 - приход товароместа.
	// |________________________________ Управляющий символ (3 - расширенные справочники
	//
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Штрих-код расширенного справочника по товароместам + UID (20 символов)
	//
	// 3 004 xxxxxxx xxxxxxxx x     общий случай
	// 3 004 0175219 00000100 3     пример
	// |  |     |       |     |
	// |  |     |       |     |_________ Контрольный символ
	// |  |     |       |_______________ Серийный номер (#)
	// |  |     |_______________________ id упаковки товароместа
	// |  |_____________________________ Вид информации (код справочника). 4 - расширенный справочник по товароместам + UID
	// |________________________________ Управляющий символ (3 - расширенные справочники
	//
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// Amcor - Информация о ролике (27-28 символов)
	// 9001 xxxxxx xxx xxxx xxxxxx-x/x      общий случай
	// 9001 243840 562 2300 200942-7/4      пример
	//   |    |     |    |     |
	//   |    |     |    |     |_______ Идентификатор ролика (в базе поставщика). может быть 10 или 11 символов (пример, 200942-7/4 и 200942-15/4)
	//   |    |     |    |_____________ Длина роля (мм)
	//   |    |     |__________________ Нарезка (мм)
	//   |    |________________________ Код номенклатуры (в базе 1с)
	//   |_____________________________ Идентификатор приложения (9 - управляющий символ, число(001) - вид информации)
	///////////////////////////////////////////////////////
	
	//+m.shenderov 22.11.2016
	
	///////////////////////////////////////////////////////
	// Штрих-код входящих документов (10 -11 Символов)
	//
	// 5  хх xxxxxx  x     общий случай
	// 5  04 017521  3     пример
	// |  |     |    |
	// |  |     |    |__________________ Контрольный символ
	// |  |     |_______________________ Код информации(Номер в реестре  типов документов) 
	// |  |_____________________________ Вид информации(СаКод документа)
	// |________________________________ Управляющий символ (5 - СА учет входящих документов)
	//
	///////////////////////////////////////////////////////
	//-m.shenderov 22.11.2016
	
	// --> Начало Лико Ефимов ЕВВ 27.07.2020
	///////////////////////////////////////////////////////
	// Штрих-код растарки: необходимо выйти на документ и на номер цепочки в этом документе
	//
	// 3 11  xx  xx  xxxxxx  xxx     общий случай
	// 3 11  lk  20  061577  001     пример
	// |  |   |   |   |       |    
	// |  |   |   |   |       |    
	// |  |   |   |   |       |      
	// |  |   |   |   |       |________________ Номер цепочки в документе
	// |  |   |   |   |________________________ Номер документа
	// |  |   |   |____________________________ Год документа
	// |  |   |________________________________ Префикс организации латинскими буквами
	// |  |____________________________________ Вид информации (код справочника, документа и пр.). 11 - перемещение паллета
	// |_______________________________________ Управляющий символ (3 - документ)
	//
	///////////////////////////////////////////////////////
	// <-- Конец Лико Ефимов ЕВВ 27.07.2020
	
	//+m.shenderov 24.12.2020
	
	///////////////////////////////////////////////////////
	// Штрих-код Лико_Тара (10 имволов)
	//
	// 3  хх xxxxxx  x     общий случай
	// 3  60 017521  3     пример
	// |  |     |    |
	// |  |     |    |__________________ Контрольный символ
	// |  |     |_______________________ Код информации(Код справочника
	// |  |_____________________________ Вид информации(Лико_Тара)
	// |________________________________ Управляющий символ (3 - расширенные справочники)
	//
	///////////////////////////////////////////////////////
	//-m.shenderov 24.12.2020
	
	// <-- Начало Лико Яцун С. В. 23.05.2025
	///////////////////////////////////////////////////////
	// Штрих-код карт снятия и перерасхода
	//
	// 3  xx    xx  xxxxxxxxx     общий случай
	// 3 12\13  20  000000001     пример
	// |  |      |      |           
	// |  |      |      |           
	// |  |      |      |             
	// |  |      |      | 
	// |  |      |      |________________________ Номер документа
	// |  |      |____________________________ Год документа
	// |  | 
	// |  |____________________________________ Вид информации (код справочника, документа и пр.). 12 -карта снятия, 13 - карта перерасхода
	// |_______________________________________ Управляющий символ (3 - документ)
	//
	///////////////////////////////////////////////////////
	// <-- Конец Лико Яцун С. В. 23.05.2025
	
	
	ПроверятьКонтрСумму = Истина;
	
	Шк = СокрЛП(ШК);
	РезультатОбработкиШК = Новый Структура;
	РезультатОбработкиШК.Вставить("ШК", ШК);
	РезультатОбработкиШК.Вставить("Ошибка", "Ошибка при обработке штрихкода " + ШК);
	РезультатОбработкиШК.Вставить("ДлинаШК", СтрДлина(ШК));
	
	Если РезультатОбработкиШК.ДлинаШК=0 Тогда
		Возврат РезультатОбработкиШК;
	КонецЕсли;
	
	Попытка
		УпрСимвол = Число(Лев(ШК,1));
	Исключение
		Возврат РезультатОбработкиШК;
	КонецПопытки;
	
	Попытка // вывалит исключение при обработке ШК EPSMA Customer Order Number
		ВидИнформации = Число(Сред(ШК,2,3));
	Исключение
		ВидИнформации = 0;
	КонецПопытки;
	// {{ DGavrilov 
	Попытка
		EPSMA_УпрСимвол = Число(Лев(ШК,2)); // два символа слева (используются в штрихкодах EPSMA)
		ВидИнформации_2символа = Число(Сред(ШК,2,2)); // Используется в ЯССМ. Двух достаточно, три - "роскошь".
	Исключение
		Возврат РезультатОбработкиШК;
	КонецПопытки;
	
	// }} DGavrilov
	
	///////////////////////////////////////////////////////
	// Штрих-код сотрудника (12 символов)
	// 2 002 xxxxxxx x            общий случай
	// 2 002 0002929 6            пример
	// |  |     |    |
	// |  |     |    |___________ Контрольный символ
	// |  |     |________________ Табельный номер сотрудника
	// |  |______________________ Вид информации (код справочника). 2 - справочник сотрудников
	// |_________________________ Управляющий символ (2 - справочники)
	///////////////////////////////////////////////////////
	Если РезультатОбработкиШК.ДлинаШК = 12 И УпрСимвол = 2 И ВидИнформации = 2 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Сотрудника);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Ошибка="";
		
		///////////////////////////////////////////////////////
		// Штрих-код сотрудника (полный код) (14 символов)
		//
		// 6 06 ххххxxxxxx x     общий случай
		// 6 06 9000002929 3     пример
		// |  |     |    |
		// |  |     |    |_________ Контрольный символ
		// |  |     |______________ Табельный номер (полный) сотрудника. (1я цифра - код региона)
		// |  |____________________ Вид информации (код справочника, документа и пр.). 06 - сотрудники
		// |_______________________ Управляющий символ
		///////////////////////////////////////////////////////
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 14 И УпрСимвол = 6 И ВидИнформации_2символа = 6 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_СотрудникаПолныйКод);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,4,10));
		РезультатОбработкиШК.Ошибка="";
		
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 12 И УпрСимвол = 2 И ВидИнформации = 15 Тогда // Справочник "рабочие места"
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_РабочегоЦентра);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Ошибка="";
		
		// заказы 
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 14 И УпрСимвол = 2 И ВидИнформации = 7 Тогда //Заказы
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Заказа);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("НомерБланка", Сред(ШК,5,2));
		РезультатОбработкиШК.Вставить("НомерЗаказа", Сред(ШК,7,7));
		РезультатОбработкиШК.Ошибка="";
		
		// Карточка складского учета, выпущенная продукция
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 20 И УпрСимвол = 3 И ВидИнформации = 5 Тогда //коробки
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Коробки);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Вставить("УникальныйНомер", Сред(ШК,12,8));
		РезультатОбработкиШК.Ошибка="";
		
		// закрытие заказа, офисный бланк заказа   // nadin
		
		///////////////////////////////////////////////////////
		// Штрих-код заказа из офисного бланка
		//
		// 3 006 xxxxxxxx   x xxxxxxx   x     общий случай
		// 3 006 00000000   0 7213309   4     пример
		// |  |   | | |         |       |
		// |  |   | | |         |       |__________ Контрольный символ
		// |  |   | | |         |__________________ Номер заказа
		// |  |   | | |____________________________ Номер бланка
		// |  |   | |______________________________ Номер версии
		// |  |   |________________________________ Номер проката
		// |  |____________________________________ Вид информации (код справочника, документа и пр. 006) 
		// |_______________________________________ Управляющий символ (3 )
		//
		///////////////////////////////////////////////////////
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 20 И УпрСимвол = 3 И ВидИнформации = 6 Тогда //ОБЗ для закрытия заказа в ОУ
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Заказа);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		//Начало изменений Иванова Анна 20180216
		//РезультатОбработкиШК.Вставить("НомерВерсии", Сред(ШК,12,1));
		РезультатОбработкиШК.Вставить("НомерВерсии", Сред(ШК,9,2));
		РезультатОбработкиШК.Вставить("НомерБланка", Сред(ШК,11,2));
		РезультатОбработкиШК.Вставить("НомерЗаказа", Сред(ШК,13,7));
		РезультатОбработкиШК.Вставить("НомерПроката",Сред(ШК,5,4));
		// --> Начало Лико Ефимов ЕВВ 14.11.2024 
		// Для номера проката было отведено 4 символа
		// Оставлю для номера проката символы 7-8, а 5-6 заберу для номера приложения
		РезультатОбработкиШК.Вставить("НомерПроката",Сред(ШК,7,2));
		РезультатОбработкиШК.Вставить("НомерПриложения",Сред(ШК,5,2));
		// <-- Конец Лико Ефимов ЕВВ 14.11.2024
		РезультатОбработкиШК.Ошибка="";
		
		// {{ DGavrilov
		// Карточка складского учета, расход/приход товароместа
		// Оставил только случай для расхода товароместа - 3007.....
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 20 И УпрСимвол = 3 И ВидИнформации = 7 Тогда //расход/приход товароместа
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.SQL_ПриходРасходТовароместа);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Вставить("УникальныйНомер", Сред(ШК,12,8));
		РезультатОбработкиШК.Ошибка="";
		
		// Карточка складского учета, расход/приход товароместа
		// Оставил только случай для расхода товароместа - 3007.....
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 20 И УпрСимвол = 3 И ВидИнформации = 4 Тогда //товароместо + UID
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.SQL_ТовароместоUID);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Вставить("Количество", 0);
		РезультатОбработкиШК.Вставить("УникальныйНомер", Сред(ШК,12,8));
		РезультатОбработкиШК.Ошибка="";
		// }} DGavrilov
		
		// Упаковочный лист
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 20 И УпрСимвол = 2 И ВидИнформации = 21 Тогда //Упаковочный лист  //??????????????
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_УпаковочныйЛист);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Вставить("УникальныйНомер", Сред(ШК,12,8));
		РезультатОбработкиШК.Ошибка="";
		
		// Заявка на склад
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 12 И УпрСимвол = 2 И ВидИнформации = 10 Тогда //Заявка на склад
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_ЗаявкаНаСклад);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Ошибка="";
		
		// {{ DGavrilov
		// EPSMA: Roll Variables - Информация о продукте
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 18 И УпрСимвол = 8 И ВидИнформации = 1 Тогда // информация о продукте
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.EPSMA_ИнформацияОПродукте);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 5, СтрДлина(ШК)-5));
		РезультатОбработкиШК.Ошибка="";
		
		ПроверятьКонтрСумму = Ложь;
		// }} DGavrilov
		
		// AS: Адрес места хранения - Ячеистый склад
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 18 И УпрСимвол = 8 Тогда //Адрес
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Адреса);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 2, СтрДлина(ШК)-2));
		РезультатОбработкиШК.Ошибка="";
		
		// AS: Адрес места хранения - Ячеистый склад (краткий)
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 10 И УпрСимвол = 8 Тогда //Адрес
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 2, СтрДлина(ШК)-2));
		РезультатОбработкиШК.Ошибка="";
		
		// AS: Паллет - Ячеистый склад
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 9 И УпрСимвол = 9 Тогда //паллет
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Паллета);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 2, СтрДлина(ШК)-2));
		РезультатОбработкиШК.Ошибка="";
		
		// AS: УправляющийШК - Ячеистый склад
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 8 И УпрСимвол = 7 Тогда //УправляющийШК
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Управляющий);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 2, СтрДлина(ШК)-2));
		РезультатОбработкиШК.Ошибка="";
		
		// {{ DGavrilov
		// EPSMA: Roll Number - Номер бобины
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 20 И УпрСимвол = 0 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.EPSMA_НомерБобины);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 4, СтрДлина(ШК)-4));
		РезультатОбработкиШК.Ошибка="";
		
		ПроверятьКонтрСумму = Ложь;
		
		// EPSMA EAN Product Code - Код продукта		
	ИначеЕсли ТипШК="EAN13" Тогда // пока только такое условие. никак не определить его больше
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.EPSMA_КодПродукта);
		РезультатОбработкиШК.Вставить("УпрСимвол", 0);
		РезультатОбработкиШК.Вставить("КодИнформации", ШК);
		РезультатОбработкиШК.Ошибка="";
		
		ПроверятьКонтрСумму = Ложь;
		
		// EPSMA Best Before Date - Употребить до
	ИначеЕсли РезультатОбработкиШК.ДлинаШК=8 И EPSMA_УпрСимвол=15 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.EPSMA_УпотребитьДо);
		РезультатОбработкиШК.Вставить("УпрСимвол", 15);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 3));
		РезультатОбработкиШК.Ошибка="";
		
		ПроверятьКонтрСумму = Ложь;
		
		///////////////////////////////////////////////////////
		// Штрих-код товароместа (в базе SQL) (12 символов)
		// 2 034 xxxxxxx x            общий случай
		// 2 034 0283318 4            пример
		// |  |     |    |
		// |  |     |    |___________ Контрольный символ
		// |  |     |________________ id упаковки товароместа
		// |  |______________________ Вид информации (код справочника). 34 - справочник товаромест
		// |_________________________ Управляющий символ (2 - справочники)
		///////////////////////////////////////////////////////
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 12 И УпрСимвол = 2 И ВидИнформации = 34 Тогда // Справочник товаромест
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.SQL_Товароместо);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК,5,7));
		РезультатОбработкиШК.Ошибка="";
		
		// ЯССМ - Объект номенклатуры
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 30 И УпрСимвол = 6 И (ВидИнформации_2символа = 1 Или  ВидИнформации_2символа = 2) Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 4, СтрДлина(ШК)-4));
		РезультатОбработкиШК.Вставить("Количество", Сред(ШК, 14, 4));
		РезультатОбработкиШК.Ошибка="";
		
		// Планирование - ЗаказСпецификация
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 24 И УпрСимвол = 6 И ВидИнформации_2символа = 3 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_ЗаказаСпецификации);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 4, СтрДлина(ШК)-4));
		РезультатОбработкиШК.Ошибка="";
		
		// Лико - конверт
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 15 И УпрСимвол = 6 И ВидИнформации_2символа = 4 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Конверта);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 4, СтрДлина(ШК)-4));
		РезультатОбработкиШК.Ошибка="";
		
		// ЯССМ - Объект номенклатуры Короткий
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 15 И УпрСимвол = 6 И ВидИнформации_2символа = 5 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 4, СтрДлина(ШК)-4));
		РезультатОбработкиШК.Вставить("Количество", Сред(ШК, 4, 4));
		РезультатОбработкиШК.Ошибка="";
		
		// Пусть всегда последний стоит. Т.к. здесь только по длине его можем идентифицировать от остальных ШК
		// EPSMA Roll ID - Номер бобины (короткий)
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 12  Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.EPSMA_Roll_ID);
		РезультатОбработкиШК.Вставить("УпрСимвол", 0);
		РезультатОбработкиШК.Вставить("ВидИнформации", 0);
		РезультатОбработкиШК.Вставить("КодИнформации", ШК);
		РезультатОбработкиШК.Ошибка="";
		
		ПроверятьКонтрСумму = Ложь;
		
	ИначеЕсли EPSMA_УпрСимвол=40 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.EPSMA_НомерЗаказаКлиента);
		РезультатОбработкиШК.Вставить("УпрСимвол", 0);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 3));
		РезультатОбработкиШК.Ошибка="";
		
		ПроверятьКонтрСумму = Ложь;
		
		
		//+m.shenderov 22.11.2016 	
		
		// СА - Входящие документы 
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 10 И УпрСимвол = 5  Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_ВходящихДокументов);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", Сред(ШК,2,2));
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 4, 6));
		РезультатОбработкиШК.Ошибка="";
		ПроверятьКонтрСумму = Истина;
		
		//-m.shenderov 22.11.2016
		
		
		
		// Планирование - ЗаказСпецификация
		// !!!!! ????? временно отключено
		//ИначеЕсли (РезультатОбработкиШК.ДлинаШК = 27 Или РезультатОбработкиШК.ДлинаШК = 28) И УпрСимвол = 9 И ВидИнформации = 1 Тогда
		//	РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.Amcor_ИнформацияОРолике);
		//	РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		//	РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации);
		//	РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 5)); // контрольного нет, берем до конца
		//	РезультатОбработкиШК.Ошибка="";
		//	
		//	ПроверятьКонтрСумму = Ложь;
		
		// }} DGavrilov
		
		
		// --> Начало Лико Ефимов ЕВВ 27.07.2020
	ИначеЕсли УпрСимвол = 3 И ВидИнформации_2символа = 11 И РезультатОбработкиШК.ДлинаШК = 16 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Растарки);
		РезультатОбработкиШК.Вставить("ПрефиксОрганизации", Сред(ШК, 4, 2));
		РезультатОбработкиШК.Вставить("Год", Число("20" + Сред(ШК, 6, 2)));
		РезультатОбработкиШК.Вставить("НомерДокумента", Сред(ШК, 8, 6));
		РезультатОбработкиШК.Вставить("НомерЦепочки", Сред(ШК, 14, 3));
		
		РезультатОбработкиШК.Ошибка="";
		Возврат РезультатОбработкиШК;
		// <-- Конец Лико Ефимов ЕВВ 27.07.2020
		
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 10 И УпрСимвол = 3 И ВидИнформации_2символа = 60 Тогда
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Тара);
		РезультатОбработкиШК.Вставить("УпрСимвол", УпрСимвол);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа);
		РезультатОбработкиШК.Вставить("КодИнформации", Сред(ШК, 4, 6));
		РезультатОбработкиШК.Ошибка="";
		//ПроверятьКонтрСумму = Истина;
		Возврат РезультатОбработкиШК;
	// <-- Начало Лико Яцун С. В. 26.05.2025	
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 14 И УпрСимвол = 3 И (ВидИнформации_2символа = 12 ИЛИ ВидИнформации_2символа = 13) Тогда	
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_КартаСнятияПерерасхода);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа); //12 -карта снятия, 13 - карта перерасхода
		РезультатОбработкиШК.Вставить("ВидДокумента", ?(ВидИнформации_2символа = 12,"Лико_КартаСнятия","Лико_КартаПерерасхода")); //12 -карта снятия, 13 - карта перерасхода
		РезультатОбработкиШК.Вставить("НомерДокумента", Сред(ШК, 6, 9));
		РезультатОбработкиШК.Вставить("Год", Число("20" + Сред(ШК, 4, 2)));
		РезультатОбработкиШК.Ошибка="";
		Возврат РезультатОбработкиШК;
		//+ ---> Лико m.shenderov 24.02.2026
						
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 14 И УпрСимвол = 8 И (ВидИнформации_2символа = 01) Тогда	
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_ТипоразмерПаллета);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа); 
		РезультатОбработкиШК.Вставить("ТипСпраочника", "Лико_ТипоразмерыПаллет"); 
		РезультатОбработкиШК.Вставить("Код", Сред(ШК,4,10));
		РезультатОбработкиШК.Ошибка="";
		Возврат РезультатОбработкиШК;
		
		
	ИначеЕсли РезультатОбработкиШК.ДлинаШК = 14 И УпрСимвол = 8 И (ВидИнформации_2символа = 02) Тогда	
		РезультатОбработкиШК.Вставить("ВидШК", Перечисления.ЯС_ВидыШК.ШК_Паллета2_0);
		РезультатОбработкиШК.Вставить("ВидИнформации", ВидИнформации_2символа); 
		РезультатОбработкиШК.Вставить("ТипСпраочника", "Лико_ТипоразмерыПаллет"); 
		РезультатОбработкиШК.Вставить("Код", Сред(ШК,4,10));
		РезультатОбработкиШК.Ошибка="";
		Возврат РезультатОбработкиШК;
		//- <--- Лико m.shenderov 24.02.2026	
	
		//- <--- Лико m.shenderov 24.02.2026	
		
	Иначе
		РезультатОбработкиШК.Ошибка = "Не смогли расшифровать ШК: "+ШК + Символы.ПС+"Длинна ШК="+РезультатОбработкиШК.ДлинаШК+", УпрСимвол="+УпрСимвол+", ВидИнформации="+ВидИнформации+", ВидИнформации_2символа="+ВидИнформации_2символа;
		//РезультатОбработкиШК.Ошибка = "Неизвестный тип ШК! " + ШК;
		Возврат РезультатОбработкиШК;
		
	КонецЕсли;
	
	// Проверка контрольной суммы (КС)
	КонтрСумма = "" + Прав(ШК,1);
	Если ПроверятьКонтрСумму Тогда
		Если КонтрСумма = Неопределено ИЛИ КонтрСумма = "" Тогда
			КонтрСумма = "-1";
		КонецЕсли;
		// ЯС_Общие.СообщитьДляКлиента("Контр сумма "+КонтрСумма);
		
		КСумма = 0;
		Для Инд = 1 по СтрДлина(ШК)-1 Цикл
			Попытка // в попытке, т.к. в штрих-коде могут быть закодированы буквы
				КСумма = КСумма + Число(Сред(ШК,Инд,1));
			Исключение
				
			КонецПопытки;
		КонецЦикла;
		
		Если Число(КонтрСумма) <> Число(Прав("" + КСумма,1)) Тогда
			РезультатОбработкиШК.Ошибка = "Ошибка контрольной суммы (КС), при обработке штрихкода " + ШК;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработкиШК;
КонецФункции

Функция ОбработкаШК_ЗаказСпецификация(ДанныеШК, ФормаКлиента, Результат)
	
	НомерБланка = Число(Сред(ДанныеШК.КодИнформации, 1, 2));
	НомерЗаказа = Сред(ДанныеШК.КодИнформации, 3, 7);
	НомерПередела = Число(Сред(ДанныеШК.КодИнформации, 10, 2));
	КодСпецификации = Сред(ДанныеШК.КодИнформации, 12, 9);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лико_ПараметрыЗаказа.Спецификация
	//|ИЗ
	//|	РегистрСведений.Лико_ДополнительныеПараметрыЗаказ КАК Лико_ДополнительныеПараметрыЗаказ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыЗаказа КАК Лико_ПараметрыЗаказа
	//|		ПО Лико_ДополнительныеПараметрыЗаказ.Заказ = Лико_ПараметрыЗаказа.ЗаказПокупателя
	//|			И (Лико_ПараметрыЗаказа.Спецификация.Код = &Код)
	//|ГДЕ
	//|	Лико_ДополнительныеПараметрыЗаказ.ЗаказЧисло = &НомерЗаказа
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Лико_ПараметрыЗаказа.Дата УБЫВ";
	//Запрос.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
	//Запрос.УстановитьПараметр("Код", КодСпецификации);
	//РезультатЗапроса = Запрос.Выполнить();
	//Если Не РезультатЗапроса.Пустой() Тогда 
	//	РезультатСпецификация = РезультатЗапроса.Выбрать();
	//	РезультатСпецификация.Следующий();
	//	Спецификация = РезультатСпецификация.Спецификация;;
	//Иначе Спецификация = Справочники.СпецификацииНоменклатуры.ПустаяСсылка();
	//КонецЕсли;
	
	// Таких регистров в системе еще нет (на 06.09.2017), поэтому спецификацию попробуем найти просто по коду
	Спецификация = Справочники.РесурсныеСпецификации.НайтиПоКоду(КодСпецификации);
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	КонецЕсли;
	Результат.Вставить("НомерБланка", НомерБланка);
	Результат.Вставить("НомерЗаказа", НомерЗаказа);
	Результат.Вставить("НомерПередела", НомерПередела);
	Результат.Вставить("КодСпецификации", КодСпецификации);
	Результат.Вставить("Спецификация", Спецификация);
	
	Возврат Результат;
	
КонецФункции //ОбработкаШК_ЗаказСпецификация

Функция ПосчитатьКонтрольнуюСуммуШК(ШКбезКС) Экспорт
	
	КС = 0;
	Для Ц = 1 по СтрДлина(ШКбезКС) Цикл
		Попытка
			КС = КС + Число(Сред(ШКбезКС, Ц, 1));
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	Возврат Прав(СокрЛП(КС),1);
	
КонецФункции

Функция ПосчитатьКонтрольнуюСуммуШКВСистемеGS1_13(ШКбезКС) Экспорт
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ШКбезКС) Тогда
		Возврат "";
	КонецЕсли;
	
	ШтрихкодСПраваНалево = "";
	ДлинаШтрихкода = СтрДлина(ШКбезКС);
	Для сч = 0 по ДлинаШтрихкода - 1 Цикл
		ШтрихкодСПраваНалево = ШтрихкодСПраваНалево + Сред(ШКбезКС, ДлинаШтрихкода - сч, 1);
	КонецЦикла;
	СуммаЧетных = 0;
	СуммаНеЧетных = 0;
	Для сч = 1 по ДлинаШтрихкода Цикл
		ТекЦифра = Число(Сред(ШтрихкодСПраваНалево, сч, 1));
		Если сч % 2 = 0 Тогда
			СуммаЧетных = СуммаЧетных + ТекЦифра;
		Иначе
			СуммаНеЧетных = СуммаНеЧетных + ТекЦифра;
		КонецЕсли;
	КонецЦикла;
	СуммаЧетныхИУтроенныхНечетных = СуммаЧетных + 3*СуммаНеЧетных;
	ПоследнийСимвол = Прав(Формат(СуммаЧетныхИУтроенныхНечетных, "ЧДЦ=0; ЧН=0; ЧГ=0"), 1);
	Если ПоследнийСимвол = "0" Тогда
		КС = "0";
	Иначе
		КС = Строка(10 - Число(ПоследнийСимвол));
	КонецЕсли;
	
	Возврат КС;
	
КонецФункции

Функция ВычислитьКонтрольнуюСумму(ШК) Экспорт
	
	Возврат ШК + ПосчитатьКонтрольнуюСуммуШК(ШК);
	
КонецФункции

Процедура ОбработкаШК_Паллет(ДанныеШК, ФормаКлиента, Результат, ГП = Ложь)
	
	Паллет = Справочники.Лико_Паллеты.НайтиПоКоду(ДанныеШК.КодИнформации);
	Если Паллет = Неопределено Тогда
		Результат.Ошибка = "Не найден Паллет с кодом " + ДанныеШК.КодИнформации;
		Возврат;
	КонецЕсли;
	
	Результат.Вставить("Паллет", Паллет);
	//
	////если есть на форме нужный реквизит или обработчик добавления, то 
	//Если ФормаКлиента <> Неопределено Тогда
	//	Если ФормаКлиента.ЭлементыФормы.Найти("Паллет") <> Неопределено Тогда
	//		ФормаКлиента.Паллет = Результат.Паллет;
	//	КонецЕсли;
	//	Если Не ГП Тогда 
	//		Попытка
	//			ФормаКлиента.ДобавитьПаллет(Паллет.Код);
	//		Исключение
	//		КонецПопытки;
	//	Иначе
	//		ФормаКлиента.ТекущийПаллет = Паллет;
	//		Попытка
	//			ФормаКлиента.ДобавитьПаллет(Паллет);
	//		Исключение
	//		КонецПопытки;	
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаШК_Растарки(ДанныеШК, Результат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОрганизацииДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Организация
	|ИЗ
	|	Справочник.Организации.ДополнительныеРеквизиты КАК ОрганизацииДополнительныеРеквизиты
	|ГДЕ
	|	ОрганизацииДополнительныеРеквизиты.Свойство.Имя = ""ПрефиксЛатиницей_36a09ad955f14888a74852070619571d""
	|	И (ВЫРАЗИТЬ(ОрганизацииДополнительныеРеквизиты.Значение КАК СТРОКА(2))) = &Префикс
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Организация.Ссылка КАК Организация,
	|	МАКСИМУМ(ВТ_Организация.Ссылка.Префикс + ""00-"" + &НомерДокумента) КАК ПеремещениеПаллетаНомер,
	|	Лико_ПеремещениеПаллета.Ссылка КАК ПеремещениеПаллета
	|ПОМЕСТИТЬ ВТ_ОрганизацияСПеремещением
	|ИЗ
	|	ВТ_Организация КАК ВТ_Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПеремещениеПаллета КАК Лико_ПеремещениеПаллета
	|		ПО (ВТ_Организация.Ссылка.Префикс + ""00-"" + &НомерДокумента = Лико_ПеремещениеПаллета.Номер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Организация.Ссылка,
	|	Лико_ПеремещениеПаллета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОрганизацияСПеремещением.Организация КАК Организация,
	|	ВТ_ОрганизацияСПеремещением.ПеремещениеПаллета КАК ПеремещениеПаллета,
	|	ВТ_ОрганизацияСПеремещением.ПеремещениеПаллетаНомер КАК ПеремещениеПаллетаНомер,
	|	МАКСИМУМ(Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика.Лико_ЗаказНоменклатуры) КАК РастариваемыйЗаказ
	|ИЗ
	|	ВТ_ОрганизацияСПеремещением КАК ВТ_ОрганизацияСПеремещением
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПеремещениеПаллета.ЗаказыНаРастарку КАК Лико_ПеремещениеПаллетаЗаказыНаРастарку
	|		ПО (Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерЦепочки = &НомерЦепочки)
	|			И (Лико_ПеремещениеПаллетаЗаказыНаРастарку.ЭтоИсходнаяСтрока)
	|			И ВТ_ОрганизацияСПеремещением.ПеремещениеПаллета = Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОрганизацияСПеремещением.Организация,
	|	ВТ_ОрганизацияСПеремещением.ПеремещениеПаллета,
	|	ВТ_ОрганизацияСПеремещением.ПеремещениеПаллетаНомер";
	
	Запрос.УстановитьПараметр("Префикс", ДанныеШК.ПрефиксОрганизации);
	Запрос.УстановитьПараметр("НомерДокумента", ДанныеШК.НомерДокумента);
	Запрос.УстановитьПараметр("НомерЦепочки", Число(ДанныеШК.НомерЦепочки));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.РастариваемыйЗаказ) Тогда
			Результат.Вставить("РастариваемыйЗаказ", Выборка.РастариваемыйЗаказ);
		Иначе
			Если ЗначениеЗаполнено(Выборка.ПеремещениеПаллета) Тогда
				Результат.Ошибка = "В документе передачи на растарку " + Выборка.ПеремещениеПаллетаНомер + " не найден номер цепочки " + Запрос.Параметры.НомерЦепочки;
			Иначе
				Результат.Ошибка = "Не найден документ передачи на растарку с номером " + Выборка.ПеремещениеПаллетаНомер;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		Результат.Вставить("Документ", Выборка.ПеремещениеПаллета);
	Иначе
		Результат.Ошибка = "Не найдена организация с префиксом """ + ДанныеШК.ПрефиксОрганизации + """";
		Возврат;
	КонецЕсли;
	
	//// Найдем документ по номеру
	//НомерДокумента = Организация.Префикс + "00-" + ДанныеШК.НомерДокумента;
	//Документ = Документы.Лико_ПеремещениеПаллета.НайтиПоНомеру(НомерДокумента);
	//Если НЕ ЗначениеЗаполнено(Документ) Тогда
	//	Результат.Ошибка = "Не найден документ ""лк Перемещение паллета"" с номером """ + НомерДокумента + """";
	//КонецЕсли;
	//
	//Результат.Вставить("Документ", Документ);
	
КонецПроцедуры

Процедура ОбработкаШК_КартаСнятияПерерасхода(ДанныеШК, Результат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Карта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ДанныеШК.ВидДокумента + " КАК Лико_Карта
	|ГДЕ
	|	НЕ Лико_Карта.ПометкаУдаления
	|	И Лико_Карта.Номер = &Номер
	|	И ГОД(Лико_Карта.Дата) = &Год";
	
	Запрос.УстановитьПараметр("Номер", ДанныеШК.НомерДокумента);
	Запрос.УстановитьПараметр("Год", ДанныеШК.Год);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.Вставить("Документ", Выборка.Ссылка);
	Иначе
		Результат.Ошибка = "Не найден документ " + ДанныеШК.ВидДокумента + " № " + ДанныеШК.НомерДокумента + " от " + ДанныеШК.Год + " г.";
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаШК_Сотрудник(ДанныеШК, ФормаКлиента, Результат)
	
	ФизЛицо = ОпределитьРаботникаПоТабНомеру(ДанныеШК.КодИнформации, ТекущаяДата());
	Если ФизЛицо = Неопределено Тогда
		Результат.Ошибка = "Не найден сотрудник с табельным номером " + ДанныеШК.КодИнформации + " (возможно в справочнике Сотрудники у работника при приеме не проставлен табельный номер).";
		Возврат;
	КонецЕсли;
	
	Результат.Вставить("Сотрудник", ФизЛицо);
	
	Если ФормаКлиента <> Неопределено Тогда
		Если ФормаКлиента.ЭлементыФормы.Найти("АвторДокумента") <> Неопределено Тогда
			ФормаКлиента.АвторДокумента = ФизЛицо;
		КонецЕсли;
		Попытка
			ФормаКлиента.ПриИзмененииОператора(Результат);
		Исключение
		КонецПопытки;
		ЗаполнитьЭлементыФормыИзСтруктуры(ФормаКлиента, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаШК_РабочийЦентр(ДанныеШК, ФормаКлиента, Результат)
	
	ДлинаКодаРабочегоЦентра = Метаданные.Справочники.РабочиеЦентры.ДлинаКода;
	РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("Лико_Код",Число(ДанныеШК.КодИнформации));
	
	Результат.Вставить("РабочийЦентр", РабочийЦентр);
	
	Если ФормаКлиента <> Неопределено Тогда
		ЗаполнитьЭлементыФормыИзСтруктуры(ФормаКлиента, Результат);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьРаботникаПоТабНомеру(ТабНомер, НаДату = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизЛицо,
	|	МАКСИМУМ(Сотрудники.Код) КАК ТабельныйНомер
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Код = &ТабельныйНомер
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Сотрудники.ВАрхиве
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.ФизическоеЛицо";
	Запрос.УстановитьПараметр("ТабельныйНомер", Формат(число(ТабНомер),"ЧЦ=10; ЧРД=.; ЧВН=; ЧГ=0"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	МассивФиз = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ЕСли Выборка.Физлицо <> Справочники.ФизическиеЛица.ПустаяСсылка() тогда
			МассивФиз.Добавить(Выборка.Физлицо);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивФиз.Количество() = 1 Тогда
		Возврат МассивФиз.Получить(0);
		
	ИначеЕсли МассивФиз.Количество() = 0 Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не найден сотрудник с табельным номером "+ТабНомер+".", СтатусСообщения.Важное);
		
	Иначе
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Найдено "+МассивФиз.Количество()+" сотрудников с табельным номером "+ТабНомер+" нет возможности определить нужного.", СтатусСообщения.Важное);
		Для каждого элМассива Из МассивФиз Цикл
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(""+элМассива+" ("+СокрЛП(элМассива.Код)+")", СтатусСообщения.Важное);
		КонецЦикла;
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Неопределено;
КонецФункции

Функция ОпределитьСотрудникаПоТабНомеру(ТабНомер, Организация = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ПараметрыСеанса.ТекущийПользователь, "Организация_e4c9d825676549a1a5c19972efa7da0b", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Для вашего пользователя не указана организация по умолчанию. Обратитесь к программистам");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = новый запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	МАКСИМУМ(Сотрудники.Код) КАК ТабельныйНомер
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Код = &ТабельныйНомер
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Сотрудники.ВАрхиве
	|	И Сотрудники.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Ссылка";
	
	Запрос.УстановитьПараметр("ТабельныйНомер", Формат(число(ТабНомер),"ЧЦ=10; ЧРД=.; ЧВН=; ЧГ=0"));
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСотрудников = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ЕСли ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
			МассивСотрудников.Добавить(Выборка.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСотрудников.Количество() = 1 Тогда
		Возврат МассивСотрудников.Получить(0);
		
	ИначеЕсли МассивСотрудников.Количество() = 0 Тогда
		Сообщить("В организации """ + Организация + """ не найден сотрудник с табельным номером " + ТабНомер);
	Иначе
		Сообщить("Найдено "+МассивСотрудников.Количество()+" сотрудников с табельным номером "+ТабНомер+", нет возможности определить нужного");
		Для каждого элМассива Из МассивСотрудников Цикл
			Сообщить(""+элМассива+" ("+СокрЛП(элМассива.Код)+")");
		КонецЦикла;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Неопределено;
КонецФункции

Функция ПолучитьСотрудникаПоФизЛицу(ФизЛицо, Организация = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ФизЛицо) ИЛИ ТипЗнч(ФизЛицо) <> Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Сотрудники.ВАрхиве
	|	И Сотрудники.ФизическоеЛицо = &ФизЛицо
	|	И ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Сотрудники.ГоловнаяОрганизация = &Организация
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Возврат Выборка.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(Организация) Тогда
		// Попробуем без организации
		Возврат ПолучитьСотрудникаПоФизЛицу(ФизЛицо, Неопределено);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьЭлементыФормыИзСтруктуры(ФормаКлиента, Структура) Экспорт
	Для Каждого КаждыйИзСтруктура Из Структура Цикл
		ИмяКлюча = КаждыйИзСтруктура.Ключ;
		
		Попытка
			Если ФормаКлиента.ЭлементыФормы.Найти(ИмяКлюча)<>Неопределено Тогда // ищем в шапке
				ФормаКлиента.ЭлементыФормы[ИмяКлюча].Значение = КаждыйИзСтруктура.Значение;
				
				ОбработчикЭлементаПриИзменении = ФормаКлиента.ЭлементыФормы[ИмяКлюча].ПолучитьДействие("ПриИзменении");
				Если ОбработчикЭлементаПриИзменении<>Неопределено Тогда
					Выполнить("ФормаКлиента."+ОбработчикЭлементаПриИзменении+"();");
				КонецЕсли;
				
				//Иначе // ищем в табличных частях, и если находим - заполняем все найденные табличные части
				//	Для Каждого ТабличнаяЧасть Из ФормаКлиента.Метаданные().ТабличныеЧасти Цикл
				//		Если ФормаКлиента.ЭлементыФормы[ТабличнаяЧасть.Имя].Колонки.Найти(ИмяКлюча)<>Неопределено Тогда
				//			Выполнить("ФормаКлиента."+ТабличнаяЧасть.Имя+ИмяКлюча+"Добавление(КаждыйИзСтруктура.Значение);");
				//		КонецЕсли;
				//	КонецЦикла; 
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//----- новая методика
		Попытка
			Выполнить("ФормаКлиента."+ИмяКлюча+"_ОбработанШК(КаждыйИзСтруктура.Значение);");
		Исключение
			//Сообщить("Произошла ошибка: "+ОписаниеОшибки());
			//Предупреждение("Произошла ошибка: "+ОписаниеОшибки(),0,"ВНИМАНИЕ!");
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьЭлементыФормыИзСтруктуры Экспорт

Функция НайтиВсеСерииПоШтрихкоду(Штрихкод) Экспорт // --> Начало Лико Ефимов ЕВВ 26.04.2017
	
	МассивСерий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Лико_Серия
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСерий.Добавить(ВыборкаДетальныеЗаписи.Лико_Серия);
	КонецЦикла;
	Возврат МассивСерий;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 26.04.2017

Функция НайтиСерииПоШтрихкоду(Штрихкод) Экспорт // --> Начало Лико Ефимов ЕВВ 27.04.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Лико_Серия КАК Серия,
	|	ШтрихкодыНоменклатуры.Лико_Серия.Лико_ВладелецКомплекта КАК ВладелецКомплекта
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Серия = Выборка.Серия;
		Если ЗначениеЗаполнено(Выборка.ВладелецКомплекта) Тогда
			// Нужно найти остальные серии
			МассивСерий = НайтиСерииПоВладельцуКомплекта(Выборка.ВладелецКомплекта);
		Иначе
			МассивСерий = Новый Массив;
			МассивСерий.Добавить(Серия);
		КонецЕсли;
		Возврат МассивСерий;			
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.04.2017

Функция НайтиСерииПоВладельцуКомплекта(ВладелецКомплекта) Экспорт // --> Начало Лико Ефимов ЕВВ 13.09.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Серия
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Лико_ВладелецКомплекта = &Лико_ВладелецКомплекта
	|	И НЕ СерииНоменклатуры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Лико_ВладелецКомплекта", ВладелецКомплекта);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Серия");
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 13.09.2017

Функция ПолучитьНомерКоробкиДляНовойСерии(МассивХарактеристик) Экспорт
	
	Если ТипЗнч(МассивХарактеристик) = Тип("Массив") Тогда
		МассивХарактеристикПриведенный = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивХарактеристик);		
	Иначе
		МассивХарактеристикПриведенный = Новый Массив;
		МассивХарактеристикПриведенный.Добавить(МассивХарактеристик);
	КонецЕсли;
	
	//получим последний номер коробки по данным характеристик
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерииНоменклатуры.Ссылка,
		|	СерииНоменклатуры.Лико_НомерКоробки КАК НомерКоробки
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец В (&Характеристики)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерииНоменклатуры.Лико_НомерКоробки УБЫВ";
	
	Запрос.УстановитьПараметр("Характеристики", МассивХарактеристикПриведенный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.НомерКоробки) Тогда
		НомерКоробки = Выборка.НомерКоробки + 1;
	Иначе
		НомерКоробки = 1;
	КонецЕсли;
	
	Возврат НомерКоробки;
	
КонецФункции

Функция ПолучитьШтрихКодЯчейки(Ячейка) Экспорт
	Перем ШК;
	
	Если СокрЛП(Ячейка.Лико_КодУПП) = "" Тогда
		Сообщить("У ячейки """ + Ячейка + """ не заполнен Лико_КодУПП");
		Возврат "";
	КонецЕсли;
	
	ШК = "8" + СобратьПолныйКодЯчейки(,Ячейка); //8-код штрих-кода Адреса хранения
	ШК = ШК + Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	
	Возврат ШК;
КонецФункции

Функция ПолучитьКраткийШтрихКодЯчейки(Ячейка) Экспорт
	Перем ШК;
	
	ОграничениеУровня = 4;
	
	ШК = "8" + СобратьПолныйКодЯчейки(ОграничениеУровня, Ячейка);
	ШК = ШК + Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	
	Возврат ШК;
КонецФункции

Функция СобратьПолныйКодЯчейки(ДоУровня=0, Ячейка) Экспорт
	Перем ПолныйКод;
	
	ПолныйКод = ""+Формат(Число(Ячейка.Лико_КодУПП), "ЧЦ=2; ЧВН=");
	
	времРодитель = Ячейка.Родитель;
	Для У=1 По Ячейка.Уровень() Цикл
		Если ДоУровня=0 Или У<=ДоУровня Тогда
			ПолныйКод = Формат(Число(времРодитель.Лико_КодУПП), "ЧЦ=2; ЧВН=") + ПолныйКод;
			времРодитель = времРодитель.Родитель;
		КонецЕсли;
	КонецЦикла;
	
	Если ДоУровня=0 Тогда
		ДлинаПолногоКода = 16;
	Иначе
		ДлинаПолногоКода = 2 * ДоУровня;
	КонецЕсли;
	
	НадоДобавитьНулей = ДлинаПолногоКода - СтрДлина(ПолныйКод);
	Для Ц=1 По НадоДобавитьНулей Цикл
		ПолныйКод = ПолныйКод + "0";
	КонецЦикла;
	
	Возврат ПолныйКод;
КонецФункции

Процедура ОбработкаШК_АдресХранения(ДанныеШК, ФормаКлиента, Результат)
	
	ПолныйКод = ПолучитьПолныйКодИзШКАдреса(ДанныеШК.КодИнформации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА СкладскиеЯчейки.Родитель.Родитель.Родитель.Родитель.Родитель <> &ПустаяЯчейка
	|			ТОГДА СкладскиеЯчейки.Родитель.Родитель.Родитель.Родитель.Родитель.Лико_КодУПП
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СкладскиеЯчейки.Родитель.Родитель.Родитель.Родитель <> &ПустаяЯчейка
	|			ТОГДА СкладскиеЯчейки.Родитель.Родитель.Родитель.Родитель.Лико_КодУПП
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СкладскиеЯчейки.Родитель.Родитель.Родитель <> &ПустаяЯчейка
	|			ТОГДА СкладскиеЯчейки.Родитель.Родитель.Родитель.Лико_КодУПП
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СкладскиеЯчейки.Родитель.Родитель <> &ПустаяЯчейка
	|			ТОГДА СкладскиеЯчейки.Родитель.Родитель.Лико_КодУПП
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СкладскиеЯчейки.Родитель <> &ПустаяЯчейка
	|			ТОГДА СкладскиеЯчейки.Родитель.Лико_КодУПП
	|		ИНАЧЕ """"
	|	КОНЕЦ + СкладскиеЯчейки.Лико_КодУПП КАК ПолныйКод
	|ПОМЕСТИТЬ ВТ_ЯчейкиСПолнымКодом
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	НЕ СкладскиеЯчейки.ЭтоГруппа
	|	И НЕ СкладскиеЯчейки.Лико_КодУПП = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЯчейкиСПолнымКодом.Ячейка
	|ИЗ
	|	ВТ_ЯчейкиСПолнымКодом КАК ВТ_ЯчейкиСПолнымКодом
	|ГДЕ
	|	ВТ_ЯчейкиСПолнымКодом.ПолныйКод = &ПолныйКод";
	
	Запрос.УстановитьПараметр("ПустаяЯчейка", Справочники.СкладскиеЯчейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПолныйКод", ПолныйКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		АдресаХранения = Выборка.Ячейка;
	Иначе
		АдресаХранения = Неопределено;
	КонецЕсли;
	
	Если АдресаХранения = Неопределено ИЛИ АдресаХранения = Справочники.СкладскиеЯчейки.ПустаяСсылка() Тогда
		Результат.Ошибка = "Не найден Адрес хранения с кодом " + ДанныеШК.КодИнформации;
		Возврат;
	КонецЕсли;
	
	Результат.Вставить("АдресаХранения", АдресаХранения);
	
	//если есть на форме нужный реквизит или обработчик добавления, то 
	Если ФормаКлиента <> Неопределено Тогда
		Если ФормаКлиента.Элементы.Найти("АдресХранения") <> Неопределено Тогда
			ФормаКлиента.АдресХранения = Результат.АдресаХранения;
		КонецЕсли;		
		Попытка
			ФормаКлиента.ВыбратьАдрес(АдресаХранения);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПолныйКодИзШКАдреса(ШтрихКод)
	Перем ШК, Код, ПолныйКод;
	
	ПолныйКод = "";
	ШК = СокрЛП(ШтрихКод);
	Для Ц = 1 По СтрДлина(ШК) Цикл
		Код = Сред(ШК, Ц, 2);
		Если Число(Код) = 0 Тогда
			Прервать;
		Иначе 
			ПолныйКод = ПолныйКод + Код;
		КонецЕсли;
		Ц = Ц + 1;
	КонецЦикла;
	
	Возврат ПолныйКод;
КонецФункции // ПолучитьПолныйКодИзШК()

// Выполняет действие, необходимые при считывании КОРОТКОГО штрихкода ЯССМ Объекта номенклатуры
Процедура ОбработкаШК_ЯССМ_ОбъектНоменклатурыКороткий(ДанныеШК, ФормаКлиента, Результат)
	
	Количество = Число(Сред(ДанныеШК.КодИнформации, 1, 4));
	КодОбъекта = Число(Сред(ДанныеШК.КодИнформации, 5, 7));
	
	ОбъектНоменклатуры = Справочники.ЯССМ_ОбъектыНоменклатуры.НайтиПоКоду(КодОбъекта);
	Результат.Вставить("ОбъектНоменклатуры", ОбъектНоменклатуры);
	
	ОбъектНоменклатурыКоличество = Новый Структура("ОбъектНоменклатуры,Количество", ОбъектНоменклатуры, Количество);
	Результат.Вставить("ОбъектНоменклатурыКоличество", ОбъектНоменклатурыКоличество);
	
	ЗаполнитьЭлементыФормыИзСтруктуры(ФормаКлиента, Результат);
	
КонецПроцедуры //ОбработкаШК_ЯССМ_ОбъектНоменклатурыКороткий

Процедура ОбработкаШК_ЯССМ_ОбъектНоменклатуры(ДанныеШК, ФормаКлиента, Результат) //+Лико m.shenderov 05.01.2018
	
	//КодНоменклатурыБезПрефикса = Число(Сред(ДанныеШК.КодИнформации, 1, 7));
	//РазмерНарезки = Число(Сред(ДанныеШК.КодИнформации, 8, 3));
	Количество = Число(Сред(ДанныеШК.КодИнформации, 11, 4));
	КодОбъекта = Число(Сред(ДанныеШК.КодИнформации, 15, 7));
	//СерийныйНомер = Число(Сред(ДанныеШК.КодИнформации, 22, 5));
	
	//		ОбъектНоменклатуры = Справочники.ЯССМ_ОбъектыНоменклатуры.НайтиПоКоду(КодОбъекта);
	//		ДанныеШК.Вставить("ОбъектНоменклатуры", ОбъектНоменклатуры);
	
	//ЗаполнитьЭлементыФормыИзСтруктуры(ФормаКлиента, Результат);
	
	
	ОбъектНоменклатуры = Справочники.ЯССМ_ОбъектыНоменклатуры.НайтиПоКоду(КодОбъекта);
	Результат.Вставить("ОбъектНоменклатуры", ОбъектНоменклатуры);
	
	ОбъектНоменклатурыКоличество = Новый Структура("ОбъектНоменклатуры,Количество", ОбъектНоменклатуры, Количество);
	Результат.Вставить("ОбъектНоменклатурыКоличество", ОбъектНоменклатурыКоличество);
	
	ЗаполнитьЭлементыФормыИзСтруктуры(ФормаКлиента, Результат);
	
	
	
КонецПроцедуры //-Лико m.shenderov 05.01.2018

Процедура ОбработкаШК_ЯССМ_ЗаявкаНаСклад(ДанныеШК, ФормаКлиента, Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Лико_ШтрихкодыДокументов.Док КАК Док,
	|	Лико_ШтрихкодыДокументов.Док.Статус КАК ДокСтатус
	|ИЗ
	|	РегистрСведений.Лико_ШтрихкодыДокументов КАК Лико_ШтрихкодыДокументов
	|ГДЕ
	|	Лико_ШтрихкодыДокументов.ШтрихКод = &ШтрихКод
	|	И Лико_ШтрихкодыДокументов.Док ССЫЛКА Документ.Лико_ЗаявкаНаТранспортировку
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫРАЗИТЬ(Лико_ШтрихкодыДокументов.Док КАК Документ.Лико_ЗаявкаНаТранспортировку).Дата УБЫВ";
	Запрос.УстановитьПараметр("ШтрихКод",ДанныеШК.ШК);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("ЗаявкаНаТранспортировку", Выборка.Док);
		Результат.Вставить("СтатусЗаявкиНаТранспортировку", Выборка.ДокСтатус);
	Иначе
		Результат.Ошибка = "Не найден документ ЗаявкаНаТранспортировку по введенному штрихкоду.";
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаШК_Конверт(ДанныеШК, ФормаКлиента, Результат)
	
	Результат.Вставить("Конверт", Справочники.Лико_Конверты.НайтиПоКоду(Результат.КодИнформации));
КонецПроцедуры

Процедура ОбработкаШК_ВходящихДокументов(ДанныеШК, ФормаКлиента, Результат)
	
	
	Результат.Вставить("ШтрихКод", ДанныеШК.ШК);  	
	ЗаполнитьЭлементыФормыИзСтруктуры(ФормаКлиента, Результат);
	
	
КонецПроцедуры


Процедура ОбработкаШК_Тара(ДанныеШК,Результат)
	
	Результат.Вставить("Тара", Справочники.Лико_Тара.НайтиПоКоду(Число(Результат.КодИнформации)));
КонецПроцедуры

//+ ---> Лико m.shenderov 24.02.2026
Процедура ОбработкаШК_ТипоразмерПаллета(ДанныеШК, Результат)
	Результат.Вставить("ТипоразмерПаллета", Справочники.Лико_ТипоразмерыПаллет.НайтиПоКоду(ДанныеШК.Код));
	
	Возврат ;	
КонецПроцедуры

//- <--- Лико m.shenderov 24.02.2026
 //+ ---> Лико m.shenderov 24.02.2026
Процедура ОбработкаШК_Паллет2_0(ДанныеШК, Результат)
	Результат.Вставить("Паллет", Справочники.Лико_Паллеты2_0.НайтиПоКоду(ДанныеШК.Код));
	
	Возврат ;	
КонецПроцедуры

//- <--- Лико m.shenderov 24.02.2026


#КонецОбласти


#Область ВспомогательныеФункцииДляСозданияТиповыхДокументов

// Записывает типовые документы в регистр сведений Лико_СвязиСТиповымиДокументами. 
//
// Параметры:
//  ТаблицаНовыхДокументов - ТаблицаЗначений - Таблица с колонками "Заказ" и "Документ". Заказ может принимать значение Неопределено, а документ всегда должен быть заполнен
//  Ссылка - ДокументСсылка - Ссылка на НЕтиповой документ, к которому привязываются типовые документы
//
//  Возвращаемое значение:
//      Булево - результат выполнения записи.
//
Функция ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка, ЗаказКлиента = Неопределено) Экспорт
	
	// регистр ЛикоСвязиСТиповымиДокументами
	НаборЗаписи = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Документ.Установить(Ссылка);
	Если ЗаказКлиента = Неопределено Тогда
		НомерСтроки = 1;
	Иначе
		НаборЗаписи.Отбор.Заказ.Установить(ЗаказКлиента);
		НомерСтроки = НайтиМаксимальныйНомерВЦепочкеВРегистреСвязиСТиповымиДокументами(Ссылка) + 1;
	КонецЕсли;
	Для Каждого Строка Из ТаблицаНовыхДокументов Цикл
		Если Строка.Документ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НаборЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Документ = Ссылка;
		НоваяСтрока.ТиповойДокумент = Строка.Документ;
		// Для корректировок умножим НомерВЦепочке на 10, посколько вместо них скорее всего создадутся несколько других документов  (благодаря умножению для них останется "место")
		НоваяСтрока.НомерВЦепочке = НомерСтроки * ?(ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.КорректировкаРегистров"), 10, 1); 
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	Попытка
		НаборЗаписи.Записать(Истина);
	Исключение
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось записать данные в регистр сведений ЛикоСвязиСТиповымиДокументами! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция НайтиМаксимальныйНомерВЦепочкеВРегистреСвязиСТиповымиДокументами(НеТиповойДокумент) Экспорт // --> Начало Лико Ефимов ЕВВ 28.05.2018 
	
	// Найдем максимальный номер строки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.НомерВЦепочке КАК НомерВЦепочке
	|ИЗ
	|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Т
	|ГДЕ
	|	Т.Документ = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВЦепочке УБЫВ";
	Запрос.УстановитьПараметр("Документ", НеТиповойДокумент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерВЦепочке = Выборка.НомерВЦепочке;
	Иначе
		НомерВЦепочке = 0;
	КонецЕсли;
	Возврат НомерВЦепочке;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 28.05.2018 

// Находит в регистре сведений Лико_СвязиСТиповымиДокументами уже сформированные документы. 
//
// Параметры:
//  УдалятьВсеДокументы - Булево - Признак того, нужно ли распроводить и помечать на удаление найденные документы
//  Заказ - ДокументСсылка.ЗаказКлиента - Ссылка на документ ЗаказКлиента, для которого осуществляется поиск типовых документов (принадлежащих НЕтиповому документу Ссылка)
//  КлючиСтруктуры - Строка - Строка с названиями типовых документов, разделенных запятой, типы которых могут принимать типовые документы (подбробнее написано в самой функции)
//  Ссылка - ДокументСсылка - Ссылка на НЕтиповой документ, для которого осуществляется поиск типовых документов
//  ОтменятьПроведение - Булево - Признак того, нужно ли распроводить найденные документы
//
//  Возвращаемое значение:
//      Структура, Неопределено - Структура с типовыми документами, где ключом является тип документа из строки КлючиСтруктуры, а значением ссылка на типовой документ.
//					Если не удается распровести или пометить на удаление документы, то возвращается Неопределено.
//
Функция НайтиУжеСформированныеТиповыеДокументы(УдалятьВсеДокументы = Ложь, Отборы = Неопределено, КлючиСтруктуры, Ссылка, ОтменятьПроведение = Истина, ДополнительноеСвойство = Неопределено) Экспорт
	
	//Строка КлючиСтруктуры должна содержать через запятую названия всех типовых документов, которые должен создавать ЛикоФормированиеПаллета
	//причем в порядке их распроведения (т.е. сначала распроводиться последний документ в цепочке, чтобы отработала проверка доступности товаров на складах)
	//исходя из этой строки формируется СтруктураДокументов, а также МассивДопустимыхТипов для проверки принадлежности связанного документа
	//(если документ не пройдет проверку принадлежности, система проигнорирует его, и при записи регистра типовых документов он уже туда не попадет)
	МассивДопустимыхТипов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиСтруктуры, ",",Истина,Истина);
	СтруктураДокументов = Новый Структура;
	Для каждого Тип из МассивДопустимыхТипов Цикл
		СтруктураДокументов.Вставить(Тип, Неопределено);
	КонецЦикла;
	Заказ = Неопределено;
	Контрагент = Неопределено;
	Валюта = Неопределено;
	Регион = Неопределено;
	Номенклатура = Неопределено;
	Склад = Неопределено;
	РаспоряжениеНаРастарку = Неопределено;
	НомерЦепочкиВРаспоряженииНаРастарку = Неопределено;
	Если Отборы <> Неопределено Тогда
		Отборы.Свойство("Заказ", Заказ);
		Отборы.Свойство("Контрагент", Контрагент);
		Отборы.Свойство("Валюта", Валюта);
		Отборы.Свойство("Регион", Регион);
		Отборы.Свойство("Номенклатура", Номенклатура);
		Отборы.Свойство("Склад", Склад);
		Отборы.Свойство("РаспоряжениеНаРастарку", РаспоряжениеНаРастарку);
		Отборы.Свойство("НомерЦепочкиВРаспоряженииНаРастарку", НомерЦепочкиВРаспоряженииНаРастарку);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СвязиСТиповымиДокументами.ТиповойДокумент
	|ИЗ
	|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
	|ГДЕ
	|	Лико_СвязиСТиповымиДокументами.Документ = &Документ
	|	И ВЫБОР
	|			КОГДА &Заказ = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.Заказ = &Заказ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Контрагент = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.Контрагент = &Контрагент
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.Валюта = &Валюта
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Регион = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.Регион = &Регион
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Номенклатура = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.Номенклатура = &Номенклатура
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Склад = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.Склад = &Склад
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &РаспоряжениеНаРастарку = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.РаспоряжениеНаРастарку = &РаспоряжениеНаРастарку
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НомерЦепочкиВРаспоряженииНаРастарку = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СвязиСТиповымиДокументами.НомерЦепочкиВРаспоряженииНаРастарку = &НомерЦепочкиВРаспоряженииНаРастарку
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_СвязиСТиповымиДокументами.НомерВЦепочке УБЫВ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("РаспоряжениеНаРастарку", РаспоряжениеНаРастарку);
	Запрос.УстановитьПараметр("НомерЦепочкиВРаспоряженииНаРастарку", НомерЦепочкиВРаспоряженииНаРастарку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивДляУдаления = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если УдалятьВсеДокументы Тогда
		// Отдельным циклом заполним массив для удаления, чтобы сохранить порядок колонки НомерВЦепочке
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ТиповойДокумент) Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьДокументВМассивУдаленияВСоответсвтииСДопустимымиТипами(Выборка.ТиповойДокумент, МассивДляУдаления, МассивДопустимыхТипов);
			ДобавитьДокументВСтруктуру(СтруктураДокументов, Выборка.ТиповойДокумент, МассивДляУдаления, МассивДопустимыхТипов);
		КонецЦикла;
	Иначе
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ТиповойДокумент) Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьДокументВСтруктуру(СтруктураДокументов, Выборка.ТиповойДокумент, МассивДляУдаления, МассивДопустимыхТипов);
		КонецЦикла;
		
		Если ОтменятьПроведение Тогда
			//распроведем найденные типовые документы
			Результат = РаспровестиДокументыСтруктуры(СтруктураДокументов, ДополнительноеСвойство);
			Если НЕ Результат Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат = ПометитьНаУдалениеДокументыМассива(МассивДляУдаления, ДополнительноеСвойство);
	Если НЕ Результат Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтруктураДокументов;
	
КонецФункции

// Распроводит все документы структуры. 
//
// Параметры:
//  Структура - Структура - Структура, в значениях которой хранятся ссылки на документы, которые необходимо распровести
//
//  Возвращаемое значение:
//      Булево - Результат распроведения.
//
Функция РаспровестиДокументыСтруктуры(Структура, ДополнительноеСвойство)
	
	Для каждого Элемент из Структура Цикл
		Если Элемент.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДокОбъект = Элемент.Значение.ПолучитьОбъект();
		
		Если ТипЗнч(ДополнительноеСвойство) = Тип("Структура") Тогда
			Для каждого ЭлементСтруктуры из ДополнительноеСвойство Цикл
				ДокОбъект.ДополнительныеСвойства.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			КонецЦикла;
		ИначеЕсли ДополнительноеСвойство <> Неопределено Тогда
			ДокОбъект.ДополнительныеСвойства.Вставить(ДополнительноеСвойство);
		КонецЕсли;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось распровести документ """ + ДокОбъект + """. Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			ВызватьИсключение;
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Добавляет все документы структуры в массив. 
//
// Параметры:
//  Структура - Структура - Структура, в значениях которой хранятся ссылки на документы, которые необходимо добавить в массив
//  МассивДокументов - Массив - Массив, в который нужно добавить документы структуры
//
//  Возвращаемое значение:
//      Булево - Результат распроведения.
//
Функция ДобавитьДокументыСтруктурыВМассив(Структура, МассивДокументов)
	
	Для каждого Элемент из Структура Цикл
		Если Элемент.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивДокументов.Добавить(Элемент.Значение);
	КонецЦикла;
	
КонецФункции

// Помечает на удаление все документы массива. 
//
// Параметры:
//  Массив - Массив - Массив документов, которые необходимо пометить на удаление
//
//  Возвращаемое значение:
//      Булево - Результат пометки удаления.
//
Функция ПометитьНаУдалениеДокументыМассива(Массив, ДополнительноеСвойство) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	Для каждого Документ из Массив Цикл
		Если Документ.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ДокОбъект = Документ.ПолучитьОбъект();
		ДокОбъект.ПометкаУдаления = Истина;
		
		Если ТипЗнч(ДополнительноеСвойство) = Тип("Структура") Тогда
			Для каждого ЭлементСтруктуры из ДополнительноеСвойство Цикл
				ДокОбъект.ДополнительныеСвойства.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			КонецЦикла;
		ИначеЕсли ДополнительноеСвойство <> Неопределено Тогда
			ДокОбъект.ДополнительныеСвойства.Вставить(ДополнительноеСвойство);
		КонецЕсли;
		
		Попытка
			Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаРегистров") Тогда
				Для каждого СтрокаТЧ из ДокОбъект.ТаблицаРегистров Цикл
					ДокОбъект.Движения[СтрокаТЧ.Имя].Прочитать();
					ДокОбъект.Движения[СтрокаТЧ.Имя].Очистить();
					ДокОбъект.Движения[СтрокаТЧ.Имя].Записать();
				КонецЦикла;
				ДокОбъект.ТаблицаРегистров.Очистить();
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				//// Корректировку после записи удалим безвозвратно
				//ДокОбъект.Удалить();
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		Исключение
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось распровести документ """ + ДокОбъект + """. Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Добавляет документ в структуру по определенным правилам. 
//
// Параметры:
//  СтруктураДокументов - Структура - Структура, в которую необходимо добавить документы. В структуре уже должны быть определены ключи, соответствующие типам документов.
//										Если документ переданного типа уже есть в структуре, он добавляется в МассивДляУдаления
//  ТиповойДокумент - ДокументСсылка - Документ, который нужно добавить в структуру.
//  МассивДляУдаления - Массив - Массив документов, в который добавляются документы, типы которых уже содержаться в структуре
//								(например, если документ ПриходныйОрдерНаТовары уже содержит значение в структуре, второй такой документ будет помещен в массив).
//  МассивДопустимыхТипов - Массив - Массив, в котором содержаться допустимые типы. Если переданный документ не будет принадлежать этому массиву, он будет пропущен.
//									Примечание: для документа ОтборРазмещениеТоваров через нижнее подчеркивание добавляется ВидОперации этого документа. Сделано так, потому что
//									для одного заказа может быть несколько отборов размещения. Например, при перемещении паллета из ячейки одного склада в ячейку другого склада
//									создается 2 типовых документа ОтборРазмещениеТоваров - "Отбор" (со склада расхода) и "Размещение" (на склад прихода)
//
Процедура ДобавитьДокументВСтруктуру(СтруктураДокументов, ТиповойДокумент, МассивДляУдаления, МассивДопустимыхТипов)
	
	ТипДокумента = ТиповойДокумент.Метаданные().Имя;
	Если ТипДокумента = "ОтборРазмещениеТоваров" Тогда
		ТипДокумента = ТипДокумента + "_" + ТиповойДокумент.ВидОперации;
	КонецЕсли;
	
	Если МассивДопустимыхТипов.Найти(ТипДокумента) = Неопределено Тогда
		//тип не является допустимым - удаляем
		//хотя нет, просто пропустим его. При перезаполнении регистра ЛикоСвязиСТиповымиДокументами его уже не будет
		//МассивДляУдаления.Добавить(ТиповойДокумент);
	Иначе
		Если СтруктураДокументов[ТипДокумента] = Неопределено Тогда
			//данной тип документа еще не заполнен в структуре - заполним
			СтруктураДокументов[ТипДокумента] = ТиповойДокумент;
		ИначеЕсли ТипДокумента <> "Лико_ПередачаТоваровМеждуОрганизациями" Тогда
			//В структуре уже есть документ такого типа, поэтому остальные документы с таким типом удаляем
			МассивДляУдаления.Добавить(ТиповойДокумент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДокументВМассивУдаленияВСоответсвтииСДопустимымиТипами(ТиповойДокумент, МассивДляУдаления, МассивДопустимыхТипов)
	
	ТипДокумента = ТиповойДокумент.Метаданные().Имя;
	Если ТипДокумента = "ОтборРазмещениеТоваров" Тогда
		ТипДокумента = ТипДокумента + "_" + ТиповойДокумент.ВидОперации;
	КонецЕсли;
	
	Если МассивДопустимыхТипов.Найти(ТипДокумента) = Неопределено Тогда
		// не добавляем
	Иначе
		// добавляем
		МассивДляУдаления.Добавить(ТиповойДокумент);
	КонецЕсли;
	
КонецПроцедуры

// Находит первый проведенный заказ на производство, созданный на основании заказа клиента. 
//
// Параметры:
//  ЗаказКлиента - ДокументСсылка.ЗаказКлиента - Заказ клиента, на основании которого создан заказ на производство
//
//  Возвращаемое значение:
//      ДокументСсылка.ЗаказНаПроизводство2_2, Неопределено - Ссылка на документ "Заказ на производство". Неопределено, если документ не найден
//
Функция НайтиЗаказНаПроизводствоПоЗаказуКлиента(ЗаказКлиента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказНаПроизводство2_2.Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	|ГДЕ
	|	ЗаказНаПроизводство2_2.ДокументОснование = &ЗаказКлиента
	|	И НЕ ЗаказНаПроизводство2_2.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаПроизводство2_2.Проведен УБЫВ,
	|	ЗаказНаПроизводство2_2.Дата";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// !! Дописать описание функции. Функция не подберет ячейки, если товар находится в зоне отгрузки (типовое ограничение)
Функция СоздатьДокументОтборРазмещениеТоваровНаОснованииРасходногоОрдера(РасходныйОрдерНаТовары, УжеСозданныйДокумент = Неопределено, ОтключитьЧастьПроверок = Ложь, ОтгружатьИзЗоныОтгрузки = Ложь) Экспорт
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	Если НЕ ОтгружатьИзЗоныОтгрузки Тогда
		// Ячейки должны подобраться автоматически при создании на основании
		НовыйДокОбъект.Заполнить(РасходныйОрдерНаТовары);
		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
	Иначе
		// Товары лежат в зоне отгрузки, поэтому ячейки не смогут подобраться автоматически. Создаем документ вручную
		НовыйДокОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор;
		НовыйДокОбъект.ЗонаОтгрузки = Лико_Дополнительно.ПолучитьЗонуОтгрузкиПоСкладу(РасходныйОрдерНаТовары.Склад);
		НовыйДокОбъект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		НовыйДокОбъект.Распоряжение = РасходныйОрдерНаТовары;
		НовыйДокОбъект.Склад = РасходныйОрдерНаТовары.Склад;
		
		Для каждого Строка из РасходныйОрдерНаТовары.ОтгружаемыеТовары Цикл
			НоваяСтрока = НовыйДокОбъект.ТоварыОтбор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.КоличествоОтобрано = Строка.Количество;
			НоваяСтрока.КоличествоУпаковокОтобрано = Строка.КоличествоУпаковок;
			НоваяСтрока.Ячейка = НовыйДокОбъект.ЗонаОтгрузки;
		КонецЦикла;	
	КонецЕсли;
	НовыйДокОбъект.Дата = РасходныйОрдерНаТовары.Дата;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Комментарий = РасходныйОрдерНаТовары.Комментарий;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	НовыйДокОбъект.ДополнительныеСвойства.Вставить("Лико_АвтоматическоеСоздание");
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция ПровестиДокументВДругомСтатусе(Документ, Статус) Экспорт
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	ДокОбъект = Документ.ПолучитьОбъект();
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		Для каждого Строка из ДокОбъект.ОтгружаемыеТовары Цикл
			Если Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
				Строка.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
			Иначе
				Строка.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДокОбъект.Статус = Статус;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + ДокОбъект + """ не удалось провести в статусе """ + Статус + """! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат НЕ Отказ;
	
КонецФункции

Функция ЗаписатьДокументВДругомСтатусеБезПроведения(Документ, Статус) Экспорт
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	ДокОбъект = Документ.ПолучитьОбъект();
	ДокОбъект.Статус = Статус;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + ДокОбъект + """ не удалось провести в статусе """ + Статус + """! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат НЕ Отказ;
	
КонецФункции

Функция ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, ИмяДокумента) Экспорт // --> Начало Лико Ефимов ЕВВ 26.07.2017
	Позиция = СтрНайти(КлючиСтруктуры, ИмяДокумента);
	Если Позиция = 0 Тогда
		Возврат КлючиСтруктуры;
	Иначе
		НовыйКлюч = Лев(КлючиСтруктуры, Позиция-1) + Прав(КлючиСтруктуры, СтрДлина(КлючиСтруктуры) - Позиция + 1 - СтрДлина(ИмяДокумента));
		Возврат НовыйКлюч;
	КонецЕсли;
КонецФункции // <-- Конец Лико Ефимов ЕВВ 26.07.2017

Функция НайтиСкладРегиона(Регион) Экспорт // --> Начало Лико Ефимов ЕВВ 09.08.2017
	
	// --> Начало Лико Ефимов ЕВВ 20.01.2021
	Если Регион = Справочники.БизнесРегионы.Производство
		ИЛИ Регион = Справочники.БизнесРегионы.Линкс // --> Начало Лико Ефимов ЕВВ 11.03.2025
		Тогда
		Возврат Справочники.Склады.НайтиПоНаименованию("ОКИЛ Санкт-Петербург");
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 20.01.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.БизнесРегион = &Регион
	|	И НЕ Склады.ПометкаУдаления
	|	И Склады.Лико_ТипСкладаГотовойПродукции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Регион)
	|	И НЕ Склады.ИспользоватьОрдернуюСхемуПриОтгрузке
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование";
	
	Запрос.УстановитьПараметр("Регион", Регион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 09.08.2017

Функция УдалитьИзЭтаповСтрокиВыпускаПоСвязанномуФормированиюПаллета(ФормированиеПаллета, ДопСвойстваДляОбъектаЭтапа = Неопределено, ЗаказКлиента = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 27.11.2017
	
	Отказ = Ложь;
	
	Если ФормированиеПаллета = Неопределено Тогда
		Сообщить("Не удалось удалить строки выпуска из этапа, т.к. переданный документ ""лк Формирование паллета"" не определен");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК ТиповойДокумент
		|ИЗ
		|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
		|ГДЕ
		|	Лико_СвязиСТиповымиДокументами.Документ = &ФормированиеПаллета
		|	И Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.ЭтапПроизводства2_2
		|	И ВЫБОР
		|			КОГДА &Заказ = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.ЭтапПроизводства2_2).ВыходныеИзделия.Характеристика.Лико_ЗаказНоменклатуры = &Заказ
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_СвязиСТиповымиДокументами.ТиповойДокумент";
		
		Запрос.УстановитьПараметр("ФормированиеПаллета", ФормированиеПаллета);
		Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Этап = ВыборкаДетальныеЗаписи.ТиповойДокумент;
			
			ЭтапОбъект = Этап.ПолучитьОбъект();
			Если ДопСвойстваДляОбъектаЭтапа <> Неопределено Тогда
				Для каждого Свойство из ДопСвойстваДляОбъектаЭтапа Цикл
					ЭтапОбъект.ДополнительныеСвойства.Вставить(Свойство.Ключ, Свойство.Значение);
				КонецЦикла;
			КонецЕсли;
			НайденныеСтроки = ЭтапОбъект.ВыходныеИзделия.НайтиСтроки(Новый Структура("Лико_ФормированиеПаллета", ФормированиеПаллета));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для каждого Строка из НайденныеСтроки Цикл
					Если ЗначениеЗаполнено(ЗаказКлиента) И Строка.Характеристика.Лико_ЗаказНоменклатуры <> ЗаказКлиента Тогда
						Продолжить;
					КонецЕсли;
					ЭтапОбъект.ВыходныеИзделия.Удалить(Строка);
				КонецЦикла;
				Попытка
					Если ЭтапОбъект.Проведен Тогда
						ЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						ЭтапОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
				Исключение
					Сообщить("Не удалось удалить строки выпуска из документа " + Этап + ": " + ОписаниеОшибки());
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.11.2017

Функция НайтиВыпускающийЭтапПоЗаказуНаПроизводство(ЗаказНаПроизводство, ОтменятьТранзакцию = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 27.11.2017 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|ГДЕ
	|	ЭтапПроизводства2_2.Распоряжение = &ЗаказНаПроизводство
	|	И ЭтапПроизводства2_2.Проведен
	|	И ЭтапПроизводства2_2.НомерСледующегоЭтапа = 0
	|	И НЕ ЭтапПроизводства2_2.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() = 1 Тогда
		ЭтапСсылка = Таблица[0].Ссылка;
		Возврат ЭтапСсылка;
	Иначе
		Если Таблица.Количество() = 0 Тогда
			Сообщить("По документу " + ЗаказНаПроизводство + " не найдено ни одного выпускающего этапа.");
		Иначе
			Сообщить("По документу " + ЗаказНаПроизводство + " найдено несколько выпускающих этапов.");
		КонецЕсли;
		Если ОтменятьТранзакцию Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.11.2017

Функция НайтиВыпускающийЭтапПоЗаказуКлиента(ЗаказКлиента, Организация = Неопределено, ОтменятьТранзакцию = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 27.11.2017 

	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Сообщить("В функцию НайтиВыпускающийЭтапПоЗаказуКлиента не передан заказ клиента"); 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗаказКлиента) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Сообщить("В функцию НайтиВыпускающийЭтапПоЗаказуКлиента передан не заказ клиента"); 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|ГДЕ
	|	ЭтапПроизводства2_2.Лико_ЗаказКлиента = &ЗаказКлиента
	|	И ЭтапПроизводства2_2.Проведен
	|	И НЕ ЭтапПроизводства2_2.ПометкаУдаления
	|	И ЭтапПроизводства2_2.НомерСледующегоЭтапа = 0
	|	И ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЭтапПроизводства2_2.Организация = &Организация
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() = 1 Тогда
		ЭтапСсылка = Таблица[0].Ссылка;
		Возврат ЭтапСсылка;
	Иначе
		Если Таблица.Количество() = 0 Тогда
			Сообщить("По документу " + ЗаказКлиента + " не найдено ни одного выпускающего этапа.");
		Иначе
			// Найдено несколько выпускающих этапов. Ограничим поиск по организации
			ОрганизацияПользователя = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", ПараметрыСеанса.ТекущийПользователь);
			Если Организация = Неопределено И ЗначениеЗаполнено(ОрганизацияПользователя) Тогда
				Возврат НайтиВыпускающийЭтапПоЗаказуКлиента(ЗаказКлиента, ОрганизацияПользователя);
			КонецЕсли;
			Сообщить("По документу " + ЗаказКлиента + " найдено несколько выпускающих этапов.");
		КонецЕсли;
		Если ОтменятьТранзакцию Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 27.11.2017

Функция ПолучитьДанныеВодУдостоверения(Водитель, Дата) Экспорт // --> Начало Лико Ефимов ЕВВ 19.12.2017 
	
	Параметры = Новый Структура;
	Параметры.Вставить("ВодительФИО");
	Параметры.Вставить("УдостоверениеСерия");
	Параметры.Вставить("УдостоверениеНомер");
	// --> Начало Лико Яцун 05.03.2022
	Параметры.Вставить("Лико_ДатаВыдачиУдостоверения");
    // <-- Конец Лико Яцун 05.03.2022 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Наименование КАК ВодительФИО,
	|	ДокументыФизическихЛиц.Серия КАК УдостоверениеСерия,
	|	ДокументыФизическихЛиц.Номер КАК УдостоверениеНомер,
	// --> Начало Лико Яцун 05.03.2022
	|	ДокументыФизическихЛиц.ДатаВыдачи КАК Лико_ДатаВыдачиУдостоверения
	// <-- Конец Лико Яцун 05.03.2022
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Период, ) КАК ДокументыФизическихЛиц
	|		ПО ФизическиеЛица.Ссылка = ДокументыФизическихЛиц.Физлицо
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Водитель);
	Запрос.УстановитьПараметр("Период", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
	КонецЕсли;			
	
	Возврат Параметры;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 19.12.2017

Функция СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(ПриходныйОрдерНаТовары, УжеСозданныйДокумент, ЯчейкаПолучатель) Экспорт
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	
	НовыйДокОбъект.Заполнить(ПриходныйОрдерНаТовары);
	НовыйДокОбъект.Дата = ПриходныйОрдерНаТовары.Дата;
	НовыйДокОбъект.Ответственный = ПриходныйОрдерНаТовары.Ответственный;
	НовыйДокОбъект.Комментарий = ПриходныйОрдерНаТовары.Комментарий;
	
	//Система автоматом распределила товар по ячейкам, а нам нужно весть товар положить в ЯчейкаПолучатель
	Для каждого СтрокаТЧ из НовыйДокОбъект.ТоварыРазмещение Цикл
		СтрокаТЧ.Ячейка = ЯчейкаПолучатель;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		//чтобы отработали проверки при проведении отбора, его сперва нужно провести в статусе "В работе" или "Подготовлено", а уже потом в статусе "Выполнено без ошибок"
		//(если провести сразу в статусе "Выполнено без ошибок", то проверок не будет и документ без проблем проведется)
		//Если НЕ ОтключитьЧастьПроверок Тогда
		// С такими проверками невозможно перепровести документ задним числом (если коробки после этого имеют другие движения), закомментим пока
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//КонецЕсли;
		//меняем статус и проводим еще раз
		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;	
	
КонецФункции

Функция СоздатьДокументРасходныйОрдерНаТоварыНаОснованииРаспоряжения(УжеСозданныйДокумент = Неопределено, ТаблицаСерий, Распоряжение) Экспорт
	
	// Протестировано на документах распоряжениях РеализацияТоваровУслуг, ОтгрузкаТоваровСХранения, ПеремещениеТоваров, ВнутреннееПотреблениеТоваров, СборкаТоваров
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	ТоварыБезСерий = ТаблицаСерий.Скопировать();
	ТоварыБезСерий.Свернуть("Номенклатура,Характеристика", "Количество");
	Если ТоварыБезСерий.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйДокОбъект = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	НовыйДокОбъект.Дата = Распоряжение.Дата;
	НовыйДокОбъект.ДатаОтгрузки = НовыйДокОбъект.Дата;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию();
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		НовыйДокОбъект.Склад = Распоряжение.Склад;
		НовыйДокОбъект.Получатель = Распоряжение.Партнер;
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКлиенту;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения") Тогда
		НовыйДокОбъект.Склад = Распоряжение.Склад;
		НовыйДокОбъект.Получатель = Распоряжение.Партнер;
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоВозвратуПоставщику;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		НовыйДокОбъект.Склад = Распоряжение.СкладОтправитель;
		НовыйДокОбъект.Получатель = Распоряжение.СкладПолучатель;
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ВнутреннееПотребление") Тогда
		НовыйДокОбъект.Склад = Распоряжение.Склад;
		НовыйДокОбъект.Получатель = Распоряжение.Подразделение;
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаНаВнутренниеНужды;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		НовыйДокОбъект.Склад = Распоряжение.Склад;
		НовыйДокОбъект.Получатель = НовыйДокОбъект.Склад;
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки;
	Иначе
		// При необходимости дописать другие типы распоряжений
		Сообщить("Тип распоряжения """ + ТипЗнч(Распоряжение) + """ не предусмотрен разработчиками. Обратитесь к программистам");
	КонецЕсли;
	НовыйДокОбъект.ЗонаОтгрузки = Лико_Дополнительно.ПолучитьЗонуОтгрузкиПоСкладу(НовыйДокОбъект.Склад);
	НовыйДокОбъект.Комментарий = Распоряжение.Комментарий;
	Если НовыйДокОбъект.Склад.ИспользоватьАдресноеХранение Тогда
		НовыйДокОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору;
	Иначе
		НовыйДокОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	КонецЕсли;
	
	Для каждого Строка из ТоварыБезСерий Цикл
		НоваяСтрокаТоварыПоРаспоряжениям = НовыйДокОбъект.ТоварыПоРаспоряжениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТоварыПоРаспоряжениям, Строка);
		НоваяСтрокаТоварыПоРаспоряжениям.Распоряжение = Распоряжение;
		
	КонецЦикла;
	
	Для каждого СтрокаСерии из ТаблицаСерий Цикл
		НоваяСтрокаОтгружаемыеТовары = НовыйДокОбъект.ОтгружаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОтгружаемыеТовары, СтрокаСерии);
		Если НЕ ЗначениеЗаполнено(НоваяСтрокаОтгружаемыеТовары.СтатусУказанияСерий) Тогда
			НоваяСтрокаОтгружаемыеТовары.СтатусУказанияСерий = 8;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрокаОтгружаемыеТовары.КоличествоУпаковок) Тогда
			НоваяСтрокаОтгружаемыеТовары.КоличествоУпаковок = НоваяСтрокаОтгружаемыеТовары.Количество;
		КонецЕсли;
		
		Если НовыйДокОбъект.Склад.ИспользоватьАдресноеХранение Тогда
			НоваяСтрокаОтгружаемыеТовары.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
		Иначе
			НоваяСтрокаОтгружаемыеТовары.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		КонецЕсли;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументВнутреннееПотребление(Таблица, УжеСозданныйДокумент = Неопределено, СтруктураПараметров) Экспорт
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ВнутреннееПотребление.СоздатьДокумент();
	НовыйДокОбъект.Дата = СтруктураПараметров.Дата;
	НовыйДокОбъект.Организация = СтруктураПараметров.Организация;
	НовыйДокОбъект.Склад = СтруктураПараметров.Склад;
	НовыйДокОбъект.Ответственный = СтруктураПараметров.Ответственный;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + СтруктураПараметров.Основание + """";
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	НовыйДокОбъект.Подразделение = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.Склад, "Подразделение_8b6aafc5a2e14ba0889da315170788bd");
	НовыйДокОбъект.Статус = Перечисления.СтатусыВнутреннихПотреблений.Принято; 
	НовыйДокОбъект.ПотреблениеДляДеятельности = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	
	Если СтруктураПараметров.ЭтоСписаниеСПроизводителя Тогда
		СтатьяРасходов = Справочники.Лико_ПредопределенныеЗначения.СтатьяРасходовДляСписанияГП.ЗначениеПараметра;
	Иначе
		СтатьяРасходов = Справочники.Лико_ПредопределенныеЗначения.СтатьяРасходовДляСписанияГПСОрганизацииПродавца.ЗначениеПараметра;
		//НовыйДокОбъект.Дата = КонецМесяца(НовыйДокОбъект.Дата);
	КонецЕсли;
	//НовыйДокОбъект.ДатаРаспоряжения = НовыйДокОбъект.Дата; // в 2.5 этого реквизита нет
	
	Для каждого Строка из Таблица Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, "Упаковка");
		НоваяСтрока.Количество = Строка.КоличествоОтгружено;
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		НоваяСтрока.СтатьяРасходов = СтатьяРасходов;
		Если СтатьяРасходов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Партнеры") Тогда 
			НоваяСтрока.АналитикаРасходов = Строка.ЗаказКлиента.Партнер;
		ИначеЕсли СтатьяРасходов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия") Тогда 
			НоваяСтрока.АналитикаРасходов = НовыйДокОбъект.Подразделение;
		Иначе
			Сообщить("Для статьи """ + СтатьяРасходов + """ указан тип аналитики """ + СтатьяРасходов.ТипЗначения + """, который не предусмотрен разработчиками");
		КонецЕсли;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументПриходныйОрдерНаТоварыНаОснованииРаспоряжения(Распоряжение, УжеСозданныйДокумент = Неопределено, ТаблицаСерий) Экспорт
	
	// Протестировано на документах распоряжениях ПриемкаТоваровНаХранение, ПеремещениеТоваров, СборкаТоваров
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
		НовыйДокОбъект.Склад = Распоряжение.Склад;
		НовыйДокОбъект.Ответственный = Распоряжение.Менеджер;
		НовыйДокОбъект.Отправитель = Распоряжение.Партнер;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению;
		НовыйДокОбъект.Склад = Распоряжение.СкладПолучатель;
		НовыйДокОбъект.Ответственный = Распоряжение.Ответственный;
		НовыйДокОбъект.Отправитель = Распоряжение.СкладОтправитель;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		НовыйДокОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаСобранныхКомплектов;
		НовыйДокОбъект.Склад = Распоряжение.Склад;
		НовыйДокОбъект.Ответственный = Распоряжение.Ответственный;
		НовыйДокОбъект.Отправитель = НовыйДокОбъект.Склад;
	Иначе
		// При необходимости дописать другие типы распоряжений
		Сообщить("Тип распоряжения """ + ТипЗнч(Распоряжение) + """ не предусмотрен разработчиками. Обратитесь к программистам");
	КонецЕсли;
	
	НовыйДокОбъект.Дата = Распоряжение.Дата;
	НовыйДокОбъект.Распоряжение = Распоряжение;
	НовыйДокОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
	НовыйДокОбъект.Исполнитель = НовыйДокОбъект.Ответственный;
	Если НовыйДокОбъект.Склад.ИспользоватьАдресноеХранение Тогда
		НовыйДокОбъект.ЗонаПриемки = Лико_Дополнительно.ПолучитьЗонуПриемкиПоСкладу(НовыйДокОбъект.Склад);
	КонецЕсли;
	НовыйДокОбъект.Комментарий = Распоряжение.Комментарий;
	НовыйДокОбъект.ХозяйственнаяОперация = Распоряжение.ХозяйственнаяОперация;
	НовыйДокОбъект.Лико_АвторДокумента = НовыйДокОбъект.Исполнитель;
	НовыйДокОбъект.НомерВходящегоДокумента = Распоряжение.Номер;
	НовыйДокОбъект.ДатаВходящегоДокумента = Распоряжение.Дата;
	
	Для каждого Строка из ТаблицаСерий Цикл
		
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатусУказанияСерий) Тогда
			НоваяСтрока.СтатусУказанияСерий = 8;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.КоличествоУпаковок) Тогда
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции 

Функция СформироватьТекстДляСкрипта(ЗаказКлиента,НомерМонтажа,Отказ, РасшифровкаОтказа="") Экспорт
	
	НомерЗаказа=ЗаказКлиента.НомерБезПрефикса;
	Товары=ЗаказКлиента.Товары.Выгрузить();
	Цвета=ЗаказКлиента.Цвета.Выгрузить();
	Соответствия=ЗаказКлиента.МонтажСоответствия.Выгрузить();
	Схема = ЗаказКлиента.МонтажСхема.Выгрузить();

	Текст = "";
	Спецификация=ЗаказКлиента;
	//СтрокаТовары = Номенклатура;
	//СтрокаТовары=ДокЗаявкаНаДизайн.ЗаказПокупателя.Товары[НомерСтроки-1];

	// параметры штампа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиента.ШтампВырубной КАК Штамп,
	|	Лико_ПараметрыШтампа.ВидРабот КАК ВидРабот,
	|	Лико_ПараметрыШтампа.ТипШтампа КАК ТипШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка КАК Нарезка,
	|	Лико_ПараметрыШтампа.ШагПечати КАК ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи КАК Ручьи,
	|	Лико_ПараметрыШтампа.РучьиМин КАК РучьиМин,
	|	Лико_ПараметрыШтампа.Z КАК Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКольеретки КАК ДлинаКольеретки,
	|	Лико_ПараметрыШтампа.ШиринаКонтрЭтикетки КАК ШиринаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаКольеретки КАК ШиринаКольеретки,
	|	Лико_ПараметрыШтампа.НаправлениеНамотки КАК НаправлениеНамотки,
	|	Лико_ПараметрыШтампа.Цена КАК Цена,
	|	Лико_ПараметрыШтампа.ПорядковыйНомерШтанцыНаВалу КАК ПорядковыйНомерШтанцыНаВалу,
	|	Лико_ПараметрыШтампа.ШиринаПоНожам КАК ШиринаПоНожам,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ЗаказКлиента.ШтампВырубной = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента";



	Запрос.УстановитьПараметр("ЗаказКлиента", Спецификация);
	Выборка = Запрос.Выполнить().Выбрать();


	//180-33022						- артикул монтажа, соответствует имени TXT файла
	//314.325						- раппорт (флексо) без сжатия
	//308.265						- раппорт (флексо) со сжатием
	//4								- количество ручьев
	//2								- количество этикет в ручье(по развертке)
	//70							- размер этикеты поперёк полотна
	//155							- размер этикеты вдоль полотна
	//3								- шаг по ножам поперёк полотна(расстояние между ручьями)
	//2.162							- шаг по ножам вдоль полотна
	//стар.211-99/133				- текстовое поле информации для нанесения на рельсу(может быть любой) номер штампа + линиатура печати(из 1С)
	//[forms]						- обозначение начала списка форм
	//Yellow-L40489					- элемент списка форм [используемая краска]-[номер формы]
	//Magenta-L40490				- элемент списка форм
	//Cyan-L40491					- элемент списка форм
	//Pn Purple-F40492				- элемент списка форм
	//Холодное тиснение-40482		- элемент списка форм
	//Black-L40493					- элемент списка форм
	//[articles]					- обозначение начала списка артиклей
	//180-3759						- элемент списка артиклей №1 (соответствует имени дизайнерского и поделеного файла)
	//180-3713						- элемент списка артиклей №2
	//180-33185						- элемент списка артиклей №3
	//180-16965						- элемент списка артиклей №4
	//[montage]						- обозначение начала монтажной схемы
	//1,2,3,4						- монтажная схема ввиде номеров списка артиклей через запятую
	//1,2,3,4						- ручьи в схеме идут вертикально

	Если Выборка.Следующий() Тогда

		//Текст = Текст + Формат(НомерЗаказа, "ЧГ=0"); // номер заказа, соответствует имени TXT файла
		Текст = Текст + Спецификация.НомерБезПрефикса; // код спецификации, соответствует имени TXT файла

		Если ЗначениеЗаполнено(Выборка.Z) Тогда

			Z = Выборка.Z;

			Текст = Текст + Символы.ПС + Выборка.Z.Рапорт; // раппорт (флексо) без сжатия
			Текст = Текст + Символы.ПС + Выборка.Z.РапортВ; // раппорт (флексо) со сжатием
		Иначе

			//Если Не ЗначениеЗаполнено(Выборка.ШагПечати) Тогда
			//	РасшифровкаОтказа = РасшифровкаОтказа + Выборка.Штамп+": У штампа не задан шаг печати.";
			//КонецЕсли;
			//Если Не ЗначениеЗаполнено(Выборка.ЭтикетокНаЛисте) Тогда
			//	РасшифровкаОтказа = РасшифровкаОтказа + Выборка.Штамп+": У штампа не задано количество этикеток на листе.";
			//КонецЕсли;
			//
			//ДлинаЭтикеткиСПрипуском = Выборка.ШагПечати/(Выборка.ЭтикетокНаЛисте/Выборка.Ручьи);
			//ZРапорт = Окр(Цел(0.45/ДлинаЭтикеткиСПрипуском)*ДлинаЭтикеткиСПрипуском,3); // длина печати
			ZРапорт = 0;

			Текст = Текст + Символы.ПС + ZРапорт; // раппорт (флексо) без сжатия
			Текст = Текст + Символы.ПС + ZРапорт; // раппорт (флексо) со сжатием
		КонецЕсли;

		////Текст = Текст + Символы.ПС + Выборка.Ручьи; // количество ручьев
		////Текст = Текст + Символы.ПС + Выборка.ЭтикетокНаЛисте; // количество этикет в ручье(по развертке)
		////
		_ручьиПечати=?(Спецификация.РучьиПечатиИндиго,Спецификация.РучьиПечатиИндиго,
		?(ЗначениеЗаполнено(Спецификация.РучьиПечати),Спецификация.РучьиПечати,Спецификация.Ручьи));
		
		_ручьи=Выборка.Ручьи;
		
	
	Если ЗначениеЗаполнено(Спецификация.ЭтикетокНаЛистеИндиго) Тогда
		лЭтикетокНаЛисте = Спецификация.ЭтикетокНаЛистеИндиго;
	Иначе
		лЭтикетокНаЛисте = ?(ЗначениеЗаполнено(Спецификация.ЭтикетокНаЛистеПечати), Спецификация.ЭтикетокНаЛистеПечати, Спецификация.ЭтикетокНаЛисте);
	КонецЕсли;

		
		
		
		//_ручьи=?(_ручьи=Null,0,_ручьи);
		//_ряды=?(Не ЗначениеЗаполнено(Выборка.Ручьи),0,Выборка.ЭтикетокНаЛисте/Выборка.Ручьи);
		_ряды=?(Не ЗначениеЗаполнено(Выборка.Ручьи),0,Выборка.ЭтикетокНаЛисте/Выборка.Ручьи);

		
		Текст = Текст + Символы.ПС + _ручьиПечати; // количество ручьев
		Текст = Текст + Символы.ПС + ?(Не ЗначениеЗаполнено(Выборка.Ручьи),"",_ряды*_ручьиПечати); // количество этикет в ручье(по развертке)



		Текст = Текст + Символы.ПС + Выборка.ШиринаЭтикетки; // размер этикетки поперёк полотна
		Текст = Текст + Символы.ПС + Выборка.ДлинаЭтикетки; // размер этикетки вдоль полотна
		Текст = Текст + Символы.ПС + Выборка.ИнтервалМеждуРучьями; // шаг по ножам поперёк полотна(расстояние между ручьями)
		Текст = Текст + Символы.ПС + Выборка.ИнтервалМеждуЭтикетками; // шаг по ножам вдоль полотна

		Текст = Текст + Символы.ПС + Выборка.Штамп.Артикул; // текстовое поле информации для нанесения на рельсу(может быть любой) номер штампа + линиатура печати(из 1С)

		Текст = Текст + Символы.ПС + "[forms]"; // обозначение начала списка форм

		Для Каждого СтрокаЦвета Из Цвета Цикл
			Если ЗначениеЗаполнено(СтрокаЦвета.Форма) Тогда
				Если СтрокаЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ОфсетнаяПечать Тогда
					Текст = Текст + Символы.ПС 
					+ ?(ЗначениеЗаполнено(СтрокаЦвета.ТипЦвета1), Строка(СтрокаЦвета.ТипЦвета1)+ " ", "") 
					+ ?(ЗначениеЗаполнено(СтрокаЦвета.ТипКраски), Строка(СтрокаЦвета.ТипКраски)+ " ", "") 
					+ ?(ЗначениеЗаполнено(СтрокаЦвета.Название), Строка(СтрокаЦвета.Название), "") 
					+ "-" + СтрокаЦвета.Форма.Код;
				Иначе
					Текст = Текст + Символы.ПС + СтрЗаменить(СтрокаЦвета.Форма.Наименование, "-", "") + "-" + СтрокаЦвета.Форма.Код;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Текст = Текст + Символы.ПС + "[articles]"; // обозначение начала списка артиклей

		//Если Товары.Количество()>1 Тогда
		//	
		//	Для Каждого СтрокаТовары Из Товары Цикл
		//		Текст = Текст + Символы.ПС + СтрокаТовары.Номенклатура.Артикул; // элемент списка артиклей
		//	КонецЦикла;
		//	
		//	Текст = Текст + Символы.ПС + "[montage]"; // обозначение начала монтажной схемы
		//	
		//	Текст = Текст + Символы.ПС + СформироватьСхемуМонтажаЭтикеток();
		//КонецЕсли;

		Если НомерМонтажа>0 Тогда

			Для Каждого СтрокаСоответствие Из Соответствия Цикл
				Текст = Текст + Символы.ПС + СтрокаСоответствие.Номенклатура.Артикул; // элемент списка артиклей
			КонецЦикла;

			Текст = Текст + Символы.ПС + "[montage]"; // обозначение начала монтажной схемы

			Текст = Текст + Символы.ПС + СформироватьСхемуМонтажаЭтикеток(Схема, НомерМонтажа);

		КонецЕсли;

	Иначе

		Отказ = Истина;

	КонецЕсли;

	Возврат Текст;
	
КонецФункции //СформироватьТекстДляСкрипта Экспорт

Функция СформироватьСхемуМонтажаЭтикеток(Схема, НомерТекущегоМонтажа)
	
	НомерТекущейСтроки = 1;
	СтрокаМонтаж = "";
	
	Для Каждого СтрокаСхемы Из Схема Цикл
		
		ИндексСтроки = СтрокаСхемы.ИндексСтроки;
		
		НомерМонтажа = Цел(ИндексСтроки/1000000);
		ИндексСтроки = ИндексСтроки - НомерМонтажа*1000000; // индекс без монтажа
		
		Если НомерМонтажа<>НомерТекущегоМонтажа Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиМонтажа = Цел(ИндексСтроки/1000);
		ИндексСтроки = ИндексСтроки - НомерСтрокиМонтажа*1000; // индекс без строки
		
		НомерКолонкиМонтажа = ИндексСтроки;
		
		Если НомерТекущейСтроки<>НомерСтрокиМонтажа Тогда
			
			// удалим запятую
			СтрокаМонтаж = Лев(СтрокаМонтаж, СтрДлина(СтрокаМонтаж)-1);
			
			// перейдем на новую строку
			СтрокаМонтаж = СтрокаМонтаж + Символы.ПС;
			НомерТекущейСтроки = НомерСтрокиМонтажа;
			
		КонецЕсли;
		
		СтрокаМонтаж = СтрокаМонтаж + СтрокаСхемы.ИндексНоменклатуры + ",";
		
	КонецЦикла;
	
	Возврат Лев(СтрокаМонтаж, СтрДлина(СтрокаМонтаж)-1);
	
КонецФункции //СформироватьСхемуМонтажаЭтикеток

Функция НайтиИлиСоздатьДоговорНаОтветственноеХранение(Дата, Контрагент, Организация, ВалютаВзаиморасчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора
	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	|	И ДоговорыКонтрагентов.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	Запрос.УстановитьПараметр("ТипДоговора", Перечисления.ТипыДоговоров.СПоклажедателем);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		НовыйДоговор.Наименование = "Договор с поклажедателем";
		НовыйДоговор.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
		НовыйДоговор.Организация = Организация;
		НовыйДоговор.Контрагент = Контрагент;
		НовыйДоговор.НаименованиеДляПечати = НовыйДоговор.Наименование;
		НовыйДоговор.Партнер = НовыйДоговор.Контрагент.Партнер;
		//НовыйДоговор.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
		НовыйДоговор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
		НовыйДоговор.Согласован = Истина;
		НовыйДоговор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		НовыйДоговор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи;
		НовыйДоговор.ТипДоговора = Перечисления.ТипыДоговоров.СПоклажедателем;
		НовыйДоговор.ГруппаФинансовогоУчета = Лико_Дополнительно.НайтиГруппуФинУчетаПоВалютеИНалогообложению(НовыйДоговор.ВалютаВзаиморасчетов, Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
		НовыйДоговор.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
		Если Дата >= Дата('20260101') Тогда
			НовыйДоговор.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);
		ИначеЕсли Дата >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
			НовыйДоговор.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
		Иначе
			НовыйДоговор.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
		КонецЕсли;
		НовыйДоговор.ВариантОформленияЗакупок = Перечисления.ВариантыОформленияЗакупок.НеРазделять;
		НовыйДоговор.НалогообложениеНДСОпределяетсяВДокументе = Истина;
		НовыйДоговор.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.ПоДоговорамБезЗаказовИНакладных;
		Попытка
			НовыйДоговор.Записать();
			Возврат НовыйДоговор.Ссылка;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Функция НайтиИлиСоздатьВидЦеныПоставщика(Партнер, Валюта, ЦенаВключаетНДС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыЦенПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
	|ГДЕ
	|	ВидыЦенПоставщиков.Владелец = &Партнер
	|	И ВидыЦенПоставщиков.Валюта = &Валюта
	|	И ВидыЦенПоставщиков.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|	И НЕ ВидыЦенПоставщиков.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС", ЦенаВключаетНДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		НовыйВидЦенПоставщика = Справочники.ВидыЦенПоставщиков.СоздатьЭлемент();
		НовыйВидЦенПоставщика.Владелец = Партнер;
		НовыйВидЦенПоставщика.Валюта = Валюта;
		НовыйВидЦенПоставщика.ЦенаВключаетНДС = ЦенаВключаетНДС;
		НовыйВидЦенПоставщика.Наименование = "" + НовыйВидЦенПоставщика.Владелец + " " + НовыйВидЦенПоставщика.Валюта + ?(НовыйВидЦенПоставщика.ЦенаВключаетНДС, " цена включает НДС", " цена не включает НДС");
		Попытка
			НовыйВидЦенПоставщика.Записать();
			Возврат НовыйВидЦенПоставщика.Ссылка;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьОрганизациюВладельцаТовара(Номенклатура, Характеристика, Склад, Дата, Ссылка = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыОрганизаций.Период КАК Период,
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыОрганизаций.Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		|ГДЕ
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Характеристика = &Характеристика
		|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.СкладскаяТерритория = &Склад
		|	И ТоварыОрганизаций.Период <= &Дата
		|	И ТоварыОрганизаций.Регистратор <> &Регистратор
		//|	И ТоварыОрганизаций.Организация <> &ОрганизацияЛикофлекс
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Запрос.УстановитьПараметр("ОрганизацияЛикофлекс", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра); // Ликофлекс не рассматриваем, т.к. продажа с ЛК на ОКИЛ создается позже
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организация) Тогда
		Возврат ВыборкаДетальныеЗаписи.Организация;
	Иначе                                                                                    
		//// Раз ничего не нашлось, значит скорее всего владелец ОКИЛ, т.к. продажа с ЛК на ОКИЛ еще не создана. Если будут ошибки, то буду менять этот костыль
		//Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра; 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьЗаписьВДокументЛико_ДвиженияЗаказаПоЭтапам(ЗаказКлиента,
															ИмяТЧ,
															Количество,
															ИдСтроки,
															Автор,
															Дата,
															Растарка,
															НомерБланка,
															Материал = Неопределено,
															ВидРабочегоМеста = "",
															НомерПриложения = 0,
															ОткудаПередано = "",
															ПараметрыДляВыработкиПеремотки = Неопределено
															) Экспорт 

	УстановитьПривилегированныйРежим(Истина);

	ПлощадкаЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "Площадка");
	Если НЕ (ПлощадкаЗаказа = Справочники.Лико_Площадки.Ликофлекс 
			ИЛИ ПлощадкаЗаказа = Справочники.Лико_Площадки.Линкс
			ИЛИ ПлощадкаЗаказа = Справочники.Лико_Площадки.ИксПак
			)
		Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросДЗПЭ = Новый Запрос;
	ЗапросДЗПЭ.Текст = 
	"ВЫБРАТЬ
	|	Лико_ДвиженияЗаказаПоЭтапам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ДвиженияЗаказаПоЭтапам КАК Лико_ДвиженияЗаказаПоЭтапам
	|ГДЕ
	|	Лико_ДвиженияЗаказаПоЭтапам.ЗаказКлиента = &ЗаказКлиента
	|	И НЕ Лико_ДвиженияЗаказаПоЭтапам.ПометкаУдаления";
	
	ЗапросДЗПЭ.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	ВыборкаДЗПЭ = ЗапросДЗПЭ.Выполнить().Выбрать();
	Если ВыборкаДЗПЭ.Следующий() Тогда
		ДокОбъектДЗПЭ = ВыборкаДЗПЭ.Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъектДЗПЭ = Документы.Лико_ДвиженияЗаказаПоЭтапам.СоздатьДокумент();
		ДокОбъектДЗПЭ.Дата = Дата;
		ДокОбъектДЗПЭ.ЗаказКлиента = ЗаказКлиента;
		ДокОбъектДЗПЭ.Автор = Автор;
	КонецЕсли;
	НоваяСтрокаДЗПЭ = ДокОбъектДЗПЭ[ИмяТЧ].Добавить();
	НоваяСтрокаДЗПЭ.Дата = Дата;
	НоваяСтрокаДЗПЭ.Автор = Автор;
	НоваяСтрокаДЗПЭ.Количество = Количество;
	НоваяСтрокаДЗПЭ.ИдентификаторСтроки = ИдСтроки;
	НоваяСтрокаДЗПЭ.Растарка = Растарка;
	НоваяСтрокаДЗПЭ.НомерБланка = НомерБланка;
	НоваяСтрокаДЗПЭ.НомерПриложения = НомерПриложения;
	НоваяСтрокаДЗПЭ.Материал = Материал;
	НоваяСтрокаДЗПЭ.ВидРабочегоМеста = ВидРабочегоМеста;
	Если ДокОбъектДЗПЭ.Метаданные().ТабличныеЧасти[ИмяТЧ].Реквизиты.Найти("ОткудаПередано") <> Неопределено Тогда
		НоваяСтрокаДЗПЭ.ОткудаПередано = ОткудаПередано;
	КонецЕсли;
	
	// <-- Начало Лико Яцун С. В. 19.08.2025 
	Если ПараметрыДляВыработкиПеремотки <> Неопределено Тогда
		НоваяСтрокаДЗПЭ.Сотрудник = ПараметрыДляВыработкиПеремотки.Сотрудник;	
		НоваяСтрокаДЗПЭ.Смена = ПараметрыДляВыработкиПеремотки.Смена;	
		НоваяСтрокаДЗПЭ.ТипОперации = ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки;	
		НоваяСтрокаДЗПЭ.ДвойнаяНика = ПараметрыДляВыработкиПеремотки.ДвойнаяНика;	
		НоваяСтрокаДЗПЭ.КоличествоРучьевПереворота = ПараметрыДляВыработкиПеремотки.КоличествоРучьевПереворота;	
		Если ПараметрыДляВыработкиПеремотки.Свойство("ДокументОснование") Тогда
			НоваяСтрокаДЗПЭ.ДокументОснование = ПараметрыДляВыработкиПеремотки.ДокументОснование;	
			НоваяСтрокаДЗПЭ.РабочийЦентр = ПараметрыДляВыработкиПеремотки.РабочийЦентр;
			//Первая перемотка на РЦ должна быть с настройкой
			Если НЕ ЗначениеЗаполнено(ДокОбъектДЗПЭ.Ссылка) Тогда
				ПараметрыДляВыработкиПеремотки.КоличествоНастроек = 1;
			Иначе
				ПеремоткаНаРЦ = ДокОбъектДЗПЭ.Перемотка.НайтиСтроки(Новый Структура("РабочийЦентр",ПараметрыДляВыработкиПеремотки.РабочийЦентр));
				Если ПеремоткаНаРЦ.Количество() = 1 Тогда
					ПараметрыДляВыработкиПеремотки.КоличествоНастроек = 1;	
				Иначе
					МинимальнаяДатаПеремотки = Дата('39991231235959');
					Для каждого СтрНаРЦ	из ПеремоткаНаРЦ Цикл
						Если СтрНаРЦ.Дата > Дата И СтрНаРЦ.КоличествоНастроек = 1 Тогда
							СтрНаРЦ.КоличествоНастроек = 0;
							Документы.Лико_ДвиженияЗаказаПоЭтапам.ПересчитатьВыработкуПеремотки(ЗаказКлиента,СтрНаРЦ);
						КонецЕсли;
						Если СтрНаРЦ.ИдентификаторСтроки <> ИдСтроки Тогда
							МинимальнаяДатаПеремотки = ?(МинимальнаяДатаПеремотки > СтрНаРЦ.Дата, СтрНаРЦ.Дата, МинимальнаяДатаПеремотки);
						КонецЕсли;
					КонецЦикла;
					Если МинимальнаяДатаПеремотки > Дата Тогда
						ПараметрыДляВыработкиПеремотки.КоличествоНастроек = 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаДЗПЭ.КоличествоНастроек = ПараметрыДляВыработкиПеремотки.КоличествоНастроек;
		
		РезультатыРасчетаВыработкиПеремотчиков = Документы.Лико_ДвиженияЗаказаПоЭтапам.РассчитатьВыработкуПеремотчиков(ЗаказКлиента,ПараметрыДляВыработкиПеремотки);
		
		НоваяСтрокаДЗПЭ.КоличествоПМ = РезультатыРасчетаВыработкиПеремотчиков.КоличествоПМ;	
		НоваяСтрокаДЗПЭ.КоличествоКВМ = РезультатыРасчетаВыработкиПеремотчиков.КоличествоКВМ;	
		НоваяСтрокаДЗПЭ.ВремяНастройки = РезультатыРасчетаВыработкиПеремотчиков.ВремяНастройки;	
		НоваяСтрокаДЗПЭ.ВремяОперации = РезультатыРасчетаВыработкиПеремотчиков.ВремяОперации;	
		НоваяСтрокаДЗПЭ.Время = РезультатыРасчетаВыработкиПеремотчиков.Время;
		Если ЗначениеЗаполнено(ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки) Тогда
			НоваяСтрокаДЗПЭ.Количество = РезультатыРасчетаВыработкиПеремотчиков.КоличествоТысШт;
		КонецЕсли;
		ДокОбъектДЗПЭ[ИмяТЧ].Сортировать("Дата");
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 19.08.2025
	
	Попытка
		ДокОбъектДЗПЭ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Не удалось провести документ Лико_ДвиженияЗаказаПоЭтапам: " + ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры 

Процедура УдалитьЗаписиИзДокументаЛико_ДвиженияЗаказаПоЭтапам(ИдСтроки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Лико_ДвиженияЗаказаПоЭтапам.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.Лико_ДвиженияЗаказаПоЭтапам КАК Лико_ДвиженияЗаказаПоЭтапам
	//	|ГДЕ
	//	|	(Лико_ДвиженияЗаказаПоЭтапам.Перемотка.ИдентификаторСтроки = &ИдентификаторСтроки
	//	|			ИЛИ Лико_ДвиженияЗаказаПоЭтапам.ВыходнойКонтроль.ИдентификаторСтроки = &ИдентификаторСтроки
	//	|			ИЛИ Лико_ДвиженияЗаказаПоЭтапам.Упаковка.ИдентификаторСтроки = &ИдентификаторСтроки)";
	//
	//Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдСтроки);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//	НайденныеСтрокиПеремотка = ДокОбъект.Перемотка.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдСтроки));
	//	Для каждого Строка из НайденныеСтрокиПеремотка Цикл
	//		ДокОбъек.Перемотка.Удалить(Строка);
	//	КонецЦИкла;
	//	НайденныеСтрокиВыходнойКонтроль = ДокОбъект.ВыходнойКонтроль.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдСтроки));
	//	Для каждого Строка из НайденныеСтрокиВыходнойКонтроль Цикл
	//		ДокОбъек.ВыходнойКонтроль.Удалить(Строка);
	//	КонецЦИкла;
	//	НайденныеСтрокиУпаковка = ДокОбъект.Упаковка.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдСтроки));
	//	Для каждого Строка из НайденныеСтрокиУпаковка Цикл
	//		ДокОбъек.Упаковка.Удалить(Строка);
	//	КонецЦИкла;
	//	ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	//КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ДвиженияЗаказаПоЭтапамПеремотка.Ссылка КАК Ссылка,
		|	Лико_ДвиженияЗаказаПоЭтапамПеремотка.НомерСтроки КАК НомерСтроки,
		|	""Перемотка"" КАК ИмяТЧ
		|ИЗ
		|	Документ.Лико_ДвиженияЗаказаПоЭтапам.Перемотка КАК Лико_ДвиженияЗаказаПоЭтапамПеремотка
		|ГДЕ
		|	Лико_ДвиженияЗаказаПоЭтапамПеремотка.ИдентификаторСтроки = &ИдентификаторСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль.Ссылка,
		|	Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль.НомерСтроки,
		|	""ВыходнойКонтроль""
		|ИЗ
		|	Документ.Лико_ДвиженияЗаказаПоЭтапам.ВыходнойКонтроль КАК Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль
		|ГДЕ
		|	Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль.ИдентификаторСтроки = &ИдентификаторСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Лико_ДвиженияЗаказаПоЭтапамБлокировка.Ссылка,
		|	Лико_ДвиженияЗаказаПоЭтапамБлокировка.НомерСтроки,
		|	""Блокировка""
		|ИЗ
		|	Документ.Лико_ДвиженияЗаказаПоЭтапам.Блокировка КАК Лико_ДвиженияЗаказаПоЭтапамБлокировка
		|ГДЕ
		|	Лико_ДвиженияЗаказаПоЭтапамБлокировка.ИдентификаторСтроки = &ИдентификаторСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Лико_ДвиженияЗаказаПоЭтапамУничтожение.Ссылка,
		|	Лико_ДвиженияЗаказаПоЭтапамУничтожение.НомерСтроки,
		|	""Уничтожение""
		|ИЗ
		|	Документ.Лико_ДвиженияЗаказаПоЭтапам.Уничтожение КАК Лико_ДвиженияЗаказаПоЭтапамУничтожение
		|ГДЕ
		|	Лико_ДвиженияЗаказаПоЭтапамУничтожение.ИдентификаторСтроки = &ИдентификаторСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки УБЫВ
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ДокОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
		Выборка = ВыборкаСсылка.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокОбъект[Выборка.ИмяТЧ].Удалить(Выборка.НомерСтроки-1);
		КонецЦикла;
		ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ПодпискиНаСобытия  

Процедура Лико_ОбработкаПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	//Справочник "Серии номенклатуры".
	Если ТипЗнч(Источник)=Тип("СправочникМенеджер.СерииНоменклатуры")Тогда
		Если ВидФормы = "ФормаОбъекта" Тогда 		
			Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ.ЯССМ_ОбъектНоменклатуры) Тогда
				СтандартнаяОбработка = Ложь; 
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Ключ",Параметры.Ключ.ЯССМ_ОбъектНоменклатуры);
				Параметры.Ключ=Параметры.Ключ.ЯССМ_ОбъектНоменклатуры;
				ВыбраннаяФорма=Метаданные.Справочники.ЯССМ_ОбъектыНоменклатуры.Формы.ФормаЭлемента;			
			КонецЕсли; 	
		КонецЕсли;
	КонецЕсли; 
	Если ТипЗнч(Источник)=Тип("ОбработкаМенеджер.ПодборСерийВДокументы") Тогда
		
	КонецЕсли;
	
	
	
КонецПроцедуры

//-m.shenderov 02.07.2017

// Процедура запускается подпиской на событие обработка проведения Лико_ПередЗаписьюДокументов для всех документов 
//
Процедура Подписка_ОбработкаПроведенияДокументов(Источник, Отказ, РежимПроведения) Экспорт // --> Начало Лико Ефимов ЕВВ 29.03.2017 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	
	//Начало изменений Иванова Анна  20190812
	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") ИЛИ ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации")  Тогда 
		
		Лико_Планирование.ЗаполнениеПараметровПродаж(Источник, Отказ);	
		
		//с 2020 года отгрузки пишем в регистр, а не в заказ
		Если Источник.Дата>='20200101' Тогда 
			//Если  Источник.Склад.Родитель.Наименование <> "Икс-пак" Тогда // <-- Лико Яцун С. В. 13.12.2023 По Икс-Пак делаем записи в РегистрыНакопления.Лико_Отгрузки2
				Лико_Планирование.ЗаполнениеПараметровОтгрузки(Источник, Отказ);
			//КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ОтчетДавальцу")  Тогда
		Лико_Планирование.ЗаполнениеПараметровПродаж(Источник, Отказ);	
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда 
		Если Источник.Дата>='20200101' Тогда 
			Если  Источник.СкладОтправитель.Родитель.Наименование <> "Икс-пак"
				И Источник.СкладОтправитель.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки
				И Источник.СкладПолучатель.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки Тогда 
				Лико_Планирование.ЗаполнениеПараметровОтгрузки(Источник, Отказ);
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.АктВыполненныхРабот") Тогда 
		Лико_Планирование.ЗаполнениеПродажпоАктамРабот(Источник, Отказ);	
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ВнутреннееПотребление") Тогда 
		Лико_Планирование.ЗаполнениеПараметровСписания(Источник, Отказ);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ЭтапПроизводства2_2") Тогда 
		Лико_Планирование.ЗаполнениеПараметровВыпуска(Источник, Отказ);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СборкаТоваров") Тогда 
		Лико_Планирование.ЗаполнениеПараметровСборкиРазборки(Источник, Отказ);
		
	КонецЕсли;
	//Конец изменений Иванова Анна   20190912
	
	
	// При проведении документа ОтборРазмещениеТоваров проставляет в связанном с ним документе Лико_ЗаявкаНаТранспортировку подобранные места
	Если ТипИсточника = Тип("ДокументОбъект.ОтборРазмещениеТоваров") Тогда
		// --> Начало Лико Ефимов ЕВВ 03.08.2022 убираю, вроде как не нужно это все
		//Если Отказ ИЛИ НЕ Источник.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//ЗначениеДопРеквизита = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку", Источник.Склад);
		//ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку = ?(ЗначениеДопРеквизита = Неопределено, Ложь, ЗначениеДопРеквизита);
		//Если ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку Тогда
		//	Возврат;
		//КонецЕсли;	
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Лико_СвязиСТиповымиДокументами.Документ КАК ЗаявкаНаТранспортировку
		//|ИЗ
		//|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
		//|ГДЕ
		//|	(ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.ОтборРазмещениеТоваров)) = &ОтборРазмещениеТоваров
		//|	И Лико_СвязиСТиповымиДокументами.Документ ССЫЛКА Документ.Лико_ЗаявкаНаТранспортировку";
		//
		//Запрос.УстановитьПараметр("ОтборРазмещениеТоваров", Источник.Ссылка);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//Выборка = РезультатЗапроса.Выбрать();
		//
		//Если Выборка.Следующий() Тогда
		//	
		//	ЗаявкаНаТранспортировку = Выборка.ЗаявкаНаТранспортировку;
		//	// --> Начало Лико Ефимов ЕВВ 25.01.2021
		//	Если ЗаявкаНаТранспортировку.СозданНаОснованииПолученияГПИзПроизводства Тогда
		//		Возврат;
		//	КонецЕсли;
		//	// <-- Конец Лико Ефимов ЕВВ 25.01.2021
		//	ЗаявкаНаТранспортировкуОбъект = ЗаявкаНаТранспортировку.ПолучитьОбъект();
		//	ЗаявкаНаТранспортировкуОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзОтборРазмещениеТоваров");
		//	Для каждого Строка из ЗаявкаНаТранспортировкуОбъект.Продукция Цикл
		//		Строка.Мест = 0;
		//	КонецЦикла;
		//	Для каждого Строка из Источник.ТоварыРазмещение Цикл
		//		Если Строка.КоличествоРазмещено > 0 Тогда
		//			СтрокаПродукция = ЗаявкаНаТранспортировкуОбъект.Продукция.Найти(Строка.Серия, "Серия");
		//			Если СтрокаПродукция = Неопределено Тогда
		//				//Отказ = Истина;
		//				//Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Ошибка при записи документа " + Источник + ". " + Строка.Номенклатура + " / " + Строка.Серия + ": не найдена в связанном документе " + ЗаявкаНаТранспортировку + ".");
		//				//Продолжить;
		//				ДобавитьСериюВТЧПродукцяДокументаЗаявкаНаТранспортировку(Строка.Серия, ЗаявкаНаТранспортировкуОбъект);
		//			Иначе
		//				СтрокаПродукция.Мест = 1;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЦикла;
		//	ЗаявкаНаТранспортировкуОбъект.ПересчитатьПодобранноеКоличество();
		//	
		//	Попытка
		//		ЗаявкаНаТранспортировкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//		Отказ = Истина;
		//		Сообщить("Документ """ + ЗаявкаНаТранспортировкуОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		//	КонецПопытки;
		//КонецЕсли;
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		Лико_Планирование.ОбработкаПроведения_ЗаказКлиента(Источник, Отказ, РежимПроведения);
		
		//Конец изменений Иванова Анна 2017.08.07	
	ИначеЕсли (ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров") ИЛИ ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг")) И НЕ Источник.ДополнительныеСвойства.Свойство("Лико_ЭтоПерепроведениеДокументаБезИзменений") Тогда
		// --> Начало Лико Ефимов ЕВВ 31.10.2018
		//Убрала проверку 20200326
		//Если Источник.ДополнительныеСвойства.Свойство("Лико_ДанныеПоЗаказамИКоличествуПередПроведением") Тогда
		//	ТаблицаВПроведении = ПолучитьДанныеПоЗаказамИКоличествуИзДокумента(Источник.Ссылка);
		//	ТаблицыРазличаются = СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(Источник.ДополнительныеСвойства.Лико_ДанныеПоЗаказамИКоличествуПередПроведением, ТаблицаВПроведении, Ложь);
		//	Если НЕ ТаблицыРазличаются Тогда
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 31.10.2018
		//с 2020 года отгрузки пишем в регистр, а не в заказ
		ИксПак = Ложь;
		ОтветственноеХранениеТовараДругойПлощадки = Ложь;
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			ИмяПоляСклад = "Склад";
			Если Источник.Договор.Лико_Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
				ИксПак = Истина;
			КонецЕсли;
		Иначе
			ИмяПоляСклад = "СкладОтправитель";
			ОтветственноеХранениеТовараДругойПлощадки = Источник.СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки
			ИЛИ Источник.СкладПолучатель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки; 
			
		КонецЕсли;
		// <-- Начало Лико Яцун С. В. 24.04.2024 
		//Убрал заполнение тч Отгрузки в заказе т.к. для ИксПак тоже перешли на регистр накопления вместо регистра сведений
		//Если Источник.Дата<'20200101' Тогда 
		//	Если  Источник[ИмяПоляСклад] = Справочники.Склады.НайтиПоНаименованию("ЛК металлострой ГП") ИЛИ Источник[ИмяПоляСклад] = Справочники.Склады.НайтиПоНаименованию("ИКС ГП") Тогда
		//		Лико_Планирование.ЗаполнениеОтгрузокИзРеализаций_Передач(Источник, Отказ);
		//	КонецЕсли;
		//Иначе
		//	Если (Источник[ИмяПоляСклад] = Справочники.Склады.НайтиПоНаименованию("ИКС ГП") ИЛИ ИксПак)
		//		И НЕ ОтветственноеХранениеТовараДругойПлощадки Тогда
		//		Лико_Планирование.ЗаполнениеОтгрузокИзРеализаций_Передач(Источник, Отказ);
		//	КонецЕсли;
		//КонецЕсли;
		// <-- Конец Лико Яцун С. В. 24.04.2024
		Если Отказ Тогда 
			Сообщить("Не удалось заполнить/рассчитать отгрузки в заказе");
		КонецЕсли;
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ОтчетДавальцу") Тогда 	
		Лико_Планирование.ЗаполнениеОтгрузокИзРеализаций_Передач(Источник, Отказ);
		Если Отказ Тогда 
			Сообщить("Не удалось заполнить/рассчитать отгрузки в заказе");
		КонецЕсли;
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ДоступностьРабочихЦентров") Тогда
		СформироватьДвиженияПоНедоступностиРЦ(Источник, Отказ);		
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 29.03.2017 

Процедура УстановитьПризнакПолученныхДокументовПриНеобходимости(Источник)

	ТипИсточника = ТипЗнч(Источник);
	
	Если (ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг")
			ИЛИ ТипИсточника = Тип("ДокументОбъект.ТранспортнаяНакладная")
			ИЛИ ТипИсточника = Тип("ДокументОбъект.ОтгрузкаТоваровСХранения"))
		И Источник.Сканы
		И ЗначениеЗаполнено(Источник.Ссылка)
		И НЕ Источник.Ссылка.Сканы
		Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Найдем связанную заявку на транспортировку и сразу проверим, есть ли по ней записи в РегистрСведений.Лико_РегистрацияОтправкиДокументов
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку) КАК ЗаявкаНаТранспортировку,
			|	ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку).ТипОтгрузки КАК ТипОтгрузки
			|ПОМЕСТИТЬ ВТ_ЗаявкаНаТранспортировку
			|ИЗ
			|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
			|ГДЕ
			|	(ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг)) = &ТиповойДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку).ТипОтгрузки,
			|	ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ЗаявкаНаТранспортировку.ЗаявкаНаТранспортировку КАК ЗаявкаНаТранспортировку,
			|	ВТ_ЗаявкаНаТранспортировку.ТипОтгрузки КАК ТипОтгрузки
			|ИЗ
			|	ВТ_ЗаявкаНаТранспортировку КАК ВТ_ЗаявкаНаТранспортировку
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_РегистрацияОтправкиДокументов КАК Лико_РегистрацияОтправкиДокументов
			|		ПО ВТ_ЗаявкаНаТранспортировку.ЗаявкаНаТранспортировку = Лико_РегистрацияОтправкиДокументов.Пакет
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ЗаявкаНаТранспортировку.ЗаявкаНаТранспортировку,
			|	ВТ_ЗаявкаНаТранспортировку.ТипОтгрузки";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", Источник.Метаданные().Имя);
		Запрос.УстановитьПараметр("ТиповойДокумент", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаявкаНаТранспортировку) Тогда
			НужноУстановитьПризнак = Ложь;
			Если ВыборкаДетальныеЗаписи.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца
				И ТипИсточника = Тип("ДокументОбъект.ТранспортнаяНакладная") Тогда
				НужноУстановитьПризнак = Истина;
			ИначеЕсли (ВыборкаДетальныеЗаписи.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
					ИЛИ ВыборкаДетальныеЗаписи.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения)
				И ТипИсточника = Тип("ДокументОбъект.ОтгрузкаТоваровСХранения") Тогда
				НужноУстановитьПризнак = Истина;
			ИначеЕсли ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
				НужноУстановитьПризнак = Истина;
			КонецЕсли;
			Если НужноУстановитьПризнак Тогда
				МенеджерЗаписи = РегистрыСведений.Лико_РегистрацияОтправкиДокументов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.Пакет = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспортировку;
				МенеджерЗаписи.Статус = Перечисления.Лико_СтатусыОтправкиДокументов.ПолученОтКонтрагента;
				//МенеджерЗаписи.Контрагент = Контрагент; // Пока не понимаю, кого сюда писать. Попробуем без контрагента
				МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				МенеджерЗаписи.Комментарий = "Запись добавлена автоматически при создании скан-образа документа";
				Попытка
					МенеджерЗаписи.Записать(Истина);
				Исключение
					Лико_Планирование.ОтправитьПисьмо("Документ """ + Источник + """, пользователь """ + ПараметрыСеанса.ТекущийПользователь + """, описание ошибки: " + ОписаниеОшибки(),
						"Не удалось добавить запись в регистр Лико_РегистрацияОтправкиДокументов", "vefimov@okil.ru",,,,,, Ложь);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

// Процедура запускается подпиской на событие перед записью Лико_ПередЗаписьюДокументов для всех документов 
//
Процедура Подписка_ПередЗаписьюДокументов(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт // --> Начало Лико Ефимов ЕВВ 17.07.2017  
	
	Если Источник.ОбменДанными.Загрузка Тогда
		УстановитьПризнакПолученныхДокументовПриНеобходимости(Источник); // --> Начало Лико Ефимов ЕВВ 07.04.2023 Именно внутри, потому что реквизит Сканы устанавливается в режиме обмена
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);  
//Начало изменений А.В. Иванова 20230621 - актуализируем отгрузки при каждой записи 	
//Начало изменений А.В. Иванова 20220302     
	//Если  ЗначениеЗаполнено(Источник.Ссылка) И Источник.дата>='20220201' И ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров")  ИЛИ ТипИсточника = Тип("ДокументОбъект.ВнутреннееПотребление") 
	//ИЛИ ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") ИЛИ ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Лико_Отгрузки2.Период КАК Период,
	//	|	Лико_Отгрузки2.Регистратор КАК Регистратор,
	//	|	Лико_Отгрузки2.НомерСтроки КАК НомерСтроки,
	//	|	Лико_Отгрузки2.Активность КАК Активность,
	//	|	Лико_Отгрузки2.Заказ КАК Заказ,
	//	|	Лико_Отгрузки2.ДокументОтгрузки КАК ДокументОтгрузки,
	//	|	Лико_Отгрузки2.РабочийЦентр КАК РабочийЦентр,
	//	|	Лико_Отгрузки2.Количество КАК Количество,
	//	|	Лико_Отгрузки2.МетражКВМ КАК МетражКВМ,
	//	|	Лико_Отгрузки2.МетражПМ КАК МетражПМ,
	//	|	Лико_Отгрузки2.Стоимость КАК Стоимость,
	//	|	Лико_Отгрузки2.СтоимостьУслуг КАК СтоимостьУслуг,
	//	|	Лико_Отгрузки2.Себестоимость КАК Себестоимость,
	//	|	Лико_Отгрузки2.Доход КАК Доход,
	//	|	Лико_Отгрузки2.МетражФакт КАК МетражФакт,
	//	|	Лико_Отгрузки2.МетражФактПМ КАК МетражФактПМ,
	//	|	Лико_Отгрузки2.МетражПлан КАК МетражПлан,
	//	|	Лико_Отгрузки2.МетражПланПМ КАК МетражПланПМ,
	//	|	Лико_Отгрузки2.ВремяПлан КАК ВремяПлан,
	//	|	Лико_Отгрузки2.Время1РЦ КАК Время1РЦ,
	//	|	Лико_Отгрузки2.ВремяУУ КАК ВремяУУ,
	//	|	Лико_Отгрузки2.ВремяПробников КАК ВремяПробников,
	//	|	Лико_Отгрузки2.КоличествоСписано КАК КоличествоСписано,
	//	|	Лико_Отгрузки2.МетражКВМСписано КАК МетражКВМСписано,
	//	|	Лико_Отгрузки2.МетражПМСписано КАК МетражПМСписано,
	//	|	Лико_Отгрузки2.Настройка КАК Настройка,
	//	|	Лико_Отгрузки2.РасчетноеКоличествоКликов КАК РасчетноеКоличествоКликов,
	//	|	Лико_Отгрузки2.СтоимостьБезНДС КАК СтоимостьБезНДС,
	//	|	Лико_Отгрузки2.СтоимостьРеглСНДС КАК СтоимостьРеглСНДС,
	//	|	Лико_Отгрузки2.СтоимостьРегл КАК СтоимостьРегл,
	//	|	Лико_Отгрузки2.Нарезка КАК Нарезка,
	//	|	Лико_Отгрузки2.ОсновнойМатериал КАК ОсновнойМатериал,
	//	|	Лико_Отгрузки2.ПерваяОтгрузка КАК ПерваяОтгрузка,
	//	|	Лико_Отгрузки2.КодРабот КАК КодРабот,
	//	|	Лико_Отгрузки2.КомментарийКОтгрузке КАК КомментарийКОтгрузке,
	//	|	Лико_Отгрузки2.МоментВремени КАК МоментВремени
	//	|ИЗ
	//	|	РегистрНакопления.Лико_Отгрузки2 КАК Лико_Отгрузки2
	//	|ГДЕ
	//	|	Лико_Отгрузки2.Регистратор = &Регистратор
	//	|	И Лико_Отгрузки2.Заказ.Площадка = &Площадка";
	//	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка); 
	//	Запрос.УстановитьПараметр("Площадка", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);

	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Источник.ДополнительныеСвойства.Вставить("Лико_Отгрузки", РезультатЗапроса.Выгрузить());  

	//
	//КонецЕсли;

//КонецИзменений А.В. Иванова 20220302
//КонецИзменений А.В. Иванова 20230621
	
	
	Если Справочники.Лико_ПредопределенныеЗначения.ПроверятьСоотвествиеХарактеристикСХарактеристикамиСерийВДокументах.ЗначениеПараметра Тогда
		// Перед записью всех документов проверяем, есть ли в табличной части реквизит Серия. Если есть, то проверяем саму серию на принадлежность ее характеристике
		Для каждого ТЧ из Источник.Метаданные().ТабличныеЧасти Цикл
			Если ТЧ.Реквизиты.Найти("Серия") <> Неопределено Тогда
				//Проверим, чтобы не было дублей серий
				ТЗСерий = Источник[ТЧ.Имя].ВыгрузитьКолонки("Серия");
				
				ЕстьРеквизитХарактеристика = ТЧ.Реквизиты.Найти("Характеристика") <> Неопределено;
				Для каждого СтрокаТЧ из Источник[ТЧ.Имя] Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
						НоваяСтрокаТЗ = ТЗСерий.Добавить();
						НоваяСтрокаТЗ.Серия = СтрокаТЧ.Серия;
					Иначе
						Продолжить;
					КонецЕсли;
					Если НЕ ЕстьРеквизитХарактеристика Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ СтрокаТЧ.Номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Серия.Лико_ХарактеристикаВладелец) Тогда
						Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В документе """ + Источник + """ для серии """ + СтрокаТЧ.Серия + """ не установлена характеристика-владелец!");
						Отказ = Истина;
					Иначе
						Если СтрокаТЧ.Серия.Лико_ХарактеристикаВладелец <> СтрокаТЧ.Характеристика Тогда
							Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В документе """ + Источник + """ для серии """ + СтрокаТЧ.Серия + """ установлена характеристика-владелец, отличающаяяся от характеристики табличной части!");
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				//ПроверятьУникальностьСерийВТЧ = Истина;
				//Если ТипИсточника = Тип("ДокументОбъект.ПересчетТоваров") Тогда
				//	ПроверятьУникальностьСерийВТЧ = Ложь;
				//КонецЕсли;
				//Если ПроверятьУникальностьСерийВТЧ Тогда
				//	ТЗСвернута = ТЗСерий.Скопировать();
				//	ТЗСвернута.Свернуть("Серия");
				//	Если ТЗСвернута.Количество() <> ТЗСерий.Количество() Тогда
				//		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В документе """ + Источник + """ в табличной части """ + ТЧ.Имя + """ есть серии, которые занесены разными строками.");
				//		Отказ = Истина;	
				//	КонецЕсли;
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Если ТипИсточника = Тип("ДокументОбъект.ОтборРазмещениеТоваров") Тогда
		
		//Если НЕ Источник.ДополнительныеСвойства.Свойство("Лико_АвтоматическоеСоздание") Тогда
		//	
		//	// Проверим, нет ли у документа связанных реализаций через регистр ЛикоСвязанныеДокументы
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	Лико_СвязиСТиповымиДокументами.Документ КАК ЗаявкаНаТранспортировку
		//	|ПОМЕСТИТЬ ВТ
		//	|ИЗ
		//	|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
		//	|ГДЕ
		//	|	(ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.ОтборРазмещениеТоваров)) = &ОтборРазмещениеТоваров
		//	|	И Лико_СвязиСТиповымиДокументами.Документ ССЫЛКА Документ.Лико_ЗаявкаНаТранспортировку
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК РеализацияТоваровУслуг
		//	|ПОМЕСТИТЬ ВТ2
		//	|ИЗ
		//	|	ВТ КАК ВТ
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
		//	|		ПО ВТ.ЗаявкаНаТранспортировку = Лико_СвязиСТиповымиДокументами.Документ
		//	|ГДЕ
		//	|	Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
		//	|	И ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг).Проведен
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	ВТ2.РеализацияТоваровУслуг
		//	|ИЗ
		//	|	ВТ2 КАК ВТ2
		//	|ГДЕ
		//	|	НЕ ВТ2.РеализацияТоваровУслуг ЕСТЬ NULL";
		//	
		//	Запрос.УстановитьПараметр("ОтборРазмещениеТоваров", Источник.Ссылка);
		//	
		//	РезультатЗапроса = Запрос.Выполнить();
		//	
		//	Выборка = РезультатЗапроса.Выбрать();
		//	
		//	Если Выборка.Следующий() Тогда
		//		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("" + Источник.Ссылка + ": уже сформированы бухгалтерские документы! Изменение невозможно.");
		//		Отказ = Истина;
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		
		
		// Установим статус в соответствии с количеством: если ничего не подобрано - подготовлено, если все подобрано - выполнено без ошибок, если часть подобрано - выполнено с ошибками
		Если Источник.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение ИЛИ Источник.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение Тогда
			// Для перемещения и размещения будем проверять количество по ТЧ ТоварыРазмещение 
			ИмяТЧ = "ТоварыРазмещение";
			ИмяРеквизита = "КоличествоРазмещено";
		ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор Тогда
			// Для отбра будем проверять количество по ТЧ ТоварыОтбор 
			ИмяТЧ = "ТоварыОтбор";
			ИмяРеквизита = "КоличествоОтобрано";
		Иначе
			Возврат;
		КонецЕсли;
		
		Если Источник[ИмяТЧ].Итог(ИмяРеквизита) = 0 Тогда
			Источник.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено;
		Иначе
			ВсеРазмещено = Истина;
			Для каждого Строка из Источник[ИмяТЧ] Цикл
				Если Строка[ИмяРеквизита] <> Строка.Количество Тогда
					ВсеРазмещено = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ВсеРазмещено Тогда
				Источник.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
			Иначе
				Источник.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоСОшибками;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		Если ЗначениеЗаполнено(Источник.Ссылка) И Источник.Ссылка.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Источник.Ссылка.Дата) = НачалоДня(Источник.Дата) Тогда
			// Если документ уже был проведен и сейчас тоже проводиться, то нужно запомнить данные по заказам (заказ - количество),
			// чтобы в обработке проведения сравнить их с источником и принять решение о необходимости перезаполнять данные в заказах
			Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг")
				И (Источник.Ссылка.Статус <> Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено
				ИЛИ Источник.Ссылка.Валюта <> Источник.Валюта
				ИЛИ Источник.Ссылка.ВалютаВзаиморасчетов <> Источник.ВалютаВзаиморасчетов) Тогда
				// Для реализации в таких случаях запоминать данные не нужно
			Иначе
				// Записи уже должны быть, поэтому запомним что было в документе перед проведением, а потом сравним эти данные после проведения
				Источник.ДополнительныеСвойства.Вставить("Лико_ДанныеПоЗаказамИКоличествуПередПроведением", ПолучитьДанныеПоЗаказамИКоличествуИзДокумента(Источник.Ссылка));			
			КонецЕсли;	
		КонецЕсли;	
		//Начало изменений Иванова А.В. 20171009
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		Лико_Планирование.ПередЗаписьюДокументов_ЗаказКлиента(Источник, Отказ, РежимЗаписи, РежимПроведения);
		//Конец изменений Иванова А.В. 20171009
		// --> Начало Лико Ефимов ЕВВ 21.05.2019
		Если Источник.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка И Источник.ВидУпаковки <> Справочники.Лико_ВидыУпаковки.ПакетыКоробки Тогда
			Источник.ВидУпаковки = Справочники.Лико_ВидыУпаковки.ПакетыКоробки;
		КонецЕсли;
		// Очистим этапы графика оплаты, чтобы не было ошибок при отгрузке, когда в этапах стоит предоплата или аванс
		Источник.ЭтапыГрафикаОплаты.Очистить();
		// <-- Конец Лико Ефимов ЕВВ 21.05.2019
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 16.04.2020
	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтКлиента")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если Источник.Товары.Количество() > 0 И ЗначениеЗаполнено(Источник.Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Менеджер) Тогда
			Источник.Менеджер = Источник.Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Менеджер;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 16.04.2020
	
	// --> Начало Лико Ефимов ЕВВ 31.08.2021
	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.АктВыполненныхРабот") Тогда
		ЗаполнитьДатуПлатежаИЧислоДнейОтсрочкиПоЭтапамГрафикаОплаты(Источник);	
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 31.08.2021
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 17.07.2017  

Процедура ЗаполнитьДатуПлатежаИЧислоДнейОтсрочкиПоЭтапамГрафикаОплаты(Источник) Экспорт // --> Начало Лико Ефимов ЕВВ 31.08.2021
	
	Источник.Лико_ДатаПлатежаПлан = Источник.Дата;
	Для каждого Строка из Источник.ЭтапыГрафикаОплаты Цикл
		Источник.Лико_ДатаПлатежаПлан = Макс(Источник.Лико_ДатаПлатежаПлан, Строка.ДатаПлатежа);
	КонецЦикла;
	
	Источник.Лико_ЧислоДнейОтсрочки = (НачалоДня(Источник.Лико_ДатаПлатежаПлан) - НачалоДня(Источник.Дата)) / 86400;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 31.08.2021

Процедура Подписка_ПередЗаписьюСправочников(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("СправочникОбъект.Партнеры") Тогда
		Если Источник.Клиент Тогда
			Если СтрНайти(Источник.Наименование, """") <> 0 ИЛИ СтрНайти(Источник.Наименование, "«") <> 0 ИЛИ СтрНайти(Источник.Наименование, "»") <> 0 Тогда
				Отказ = Истина;
				Сообщить("В рабочем наименовании клиента запрещены кавычки");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 31.08.2021
	Если ТипИсточника = Тип("СправочникОбъект.СоглашенияСКлиентами") Тогда
		ЗаполнитьЧислоДнейОтсрочкиПоЭтапамГрафикаОплаты(Источник);
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 31.08.2021
	
КонецПроцедуры

Процедура ЗаполнитьЧислоДнейОтсрочкиПоЭтапамГрафикаОплаты(Источник) Экспорт // --> Начало Лико Ефимов ЕВВ 31.08.2021
	
	Источник.Лико_ЧислоДнейОтсрочки = 0;
	Для каждого Строка из Источник.ЭтапыГрафикаОплаты Цикл
		Если Строка.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки
			ИЛИ Строка.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг Тогда
			Источник.Лико_ЧислоДнейОтсрочки = Макс(Источник.Лико_ЧислоДнейОтсрочки, Строка.Сдвиг);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 31.08.2021

Функция ПолучитьДанныеПоЗаказамИКоличествуИзДокумента(Ссылка) Экспорт // --> Начало Лико Ефимов ЕВВ 31.10.2018
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧТовары.Характеристика.Лико_ЗаказНоменклатуры КАК ЗаказКлиента,
	|	СУММА(ТЧТовары.СуммаСНДС) КАК Сумма,
	|	СУММА(ТЧТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТЧТовары
	|ГДЕ
	|	ТЧТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧТовары.Характеристика.Лико_ЗаказНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТЧТовары.Характеристика.Лико_ЗаказНоменклатуры.Номер";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", Ссылка.Метаданные().Имя);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаСНДС", "Лико_Сумма");
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 31.10.2018

Процедура Подписка_ПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	ТипИсточника = ТипЗнч(Источник);
	
	//Начало изменений Иванова А.В.
	Если ТипИсточника = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
			Источник.Номер = Источник.Ссылка.Номер;
			Источник.НомерБезПрефикса = Источник.Ссылка.НомерБезПрефикса;	
		Иначе	
			Источник.Номер = Лико_Планирование.ПолучитьНомерДляЗаказа(Источник.Организация, Источник.ТипЗаказа,Источник.ВидЗаказа, Источник.Регион);
			Источник.НомерБезПрефикса = Прав(Источник.Номер,7);	
		КонецЕсли	
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ЗаказДавальца") Тогда
		Если ЗначениеЗаполнено(Источник.Лико_ЗаказКлиента) Тогда 
			Префикс = "0"+Источник.Лико_ЗаказКлиента.НомерБезПрефикса;
			ПрефиксацияОбъектовСобытия.УстановитьПрефиксОрганизации(Источник, СтандартнаяОбработка, Префикс);
		КонецЕсли;	
	ИначеЕсли
		ТипИсточника = Тип("ДокументОбъект.ЗаказНаПроизводство2_2") Тогда
		Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца") Тогда 
			Если ЗначениеЗаполнено(Источник.ДокументОснование.Лико_ЗаказКлиента) Тогда
				Префикс = "0"+Источник.ДокументОснование.Лико_ЗаказКлиента.НомерБезПрефикса;
				ПрефиксацияОбъектовСобытия.УстановитьПрефиксОрганизации(Источник, СтандартнаяОбработка, Префикс);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ТипИсточника = Тип("ДокументОбъект.Лико_НесоответствующаяПродукция") Тогда
		Если Источник.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.ВнутреннийБрак Тогда 
			Префикс = "ВН";
		ИначеЕсли Источник.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.РекламацияКлиента Тогда 
			Префикс = "РЕ";
		ИначеЕсли Источник.ВидОперации = Перечисления.Лико_ВидыОперацийНесоответствияЗаказу.Прочее Тогда 
			Префикс = "ПР";
			
		КонецЕсли;	
		
		УстановитьПрефиксОрганизации(Источник, Префикс, Ложь, Истина);  //+Лико o.pukhova 31.01.2020
		
	КонецЕсли;
	
	//Начало изменений Иванова А.В.
	
	
	
	
	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Если Источник.Организация<>Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра
			И Источник.Организация<>Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
			
			Если Источник.Товары.Количество() > 0 Тогда
				Регион = Источник.Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Регион;
				Если ЗначениеЗаполнено(Регион) Тогда
					СтандартнаяОбработка = Ложь;
					Источник.Номер = ПолучитьНомерДокументаПоРегиону(Источник, Регион, Префикс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипИсточника = Тип("ДокументОбъект.Лико_ФормированиеПаллета")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПеремещениеПаллета")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаОтгрузку")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаТранспортировку")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_Инвентаризация")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_БланкЭтапа")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПередачаТоваров")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаказНаРаскрой")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_УстановкаВидаНастроечногоМатериала")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаДизайн")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаявкаНаИзготовлениеФорм")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗаданиеНаУдалениеГП")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПолучениеГПИзПроизводства")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ЗабраковкаМатериалов")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ВыполненныеРаботыМеждуОрганизациями")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ОтчетФормщика")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ФормированиеПаллета2_0")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.Лико_ПеремещениеПаллета2_0")

		
		Тогда
		ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс);
	КонецЕсли;
	
	Если ТипИсточника = Тип("ДокументОбъект.Лико_СчетНаОплатуКлиенту") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = ПроверитьДоговорВДокументеЛико_СчетНаОплатуКлиенту(Источник.Ссылка, Источник.Договор);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Источник.Номер = ПолучитьНомерДокументаДляСчетаНаОплатуКлиенту(Источник, Источник.Договор.Номер); 
	КонецЕсли;
	
	Если ТипИсточника = Тип("ДокументОбъект.ТС_ЗаявкаНаРемонтРабочихЦентров") Тогда
		Если ЗначениеЗаполнено(Источник.ПодразделениеПолучатель.ПрефиксДляНумерацииДокументов) Тогда
			Префикс = Источник.ПодразделениеПолучатель.ПрефиксДляНумерацииДокументов + "-"; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоНедоступностиРЦ(Источник, Отказ)
	
	// Сначала проверим, чтобы не было пересекающихся периодов доступности
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоступностьРабочихЦентровИнтервалыТекДокумент.Ссылка КАК Ссылка,
	|	ДоступностьРабочихЦентровИнтервалыТекДокумент.НомерСтроки КАК НомерСтроки,
	|	ДоступностьРабочихЦентровИнтервалыТекДокумент.РабочийЦентр КАК РабочийЦентр,
	|	НАЧАЛОПЕРИОДА(ДоступностьРабочихЦентровИнтервалыТекДокумент.ДатаГрафика, ДЕНЬ) КАК ДатаГрафика,
	|	ДоступностьРабочихЦентровИнтервалыТекДокумент.ВремяНачала КАК ВремяНачала,
	|	ДоступностьРабочихЦентровИнтервалыТекДокумент.ВремяОкончания КАК ВремяОкончания
	|ПОМЕСТИТЬ ВТ_ТекДокумент
	|ИЗ
	|	Документ.ДоступностьРабочихЦентров.Интервалы КАК ДоступностьРабочихЦентровИнтервалыТекДокумент
	|ГДЕ
	|	ДоступностьРабочихЦентровИнтервалыТекДокумент.Ссылка = &Ссылка
	|	И НЕ ДоступностьРабочихЦентровИнтервалыТекДокумент.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|	И НЕ ДоступностьРабочихЦентровИнтервалыТекДокумент.ДатаГрафика = ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекДокумент.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТекДокумент.РабочийЦентр КАК РабочийЦентр,
	|	ВТ_ТекДокумент.ДатаГрафика КАК ДатаГрафика,
	|	ВТ_ТекДокумент.ВремяНачала КАК ВремяНачала,
	|	ВТ_ТекДокумент.ВремяОкончания КАК ВремяОкончания,
	|	МАКСИМУМ(ВТ_ТекДокумент1.Ссылка) КАК ДокументПересечения
	|ИЗ
	|	ВТ_ТекДокумент КАК ВТ_ТекДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекДокумент КАК ВТ_ТекДокумент1
	|		ПО ВТ_ТекДокумент.Ссылка = ВТ_ТекДокумент1.Ссылка
	|			И ВТ_ТекДокумент.НомерСтроки <> ВТ_ТекДокумент1.НомерСтроки
	|			И ВТ_ТекДокумент.РабочийЦентр = ВТ_ТекДокумент1.РабочийЦентр
	|			И ВТ_ТекДокумент.ДатаГрафика = ВТ_ТекДокумент1.ДатаГрафика
	|			И (ВТ_ТекДокумент.ВремяНачала МЕЖДУ ВТ_ТекДокумент1.ВремяНачала И ВТ_ТекДокумент1.ВремяОкончания
	|				ИЛИ ВТ_ТекДокумент.ВремяОкончания МЕЖДУ ВТ_ТекДокумент1.ВремяНачала И ВТ_ТекДокумент1.ВремяОкончания
	|				ИЛИ ВТ_ТекДокумент1.ВремяНачала МЕЖДУ ВТ_ТекДокумент.ВремяНачала И ВТ_ТекДокумент.ВремяОкончания
	|				ИЛИ ВТ_ТекДокумент1.ВремяОкончания МЕЖДУ ВТ_ТекДокумент.ВремяНачала И ВТ_ТекДокумент.ВремяОкончания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекДокумент.НомерСтроки,
	|	ВТ_ТекДокумент.РабочийЦентр,
	|	ВТ_ТекДокумент.ДатаГрафика,
	|	ВТ_ТекДокумент.ВремяНачала,
	|	ВТ_ТекДокумент.ВремяОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекДокумент.РабочийЦентр КАК РабочийЦентр,
	|	НАЧАЛОПЕРИОДА(ВТ_ТекДокумент.ДатаГрафика, ДЕНЬ) КАК ДатаГрафика,
	|	ВТ_ТекДокумент.ВремяНачала КАК ВремяНачала,
	|	ВТ_ТекДокумент.ВремяОкончания КАК ВремяОкончания,
	|	МАКСИМУМ(ДоступностьРабочихЦентровИнтервалыОстальные.Ссылка) КАК ДокументПересечения
	|ИЗ
	|	ВТ_ТекДокумент КАК ВТ_ТекДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДоступностьРабочихЦентров.Интервалы КАК ДоступностьРабочихЦентровИнтервалыОстальные
	|		ПО ВТ_ТекДокумент.Ссылка <> ДоступностьРабочихЦентровИнтервалыОстальные.Ссылка
	|			И (ДоступностьРабочихЦентровИнтервалыОстальные.Ссылка.Проведен)
	|			И (НЕ ДоступностьРабочихЦентровИнтервалыОстальные.Ссылка.ПометкаУдаления)
	|			И ВТ_ТекДокумент.РабочийЦентр = ДоступностьРабочихЦентровИнтервалыОстальные.РабочийЦентр
	|			И (НАЧАЛОПЕРИОДА(ВТ_ТекДокумент.ДатаГрафика, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДоступностьРабочихЦентровИнтервалыОстальные.ДатаГрафика, ДЕНЬ))
	|			И (ВТ_ТекДокумент.ВремяНачала МЕЖДУ ДоступностьРабочихЦентровИнтервалыОстальные.ВремяНачала И ДоступностьРабочихЦентровИнтервалыОстальные.ВремяОкончания
	|				ИЛИ ВТ_ТекДокумент.ВремяОкончания МЕЖДУ ДоступностьРабочихЦентровИнтервалыОстальные.ВремяНачала И ДоступностьРабочихЦентровИнтервалыОстальные.ВремяОкончания
	|				ИЛИ ДоступностьРабочихЦентровИнтервалыОстальные.ВремяНачала МЕЖДУ ВТ_ТекДокумент.ВремяНачала И ВТ_ТекДокумент.ВремяОкончания
	|				ИЛИ ДоступностьРабочихЦентровИнтервалыОстальные.ВремяОкончания МЕЖДУ ВТ_ТекДокумент.ВремяНачала И ВТ_ТекДокумент.ВремяОкончания)
	|ГДЕ
	|	НЕ ВТ_ТекДокумент.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|	И НЕ ВТ_ТекДокумент.ДатаГрафика = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекДокумент.РабочийЦентр,
	|	НАЧАЛОПЕРИОДА(ВТ_ТекДокумент.ДатаГрафика, ДЕНЬ),
	|	ВТ_ТекДокумент.ВремяНачала,
	|	ВТ_ТекДокумент.ВремяОкончания";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапроса[РезультатыЗапроса.Количество()-2].Выбрать(); // документ пересекается сам с собой
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщить("Не удалось провести документ """ + Источник.Ссылка + """: график """ + Выборка.РабочийЦентр + " / " + Выборка.ДатаГрафика + " / " + Формат(Выборка.ВремяНачала, "ДФ=HH:mm:ss") + " / " + Формат(Выборка.ВремяОкончания, "ДФ=HH:mm:ss") + """ пересекается с графиком документа """ + Выборка.ДокументПересечения + """");
	КонецЦикла;
	Выборка = РезультатыЗапроса[РезультатыЗапроса.Количество()-1].Выбрать(); // документ пересекается с другими документами
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщить("Не удалось провести документ """ + Источник.Ссылка + """: график """ + Выборка.РабочийЦентр + " / " + Выборка.ДатаГрафика + " / " + Формат(Выборка.ВремяНачала, "ДФ=HH:mm:ss") + " / " + Формат(Выборка.ВремяОкончания, "ДФ=HH:mm:ss") + """ пересекается с графиком документа """ + Выборка.ДокументПересечения + """");
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоступностьРабочихЦентровИнтервалы.РабочийЦентр КАК РабочийЦентр,
	|	НАЧАЛОПЕРИОДА(ДоступностьРабочихЦентровИнтервалы.ДатаГрафика, ДЕНЬ) КАК ДатаГрафика,
	|	ДоступностьРабочихЦентровИнтервалы.ВремяНачала КАК ВремяНачала,
	|	ДоступностьРабочихЦентровИнтервалы.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	Документ.ДоступностьРабочихЦентров.Интервалы КАК ДоступностьРабочихЦентровИнтервалы
	|ГДЕ
	|	ДоступностьРабочихЦентровИнтервалы.Ссылка = &Ссылка
	|	И НЕ ДоступностьРабочихЦентровИнтервалы.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|	И НЕ ДоступностьРабочихЦентровИнтервалы.ДатаГрафика = ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоступностьРабочихЦентровИнтервалы.РабочийЦентр,
	|	ДоступностьРабочихЦентровИнтервалы.ДатаГрафика,
	|	ДоступностьРабочихЦентровИнтервалы.ВремяНачала,
	|	ДоступностьРабочихЦентровИнтервалы.ВремяОкончания
	|ИТОГИ ПО
	|	РабочийЦентр,
	|	ДатаГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаРабочийЦентр = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВремяНачалоДня = Дата('00010101000000');
	ВремяКонецДня = Дата('00010101235959');
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("РабочийЦентр");
	Таблица.Колонки.Добавить("Начало");
	Таблица.Колонки.Добавить("Окончание");
	
	Пока ВыборкаРабочийЦентр.Следующий() Цикл
		ВыборкаДатаГрафика = ВыборкаРабочийЦентр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДатаГрафика.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаДатаГрафика.Выбрать();
			СчетчикПериодовНедоступностиЗаДень = 0;
			СтруктураПредыдущейСтроки = Новый Структура("ВремяНачала,ВремяОкончания");
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если СчетчикПериодовНедоступностиЗаДень > 0 Тогда
					// Первым делом нужно скорректировать предыдущую запись
					КорСтрока = Таблица[Таблица.Количество()-1];
					КорСтрока.Окончание = ВыборкаДетальныеЗаписи.ДатаГрафика + (ВыборкаДетальныеЗаписи.ВремяНачала - ВремяНачалоДня) - 1;
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.ВремяНачала <> ВремяНачалоДня И СчетчикПериодовНедоступностиЗаДень = 0 Тогда
					НоваяСтрока = Таблица.Добавить();
					НоваяСтрока.РабочийЦентр = ВыборкаДетальныеЗаписи.РабочийЦентр;
					НоваяСтрока.Начало = ВыборкаДетальныеЗаписи.ДатаГрафика;
					НоваяСтрока.Окончание = ВыборкаДетальныеЗаписи.ДатаГрафика + (ВыборкаДетальныеЗаписи.ВремяНачала - ВремяНачалоДня) - 1;
					СчетчикПериодовНедоступностиЗаДень = СчетчикПериодовНедоступностиЗаДень + 1;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ВремяОкончания = ВремяКонецДня Тогда
					
				Иначе
					НоваяСтрока = Таблица.Добавить();
					НоваяСтрока.РабочийЦентр = ВыборкаДетальныеЗаписи.РабочийЦентр;
					НоваяСтрока.Начало = ВыборкаДетальныеЗаписи.ДатаГрафика + (ВыборкаДетальныеЗаписи.ВремяОкончания - ВремяНачалоДня);
					НоваяСтрока.Окончание = КонецДня(ВыборкаДетальныеЗаписи.ДатаГрафика); // При необходимости скорректируем в следущей итерации
					СчетчикПериодовНедоступностиЗаДень = СчетчикПериодовНедоступностиЗаДень + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	//Если Таблица.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Набор = Источник.Движения.Лико_НедоступностьРабочихЦентров;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры

Процедура Подписка_Лико_ПередОтменойПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт // --> Начало Лико Субботин 10.03.22
	//Начало изменений Иванова А.В. 20230621 - актуализация каждый раз
	//Если Источник.ДополнительныеСвойства.Свойство("Лико_Отгрузки") И Источник.ДополнительныеСвойства.Лико_Отгрузки.Количество() > 0 Тогда
	//	НаборЗаписейОтгрузки = РегистрыНакопления.Лико_Отгрузки2.СоздатьНаборЗаписей();
	//	НаборЗаписейОтгрузки.Отбор.Регистратор.Установить(Источник.Ссылка);
	//	НаборЗаписейОтгрузки.Загрузить(Источник.ДополнительныеСвойства.Лико_Отгрузки); 
	//	НаборЗаписейОтгрузки.Записать();  
	//КонецЕсли;
    //Конец изменений Иванова А.В. 20230621 - актуализация каждый раз

КонецПроцедуры // <-- Конец Лико Субботин 10.03.22

#КонецОбласти


#Область ОтладочныеМетоды
//Получает времменые таблицы запроса
//Пример: Лико_Дополнительно.ПолучитьВТЗапроса(Запрос.МенеджерВременныхТаблиц) 
Функция ПолучитьВТЗапроса(МенеджерВременныхТаблиц) Экспорт
	Структура = Новый Структура;
	
	Для каждого Таблица Из МенеджерВременныхТаблиц.Таблицы Цикл
		
		Структура.Вставить(Таблица.ПолноеИмя,
		ОбщегоНазначенияУТ.ПоказатьВременнуюТаблицу(МенеджерВременныхТаблиц,
		Таблица.ПолноеИмя));
		
	КонецЦикла;
	Возврат Структура;	
КонецФункции


#КонецОбласти


#Область РегламентныеЗадания

Процедура Лико_ВосстановлениеЭтаповПроизводства(Ссылка=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ДобавитьВРегистрОшибок(Ссылка);
	КонецЕсли;
	
	Лико_ОбщегоНазначенияСервер.ВосстановлениеЭтапов(Ссылка);
	
КонецПроцедуры


Процедура ДобавитьВРегистрОшибок(ЗакрытиеБланка)  //+Лико m.shenderov 14.02.2018
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.Лико_ОшибкиЗакрытияБланков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗакрытиеБланка.Установить(ЗакрытиеБланка);
	НоваяЗапись= НаборЗаписей.Добавить();
	НоваяЗапись.ЗакрытиеБланка=ЗакрытиеБланка;
	НаборЗаписей.Записать(Истина);
	
	
	
КонецПроцедуры //-Лико m.shenderov 14.02.2018





Процедура ВосстановлениеЭтаповФоновое(Ссылка) Экспорт  //+Лико m.shenderov 12.02.2018
	НаборЗаписей = РегистрыСведений.Лико_ОшибкиЗакрытияБланков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗакрытиеБланка.Установить(Ссылка);
	НоваяЗапись=НаборЗаписей.Добавить();
	НоваяЗапись.ЗакрытиеБланка=Ссылка;
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.Лико_ФоновыеЗадания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лико_Документ.Установить(Ссылка);
	НоваяЗапись=НаборЗаписей.Добавить();
	НоваяЗапись.Лико_Документ=Ссылка;
	
	
	НаборЗаписей.Записать(Истина);
	
	
	Параметры = Новый Массив;
	Параметры.Добавить(Ссылка);
	
	ФоновыеЗадания.Выполнить("Лико_Дополнительно.Лико_ВосстановлениеЭтаповПроизводства", 
	Параметры, Новый УникальныйИдентификатор, "Восстановление этапа");    
	
	
КонецПроцедуры //-Лико m.shenderov 12.02.2018


Процедура ВосстановлениеЭтаповАсинхронно() Экспорт  //+Лико m.shenderov 12.02.2018
	КоличествоФЗ=Справочники.Лико_НастройкаФоновыхЗаданий.Основной.КоличествоФоновыхЗаданий;	
	ЗапуститьЗаново=Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ОшибкиЗакрытияБланков.ЗакрытиеБланка КАК Ссылка
	|ИЗ
	|	РегистрСведений.Лико_ОшибкиЗакрытияБланков КАК Лико_ОшибкиЗакрытияБланков
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_ОшибкиЗакрытияБланков.ЗакрытиеБланка.Дата";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Лико_ВосстановлениеЭтаповПроизводства(Выборка.Ссылка);
		//Если КоличествоФЗ<ТекущееКоличествоФЗ() Тогда
		//	ЗапуститьЗаново=Истина;
		//	Прервать;
		//Иначе
		//	ВосстановлениеЭтаповФоновое(Выборка.Ссылка);
		//КонецЕсли;		
	КонецЦикла; 
	
	
	Если ЗапуститьЗаново Тогда
		//ЗапутитьВосстановление();
		
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 12.02.2018

Процедура ЗапутитьВосстановление () //+Лико m.shenderov 13.02.2018
	
	Лико_Дополнительно.ВосстановлениеЭтаповАсинхронно();
	
	
КонецПроцедуры //-Лико m.shenderov 13.02.2018





Функция ТекущееКоличествоФЗ() //+Лико m.shenderov 12.02.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(1) КАК Количество
	|ИЗ
	|	РегистрСведений.Лико_ФоновыеЗадания КАК Лико_ФоновыеЗадания";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Количество) Тогда
			Возврат Выборка.Количество; 
		КонецЕсли;
		
	КонецЦикла; 
	Возврат 0;
КонецФункции //-Лико m.shenderov 12.02.2018 




//+Лико o.pukhova 07.01.18
Процедура ВыгрузкаРегистраПарметрыШтампа() Экспорт
	
	// --> Начало Лико Ефимов ЕВВ 01.03.2018 
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы(); //Пример: Srvr="test-1c";Ref="erp_demo";
	ДлинаСтроки = СтрДлина(СтрокаСоединения);
	//Отрежем имя базы - справа до второй кавычки
	ИмяБазы = "";
	КолКавычек = 0;
	Для сч=1 По ДлинаСтроки Цикл
		ТекСимвол = Сред(СтрокаСоединения, ДлинаСтроки-сч+1, 1);
		Если КолКавычек = 1 И ТекСимвол <> Символ(34) Тогда
			ИмяБазы = ТекСимвол + ИмяБазы;
		КонецЕсли;
		
		Если ТекСимвол = Символ(34) Тогда
			КолКавычек = КолКавычек + 1;
		КонецЕсли;
		Если КолКавычек = 2 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ВРег(ИмяБазы) <> ВРег("okil_erp") Тогда
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 01.03.2018
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Артикул КАК Артикул,
	|	Лико_ПараметрыШтампа.Номенклатура.Наименование КАК Номенклатура,
	|	Лико_ПараметрыШтампа.ТипШтампа КАК ТипШтампа,
	|	Лико_ПараметрыШтампа.ВидШтампа.Наименование КАК ВидШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка.Размер / 1000 КАК ШиринаРулона,
	|	Лико_ПараметрыШтампа.ШагПечати КАК ШагПечати,
	|	Лико_ПараметрыШтампа.ШагПоНарезке КАК ШагПоНарезке,
	|	Лико_ПараметрыШтампа.ШагПоРаппорту КАК ШагПоРаппорту,
	|	Лико_ПараметрыШтампа.Ручьи КАК Ручьи,
	|	Лико_ПараметрыШтампа.Z.Наименование КАК Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки / 1000 КАК ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки / 1000 КАК ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКонтрЭтикетки КАК ДлинаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКольеретки КАК ДлинаКольеретки,
	|	Лико_ПараметрыШтампа.ШиринаКонтрЭтикетки КАК ШиринаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаКольеретки КАК ШиринаКольеретки,
	|	Лико_ПараметрыШтампа.НаправлениеНамотки.Наименование КАК НаправлениеНамотки,
	|	Лико_ПараметрыШтампа.Цена КАК Цена,
	|	Лико_ПараметрыШтампа.Материал КАК Материал,
	|	Лико_ПараметрыШтампа.РучьиМин КАК РучьиМин,
	|	Лико_ПараметрыШтампа.ПорядковыйНомерШтанцыНаВалу КАК ПорядковыйНомерШтанцыНаВалу,
	|	Лико_ПараметрыШтампа.ШиринаПоНожам КАК ШиринаПоНожам,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками,
	|	Лико_ПараметрыШтампа.A КАК A,
	|	Лико_ПараметрыШтампа.B КАК B,
	|	Лико_ПараметрыШтампа.C КАК C,
	|	Лико_ПараметрыШтампа.Rz КАК Rz,
	|	Лико_ПараметрыШтампа.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.Z.КоличествоЗубьев = 0
	|				ИЛИ Лико_ПараметрыШтампа.Z.КоличествоЗубьев ЕСТЬ NULL
	|			ТОГДА Лико_ПараметрыШтампа.Нарезка.Размер / 1000 * Лико_ПараметрыШтампа.ШагПечати * 10000
	|		ИНАЧЕ ВЫРАЗИТЬ((2 + Лико_ПараметрыШтампа.Нарезка.Размер / 1000 * 100) * (2.5 + Лико_ПараметрыШтампа.Z.КоличествоЗубьев * 0.003175 * 100) КАК ЧИСЛО(15, 0))
	|	КОНЕЦ КАК ПлощадьКлише,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.Нарезка.Размер / 1000 > 0
	|			ТОГДА ВЫРАЗИТЬ(1000 * Лико_ПараметрыШтампа.ЭтикетокНаЛисте / (Лико_ПараметрыШтампа.Z.КоличествоЗубьев * 3.175 * (Лико_ПараметрыШтампа.Нарезка.Размер / 1000)) КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ШтВМ2,
	|	1 КАК Колво,
	|	Лико_ПараметрыШтампа.Z КАК Z1,
	|	Лико_ПараметрыШтампа.Z.КоличествоЗубьев КАК Зубьев
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	НЕ Лико_ПараметрыШтампа.Артикул ЕСТЬ NULL
	|	И Лико_ПараметрыШтампа.Артикул <> """"
	|	И Лико_ПараметрыШтампа.Артикул <> ""0""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Unilever""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Z 101""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Z 72""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Carlsberg""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Z 95 AN 39509/01""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Z 95 X 347/1""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Z 96""
	|	И Лико_ПараметрыШтампа.Артикул <> ""Z 95""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_ПараметрыШтампа.Артикул";
	
	ПараметрыШтампаВыгрузка = Запрос.Выполнить().Выгрузить();
	МассивДляУдаления = Новый Массив;
	Для каждого стрПараметр Из ПараметрыШтампаВыгрузка Цикл
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.IgnoreCase = Истина; 
		RegExp.Global = Истина;  
		RegExp.MultiLine = Истина;	    
		RegExp.Pattern = "[^0-9]"; 	
		стрПараметр.Артикул=RegExp.Replace(стрПараметр.Артикул, ""); 
		стрПараметр.Артикул = СокрЛП(стрПараметр.Артикул);
		Если стрПараметр.Артикул = "" Тогда
			МассивДляУдаления.Добавить(стрПараметр);
		КонецЕсли;
	КонецЦикла;	   
	
	Для каждого Строка из МассивДляУдаления Цикл
		ПараметрыШтампаВыгрузка.Удалить(Строка);
	КонецЦикла;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("Лико_ВыгрузкаПарметровШтампа");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строки");
	Для каждого Стр Из ПараметрыШтампаВыгрузка Цикл
		ОбластьСтрока.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	Попытка
		Файл = "\\okil\dfs\04.Work\03.Закупки\02.Материалы\ВыгрузкаПараметровШтампаЕРП.xls";
		Если ФайлСуществует(Файл) Тогда
			УдалитьФайлы(Файл);
			ТабДок.Записать(Файл, ТипФайлаТабличногоДокумента.XLS);
		Иначе 
			ТабДок.Записать(Файл, ТипФайлаТабличногоДокумента.XLS);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Попытка сохранить файл Excel",,,,"Файл не сохранен!"+ Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура Лико_УстановкаКатегорииУОбъектовНоменклатуры() Экспорт
	ВыполняемаяОбработка=НайтиВО("Проставление категории в объекте номенклатуры");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Объект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ВыполняемаяОбработка);
	Объект.УстановитьКатегорию();
	
	
КонецПроцедуры
//-Лико o.pukhova 07.01.18

Функция НайтиВО(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции

Процедура Лико_БлокированиеСерийНаМашинахПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(Источник.Организация,"Лико_БлокированиеСерийНаМашинах")) 
		и не Источник.ДополнительныеСвойства.Свойство("ЭтоТачПадРЦ")   Тогда
		Массив= Новый Массив; 		
		Если ТипЗнч(Источник)=Тип("ДокументОбъект.Лико_БланкЭтапа") Тогда		
			Для каждого Товар Из Источник.Выпуск Цикл
				Массив.Добавить(Товар.Серия);
			КонецЦикла;
			Для каждого Товар Из Источник.Ссылка.Выпуск Цикл
				Массив.Добавить(Товар.Серия);
			КонецЦикла;		
			
			Для каждого Товар Из Источник.Товары Цикл
				Если Товар.Списать Тогда
					Массив.Добавить(Товар.Серия);
				КонецЕсли;
			КонецЦикла;
			Для каждого Товар Из Источник.Ссылка.Товары Цикл
				Если Товар.Списать Тогда
					Массив.Добавить(Товар.Серия);
				КонецЕсли;
			КонецЦикла; 			
		Иначе 		
			Для каждого Товар Из Источник.Товары Цикл
				Массив.Добавить(Товар.Серия);
			КонецЦикла;
			Для каждого Товар Из Источник.Ссылка.Товары Цикл
				Массив.Добавить(Товар.Серия);
			КонецЦикла;		
		КонецЕсли;		
		
		МассивСерий=Лико_Дополнительно.ПроверитьИспользованиеСерийНаТачпаде(Массив, Истина);
		Если МассивСерий.Количество()>0 Тогда
			Отказ=Истина;
			Для каждого СтруктураСерииСРЦ Из МассивСерий Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = Строка(СтруктураСерииСРЦ.Серия)+" используется на тачпаде """ + СтруктураСерииСРЦ.РЦ + """";
				Сообщение.Сообщить();				
			КонецЦикла;			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры



Функция ПриходПоИнтеркампани(глОрганизация,глКонтрагент) Экспорт //+Лико m.shenderov 19/01/2020
	УстановитьПривилегированныйРежим(Истина);
	
	//глОрганизация-покупатель
	//глКонтрагент-продавец
	Организация=Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииДополнительныеРеквизиты.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации.ДополнительныеРеквизиты КАК ОрганизацииДополнительныеРеквизиты
	|ГДЕ
	|	ОрганизацииДополнительныеРеквизиты.Значение = &Контрагент
	|	И ОрганизацииДополнительныеРеквизиты.Свойство.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя","КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2" );
	Запрос.УстановитьПараметр("Контрагент",глКонтрагент );                                                                            
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Организация=Выборка.Организация; 
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Контрагент=УправлениеСвойствами.ЗначениеСвойства(глОрганизация,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаполениеРегламентированныхДокументов.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.Лико_ЗаполениеРегламентированныхДокументов КАК Лико_ЗаполениеРегламентированныхДокументов
		|ГДЕ
		|	Лико_ЗаполениеРегламентированныхДокументов.Организация = &Организация
		|	И Лико_ЗаполениеРегламентированныхДокументов.Интеркампани
		|	И Лико_ЗаполениеРегламентированныхДокументов.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Организация",Организация );
		Запрос.УстановитьПараметр("Контрагент",Контрагент );
		Возврат Не Запрос.Выполнить().Пустой();			
	КонецЕсли;
	
	Возврат ложь;
	
	
КонецФункции //-Лико m.shenderov 19/01/2020

#КонецОбласти

#Область kit

//Заполняет Коллекция по найденым штрихкодам
// Описание:
// Параметры Коллекция -Соответствие-
// Параметры ШтрихКоды -Массив- 
//
Процедура ЗаполнениеКоллекцииОбъектовНоменклатурыПоШтрихКоду(Коллекция, ШтрихКоды) Экспорт //++ kit:mih web 16.07.21
	
	МассивКодов = Новый Массив();
	
	Для каждого ШК Из ШтрихКоды Цикл
		
		Результат=Лико_Дополнительно.РасшифроватьШК(ШК);
		
		Если Не ЗначениеЗаполнено(Результат.Ошибка) И
			Результат.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий Тогда	
			МассивКодов.Добавить(Число(Сред(ШК, 8, 7)));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат.Ошибка) И
			Результат.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры Тогда	
			МассивКодов.Добавить(Число(Сред(ШК, 18, 7)));	
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивКодов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЯССМ_ОбъектыНоменклатуры.Количество КАК Количество,
	|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия,
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка,
	|	ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК Числитель,
	|	ЯССМ_ОбъектыНоменклатуры.Нарезка КАК Нарезка
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ЯССМ_ОбъектыНоменклатуры.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
	|			И ЯССМ_ОбъектыНоменклатуры.Характеристика = ВариантыКомплектацииНоменклатуры.Характеристика
	|			И (ВариантыКомплектацииНоменклатуры.Основной)
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Код В(&Коды)";
	Запрос.УстановитьПараметр("Коды", МассивКодов);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Для Каждого Запись Из Коллекция Цикл	
			Запись.Значение.Вставить("ОШИБКА", "Ошибка обнаружения объекта номенклатуры");	
		КонецЦикла;
			
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекДанные = Коллекция.Получить(ВРег(СокрЛП(Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьКороткийШтрихКод(Выборка.Ссылка))));
		Если ТекДанные = Неопределено Тогда
			ТекДанные = Коллекция.Получить(ВРег(СокрЛП(Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьШтрихКод(Выборка.Ссылка))));
		КонецЕсли;		
		
		ТекДанные.Вставить("НОМЕНКЛАТУРА", Выборка.Номенклатура);
		ТекДанные.Вставить("КОЛИЧЕСТВО",   Выборка.Количество);
		ТекДанные.Вставить("СЕРИЯ",        Выборка.Серия);
		ТекДанные.Вставить("ЧИСЛИТЕЛЬ",    Выборка.Числитель); 		
		ТекДанные.Вставить("НАРЕЗКА",      Выборка.Нарезка);
		
	КонецЦикла; 

КонецПроцедуры //-- kit:mih web 16.07.21 

//Проверяет должность физ лица полученного после проверки пропуска, если это Технолог - Тогда Истина иначе Ложь
Функция ПроверкаДолжностиФизЛица(ФизЛицо) Экспорт //++ kit:mih web 12.07.21
	
	УстановитьПривилегированныйРежим(Истина);
	ДоступРазрешен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК ТекущаяДолжность
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДоступРазрешен = Выборка.ТекущаяДолжность = Справочники.Должности.НайтиПоНаименованию("Технолог");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Новый Структура("ДоступРазрешен,СотрудникПринявшийРешение", ДоступРазрешен, ФизЛицо);
	
КонецФункции //-- kit:mih web 12.07.21

//Поиск документа Забраковки материалов по ДокументуОснование
Функция ПоискДокументаЗабраковки(ДокументОснование) Экспорт //++ kit:mih web 16.07.21
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗабраковкаМатериалов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_ЗабраковкаМатериалов КАК Лико_ЗабраковкаМатериалов
		|ГДЕ
		|	Лико_ЗабраковкаМатериалов.ДокументОснование = &ДокументОснование
		|	И НЕ Лико_ЗабраковкаМатериалов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
КонецФункции

//Подключение внешней обработки Обработка ""ТС Рабочий стол"", возвращает ее Имя 
Функция ЗабраковкаМатериаловНаСервере() Экспорт //++ kit:mih web 12.07.21
	Возврат ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Обработка ""ТС Рабочий стол"""));
КонецФункции //-- kit:mih web 12.07.21

//Принимает ссылку на документ Лико_ЗабраковкаМатериалов
//Возвращает Структуру - Решение
// 					   - ТипВозвратаПоставщику
Функция ПолучитьДанныеДляОтправкиПисьмаЗаброковкиМатериалов(СсылкаНаДокумент,СтрокаОснастки) Экспорт //++ kit:mih web 16.07.21
	
	СтруктураДанных = Новый Структура();
		
	Запрос = Новый Запрос;
	// --> Начало Лико Яцун 31.08.2022
	Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда
	// <-- Конец Лико Яцун 31.08.2022	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗабраковкаМатериаловМатериалы.Номенклатура КАК Номенклатура,
		|	Лико_ЗабраковкаМатериаловМатериалы.Серия КАК Серия,
		|	Лико_ЗабраковкаМатериаловМатериалы.Количество КАК Количество,
		|	Лико_ЗабраковкаМатериаловМатериалы.МетражПМ КАК МетражПМ,
		|	Лико_ЗабраковкаМатериаловМатериалы.МетражКВМ КАК МетражКВМ,
		|	Лико_ЗабраковкаМатериаловМатериалы.Нарезка.Размер КАК Нарезка
		|ИЗ
		|	Документ.Лико_ЗабраковкаМатериалов.Материалы КАК Лико_ЗабраковкаМатериаловМатериалы
		|ГДЕ
		|	Лико_ЗабраковкаМатериаловМатериалы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_ЗабраковкаМатериаловМатериалы.Серия КАК Серия,
		|	ТоварыВЯчейках.Ячейка.Лико_Площадка КАК ПлощадкаСкладаОстатков,
		|	Лико_ЗабраковкаМатериаловМатериалы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТПлощадка
		|ИЗ
		|	Документ.Лико_ЗабраковкаМатериалов.Материалы КАК Лико_ЗабраковкаМатериаловМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|		ПО Лико_ЗабраковкаМатериаловМатериалы.Серия = ТоварыВЯчейках.Серия
		|ГДЕ
		|	Лико_ЗабраковкаМатериаловМатериалы.Ссылка = &Ссылка
		|	И ТоварыВЯчейках.Ячейка.Лико_Площадка <> ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ПустаяСсылка)
		|	И ТоварыВЯчейках.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыВЯчейках.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ЗабраковкаМатериалов.Номер КАК Номер,
		|	Лико_ЗабраковкаМатериалов.Дата КАК Дата,
		|	Лико_ЗабраковкаМатериалов.Организация КАК Организация,
		|	Лико_ЗабраковкаМатериалов.РабочийЦентр КАК РабочийЦентр,
		|	Лико_ЗабраковкаМатериалов.Решение КАК Решение,
		|	ЕСТЬNULL(Лико_РешенияПоБракуМатериаловКонтакты.Контакт, """") КАК КонтактДляОтправки,
		|	Лико_ЗабраковкаМатериалов.Решение.Наименование КАК РешениеНаименование,
		|	Лико_ЗабраковкаМатериалов.МестоОбнаружения КАК МестоОбнаружения,
		|	Лико_ЗабраковкаМатериалов.СотрудникОбнаружившийБрак КАК СотрудникОбнаружившийБрак,
		|	Лико_ЗабраковкаМатериалов.Дефект КАК Дефект,
		|	Лико_ЗабраковкаМатериалов.ОписаниеДефекта КАК ОписаниеДефекта,
		|	Лико_ЗабраковкаМатериалов.МетражПМ КАК МетражПМ,
		|	Лико_ЗабраковкаМатериалов.КомментарийКРешению КАК КомментарийКРешению,
		|	Лико_ЗабраковкаМатериалов.ОбразцыПриложеныКНП КАК ОбразцыПриложеныКНП,
		|	Лико_ЗабраковкаМатериалов.ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
		|	Лико_ЗабраковкаМатериалов.СотрудникПринявшийРешение КАК СотрудникПринявшийРешение,
		|	ЕСТЬNULL(Лико_ЗабраковкаМатериалов.ЗаказКлиента.Площадка, ВТПлощадка.ПлощадкаСкладаОстатков) КАК Площадка
		|ИЗ
		|	Документ.Лико_ЗабраковкаМатериалов КАК Лико_ЗабраковкаМатериалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_РешенияПоБракуМатериалов.Контакты КАК Лико_РешенияПоБракуМатериаловКонтакты
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПлощадка КАК ВТПлощадка
		|			ПО Лико_РешенияПоБракуМатериаловКонтакты.Площадка = ВТПлощадка.ПлощадкаСкладаОстатков
		|		ПО Лико_ЗабраковкаМатериалов.Организация = Лико_РешенияПоБракуМатериаловКонтакты.Организация
		|			И Лико_ЗабраковкаМатериалов.Решение = Лико_РешенияПоБракуМатериаловКонтакты.Ссылка
		|			И (Лико_РешенияПоБракуМатериаловКонтакты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			И (ВЫБОР
		|				КОГДА Лико_РешенияПоБракуМатериаловКонтакты.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА Лико_ЗабраковкаМатериалов.ЗаказКлиента.Площадка.Организация <> Лико_ЗабраковкаМатериалов.Организация
		|						ИЛИ Лико_ЗабраковкаМатериалов.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|					ТОГДА Лико_РешенияПоБракуМатериаловКонтакты.Площадка = ВТПлощадка.ПлощадкаСкладаОстатков
		|				ИНАЧЕ Лико_РешенияПоБракуМатериаловКонтакты.Площадка = Лико_ЗабраковкаМатериалов.ЗаказКлиента.Площадка
		|			КОНЕЦ)
		|ГДЕ
		|	Лико_ЗабраковкаМатериалов.Ссылка = &Ссылка";
	// --> Начало Лико Яцун 30.08.2022	
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗабраковкаОснасткиТовары.Номенклатура КАК Номенклатура,
		|	Лико_ЗабраковкаОснасткиТовары.Серия КАК Серия,
		|	Лико_ЗабраковкаОснасткиТовары.Количество КАК Количество,
		|	Лико_ЗабраковкаОснасткиТовары.ОснасткаПокупная КАК ОснасткаПокупная,
		|	Лико_ЗабраковкаОснасткиТовары.ЭтоПерваяВыдачаОснастки КАК ЭтоПерваяВыдачаОснастки,
		|	Лико_ЗабраковкаОснасткиТовары.Пробег КАК Пробег,
		|	Лико_ЗабраковкаОснасткиТовары.ПодРекламацию КАК ПодРекламацию,
		|	Лико_ЗабраковкаОснасткиТовары.Форма.Код КАК ФормаКод
		|ИЗ
		|	Документ.Лико_ЗабраковкаОснастки.Товары КАК Лико_ЗабраковкаОснасткиТовары
		|ГДЕ
		|	Лико_ЗабраковкаОснасткиТовары.Ссылка = &Ссылка
		|	И Лико_ЗабраковкаОснасткиТовары.Серия = &Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_ЗабраковкаОснасткиТовары.Серия КАК Серия,
		|	Лико_ЗабраковкаОснасткиТовары.Ссылка КАК Ссылка,
		|	ТоварыВЯчейках.Ячейка.Лико_Площадка КАК ПлощадкаСкладаОстатков
		|ПОМЕСТИТЬ ВТПлощадка
		|ИЗ
		|	Документ.Лико_ЗабраковкаОснастки.Товары КАК Лико_ЗабраковкаОснасткиТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|		ПО Лико_ЗабраковкаОснасткиТовары.Серия = ТоварыВЯчейках.Серия
		|ГДЕ
		|	Лико_ЗабраковкаОснасткиТовары.Ссылка = &Ссылка
		|	И Лико_ЗабраковкаОснасткиТовары.Серия = &Серия
		|	И ТоварыВЯчейках.Ячейка.Лико_Площадка <> ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ПустаяСсылка)
		|	И ТоварыВЯчейках.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыВЯчейках.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ЗабраковкаОснастки.Номер КАК Номер,
		|	Лико_ЗабраковкаОснастки.Дата КАК Дата,
		|	Лико_ЗабраковкаОснастки.Организация КАК Организация,
		|	Лико_ЗабраковкаОснастки.РабочийЦентр КАК РабочийЦентр,
		|	Лико_ЗабраковкаОснасткиТовары.Решение КАК Решение,
		|	ЕСТЬNULL(Лико_РешенияПоБракуОснасткиКонтакты.Контакт, """") КАК КонтактДляОтправки,
		|	Лико_ЗабраковкаОснасткиТовары.Решение.Наименование КАК РешениеНаименование,
		|	Лико_ЗабраковкаОснастки.СотрудникОбнаружившийБрак КАК СотрудникОбнаружившийБрак,
		|	Лико_ЗабраковкаОснасткиТовары.Дефект КАК Дефект,
		|	Лико_ЗабраковкаОснасткиТовары.ОписаниеДефекта КАК ОписаниеДефекта,
		|	Лико_ЗабраковкаОснасткиТовары.КомментарийКРешению КАК КомментарийКРешению,
		|	Лико_ЗабраковкаОснастки.ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
		|	Лико_ЗабраковкаОснастки.СотрудникПринявшийРешение КАК СотрудникПринявшийРешение,
		|	ЕСТЬNULL(Лико_ЗабраковкаОснастки.ЗаказКлиента.Площадка, ВТПлощадка.ПлощадкаСкладаОстатков) КАК Площадка
		|ИЗ
		|	Документ.Лико_ЗабраковкаОснастки КАК Лико_ЗабраковкаОснастки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_РешенияПоБракуОснастки.Контакты КАК Лико_РешенияПоБракуОснасткиКонтакты
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПлощадка КАК ВТПлощадка
		|			ПО Лико_РешенияПоБракуОснасткиКонтакты.Площадка = ВТПлощадка.ПлощадкаСкладаОстатков
		|		ПО Лико_ЗабраковкаОснастки.Организация = Лико_РешенияПоБракуОснасткиКонтакты.Организация
		|			И (Лико_РешенияПоБракуОснасткиКонтакты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			И (ВЫБОР
		|				КОГДА Лико_РешенияПоБракуОснасткиКонтакты.Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА Лико_ЗабраковкаОснастки.ЗаказКлиента.Площадка.Организация <> Лико_ЗабраковкаОснастки.Организация
		|						ИЛИ Лико_ЗабраковкаОснастки.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|					ТОГДА Лико_РешенияПоБракуОснасткиКонтакты.Площадка = ВТПлощадка.ПлощадкаСкладаОстатков
		|				ИНАЧЕ Лико_ЗабраковкаОснастки.ЗаказКлиента.Площадка = Лико_РешенияПоБракуОснасткиКонтакты.Площадка
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ЗабраковкаОснастки.Товары КАК Лико_ЗабраковкаОснасткиТовары
		|		ПО (Лико_ЗабраковкаОснасткиТовары.Ссылка = Лико_ЗабраковкаОснастки.Ссылка)
		|ГДЕ
		|	Лико_ЗабраковкаОснастки.Ссылка = &Ссылка
		|	И Лико_ЗабраковкаОснасткиТовары.Серия = &Серия
		|	И Лико_ЗабраковкаОснасткиТовары.Решение = &Решение
		|	И Лико_РешенияПоБракуОснасткиКонтакты.Ссылка = &Решение
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ЗабраковкаОснастки.Организация,
		|	Лико_ЗабраковкаОснастки.Дата,
		|	Лико_ЗабраковкаОснастки.РабочийЦентр,
		|	Лико_ЗабраковкаОснасткиТовары.Решение,
		|	Лико_ЗабраковкаОснастки.СотрудникОбнаружившийБрак,
		|	Лико_ЗабраковкаОснастки.СотрудникПринявшийРешение,
		|	Лико_ЗабраковкаОснасткиТовары.ОписаниеДефекта,
		|	Лико_ЗабраковкаОснасткиТовары.Дефект,
		|	Лико_ЗабраковкаОснасткиТовары.КомментарийКРешению,
		|	Лико_ЗабраковкаОснастки.ЗаказКлиента.НомерБезПрефикса,
		|	Лико_ЗабраковкаОснастки.Номер,
		|	Лико_ЗабраковкаОснасткиТовары.Решение.Наименование,
		|	ЕСТЬNULL(Лико_РешенияПоБракуОснасткиКонтакты.Контакт, """"),
		|	ЕСТЬNULL(Лико_ЗабраковкаОснастки.ЗаказКлиента.Площадка, ВТПлощадка.ПлощадкаСкладаОстатков)";
		
		Запрос.УстановитьПараметр("Серия", СтрокаОснастки.Серия);  
		Запрос.УстановитьПараметр("Решение", СтрокаОснастки.Решение);
	КонецЕсли;	
	// <-- Конец Лико Яцун 30.08.2022
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[2].Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаТаблица = РезультатЗапроса[0].Выбрать();	
	МассивСтруктурТаблицы = Новый Массив;
	Пока ВыборкаТаблица.Следующий() Цикл
		
		СтруктураДанныхТаблицы = Новый Структура();
		
		СтруктураДанныхТаблицы.Вставить("Номенклатура", ВыборкаТаблица.Номенклатура);
		СтруктураДанныхТаблицы.Вставить("Количество", ВыборкаТаблица.Количество);
		Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда
			СтруктураДанныхТаблицы.Вставить("Серия", ВыборкаТаблица.Серия);
			СтруктураДанныхТаблицы.Вставить("Нарезка", ВыборкаТаблица.Нарезка);
			СтруктураДанныхТаблицы.Вставить("МетражПМ", ВыборкаТаблица.МетражПМ);
			СтруктураДанныхТаблицы.Вставить("МетражКВМ", ВыборкаТаблица.МетражКВМ);
		ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда
			СтруктураДанныхТаблицы.Вставить("Серия", ?(ЗначениеЗаполнено(ВыборкаТаблица.ФормаКод),
														Строка(ВыборкаТаблица.Серия) + Символы.ПС + "(Форма " + ВыборкаТаблица.ФормаКод + ")",
														ВыборкаТаблица.Серия));
			СтруктураДанныхТаблицы.Вставить("Покупная", ВыборкаТаблица.ОснасткаПокупная);
			СтруктураДанныхТаблицы.Вставить("ПерваяВыдача", ВыборкаТаблица.ЭтоПерваяВыдачаОснастки);
			СтруктураДанныхТаблицы.Вставить("Пробег", ВыборкаТаблица.Пробег);
			СтруктураДанныхТаблицы.Вставить("ПодРекламацию", ВыборкаТаблица.ПодРекламацию);
		КонецЕсли;
		МассивСтруктурТаблицы.Добавить(СтруктураДанныхТаблицы);
		
	КонецЦикла;
	НайденныеКонтакты = "";
	ДопКонтактыДобавлены = Ложь;
	ВыборкаДокумент = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаДокумент.Следующий() Цикл
		// --> Начало Лико Яцун 30.08.2022
		НайденныеКонтакты = НайденныеКонтакты + ";" + ВыборкаДокумент.КонтактДляОтправки;
		Если НЕ ДопКонтактыДобавлены Тогда
			Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда
				Если НЕ (ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуОснастки.ОграниченноГодныйК2 
					И ЗначениеЗаполнено(МассивСтруктурТаблицы[0].Номенклатура.ДополнительныеРеквизиты.Найти(Справочники.Лико_ВидШтампа.Вырубной))) 
					И ВыборкаДокумент.Площадка = Справочники.Лико_Площадки.Ликофлекс Тогда
					Если ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуОснастки.Списать 
						ИЛИ ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуОснастки.ОграниченноГодныйК2 Тогда
						НайденныеКонтакты = НайденныеКонтакты + ";" + СсылкаНаДокумент.ЗаказКлиента.Менеджер.КонтактнаяИнформация[0].АдресЭП;	
					КонецЕсли;
					Если ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуОснастки.Списать И НЕ МассивСтруктурТаблицы[0].Покупная Тогда
						НайденныеКонтакты = НайденныеКонтакты + ";grav@okil-sato.ru";	
					КонецЕсли;
					Если МассивСтруктурТаблицы[0].Покупная Тогда
						НайденныеКонтакты = НайденныеКонтакты + ";apavlenko@okil-sato.ru";	
					КонецЕсли;
					Если ВыборкаДокумент.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Schober Тогда
						НайденныеКонтакты = НайденныеКонтакты + ";gkan@okil-sato.ru";	
					КонецЕсли;
					Если ЗначениеЗаполнено(МассивСтруктурТаблицы[0].Номенклатура.ДополнительныеРеквизиты.Найти(Справочники.Лико_ВидШтампа.ГлубокаяПечать)) Тогда
						НайденныеКонтакты = "sklad_mk@okil-sato.ru;VRomsa@okil-sato.ru;azjukov@okil-sato.ru;Vlee@okil-sato.ru;D.Ivanushkin@okil.ru" + ";" + СсылкаНаДокумент.ЗаказКлиента.Менеджер.КонтактнаяИнформация[0].АдресЭП;	
					КонецЕсли;
					Если МассивСтруктурТаблицы[0].ПодРекламацию Тогда
						НайденныеКонтакты = НайденныеКонтакты + ";OKIL_Zakupki@okil-sato.ru";	
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(МассивСтруктурТаблицы[0].Номенклатура.ДополнительныеРеквизиты.Найти(Справочники.Лико_ВидШтампа.ГлубокаяПечать)) 
					И ВыборкаДокумент.Площадка = Справочники.Лико_Площадки.Ликофлекс Тогда
					НайденныеКонтакты = НайденныеКонтакты + ";dpetrov@okil-sato.ru";	
				КонецЕсли;
			ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Лико_ЗабраковкаМатериалов") Тогда
				Если ВыборкаДокумент.Площадка = Справочники.Лико_Площадки.Ликофлекс 
					И (ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуМатериалов.ВернутьНаСклад_МожноИспользоватьДляНастройки 
					ИЛИ ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуМатериалов.ВернутьНаСклад_МожноИсправить 
					ИЛИ ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуМатериалов.ВернутьНаСклад_НевозможноИспользовать 
					ИЛИ ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2 
					ИЛИ ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуМатериалов.НайтиПоКоду("000000011") 
					ИЛИ ВыборкаДокумент.Решение = Справочники.Лико_РешенияПоБракуМатериалов.УтилизацияНаПроизводстве) Тогда
					Если ВыборкаДокумент.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Indigo ИЛИ ВыборкаДокумент.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Omega Тогда	
						НайденныеКонтакты = НайденныеКонтакты + ";" + "RDolgun@okil-sato.ru;HP_brigadir@okil-sato.ru";
						//ИначеЕсли ВыборкаДокумент.РабочийЦентр.Лико_ОсновнаяМашина ИЛИ ВыборкаДокумент.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПоперечнаяРезка ИЛИ ВыборкаДокумент.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПродольнаяРезка Тогда
					Иначе
						НайденныеКонтакты = НайденныеКонтакты + ";" + "OKalishev@okil-sato.ru;ARuzavin@okil-sato.ru";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ДопКонтактыДобавлены = Истина;
		КонецЕсли;
		// <-- Конец Лико Яцун 30.08.2022
		СтруктураДанных.Вставить("Номер", ВыборкаДокумент.Номер);
		СтруктураДанных.Вставить("Дата", ВыборкаДокумент.Дата);
		СтруктураДанных.Вставить("Организация", ВыборкаДокумент.Организация);
		СтруктураДанных.Вставить("РабочийЦентр", ВыборкаДокумент.РабочийЦентр);
		СтруктураДанных.Вставить("Решение", ВыборкаДокумент.Решение);
		СтруктураДанных.Вставить("РешениеНаименование", ВыборкаДокумент.РешениеНаименование);
		СтруктураДанных.Вставить("КонтактДляОтправки", НайденныеКонтакты);
		СтруктураДанных.Вставить("СотрудникОбнаружившийБрак", ВыборкаДокумент.СотрудникОбнаружившийБрак);
		СтруктураДанных.Вставить("Дефект", ВыборкаДокумент.Дефект);
		СтруктураДанных.Вставить("ОписаниеДефекта", ВыборкаДокумент.ОписаниеДефекта);
		СтруктураДанных.Вставить("КомментарийКРешению", ВыборкаДокумент.КомментарийКРешению);
		СтруктураДанных.Вставить("СотрудникПринявшийРешение", ВыборкаДокумент.СотрудникПринявшийРешение);
		СтруктураДанных.Вставить("НомерЗаказа", ВыборкаДокумент.НомерЗаказа);
		Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Лико_ЗабраковкаОснастки") Тогда
			СтруктураДанных.Вставить("МетражПМ", ВыборкаДокумент.МетражПМ);
			СтруктураДанных.Вставить("ОбразцыПриложеныКНП", ВыборкаДокумент.ОбразцыПриложеныКНП);
			СтруктураДанных.Вставить("МестоОбнаружения", ВыборкаДокумент.МестоОбнаружения);
		КонецЕсли;
	КонецЦикла;
	СтруктураДанных.Вставить("ДанныеТаблицы", МассивСтруктурТаблицы);
	
	Возврат СтруктураДанных;
	
КонецФункции //-- kit:mih web 16.07.21

Процедура ЗаполнениеТабличногоДокументаПисьмаИОтправка(СтруктураДляЗаполненя, Место, Пользователь, Макет) Экспорт //++ kit:mih web 16.07.21
	
	// --> Начало Лико Ефимов ЕВВ 29.11.2021
	УстановитьПривилегированныйРежим(Истина);
	// <-- Конец Лико Ефимов ЕВВ 29.11.2021
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТекстШапка = Макет.ПолучитьОбласть("ТекстШапка");
	
	Если ТипЗнч(СтруктураДляЗаполненя.Решение) = Тип("СправочникСсылка.Лико_РешенияПоБракуОснастки") Тогда
		Заголовок = "Создан документ Забраковка оснастки "+СтруктураДляЗаполненя.Номер+" от "+ Формат(СтруктураДляЗаполненя.Дата, "ДФ=dd.MM.yyyy");
	Иначе	
		Заголовок = "Создан документ Забраковка материалов "+СтруктураДляЗаполненя.Номер+" от "+ Формат(СтруктураДляЗаполненя.Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
		
	Если Место = "ПоРешению" Тогда	
		ТекстСообщения = Заголовок;
	ИначеЕсли Место = "Кладовщикам" Тогда
		// --> Начало Лико Ефимов ЕВВ 30.11.2021
		Заголовок = СтрЗаменить(Заголовок, "Создан документ", "По документу");
		// <-- Конец Лико Ефимов ЕВВ 30.11.2021 
		ТекстСообщения = Заголовок + Символы.ПС + "необходимо создать документ «лк Передача со склада» с видом операции «Возврат товаров поставщику»";
	КонецЕсли;
	ТекстСообщения = ТекстСообщения + Символы.ПС;
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Место обнаружения: " + ?(ЗначениеЗаполнено(СтруктураДляЗаполненя.РабочийЦентр), СтруктураДляЗаполненя.РабочийЦентр, СтруктураДляЗаполненя.МестоОбнаружения);
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Кем обнаружен: " + СтруктураДляЗаполненя.СотрудникОбнаружившийБрак;
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Вид дефекта: " + СтруктураДляЗаполненя.Дефект + ?(ЗначениеЗаполнено(СтруктураДляЗаполненя.ОписаниеДефекта), " (" + СтруктураДляЗаполненя.ОписаниеДефекта + ")", "");
	Если НЕ ТипЗнч(СтруктураДляЗаполненя.Решение) = Тип("СправочникСсылка.Лико_РешенияПоБракуОснастки") Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Количество п/м: " + СтруктураДляЗаполненя.МетражПМ;
	КонецЕсли;	
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Принятое решение: " + СтруктураДляЗаполненя.Решение + ?(ЗначениеЗаполнено(СтруктураДляЗаполненя.КомментарийКРешению), " (" + СтруктураДляЗаполненя.КомментарийКРешению + ")", "");
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Решение принял: " + СтруктураДляЗаполненя.СотрудникПринявшийРешение;
	Если НЕ ТипЗнч(СтруктураДляЗаполненя.Решение) = Тип("СправочникСсылка.Лико_РешенияПоБракуОснастки") Тогда
		Если СтруктураДляЗаполненя.ОбразцыПриложеныКНП Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Образцы приложены к НП";
		КонецЕсли;
	КонецЕсли;
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Заказ: " + ?(ЗначениеЗаполнено(СтруктураДляЗаполненя.НомерЗаказа), СтруктураДляЗаполненя.НомерЗаказа, "не указан");
	ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.ПС + Символы.ПС;

	ТекстШапка.Параметры.ТекстСообщенияШапка = ТекстСообщения;
	ТабличныйДокумент.Вывести(ТекстШапка);
	
	ТаблицаШапка = Макет.ПолучитьОбласть("ТаблицаШапка");
	ТабличныйДокумент.Вывести(ТаблицаШапка);
	
	Для Каждого Строка Из СтруктураДляЗаполненя.ДанныеТаблицы Цикл
		
		СтрокаТаблицы = Макет.ПолучитьОбласть("ТаблицаСтрока");	
		Если ТипЗнч(СтруктураДляЗаполненя.Решение) = Тип("СправочникСсылка.Лико_РешенияПоБракуОснастки") Тогда
			СтрокаТаблицы.Параметры.Номенклатура	 = Строка.Номенклатура;
			СтрокаТаблицы.Параметры.Покупная	 = Строка.Покупная;
			СтрокаТаблицы.Параметры.ПерваяВыдача 	 = Строка.ПерваяВыдача;
			СтрокаТаблицы.Параметры.Пробег 	 = Строка.Пробег;
		Иначе	
			СтрокаТаблицы.Параметры.Нарезка	 = Строка.Нарезка;
			СтрокаТаблицы.Параметры.МетражПМ 	 = Строка.МетражПМ;
			СтрокаТаблицы.Параметры.МетражКВМ 	 = Строка.МетражКВМ;
		КонецЕсли;
		СтрокаТаблицы.Параметры.Серия        = Строка(Строка.Серия);
		СтрокаТаблицы.Параметры.Количество 	 = Строка.Количество;
		ТабличныйДокумент.Вывести(СтрокаТаблицы);
		
	КонецЦикла;	
	
	Если Место = "ПоРешению" Тогда
		ТекстПодвал = Макет.ПолучитьОбласть("ТекстПодвал");
		Если ТипЗнч(СтруктураДляЗаполненя.Решение) = Тип("СправочникСсылка.Лико_РешенияПоБракуОснастки") Тогда
			Если СтруктураДляЗаполненя.ДанныеТаблицы[0].Покупная 
				И СтруктураДляЗаполненя.ДанныеТаблицы[0].ПерваяВыдача 
				И СтруктураДляЗаполненя.ДанныеТаблицы[0].Пробег < 50000 
				И СтруктураДляЗаполненя.Решение = Справочники.Лико_РешенияПоБракуОснастки.Списать
				И СтруктураДляЗаполненя.Дефект = Справочники.Лико_ДефектыОснастки.Износ 
				ИЛИ СтруктураДляЗаполненя.Дефект = Справочники.Лико_ДефектыОснастки.ДефектИзготовления
				ИЛИ СтруктураДляЗаполненя.Дефект = Справочники.Лико_ДефектыОснастки.НесоответствиеЧертежу Тогда
				ТекстПодвал.Параметры.ТекстСообщенияПодвал = "Указаную оснастку необходимо забрать с рабочего центра "+СтруктураДляЗаполненя.РабочийЦентр +" и "+ СтруктураДляЗаполненя.РешениеНаименование + " - попадает под рекламацию поставщику";
			ИначеЕсли СтруктураДляЗаполненя.Решение = Справочники.Лико_РешенияПоБракуОснастки.Списать 
				ИЛИ СтруктураДляЗаполненя.Решение = Справочники.Лико_РешенияПоБракуОснастки.ДоРассмотренияРуководства Тогда 
				ТекстПодвал.Параметры.ТекстСообщенияПодвал = "Указаную оснастку необходимо забрать с рабочего центра "+СтруктураДляЗаполненя.РабочийЦентр +" и "+ СтруктураДляЗаполненя.РешениеНаименование;
			ИначеЕсли СтруктураДляЗаполненя.Решение = Справочники.Лико_РешенияПоБракуОснастки.ОграниченноГодныйК2 Тогда
				ТекстПодвал.Параметры.ТекстСообщенияПодвал = "Указаную оснастку необходимо забрать с рабочего центра "+СтруктураДляЗаполненя.РабочийЦентр +". Оснастка была переведена в категорию "+ СтруктураДляЗаполненя.РешениеНаименование;
			КонецЕсли;	
		Иначе	
			ТекстПодвал.Параметры.ТекстСообщенияПодвал = "Указанные материалы необходимо забрать с рабочего центра "+СтруктураДляЗаполненя.РабочийЦентр +" и "+ СтруктураДляЗаполненя.РешениеНаименование;
		КонецЕсли;	
		ТабличныйДокумент.Вывести(ТекстПодвал);
	КонецЕсли;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.РазмерСтраницы = "A4";
	
	//Преобразование ТабДок к HTML
	ИмяФайла = ПолучитьИмяВременногоФайла("html");
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML5);
	HTMLФайл = Новый ТекстовыйДокумент;
	HTMLФайл.Прочитать(ИмяФайла);
	ТекстHTMLФайла = HTMLФайл.ПолучитьТекст();
	УдалитьФайлы(ИмяФайла);
	
	
	//Отправка Письма
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПараметрыПисьма = Новый Структура();		
	Если Место = "ПоРешению" Тогда	
		
		Если НЕ ЗначениеЗаполнено(СтруктураДляЗаполненя.КонтактДляОтправки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Адреса для отправки сообщения не обнаружены");
			Возврат;
		КонецЕсли;
		
		ПараметрыПисьма.Вставить("Кому", СтруктураДляЗаполненя.КонтактДляОтправки);
		ПараметрыПисьма.Вставить("Тема", Заголовок);
		ПараметрыПисьма.Вставить("Тело",ТекстHTMLФайла);
		ПараметрыПисьма.Вставить("ТипТекста","HTML");
		
	ИначеЕсли Место = "Кладовщикам" Тогда
		
		Адресаты = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(Справочники.Лико_ТипыСообщений.ЗабраковкаМатериалаВозвратРулонки, СтруктураДляЗаполненя.Организация);	
		
		Если НЕ ЗначениеЗаполнено(Адресаты) Тогда
			ОбщегоНазначения.СообщитьПользователю("Адреса для отправки сообщения ""Кладовщикам"" не обнаружены");
			Возврат;
		КонецЕсли;
		
		ПараметрыПисьма.Вставить("Кому", Адресаты);
		ПараметрыПисьма.Вставить("Тема", Заголовок);
		ПараметрыПисьма.Вставить("Тело",ТекстHTMLФайла);
		ПараметрыПисьма.Вставить("ТипТекста","HTML");
		
	Иначе 
		ПараметрыПисьма = Неопределено;
	КонецЕсли;
	
	Если НЕ ПараметрыПисьма = Неопределено Тогда
		// --> Начало Лико Ефимов ЕВВ 10.12.2021
		//Идентификатор = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
		ПараметрыПисьма.Тело = СтрЗаменить(ПараметрыПисьма.Тело, "№", "N");
		ПараметрыПисьма.Тема = СтрЗаменить(ПараметрыПисьма.Тема, "№", "N");
		Лико_Планирование.ОтправитьПисьмо(ПараметрыПисьма.Тело, ПараметрыПисьма.Тема, ПараметрыПисьма.Кому);
		// <-- Конец Лико Ефимов ЕВВ 10.12.2021
	Иначе	
		Сообщить("Ошибка отправки письма");
	КонецЕсли;
	
КонецПроцедуры  //-- kit:mih web 16.07.21
#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выполняет чтение тела запроса HTTP-сервиса, имеющее составное содержимое (multipart/form-data) и возвращает поля
// этого содержимого в виде соответствия. В качестве ключа используется имя поля.
//
// Параметры:
//  Запрос - HTTPСервисЗапрос - запрос, полученный HTTP-сервисом.
// 
// Возвращаемое значение:
//  Соответствие - соответствие, содержащее описание полей составного содержимого. В качестве ключа используется имя
//                 поля. Значение содержит структуру с описанием поля. Подробнее см. ПолеСоставногоСодержимогоЗапроса.
//
Функция ПрочитатьСоставноеСодержимоеЗапроса(Запрос) Экспорт
	
	ПоляЗапроса = Новый Соответствие;
	
	РазделительПолей = ПолучитьРазделитьПолейСоставногоСодержимого(Запрос);	
	ОкончаниеПолей = "--";
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакПоток();
	ЧтениеДанных = Новый ЧтениеДанных(ТелоЗапроса);
	
	ЕстьДанные = Истина;
	Пока ЕстьДанные Цикл
		
		РезультатЧтения = ЧтениеДанных.ПрочитатьДо(РазделительПолей);
		ЕстьДанные = РезультатЧтения.МаркерНайден;
		
		Если ЕстьДанные Тогда
			Строка = ЧтениеДанных.ПрочитатьСтроку();
			ЕстьДанные = (Строка <> ОкончаниеПолей);
		КонецЕсли; 
		
		Если РезультатЧтения.Размер = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Поток = РезультатЧтения.ОткрытьПотокДляЧтения();
		
		Поле = ПрочитатьПолеСоставногоСодержимогоИзПотока(Поток);
		
		Если ЗначениеЗаполнено(Поле.ИмяФайла) Тогда
			ПоляЗапроса.Вставить(Поле.ИмяФайла, Поле);
		Иначе
			ПоляЗапроса.Вставить(Поле.Имя, Поле);
		КонецЕсли; 
				
		Поток.Закрыть();
		
	КонецЦикла; 
	
	ЧтениеДанных.Закрыть();
	ТелоЗапроса.Закрыть();
	
	Возврат ПоляЗапроса;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет чтение поля составного содержимого из потока, полученного из тела запроса.
//
// Параметры:
//  Поток - Поток - поток, содержащий данные поля составного содержимого.
// 
// Возвращаемое значение:
//  Структура - структура, описывающая поле составного запроса. Описание см. ПолеСоставногоСодержимогоЗапроса.
//
Функция ПрочитатьПолеСоставногоСодержимогоИзПотока(Поток)
	
	Поле = ПолеСоставногоСодержимогоЗапроса();
	
	ЧтениеДанных = Новый ЧтениеДанных(Поток);
	
	ЭтоСодержимое = Ложь;
	Пока Не ЭтоСодержимое Цикл
		Строка = ЧтениеДанных.ПрочитатьСтроку();
		
		Если ЗначениеЗаполнено(Строка) Тогда
			ОбработатьЗаголовокСоставногоСодержимого(Поле, Строка);
		Иначе
			// Пустая строка является разделителем заголовков и содержимого поля.
			ЭтоСодержимое = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	РезультатЧтения = ЧтениеДанных.Прочитать();
	
	Если РезультатЧтения.Размер > 0 Тогда
		
		ПотокСодержимого = РезультатЧтения.ОткрытьПотокДляЧтения();
		ЧтениеДанныхСодержимого = Новый ЧтениеДанных(ПотокСодержимого);
		
		ДвоичноеСодержимое = (Поле.ИмяФайла <> Неопределено);
		Если ДвоичноеСодержимое Тогда
			РазмерСодержимого = РезультатЧтения.Размер - 2; // Конечный разделитель строк (ВК + ПС) не нужен.
			РезультатЧтенияСодержимого = ЧтениеДанныхСодержимого.Прочитать(РазмерСодержимого);
			
			Поле.Содержимое = РезультатЧтенияСодержимого.ПолучитьДвоичныеДанные();
		Иначе
			Поле.Содержимое = ЧтениеДанныхСодержимого.ПрочитатьСимволы();
			
			// Конечный разделитель строк (ПС) не нужен (согласно RFC7578 разделителем строк является ВК + ПС, но 1С
			// конвертирует в ПС при чтении строк).
			Поле.Содержимое = Лев(Поле.Содержимое, СтрДлина(Поле.Содержимое) - 1);
		КонецЕсли; 
		
		ЧтениеДанныхСодержимого.Закрыть();
		ПотокСодержимого.Закрыть();
		
	КонецЕсли; 
	
	ЧтениеДанных.Закрыть();
	
	Возврат Поле;
	
КонецФункции 

// Обрабатывает строку заголовка поля составного содержимого (multipart/form-data) и заполняет свойства "Имя",
// "ИмяФайла" и "ТипСодержимого" (в зависимости от заголока) структуры, описывающей это поле.
//
// Параметры:
//  Поле - Структура - структура, описывающая поле составного содержимого. Описание см. ПолеСоставногоСодержимогоЗапроса.
//  ПолныйЗаголовок - Строка - полный заголовок поля составного содержимого. Например,
//                             Content-Disposition: form-data; name="file"; filename="image01.jpg"
//
Процедура ОбработатьЗаголовокСоставногоСодержимого(Поле, ПолныйЗаголовок)
	
	Поз = СтрНайти(ПолныйЗаголовок, ":");
	Заголовок = НРег(Лев(ПолныйЗаголовок, Поз - 1));
	
	Если Заголовок = "content-disposition" Тогда
		
		Поз = СтрНайти(ПолныйЗаголовок, ";");
		СвойстваЗаголовка = СокрЛ(Сред(ПолныйЗаголовок, Поз + 1));
		
		МассивСвойств = СтрРазделить(СвойстваЗаголовка, ";");
		Для каждого Свойство Из МассивСвойств Цикл
			
			КлючЗначение = СтрРазделить(СокрЛП(Свойство), "=");
			Ключ = НРег(СокрЛП(КлючЗначение[0]));
			Значение = УдалитьОбрамляющиеКавычкиИзСтроки(СокрЛП(КлючЗначение[1]));
			
			Если Ключ = "name" Тогда
				Поле.Имя = Значение;
			ИначеЕсли Ключ = "filename" Тогда
				Поле.ИмяФайла = Значение;
			КонецЕсли; 
			
		КонецЦикла;
		
	ИначеЕсли Заголовок = "content-type" Тогда
		
		Поле.ТипСодержимого = СокрЛ(Сред(ПолныйЗаголовок, Поз + 1));
		
	КонецЕсли; 
	
КонецПроцедуры 

// Возвращает инициализированную структуру, описывающую поле составного запроса.
// 
// Возвращаемое значение:
//  Структура - структура, описывающая поле составного содержимого запроса.
//    * Имя - Строка - имя поля (name).
//    * ИмяФайла - Строка - имя файла (filename). Если имя файла указано, то содержимое является двоичными данными.
//    * ТипСодержимого - Строка - тип содержимого, указанный в заголовке Content-Type поля. 
//                                Например: text/plain, image/jpeg и т.п. Может отсутствовать.
//    * Содержимое - Строка, ДвоичныеДанные - содержимое поля. Если указано имя файла, то содержит двоичные данные,
//                                            иначе Строка.
//
Функция ПолеСоставногоСодержимогоЗапроса()
	
	Возврат Новый Структура("Имя, ИмяФайла, ТипСодержимого, Содержимое");
	
КонецФункции

// Получает разделитель (boundary) составного содержимого (multipart/form-data) из заголовка Content-Type.
// Если значение заголовка Content-Type не равно multipart/form-data или свойство boundary не указано, то будет вызвано
// исключение.
//
// Параметры:
//  Запрос - HTTPСервисЗапрос - запрос, полученный HTTP-сервисом.
// 
// Возвращаемое значение:
//  Строка - значение свойства boundary заголовка Content-Type для multipart/form-data.
//
Функция ПолучитьРазделитьПолейСоставногоСодержимого(Запрос)
	
	ПолныйТипСодержимого = Запрос.Заголовки["Content-Type"];
	
	Поз = СтрНайти(ПолныйТипСодержимого, ";");
	ТипСодержимого = НРег(?(Поз > 0, Лев(ПолныйТипСодержимого, Поз - 1), ПолныйТипСодержимого));
	
	Если ТипСодержимого <> "multipart/form-data" Тогда
		ВызватьИсключение НСтр("ru='Значение запроса не является составным содержимым или неверно указан заголовок Content-Type'");
	КонецЕсли; 
	
	Поз = СтрНайти(ПолныйТипСодержимого, "boundary", , Поз + 1);
	Если Поз = 0 Тогда
		ВызватьИсключение НСтр("ru='Не указан разделитель (boundary) составного содержимого в заголовке Content-Type'");
	КонецЕсли; 
	
	Поз = СтрНайти(ПолныйТипСодержимого, "=", , Поз);
	Если Поз = 0 Тогда
		ВызватьИсключение НСтр("ru='Не указано значение разделителя (boundary) составного содержимого в заголовке Content-Type'");
	КонецЕсли; 
	
	ПозНачалаРазделителя = Поз + 1;
	ПозОкончанияРазделителя = СтрНайти(ПолныйТипСодержимого, ";", , ПозНачалаРазделителя);
	
	Если ПозОкончанияРазделителя = 0 Тогда
		РазделительПолей = СокрЛП(Сред(ПолныйТипСодержимого, ПозНачалаРазделителя));
	Иначе
		КоличествоСимволов = ПозОкончанияРазделителя - ПозНачалаРазделителя;
		РазделительПолей = СокрЛП(Сред(ПолныйТипСодержимого, ПозНачалаРазделителя, КоличествоСимволов));
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(РазделительПолей) Тогда
		ВызватьИсключение НСтр("ru='Не указан разделитель (boundary) составного содержимого в заголовке Content-Type'");
	КонецЕсли; 
	
	Возврат "--" + РазделительПолей;
	
КонецФункции 

// Если строка указана в кавычках, то выполняет удаление этих кавычек в начале и конце строки.
// Например, строка "Пример" будет преобразована в Пример (без кавычек).
//
// Параметры:
//  Строка - Строка - строка, указанная в кавычках
// 
// Возвращаемое значение:
//  Строка - строка, переданная в параметре без кавычек.
//
Функция УдалитьОбрамляющиеКавычкиИзСтроки(Строка)
	
	ПервыйСимвол = Лев(Строка, 1);
	ПоследнийСимвол = Прав(Строка, 1);
	
	СтрокаВКавычках = (ПервыйСимвол = """" И ПоследнийСимвол = """");
	
	Возврат ?(СтрокаВКавычках,
	Сред(Строка, 2, СтрДлина(Строка) - 2),
	Строка);
	
КонецФункции 

Функция ПолучитьПараметрыОткрытияОтчета(ИмяОтчета, СтруктураПараметров = Неопределено) Экспорт
	
	ОтчетОбъект = ВнешниеОтчеты.Создать(ИмяОтчета);
	
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;

	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Для каждого ЭлементСтруктуры из СтруктураПараметров Цикл
			УстановитьПараметрСКД(КомпоновщикНастроек, ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла; 
	КонецЕсли;
	
	// С отборами что-то не завелось
	//Если ТипЗнч(СтруктураОтборов) = Тип("Структура") Тогда
	//	Для каждого ЭлементСтруктуры из СтруктураОтборов Цикл
	//		УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ВидСравненияКомпоновкиДанных.Равно, ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	//	КонецЦикла;
	//КонецЕсли;

	ПараметрыОткрытия = Новый Структура(); 	
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Вариант", КомпоновщикНастроек.Настройки);
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыОткрытия.Вставить("РежимПоНастройкамКомпоновки");
				
	Возврат ПараметрыОткрытия;

КонецФункции

Процедура УстановитьПараметрСКД(КомпоновщикНастроек, ИмяПараметра, Значение)
		
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = Значение;
	ПараметрСКД.Использование = Истина;
	
	Если ЗначениеЗаполнено(ПараметрСКД.ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		ПараметрСКД.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = ПараметрСКД.Значение;
			ПользовательскийПараметр.Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ВидСравнения, ИмяПоля, Значение)
		
	ЭлементОтбора =  КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
	ЭлементОтбора.ВидСравнения = ВидСравнения;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры

Функция ПолучитьНаименованиеКомплекта(СтруктураДанных, Отказ) Экспорт
	
	Если ТипЗнч(СтруктураДанных.Товары) = Тип("ТаблицаЗначений") Тогда
		Товары = СтруктураДанных.Товары;
	Иначе
		Товары = СтруктураДанных.Товары.Выгрузить(,"Номенклатура,Характеристика");
	КонецЕсли;
	Товары.Свернуть("Номенклатура,Характеристика");
	НаименованиеКомплекта = "";
	
	Для каждого Строка из Товары Цикл
		Номенклатура = Строка.Номенклатура;
		Характеристика = Строка.Характеристика;
		Если НЕ ЗначениеЗаполнено(Номенклатура.Лико_ТипЭтикетки) Тогда
			Сообщить("В номенклатуре не выбран тип этикетки.");
			Отказ = Истина;
			Возврат "";
		КонецЕсли;			

		ТипЭтик1 = Лико_Дополнительно.ИмяПеречисления(Номенклатура.Лико_ТипЭтикетки); 	
		
		НаименованиеКомплекта = НаименованиеКомплекта + СокрЛП("" + ТипЭтик1 + " " + Номенклатура.Наименование) 
			+ ?(ЗначениеЗаполнено(СтруктураДанных.Город), " " + СтруктураДанных.Город, "")
			+ " " + СтруктураДанных.КодЭтикеткиЗаказчика + "; ";  
	КонецЦикла;
	
	НаименованиеКомплекта = ЛЕВ(СОКРЛП(НаименованиеКомплекта), СТРДЛИНА(СОКРЛП(НаименованиеКомплекта)) - 1);
	
	//Для каждого Номенклатура Из МассивНоменклатур Цикл
	//	НаименованиеКомплекта = НаименованиеКомплекта + СОКРЛП(Номенклатура.Значение.НаименованиеПолное) + " " + СокрЛП(Номенклатура.Значение.ВидНоменклатуры) + " " + СОКРЛП(КодЭтикетки) + "; "; 
	//КонецЦикла;
	//
	//НаименованиеКомплекта = Лев(СОКРЛП(НаименованиеКомплекта), СтрДлина(СОКРЛП(НаименованиеКомплекта)) - 1);
	
	Возврат НаименованиеКомплекта;
	
КонецФункции

Функция НаличиеСвойстваУОбъекта(Объект, ИмяСвойства) Экспорт
	
	ИдентификаторОтсутствия = Новый УникальныйИдентификатор;
	Структура = новый Структура(ИмяСвойства, ИдентификаторОтсутствия);
	
	ЗаполнитьЗначенияСвойств(Структура, Объект);
	
	Возврат Структура[ИмяСвойства] <> ИдентификаторОтсутствия
	
конецФункции

Функция НайтиВариантОтчетаПоИдентификатору(КлючВарианта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		|ГДЕ
		|	ВариантыОтчетов.КлючВарианта = &КлючВарианта
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("КлючВарианта", КлючВарианта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьДанныеРоликаПослеПеремотки(РоликПослеПеремотки) Экспорт

	ДанныеРолика = Новый Структура("Номенклатура,Характеристика,Намотка,КодЭтикеткиЗаказчика,НомерПоставки,Город,ЧестныйЗнак,ВнутреннийДиаметр");
	Если ЗначениеЗаполнено(РоликПослеПеремотки.РаспоряжениеНаРастарку) Тогда
		ЗапросРастарки = Новый Запрос;
		ЗапросРастарки.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика КАК Характеристика,
		|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Намотка КАК Намотка,
		|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерПоставки КАК НомерПоставки,
		|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Город КАК Город,
		|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.ЧестныйЗнак КАК ЧестныйЗнак,
		|	ЗаказКлиентаТовары.ВнутреннийДиаметр КАК ВнутреннийДиаметр
		|ИЗ
		|	Документ.Лико_ПеремещениеПаллета.ЗаказыНаРастарку КАК Лико_ПеремещениеПаллетаЗаказыНаРастарку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика = ЗаказКлиентаТовары.Характеристика
		|			И Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика.Лико_ЗаказНоменклатуры = ЗаказКлиентаТовары.Ссылка
		|ГДЕ
		|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка = &Ссылка
		|	И Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерЦепочки = &НомерЦепочки
		|	И Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерСтроки = &НомерСтроки";
		
		ЗапросРастарки.УстановитьПараметр("НомерСтроки", РоликПослеПеремотки.НомерСтрокиВРаспоряженииНаРастарку);
		ЗапросРастарки.УстановитьПараметр("НомерЦепочки", РоликПослеПеремотки.НомерЦепочкиВРаспоряженииНаРастарку);
		ЗапросРастарки.УстановитьПараметр("Ссылка", РоликПослеПеремотки.РаспоряжениеНаРастарку);
		ВыборкаРастарки = ЗапросРастарки.Выполнить().Выбрать();
		Если ВыборкаРастарки.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ДанныеРолика, ВыборкаРастарки);
			Если НЕ ЗначениеЗаполнено(ДанныеРолика.ВнутреннийДиаметр) Тогда
				ДанныеРолика.ВнутреннийДиаметр = Справочники.Лико_Втулки.НайтиПоРеквизиту("Размер", 76);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтрокаЗаказа = РоликПослеПеремотки.ЗаказКлиента.Товары[РоликПослеПеремотки.НомерСтрокиЗаказаВРоликеПослеПеремотки-1];
		ЗаполнитьЗначенияСвойств(ДанныеРолика, СтрокаЗаказа);
		ДанныеРолика.Намотка = СтрокаЗаказа.Направление;
		ДанныеРолика.НомерПоставки = СтрокаЗаказа.NКонтракта;
	КонецЕсли;
	
	Возврат ДанныеРолика;
	
КонецФункции

#КонецОбласти




