
&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФорму("Документ.Лико_НесоответствующаяПродукция.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Элемент.ЦветТекста = WebЦвета.Аквамарин;
	ПараметрыФормы    = новый Структура("ЗначениеКопирования", ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.Лико_НесоответствующаяПродукция.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Элемент.ЦветТекста = WebЦвета.Аквамарин;
	ПараметрыФормы    = новый Структура("Ключ", ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.Лико_НесоответствующаяПродукция.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Лико_НесоответствующаяПродукция" Тогда
		 Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// --> Маковеева А.Ю. 29.09.2020
	Если Не ЭтаФорма.АвтоНавигационнаяСсылка Тогда
		ЭтаФорма.НавигационнаяСсылка = "e1cib/list/Документ.Лико_НесоответствующаяПродукция";
	КонецЕсли;
	// <-- Маковеева А.Ю. 29.09.2020
	
КонецПроцедуры

&НаКлиенте 
Процедура ПериодПриИзменении(Элемент)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыСписка()
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, Дата('39991231235959')));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыСписка();
КонецПроцедуры
