Функция СведенияОВнешнейОбработке() Экспорт
	ИмяОбработки = "лк мсфо - Залежалые объекты номенклатуры остатки и обороты";
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "1.0.0.0";
	ПараметрыРегистрации.Наименование= "Отчет " + ИмяОбработки ;
	ПараметрыРегистрации.БезопасныйРежим=ЛОЖЬ;
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'лк мсфо - Залежалые объекты номенклатуры остатки и обороты'");
	Команда.Идентификатор = "ЗалежалыеОбъектыНоменклатурыОстаткиИОбороты";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение =Истина;
	Возврат ПараметрыРегистрации;
КонецФункции

//+Лико m.shenderov 2026-05-28
// Извлечение параметров из текущих настроек СКД.
//
// Параметры:
//  НастройкиКомпоновкиДанных - НастройкиКомпоновкиДанных
//
// Возвращаемое значение:
//  Структура - ДатаНачала, ДатаОкончания, СрокДавности, РазделУчета
//
Функция ПолучитьПараметрыИзСКД(НастройкиКомпоновкиДанных) Экспорт

	Параметры = Новый Структура("ДатаНачала, ДатаОкончания, СрокДавности, РазделУчета");

	Для Каждого Эл Из НастройкиКомпоновкиДанных.ПараметрыДанных.Элементы Цикл
		Если НЕ Эл.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если Эл.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
			Параметры.ДатаНачала = Эл.Значение.ДатаНачала;
			Параметры.ДатаОкончания = Эл.Значение.ДатаОкончания;
		ИначеЕсли Эл.Параметр = Новый ПараметрКомпоновкиДанных("СрокДавности") Тогда
			Параметры.СрокДавности = Эл.Значение;
		ИначеЕсли Эл.Параметр = Новый ПараметрКомпоновкиДанных("РазделУчета") Тогда
			Параметры.РазделУчета = Эл.Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат Параметры;

КонецФункции

// Получение данных в привилегированном режиме для обхода ограничений прав доступа.
//
// Параметры:
//  ДатаНачала     - Дата
//  ДатаОкончания  - Дата
//  СрокДавности   - Число
//  РазделУчета    - ПеречислениеСсылка.РазделыУчетаСебестоимостиТоваров
//
// Возвращаемое значение:
//  Структура:
//   * ОстаткиИОбороты - ТаблицаЗначений
//   * Себестоимость   - ТаблицаЗначений
//
Функция ПолучитьДанныеОтчета(ДатаНачала, ДатаОкончания, СрокДавности, РазделУчета) Экспорт

	Результат = Новый Структура("ОстаткиИОбороты, Себестоимость");

	УстановитьПривилегированныйРежим(Истина);

	ЗапросВТ = Новый Запрос;
	ЗапросВТ.УстановитьПараметр("Дата1", ДатаНачала);
	ЗапросВТ.УстановитьПараметр("Дата2", ДатаОкончания);
	ЗапросВТ.УстановитьПараметр("СрокДавности", СрокДавности);
	ЗапросВТ.УстановитьПараметр("РазделУчета", РазделУчета);

	ЗапросВТ.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка.Владелец КАК Склад,
	|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстаткиИОбороты.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	ТоварыВЯчейкахОстаткиИОбороты.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка КАК Нарезка,
	|	ТоварыВЯчейкахОстаткиИОбороты.Серия.ЯССМ_ОбъектНоменклатуры.Втулка КАК Втулка,
	|	ТоварыВЯчейкахОстаткиИОбороты.Назначение КАК Назначение,
	|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыВЯчейкахОстаткиИОбороты.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстаткиИОбороты.Серия КАК Серия,
	|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка.Помещение КАК ЯчейкаПомещение,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииНачальныйОстаток КАК Количество,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииНачальныйОстаток * ТоварыВЯчейкахОстаткиИОбороты.Упаковка.Числитель КАК КоличествоУУ,
	|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка.Лико_Организация КАК Организация,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииКонечныйОстаток КАК КонечныйОстаток,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииПриход КАК Приход,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииРасход КАК Расход,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииКонечныйОстаток * ТоварыВЯчейкахОстаткиИОбороты.Упаковка.Числитель КАК КонечныйОстатокУУ,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииПриход * ТоварыВЯчейкахОстаткиИОбороты.Упаковка.Числитель КАК ПриходУУ,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииРасход * ТоварыВЯчейкахОстаткиИОбороты.Упаковка.Числитель КАК РасходУУ,
	|	ТоварыВЯчейкахОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ТоварыВЯчейкахОстаткиИОбороты.Регистратор.ВидОперации КАК ВидОперации,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииОборот КАК Оборот,
	|	ТоварыВЯчейкахОстаткиИОбороты.ВНаличииОборот * ТоварыВЯчейкахОстаткиИОбороты.Упаковка.Числитель КАК ОборотУУ,
	|	ТоварыВЯчейкахОстаткиИОбороты.ПериодСекунда КАК ПериодСекунда,
	|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ ВТ_ОстаткиИОбороты
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(&Дата1, &Дата2, Авто, ДвиженияИГраницыПериода, ) КАК ТоварыВЯчейкахОстаткиИОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОстаткиИОбороты.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный
	|	И ТоварыВЯчейкахОстаткиИОбороты.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования < ДОБАВИТЬКДАТЕ(&Дата2, ДЕНЬ, -&СрокДавности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория КАК Склад,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьОстаток / СебестоимостьТоваровОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ЦенаУпр,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток / СебестоимостьТоваровОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ЦенаУпрБезНДС,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьРеглОстаток / СебестоимостьТоваровОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ЦенаРеглБезНДС,
	|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоПриход,
	|	СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток КАК СтоимостьБезНДСПриход,
	|	СебестоимостьТоваровОстатки.СтоимостьРеглОстаток КАК СтоимостьРеглПриход,
	|	СебестоимостьТоваровОстатки.СтоимостьУпрОстаток КАК СтоимостьУпрПриход,
	|	СебестоимостьТоваровОстатки.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Себестоимость
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&Дата2,
	|			РазделУчета = &РазделУчета
	|				И (АналитикаУчетаНоменклатуры.СкладскаяТерритория, АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ.Склад КАК Склад,
	|						ВТ.Номенклатура КАК Номенклатура,
	|						ВТ.Характеристика КАК Характеристика
	|					ИЗ
	|						ВТ_ОстаткиИОбороты КАК ВТ)) КАК СебестоимостьТоваровОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
	|	СРЕДНЕЕ(СтоимостьТоваровСрезПоследних.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СРЕДНЕЕ(СтоимостьТоваровСрезПоследних.СтоимостьРегл) КАК СтоимостьРегл,
	|	СРЕДНЕЕ(СтоимостьТоваровСрезПоследних.СтоимостьУпр) КАК СтоимостьУпр,
	|	СтоимостьТоваровСрезПоследних.Организация КАК Организация
	|ПОМЕСТИТЬ ВтСтоимостьТоваров
	|ИЗ
	|	РегистрСведений.СтоимостьТоваров.СрезПоследних(
	|			&Дата2,
	|			РазделУчета = &РазделУчета
	|				И (АналитикаУчетаНоменклатуры.СкладскаяТерритория, АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ.Склад КАК Склад,
	|						ВТ.Номенклатура КАК Номенклатура,
	|						ВТ.Характеристика КАК Характеристика
	|					ИЗ
	|						ВТ_ОстаткиИОбороты КАК ВТ)) КАК СтоимостьТоваровСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьТоваровСрезПоследних.АналитикаУчетаНоменклатуры.Номенклатура,
	|	СтоимостьТоваровСрезПоследних.Организация";

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросВТ.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросВТ.Выполнить();

	Запрос1 = Новый Запрос;
	Запрос1.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос1.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос1.УстановитьПараметр("Дата2", ДатаОкончания);
	Запрос1.УстановитьПараметр("СрокДавности", СрокДавности);

	Запрос1.Текст =
	"ВЫБРАТЬ
	|	ВТ_ОстаткиИОбороты.Склад КАК Склад,
	|	ВТ_ОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ВТ_ОстаткиИОбороты.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	ВТ_ОстаткиИОбороты.Нарезка КАК Нарезка,
	|	ВТ_ОстаткиИОбороты.Втулка КАК Втулка,
	|	ВТ_ОстаткиИОбороты.Назначение КАК Назначение,
	|	ВТ_ОстаткиИОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ОстаткиИОбороты.Упаковка КАК Упаковка,
	|	ВТ_ОстаткиИОбороты.Серия КАК Серия,
	|	ВТ_ОстаткиИОбороты.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ОстаткиИОбороты.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВТ_ОстаткиИОбороты.ЯчейкаПомещение КАК Помещение,
	|	ВТ_ОстаткиИОбороты.Ячейка КАК Ячейка,
	|	ВТ_ОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ВТ_ОстаткиИОбороты.ВидОперации КАК ВидОперации,
	|	ВТ_ОстаткиИОбороты.Организация КАК Организация,
	|	ВТ_ОстаткиИОбороты.ПериодСекунда КАК ПериодСекунда,
	|	ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпр, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьУпр, 0)) КАК ЦенаУпр,
	|	ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпрБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьБезНДС, 0)) КАК ЦенаУпрБезНДС,
	|	ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0)) КАК ЦенаРеглБезНДС,
	|	ВТ_ОстаткиИОбороты.КоличествоУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0)) КАК НачальныйОстатокСуммаРеглБезНДС,
	|	ВТ_ОстаткиИОбороты.КоличествоУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпр, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьУпр, 0)) КАК НачальныйОстатокСуммаУпр,
	|	ВТ_ОстаткиИОбороты.КоличествоУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпрБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьБезНДС, 0)) КАК НачальныйОстатокСуммаУпрБезНДС,
	|	ВТ_ОстаткиИОбороты.КоличествоУУ КАК НачальныйОстатокУУ,
	|	ВТ_ОстаткиИОбороты.Количество КАК НачальныйОстаток,
	|	ВТ_ОстаткиИОбороты.КонечныйОстатокУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0)) КАК КонечныйОстатокСуммаРеглБезНДС,
	|	ВТ_ОстаткиИОбороты.КонечныйОстатокУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпр, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьУпр, 0)) КАК КонечныйОстатокСуммаУпр,
	|	ВТ_ОстаткиИОбороты.КонечныйОстатокУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпрБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьБезНДС, 0)) КАК КонечныйОстатокСуммаУпрБезНДС,
	|	ВТ_ОстаткиИОбороты.КонечныйОстатокУУ КАК КонечныйОстатокУУ,
	|	ВТ_ОстаткиИОбороты.КонечныйОстаток КАК КонечныйОстаток,
	|	ВТ_ОстаткиИОбороты.ПриходУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0)) КАК ПриходСуммаРеглБезНДС,
	|	ВТ_ОстаткиИОбороты.ПриходУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпр, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьУпр, 0)) КАК ПриходСуммаУпр,
	|	ВТ_ОстаткиИОбороты.ПриходУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпрБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьБезНДС, 0)) КАК ПриходСуммаУпрБезНДС,
	|	ВТ_ОстаткиИОбороты.ПриходУУ КАК ПриходУУ,
	|	ВТ_ОстаткиИОбороты.Приход КАК Приход,
	|	ВТ_ОстаткиИОбороты.РасходУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0)) КАК РасходСуммаРеглБезНДС,
	|	ВТ_ОстаткиИОбороты.РасходУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпр, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьУпр, 0)) КАК РасходСуммаУпр,
	|	ВТ_ОстаткиИОбороты.РасходУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпрБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьБезНДС, 0)) КАК РасходСуммаУпрБезНДС,
	|	ВТ_ОстаткиИОбороты.РасходУУ КАК РасходУУ,
	|	ВТ_ОстаткиИОбороты.Расход КАК Расход,
	|	ВТ_ОстаткиИОбороты.ОборотУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0)) КАК ОборотСуммаРеглБезНДС,
	|	ВТ_ОстаткиИОбороты.ОборотУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпр, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьУпр, 0)) КАК ОборотСуммаУпр,
	|	ВТ_ОстаткиИОбороты.ОборотУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпрБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьБезНДС, 0)) КАК ОборотСуммаУпрБезНДС,
	|	ВТ_ОстаткиИОбороты.ОборотУУ КАК ОборотУУ,
	|	ВТ_ОстаткиИОбороты.Оборот КАК Оборот,
	|	""Группа полей 1"" КАК ГруппаПолей1,
	|	""Группа полей 2"" КАК ГруппаПолей2,
	|	""Группа полей 3"" КАК ГруппаПолей3,
	|	ДОБАВИТЬКДАТЕ(&Дата1, ДЕНЬ, -&СрокДавности) КАК ДатаСрокаДавности1,
	|	ДОБАВИТЬКДАТЕ(&Дата2, ДЕНЬ, -&СрокДавности) КАК ДатаСрокаДавности2,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВТ_ОстаткиИОбороты.ОбъектНоменклатуры.ДатаФормирования, ВТ_ОстаткиИОбороты.Регистратор.Дата, ДЕНЬ) > &СрокДавности
	|			ТОГДА ВТ_ОстаткиИОбороты.ОборотУУ * ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОборотСуммаСДавРеглБезНДС
	|ИЗ
	|	ВТ_ОстаткиИОбороты КАК ВТ_ОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Себестоимость КАК ВТ_Себестоимость
	|		ПО ВТ_ОстаткиИОбороты.Склад = ВТ_Себестоимость.Склад
	|			И ВТ_ОстаткиИОбороты.Номенклатура = ВТ_Себестоимость.Номенклатура
	|			И ВТ_ОстаткиИОбороты.Характеристика = ВТ_Себестоимость.Характеристика
	|			И ВТ_ОстаткиИОбороты.Организация = ВТ_Себестоимость.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтоимостьТоваров КАК ВтСтоимостьТоваров
	|		ПО ВТ_ОстаткиИОбороты.Организация = ВтСтоимостьТоваров.Организация
	|			И ВТ_ОстаткиИОбороты.Номенклатура = ВтСтоимостьТоваров.АналитикаУчетаНоменклатурыНоменклатура";

	Результат.ОстаткиИОбороты = Запрос1.Выполнить().Выгрузить();

	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.УстановитьПараметр("Дата2", ДатаОкончания);
	Запрос2.УстановитьПараметр("РазделУчета", РазделУчета);

	Запрос2.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпр, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьУпр, 0)) КАК ЦенаУпр2,
	|	ЕСТЬNULL(ВТ_Себестоимость.ЦенаУпрБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьБезНДС, 0)) КАК ЦенаУпрБезНДС2,
	|	ЕСТЬNULL(ВТ_Себестоимость.ЦенаРеглБезНДС, ЕСТЬNULL(ВтСтоимостьТоваров.СтоимостьРегл, 0)) КАК ЦенаРеглБезНДС2,
	|	ЕСТЬNULL(ВТ_Себестоимость.Организация, ВтСтоимостьТоваров.Организация) КАК Организация,
	|	ЕСТЬNULL(ВТ_Себестоимость.Номенклатура, ВтСтоимостьТоваров.Номенклатура) КАК Номенклатура
	|ИЗ
	|	ВТ_Себестоимость КАК ВТ_Себестоимость
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВтСтоимостьТоваров КАК ВтСтоимостьТоваров
	|		ПО ВТ_Себестоимость.Организация = ВтСтоимостьТоваров.Организация
	|			И ВТ_Себестоимость.Номенклатура = ВтСтоимостьТоваров.Номенклатура";

	Результат.Себестоимость = Запрос2.Выполнить().Выгрузить();

	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции