

Функция Лико_СодатьНоменклатуруСмеси2(Формула, ВидТМЦ, ВидПечати, БЗ)

	Если ТипЗнч(Формула)=Тип("Строка") Тогда
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула);
	Иначе
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула.Наименование);

	КонецЕсли;
	Смесь=Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеСмеси);

	Если  ЗначениеЗаполнено(Смесь) Тогда
		Возврат Смесь;
	КонецЕсли;



	СпрОбъект					                =Справочники.Номенклатура.СоздатьЭлемент();
	СпрОбъект.Лико_ВидТМЦ		                =ВидТМЦ;
	СпрОбъект.Лико_ВидПечати	                =ВидПечати;
	СпрОбъект.ВидНоменклатуры	                =Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра;
	СпрОбъект.Наименование		                =НаименованиеСмеси;
	СпрОбъект.ЕдиницаИзмерения	                =БЗ.БазоваяНоменклатура.ЕдиницаИзмерения;
	СпрОбъект.ЕдиницаДляОтчетов	                =БЗ.БазоваяНоменклатура.ЕдиницаДляОтчетов;
	СпрОбъект.ВесЗнаменатель	                =БЗ.БазоваяНоменклатура.ВесЗнаменатель;
	СпрОбъект.ВесИспользовать	                =БЗ.БазоваяНоменклатура.ВесИспользовать;
	СпрОбъект.ВесМожноУказыватьВДокументах      =БЗ.БазоваяНоменклатура.ВесМожноУказыватьВДокументах;
	СпрОбъект.ГруппаДоступа		                =БЗ.БазоваяНоменклатура.ГруппаДоступа;
	СпрОбъект.ИспользоватьУпаковки		        =БЗ.БазоваяНоменклатура.ИспользоватьУпаковки;
	СпрОбъект.НаборУпаковок						=БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.НаборУпаковок                     =БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.ГруппаФинансовогоУчета            =БЗ.БазоваяНоменклатура.ГруппаФинансовогоУчета;
	СпрОбъект.ГруппаАналитическогоУчета         =БЗ.БазоваяНоменклатура.ГруппаАналитическогоУчета;
	СпрОбъект.ЦеноваяГруппа                     =БЗ.ЦеноваяГруппа;
	СпрОбъект.ТипНоменклатуры                   =Перечисления.ТипыНоменклатуры.Товар;		
	СпрОбъект.Записать();

	Возврат СпрОбъект.Ссылка;	


КонецФункции


&Вместо("СодатьНоменклатуруСмеси")
Функция Лико_СодатьНоменклатуруСмеси(Формула, ВидТМЦ, ВидПечати, БЗ)

	Если ТипЗнч(Формула)=Тип("Строка") Тогда
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула);
	Иначе
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула.Наименование);

	КонецЕсли;
	Смесь=Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеСмеси);

	Если  ЗначениеЗаполнено(Смесь) Тогда
		СпрОбъект= Смесь.ПолучитьОбъект(); 
	Иначе
		СпрОбъект					                =Справочники.Номенклатура.СоздатьЭлемент(); 		
	КонецЕсли;
	



	
	
	//ЗаполнитьЗначенияСвойств(СпрОбъект,БЗ.БазоваяНоменклатура,,"Ссылка,Владелец,Родитель,Код,артикул,НаименованиеПолное,Наименование,Производитель");
	


	//СпрОбъект					                =Справочники.Номенклатура.СоздатьЭлемент();
	СпрОбъект.Лико_ВидТМЦ		                	= ВидТМЦ;
	СпрОбъект.Лико_ВидПечати	                	= ВидПечати;
	СпрОбъект.ВидНоменклатуры	                	= Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра;
	СпрОбъект.Наименование		                	= НаименованиеСмеси;
	СпрОбъект.ЕдиницаИзмерения	                	= БЗ.БазоваяНоменклатура.ЕдиницаИзмерения;
	СпрОбъект.ЕдиницаДляОтчетов	                	= БЗ.БазоваяНоменклатура.ЕдиницаДляОтчетов;
	СпрОбъект.ВесЗнаменатель	                	= БЗ.БазоваяНоменклатура.ВесЗнаменатель;
	СпрОбъект.ВесИспользовать	                	= БЗ.БазоваяНоменклатура.ВесИспользовать;
	СпрОбъект.ВесМожноУказыватьВДокументах      	= БЗ.БазоваяНоменклатура.ВесМожноУказыватьВДокументах;
	СпрОбъект.ГруппаДоступа		                	= БЗ.БазоваяНоменклатура.ГруппаДоступа;
	СпрОбъект.ИспользоватьУпаковки		        	= БЗ.БазоваяНоменклатура.ИспользоватьУпаковки;
	СпрОбъект.НаборУпаковок							= БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.ГруппаФинансовогоУчета            	= БЗ.БазоваяНоменклатура.ГруппаФинансовогоУчета;
	СпрОбъект.ГруппаАналитическогоУчета         	= БЗ.БазоваяНоменклатура.ГруппаАналитическогоУчета;
	СпрОбъект.ЦеноваяГруппа                     	= БЗ.БазоваяНоменклатура.ЦеноваяГруппа;
	СпрОбъект.ТипНоменклатуры                  		= БЗ.БазоваяНоменклатура.ТипНоменклатуры;
	СпрОбъект.ИспользованиеХарактеристик 	        = БЗ.БазоваяНоменклатура.ИспользованиеХарактеристик;
	СпрОбъект.ИспользоватьУпаковки 			        = БЗ.БазоваяНоменклатура.ИспользоватьУпаковки;
	
	СпрОбъект.НаборУпаковок 				        = БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.ГруппаДоступа 				        = БЗ.БазоваяНоменклатура.ГруппаДоступа;
	СпрОбъект.СкладскаяГруппа 				        = БЗ.БазоваяНоменклатура.СкладскаяГруппа;
	СпрОбъект.СтавкаНДС 				            = БЗ.БазоваяНоменклатура.СтавкаНДС;
	СпрОбъект.ВариантОформленияПродажи 				= БЗ.БазоваяНоменклатура.ВариантОформленияПродажи;



	
	СпрОбъект.Записать(); 
	
		
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",
	ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","КраскаВид"),
	УправлениеСвойствами.ЗначениеСвойства(БЗ.БазоваяНоменклатура,"КраскаВид")));
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(СпрОбъект.Ссылка,МассивСтруктур);


	Возврат СпрОбъект.Ссылка;	


КонецФункции
