
//Функция СформироватьТекстДляСкриптаДизайн(Знач ДокЗаявкаНаДизайн, Знач Номенклатура, Знач НомерСтроки, Знач Спецификация, Знач НомерВарианта, Отказ) Экспорт

//	УстановитьПривилегированныйРежим(Истина);

//	Текст = "";
//	Спецификация=?(ЗначениеЗаполнено(Спецификация),Спецификация,ДокЗаявкаНаДизайн.ЗаказКлиента);
//	СтрокаТовары = Номенклатура;
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Номенклатура",Номенклатура);
//	
//	Попытка
//		СтрокаТовары=?(ЗначениеЗаполнено(Спецификация),Спецификация.Товары.НайтиСтроки(СтруктураПоиска)[0],ДокЗаявкаНаДизайн.ЗаказКлиента.Товары.НайтиСтроки(СтруктураПоиска)[0]);
//	Исключение
//		Отказ = Истина;
//		Возврат Текст;
//	КонецПопытки;
//	
//	
//	// параметры штампа
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	ЗаказКлиента.ШтампВырубной КАК Штамп,
//	|	ЕСТЬNULL(Лико_ПараметрыШтампа.ВидРабот, ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Вырубка)) КАК ВидРабот,
//	|	Лико_ПараметрыШтампа.ТипШтампа КАК ТипШтампа,
//	|	ЗаказКлиента.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
//	|	ЗаказКлиента.Нарезка КАК Нарезка,
//	|	ЗаказКлиента.ШагПечати КАК ШагПечати,
//	|	ЗаказКлиента.Ручьи КАК Ручьи,
//	|	Лико_ПараметрыШтампа.РучьиМин КАК РучьиМин,
//	|	ЗаказКлиента.Z КАК Z,
//	|	ЗаказКлиента.ДлинаЭтикетки КАК ДлинаЭтикетки,
//	|	ЗаказКлиента.ШиринаЭтикетки КАК ШиринаЭтикетки,
//	|	Лико_ПараметрыШтампа.ДлинаКольеретки КАК ДлинаКольеретки,
//	|	Лико_ПараметрыШтампа.ШиринаКонтрЭтикетки КАК ШиринаКонтрЭтикетки,
//	|	Лико_ПараметрыШтампа.ШиринаКольеретки КАК ШиринаКольеретки,
//	|	Лико_ПараметрыШтампа.НаправлениеНамотки КАК НаправлениеНамотки,
//	|	Лико_ПараметрыШтампа.Цена КАК Цена,
//	|	Лико_ПараметрыШтампа.ПорядковыйНомерШтанцыНаВалу КАК ПорядковыйНомерШтанцыНаВалу,
//	|	Лико_ПараметрыШтампа.ШиринаПоНожам КАК ШиринаПоНожам,
//	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
//	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками
//	|ИЗ
//	|	Документ.ЗаказКлиента КАК ЗаказКлиента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
//	|		ПО ЗаказКлиента.ШтампВырубной = Лико_ПараметрыШтампа.Номенклатура
//	|ГДЕ
//	|	ЗаказКлиента.Ссылка = &ЗаказКлиента
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Лико_СпецификацииПараметрыШтампа.ШтампВырубной,
//	|	ЕСТЬNULL(Лико_ПараметрыШтампа.ВидРабот, ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Вырубка)),
//	|	Лико_ПараметрыШтампа.ТипШтампа,
//	|	Лико_СпецификацииПараметрыШтампа.ЭтикетокНаЛисте,
//	|	Лико_СпецификацииПараметрыШтампа.Нарезка,
//	|	Лико_СпецификацииПараметрыШтампа.ШагПечати,
//	|	Лико_СпецификацииПараметрыШтампа.Ручьи,
//	|	Лико_ПараметрыШтампа.РучьиМин,
//	|	Лико_СпецификацииПараметрыШтампа.Z,
//	|	Лико_СпецификацииПараметрыШтампа.ДлинаЭтикетки,
//	|	Лико_СпецификацииПараметрыШтампа.ШиринаЭтикетки,
//	|	Лико_ПараметрыШтампа.ДлинаКольеретки,
//	|	Лико_ПараметрыШтампа.ШиринаКонтрЭтикетки,
//	|	Лико_ПараметрыШтампа.ШиринаКольеретки,
//	|	Лико_ПараметрыШтампа.НаправлениеНамотки,
//	|	Лико_ПараметрыШтампа.Цена,
//	|	Лико_ПараметрыШтампа.ПорядковыйНомерШтанцыНаВалу,
//	|	Лико_ПараметрыШтампа.ШиринаПоНожам,
//	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями,
//	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками
//	|ИЗ
//	|	Справочник.Лико_Спецификации.ПараметрыШтампа КАК Лико_СпецификацииПараметрыШтампа
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
//	|		ПО Лико_СпецификацииПараметрыШтампа.ШтампВырубной = Лико_ПараметрыШтампа.Номенклатура
//	|ГДЕ
//	|	Лико_СпецификацииПараметрыШтампа.Ссылка = &ЗаказКлиента
// 	|	И Лико_СпецификацииПараметрыШтампа.НомерВарианта = &НомерВарианта";


//	Запрос.УстановитьПараметр("ЗаказКлиента", Спецификация);
//	Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);

//	//180-33022						- артикул монтажа, соответствует имени TXT файла
//	//314.325						- раппорт (флексо) без сжатия
//	//308.265						- раппорт (флексо) со сжатием
//	//4								- количество ручьев
//	//2								- количество этикет в ручье(по развертке)
//	//70							- размер этикеты поперёк полотна
//	//155							- размер этикеты вдоль полотна
//	//3								- шаг по ножам поперёк полотна(расстояние между ручьями)
//	//2.162							- шаг по ножам вдоль полотна
//	//стар.211-99/133				- текстовое поле информации для нанесения на рельсу(может быть любой) номер штампа + линиатура печати(из 1С)
//	//[forms]						- обозначение начала списка форм
//	//Yellow-L40489					- элемент списка форм [используемая краска]-[номер формы]
//	//Magenta-L40490				- элемент списка форм
//	//Cyan-L40491					- элемент списка форм
//	//Pn Purple-F40492				- элемент списка форм
//	//Холодное тиснение-40482		- элемент списка форм
//	//Black-L40493					- элемент списка форм
//	//[articles]					- обозначение начала списка артиклей
//	//180-3759						- элемент списка артиклей №1 (соответствует имени дизайнерского и поделеного файла)
//	//180-3713						- элемент списка артиклей №2
//	//180-33185						- элемент списка артиклей №3
//	//180-16965						- элемент списка артиклей №4
//	//[montage]						- обозначение начала монтажной схемы
//	//1,2,3,4						- монтажная схема ввиде номеров списка артиклей через запятую
//	//1,2,3,4						- ручьи в схеме идут вертикально
//	
//	Текст = Текст + Номенклатура.Артикул;																	// 1. код спецификации, соответствует имени TXT файла
//	Текст = Текст + Символы.ПС + ДокЗаявкаНаДизайн.Партнер.Наименование;												// 2. контрагент
//	Текст = Текст + Символы.ПС + ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(ДокЗаявкаНаДизайн.Менеджер.Наименование);	// 3. ответственный
//	Текст = Текст + Символы.ПС + ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(ДокЗаявкаНаДизайн.Дизайнер.Наименование);	// 4. дизайнер

//	//Если ЗначениеЗаполнено(ДокЗаявкаНаДизайн.ЗаказПокупателя) Тогда
//		Если ЗначениеЗаполнено(Спецификация) Тогда

//		Выборка = Запрос.Выполнить().Выбрать();
//		Если Выборка.Следующий() Тогда

//			Текст = Текст + Символы.ПС + Выборка.ШиринаЭтикетки + "x" + Выборка.ДлинаЭтикетки;							// 5. размер этикетки x ширина этикетки
//			Если ЗначениеЗаполнено(Выборка.Штамп) Тогда
//				Текст = Текст + Символы.ПС + Выборка.Штамп.Артикул + "; " + Выборка.Штамп.Наименование;					// 6. артикул и название штампа
//			Иначе
//				Текст = Текст + Символы.ПС + "";																		// 6. артикул и название штампа
//			КонецЕсли;
//			 //Спецификация.СпособНаклейки;
//			//СпособНаклейки = ДокЗаявкаНаДизайн.ЗаказПокупателя.СпособНаклейки;
//			СпособНаклейки=Спецификация.СпособНаклейки;

//			Если СпособНаклейки=Перечисления.Лико_СпособыНаклейки.ЛистоваяВыкладка Тогда
//				Текст = Текст + Символы.ПС + "1";																		// 7. способ наклейки
//			ИначеЕсли СпособНаклейки=Перечисления.Лико_СпособыНаклейки.РучнаяРасклейка Тогда
//				Текст = Текст + Символы.ПС + "2";																		// 7. способ наклейки
//			ИначеЕсли СпособНаклейки=Перечисления.Лико_СпособыНаклейки.Этикеровщик Тогда
//				Текст = Текст + Символы.ПС + "3";																		// 7. способ наклейки
//			Иначе
//				Текст = Текст + Символы.ПС + "0";																		// 7. способ наклейки
//			КонецЕсли;
//			
//			Если  ЗначениеЗаполнено(СтрокаТовары.Направление) Тогда
//				
//				Намотка = СтрокаТовары.Направление;
//				
//				Текст = Текст + Символы.ПС + СтрокаТовары.МаксимальныйДиаметрРулона;											// 8. максимальный диаметр намотки
//				Текст = Текст + Символы.ПС + СтрокаТовары.ВнутреннийДиаметр;													// 9. внутренний диаметр намотки
//				Текст = Текст + Символы.ПС + СтрокаТовары.Направление;														// 10. направление намотки
//				Текст = Текст + Символы.ПС + формат(СтрокаТовары.КоличествоЭтикетокВРолике,"ЧГ=0");	                        // 11. КоличествоЭтикетокВРолике
//			Иначе

//				Текст = Текст + Символы.ПС + "0";																		// 8. максимальный диаметр намотки
//				Текст = Текст + Символы.ПС + "0";																		// 9. внутренний диаметр намотки
//				Текст = Текст + Символы.ПС + "0";																		// 10. направление намотки
//				//Начало изменений Иванова Анна 09.11.2015
//				Текст = Текст + Символы.ПС + "0";																		// 11. КоличествоЭтикетокВРолике
//				//Конец изменений Иванова Анна 09.11.2015
//			КонецЕсли;
//			
//		Иначе //Выборка.Следующий()
//			
//			Текст = Текст + Символы.ПС + "0x0";																			// 5. размер этикетки x ширина этикетки
//			Текст = Текст + Символы.ПС + "";																			// 6. артикул и название штампа
//			Текст = Текст + Символы.ПС + "0";																			// 7. способ наклейки
//			Текст = Текст + Символы.ПС + "0";																			// 8. максимальный диаметр намотки
//			Текст = Текст + Символы.ПС + "0";																			// 9. внутренний диаметр намотки
//			Текст = Текст + Символы.ПС + "0";																			// 10. направление намотки
//			Текст = Текст + Символы.ПС + "0";																			// 11. КоличествоЭтикетокВРолике
//		КонецЕсли;
//			
//	Иначе //ЗначениеЗаполнено(СтрокаТовары.Спецификация)
//		
//		Текст = Текст + Символы.ПС + "0x0";																				// 5. размер этикетки x ширина этикетки
//		Текст = Текст + Символы.ПС + "";																				// 6. артикул и название штампа
//		Текст = Текст + Символы.ПС + "0";																				// 7. способ наклейки
//		Текст = Текст + Символы.ПС + "0";																				// 8. максимальный диаметр намотки
//		Текст = Текст + Символы.ПС + "0";																				// 9. внутренний диаметр намотки
//		Текст = Текст + Символы.ПС + "0";																				// 10. направление намотки
//		Текст = Текст + Символы.ПС + "0";																				// 11. КоличествоЭтикетокВРолике
//		
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(ДокЗаявкаНаДизайн.Партнер) Тогда
//		
//		НаименованиеКонтрагента = ДокЗаявкаНаДизайн.Партнер.Наименование;
//		Если Лев(НаименованиеКонтрагента, 2)="Е." Или Лев(НаименованиеКонтрагента, 2)="е." Или
//			Лев(НаименованиеКонтрагента, 2)="E." Или Лев(НаименованиеКонтрагента, 2)="e." Тогда
//			
//			Текст = Текст + Символы.ПС + Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра;	// 12. организация
//		Иначе
//			Текст = Текст + Символы.ПС + Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра;	// 12. организация
//		КонецЕсли;
//		
//	Иначе
//		Текст = Текст + Символы.ПС + "";																				// 12. организация
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(Спецификация) Тогда
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		Если Выборка.Следующий() Тогда
//			
//			Текст = Текст + Символы.ПС + Выборка.Z;																		// 13. Z
//			// {{ DGavrilov 20150917
//			//Текст = Текст + Символы.ПС + СтрокаТовары.Спецификация.ОсновнойМатериал.Родитель;							// 14. группа номенклатуры
//			Текст = Текст + Символы.ПС + Спецификация.ОсновнойМатериал;									// 14. группа номенклатуры
//			// }} DGavrilov 20150917
//			
//		Иначе //Выборка.Следующий()
//			
//			Текст = Текст + Символы.ПС + "0";																			// 13. Z
//			// {{ DGavrilov 20150917
//			//Текст = Текст + Символы.ПС + СтрокаТовары.Спецификация.ОсновнойМатериал.Родитель;							// 14. группа номенклатуры
//			Текст = Текст + Символы.ПС +Спецификация.ОсновнойМатериал;									// 14. группа номенклатуры
//			// }} DGavrilov 20150917
//			
//		КонецЕсли;		
//	Иначе //ЗначениеЗаполнено(СтрокаТовары.Спецификация)
//		
//		Текст = Текст + Символы.ПС + "0";																				// 13. Z
//		Текст = Текст + Символы.ПС + "";																				// 14. группа номенклатуры
//	КонецЕсли;
//	Текст = Текст + Символы.ПС + СтрокаТовары.Номенклатура.Наименование;												// 15. этикетка
//	//Конец изменений Иванова Анна 09.11.2015
//	
//	Возврат Текст;

//	
//КонецФункции //СформироватьТекстДляСкрипта Экспорт

