
&НаСервере
Процедура Лико_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	СписокНоменклатура.ТекстЗапроса=ТекстЗапросаСпискаНоменклатуры();
	Лико_ПоказыватьОстатки=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПоказыватьОстаткиВПодбореНоменклатуры",Ложь);
	Если Справочники.Лико_РабочиеМеста.ПолучитьСвойство("УстановкаПризнакаНеИспользоватьУНоменклатуры",Ложь) Тогда
		Элементы.Лико_СкрыватьНеиспользованные.Видимость=Истина;
		Элементы.Лико_НеИспользовать.Видимость=истина;
		Элементы.Лико_НеИспользовать.Доступность=Истина;
		Лико_СкрыватьНеиспользованные=Истина;
	Иначе
		Элементы.Лико_СкрыватьНеиспользованные.Видимость=Ложь;

		Элементы.Лико_НеИспользовать.Видимость=Ложь;
		Элементы.Лико_НеИспользовать.Доступность=Ложь;		
	КонецЕсли;
	
	СписокНоменклатура.Параметры.УстановитьЗначениеПараметра("НеПоказыватьНеиспользованные",Лико_СкрыватьНеиспользованные);
	Если  Лико_ПоказыватьОстатки Тогда
		Элементы.ЛикоСписокОстатков.Видимость=Истина;
	Иначе
		Элементы.ЛикоСписокОстатков.Видимость=Ложь;
	КонецЕсли;
	ЛикоСписокОстатков.Параметры.УстановитьЗначениеПараметра("Номенклатура",Неопределено);
	
	 	Элемент = Элементы.Добавить("СписокРасширенныйПоискНоменклатураЛико_НеИспользовать",Тип("ПолеФормы"),Элементы.СписокРасширенныйПоискНоменклатура);
		
		
		Элемент.Вид =ВидПоляФормы.ПолеФлажка;
		Элемент.ПутьКДанным = "СписокНоменклатура.Лико_НеИспользовать";
		//Форма.Элементы.Переместить(Элемент, Элемент.Родитель, Форма.Элементы.СписокРасширенныйПоискНоменклатураНаименование);

КонецПроцедуры

&НаКлиенте
Процедура Лико_СписокСтандартныйПоискНоменклатураПриАктивизацииЯчейкиПосле(Элемент)
	Если  Лико_ПоказыватьОстатки И Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные<>Неопределено Тогда
		
		ЛикоСписокОстатков.Параметры.УстановитьЗначениеПараметра("Номенклатура",Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Лико_СписокРасширенныйПоискНоменклатураПриАктивизацииЯчейкиПосле(Элемент)
	Если  Лико_ПоказыватьОстатки И Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные<>Неопределено Тогда
		
		ЛикоСписокОстатков.Параметры.УстановитьЗначениеПараметра("Номенклатура",Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные.Ссылка);
		//ЭтаФорма.ТекущийЭлемент=Элементы.ЛикоСписокОстатков.ТекущиеДанные=;
		//ЭтаФорма.ТекущийЭлемент= Элементы.СписокРасширенныйПоискНоменклатура;
		Элементы.ЛикоСписокОстатков.ТекущаяСтрока=1;
		ЕСли   Элементы.ЛикоСписокОстатков.ТекущиеДанные<>Неопределено Тогда
			Лико_Количество= Элементы.ЛикоСписокОстатков.ТекущиеДанные.Количество;
			Лико_КоличествоУУ= Элементы.ЛикоСписокОстатков.ТекущиеДанные.КоличествоУУ;
		Иначе
			Лико_Количество=0;
			Лико_КоличествоУУ=0;
			
			
		КонецЕсли;
			//ПодключитьОбработчикОжидания("ИтогиОСтатковТовара",1);	

	Иначе
		Лико_Количество=0;
		Лико_КоличествоУУ=0;

		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИтогиОСтатковТовара() //+Лико m.shenderov 10.11.2018
	    ЕСли   Элементы.ЛикоСписокОстатков.ТекущиеДанные<>Неопределено Тогда
			Лико_Количество= Элементы.ЛикоСписокОстатков.ТекущиеДанные.Количество;
			Лико_КоличествоУУ= Элементы.ЛикоСписокОстатков.ТекущиеДанные.КоличествоУУ;
		Иначе
			Лико_Количество=0;
			Лико_КоличествоУУ=0;
			
			
		КонецЕсли;

КонецПроцедуры //-Лико m.shenderov 10.11.2018


&НаСервере
Процедура Лико_Лико_НеИспользоватьПослеНаСервере(Ссылка)
	
	СправочникОбъект=Ссылка.ПолучитьОбъект();
	СправочникОбъект.Лико_НеИспользовать=Не СправочникОбъект.Лико_НеИспользовать;
	СправочникОбъект.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_Лико_НеИспользоватьПосле(Команда)
	Если Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные<>Неопределено  Тогда
	Лико_Лико_НеИспользоватьПослеНаСервере( Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные.Ссылка);
	Элементы.СписокРасширенныйПоискНоменклатура.Обновить();
	КонецЕсли;
КонецПроцедуры


&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Лико_УстановитьУсловноеОформление()
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокРасширенныйПоискНоменклатура.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокНоменклатура.Лико_НеИспользовать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПолеСОшибкойФон);

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаСпискаНоменклатуры() //+Лико m.shenderov 10.11.2018  
	
	  Возврат  "ВЫБРАТЬ
	   |	СпрНоменклатура.Ссылка КАК Ссылка,
	   |	СпрНоменклатура.Код КАК Код,
	   |	СпрНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
	   |	СпрНоменклатура.Наименование КАК Наименование,
	   |	СпрНоменклатура.Артикул КАК Артикул,
	   |	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	   |	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	   |	СпрНоменклатура.СтавкаНДС КАК СтавкаНДС,
	   |	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	   |	СпрНоменклатура.Родитель КАК Родитель,
	   |	ВЫБОР
	   |		КОГДА СпрНоменклатура.ЕстьТоварыДругогоКачества
	   |			ТОГДА 4 + ВЫБОР
	   |					КОГДА СпрНоменклатура.ПометкаУдаления
	   |						ТОГДА 1
	   |					ИНАЧЕ 0
	   |				КОНЕЦ + ВЫБОР
	   |					КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	   |						ТОГДА 0
	   |					ИНАЧЕ 2
	   |				КОНЕЦ
	   |		ИНАЧЕ ВЫБОР
	   |				КОГДА СпрНоменклатура.ПометкаУдаления
	   |					ТОГДА 1
	   |				ИНАЧЕ 0
	   |			КОНЕЦ + ВЫБОР
	   |				КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	   |					ТОГДА 0
	   |				ИНАЧЕ 2
	   |			КОНЕЦ
	   |	КОНЕЦ КАК ИндексКартинки,
	   |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.СодержитТовары, ЛОЖЬ) КАК СодержитТовары,
	   |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.СодержитУслуги, ЛОЖЬ) КАК СодержитУслуги,
	   |	СпрНоменклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	   |	СпрНоменклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
	   |	СпрНоменклатура.Качество КАК Качество,
	   |	СпрНоменклатура.ВестиУчетСертификатовНоменклатуры КАК ВестиУчетСертификатовНоменклатуры,
	   |	СпрНоменклатура.ПродукцияМаркируемаяДляГИСМ КАК ПродукцияМаркируемаяДляГИСМ,
	   |	ЕСТЬNULL(ВидыАлкогольнойПродукции.Маркируемый, ЛОЖЬ) КАК ВидАлкогольнойПродукцииМаркируемый,
	   |	СпрНоменклатура.Лико_НеИспользовать КАК Лико_НеИспользовать 
	   |ИЗ
	   |	Справочник.Номенклатура КАК СпрНоменклатура
	   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	   |		ПО (ВариантыКомплектацииНоменклатуры.Владелец = СпрНоменклатура.Ссылка)
	   |			И (ВариантыКомплектацииНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	   |			И (ВариантыКомплектацииНоменклатуры.Основной)
	   |		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
	   |		ПО СпрНоменклатура.ВидАлкогольнойПродукции = ВидыАлкогольнойПродукции.Ссылка}
	   |ГДЕ
	   |	НЕ СпрНоменклатура.ЭтоГруппа И
	   |	Выбор Когда &НеПоказыватьНеиспользованные Тогда  Не СпрНоменклатура.Лико_НеИспользовать Иначе Истина Конец  
	   |{ГДЕ
	   |	СпрНоменклатура.Ссылка.*,
	   |	(СпрНоменклатура.Ссылка В
	   |			(ВЫБРАТЬ
	   |				Сегменты.Номенклатура
	   |			ИЗ
	   |				РегистрСведений.НоменклатураСегмента КАК Сегменты
	   |			ГДЕ
	   |				Сегменты.Сегмент = &СегментНоменклатуры)) КАК Поле2,
	   |	(ВЫБОР
	   |			КОГДА ВЫБОР
	   |					КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
	   |						ТОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка))
	   |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
	   |				КОНЕЦ В (&ВариантыРасчетаЦеныНабора)
	   |				ТОГДА ИСТИНА
	   |			ИНАЧЕ ЛОЖЬ
	   |		КОНЕЦ) КАК Поле4}";
	   	   
	   
КонецФункции  //-Лико m.shenderov 10.11.2018

&НаКлиенте
Процедура Лико_Лико_СкрыватьНеиспользованныеПриИзмененииВместо(Элемент)
	СписокНоменклатура.Параметры.УстановитьЗначениеПараметра("НеПоказыватьНеиспользованные",Лико_СкрыватьНеиспользованные);

КонецПроцедуры



