&Вместо("ДанныеПоРоликам")
Функция Лико_ДанныеПоРоликам(Заказ, ИмяТаблицы, КодЦГ, НомерПроката, НомерВарианта, РабочийЦентр, Метраж)
		ДанныеПоРоликам = Новый Структура();
	ДанныеПоРоликам.Вставить("ВремяНаСменуРоликов", 0);
	ДанныеПоРоликам.Вставить("ДлинаРолика", 0);
	
	Запрос = Новый Запрос;	
	#Область ДанныеПоРоликам   
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаВидыРабот.ВидСекции КАК ВидРабот,
	|	ЗаказКлиентаВидыРабот.КоличествоРучьевМатериала КАК КоличествоМатериалов
	|ПОМЕСТИТЬ ВТМатериалы
	|ИЗ
	|	"+ИмяТаблицы+".Цвета КАК ЗаказКлиентаВидыРабот
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	|	И ЗаказКлиентаВидыРабот.НомерПроката = &НомерПроката
	|	И ЗаказКлиентаВидыРабот.Материал <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|	И ЗаказКлиентаВидыРабот.Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ЗаказКлиентаВидыРабот.Материал <> НЕОПРЕДЕЛЕНО
	|	И ЗаказКлиентаВидыРабот.НомерВарианта = &НомерВарианта
	|	И НЕ ЗаказКлиентаВидыРабот.ВидСекции В (ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское), ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеВРегистрПлоское))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаВидыРабот.ВидСекции,
	|	ЗаказКлиентаВидыРабот.КоличествоРучьевМатериала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Основной материал"",
	|	1
	|ИЗ
	|	"+ИмяТаблицы+" КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТМатериалы.КоличествоМатериалов) КАК КоличествоМатериалов
	|ПОМЕСТИТЬ ВТКоличествоМатериалов
	|ИЗ
	|	ВТМатериалы КАК ВТМатериалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры.НомерВарианта, Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры1.НомерВарианта) КАК НомерВарианта,
	|	ЕСТЬNULL(Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры.Ссылка, Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры1.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТНормативы
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_ТаблицыДляРасчетаНормативов.РабочиеЦентры КАК Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры
	|		ПО РабочиеЦентры.Ссылка = Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры.РабочийЦентр
	|			И (Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ТаблицыДляРасчетаНормативов.ДлинаРолика))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_ТаблицыДляРасчетаНормативов.РабочиеЦентры КАК Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры1
	|		ПО РабочиеЦентры.ВидРабочегоЦентра = Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры1.РабочийЦентр
	|			И (Лико_ТаблицыДляРасчетаНормативовРабочиеЦентры1.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ТаблицыДляРасчетаНормативов.ДлинаРолика))
	|ГДЕ
	|	РабочиеЦентры.Ссылка = &РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.ЗначениеПоказателя КАК ДлинаРолика
	|ПОМЕСТИТЬ ВТПоУмолчанию
	|ИЗ
	|	ВТНормативы КАК ВТНормативы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_ТаблицыДляРасчетаНормативов.ТаблицаПоказателей КАК Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей
	|		ПО ВТНормативы.Ссылка = Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.Ссылка
	|			И ВТНормативы.НомерВарианта = Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.НомерВарианта
	|			И (Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.Показатель = ЗНАЧЕНИЕ(Справочник.Лико_ПараметрыРасчетаНормативов.Поправка1С))
	|			И (Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.ВариантРасчета = 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КодЦГ КАК КодЦГ,
	|	ВТКоличествоМатериалов.КоличествоМатериалов КАК КоличествоМатериалов,
	|	ЕСТЬNULL(Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.ЗначениеПоказателя, ВТПОУмолчанию.ДлинаРолика) КАК ДлинаРолика,
	|	5 * ЕСТЬNULL(ВТКоличествоМатериалов.КоличествоМатериалов, 0) * (ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА &Метраж / ЕСТЬNULL(Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.ЗначениеПоказателя, ВТПОУмолчанию.ДлинаРолика) > 1
	|				ТОГДА &Метраж / ЕСТЬNULL(Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.ЗначениеПоказателя, ВТПОУмолчанию.ДлинаРолика)
	|			ИНАЧЕ 0
	|		КОНЕЦ + 0.4999 КАК ЧИСЛО(15, 0))) КАК ВремяНаСменуРоликов
	|ИЗ
	|	ВТКоличествоМатериалов КАК ВТКоличествоМатериалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоУмолчанию КАК ВТПОУмолчанию
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_ТаблицыДляРасчетаНормативов.ТаблицаЦветов КАК Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов
	|		ПО (Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.НомерВарианта В
	|				(ВЫБРАТЬ
	|					ВТНормативы.НомерВарианта КАК НомерВарианта
	|				ИЗ
	|					ВТНормативы КАК ВТНормативы))
	|			И (Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ТаблицыДляРасчетаНормативов.ДлинаРолика))
	|			И (Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.КоличествоЦветов = &КодЦГ)";
	
	#КонецОбласти
	
	
	
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("КодЦГ", КодЦГ);
	Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);
	Запрос.УстановитьПараметр("Метраж", Метраж);
	РезультатЗапроса  = Запрос.Выполнить();	
	Если Не РезультатЗапроса.Пустой() Тогда
		//Результат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Общие");
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		//Если ЗначениеЗаполнено(Результат.ВремяНаСменуРоликов) Тогда 
			ДанныеПоРоликам.ВремяНаСменуРоликов = Результат.ВремяНаСменуРоликов;
			ДанныеПоРоликам.ДлинаРолика = Результат.ДлинаРолика;
		//КонецЕсли;	
	КонецЕсли;
	Возврат ДанныеПоРоликам;

КонецФункции


&Вместо("НаправитьВРаботуЗаказОснастки")
Процедура Лико_НаправитьВРаботуЗаказОснастки(Заказ)
	//Проверяем  есть ли Заказы на производство по организациям - площадкам из рабочих центров
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Площадка КАК Площадка,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаказНаПроизводство2_2.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка))) КАК ЗаказНаПроизводство
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	|		ПО (ЗаказКлиента.Площадка.Организация = ЗаказНаПроизводство2_2.Организация)
	|			И (ЗаказКлиента.Ссылка = ЗаказНаПроизводство2_2.ДокументОснование)
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Площадка";

	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если  ЗначениеЗаполнено(Выборка.ЗаказНаПроизводство) Тогда 
			ЗаказПрОбъект = Выборка.ЗаказНаПроизводство.ПолучитьОбъект();
		Иначе
			ЗаказПРОбъект = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
			ЗаказПРОбъект.Организация  = Выборка.Площадка.Организация;  
		КонецЕсли;	
		ЗаполнитьПоЗаказуКлиента(ЗаказПрОбъект, Заказ);	
		ЗаказПр = ЗаказПрОбъект.Ссылка;
		Отказ = Ложь;
		СоздатьДобавитьЭтапыПроизводства(Заказ, ЗаказПр, Выборка.Площадка, Отказ);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
	КонецЦикла;


	ЗаказОбъект = Заказ.ПолучитьОбъект();
	ЗаказОбъект.ДатаОтправкиВРаботу = ТекущаяДата();
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);


КонецПроцедуры

&Вместо("РассчитатьКомбинированныйЗаказПоРЦ")
Процедура Лико_РассчитатьКомбинированныйЗаказПоРЦ(Заказ, Выборка, Отказ)
	
	МетровВсегоОсн=0;
	//Стоимость новых штампов и клише
	Ст_Шт_Клише =Выборка.СтоимостьОснастки;
	ТаблицаРЦ = ПолучитьРЦПоПеределам(Заказ, Выборка.РабочийЦентр);	
	МетрыНаБрак = 0;
	МетрыНаНастройку = 0; 
	МойкаСекций = 0;
	ОбщееВремяВыполненияЗаказа =0;
	ВремяЗаказаДляДоходности = 0;
	ЗатратыНаМатериалы = 0;
	ЗатратыНаОснастку = 0;
	ВсегоКликов = 0;
	Если Заказ.ЕдиницаИзмеренияЗаказа = Справочники.Лико_ПредопределенныеЗначения.ЕИТысШт.ЗначениеПараметра Тогда 
		КоэффициентЕдИзм = 1000;
	Иначе
		КоэффициентЕдИзм = 1;
	КонецЕсли;
	//		ПоказателиПоЗаказу = Новый Соответствие; //собираем показатели по всем машинам
	Для каждого ТекРЦ из ТаблицаРЦ Цикл 
		НормативыДляРЦ= РассчитатьНормативыДляРЦ(Заказ, Выборка.ПогонныйМетраж, ТекРЦ.РЦ, МетрыНаБрак, МетрыНаНастройку, текРЦ.НомерПроката, Выборка.Количество);
		Если ТипЗнч(НормативыДляРЦ) <>Тип("Строка") Тогда
			//				ЗаполнитьПоказателиПоЗаказу(ПоказателиПоЗаказу, НормативыДляРЦ.ПоказателиДляТаблиц);
			стрНормативы =РегистрыСведений.Лико_ПараметрыПроизводстваЗаказа.СоздатьМенеджерЗаписи();
			стрНормативы.Заказ = Заказ;
			стрНормативы.НомерПроката = текРЦ.НомерПроката;
			стрНормативы.РабочийЦентр = ТекРЦ.РЦ;
			стрНормативы.Нарезка = Выборка.Нарезка;
			//				
			МетрыНаБрак = МетрыНаБрак +НормативыДляРЦ.МетрыНаБрак;
			МетрыНаНастройку = МетрыНаНастройку+НормативыДляРЦ.МетрыНаНастройку;
			МойкаСекций = МойкаСекций+НормативыДляРЦ.МойкаСекций;
			Если  текРЦ.НомерПроката>1 Тогда 
				ВремяЗаказаДляДоходности =ВремяЗаказаДляДоходности+НормативыДляРЦ.ВремяВыполненияЗаказа*ТекРЦ.РЦ.Лико_КоэффициентВремениДоходности;
			Иначе
				ВремяЗаказаДляДоходности =ВремяЗаказаДляДоходности+НормативыДляРЦ.ВремяВыполненияЗаказа;
			КонецЕсли;	
			стрНормативы.МетрыНаНастройку = НормативыДляРЦ.МетрыНаНастройку;
			стрНормативы.МетрыНаБрак = НормативыДляРЦ.МетрыНаБрак;
			стрНормативы.ВремяПечати = НормативыДляРЦ.ВремяПечати;
			стрНормативы.ВремяНаНастройку = НормативыДляРЦ.ВремяНаНастройку;
			стрНормативы.ВремяНаСменуРоликов = НормативыДляРЦ.ВремяНаСменуРоликов;
			стрНормативы.СкоростьПечати = НормативыДляРЦ.СкоростьПечати;
			стрНормативы.МетражДляРЦ = Выборка.ПогонныйМетраж+ МетрыНаБрак+МетрыНаНастройку;
			Если текРЦ.РЦ.ВидРабочегоЦентра= Справочники.ВидыРабочихЦентров.Indigo Тогда 
				ВсегоКликов  =  НормативыДляРЦ.ВсегоКликов;
				стрНормативы.КоличествоКликов = НормативыДляРЦ.ВсегоКликов;
			КонецЕсли; 
			//				//	ВремяВыполненияЗаказаВЧасах = ВремяВыполненияЗаказаВЧасах+НормативыДляРЦ.ВремяПечати+НормативыДляРЦ.ВремяНаНастройку;
			стрНормативы.ПроцентНаБрак = НормативыДляРЦ.ПроцентНаБрак;
			стрНормативы.Штампы = ШтампыСтрокойПоПрокату(Заказ,текРЦ.НомерПроката); 
			стрНормативы.Записать();
			//Определим и запишем в затраты на материалы по РЦ 
			//Для Комбинированного заказа необходимо предварительно уточнить количество этикеток в заказе материала и пересчитать его себестоимость
			ЗапросЗаказыМатериалов = Новый Запрос;
			ЗапросЗаказыМатериалов.текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиентаЦвета.ЗаказМатериала КАК ЗаказМатериала
			|ИЗ
			|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
			|ГДЕ
			|	ЗаказКлиентаЦвета.Ссылка = &Заказ
			|	И ЗаказКлиентаЦвета.НомерПроката = &НомерПроката
			|	И ЗаказКлиентаЦвета.ЗаказМатериала <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)";
			ЗапросЗаказыМатериалов.УстановитьПараметр("Заказ", Заказ);
			ЗапросЗаказыМатериалов.УстановитьПараметр("НомерПроката", ТекРЦ.НомерПроката);

			ВыборкаЗаказыМатериалов = ЗапросЗаказыМатериалов.Выполнить().Выбрать();
			
			//20201222 - если явно не указано, что пересчитывать не надо
			Если Не Заказ.НеПересчитыватьПФ  Тогда 
				Пока ВыборкаЗаказыМатериалов.Следующий() Цикл
					ТиражДляМатериала =   (Выборка.Количество*(1+(МетрыНаБрак+МетрыНаНастройку)/Выборка.ПогонныйМетраж))/КоэффициентЕдИзм ;
					УточнитьКоличествоЭтикетокЗаказа(ВыборкаЗаказыМатериалов.ЗаказМатериала, ТиражДляМатериала);
					РассчитатьСебестоимость_НормативыЗаказа(ВыборкаЗаказыМатериалов.ЗаказМатериала);
				КонецЦикла;
			КонецЕсли;
			ЗатратыНаМатериалыПоРЦ = РассчитатьЗатратыНаМатериалыПоРЦ(Заказ, ТекРЦ.НомерПроката, Выборка.Количество, Выборка.ПогонныйМетраж, МетрыНаБрак, МетрыНаНастройку, Выборка.РабочийЦентр, Заказ);
			ЗатратыНаМатериалы = ЗатратыНаМатериалы +  ЗатратыНаМатериалыПоРЦ;
			
		Иначе Сообщить(НормативыДляРЦ);;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	

	МетровВсего = (МетрыНаБрак+МетрыНаНастройку+Выборка.ПогонныйМетраж )*Выборка.НарезкаРазмер/1000;
	
	//Если заказ комбинированный, необходимо определить количество этикеток для заказа основы
				 //Выборка.Количество*(1+(МетрыНаБрак+МетрыНаНастройку)/Выборка.ПогонныйМетраж);

	ТиражВсего =  (Выборка.Количество*(1+(МетрыНаБрак+МетрыНаНастройку)/Выборка.ПогонныйМетраж))/КоэффициентЕдИзм ;


	
	//20200810 - Иванова Пока убираем
	Если ЗначениеЗаполнено(Заказ.ЗаказОсновногоМатериала) И Не Заказ.НеПересчитыватьПФ Тогда 
	
		УточнитьКоличествоЭтикетокЗаказа(Заказ.ЗаказОсновногоМатериала, ТиражВсего);
		
		Если ЗначениеЗаполнено(Заказ.ЗаказОсновногоМатериала) Тогда 
			РассчитатьСебестоимость_НормативыЗаказа(Заказ.ЗаказОсновногоМатериала);
	    КонецЕсли;
	КонецЕсли;

	//Добавляем Расчет Доходности
	Затраты = РассчитатьЗатратыПоРЦ(Заказ,Выборка.РабочийЦентр, Выборка.Количество, МетровВсего,Выборка.СуммаЗаказаРасчет , ВсегоКликов, МойкаСекций,ЗатратыНаОснастку, Заказ );
	
	//			Затраты = РассчитатьЗатратыПоРЦ(Заказ,ВыбСпецификация.Спецификация,ВыборкаВариант.НомерВарианта, Выборка,НормативыДляРЦ.ПоказателиДляТаблиц,  Количество, МетровВсего,МойкаСекций, ЗатратыНаОснастку);
	//Затраты = Затраты+ЗатратыНаМатериалы;     Затраты на материалы уже включены
	К_Дох = ПолучитьКоэффициентНалоговВДоходности(ТекущаяДата(), Заказ.Площадка);
				
	Доход = К_Дох*Выборка.СуммаЗаказаРасчет-Затраты;
	//Расчет доходности в час
	Если  НормативыДляРЦ.ВремяВыполненияЗаказа>0 Тогда
		Если ВремяЗаказаДляДоходности>0  Тогда 
			Доходность = Окр(Доход/(ВремяЗаказаДляДоходности)*60); //Т.к. время выпонения в минутах
		//Иначе
		//	Доходность =Доход;	
		//КонецЕсли;
		КонецЕсли;
	Иначе
		Доходность = 0;
	КонецЕсли;
	
	ПарамПервогоРЦ =РегистрыСведений.Лико_ПараметрыПроизводстваЗаказа.СоздатьМенеджерЗаписи();
	ПарамПервогоРЦ.Заказ = Заказ;
	ПарамПервогоРЦ.НомерПроката = 1;
	ПарамПервогоРЦ.РабочийЦентр = Выборка.РабочийЦентр;
	ПарамПервогоРЦ.Прочитать();
	ПарамПервогоРЦ.Доходность = Доходность;
	ПарамПервогоРЦ.Доход = Доход;
	Если ЗначениеЗаполнено(Выборка.СуммаЗаказаРасчет) Тогда 
		ПарамПервогоРЦ.Рентабельность = Окр(Доход/Выборка.СуммаЗаказаРасчет*100,2);
	КонецЕсли;	
	ПарамПервогоРЦ.Стоимость =Выборка.СуммаЗаказаРасчет;
	ПарамПервогоРЦ.СебеСтоимость =Затраты;
	ПарамПервогоРЦ.Тираж = Выборка.количество/1000;
	ПарамПервогоРЦ.МетражКвМ = Выборка.КвадратныйМетраж;
	ПарамПервогоРЦ.Цена = Выборка.Цена;
	ПарамПервогоРЦ.ЗатратыНаОснастку = ЗатратыНаОснастку;
	ПарамПервогоРЦ.ДатаОценки = ТекущаяДата();
	ПарамПервогоРЦ.Записать();				
	//		КонецЦикла;
	//		//Записшем данные по основному материалу
	//		Если МетровВсегоОсн< МетровВсего Тогда
	//			МетровВсегоОсн=МетровВсего;
	//			НарезкаОснМат =ВыборкаВариант.ШиринаРулона; 
	//		КонецЕсли;	
	Отказ = Ложь;

КонецПроцедуры

&Вместо("ПолучитьНомерДляЗаказа")
Функция Лико_ПолучитьНомерДляЗаказа(Организация, типЗаказа, видЗаказа, Регион)


	УстановитьПривилегированныйРежим(Истина);

	КодРегиона = Регион.КодРегиона;
	ПерваяЦифра = СокрЛП(КодРегиона);
	// <-- Начало Лико Яцун С. В. 26.12.2024 
	Если Регион = Справочники.БизнесРегионы.Линкс Тогда
		ПерваяЦифра = Сред(СокрЛП(КодРегиона),1,1);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 26.12.2024
	ВтораяЦифра = Сред(Строка(ТекущаяДата()), 10,1);
	Если ЗначениеЗаполнено(ТипЗаказа) Тогда
		Если типЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор Тогда
			ТретьяЦифра = "5"; // Такая же, как у обычного полуфабриката
		Иначе
			ТретьяЦифра = Строка(Перечисления.Лико_ТипыЗаказов.Индекс(ТипЗаказа));
		КонецЕсли;
	Иначе 	
		ТретьяЦифра = "1";
	КонецЕсли; 

	//Если (ПерваяЦифра = "1"  ) И ТретьяЦифра = "1" Тогда    // ИЛИ ПерваяЦифра = "7" ИЛИ ПерваяЦифра = "9" 
	//	ТретьяЦифра = "6";
	//КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 29.11.2024
	// У Сибири кончились номера для самоклейки
	//Если ПерваяЦифра = "9" И ТретьяЦифра = "1" Тогда  
	//	ТретьяЦифра = "6";
	//КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 29.11.2024

	Если ЗначениеЗаполнено(ВидЗаказа) Тогда 
		Если ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда 
			ТретьяЦифра = "9";
		ИначеЕсли 	ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПричинаРекламация Тогда 
			ТретьяЦифра = "7";
		ИначеЕсли 	ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка Тогда 
			ТретьяЦифра = "8";
		КонецЕсли;
	КонецЕсли;


	ПервыеЦифры = "00"+ Перваяцифра+ВтораяЦифра+ТретьяЦифра;


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(ЗаказКлиента.Номер, 5, 7) КАК Номер
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ПОДСТРОКА(ЗаказКлиента.Номер, 3, 5) = &ПрефиксСтарый
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	// <-- Начало Лико Яцун С. В. 16.12.2024
	РегионЛинкс = Ложь;	
	Если Регион = Справочники.БизнесРегионы.Линкс Тогда
		РегионЛинкс = Истина;
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПОДСТРОКА(ЗаказКлиента.Номер, 3, 5) = &ПрефиксСтарый","ПОДСТРОКА(ЗаказКлиента.Номер, 3, 5) = &ПрефиксСтарый И ПОДСТРОКА(ЗаказКлиента.Номер, 5, 7) ПОДОБНО ""___[2-9]___""");
		//ЧетвертаяЦифраМинимум = "2";
		//ПервыеЦифры	= ПервыеЦифры + ЧетвертаяЦифраМинимум;
	ИначеЕсли Регион = Справочники.БизнесРегионы.ВеликийНовгород Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПОДСТРОКА(ЗаказКлиента.Номер, 3, 5) = &ПрефиксСтарый","ПОДСТРОКА(ЗаказКлиента.Номер, 3, 5) = &ПрефиксСтарый И НЕ ПОДСТРОКА(ЗаказКлиента.Номер, 5, 7) ПОДОБНО ""___[2-9]___""");
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 16.12.2024
	
	Запрос.УстановитьПараметр("ПрефиксСтарый", ПервыеЦифры);

	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.Номер) Тогда 
		Номер = Организация.Префикс+"00"+Строка(Формат(Число(Результат.Номер ) +1, "ЧГ=0") );
	Иначе
		// <-- Начало Лико Яцун С. В. 16.12.2024
		//Номер = Организация.Префикс+ПервыеЦифры+"0001";
		Если РегионЛинкс Тогда
			Номер = Организация.Префикс+ПервыеЦифры+"2001";
		Иначе
			Номер = Организация.Префикс+ПервыеЦифры+"0001";
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 16.12.2024
	КонецЕсли;

	Возврат Номер;

КонецФункции



&Вместо("ПередЗаписьюДокументов_ЗаказКлиента")
Процедура Лико_ПередЗаписьюДокументов_ЗаказКлиента(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Оснастка Тогда 
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;

	
	
	Если Источник.Товары.Количество() >0 Тогда
		Если ЗначениеЗаполнено(Источник.Товары[0].Номенклатура) Тогда 
			Источник.ЕдиницаИзмеренияЗаказа =  Источник.Товары[0].Номенклатура.ЕдиницаИзмерения;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Источник.Товары[0].ВнутреннийДиаметр) Тогда 
			Источник.Втулка =  Источник.Товары[0].ВнутреннийДиаметр;
		КонецЕсли;

	КонецЕсли;
	
		
	// --> Начало Лико Митюшин МФМ 15.06.2021
	//Лико_ТиражМетраж.РасчитатьТиражМетраж(Источник) ;
	Если ЗначениеЗаполнено(Источник.ДатаОтправкиВРаботу) И (Источник.МетражКВМ = 0 Или Источник.ШтКВМ = 0) Тогда
		Сообщить("Метраж или Шт КВМ равны 0, проверьте и укажите правильные парамметры штампа.");
		Отказ = Истина;	
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 15.06.2021
	ПоперечнаяРезка = Ложь;
	Если Источник.Товары.Найти(Истина, "ПоперечнаяРезка") <>Неопределено Тогда 
		ПоперечнаяРезка = Истина;
	КонецЕсли;
    Источник.ПоперечнаяРезка = ПоперечнаяРезка;
	
	
	//Заполним Этикетки	
	Этикетки = "";
	Если Источник.ТИпЗаказа = Перечисления.Лико_ТипыЗаказов.Полуфабрикат Тогда 
		Таб = Источник.Товары.Выгрузить();
		Таб.Свернуть("Номенклатура,КодЭтикеткиЗаказчика");
		Для каждого стр из Таб Цикл
			Если ЗначениеЗаполнено(стр.Номенклатура.ЦеноваяГруппа) Тогда 
				Этикетки = Этикетки + "("+СокрЛП(стр.Номенклатура.ЦеноваяГруппа.Код)+")"+" "+СокрЛП(стр.Номенклатура.Наименование);
			Иначе
				Этикетки = Этикетки + " "+СокрЛП(стр.Номенклатура.Наименование);
			КонецЕсли;
			Если ЗначениеЗаполнено(стр.КодЭтикеткиЗаказчика)Тогда
				Этикетки = Этикетки +" * "+ стр.КодЭтикеткиЗаказчика;
			КонецЕсли;	
		КонецЦикла;	 
	Иначе	
		Таб = Источник.Товары.Выгрузить();
		Таб.Свернуть("Номенклатура,КодЭтикеткиЗаказчика");
		Для каждого стр из Таб Цикл
			Этикетки = Этикетки + стр.Номенклатура.Лико_ТипЭтикетки+" "+СокрЛП(стр.Номенклатура.Наименование);
			Если ЗначениеЗаполнено(стр.КодЭтикеткиЗаказчика)Тогда
				Этикетки = Этикетки +" * "+ стр.КодЭтикеткиЗаказчика;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Источник.ОтгрузкаСНастройкой) И Источник.ОтгрузкаСНастройкой<> Неопределено Тогда 
		Источник.ОтгрузкаСНастройкой = Неопределено;
	КонецЕсли;
	Источник.Этикетки  = Этикетки;
	НомераКонтрактов = "";
	Таб = Источник.Товары.Выгрузить();
	Таб.Свернуть("NКонтракта");
	Для каждого стр из Таб Цикл
		Если ЗначениеЗаполнено(стр.NКонтракта) Тогда 
			НомераКонтрактов = НомераКонтрактов+ ?(ЗначениеЗаполнено(НомераКонтрактов)," * ", "") + стр.NКонтракта;	
		КонецЕсли;	
	КонецЦикла;
	Источник.НомераКонтрактов =НомераКонтрактов;
	
	Артикулы = "";
	Таб = Источник.Товары.Выгрузить();
	Таб.Свернуть("Номенклатура,ВерсияНоменклатуры");
	Для каждого стр из Таб Цикл
		Если ЗначениеЗаполнено(стр.Номенклатура) Тогда 
			Если стр.Номенклатура.Лико_DFM Тогда 
				Артикулы = Артикулы+ ?(ЗначениеЗаполнено(Артикулы)," * ", "") + стр.ВерсияНоменклатуры.Артикул;
			Иначе	
				Артикулы = Артикулы+ ?(ЗначениеЗаполнено(Артикулы)," * ", "") + стр.Номенклатура.Артикул;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Источник.Артикулы =Артикулы;
	
	//Заполним договор
	Если Не ЗначениеЗаполнено(Источник.Договор) Тогда 
		Если ЗначениеЗаполнено(Источник.Партнер) И ЗначениеЗаполнено(Источник.Контрагент) Тогда 
			Источник.Договор = ЗаполнитьДоговорНаСервере(Источник.Партнер,Источник.Контрагент, Источник.Менеджер);
		КонецЕсли;	
	КонецЕсли;

	
	
	ОригиналМакет = Ложь;
	Таб = Источник.Товары.Выгрузить();
	Таб.Свернуть("ОригиналМакет");
	Для каждого стр из Таб Цикл
		Если ЗначениеЗаполнено(стр.ОригиналМакет) Тогда 
			ОригиналМакет = Истина;
		КонецЕсли;	
	КонецЦикла;
	Источник.ОригиналМакет =ОригиналМакет;
	

	ШтампыСтрокой = "";
	ДопМатериалыСтрокой = "";	
	ВидСекцииТрафарет =  Справочники.Лико_ВидыСекций.ТрафаретнаяПечать;
    ВидСекцииНумератор = Справочники.Лико_ВидыСекций.Нумератор; 
	ВидСекцииКонгрев =    Справочники.Лико_ВидыСекций.Конгрев;
	ВидСекцииГорячееТиснениеСНумератором = Справочники.Лико_ВидыСекций.ГорячееТиснениеСНумератором;
	ВидСекцииКнижка = Справочники.Лико_ВидыСекций.Книжка;
	ВидРЦNewFoil = Справочники.ВидыРабочихЦентров.NewFoil;
	ВидРЦIndigo = Справочники.ВидыРабочихЦентров.Indigo;
	 
	ЭтоЦифровой = Ложь;
	ЭтоНФ = ЛОжь;
	ЭтоКнижка = Ложь;
	ЭтоТрафарет = Ложь;
	ЭтоФлексо = Ложь;
	ЭтоТиснение = Ложь;
	ЭтоЛаминация = Ложь;    
	ЭтоКонгрев = Ложь;  
	ЭтоНумератор = Ложь;
	ЛейблШифтер = Ложь;	
		 
	//Если Не Источник.РучнойВводПрокатов Тогда
	//	ЗаполнитьНомерПроката(Источник, Источник.Цифровой) ;
	//КонецЕсли;

//	ПроставитьНомераРабот(Источник);
	Для каждого стр из Источник.Цвета Цикл
		Если Не стр.номерварианта =1 Тогда 
			стр.номерварианта = 1;
		КонецЕсли;
			 
		Если стр.ВидСекции = ВидСекцииТрафарет И Не ЭтоТрафарет Тогда 
			ЭтоТрафарет = Истина;
		//ИначеЕсли  стр.ВидСекции.Родитель = Справочники.Лико_ВидыСекций.Флексо Тогда
		//	 ЭтоФлексо = Истина; 
		ИначеЕсли стр.ВидСекции.Тиснение И Не ЭтоТиснение Тогда  
				ЭтоТиснение = Истина;
	    ИначеЕсли стр.ВидСекции.Ламинация И Не ЭтоЛаминация Тогда  
				ЭтоЛаминация = Истина; 
		ИначеЕсли (стр.ВидСекции = ВидСекцииНумератор ИЛИ   стр.ВидСекции = ВидСекцииГорячееТиснениеСНумератором) И Не ЭтоНумератор Тогда  
				ЭтоНумератор = Истина;	
		ИначеЕсли стр.ВидСекции = ВидСекцииКонгрев И Не ЭтоКонгрев Тогда  
				ЭтоКонгрев = Истина;						 
		ИначеЕсли  стр.ВидСекции = ВидСекцииКнижка  И Не ЭтоКнижка Тогда
            ЭтоКнижка = Истина;
		КонецЕсли;
		
		// --> Начало Лико Ефимов ЕВВ 04.08.2025
		Если Стр.ВидСекции = Справочники.Лико_ВидыСекций.ЛейблШифтер Тогда
			ЛейблШифтер = Истина;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 04.08.2025

		Если ЗначениеЗаполнено(стр.РабочийЦентр) Тогда 
			Если Стр.РабочийЦентр.ВидРабочегоЦентра  = ВидРЦNewFoil и Не ЭтоНФ Тогда  
				ЭтоНФНФ = Истина;
			ИначеЕсли Стр.РабочийЦентр.ВидРабочегоЦентра  = ВидРЦIndigo и Не ЭтоЦифровой Тогда  
				ЭтоЦифровой = Истина;	
			КонецЕсли;			
		КонецЕсли;
		
		//20231011
		//Переносим из Видов Работ в Цвета 
	    Если ЗначениеЗаполнено(стр.Оснастка) Тогда 
			ШтампыСтрокой = ШтампыСтрокой+ ?(ЗначениеЗаполнено(ШтампыСтрокой)," * ", "") + стр.Оснастка.Артикул;	
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Материал) Тогда
			Если стрНайти(ДопМатериалыСтрокой,стр.Материал.Наименование)=0 Тогда  
				ДопМатериалыСтрокой = ДопМатериалыСтрокой+?(ЗначениеЗаполнено(ДопМатериалыСтрокой)," * ", "") +стр.Нарезка+" "+ стр.Материал.Наименование;
			КонецЕсли;	
		КонецЕсли;

		
	КонецЦикла;	
	
	Если Источник.Трафарет <> ЭтоТрафарет Тогда 
		Источник.Трафарет = ЭтоТрафарет;
	КонецЕсли;
	
	Если Источник.Тиснение <> ЭтоТиснение Тогда 
		Источник.Тиснение = ЭтоТиснение;
	КонецЕсли; 
	
	Если Источник.Ламинация <> ЭтоЛаминация Тогда 
		Источник.Ламинация = ЭтоЛаминация ;
	КонецЕсли;   
	
	Если Источник.Нумератор <> ЭтоНумератор Тогда 
		Источник.Нумератор = ЭтоНумератор ;
	КонецЕсли;
	
	Если Источник.Конгрев <> ЭтоКонгрев Тогда 
		Источник.Конгрев = ЭтоКонгрев ;
	КонецЕсли; 
	
	Если Источник.Цифровой <> ЭтоЦифровой Тогда 
		Источник.Цифровой = ЭтоЦифровой ;
	КонецЕсли;
	
	Если Источник.НФ <> ЭтоНФ Тогда 
		Источник.НФ = ЭтоНФ ;
	КонецЕсли; 
	
	Если Не Источник.Цифровой Тогда 
		Источник.КоличествоКликов = 0;
	КонецЕсли;   
	
	Если Источник.КнижныйМодуль <> ЭтоКнижка Тогда 
		 Источник.КнижныйМодуль = ЭтоКнижка;
	КонецЕсли;  
	Если НЕ Источник.Книжка И ЭтоКнижка Тогда 
		 Источник.Книжка = ЭтоКнижка;
	КонецЕсли;  
	
	Источник.ЛейблШифтер = ЛейблШифтер;
	
	Источник.ШтампыСтрокой =ШтампыСтрокой;
	Источник.ДопМатериалыСтрокой =ДопМатериалыСтрокой;
	СтруктураЦены = ПолучитьСреднююЦену(Источник.Ссылка);
	Если  Источник.Товары.Итог("Количество")>0 Тогда
		Источник.ЦенаСредняя =  Источник.Товары.Итог("Сумма")/Источник.Товары.Итог("Количество");
	КонецЕсли;
	Источник.ЦенаДляДокументовСредняя = СтруктураЦены.ЦенаДляДокументовСредняя;
	Источник.СуммаДокумента = Источник.Товары.Итог("СуммаСНДС")+Источник.СтоимостьОснастки;
	
	//Заполним Цвета
	Источник.ЦветаСтрокой = ПолучитьСтрокуЦветов(Источник.Ссылка);
	Если Источник.Цифровой Тогда
		Источник.ЦветаСтрокойЦифра = СтрокаЛакиПоЗаказу(Источник.Ссылка, Истина);
	КонецЕсли;
	Источник.ФормыСтрокой =ПолучитьСтрокуФорм(Источник.Ссылка);
	// --> Начало Лико Ефимов ЕВВ 18.08.2021 
	Источник.GtinСтрокой = ПолучитьGtinСтрокой(Источник);
	// <-- Конец Лико Ефимов ЕВВ 18.08.2021 
	//Первый Рабочий Центр
	//Если Заказ отправлен в работу, то рабочий центр не меняем
	Если Не ЗначениеЗаполнено(Источник.ДатаОтправкиВРаботу) Тогда 
		стр = Источник.ВидыРабот.Найти(1, "НомерПроката");
		Если стр<>Неопределено Тогда 
			Источник.РабочийЦентр = стр.РабочийЦентр;
		КонецЕсли;
	КонецЕсли;  
	
	Если Источник.РабочийЦентр.ПорядковыйНомер = 300 И Источник.Площадка = Справочники.Лико_Площадки.Ликофлекс Тогда 
		Источник.ГруппировкаДляОтчетов = Справочники.Лико_ГруппировкиОтчетовНаСайте.ИксПакДляЛикофлекс;
	ИначеЕсли Источник.Площадка = Справочники.Лико_Площадки.Ликофлекс И Источник.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда 
		Источник.ГруппировкаДляОтчетов = Справочники.Лико_ГруппировкиОтчетовНаСайте.ЛикофлексТУ;    
	Иначе
		Источник.ГруппировкаДляОтчетов = Источник.Площадка.ГруппировкаДляОтчетов;
    КонецЕсли;
	
	
	// --> Начало Лико Ефимов ЕВВ 02.09.2024
	Источник.ЕстьНезаполненныеФормы = Ложь;
	Для каждого Строка из Источник.Цвета Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Форма)
			И ЗначениеЗаполнено(Строка.ВидТМЦ)
			И НЕ ВРег(СокрЛП(Строка.Название)) = ВРег("Полоса")
			И (Строка.ВидЗаливки = Перечисления.Лико_ВидЗаливки.НеСплошная
				ИЛИ Строка.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Краска) 
			И НЕ (Строка.ВидСекции = Справочники.Лико_ВидыСекций.ЦифровойЛак
				ИЛИ Строка.ВидСекции = Справочники.Лико_ВидыСекций.Инкджет
				ИЛИ Строка.ВидСекции = Справочники.Лико_ВидыСекций.ЦифровоеТиснение
				ИЛИ Строка.ВидСекции = Справочники.Лико_ВидыСекций.Нумератор)
			И Строка.РабочийЦентр.ВидРабочегоЦентра <> Справочники.ВидыРабочихЦентров.СклейкаТермоусадки
			Тогда
			Источник.ЕстьНезаполненныеФормы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// <-- Конец Лико Ефимов ЕВВ 02.09.2024
		
	УстановитьПривилегированныйРежим(Ложь);
	


КонецПроцедуры


&Вместо("ПроверкаЗаполненияЗаказа")
Функция Лико_ПроверкаЗаполненияЗаказа(Заказ)
	Если Заказ.Площадка <> Справочники.Лико_Площадки.Линкс Тогда 
		Если  Заказ.ВидЗаказа= Перечисления.Лико_ВидыЗаказов.ПолныйПовтор ИЛИ Заказ.ВидЗаказа= Перечисления.Лико_ВидыЗаказов.ПовторСИзменением ИЛИ  Заказ.ВидЗаказа= Перечисления.Лико_ВидыЗаказов.ПовторСНовымОбъединением  ИЛИ  Заказ.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.ПолныйповторСПеревыводом Тогда
			Если Не ЗначениеЗаполнено(Заказ.ПовторЗаказа) Тогда
				Возврат "Необходимо указать номер повторяемого заказа!";
			КонецЕсли;
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.ОсновнойМатериал.Код КАК ОсновнойМатериалКод
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Заказ
		|	И ЗаказКлиента.ВидЗаказа <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник)
		|			И ЗаказКлиента.ВидЗаказа <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ЦифроваяПроба)
		|			И ЗаказКлиента.ВидЗаказа <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ТестированиеМатериалов)
		|	И ВЫБОР
		|			КОГДА ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
		|				ТОГДА ПОДСТРОКА(ЗаказКлиента.ОсновнойМатериал.ЦеноваяГруппа.Код, 1, 1) = ""9""
		|						ИЛИ ПОДСТРОКА(ЗаказКлиента.ОсновнойМатериал.ЦеноваяГруппа.Код, 1, 3) = ""598""
		|			ИНАЧЕ ПОДСТРОКА(ЗаказКлиента.ОсновнойМатериал.Код, 1, 1) = ""9""
		|					ИЛИ ПОДСТРОКА(ЗаказКлиента.ОсновнойМатериал.Код, 1, 3) = ""598""
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("Заказ", Заказ);		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Результат = РезультатЗапроса.Выбрать();
			Результат.Следующий();
			Если ЗначениеЗаполнено(Результат.ОсновнойМатериалКод) Тогда 
				Возврат "Выбранный основной материал применяется только для пробников!!!";
			КонецЕсли;	
		КонецЕсли;	

		
		
	КонецЕсли;	

	
	Если не (РольДоступна("ПолныеПрава") или РОльДоступна("Лико_ЗакрытиеОтгрузки") ) Тогда 
		Если Заказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда 
			Если Заказ.ОбразецЦвета = Перечисления.Лико_ОбразцыЦвета.УтверждениеОбразцаПриПечати Тогда 
				 Возврат "Не корректно указан образец цвета для Полного повтора! ";
			КонецЕсли;
			Если Заказ.ЧестныйЗнак Тогда 
				 Возврат "Честный знак не может быть Полным повтором! ";
			КонецЕсли;

			
			Если Заказ.Площадка = Справочники.Лико_Площадки.Ликофлекс Тогда 
				ОбъектКопирования = Заказ.ПовторЗаказа;
				Если ЗначениеЗаполнено(ОбъектКопирования) Тогда 
					ВидРЦПервогоПрокатаЗаказа = ПолучитьРЦПервогоПроката(Заказ);
					ВидРЦПервогоПрокатаОК = ПолучитьРЦПервогоПроката(ОбъектКопирования);
					МассивРЦРавны = Новый Массив;
					МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.GallusGranitic);
					МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.Omet);
					МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.MPS);   
					МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.Flexo);

					Если ВидРЦПервогоПрокатаЗаказа <> ВидРЦПервогоПрокатаОК Тогда
						// <-- Начало Лико Яцун С. В. 19.06.2024
						Если ВидРЦПервогоПрокатаЗаказа = Справочники.ВидыРабочихЦентров.GallusInkjet 
							И Заказ.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.Инкджет)).Количество() = 0 
							И Заказ.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.ЦифровойЛак)).Количество() = 0 Тогда
							МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.GallusInkjet);	 	
						ИначеЕсли ВидРЦПервогоПрокатаОК = Справочники.ВидыРабочихЦентров.GallusInkjet 
							И ОбъектКопирования.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.Инкджет)).Количество() = 0 
							И ОбъектКопирования.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.ЦифровойЛак)).Количество() = 0 Тогда
							МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.GallusInkjet);
						ИначеЕсли ВидРЦПервогоПрокатаЗаказа = Справочники.ВидыРабочихЦентров.Bobst ИЛИ ВидРЦПервогоПрокатаЗаказа = Справочники.ВидыРабочихЦентров.Rotomec Тогда
							МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.Rotomec);
							МассивРЦРавны.Добавить(Справочники.ВидыРабочихЦентров.Bobst);
						КонецЕсли;
						// <-- Конец Лико Яцун С. В. 19.06.2024
						Если МассивРЦРавны.Найти(ВидРЦПервогоПрокатаЗаказа) = Неопределено ИЛИ МассивРЦРавны.Найти(ВидРЦПервогоПрокатаОК) = Неопределено Тогда
							Возврат "Вид РЦ заказа и Вид РЦ объекта копирования не совпадают! ";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
		
	Если Заказ.Товары.Количество()= 0 Тогда 
		Возврат "В заказе не указано, что необходимо выполнить!";	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.Соглашение)  Тогда 
		Возврат "В заказе не указано соглашение!";	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.ВалютаДляДокументов)  Тогда 
		Возврат "В заказе не указана валюта для документов!";	
	КонецЕсли;

	
	Если Заказ.ОбразцыЦвета.Количество() = 0 Тогда 
		Возврат "Не указан образец цвета!";
	КонецЕсли;
	
	Если Заказ.ОбразцыЦвета.Найти(Перечисления.Лико_ОбразцыЦвета.ВнутреннийОбразец) <> Неопределено Тогда 
		Возврат "Данное определение образца цвета больше не используется, укажите образец цвета!";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.ОсновнойМатериал) Тогда 
		Возврат "Не указан основной материал";
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Заказ.СпособНаклейки) Тогда 
		Возврат "Не указан способ наклейки";
	КонецЕсли;

	
	Если Заказ.Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
		Если  Не ЗначениеЗаполнено(Заказ.ВидКонтактаСПищевойПродукцией)  Тогда 
			Возврат "В заказе не указан вид контакта с пищевой продукцией!";	
		КонецЕсли;
		Если Заказ.ВидКонтактаСПищевойПродукцией = Справочники.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт Тогда 
			КонтактныйСлой = Заказ.ОсновнойМатериалКонтактныйСлой;
			Для Каждого стр из Заказ.ВидыРабот Цикл
				Если стр.КонтактныйСлой Тогда
					КонтактныйСлой = стр.КонтактныйСлой;
				КонецЕсли;
			КонецЦикла;
			Если  Не КонтактныйСлой  Тогда 
				Возврат "В заказе не указан контактный слой с пищевой продукцией!";	
			КонецЕсли;
		КонецЕсли;
			
	КонецЕсли;



	


	
	Если Заказ.ВидЗаказа<>Перечисления.Лико_ВидыЗаказов.Пробник И  Заказ.ВидЗаказа<>Перечисления.Лико_ВидыЗаказов.ЦифроваяПроба И Заказ.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.Полуфабрикат Тогда 
		Если Не ЗначениеЗаполнено(Заказ.ВидУпаковки) Тогда 
			Возврат "Не указан вид упаковки!";
		КонецЕсли;	
	КонецЕсли;

	
	//Если в вырубном штампе только 1 ручей, то в намотке не должно быть продольной резки
	Если Заказ.Ручьи = 1 Тогда 
		Отбор = Новый Структура("ПродольнаяРезка", Истина);
		Резка = Заказ.Товары.НайтиСтроки(Отбор);
		Если Резка.Количество() >0 Тогда 
			Возврат "В заказе указан 1 ручей, продольная резка не возможна!";
		КонецЕсли;
	КонецЕсли;	
	
	Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда 
		Если (Заказ.ШиринаРукаваТУ*2+6)<>Заказ.ШиринаЭтикетки Тогда 
			Если (Заказ.ШиринаРукаваТУ*2+7)<>Заказ.ШиринаЭтикетки Тогда 
				Возврат "Не корректно указана ширина этикетки или ширина рукава!";
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Для каждого стр из Заказ.Товары Цикл
		Если стр.Количество = 0 Тогда 
			Возврат "В строке №"+стр.номерстроки+" указано нулевое количество";		
		КонецЕсли;
		Если Заказ.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.Полуфабрикат Тогда 
			Если Заказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.Пробник И  Заказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ЦифроваяПроба и Заказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ВнутренниеНужды Тогда
				Если стр.Сумма = 0 Тогда 
					Возврат "В строке №"+стр.номерстроки+" указана нулевая сумма";	
				КонецЕсли;

				Если ЗначениеЗаполнено(стр.кромка) ТОгда
					Если Не ЗначениеЗаполнено(стр.КоличествоЭтикетокВРолике) И Не ЗначениеЗаполнено(стр.МаксимальныйДиаметрРулона) Тогда
						Возврат "В строке №"+стр.номерстроки+" не указано количество эт. в ролике/пачке или макс. диаметр!";
					КонецЕсли;
				КонецЕсли;	
				Если Заказ.ТипЗаказа <>Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка И Заказ.ТипЗаказа <>Перечисления.Лико_ТипыЗаказов.Термоусадка И Заказ.ТипЗаказа <>Перечисления.Лико_ТипыЗаказов.Упаковка Тогда 
					Если стр.БезКромки = Ложь и Не ЗначениеЗаполнено(стр.Кромка) Тогда 
						Возврат "В строке №"+стр.номерстроки+" не указан размер кромки";
					КонецЕсли;
					Если Не стр.ПоперечнаяРезка Тогда 
						Если Не ЗначениеЗаполнено(стр.Направление) Тогда 
							Возврат "В строке №"+стр.номерстроки+" не указано направление намотки";
						КонецЕсли;
						Если Не ЗначениеЗаполнено(стр.ВнутреннийДиаметр) Тогда 
							Возврат "В строке №"+стр.номерстроки+" не указан внутренний диаметр (втулка)";
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			Если Заказ.ТипЗаказа =Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка ИЛИ стр.ПоперечнаяРезка Тогда    //ИЛИ стр.ПродольнаяРезка 
				Если Не ЗначениеЗаполнено(стр.КоличествоЭтикетокВРолике) Тогда 
					Возврат "В строке №"+стр.номерстроки+" не указано количество этикеток в ролике/пачке";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
				
	КонецЦикла;

	
	////Если заказ числится выполненным, то в работу его не отправляем
	//Если Заказ.Состояние = Перечисления.Лико_СостоянияЗаказов.Выполнен ИЛИ Заказ.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда
	//	Возврат "Данный заказ уже выполнен!";	
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.Организация) Тогда
		Возврат "Необходимо указать Организацию!";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.Контрагент) Тогда
		Возврат "Необходимо указать контрагента!";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.Договор) Тогда
		Возврат "Необходимо указать договор!";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.ДатаОтгрузки) Тогда
		
		Возврат "Необходимо указать срок исполнения!";
	КонецЕсли;
	
	//Обязательно должна быть указана площадка!
	Если Не ЗначениеЗаполнено(Заказ.Площадка) Тогда
		Возврат "Необходимо указать площадку!";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заказ.Регион) Тогда
		Возврат "Необходимо указать регион!";
	КонецЕсли;
	
	 
	
	
		
	////Параметры Штампа
	//20210825 - отключено по распоряжению Борецкого, т.к. на инкджет сломалась вырубка
	//Проверка с 12.12.2016 Иванова А.В.
	//Если Заказ.Площадка = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда 
	//	Если Заказ.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Indigo ИЛИ Заказ.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Omega Тогда 
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ЗаказКлиентаВидыРабот.РабочийЦентр КАК РабочийЦентр,
	//		|	ЗаказКлиентаВидыРабот.Оснастка.Артикул КАК Артикул
	//		|ИЗ
	//		|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	//		|ГДЕ
	//		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	//		|	И ЗаказКлиентаВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Вырубка)
	//		|	И ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Omega) ";
	//		//|	И НЕ ЗаказКлиентаВидыРабот.РабочийЦентр.Наименование ПОДОБНО ""%Cartes%""";
	//		Запрос.УстановитьПараметр("Заказ", Заказ);		
	//		РезультатЗапроса = Запрос.Выполнить();
	//		Если Не РезультатЗапроса.Пустой() Тогда 
	//			Результат = РезультатЗапроса.Выбрать();
	//			Результат.Следующий();
	//			Если ЗначениеЗаполнено(Результат.Артикул) Тогда 
	//				Если Лев(Результат.Артикул,1) <> "7" Тогда
	//					Возврат "Название штампа для цифровых заказов должно начинаться на 7!";
	//				КонецЕсли;
	//			КонецЕсли;	
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЕсли;	
	
	//Если Не ЗначениеЗаполнено(Заказ.ЭтикетокнаЛисте) ИЛИ  Не ЗначениеЗаполнено(Заказ.Нарезка) ИЛИ Не ЗначениеЗаполнено(Заказ.Ручьи) Тогда
	//	Возврат "Не заполнены параметры штампа (нарезка, ручьи или этикеток на листе) ";
	//ИначеЕсли Не ЗначениеЗаполнено(Заказ.ШагПечати) И  Не ЗначениеЗаполнено(Заказ.Z) Тогда
	//	Возврат "Не заполнены параметры штампа";
	//КонецЕсли;
	
	
	//Полным правам и технологам можно направлять в работу заказы с материалами, которые отмечены как неиспользуемые
	Если Не (РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке")) Тогда 
		Если   Заказ.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.Полуфабрикат  ТОгда 
			Запрос = Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	ЗаказКлиента.Ссылка КАК Заказ,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
			|				ТОГДА ЗаказКлиента.ОсновнойМатериал.ЦеноваяГруппа
			|			ИНАЧЕ ЗаказКлиента.ОсновнойМатериал
			|		КОНЕЦ КАК Справочник.ЦеновыеГруппы) КАК Материал
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Заказ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказКлиентаЦвета.Ссылка,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЗаказКлиентаЦвета.Материал ССЫЛКА Справочник.Номенклатура
			|				ТОГДА ЗаказКлиентаЦвета.Материал.ЦеноваяГруппа
			|			ИНАЧЕ ЗаказКлиентаЦвета.Материал
			|		КОНЕЦ КАК Справочник.ЦеновыеГруппы)
			|ИЗ
			|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
			|ГДЕ
			|	ЗаказКлиентаЦвета.Ссылка = &Заказ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказКлиентаЦвета.Ссылка,
			|	ЗаказКлиентаЦвета.ТипКраски
			|ИЗ
			|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
			|ГДЕ
			|	ЗаказКлиентаЦвета.Ссылка = &Заказ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Заказ КАК Заказ,
			|	ВТ.Материал КАК Материал
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.НеИспользуетсяПлощадки КАК ЦеновыеГруппыНеИспользуетсяПлощадки
			|		ПО ВТ.Заказ.Площадка = ЦеновыеГруппыНеИспользуетсяПлощадки.Площадка
			|			И ВТ.Материал = ЦеновыеГруппыНеИспользуетсяПлощадки.Ссылка
			|ГДЕ
			|	(ВТ.Материал.НеИспользуется
			|			ИЛИ НЕ ЦеновыеГруппыНеИспользуетсяПлощадки.Площадка ЕСТЬ NULL)";
			Запрос.УстановитьПараметр("Заказ", Заказ);
			ВыборкаМатериалы = Запрос.Выполнить().Выбрать();
			Пока ВыборкаМатериалы.Следующий() Цикл
				Возврат "Не верно указан материал (краска, клей) "+ВыборкаМатериалы.Материал+ " , этот материал не используется на предприятии";
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
		
	//ЗапросИнкджет = Новый Запрос;
	//ЗапросИнкджет.Текст = 
	//"ВЫБРАТЬ
	//|	ТаблицаЦвета.Ссылка КАК Ссылка,
	//|	ТаблицаЦвета.НомерПроката КАК НомерПроката
	//|ПОМЕСТИТЬ ВТИнкджет
	//|ИЗ
	//|	Документ.ЗаказКлиента.Цвета КАК ТаблицаЦвета
	//|ГДЕ
	//|	ТаблицаЦвета.Ссылка = &Заказ
	//|	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Инкджет)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаЦвета.Ссылка,
	//|	ТаблицаЦвета.НомерПроката
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТИнкджет.Ссылка КАК Ссылка,
	//|	ВТИнкджет.НомерПроката КАК НомерПроката,
	//|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.РасходКраски, 0) КАК РасходКраски
	//|ИЗ
	//|	ВТИнкджет КАК ВТИнкджет
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	//|		ПО ВТИнкджет.Ссылка = ЗаказКлиентаВидыРабот.Ссылка
	//|			И ВТИнкджет.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
	//|			И (ЗаказКлиентаВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать))";
	//ЗапросИнкджет.УстановитьПараметр("Заказ", Заказ);
	//РезультатЗапроса =ЗапросИнкджет.Выполнить();
	//Если Не РезультатЗапроса.Пустой() Тогда 
	//	Результат = РезультатЗапроса.Выбрать();
	//	Результат.Следующий();
	//	Если Не ЗначениеЗаполнено(Результат.РасходКраски) Тогда 
	//		Возврат "Не указан расход краски! ";
	//	КонецЕсли;
	//КонецЕсли;	

	
	//Для каждого стр Из Заказ.ВидыРабот Цикл
	//	Если Не ЗначениеЗаполнено(стр.рабочийЦентр) Тогда 
	//		Возврат "В работах не указан рабочий центр! ";
	//	КонецЕсли;
	//	Если стр.рабочийцентр.видрабочегоцентра = справочники.ВидыРабочихЦентров.Indigo И Заказ.КоличествоКликов = 0 ТОгда 
	//		Возврат "Не указано количество кликов! ";
	//	КонецЕсли;
	//	Если стр.ВидРабот.родитель = Справочники.ВидыРаботСотрудников.Ламинирование Тогда 
	//		Если Не ЗначениеЗаполнено(стр.нарезка) Тогда 
	//			Возврат "Для работы ламинации не указана нарезка! ";
	//		КонецЕсли;
	//	ИначеЕсли стр.ВидРабот.родитель = Справочники.ВидыРаботСотрудников.Тиснение Тогда
	//		Если Не ЗначениеЗаполнено(стр.материал) Тогда 
	//			Возврат "Для работы тиснение не указан материал! ";
	//		КонецЕсли;
	//		Если Не ЗначениеЗаполнено(стр.нарезка) Тогда 
	//			Возврат "Для работы тиснение не указана нарезка! ";
	//		КонецЕсли;
	//		Если стр.ВидРабот =  Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное ИЛИ  стр.ВидРабот = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное Тогда
	//			Если Не ЗначениеЗаполнено(стр.дополнительно) Тогда 
	//				Возврат "Для работы тиснение не указана подача! ";
	//			КонецЕсли;	
	//		КонецЕсли;
	//	КонецЕсли;	

	//КонецЦикла;
		
		
	
	Если ВЗаказеПлоскоеТиснениеИКонгревВОдномПрокате(Заказ) Тогда 	
		Возврат "Выбран неверный вид работ плоского тиснения. При указанных параметрах тиснение может быть только поперечным! ";
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 15.09.2021
	Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор Тогда
		Если НЕ ЗначениеЗаполнено(Заказ.ВидПолуфабрикатаПодАппликтор) Тогда
			Возврат "Для заказа " + Заказ.ТипЗаказа + " необходимо заполнить Вид полуфабриката под аппликатор";
		КонецЕсли;
	КонецЕсли;
	
	Если Заказ.Комбинированный Тогда
		
		Если ЗначениеЗаполнено(Заказ.ЗаказОсновногоМатериала.ТипЗаказа) Тогда
			Если НЕ (Заказ.ЗаказОсновногоМатериала.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор
				ИЛИ Заказ.ЗаказОсновногоМатериала.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Полуфабрикат) Тогда
				Возврат "Для комбинированного заказа заказом основного материала должен быть заказ с типом """ + Перечисления.Лико_ТипыЗаказов.Полуфабрикат + """ или """ + Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор + """";
			КонецЕсли;
			Если Заказ.ЗаказОсновногоМатериала.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор
				И Заказ.ЗаказОсновногоМатериала.ВидПолуфабрикатаПодАппликтор <> Перечисления.Лико_ВидыПолуфабрикатаПодАппликтор.Нижний Тогда
				Возврат "Для комбинированного заказа заказом основного материала должен быть заказ с нижним видом полуфабриката под аппликатор";
			КонецЕсли;
		КонецЕсли;
		Для каждого Строка из Заказ.ВидыРабот Цикл
			Если ЗначениеЗаполнено(Строка.ЗаказМатериала) Тогда
				Если НЕ (Строка.ЗаказМатериала.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор
					ИЛИ Строка.ЗаказМатериала.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Полуфабрикат) Тогда
					Возврат "Для комбинированного заказа заказом материала в таблице Виды работ должен быть заказ с типом """ + Перечисления.Лико_ТипыЗаказов.Полуфабрикат + """ или """ + Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор + """";
				КонецЕсли;
				Если Строка.ЗаказМатериала.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор
					И Строка.ЗаказМатериала.ВидПолуфабрикатаПодАппликтор <> Перечисления.Лико_ВидыПолуфабрикатаПодАппликтор.Верхний Тогда
					Возврат "Для комбинированного заказа заказом основного материала должен быть заказ с верхним видом полуфабриката под аппликатор";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	// <-- Конец Лико Ефимов ЕВВ 15.09.2021
	 
	Возврат Истина;

КонецФункции

&Вместо("СоздатьДобавитьЭтапыПроизводства")
Процедура Лико_СоздатьДобавитьЭтапыПроизводства(Заказ, ЗаказПр, Площадка, Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
	|	ЗаказКлиентаВидыРабот.НомерПроката КАК НомерПроката
	|ПОМЕСТИТЬ Прокаты
	|ИЗ
	|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаВидыРабот.НомерПроката,
	|	ЗаказКлиентаВидыРабот.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПроката,
	|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.ВремяПечати + Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку) КАК Время
	|ПОМЕСТИТЬ ВТ_Время
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|ГДЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_СхемыПроизводстваЭтапы.ВидЭтапа КАК ВидЭтапа,
	|	Лико_СхемыПроизводстваЭтапы.ВидЭтапа.Наименование КАК ВидЭтапаНаименование,
	|	Прокаты.НомерПроката КАК НомерПроката,
	|	ЕСТЬNULL(ВТ_Время.Время, Лико_СхемыПроизводстваЭтапы.ВидЭтапа.ДлительностьЭтапа) КАК Длительность,
	|	Лико_СхемыПроизводстваЭтапы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТСхема
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_СхемыПроизводства.Этапы КАК Лико_СхемыПроизводстваЭтапы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Прокаты КАК Прокаты
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Время КАК ВТ_Время
	|				ПО Прокаты.НомерПроката = ВТ_Время.НомерПроката
	|			ПО (Лико_СхемыПроизводстваЭтапы.ВидЭтапа = ЗНАЧЕНИЕ(Справочник.Лико_ВидыЭтаповПроизводства.Прокат))
	|		ПО (ВЫБОР
	|				КОГДА ЗаказКлиента.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|					ТОГДА ВЫБОР
	|							КОГДА ЗаказКлиента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Оснастка)
	|								ТОГДА Лико_СхемыПроизводстваЭтапы.Ссылка.ТипЗаказа = ЗаказКлиента.ТипЗаказа
	|										И Лико_СхемыПроизводстваЭтапы.Ссылка.ВидЗаказа = ЗаказКлиента.ВидЗаказа
	|							ИНАЧЕ Лико_СхемыПроизводстваЭтапы.Ссылка.ТипЗаказа = ЗаказКлиента.ТипЗаказа
	|									И Лико_СхемыПроизводстваЭтапы.Ссылка.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПустаяСсылка)
	|						КОНЕЦ
	|				ИНАЧЕ Лико_СхемыПроизводстваЭтапы.Ссылка.ВидЗаказа = ЗаказКлиента.ВидЗаказа
	|			КОНЕЦ)
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСхема.ВидЭтапа КАК ВидЭтапа,
	|	ВТСхема.ВидЭтапаНаименование КАК ВидЭтапаНаименование,
	|	ВТСхема.НомерПроката КАК НомерПроката,
	|	ВТСхема.Длительность КАК Длительность,
	|	ЭтапПроизводства2_2.Ссылка КАК ДокЭтап,
	|	ВТСхема.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Этапы
	|ИЗ
	|	ВТСхема КАК ВТСхема
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ПО (ЭтапПроизводства2_2.Распоряжение.ДокументОснование = &Заказ
	|				ИЛИ ЭтапПроизводства2_2.Распоряжение.ДокументОснование.Лико_ЗаказКлиента = &Заказ)
	|			И ВТСхема.ВидЭтапа = ЭтапПроизводства2_2.ВидЭтапа
	|			И (ВЫБОР
	|				КОГДА ВТСхема.ВидЭтапа = ЗНАЧЕНИЕ(Справочник.Лико_ВидыЭтаповПроизводства.Прокат)
	|					ТОГДА ВТСхема.НомерПроката = ЭтапПроизводства2_2.НомерПроката
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ЭтапПроизводства2_2.Распоряжение = &ЗаказНаПроизводство)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Этапы.ВидЭтапа КАК ВидЭтапа,
	|	ВТ_Этапы.ВидЭтапаНаименование КАК ВидЭтапаНаименование,
	|	ВЫБОР
	|		КОГДА ВТ_Этапы.ВидЭтапа = ЗНАЧЕНИЕ(Справочник.Лико_ВидыЭтаповПроизводства.Гравировка)
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_Этапы.НомерПроката
	|	КОНЕЦ КАК НомерПроката,
	|	ВТ_Этапы.Длительность КАК Длительность,
	|	ВТ_Этапы.ДокЭтап КАК ДокЭтап
	|ИЗ
	|	ВТ_Этапы КАК ВТ_Этапы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Этапы.НомерСтроки,
	|	ВТ_Этапы.ВидЭтапа,
	|	ВТ_Этапы.ВидЭтапаНаименование,
	|	ВТ_Этапы.Длительность,
	|	ВТ_Этапы.ДокЭтап,
	|	ВЫБОР
	|		КОГДА ВТ_Этапы.ВидЭтапа = ЗНАЧЕНИЕ(Справочник.Лико_ВидыЭтаповПроизводства.Гравировка)
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_Этапы.НомерПроката
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Этапы.НомерСтроки УБЫВ,
	|	НомерПроката УБЫВ";

	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказПР);

	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоЭтапов = Выборка.Количество();
	СписокЭтапов = Новый СписокЗначений;
	сч = ВсегоЭтапов;
	ЭтапСледующий = Документы.ЭтапПроизводства2_2.ПустаяСсылка();
	ВыпускающийЭтап =  Документы.ЭтапПроизводства2_2.ПустаяСсылка();
	ПартияПроизводства = НайтиСоздатьПартиюПроизводства(ЗаказПР);
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ДокЭтап) Тогда 
			Этап = Выборка.ДокЭтап.ПолучитьОбъект();
			Этап.ПометкаУдаления = Ложь;
			Этап.Последователи.Очистить();
			Этап.НомерСледующегоЭтапа =0;
			Этап.ЯвляетсяНазначениемПродукции = Ложь;
			Этап.ВыходныеИзделия.Очистить();  
		Иначе	
			Этап = Документы.ЭтапПроизводства2_2.СоздатьДокумент();
		КонецЕсли;
			Этап.ПартияПроизводства = ПартияПроизводства;
			Этап.дата = ТекущаяДата();
			Этап.Распоряжение = ЗаказПр;
			Этап.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению;
			Этап.Подразделение = ЗаказПр.Подразделение;
			Этап.Организация = ЗаказПр.Организация;
			Этап.ВыпускПодДеятельность = ЗаказПр.ЗаказПодДеятельность;
			Этап.ВыпускПодДеятельность =Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			Этап.Ответственный = ЗаказПр.Ответственный;
			Этап.НаименованиеЭтапа = Выборка.ВидЭтапаНаименование + " "+Прав(Заказ.Номер,7); 
			Этап.КоличествоУпаковокПлан = 1;
			Этап.НомерЭтапа = сч;
			Этап.Валюта = Справочники.Валюты.НайтиПоКоду("978");
				
			Если ТипЗнч(ЗаказПр.ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца") Тогда 
				Этап.Партнер = ЗаказПр.ДокументОснование.Партнер;
				Этап.Договор = ЗаказПр.ДокументОснование.Договор;
				Этап.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья;
			Иначе
				Этап.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство;
			КонецЕсли;	
			Этап.ПроизводствоОднойДатой = Истина;
			Этап.ВидЭтапа = Выборка.ВидЭтапа;
			Этап.ДлительностьЭтапа = Выборка.Длительность;
			Этап.ЕдиницаИзмеренияДлительностиЭтапа =  Перечисления.ЕдиницыИзмеренияВремени.Минута;
			Этап.НомерПартииЗапуска = 1;
			Этап.НомерЭтапаВПартииЗапуска = Этап.НомерЭтапа; 
			Этап.ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
			Если Выборка.ВидЭтапа = Справочники.Лико_ВидыЭтаповПроизводства.Упаковка Тогда 
				Этап.МаршрутнаяКарта = Справочники.Лико_ПредопределенныеЗначения.МаршрутнаяКартаУпаковка.ЗначениеПараметра;
			Иначе
				Этап.МаршрутнаяКарта = Справочники.Лико_ПредопределенныеЗначения.МаршрутнаяКартаПечать.ЗначениеПараметра;
			КонецЕсли;
			Этап.ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка;
			Этап.КоэффициентМаршрутнойКарты = 1;

			Если Выборка.ВидЭтапа = Справочники.Лико_ВидыЭтаповПроизводства.Прокат Тогда 
				Этап.НомерПроката = Выборка.НомерПроката;
						
			КонецЕсли;	
			
			Номер = Заказ.НомерБезПрефикса
			+ "."
			+ Формат(Этап.НомерПартииЗапуска, "ЧГ=0")
			+ "."
			+ Формат(Этап.НомерЭтапаВПартииЗапуска, "ЧГ=0");
			Этап.Номер = Номер;
			Этап.СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости;
			
			Если сч  = ВсегоЭтапов Тогда 
				Этап.ЯвляетсяНазначениемПродукции = Истина;
				Для каждого стртовары из Заказ.товары Цикл
					стр = Этап.ВыходныеИзделия.Добавить();
					ЗаполнитьЗначенияСвойств(стр, стртовары, , "кодстроки");
					стр.СтатьяРасходов = Справочники.СтатьиКалькуляции.НайтиПонаименованию("Печать");
					стр.Получатель = Заказ.Склад;
					стр.ДоляСтоимости = 1;        
					стр.Подразделение = Этап.Подразделение;
				КонецЦикла;	
				
				Попытка 
					Этап.записать();
					ВыпускающийЭтап =  Этап.Ссылка;
					Этап.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось создать этапы заказа. Заказ не отправлен в работу. " + ОписаниеОшибки());
					ОтменитьТранзакцию();
					Отказ = Истина;
					Возврат;
				КонецПопытки;
			Иначе 
				стрпоследователи = Этап.Последователи.Добавить() ;
				стрпоследователи.Этап =ЭтапСледующий; 
				Этап.НомерСледующегоЭтапа =сч+1;
				Попытка 
					Этап.записать();
					Этап.записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось создать этапы заказа. Заказ не отправлен в работу. " + ОписаниеОшибки());
					ОтменитьТранзакцию();
					Отказ = Истина;
					Возврат;
				КонецПопытки;	
			КонецЕсли;
	
			ЭтапСледующий = Этап.Ссылка;
			сч = сч-1;   
			
	КонецЦикла;
	


КонецПроцедуры

&Вместо("ПолучитьСтоимостьКраскиЛаков")
Функция Лико_ПолучитьСтоимостьКраскиЛаков(Ссылка, ИмяТаблицы, Расч_Квм, Расч_Пм, НомерВарианта, Дата, НомерПроката, РасчетФакта, Тираж)
				
	Площадка = Ссылка.Площадка.Организация;
	ПлощадкаЛикофлекс =Справочники.Лико_Площадки.Ликофлекс.Организация;
	ПлощадкаИксПак = Справочники.Лико_Площадки.ИксПак.Организация;

	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("Затрата");
	ТЗ.Колонки.Добавить("СтатьяЗатрат");
	ТЗ.Колонки.Добавить("НомерПроката");
	ТЗ.Колонки.Добавить("ПроцентЗаливки");
	ТЗ.Колонки.Добавить("Грамматура");
	ТЗ.Колонки.Добавить("ПроцентГрамматура");
	ТЗ.Колонки.Добавить("РасходКраски");
	ТЗ.Колонки.Добавить("КоэффициентПереноса");
	ТЗ.Колонки.Добавить("Плотность");
	ТЗ.Колонки.Добавить("КоличествоЦветов");
	ТЗ.Колонки.Добавить("ВидСекции");
	ТЗ.Колонки.Добавить("ВидРабот");
	ТЗ.Колонки.Добавить("НомерРаботы");
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.Колонки.Добавить("Цена");
	ТЗ.Колонки.Добавить("ЦенаПлан");
	ТЗ.Колонки.Добавить("Сумма");
	ТЗ.Колонки.Добавить("СуммаФакт");  
	ТЗ.Колонки.Добавить("КоэффициентКМетражу");	 
	ТЗ.Колонки.Добавить("Метраж");  
	ТЗ.Колонки.Добавить("ТипЦвета");	 
	ТЗ.Колонки.Добавить("ОсновнойЭлемент");  
    ТЗ.Колонки.Добавить("ДобавленоНаВыброс");
    ТЗ.Колонки.Добавить("ПроцентВСмеси");

	//Стоимость офсентной и цифровой краски
	//Если указан код, и он не относится к простым краскам и не считается как основная краска, то краска считается специальной

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ссылка);
	Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("ПлощадкаЛикофлекс", ПлощадкаЛикофлекс);
	Запрос.УстановитьПараметр("ПлощадкаИкспак", ПлощадкаИксПак);

	Запрос.УстановитьПараметр("Расч_Квм", Расч_Квм);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("РасчетФакта", РасчетФакта);
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	Запрос.УстановитьПараметр("Тираж", Тираж);


	//Офсетные и цифровые цвета


	//09.07.2021
	//В Икс-Паке начинаем списывать краски на заказ, поэтому по компонентам их больше не разбираем 


	Если Площадка = ПлощадкаИксПак  Тогда  
	
#Область Расчет_Офсетной_краски_ИксПак_20250714

//не разбираем ничего по составу, записываем количество для указанных номенклатур или ценовых групп, 
//если номенклатуры не заполнены при предварительном расчете
  	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипЦвета1 В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
		|				И НЕ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ТаблицаЦвета.ТипЦвета1
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
		|	КОНЕЦ КАК ТипЦвета,
		|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию
		|		ИНАЧЕ ТаблицаЦвета.ТипКраски
		|	КОНЕЦ КАК ТипКраски,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЦвета.ПроцентЗаливки = 0
		|				ТОГДА 100
		|			ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки
		|		КОНЕЦ) КАК ПроцентЗаливки,
		|	ТаблицаЦвета.ВидСекции КАК ВидСекции,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК КоэффициентПереноса,
		|	ТаблицаЦвета.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТЦвета
		|ИЗ
		|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|				&Дата,
		|				Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаОфсетнойКраски)
		|					И Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ТаблицаЦвета.Ссылка = &Ссылка
		|	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ОфсетнаяПечать)
		|	И ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
		|	И ТаблицаЦвета.РабочийЦентр.Лико_Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ИксПак)
		|	И ВЫБОР
		|			КОГДА &НомерПроката = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦвета.НомерПроката,
		|	ТаблицаЦвета.ВидСекции,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение,
		|	ТаблицаЦвета.Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию
		|		ИНАЧЕ ТаблицаЦвета.ТипКраски
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипЦвета1 В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
		|				И НЕ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ТаблицаЦвета.ТипЦвета1
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЦвета.НомерПроката КАК НомерПроката,
		|	ВТЦвета.ТипКраски КАК Затрата,
		|	СУММА(ВЫБОР
		|			КОГДА ВТЦвета.ПроцентЗаливки = 0
		|				ТОГДА 1
		|			ИНАЧЕ ВТЦвета.ПроцентЗаливки / 100
		|		КОНЕЦ * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ВТЦвета.КоэффициентПереноса) / 1000 * &Расч_квм) КАК Количество,
		|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ВТЦвета.КоэффициентПереноса) КАК КоэффициентПереноса,
		|	СУММА(ВТЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
		|	ВТЦвета.ВидСекции КАК ВидСекции,
		|	ВТЦвета.Номенклатура КАК Номенклатура,
		|	ВТЦвета.ТипЦвета КАК ТипЦвета
		|ПОМЕСТИТЬ ВТЗатраты
		|ИЗ
		|	ВТЦвета КАК ВТЦвета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
		|		ПО ВТЦвета.ТипКраски = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЦвета.НомерПроката,
		|	ВТЦвета.ТипКраски,
		|	ВТЦвета.ВидСекции,
		|	ВТЦвета.Номенклатура,
		|	ВТЦвета.ТипЦвета,
		|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ВТЦвета.КоэффициентПереноса)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗатраты.НомерПроката КАК НомерПроката,
		|	ВТЗатраты.Затрата КАК ОсновнойЭлемент,
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаОфсет)) КАК СтатьяЗатрат,
		|	ВТЗатраты.КоэффициентПереноса КАК КоэффициентПереноса,
		|	СУММА(ВТЗатраты.ПроцентЗаливки) КАК ПроцентЗаливки,
		|	СУММА(ВТЗатраты.Количество) КАК Количество,
		|	СУММА(ВЫРАЗИТЬ(ВТЗатраты.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2))) КАК Сумма,
		|	ВТЗатраты.ВидСекции КАК ВидСекции,
		|	МАКСИМУМ(&Расч_КВМ) КАК Метраж,
		|	СУММА(1000 * ВТЗатраты.Количество / &Расч_КВМ) КАК КоэффициентКМетражу,
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена КАК ЦенаПлан,
		|	ВЫБОР
		|		КОГДА ВТЗатраты.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА ВТЗатраты.Затрата
		|		ИНАЧЕ ВТЗатраты.Номенклатура
		|	КОНЕЦ КАК Затрата,
		|	ВТЗатраты.ТипЦвета КАК ТипЦвета
		|ИЗ
		|	ВТЗатраты КАК ВТЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
		|		ПО ВТЗатраты.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЗатраты.НомерПроката,
		|	ВТЗатраты.КоэффициентПереноса,
		|	ВТЗатраты.ВидСекции,
		|	1000 * ВТЗатраты.Количество / &Расч_КВМ,
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена,
		|	ВТЗатраты.Затрата,
		|	ВТЗатраты.ТипЦвета,
		|	ВЫБОР
		|		КОГДА ВТЗатраты.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА ВТЗатраты.Затрата
		|		ИНАЧЕ ВТЗатраты.Номенклатура
		|	КОНЕЦ";
		
	    Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			стр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(стр, ВЫборка);
		КонецЦикла;

				
#КонецОбласти

//Расчет флексокраски Икс-Пак  20230316 
		#Область Расчет_Флексокраски_ИксПак_20250714
		Запрос.Текст=	
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски = ИСТИНА
		|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию
		|		ИНАЧЕ ТаблицаЦвета.ТипКраски
		|	КОНЕЦ КАК ТипКраски,
		|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
		|	СУММА(ТаблицаЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
		|	СУММА(ТаблицаЦвета.Грамматура) КАК Грамматура,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЦвета.ПроцентЗаливки > 100
		|					ИЛИ ТаблицаЦвета.ПроцентЗаливки = 0
		|				ТОГДА 1
		|			ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки / 100
		|		КОНЕЦ * ТаблицаЦвета.Грамматура) КАК ПроцентГрамматура,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипЦвета1 В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
		|				И НЕ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ТаблицаЦвета.ТипЦвета1
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
		|	КОНЕЦ КАК ТипЦвета,
		|	ТаблицаЦвета.Номенклатура КАК Номенклатура,
		|	ТаблицаЦвета.ВидСекции КАК ВидСекции,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК КоэффициентПереносаКраски,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение КАК КоэффициентПереносаБелил
		|ПОМЕСТИТЬ ВТЦвета
		|ИЗ
		|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаФлексоСпецКраски)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаФлексоБелил)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
		|	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ФлексоПечать)
		|	И ТаблицаЦвета.ТипЦвета1.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
		|	И ТаблицаЦвета.Ссылка = &ссылка
		|	И ТаблицаЦвета.РабочийЦентр.Лико_Площадка = ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ИксПак)
		|	И ВЫБОР
		|			КОГДА &НомерПроката = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦвета.НомерПроката,
		|	ТаблицаЦвета.Номенклатура,
		|	ТаблицаЦвета.ВидСекции,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски = ИСТИНА
		|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию
		|		ИНАЧЕ ТаблицаЦвета.ТипКраски
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипЦвета1 В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
		|				И НЕ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ТаблицаЦвета.ТипЦвета1
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЦвета.ТипКраски КАК ЦеноваяГруппа,
		|	ВТЦвета.Номенклатура КАК Номенклатура,
		|	ВТЦвета.НомерПроката КАК НомерПроката,
		|	СУММА(ВЫРАЗИТЬ(&Расч_квм * ВТЦвета.ПроцентГрамматура * ВЫБОР
		|				КОГДА ВТЦвета.ТипКраски.Лико_Плотность = 0
		|					ТОГДА 1
		|				ИНАЧЕ ВТЦвета.ТипКраски.Лико_Плотность
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ВТЦвета.ТипЦвета = ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый)
		|					ТОГДА ВТЦвета.КоэффициентПереносаБелил
		|				ИНАЧЕ ВТЦвета.КоэффициентПереносаКраски
		|			КОНЕЦ / 1000 КАК ЧИСЛО(15, 2))) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА ВТЦвета.ПроцентЗаливки > 100
		|					ИЛИ ВТЦвета.ПроцентЗаливки = 0
		|				ТОГДА 100
		|			ИНАЧЕ ВТЦвета.ПроцентЗаливки
		|		КОНЕЦ) КАК ПроцентЗаливки,
		|	СУММА(ВТЦвета.ПроцентГрамматура) КАК ПроцентГрамматура,
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипЦвета = ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый)
		|			ТОГДА ВТЦвета.КоэффициентПереносаБелил
		|		ИНАЧЕ ВТЦвета.КоэффициентПереносаКраски
		|	КОНЕЦ КАК КоэффициентПереноса,
		|	ВТЦвета.ВидСекции КАК ВидСекции,
		|	СУММА(ВТЦвета.Грамматура) КАК Грамматура,
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипКраски.Лико_Плотность = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВТЦвета.ТипКраски.Лико_Плотность
		|	КОНЕЦ КАК Плотность,
		|	ВТЦвета.КоэффициентПереносаКраски КАК КоэффициентПереносаКраски,
		|	ВТЦвета.КоэффициентПереносаБелил КАК КоэффициентПереносаБелил
		|ПОМЕСТИТЬ ВТ_Количество
		|ИЗ
		|	ВТЦвета КАК ВТЦвета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЦвета.ТипКраски,
		|	ВТЦвета.Номенклатура,
		|	ВТЦвета.НомерПроката,
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипЦвета = ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый)
		|			ТОГДА ВТЦвета.КоэффициентПереносаБелил
		|		ИНАЧЕ ВТЦвета.КоэффициентПереносаКраски
		|	КОНЕЦ,
		|	ВТЦвета.ВидСекции,
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипКраски.Лико_Плотность = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВТЦвета.ТипКраски.Лико_Плотность
		|	КОНЕЦ,
		|	ВТЦвета.КоэффициентПереносаКраски,
		|	ВТЦвета.КоэффициентПереносаБелил
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.НомерПроката КАК НомерПроката,
		|	ВТ.ЦеноваяГруппа КАК ОсновнойЭлемент,
		|	ВТ.Номенклатура КАК Затрата,
		|	ВТ.Количество КАК Количество,
		|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаФлексо) КАК СтатьяЗатрат,
		|	ЕСТЬNULL(ВТ.ПроцентЗаливки, 0) КАК ПроцентЗаливки,
		|	ВТ.КоэффициентПереноса КАК КоэффициентПереноса,
		|	ВТ.ВидСекции КАК ВидСекции,
		|	&Расч_КВМ КАК Метраж,
		|	ВТ.Грамматура КАК Грамматура,
		|	ВТ.ПроцентГрамматура КАК ПроцентГрамматура,
		|	ВТ.Плотность КАК Плотность,
		|	ВЫРАЗИТЬ(ВТ.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаПлан
		|ИЗ
		|	ВТ_Количество КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
		|		ПО ВТ.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа"    ;


		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			стр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(стр, ВЫборка);
		КонецЦикла;



		#КонецОбласти	

	
		
	Иначе  
		
		
		
		#Область Офсетные_Цифровые_Цвета

		Запрос.Текст=
		"ВЫБРАТЬ
		|	ТаблицаЦвета.ТипЦвета1 КАК ТипЦвета,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ОфсетнаяПечать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаОфсет)
		|		КОГДА ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Цифровая)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаИндиго)
		|	КОНЕЦ КАК СтатьяЗатрат,
		|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
		|	ТаблицаЦвета.ТипКраски КАК ТипКраски,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЦвета.ПроцентЗаливки = 0
		|				ТОГДА 100
		|			ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки
		|		КОНЕЦ) КАК ПроцентЗаливки,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПростаяКраска,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ОфсетнаяПечать)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Офсет,
		|	ТаблицаЦвета.Ссылка КАК Ссылка,
		|	ТаблицаЦвета.НомерВарианта КАК НомерВарианта,
		|	ТаблицаЦвета.ВидСекции КАК ВидСекции
		|ПОМЕСТИТЬ ВТЦвета
		|ИЗ
		|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
		|ГДЕ
		|	ТаблицаЦвета.Ссылка = &Ссылка
		|	И ТаблицаЦвета.ВидСекции В (ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ОфсетнаяПечать), ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Цифровая))
		|	И ТаблицаЦвета.НомерВарианта = &НомерВарианта
		|	И ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
		|	И ВЫБОР
		|			КОГДА ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Цифровая)
		|				ТОГДА ТаблицаЦвета.ТипЦвета1 В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый))
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ТаблицаЦвета.ТипЦвета1.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
		|	И ВЫБОР
		|			КОГДА &НомерПроката = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦвета.НомерПроката,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ТаблицаЦвета.Ссылка,
		|	ТаблицаЦвета.НомерВарианта,
		|	ТаблицаЦвета.ТипЦвета1,
		|	ТаблицаЦвета.ТипКраски,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ОфсетнаяПечать)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ОфсетнаяПечать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаОфсет)
		|		КОГДА ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Цифровая)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаИндиго)
		|	КОНЕЦ,
		|	ТаблицаЦвета.ВидСекции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЦвета.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ВТЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.ЦГПоУмолчанию)
		|		ИНАЧЕ ВТЦвета.ТипКраски
		|	КОНЕЦ КАК Затрата,
		|	ВТЦвета.НомерПроката КАК НомерПроката,
		|	СУММА(ВТЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
		|	ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение), 0) КАК КоэффициентКраскоПереноса,
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ВТЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПростаяКраска,
		|	ВТЦвета.Офсет КАК Офсет,
		|	ВТЦвета.Ссылка КАК Ссылка,
		|	ВТЦвета.НомерВарианта КАК НомерВарианта,
		|	ВЫБОР
		|		КОГДА ВТЦвета.Офсет
		|			ТОГДА ВЫБОР
		|					КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
		|						ТОГДА ВТЦвета.ТипЦвета
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Пустаяссылка)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый))
		|					ТОГДА ВТЦвета.ТипЦвета
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Пустаяссылка)
		|			КОНЕЦ
		|	КОНЕЦ КАК ТипЦвета,
		|	ВТЦвета.ВидСекции КАК ВидСекции
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	ВТЦвета КАК ВТЦвета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|				&Дата,
		|				Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаОфсетнойКраски)
		|					И Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|				&Дата,
		|				Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаОфсетнойКраски)
		|					И Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЦвета.СтатьяЗатрат,
		|	ВТЦвета.НомерПроката,
		|	ВТЦвета.Офсет,
		|	ВТЦвета.Ссылка,
		|	ВТЦвета.НомерВарианта,
		|	ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение), 0),
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ВТЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|				ИЛИ ВТЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
		|			ТОГДА ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.ЦГПоУмолчанию)
		|		ИНАЧЕ ВТЦвета.ТипКраски
		|	КОНЕЦ,
		|	ВТЦвета.ВидСекции,
		|	ВЫБОР
		|		КОГДА ВТЦвета.Офсет
		|			ТОГДА ВЫБОР
		|					КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
		|						ТОГДА ВТЦвета.ТипЦвета
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Пустаяссылка)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый))
		|					ТОГДА ВТЦвета.ТипЦвета
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Пустаяссылка)
		|			КОНЕЦ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанные.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВТДанные.Затрата КАК Затрата,
		|	ВЫБОР
		|		КОГДА ВТДанные.ПростаяКраска
		|			ТОГДА 1
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТДанные.ПроцентЗаливки = 0
		|					ТОГДА 1
		|				ИНАЧЕ ВТДанные.ПроцентЗаливки / 100
		|			КОНЕЦ
		|	КОНЕЦ * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение, ВТДанные.КоэффициентКраскоПереноса)) / 1000 * &Расч_квм КАК Количество,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВТДанные.ПростаяКраска
		|				ТОГДА 1
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВТДанные.ПроцентЗаливки = 0
		|						ТОГДА 1
		|					ИНАЧЕ ВТДанные.ПроцентЗаливки / 100
		|				КОНЕЦ
		|		КОНЕЦ * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение, ВТДанные.КоэффициентКраскоПереноса)) / 1000 * &Расч_квм * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВТДанные.НомерПроката КАК НомерПроката,
		|	ВЫБОР
		|		КОГДА ВТДанные.ПростаяКраска
		|				И ВТДанные.Офсет
		|			ТОГДА 100
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТДанные.ПроцентЗаливки = 0
		|					ТОГДА 100
		|				ИНАЧЕ ВТДанные.ПроцентЗаливки
		|			КОНЕЦ
		|	КОНЕЦ КАК ПроцентЗаливки,
		|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение, ВТДанные.КоэффициентКраскоПереноса)) КАК КоэффициентПереноса,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВТДанные.ПростаяКраска
		|				ТОГДА 1
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВТДанные.ПроцентЗаливки = 0
		|						ТОГДА 1
		|					ИНАЧЕ ВТДанные.ПроцентЗаливки / 100
		|				КОНЕЦ
		|		КОНЕЦ * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение, ВТДанные.КоэффициентКраскоПереноса)) / 1000 * &Расч_квм * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК ЧИСЛО(20, 8)) КАК СуммаФакт,
		|	ЕСТЬNULL(Лико_ПоказателиРасчетаЗаказа.ЗначениеПоказателя, 0) КАК КоличествоЦветов,
		|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЦенаПлан,
		|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА ВТДанные.ПростаяКраска
		|			ТОГДА 1
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТДанные.ПроцентЗаливки = 0
		|					ТОГДА 1
		|				ИНАЧЕ ВТДанные.ПроцентЗаливки / 100
		|			КОНЕЦ
		|	КОНЕЦ * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение, ВТДанные.КоэффициентКраскоПереноса)) КАК КоэффициентКМетражу,
		|	&Расч_квм КАК Метраж,
		|	ВТДанные.ТипЦвета КАК ТипЦвета,
		|	ВТДанные.ВидСекции КАК ВидСекции
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&Дата, Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ВТДанные.ПростаяКраска
		|					ТОГДА Лико_ЦеныГруппНоменклатурыСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
		|				ИНАЧЕ Лико_ЦеныГруппНоменклатурыСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
		|			КОНЕЦ)
		|			И ВТДанные.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&Дата, Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
		|		ПО (ВЫБОР
		|				КОГДА ВТДанные.ПростаяКраска
		|					ТОГДА Лико_ЦеныГруппНоменклатурыСрезПоследних1.ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
		|				ИНАЧЕ Лико_ЦеныГруппНоменклатурыСрезПоследних1.ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
		|			КОНЕЦ)
		|			И ВТДанные.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
		|		ПО ВТДанные.Затрата = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦеноваяГруппа
		|			И ВТДанные.ВидСекции = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
		|		ПО ВТДанные.Затрата = Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.ЦеноваяГруппа
		|			И ВТДанные.ВидСекции = Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Коэффициент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних2
		|		ПО ВТДанные.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних2.ЦеноваяГруппа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПоказателиРасчетаЗаказа КАК Лико_ПоказателиРасчетаЗаказа
		|		ПО (ВТДанные.ПростаяКраска)
		|			И (ВТДанные.Офсет)
		|			И (Лико_ПоказателиРасчетаЗаказа.Показатель = ЗНАЧЕНИЕ(Справочник.Лико_ПараметрыРасчетаНормативов.КоличествоСекцийОфсет))
		|			И ВТДанные.Ссылка = Лико_ПоказателиРасчетаЗаказа.Заказ
		|			И ВТДанные.НомерПроката = Лико_ПоказателиРасчетаЗаказа.НомерПроката
		|			И ВТДанные.НомерВарианта = Лико_ПоказателиРасчетаЗаказа.НомерВарианта";

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			стр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(стр, ВЫборка);
		КонецЦикла;
		#Конецобласти

//Расчет флексокраски  20230719 без Видов Работ  
#Область Расчет_Флексокраски_20250705
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски = ИСТИНА
	|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию
	|		ИНАЧЕ ТаблицаЦвета.ТипКраски
	|	КОНЕЦ КАК ТипКраски,
	|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ПроцентЗаливки = 0
	|			ТОГДА 100
	|		ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки
	|	КОНЕЦ КАК ПроцентЗаливки,
	|	ТаблицаЦвета.Грамматура КАК Грамматура,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ПроцентЗаливки > 100
	|				ИЛИ ТаблицаЦвета.ПроцентЗаливки = 0
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки / 100
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ТаблицаЦвета.Грамматура = 0
	|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение
	|		ИНАЧЕ ТаблицаЦвета.Грамматура
	|	КОНЕЦ КАК ПроцентГрамматура,
	|	ТаблицаЦвета.ТипЦвета1 КАК ТипЦвета,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.РабочийЦентр.ВидРабочегоЦентра.лкОсновнойВидПечати <> ЗНАЧЕНИЕ(Справочник.лико_ВидыПечати.офсет)
	|				И (ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|					ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски = ИСТИНА)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПростаяКраска,
	|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК КоэффициентПереносаПростойКраски
	|ПОМЕСТИТЬ ВТЦвета
	|ИЗ
	|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаФлексоКраски)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
	|	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ФлексоПечать)
	|	И ТаблицаЦвета.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
	|	И ТаблицаЦвета.Ссылка = &ссылка
	|	И ВЫБОР
	|			КОГДА &НомерПроката = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦвета.ТипКраски КАК Затрата,
	|	ВТЦвета.НомерПроката КАК НомерПроката,
	|	СУММА(ВТЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
	|	СУММА(ВТЦвета.Грамматура) КАК Грамматура,
	|	ВТЦвета.ПростаяКраска КАК ПростаяКраска,
	|	СУММА(ВТЦвета.ПроцентГрамматура) КАК ПроцентГрамматура,
	|	СУММА(1) КАК КоличествоФлекс,
	|	ВЫБОР
	|		КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
	|			ТОГДА ВТЦвета.ТипЦвета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
	|	КОНЕЦ КАК ТипЦвета,
	|	ВТЦвета.КоэффициентПереносаПростойКраски КАК КоэффициентПереносаПростойКраски
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТЦвета КАК ВТЦвета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЦвета.НомерПроката,
	|	ВТЦвета.ПростаяКраска,
	|	ВТЦвета.ТипКраски,
	|	ВЫБОР
	|		КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
	|			ТОГДА ВТЦвета.ТипЦвета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВТЦвета.КоэффициентПереносаПростойКраски
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанные.Затрата КАК Затрата,
	|	ВЫБОР
	|		КОГДА ВТДанные.ПростаяКраска
	|				И (ВТДанные.КоличествоФлекс > 2
	|					ИЛИ ВТДанные.ПроцентЗаливки >= 100)
	|			ТОГДА &Расч_квм * ВТДанные.КоэффициентПереносаПростойКраски / 1000
	|		ИНАЧЕ &Расч_квм * ВЫБОР
	|				КОГДА ВТДанные.Грамматура = 0
	|					ТОГДА ВТДанные.КоэффициентПереносаПростойКраски * ВТДанные.ПроцентЗаливки / 100
	|				ИНАЧЕ ВТДанные.ПроцентГрамматура * ВЫБОР
	|						КОГДА ВТДанные.ТипЦвета = ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый)
	|							ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение
	|						ИНАЧЕ Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение
	|					КОНЕЦ
	|			КОНЕЦ / 1000
	|	КОНЕЦ КАК Количество,
	|	ВТДанные.НомерПроката КАК НомерПроката,
	|	ВЫБОР
	|		КОГДА ВТДанные.ПростаяКраска
	|				И ВТДанные.ПроцентЗаливки > 100
	|			ТОГДА 100
	|		ИНАЧЕ ВТДанные.ПроцентЗаливки
	|	КОНЕЦ КАК ПроцентЗаливки,
	|	ВЫБОР
	|		КОГДА ВТДанные.ПростаяКраска
	|				И (ВТДанные.КоличествоФлекс > 2
	|					ИЛИ ВТДанные.ПроцентЗаливки >= 100)
	|			ТОГДА ВТДанные.КоэффициентПереносаПростойКраски
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТДанные.Грамматура = 0
	|					ТОГДА ВТДанные.КоэффициентПереносаПростойКраски * ВТДанные.ПроцентЗаливки / 100
	|				ИНАЧЕ ВТДанные.ПроцентГрамматура
	|			КОНЕЦ
	|	КОНЕЦ КАК ПроцентГрамматура,
	|	ВЫБОР
	|		КОГДА ВТДанные.ПростаяКраска
	|				И (ВТДанные.КоличествоФлекс > 2
	|					ИЛИ ВТДанные.ПроцентЗаливки >= 100)
	|			ТОГДА ВТДанные.КоэффициентПереносаПростойКраски
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТДанные.Грамматура = 0
	|					ТОГДА ВТДанные.КоэффициентПереносаПростойКраски
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТДанные.ТипЦвета = ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый)
	|							ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение
	|						ИНАЧЕ Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоэффициентПереноса,
	|	ВТДанные.Грамматура КАК Грамматура,
	|	ВТДанные.КоличествоФлекс КАК КоличествоФлекс,
	|	ВТДанные.ТипЦвета КАК ТипЦвета
	|ПОМЕСТИТЬ ВТ_Количество
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаФлексоБелил)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаФлексоСпецКраски)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Количество.Затрата КАК Затрата,
	|	ВТ_Количество.Количество * ВЫБОР
	|		КОГДА ВТ_Количество.Затрата.Лико_Плотность = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_Количество.Затрата.Лико_Плотность
	|	КОНЕЦ КАК Количество,
	|	ВТ_Количество.НомерПроката КАК НомерПроката,
	|	ВТ_Количество.ПроцентЗаливки КАК ПроцентЗаливки,
	|	ВТ_Количество.КоэффициентПереноса КАК КоэффициентПереноса,
	|	ВТ_Количество.Грамматура КАК Грамматура,
	|	ВТ_Количество.ПроцентГрамматура КАК ПроцентГрамматура,
	|	ВТ_Количество.КоличествоФлекс КАК КоличествоФлекс,
	|	ВТ_Количество.ТипЦвета КАК ТипЦвета,
	|	ВТ_Количество.Затрата КАК ОсновнойЭлемент,
	|	NULL КАК ПроцентВСмеси
	|ПОМЕСТИТЬ ВТСоставы
	|ИЗ
	|	ВТ_Количество КАК ВТ_Количество
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
	|		ПО ВТ_Количество.Затрата = ЦеновыеГруппыЛико_Состав.Ссылка
	|ГДЕ
	|	ЦеновыеГруппыЛико_Состав.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа,
	|	ВТ_Количество.Количество * (ЦеновыеГруппыЛико_Состав.ПроцентВСмеси / 100) * ВЫБОР
	|		КОГДА ВТ_Количество.Затрата.Лико_Плотность = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_Количество.Затрата.Лико_Плотность
	|	КОНЕЦ,
	|	ВТ_Количество.НомерПроката,
	|	ВТ_Количество.ПроцентЗаливки,
	|	ВТ_Количество.КоэффициентПереноса,
	|	ВТ_Количество.Грамматура,
	|	ВТ_Количество.ПроцентГрамматура,
	|	ВТ_Количество.КоличествоФлекс,
	|	ВТ_Количество.ТипЦвета,
	|	ЦеновыеГруппыЛико_Состав.Ссылка,
	|	ЦеновыеГруппыЛико_Состав.ПроцентВСмеси
	|ИЗ
	|	ВТ_Количество КАК ВТ_Количество
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
	|		ПО ВТ_Количество.Затрата = ЦеновыеГруппыЛико_Состав.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Затрата КАК Затрата,
	|	СУММА(ВТ.Количество) КАК Количество,
	|	СУММА(ВЫРАЗИТЬ(ВТ.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаФлексо)) КАК СтатьяЗатрат,
	|	СУММА(ЕСТЬNULL(ВТ.ПроцентЗаливки, 0)) КАК ПроцентЗаливки,
	|	ВТ.КоэффициентПереноса КАК КоэффициентПереноса,
	|	СУММА(ВЫРАЗИТЬ(ВТ.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК ЧИСЛО(20, 8))) КАК СуммаФакт,
	|	СУММА(ЕСТЬNULL(ВТ.Грамматура, 0)) КАК Грамматура,
	|	СУММА(ЕСТЬNULL(ВТ.ПроцентГрамматура, 0)) КАК ПроцентГрамматура,
	|	СУММА(ЕСТЬNULL(ВТ.КоличествоФлекс, 0)) КАК КоличествоЦветов,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЦенаПлан,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК Цена,
	|	ВТ.ТипЦвета КАК ТипЦвета,
	|	ВТ.ОсновнойЭлемент КАК ОсновнойЭлемент,
	|	ВТ.Затрата.Лико_Плотность КАК Плотность,
	|	СУММА(ВТ.ПроцентВСмеси) КАК ПроцентВСмеси,
	|	МАКСИМУМ(&Расч_квм) КАК Метраж
	|ИЗ
	|	ВТСоставы КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТ.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &ПлощадкаЛикофлекс
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТ.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних2
	|		ПО ВТ.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних2.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Затрата,
	|	ВТ.НомерПроката,
	|	ВТ.КоэффициентПереноса,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена),
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0),
	|	ВТ.ТипЦвета,
	|	ВТ.ОсновнойЭлемент,
	|	ВТ.Затрата.Лико_Плотность"    ;

    Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, ВЫборка);
	КонецЦикла;

	
#КонецОбласти



	Если Площадка = ПлощадкаЛикофлекс Тогда 
//Расчет инкджет
			#Область КраскаИнкджет
			Запрос.Текст=
			"ВЫБРАТЬ
			|	ТаблицаЦвета.Ссылка КАК Ссылка,
			|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
			|	ТаблицаЦвета.НомерВарианта КАК НомерВарианта,
			|	ТаблицаЦвета.ВидСекции КАК ВидСекции,
			|	ТаблицаЦвета.Ссылка.РасходКраски КАК РасходКраски
			|ПОМЕСТИТЬ ВТИнкджет
			|ИЗ
			|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
			|ГДЕ
			|	ТаблицаЦвета.Ссылка = &Ссылка
			|	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Инкджет)
			|	И ТаблицаЦвета.НомерВарианта = &НомерВарианта
			|	И ВЫБОР
			|			КОГДА &НомерПроката = 0
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
			|		КОНЕЦ
			|	И ТаблицаЦвета.ТипЦвета1.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаЦвета.Ссылка,
			|	ТаблицаЦвета.НомерПроката,
			|	ТаблицаЦвета.НомерВарианта,
			|	ТаблицаЦвета.ВидСекции
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТИнкджет.Ссылка КАК Ссылка,
			|	ВТИнкджет.НомерПроката КАК НомерПроката,
			|	ВТИнкджет.НомерВарианта КАК НомерВарианта,
			|	МИНИМУМ(ЕСТЬNULL(ЗаказКлиента.МетражКВМ / ЗаказКлиента.Тираж, Лико_СпецификацииСтоимость.КвадратныйМетраж / Лико_СпецификацииСтоимость.Количество)) КАК ПлощадьТысячи,
			|	ВТИнкджет.ВидСекции КАК ВидСекции,
			|	ВТИнкджет.РасходКраски КАК РасходКраски
			|ПОМЕСТИТЬ ВТПлощадьТысячи
			|ИЗ
			|	ВТИнкджет КАК ВТИнкджет
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
			|		ПО ВТИнкджет.Ссылка = ЗаказКлиента.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Спецификации.Стоимость КАК Лико_СпецификацииСтоимость
			|		ПО ВТИнкджет.Ссылка = Лико_СпецификацииСтоимость.Ссылка
			|			И ВТИнкджет.НомерВарианта = Лико_СпецификацииСтоимость.НомерВарианта
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТИнкджет.Ссылка,
			|	ВТИнкджет.НомерПроката,
			|	ВТИнкджет.НомерВарианта,
			|	ВТИнкджет.ВидСекции,
			|	ВТИнкджет.РасходКраски
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТПлощадьТысячи.НомерПроката КАК НомерПроката,
			|	СУММА(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1) * ВЫБОР
			|			КОГДА ВТПлощадьТысячи.РасходКраски = 0
			|				ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию.КоэффициентКраскоПереноса
			|			ИНАЧЕ ВТПлощадьТысячи.РасходКраски
			|		КОНЕЦ * (&Расч_квм / ВТПлощадьТысячи.ПлощадьТысячи) / 1000) КАК Количество,
			|	ВЫБОР
			|		КОГДА ВТПлощадьТысячи.РасходКраски = 0
			|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию.КоэффициентКраскоПереноса
			|		ИНАЧЕ ВТПлощадьТысячи.РасходКраски
			|	КОНЕЦ КАК РасходКраски,
			|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1) КАК КоэффициентПереноса,
			|	ВТПлощадьТысячи.ВидСекции КАК ВидСекции
			|ПОМЕСТИТЬ ВТКоличество
			|ИЗ
			|	ВТПлощадьТысячи КАК ВТПлощадьТысячи
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
			|				&Дата,
			|				Площадка = &Площадка
			|					И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаИнкджетКраски)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
			|		ПО (ИСТИНА)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТПлощадьТысячи.НомерПроката,
			|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1),
			|	ВТПлощадьТысячи.ВидСекции,
			|	ВЫБОР
			|		КОГДА ВТПлощадьТысячи.РасходКраски = 0
			|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦГПоУмолчанию.КоэффициентКраскоПереноса
			|		ИНАЧЕ ВТПлощадьТысячи.РасходКраски
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаИнкджет) КАК СтатьяЗатрат,
			|	ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.КраскаИнкджет) КАК Затрата,
			|	ВТКоличество.НомерПроката КАК НомерПроката,
			|	ВТКоличество.Количество КАК Количество,
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * ВТКоличество.Количество КАК Сумма,
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена, 0) * ВТКоличество.Количество КАК СуммаФакт,
			|	ВТКоличество.РасходКраски КАК РасходКраски,
			|	ВТКоличество.КоэффициентПереноса КАК КоэффициентПереноса,
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаПлан,
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена, 0) КАК Цена,
			|	ВТКоличество.Количество * 1000 / &Расч_квм КАК КоэффициентКМетражу,
			|	&Расч_квм КАК Метраж,
			|	ВТКоличество.ВидСекции КАК ВидСекции
			|ИЗ
			|	ВТКоличество КАК ВТКоличество
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
			|				&Дата,
			|				Площадка = &Площадка
			|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
			|					И ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.КраскаИнкджет)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
			|				&Дата,
			|				Площадка = &Площадка
			|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)
			|					И ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.КраскаИнкджет)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
			|		ПО (ИСТИНА)";

			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				стр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(стр, ВЫборка);
			КонецЦикла;




			#КонецОбласти	

			#Область ЛакИнкджет
			Запрос.Текст=
			"ВЫБРАТЬ
			|	ТаблицаЦвета.ТипКраски КАК ТипКраски,
			|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
			|	СУММА(ТаблицаЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
			|	СУММА(ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ТаблицаЦвета.Грамматура КАК ЧИСЛО)) = 0
			|					ИЛИ ТаблицаЦвета.Грамматура = НЕОПРЕДЕЛЕНО
			|				ТОГДА 60
			|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаЦвета.Грамматура КАК ЧИСЛО)
			|		КОНЕЦ) КАК Грамматура,
			|	СУММА(ВЫБОР
			|			КОГДА ТаблицаЦвета.ПроцентЗаливки > 100
			|					ИЛИ ТаблицаЦвета.ПроцентЗаливки = 0
			|				ТОГДА 1
			|			ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки / 100
			|		КОНЕЦ * ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ТаблицаЦвета.Грамматура КАК ЧИСЛО)) = 0
			|					ИЛИ ТаблицаЦвета.Грамматура = НЕОПРЕДЕЛЕНО
			|				ТОГДА 60
			|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаЦвета.Грамматура КАК ЧИСЛО)
			|		КОНЕЦ) КАК ПроцентГрамматура,
			|	ТаблицаЦвета.ТипЦвета1 КАК ТипЦвета,
			|	ТаблицаЦвета.ВидСекции КАК ВидСекции
			|ПОМЕСТИТЬ ВТЦвета
			|ИЗ
			|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
			|ГДЕ
			|	ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
			|	И ТаблицаЦвета.ВидСекции.Родитель = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ЦифровойМодуль)
			|	И ТаблицаЦвета.Ссылка = &ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаЦвета.НомерПроката,
			|	ТаблицаЦвета.ТипЦвета1,
			|	ТаблицаЦвета.ТипКраски,
			|	ТаблицаЦвета.ВидСекции
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакИнкджет)) КАК СтатьяЗатрат,
			|	ВТЦвета.ТипКраски КАК Затрата,
			|	ВТЦвета.НомерПроката КАК НомерПроката,
			|	СУММА(ВТЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
			|	СУММА(ВТЦвета.Грамматура) КАК Грамматура,
			|	СУММА(ВТЦвета.ПроцентГрамматура) КАК ПроцентГрамматура,
			|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 0) КАК КоэффициентКраскопереноса,
			|	СУММА(&Расч_квм * ВТЦвета.ПроцентГрамматура * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1) / 1000) КАК Количество,
			|	СУММА(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) * &Расч_квм * ВТЦвета.ПроцентГрамматура * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1) / 1000) КАК Сумма,
			|	СУММА(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена, 0) * &Расч_квм * ВТЦвета.ПроцентГрамматура * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1) / 1000) КАК СуммаФакт,
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаПлан,
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена, 0) КАК Цена,
			|	ВТЦвета.ПроцентГрамматура * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1) КАК КоэффициентКМетражу,
			|	МАКСИМУМ(&Расч_квм) КАК Метраж,
			|	ВТЦвета.ВидСекции КАК ВидСекции
			|ИЗ
			|	ВТЦвета КАК ВТЦвета
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
			|				&Дата,
			|				Площадка = &Площадка
			|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
			|		ПО ВТЦвета.ТипКраски = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
			|				&Дата,
			|				Площадка = &Площадка
			|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.табашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
			|		ПО ВТЦвета.ТипКраски = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа,
			|	РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
			|			&Дата,
			|			Площадка = &Площадка
			|				И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентПереносаИнкджетЛака)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТЦвета.НомерПроката,
			|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 0),
			|	ВТЦвета.ТипКраски,
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0),
			|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена, 0),
			|	ВТЦвета.ПроцентГрамматура * ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 1),
			|	ВТЦвета.ВидСекции";

			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				стр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(стр, ВЫборка);
			КонецЦикла;

			#КонецОбласти	

		КонецЕсли;
	КонецЕсли;

	//Офсетное полотно
#Область Офсетное_Полотно
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТаблицаЦвета.Ссылка КАК Заказ,
	|	СУММА(1) КАК КоличествоОфсет,
	|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
	|	МАКСИМУМ(ТаблицаЦвета.РабочийЦентр) КАК РабочийЦентр,
	|	МАКСИМУМ(ТаблицаЦвета.РабочийЦентр.ВидРабочегоЦентра.лкЦГПолотна) КАК ЦГПолотна,
	|	ТаблицаЦвета.ВидСекции КАК ВидСекции
	|ПОМЕСТИТЬ ВТРЦ
	|ИЗ
	|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
	|ГДЕ
	|	ТаблицаЦвета.Ссылка = &Ссылка
	|	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ОфсетнаяПечать)
	|	И ТаблицаЦвета.НомерВарианта = &НомерВарианта
	|	И ВЫБОР
	|			КОГДА &НомерПроката = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &НомерПроката = ТаблицаЦвета.НомерПроката
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦвета.Ссылка,
	|	ТаблицаЦвета.НомерПроката,
	|	ТаблицаЦвета.ВидСекции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРЦ.Заказ КАК Заказ,
	|	ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкЦГПолотна КАК Затрата,
	|	ВТРЦ.КоличествоОфсет КАК КоличествоОфсет,
	|	ВТРЦ.КоличествоОфсет * &Расч_Пм / 40000 КАК КоличествоПодложки,
	|	ВЫБОР
	|		КОГДА ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкХодимостьПолотна <> 0
	|			ТОГДА ВЫРАЗИТЬ(ВТРЦ.КоличествоОфсет * &Расч_Пм / ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкХодимостьПолотна КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкХодимостьПолотна <> 0
	|				ТОГДА ВЫРАЗИТЬ(ВТРЦ.КоличествоОфсет * &Расч_Пм / ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкХодимостьПолотна КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш.Цена, ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена)) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВТРЦ.НомерПроката КАК НомерПроката,
	|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ПолотноОфсетное) КАК СтатьяЗатрат,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкХодимостьПолотна <> 0
	|				ТОГДА ВЫРАЗИТЬ(ВТРЦ.КоличествоОфсет * &Расч_Пм / ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкХодимостьПолотна КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.Цена, 0) КАК ЧИСЛО(20, 8)) КАК СуммаФакт,
	|	ВТРЦ.РабочийЦентр.ВидРабочегоЦентра.лкХодимостьПолотна КАК КоэффициентПереноса,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш.Цена, ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена)) КАК ЦенаПлан,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.Цена, 0) КАК Цена,
	|	ВТРЦ.ВидСекции КАК ВидСекции
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВТ.ЦГПолотна КАК ЦГПолотна
	|						ИЗ
	|							ВТРЦ КАК ВТ)
	|					И Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТРЦ.ЦГПолотна = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВТ.ЦГПолотна КАК ЦГПолотна
	|						ИЗ
	|							ВТРЦ КАК ВТ)
	|					И Площадка = &ПлощадкаЛикофлекс
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТРЦ.ЦГПолотна = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВТ.ЦГПолотна КАК ЦГПолотна
	|						ИЗ
	|							ВТРЦ КАК ВТ)
	|					И Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш
	|		ПО ВТРЦ.ЦГПолотна = Лико_ЦеныГруппНоменклатурыСрезПоследнихТабаш.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВТ.ЦГПолотна КАК ЦГПолотна
	|						ИЗ
	|							ВТРЦ КАК ВТ)
	|					И Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт
	|		ПО ВТРЦ.ЦГПолотна = Лико_ЦеныГруппНоменклатурыСрезПоследнихТабашФакт.ЦеноваяГруппа";


	Запрос.УстановитьПараметр("Расч_Пм", Расч_Пм);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, ВЫборка);
	КонецЦикла;
	
#Конецобласти


//Стоимость трафаретных лаков и красок считаем отдельно, т.к. коэффициент переноса - гармматуру берем из трафаретной сетки	
	#Область Трафаретные_Цвета_Лаки

	Запрос.Текст = 

	"ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА ТаблицаЦвета.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
	 |			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаТраф)
	 |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакТрафарет)
	 |	КОНЕЦ КАК СтатьяЗатрат,
	 |	ВЫБОР
	 |		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	 |				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
	 |			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.СтоимостьКраскиТрафарет)
	 |		ИНАЧЕ ТаблицаЦвета.ТипКраски
	 |	КОНЕЦ КАК Затрата,
	 |	ТаблицаЦвета.НомерПроката КАК НомерПроката,
	 |	СУММА(ТаблицаЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
	 |	СУММА(ВЫБОР
	 |			КОГДА ЕСТЬNULL(ТаблицаЦвета.ТрафаретнаяСетка.Грамматура, 0) = 0
	 |				ТОГДА 20
	 |			ИНАЧЕ ТаблицаЦвета.ТрафаретнаяСетка.Грамматура
	 |		КОНЕЦ) КАК Грамматура,
	 |	СУММА(ВЫБОР
	 |			КОГДА ТаблицаЦвета.ПроцентЗаливки = 0
	 |				ТОГДА 1
	 |			ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки / 100
	 |		КОНЕЦ * ВЫБОР
	 |			КОГДА ЕСТЬNULL(ТаблицаЦвета.ТрафаретнаяСетка.Грамматура, 0) = 0
	 |				ТОГДА 20
	 |			ИНАЧЕ ТаблицаЦвета.ТрафаретнаяСетка.Грамматура
	 |		КОНЕЦ) КАК ПроцентГрамматура
	 |ПОМЕСТИТЬ ВТТрафарет
	 |ИЗ
	 |	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
	 |ГДЕ
	 |	ТаблицаЦвета.Ссылка = &ссылка
	 |	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ТрафаретнаяПечать)
	 |	И ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
	 |	И ВЫБОР
	 |			КОГДА &НомерПроката = 0
	 |				ТОГДА ИСТИНА
	 |			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
	 |		КОНЕЦ
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВЫБОР
	 |		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	 |				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
	 |			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.СтоимостьКраскиТрафарет)
	 |		ИНАЧЕ ТаблицаЦвета.ТипКраски
	 |	КОНЕЦ,
	 |	ТаблицаЦвета.НомерПроката,
	 |	ВЫБОР
	 |		КОГДА ТаблицаЦвета.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
	 |			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаТраф)
	 |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакТрафарет)
	 |	КОНЕЦ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ.СтатьяЗатрат КАК СтатьяЗатрат,
	 |	ВТ.Затрата КАК Затрата,
	 |	ВТ.НомерПроката КАК НомерПроката,
	 |	ВТ.ПроцентГрамматура * &Расч_квм / 1000 КАК Количество,
	 |	ВТ.ПроцентЗаливки КАК ПроцентЗаливки,
	 |	ВТ.Грамматура КАК Грамматура,
	 |	ВТ.Затрата КАК ЦеноваяГруппа,
	 |	100 КАК ПроцентВСмеси,
	 |	ВТ.ПроцентГрамматура КАК ПроцентГрамматура,
	 |	ВТ.Затрата КАК ОсновнойЭлемент
	 |ПОМЕСТИТЬ ВТКомпоненты
	 |ИЗ
	 |	ВТТрафарет КАК ВТ
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
	 |		ПО ВТ.Затрата = ЦеновыеГруппыЛико_Состав.Ссылка
	 |ГДЕ
	 |	ЦеновыеГруппыЛико_Состав.Ссылка ЕСТЬ NULL
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ВТ.СтатьяЗатрат,
	 |	ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа,
	 |	ВТ.НомерПроката,
	 |	ВТ.ПроцентГрамматура * (ЦеновыеГруппыЛико_Состав.ПроцентВСмеси / 100) * &Расч_квм / 1000,
	 |	ВТ.ПроцентЗаливки * (ЦеновыеГруппыЛико_Состав.ПроцентВСмеси / 100),
	 |	ВТ.Грамматура,
	 |	ВТ.Затрата,
	 |	ЦеновыеГруппыЛико_Состав.ПроцентВСмеси,
	 |	ВТ.ПроцентГрамматура,
	 |	ВТ.Затрата
	 |ИЗ
	 |	ВТТрафарет КАК ВТ
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
	 |		ПО ВТ.Затрата = ЦеновыеГруппыЛико_Состав.Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТКомпоненты.Количество КАК Количество,
	 |	ВТКомпоненты.СтатьяЗатрат КАК СтатьяЗатрат,
	 |	ВТКомпоненты.Затрата КАК Затрата,
	 |	ВТКомпоненты.НомерПроката КАК НомерПроката,
	 |	ВТКомпоненты.ПроцентЗаливки КАК ПроцентЗаливки,
	 |	ВТКомпоненты.Грамматура КАК Грамматура,
	 |	ВТКомпоненты.ЦеноваяГруппа КАК ЦеноваяГруппа,
	 |	ВТКомпоненты.ПроцентВСмеси КАК ПроцентВСмеси,
	 |	ВТКомпоненты.ПроцентГрамматура КАК ПроцентГрамматура,
	 |	ВТКомпоненты.ОсновнойЭлемент КАК ОсновнойЭлемент
	 |ПОМЕСТИТЬ ВТЗатраты
	 |ИЗ
	 |	ВТКомпоненты КАК ВТКомпоненты
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	СУММА(ВТКомпоненты.Количество),
	 |	ВТКомпоненты.СтатьяЗатрат,
	 |	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.СтоимостьИспользованияТрафарет)),
	 |	ВТКомпоненты.НомерПроката,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL,
	 |	NULL
	 |ИЗ
	 |	ВТКомпоненты КАК ВТКомпоненты
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТКомпоненты.СтатьяЗатрат,
	 |	ВТКомпоненты.НомерПроката
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТКомпоненты.СтатьяЗатрат КАК СтатьяЗатрат,
	 |	ВТКомпоненты.Затрата КАК Затрата,
	 |	ВТКомпоненты.НомерПроката КАК НомерПроката,
	 |	СУММА(ВТКомпоненты.Количество) КАК Количество,
	 |	СУММА(ВЫРАЗИТЬ(ВТКомпоненты.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЧИСЛО(15, 2))) КАК Сумма,
	 |	СУММА(ЕСТЬNULL(ВТКомпоненты.ПроцентЗаливки, 0)) КАК ПроцентЗаливки,
	 |	СУММА(ВЫРАЗИТЬ(ВТКомпоненты.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК ЧИСЛО(20, 8))) КАК СуммаФакт,
	 |	ЕСТЬNULL(ВТКомпоненты.Грамматура, 0) КАК Грамматура,
	 |	ЕСТЬNULL(ВТКомпоненты.ПроцентВСмеси, 0) КАК ПроцентВСмеси,
	 |	ЕСТЬNULL(ВТКомпоненты.ПроцентГрамматура, 0) КАК ПроцентГрамматура,
	 |	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЦенаПлан,
	 |	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК Цена,
	 |	ВТКомпоненты.Количество * 1000 / &Расч_квм КАК КоэффициентКМетражу,
	 |	&Расч_квм КАК Расч_квм,
	 |	ВТКомпоненты.ОсновнойЭлемент КАК ОсновнойЭлемент
	 |ИЗ
	 |	ВТЗатраты КАК ВТКомпоненты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	 |				&Дата,
	 |				Площадка = &Площадка
	 |					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	 |		ПО ВТКомпоненты.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	 |				&Дата,
	 |				Площадка = &ПлощадкаЛикофлекс
	 |					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	 |		ПО ВТКомпоненты.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	 |				&Дата,
	 |				Площадка = &Площадка
	 |					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних2
	 |		ПО ВТКомпоненты.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних2.ЦеноваяГруппа
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТКомпоненты.СтатьяЗатрат,
	 |	ВТКомпоненты.Затрата,
	 |	ВТКомпоненты.НомерПроката,
	 |	ЕСТЬNULL(ВТКомпоненты.ПроцентВСмеси, 0),
	 |	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена),
	 |	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0),
	 |	ЕСТЬNULL(ВТКомпоненты.Грамматура, 0),
	 |	ЕСТЬNULL(ВТКомпоненты.ПроцентГрамматура, 0),
	 |	ВТКомпоненты.Количество * 1000 / &Расч_квм,
	 |	ВТКомпоненты.ОсновнойЭлемент" ;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, ВЫборка);
	КонецЦикла;
	#Конецобласти


//Икс-Пак Стоимость Глубокой краски  20250626 
#Область Глубокая_ИксПак

	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТаблицаЦвета.Ссылка КАК Заказ,
	|	ТаблицаЦвета.Номенклатура КАК Затрата,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ПроцентЗаливки = 0
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки / 100
	|	КОНЕЦ КАК ПроцентЗаливки,
	|	ВЫРАЗИТЬ(ТаблицаЦвета.Грамматура КАК ЧИСЛО(4, 1)) КАК Грамматура,
	|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ТипЦвета1.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаГлубокая)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакГлубокий)
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	ТаблицаЦвета.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ТаблицаЦвета.ВидСекции.ВидПечати КАК ВидПечати,
	|	ТаблицаЦвета.ФормулаПантона КАК ФормулаПантона,
	|	ТаблицаЦвета.ВидСекции КАК ВидСекции,
	|	ТаблицаЦвета.ТипЦвета1 КАК ТипЦвета,
	|	ТаблицаЦвета.РабочийЦентр.Лико_Площадка.Организация КАК ОрганизацияРЦ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
	|ГДЕ
	|	(ТаблицаЦвета.ВидСекции.Родитель = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Глубокая)
	|			ИЛИ ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.БессольвентнаяЛаминация))
	|	И ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
	|	И ТаблицаЦвета.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА &НомерПроката = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
	|		КОНЕЦ
	|	И ТаблицаЦвета.РабочийЦентр.Лико_Площадка.Организация = &ПлощадкаИксПак
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ОрганизацияРЦ КАК ОрганизацияРЦ,
	|	МИНИМУМ(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение) КАК КтЭтилацетата
	|ПОМЕСТИТЬ ВТКТЭтилацетата
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентПереносаЭтилацетата)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
	|		ПО ВТ.ОрганизацияРЦ = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Площадка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ОрганизацияРЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ЗатратыПоЗаказу.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТНаВыброс
	|ИЗ
	|	РегистрНакопления.Лико_ЗатратыПоЗаказу КАК Лико_ЗатратыПоЗаказу
	|ГДЕ
	|	Лико_ЗатратыПоЗаказу.ЗаказКлиента = &Ссылка
	|	И Лико_ЗатратыПоЗаказу.ДобавленоНаВыброс = ИСТИНА
	|	И &НомерПроката > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗатратыПоЗаказу.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Заказ КАК Заказ,
	|	ЕСТЬNULL(Лико_ФормулыПантоновСостав.Номенклатура, ВТ.Затрата) КАК Затрата,
	|	СУММА((&Расч_квм * ВТ.Грамматура * ВТ.ПроцентЗаливки / 1000 + ВЫБОР
	|			КОГДА ВТ.ЦеноваяГруппа.Лико_ТребуетсяОтвердитель
	|					И ВТ.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Глубокая)
	|					И ВТНаВыброс.Заказ ЕСТЬ NULL
	|				ТОГДА 10
	|			ИНАЧЕ 0
	|		КОНЕЦ) * ЕСТЬNULL(Лико_ФормулыПантоновСостав.ПроцентВСмеси / 100, 1) * ВЫБОР
	|			КОГДА Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|				ТОГДА ВТКТЭтилацетата.КтЭтилацетата
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|				ТОГДА ВТКТЭтилацетата.КтЭтилацетата
	|			ИНАЧЕ 1
	|		КОНЕЦ * ЕСТЬNULL(Лико_ФормулыПантоновСостав.ПроцентВСмеси / 100, 1) * &Расч_квм * ВТ.Грамматура * ВТ.ПроцентЗаливки / 1000) КАК КоличествоКраски,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ.ЦеноваяГруппа.Лико_ТребуетсяОтвердитель
	|					И ВТ.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Глубокая)
	|					И ВТНаВыброс.Заказ ЕСТЬ NULL
	|				ТОГДА 10
	|			ИНАЧЕ 0
	|		КОНЕЦ * ЕСТЬNULL(Лико_ФормулыПантоновСостав.ПроцентВСмеси / 100, 1) * ВЫБОР
	|			КОГДА Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|				ТОГДА ВТКТЭтилацетата.КтЭтилацетата
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоНаВыброс,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	ВТ.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ.ПроцентЗаливки КАК ПроцентЗаливки,
	|	ВТ.Грамматура КАК Грамматура,
	|	ЕСТЬNULL(Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа, ВТ.ЦеноваяГруппа) КАК ЦеноваяГруппа,
	|	ВТ.ЦеноваяГруппа КАК ЦеноваяГруппаИсходная,
	|	ВТ.ВидСекции КАК ВидСекции,
	|	ВТ.ТипЦвета КАК ТипЦвета,
	|	ВЫБОР
	|		КОГДА ВТ.ЦеноваяГруппа.Лико_ТребуетсяОтвердитель
	|				И ВТ.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Глубокая)
	|				И ВТНаВыброс.Заказ ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДобавленоНаВыброс,
	|	ВЫБОР
	|		КОГДА Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|			ТОГДА ВТКТЭтилацетата.КтЭтилацетата
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентПереноса,
	|	ЕСТЬNULL(Лико_ФормулыПантоновСостав.ПроцентВСмеси / 100, 1) КАК ПроцентВСмеси,
	|	ВТ.Грамматура * ВТ.ПроцентЗаливки КАК ПроцентГрамматура
	|ПОМЕСТИТЬ ВТЦГ
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_ФормулыПантонов.Состав КАК Лико_ФормулыПантоновСостав
	|		ПО ВТ.ФормулаПантона = Лико_ФормулыПантоновСостав.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКТЭтилацетата КАК ВТКТЭтилацетата
	|		ПО ВТ.ОрганизацияРЦ = ВТКТЭтилацетата.ОрганизацияРЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНаВыброс КАК ВТНаВыброс
	|		ПО ВТ.Заказ = ВТНаВыброс.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Заказ,
	|	ВТ.СтатьяЗатрат,
	|	ВТ.НомерПроката,
	|	ВТ.ПроцентЗаливки,
	|	ВТ.Грамматура,
	|	ЕСТЬNULL(Лико_ФормулыПантоновСостав.Номенклатура, ВТ.Затрата),
	|	ВТ.ЦеноваяГруппа,
	|	ЕСТЬNULL(Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа, ВТ.ЦеноваяГруппа),
	|	ВТ.ВидСекции,
	|	ВТ.ТипЦвета,
	|	ВЫБОР
	|		КОГДА ВТ.ЦеноваяГруппа.Лико_ТребуетсяОтвердитель
	|				И ВТ.ВидПечати = ЗНАЧЕНИЕ(Справочник.Лико_ВидыПечати.Глубокая)
	|				И ВТНаВыброс.Заказ ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|			ТОГДА ВТКТЭтилацетата.КтЭтилацетата
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ЕСТЬNULL(Лико_ФормулыПантоновСостав.ПроцентВСмеси / 100, 1),
	|	ВТ.Грамматура * ВТ.ПроцентЗаливки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦг.Заказ КАК Заказ,
	|	ВТЦг.Затрата КАК Затрата,
	|	ВТЦг.НомерПроката КАК НомерПроката,
	|	ВТЦг.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТЦг.ЦеноваяГруппаИсходная КАК ОсновнойЭлемент,
	|	ВТЦг.ВидСекции КАК ВидСекции,
	|	ВТЦг.ТипЦвета КАК ТипЦвета,
	|	СУММА(ВТЦг.Количество) КАК Количество,
	|	СУММА(ВЫРАЗИТЬ(ВТЦг.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	ВТЦг.ДобавленоНаВыброс КАК ДобавленоНаВыброс,
	|	СУММА(ВТЦг.Грамматура) КАК Грамматура,
	|	СУММА(ВТЦг.ПроцентЗаливки) КАК ПроцентЗаливки,
	|	ВТЦг.КоэффициентПереноса КАК КоэффициентПереноса,
	|	МАКСИМУМ(ВТЦг.ПроцентВСмеси) КАК ПроцентВСмеси,
	|	СУММА(ВТЦг.ПроцентГрамматура) КАК ПроцентГрамматура,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЦенаПлан,
	|	МАКСИМУМ(&Расч_квм) КАК Метраж
	|ИЗ
	|	ВТЦГ КАК ВТЦг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТЦг.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТЦг.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЦг.Заказ,
	|	ВТЦг.Затрата,
	|	ВТЦг.НомерПроката,
	|	ВТЦг.СтатьяЗатрат,
	|	ВТЦг.ЦеноваяГруппаИсходная,
	|	ВТЦг.ВидСекции,
	|	ВТЦг.ТипЦвета,
	|	ВТЦг.ДобавленоНаВыброс,
	|	ВТЦг.КоэффициентПереноса,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена)";


	Запрос.УстановитьПараметр("ПлощадкаИксПак", ПлощадкаИксПак);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, ВЫборка);
	КонецЦикла;
#Конецобласти



//Для Ликофлекса Стоимость Глубокой краски  20250701 
#Область Глубокая_Ликофлекс
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЦвета.Ссылка КАК Заказ,
	|	ТаблицаЦвета.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
	|	ТаблицаЦвета.ВидСекции.ВидПечати КАК ВидПечати,
	|	ТаблицаЦвета.ТипЦвета1 КАК ТипЦвета,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ТипКраски = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				ИЛИ ТаблицаЦвета.ТипКраски.Лико_РасчетКакОсновнойКраски
	|			ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.ЦГПоУмолчанию
	|		ИНАЧЕ ТаблицаЦвета.ТипКраски
	|	КОНЕЦ КАК Затрата,
	|	ТаблицаЦвета.ПроцентЗаливки КАК ПроцентЗаливки,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаЦвета.Грамматура = 0
	|				ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение
	|			ИНАЧЕ ТаблицаЦвета.Грамматура
	|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Грамматура,
	|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, 0) КАК КоэффициентЭтилАцетата,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ПроцентЗаливки = 0
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки / 100 * ВЫБОР
	|				КОГДА ТаблицаЦвета.Грамматура = 0
	|					ТОГДА Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение
	|				ИНАЧЕ ТаблицаЦвета.Грамматура
	|			КОНЕЦ
	|	КОНЕЦ КАК ПроцентГрамматура,
	|	ТаблицаЦвета.ВидТМЦ КАК ВидТМЦ,
	|	ТаблицаЦвета.ВидСекции КАК ВидСекции,
	|	ТаблицаЦвета.РабочийЦентр.Лико_Площадка.Организация КАК ОрганизацияРЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЦвета.ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КраскаГлубокая)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакГлубокий)
	|	КОНЕЦ КАК СтатьяЗатрат
	|ПОМЕСТИТЬ ВТЦвета
	|ИЗ
	|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентПереносаЭтилацетата)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
	|		ПО ТаблицаЦвета.РабочийЦентр.Лико_Площадка.Организация = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Площадка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаГлубокойКраски)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
	|		ПО (ТаблицаЦвета.РабочийЦентр.Лико_Площадка.Организация = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Площадка)
	|ГДЕ
	|	ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
	|	И ТаблицаЦвета.ВидСекции.Родитель = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Глубокая)
	|	И ТаблицаЦвета.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА &НомерПроката = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
	|		КОНЕЦ
	|	И ТаблицаЦвета.РабочийЦентр.Лико_Площадка <> ЗНАЧЕНИЕ(Справочник.Лико_Площадки.ИксПак)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦвета.НомерПроката КАК НомерПроката,
	|	ВТЦвета.ВидСекции КАК ВидСекции,
	|	ВТЦвета.Затрата КАК Затрата,
	|	ВЫБОР
	|		КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
	|			ТОГДА ВТЦвета.ТипЦвета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
	|	КОНЕЦ КАК ТипЦвета,
	|	СУММА(ВТЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
	|	ВТЦвета.КоэффициентЭтилАцетата КАК КоэффициентЭтилАцетата,
	|	СУММА(ВТЦвета.Грамматура) КАК Грамматура,
	|	СУММА(ВТЦвета.ПроцентГрамматура) КАК ПроцентГрамматура,
	|	ВТЦвета.СтатьяЗатрат КАК СтатьяЗатрат
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	ВТЦвета КАК ВТЦвета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЦвета.НомерПроката,
	|	ВТЦвета.КоэффициентЭтилАцетата,
	|	ВТЦвета.ВидСекции,
	|	ВТЦвета.Затрата,
	|	ВЫБОР
	|		КОГДА ВТЦвета.ТипЦвета В (ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Белый), ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.Спецкраска))
	|			ТОГДА ВТЦвета.ТипЦвета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_ТипыЦвета.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВТЦвета.СтатьяЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанные.Затрата КАК Затрата,
	|	ВТДанные.НомерПроката КАК НомерПроката,
	|	ВЫБОР
	|		КОГДА ВТДанные.ПроцентЗаливки = 0
	|			ТОГДА 100
	|		ИНАЧЕ ВТДанные.ПроцентЗаливки
	|	КОНЕЦ КАК ПроцентЗаливки,
	|	СУММА(ВТДанные.Грамматура) КАК Грамматура,
	|	СУММА(ВТДанные.ПроцентГрамматура) КАК ПроцентГрамматура,
	|	100 КАК ПроцентВСмеси,
	|	1 КАК КоэффициентПереноса,
	|	СУММА(&Расч_квм * ВТДанные.ПроцентГрамматура * ВЫБОР
	|			КОГДА ВТДанные.Затрата.Лико_Плотность = 0
	|				ТОГДА 1
	|			ИНАЧЕ ВТДанные.Затрата.Лико_Плотность
	|		КОНЕЦ / 1000) КАК Количество,
	|	ВТДанные.ТипЦвета КАК ТипЦвета,
	|	ВТДанные.Затрата КАК ОсновнойЭлемент,
	|	ВТДанные.ВидСекции КАК ВидСекции,
	|	ВТДанные.СтатьяЗатрат КАК СтатьяЗатрат
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
	|		ПО ВТДанные.Затрата = ЦеновыеГруппыЛико_Состав.Ссылка
	|ГДЕ
	|	ЦеновыеГруппыЛико_Состав.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.Затрата,
	|	ВТДанные.НомерПроката,
	|	ВТДанные.ВидСекции,
	|	ВТДанные.ТипЦвета,
	|	ВТДанные.СтатьяЗатрат,
	|	ВЫБОР
	|		КОГДА ВТДанные.ПроцентЗаливки = 0
	|			ТОГДА 100
	|		ИНАЧЕ ВТДанные.ПроцентЗаливки
	|	КОНЕЦ,
	|	ВТДанные.Затрата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа,
	|	ВТДанные.НомерПроката,
	|	СУММА(ВЫБОР
	|			КОГДА ВТДанные.ПроцентЗаливки = 0
	|				ТОГДА 100
	|			ИНАЧЕ ВТДанные.ПроцентЗаливки
	|		КОНЕЦ),
	|	СУММА(ВТДанные.Грамматура),
	|	СУММА(ВТДанные.ПроцентГрамматура),
	|	СУММА(ЦеновыеГруппыЛико_Состав.ПроцентВСмеси),
	|	ВЫБОР
	|		КОГДА ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|			ТОГДА ВТДанные.КоэффициентЭтилАцетата
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СУММА(&Расч_квм * ВТДанные.ПроцентГрамматура * (ЦеновыеГруппыЛико_Состав.ПроцентВСмеси / 100) * ВЫБОР
	|			КОГДА ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|				ТОГДА ВТДанные.КоэффициентЭтилАцетата
	|			ИНАЧЕ 1
	|		КОНЕЦ * ВЫБОР
	|			КОГДА ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа.Лико_Плотность = 0
	|				ТОГДА 1
	|			ИНАЧЕ ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа.Лико_Плотность
	|		КОНЕЦ / 1000),
	|	ВТДанные.ТипЦвета,
	|	ВТДанные.Затрата,
	|	ВТДанные.ВидСекции,
	|	ВТДанные.СтатьяЗатрат
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
	|		ПО ВТДанные.Затрата = ЦеновыеГруппыЛико_Состав.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.НомерПроката,
	|	ВТДанные.Затрата,
	|	ВТДанные.ВидСекции,
	|	ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа,
	|	ВТДанные.ТипЦвета,
	|	ВЫБОР
	|		КОГДА ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Этилацетат)
	|			ТОГДА ВТДанные.КоэффициентЭтилАцетата
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВТДанные.СтатьяЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.СтатьяЗатрат КАК СтатьяЗатрат,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.СтоимостьИспользованияГлубокой)) КАК Затрата,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	СУММА(ВТ.Количество) КАК Количество,
	|	ВТ.ВидСекции КАК ВидСекции
	|ПОМЕСТИТЬ ВТ_СтоимостьИспользования
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.СтатьяЗатрат,
	|	ВТ.НомерПроката,
	|	ВТ.ВидСекции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Затрата КАК Затрата,
	|	ВТ.Количество КАК Количество,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	ВТ.ПроцентЗаливки КАК ПроцентЗаливки,
	|	ВТ.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ.КоэффициентПереноса КАК КоэффициентПереноса,
	|	ВТ.Грамматура КАК Грамматура,
	|	ВТ.ПроцентГрамматура КАК ПроцентГрамматура,
	|	ВТ.ПроцентВСмеси КАК ПроцентВСмеси,
	|	ВТ.ТипЦвета КАК ТипЦвета,
	|	ВТ.ОсновнойЭлемент КАК ОсновнойЭлемент,
	|	ВТ.ВидСекции КАК ВидСекции
	|ПОМЕСТИТЬ ВТ_ЗатратыВсе
	|ИЗ
	|	ВТ КАК ВТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СтоимостьИспользования.Затрата,
	|	ВТ_СтоимостьИспользования.Количество,
	|	ВТ_СтоимостьИспользования.НомерПроката,
	|	NULL,
	|	ВТ_СтоимостьИспользования.СтатьяЗатрат,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_СтоимостьИспользования.ВидСекции
	|ИЗ
	|	ВТ_СтоимостьИспользования КАК ВТ_СтоимостьИспользования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗатратыВсе.Затрата КАК Затрата,
	|	ВТ_ЗатратыВсе.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_ЗатратыВсе.НомерПроката КАК НомерПроката,
	|	ЕСТЬNULL(ВТ_ЗатратыВсе.ПроцентЗаливки, 0) КАК ПроцентЗаливки,
	|	ВТ_ЗатратыВсе.Количество КАК Количество,
	|	ВЫРАЗИТЬ(ВТ_ЗатратыВсе.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ВТ_ЗатратыВсе.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК ЧИСЛО(20, 8)) КАК СуммаФакт,
	|	ЕСТЬNULL(ВТ_ЗатратыВсе.КоэффициентПереноса, 0) КАК КоэффициентПереноса,
	|	ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0) КАК ЦенаПлан,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ВТ_ЗатратыВсе.Грамматура, 0) КАК Грамматура,
	|	ЕСТЬNULL(ВТ_ЗатратыВсе.ПроцентГрамматура, 0) КАК ПроцентГрамматура,
	|	ВЫБОР
	|		КОГДА ВТ_ЗатратыВсе.Затрата.Лико_Плотность > 0
	|			ТОГДА ВТ_ЗатратыВсе.Затрата.Лико_Плотность
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Плотность,
	|	ВЫРАЗИТЬ(ВТ_ЗатратыВсе.Количество * 1000 / &Расч_квм КАК ЧИСЛО(20, 8)) КАК КоэффициентКМетражу,
	|	&Расч_квм КАК Метраж,
	|	ВТ_ЗатратыВсе.ТипЦвета КАК ТипЦвета,
	|	ВТ_ЗатратыВсе.ОсновнойЭлемент КАК ОсновнойЭлемент,
	|	ВТ_ЗатратыВсе.ВидСекции КАК ВидСекции,
	|	ВТ_ЗатратыВсе.ПроцентВСмеси КАК ПроцентВСмеси
	|ИЗ
	|	ВТ_ЗатратыВсе КАК ВТ_ЗатратыВсе
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТ_ЗатратыВсе.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &ПлощадкаЛикофлекс
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТ_ЗатратыВсе.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних2
	|		ПО ВТ_ЗатратыВсе.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних2.ЦеноваяГруппа";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, ВЫборка);
	КонецЦикла;


#КонецОбласти
	

	
//Стоимость Флексо лака разделительного, лака выборочного, с окном, без окна, лака глубокой печати
#Область Лаки_Флексо
Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЦвета.ТипКраски КАК ТипКраски,
		|	ТаблицаЦвета.НомерПроката КАК НомерПроката,
		|	СУММА(ТаблицаЦвета.ПроцентЗаливки) КАК ПроцентЗаливки,
		|	СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаЦвета.Грамматура КАК ЧИСЛО), 0)) КАК Грамматура,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.Грамматура > 0
		|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних2.ПереносСВала, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ПереносСВала, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.ПереносСВала)), 1)
		|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних2.Значение, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение)), 1)
		|	КОНЕЦ КАК КоэффициентПереноса,
		|	ТаблицаЦвета.ВидСекции.ВидПечати КАК ВидПечати,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ТаблицаЦвета.Грамматура, 0) = 0
		|				ТОГДА 1
		|			ИНАЧЕ ТаблицаЦвета.Грамматура
		|		КОНЕЦ * ВЫБОР
		|			КОГДА ТаблицаЦвета.ПроцентЗаливки = 0
		|				ТОГДА 1
		|			ИНАЧЕ ТаблицаЦвета.ПроцентЗаливки / 100
		|		КОНЕЦ) КАК ПроцентГрамматура,
		|	ТаблицаЦвета.ВидСекции КАК ВидСекции,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент КАК Коэффициент,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ПереносСВала КАК ПереносСВала,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТаблицаЦвета.ВидСекции В (ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ФлексоПечать), ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ТиснениеХолодноеФлексо), ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор))
		|					ТОГДА ТаблицаЦвета.ВидСекции = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент
		|				ИНАЧЕ Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентПереносаКлеяЛаминации)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|				&Дата,
		|				Площадка = &ПлощадкаЛикофлекс
		|					И ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
		|		ПО (ВЫБОР
		|				КОГДА ТаблицаЦвета.ВидСекции В (ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ФлексоПечать), ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ТиснениеХолодноеФлексо), ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор))
		|					ТОГДА ТаблицаЦвета.ВидСекции = Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Коэффициент
		|				ИНАЧЕ Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентПереносаКлеяЛаминации)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних2
		|		ПО ТаблицаЦвета.ТипКраски = Лико_ЗначенияКоэффициентовПереносаСрезПоследних2.ЦеноваяГруппа
		|			И (ТаблицаЦвета.ВидСекции.Родитель = Лико_ЗначенияКоэффициентовПереносаСрезПоследних2.Коэффициент
		|				ИЛИ ТаблицаЦвета.ВидСекции = Лико_ЗначенияКоэффициентовПереносаСрезПоследних2.Коэффициент)
		|ГДЕ
		|	ТаблицаЦвета.Ссылка = &Ссылка
		|	И НЕ ТаблицаЦвета.ВидТМЦ В (ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска))
		|	И (ТаблицаЦвета.ВидСекции.Родитель = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Флексо)
		|			ИЛИ ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
		|				И ЕСТЬNULL(ТаблицаЦвета.ТипНумератора.РасчетПоМетрам, ЛОЖЬ))
		|	И ТаблицаЦвета.ТипКраски <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ДавальческоеСырье)
		|	И ТаблицаЦвета.НомерВарианта = &НомерВарианта
		|	И ВЫБОР
		|			КОГДА &НомерПроката = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦвета.НомерПроката,
		|	ТаблицаЦвета.ВидСекции.ВидПечати,
		|	ТаблицаЦвета.ТипКраски,
		|	ТаблицаЦвета.ВидСекции,
		|	ВЫБОР
		|		КОГДА ТаблицаЦвета.Грамматура > 0
		|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних2.ПереносСВала, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ПереносСВала, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.ПереносСВала)), 1)
		|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних2.Значение, ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение)), 1)
		|	КОНЕЦ,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦеноваяГруппа,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ПереносСВала,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакФлексо) КАК СтатьяЗатрат,
		|	ВТ.ВидСекции КАК ВидСекции,
		|	ВТ.ТипКраски КАК Затрата,
		|	ВЫБОР
		|		КОГДА ВТ.ПроцентЗаливки = 0
		|			ТОГДА 100
		|		ИНАЧЕ ВТ.ПроцентЗаливки
		|	КОНЕЦ КАК ПроцентЗаливки,
		|	ВТ.Грамматура КАК Грамматура,
		|	ВТ.НомерПроката КАК НомерПроката,
		|	ВТ.КоэффициентПереноса КАК КоэффициентПереноса,
		|	ЕСТЬNULL(ВТ.КоэффициентПереноса, 1) * ВТ.ПроцентГрамматура * &Расч_КВМ / 1000 КАК Количество,
		|	ВТ.ВидПечати КАК ВидПечати,
		|	ВТ.ПроцентГрамматура КАК ПроцентГрамматура
		|ПОМЕСТИТЬ ВТ_Количество
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
		|		ПО ВТ.ТипКраски = ЦеновыеГруппыЛико_Состав.Ссылка
		|ГДЕ
		|	ЦеновыеГруппыЛико_Состав.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакФлексо),
		|	ВТ.ВидСекции,
		|	ВЫБОР
		|		КОГДА ЦеновыеГруппыЛико_Состав.ЦенаНоменклатуры
		|			ТОГДА ЦеновыеГруппыЛико_Состав.Компонент
		|		ИНАЧЕ ЦеновыеГруппыЛико_Состав.Компонент.ЦеноваяГруппа
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ.ПроцентЗаливки = 0
		|			ТОГДА 100
		|		ИНАЧЕ ВТ.ПроцентЗаливки
		|	КОНЕЦ * ЦеновыеГруппыЛико_Состав.ПроцентВСмеси / 100,
		|	ВТ.Грамматура,
		|	ВТ.НомерПроката,
		|	ВТ.КоэффициентПереноса,
		|	ЕСТЬNULL(ВТ.КоэффициентПереноса, 1) * ВТ.ПроцентГрамматура * (ЦеновыеГруппыЛико_Состав.ПроцентВСмеси / 100) * &Расч_КВМ / 1000,
		|	ВТ.ВидПечати,
		|	ВТ.ПроцентГрамматура * (ЦеновыеГруппыЛико_Состав.ПроцентВСмеси / 100)
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.Лико_Состав КАК ЦеновыеГруппыЛико_Состав
		|		ПО ВТ.ТипКраски = ЦеновыеГруппыЛико_Состав.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Количество.ВидСекции КАК ВидСекции,
		|	ВТ_Количество.ВидСекции.ВидРабот КАК ВидРабот,
		|	ВЫБОР
		|		КОГДА ВТ_Количество.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Чернила)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакФлексо)
		|	КОНЕЦ КАК СтатьяЗатрат,
		|	ВТ_Количество.Затрата КАК Затрата,
		|	ВТ_Количество.ПроцентЗаливки КАК ПроцентЗаливки,
		|	ВТ_Количество.Грамматура КАК Грамматура,
		|	ВТ_Количество.НомерПроката КАК НомерПроката,
		|	ВТ_Количество.КоэффициентПереноса КАК КоэффициентПереноса,
		|	ВТ_Количество.Количество КАК Количество,
		|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) * ВТ_Количество.Количество КАК Сумма,
		|	ВТ_Количество.ВидПечати КАК ВидПечати,
		|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) * ВТ_Количество.Количество КАК СуммаФакт,
		|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК ЦенаПлан,
		|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних2.Цена, 0) КАК Цена,
		|	ВТ_Количество.ПроцентГрамматура КАК ПроцентГрамматура,
		|	1000 * ВТ_Количество.Количество / &Расч_КВМ КАК КоэффициентКМетраж,
		|	&Расч_КВМ КАК Расч_квм
		|ИЗ
		|	ВТ_Количество КАК ВТ_Количество
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
		|		ПО ВТ_Количество.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Площадка = &ПлощадкаЛикофлекс
		|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
		|		ПО ВТ_Количество.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Площадка = &Площадка
		|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних2
		|		ПО ВТ_Количество.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних2.ЦеноваяГруппа";


    Выборка= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, Выборка);	
	КонецЦикла;


#Конецобласти


	//Чернила Домино
 
	#Область Чернила_Домино
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Чернила)) КАК СтатьяЗатрат,
	|	ЗаказКлиентаВидыРабот.ВидСекции КАК ВидСекции,
	|	ЗаказКлиентаВидыРабот.НомерРаботы КАК НомерРаботы,
	|	ЗаказКлиентаВидыРабот.ТипКраски КАК Затрата,
	|	СУММА(Лико_ТипыНумераторовРасходЧернил.Расход * &Тираж * ВЫБОР
	|			КОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛистеПечати > 0
	|					И ЗаказКлиентаВидыРабот.КоличествоКодовНаЛисте > 0
	|				ТОГДА ЗаказКлиентаВидыРабот.КоличествоКодовНаЛисте / ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛистеПечати
	|			ИНАЧЕ 1
	|		КОНЕЦ / 1000) КАК Количество,
	|	СУММА(Лико_ТипыНумераторовРасходЧернил.Расход) КАК КоэффициентПереноса,
	|	ЗаказКлиентаВидыРабот.НомерПроката КАК НомерПроката
	|ПОМЕСТИТЬ ВТЧернила
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ТипыНумераторов.РасходЧернил КАК Лико_ТипыНумераторовРасходЧернил
	|		ПО ЗаказКлиентаВидыРабот.ТипНумератора = Лико_ТипыНумераторовРасходЧернил.Ссылка
	|			И ЗаказКлиентаВидыРабот.ТипКода = Лико_ТипыНумераторовРасходЧернил.ТипКода
	|ГДЕ
	|	(ВЫРАЗИТЬ(ЗаказКлиентаВидыРабот.Ссылка КАК Документ.ЗаказКлиента)) = &Ссылка
	|	И ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
	|	И ЗаказКлиентаВидыРабот.НомерВарианта = &НомерВарианта
	|	И ВЫБОР
	|			КОГДА &НомерПроката = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиентаВидыРабот.НомерПроката = &НомерПроката
	|		КОНЕЦ
	|	И НЕ Лико_ТипыНумераторовРасходЧернил.Ссылка.РасчетПоМетрам
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаВидыРабот.ВидСекции,
	|	ЗаказКлиентаВидыРабот.НомерРаботы,
	|	ЗаказКлиентаВидыРабот.НомерПроката,
	|	ЗаказКлиентаВидыРабот.ТипКраски
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Чернила)),
	|	Лико_СпецификацииВидыРабот.ВидСекции,
	|	Лико_СпецификацииВидыРабот.НомерРаботы,
	|	Лико_СпецификацииВидыРабот.ТипКраски,
	|	СУММА(Лико_ТипыНумераторовРасходЧернил.Расход * &Тираж * ВЫБОР
	|			КОГДА Лико_СпецификацииВидыРабот.Ссылка.ЭтикетокНаЛистеПечати > 0
	|					И Лико_СпецификацииВидыРабот.КоличествоКодовНаЛисте > 0
	|				ТОГДА Лико_СпецификацииВидыРабот.КоличествоКодовНаЛисте / Лико_СпецификацииВидыРабот.Ссылка.ЭтикетокНаЛистеПечати
	|			ИНАЧЕ 1
	|		КОНЕЦ / 1000),
	|	СУММА(Лико_ТипыНумераторовРасходЧернил.Расход),
	|	Лико_СпецификацииВидыРабот.НомерПроката
	|ИЗ
	|	Справочник.Лико_Спецификации.Цвета КАК Лико_СпецификацииВидыРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ТипыНумераторов.РасходЧернил КАК Лико_ТипыНумераторовРасходЧернил
	|		ПО Лико_СпецификацииВидыРабот.ТипНумератора = Лико_ТипыНумераторовРасходЧернил.Ссылка
	|			И Лико_СпецификацииВидыРабот.ТипКода = Лико_ТипыНумераторовРасходЧернил.ТипКода
	|ГДЕ
	|	(ВЫРАЗИТЬ(Лико_СпецификацииВидыРабот.Ссылка КАК Справочник.Лико_Спецификации)) = &Ссылка
	|	И Лико_СпецификацииВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
	|	И Лико_СпецификацииВидыРабот.НомерВарианта = &НомерВарианта
	|	И НЕ Лико_ТипыНумераторовРасходЧернил.Ссылка.РасчетПоМетрам
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СпецификацииВидыРабот.ВидСекции,
	|	Лико_СпецификацииВидыРабот.НомерРаботы,
	|	Лико_СпецификацииВидыРабот.ТипКраски,
	|	Лико_СпецификацииВидыРабот.НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЧернила.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТЧернила.ВидСекции КАК ВидСекции,
	|	ВТЧернила.НомерРаботы КАК НомерРаботы,
	|	ВТЧернила.НомерПроката КАК НомерПроката,
	|	ВТЧернила.Затрата КАК Затрата,
	|	ВТЧернила.Количество КАК Количество,
	|	ВТЧернила.КоэффициентПереноса КАК КоэффициентПереноса,
	|	ВТЧернила.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК Сумма,
	|	ВТЧернила.Количество * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена, 0) КАК СуммаФакт
	|ИЗ
	|	ВТЧернила КАК ВТЧернила
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТЧернила.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Площадка = &Площадка
	|					И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТЧернила.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа";

	Если РасчетФакта Тогда 
		Запрос.УстановитьПараметр("Тираж", Расч_Квм * 0.001 * Ссылка.ШтКВМ);
	Иначе
		Запрос.УстановитьПараметр("Тираж", Тираж);
	КонецЕсли;
	ВыборкаЧернила= Запрос.Выполнить().Выбрать();
	Пока  ВыборкаЧернила.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, ВыборкаЧернила);	
	КонецЦикла;  

	#Конецобласти

#Область Праймер 

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаЦвета.ВидСекции КАК ВидСекции,
		|	ТаблицаЦвета.НомерРаботы КАК НомерРаботы,
		|	ТаблицаЦвета.РабочийЦентр КАК РабочийЦентр,
		|	ТаблицаЦвета.Ссылка.Праймер.ЦеноваяГруппа КАК Затрата,
		|	ТаблицаЦвета.НомерПроката КАК НомерПроката
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	"+ИмяТаблицы+".Цвета КАК ТаблицаЦвета
		|ГДЕ
		|	ТаблицаЦвета.Ссылка = &Ссылка
		|	И ТаблицаЦвета.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.indigo)
		|	И НЕ ТаблицаЦвета.Ссылка.Праймер В (ЗНАЧЕНИЕ(Справочник.Лико_праймеры.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Лико_праймеры.БезПраймера))
		|	И ТаблицаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Цифровая)
		|	И ВЫБОР
		|			КОГДА &НомерПроката = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаблицаЦвета.НомерПроката = &НомерПроката
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Праймер) КАК СтатьяЗатрат,
		|	ВТ.ВидСекции КАК ВидСекции,
		|	ВТ.НомерРаботы КАК НомерРаботы,
		|	ВТ.РабочийЦентр КАК РабочийЦентр,
		|	ВТ.Затрата КАК Затрата,
		|	ВТ.НомерПроката КАК НомерПроката,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК КоэффициентПереноса,
		|	&Расч_Квм * Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение / 1000 * Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена КАК Сумма,
		|	&Расч_Квм * Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение / 1000 * Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена КАК СуммаФакт,
		|	&Расч_Квм * Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение / 1000 КАК Количество,
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена КАК ЦенаПлан,
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена КАК Цена,
		|	&Расч_КВМ КАК Метраж,
		|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК КоэффициентКМетражу
		|ИЗ
		|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Площадка = &Площадка
		|				И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ТабашФакт)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|					&Дата,
		|					Площадка = &Площадка
		|						И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
		|			ПО ВТ.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
		|					&Дата,
		|					Площадка = &Площадка
		|						И Коэффициент = ЗНАЧЕНИЕ(Справочник.Лико_КоэффициентыДляРасчетов.КоэффициентПереносаПраймераЦифры)) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
		|			ПО ВТ.Затрата = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.ЦеноваяГруппа
		|		ПО (ВТ.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа)";
	
	
	ВыборкаПраймер = Запрос.Выполнить().Выбрать();

	Пока  ВыборкаПраймер.Следующий() Цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр, ВыборкаПраймер);	
	КонецЦикла;  
		
#Конецобласти

Возврат ТЗ;	

	


КонецФункции



