Функция РаспределяемыеМатериалы(Организация,РабочийЦентр,Дата) Экспорт  //+Лико m.shenderov 30.11.2018
УстановитьПривилегированныйРежим(Истина);	


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_НастройкиУчетаПроизводственныхЗатрат.РабочиеЦентры КАК Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры
	|ГДЕ
	|	НЕ Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка.Выключить
	|	И Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка.Организация = &Организация
	|	И Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.РабочийЦентр = &РабочийЦентр
	|	И Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка.ДатаНачала < &Дата";
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр );
	Запрос.УстановитьПараметр("Дата",?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));		
     Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
КонецФункции //-Лико m.shenderov 30.11.2018 
