
&НаСервере
Процедура Лико_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    	СписокФорм.ТекстЗапроса=

	"ВЫБРАТЬ
|	Лико_ИсторияДвиженийФормСрезПоследних.Форма.Ссылка КАК Форма,
|	Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код КАК Код,
|	Лико_ИсторияДвиженийФормСрезПоследних.Расположение КАК Расположение,
|	ВЫБОР
|		КОГДА Лико_ИсторияДвиженийФормСрезПоследних.Форма.Ссылка В (&Формы)
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК Выбрана,
|	ВЫБОР
|		КОГДА Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код = &КодФормыОтборДляПриоритета
|			ТОГДА 1
|		ИНАЧЕ 0
|	КОНЕЦ КАК ВысокаяПриоритетность,
|	Лико_ИсторияДвиженийФормСрезПоследних.Период КАК Дата,
|	ИсторияВКонверте.Расположение КАК Конверт,
|	Лико_Формы.ЗаказТех КАК Заказ,
|	Лико_Формы.ЗаказТех.Контрагент КАК Контрагент,
|	Лико_Формы.ЗаказТех.Организация КАК Организация,
|	Лико_Формы.ЗаказТех.Этикетки КАК Номенклатура,
|	Лико_Формы.Пересвет КАК Пересвет
|ИЗ
|	Справочник.Лико_Формы КАК Лико_Формы
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм.СрезПоследних(, ) КАК Лико_ИсторияДвиженийФормСрезПоследних
|		ПО Лико_Формы.Ссылка = Лико_ИсторияДвиженийФормСрезПоследних.Форма
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм.СрезПоследних(
|				,
|				ВЫБОР
|					КОГДА &ПоРасположению
|							И &ИспользоватьРЦ
|						ТОГДА Расположение ССЫЛКА Справочник.Лико_Конверты
|					ИНАЧЕ ЛОЖЬ
|				КОНЕЦ) КАК ИсторияВКонверте
|		ПО Лико_Формы.Ссылка = ИсторияВКонверте.Форма
|ГДЕ
|	ВЫБОР
|			КОГДА &КодФормыОтбор = """"
|				ТОГДА ИСТИНА
|			ИНАЧЕ Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код ПОДОБНО &КодФормыОтбор
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &НоменклатураОтбор = """"
|				ТОГДА ИСТИНА
|			ИНАЧЕ Лико_Формы.ЗаказТех.Этикетки ПОДОБНО &НоменклатураОтбор
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &КонтрагентОтбор = """"
|				ТОГДА ИСТИНА
|			ИНАЧЕ Лико_Формы.ЗаказТех.Контрагент.Наименование ПОДОБНО &КонтрагентОтбор
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &ПоРасположению
|				ТОГДА Лико_ИсторияДвиженийФормСрезПоследних.Расположение = &Расположение
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &ЕстьЗаказКлиента
|				ТОГДА Лико_Формы.ЗаказТех = &ЗаказКлиента
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &ЕстьВидПечати
|				ТОГДА Лико_Формы.ВидПечати = &ВидПечати
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &ЕстьОрганизация
|				ТОГДА Лико_Формы.ЗаказТех.Организация = &Организация
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ";
КонецПроцедуры
