
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Заказ") Тогда
	//	Если Параметры.Отбор.Заказ.Площадка=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
	//		
	//		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоЗаказу", Истина)
	//	Иначе
	//		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоЗаказу", Ложь);
	//	КонецЕсли
	//Иначе
	//	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоЗаказу",Ложь);
	//КонецЕсли;
		
	
	
КонецПроцедуры
