&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РабочийЦентр") Тогда
		Объект.РабочийЦентр=Параметры.РабочийЦентр;
	КонецЕсли;
	
	Если Параметры.Свойство("Заказ") Тогда
		Объект.Заказ=Параметры.Заказ;
	КонецЕсли;

	
	
	Данные= ДанныеПоРЦ(Объект.РабочийЦентр,Объект.Заказ)[0];
     	Заполнить(Данные);

	
	ПоказатьЦветаРаботы();
	Объект.Вариант = КоличествоВариантов(Объект.Спецификация);
	Если ЗначениеЗаполнено(Объект.Заказ) Тогда 
		Объект.Повтор = Объект.Заказ.ПовторЗаказа.НомерБезПрефикса;
	КонецЕсли;	

			
	
КонецПроцедуры  



&НаСервере 
Процедура ПоказатьЦветаРаботы()
	Спецификация		=Объект.Спецификация;
	НомерВарианта		=Объект.НомерВарианта;
	НомерПередела		=Объект.НомерПередела;
	Заказ				=Объект.Заказ;
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	 "ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА ЗаказКлиентаЦвета.НомерСтроки = ВложенныйЗапрос.НомерСтроки
	 |			ТОГДА 1
	 |		ИНАЧЕ ЗаказКлиентаЦвета.НомерСтроки - ВложенныйЗапрос.НомерСтроки + 1
	 |	КОНЕЦ КАК Номер,
	 |	ЗаказКлиентаЦвета.ВидПечати КАК ВидПечати,
	 |	ЗаказКлиентаЦвета.ТипЦвета1 КАК ТипЦвета,
	 |	ЗаказКлиентаЦвета.ТипКраски КАК ТипКраски,
	 |	ЗаказКлиентаЦвета.Название КАК Название,
	 |	ЗаказКлиентаЦвета.ПроцентЗаливки КАК ПроцентЗаливки,
	 |	ЗаказКлиентаЦвета.Грамматура КАК Грамматура,
	 |	ЗаказКлиентаЦвета.ЗапечатываемыйМатериал КАК ЗапечатываемыйМатериал,
	 |	ЗаказКлиентаЦвета.Цветоделение КАК Цветоделение,
	 |	ЗаказКлиентаЦвета.Форма.Код КАК Форма
	 |ИЗ
	 |	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 |			МИНИМУМ(ЗаказКлиентаЦвета.НомерСтроки) КАК НомерСтроки,
	 |			ЗаказКлиентаЦвета.Ссылка КАК Заказ,
	 |			ЗаказКлиентаЦвета.НомерВарианта КАК НомерВарианта
	 |		ИЗ
	 |			Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	 |		ГДЕ
	 |			ЗаказКлиентаЦвета.Ссылка = &Заказ
	 |		
	 |		СГРУППИРОВАТЬ ПО
	 |			ЗаказКлиентаЦвета.Ссылка,
	 |			ЗаказКлиентаЦвета.НомерВарианта) КАК ВложенныйЗапрос
	 |		ПО ЗаказКлиентаЦвета.Ссылка = ВложенныйЗапрос.Заказ
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ЗаказКлиентаЦвета.НомерСтроки";
	Запрос.УстановитьПараметр("Заказ", Заказ);

	Объект.Цвета.Загрузить(Запрос.Выполнить().Выгрузить());

	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЗаказКлиентаВидыРабот.НомерСтроки = ВложенныйЗапрос.НомерСтроки
	             |			ТОГДА 1
	             |		ИНАЧЕ ЗаказКлиентаВидыРабот.НомерСтроки - ВложенныйЗапрос.НомерСтроки + 1
	             |	КОНЕЦ КАК Ном,
	             |	ЗаказКлиентаВидыРабот.ВидРабот КАК ВидРабот,
	             |	ЗаказКлиентаВидыРабот.РабочийЦентр КАК РабочийЦентр,
	             |	ЗаказКлиентаВидыРабот.Оснастка КАК Оснастка,
	             |	ЗаказКлиентаВидыРабот.Оснастка.Артикул КАК Артикул,
	             |	ЗаказКлиентаВидыРабот.Материал КАК Материал,
	             |	ЗаказКлиентаВидыРабот.Нарезка КАК Нарезка,
	             |	ЗаказКлиентаВидыРабот.Клей КАК Клей,
	             |	ЗаказКлиентаВидыРабот.ПроцентЗаливки КАК Процент,
	             |	ЗаказКлиентаВидыРабот.Дополнительно КАК Дополнительно,
	             |	ЗаказКлиентаВидыРабот.НомерСтроки КАК НомерСтроки
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		МИНИМУМ(ЗаказКлиентаВидыРабот.НомерСтроки) КАК НомерСтроки,
	             |		ЗаказКлиентаВидыРабот.Ссылка КАК Заказ
	             |	ИЗ
	             |		Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	             |	ГДЕ
	             |		ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		ЗаказКлиентаВидыРабот.Ссылка) КАК ВложенныйЗапрос
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	             |		ПО ВложенныйЗапрос.Заказ = ЗаказКлиентаВидыРабот.Ссылка" ;
	
				Запрос.УстановитьПараметр("Заказ", Заказ);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого колонка из ТЗ.Колонки Цикл
		колонка.Ширина = 15;
	Конеццикла;
	ТЗ.Колонки.Ном.Ширина = 2;
	
	ТЗ.Колонки.Вставить(4, "Машины",, , 40);
	Для каждого стр из ТЗ Цикл
		ЗапросМашины = Новый Запрос;
		ЗапросМашины.Текст = 
			"ВЫБРАТЬ Различные
		|	СпецификацииНоменклатурыМашины.РабочийЦентр.Наименование КАК Наименование,
		|	СпецификацииНоменклатурыМашины.РабочийЦентр.ПорядковыйНомер КАК ПорядковыйНомер
		|ИЗ
		|	Документ.ЗаказКлиента.ВидыРабот КАК СпецификацииНоменклатурыМашины
		|ГДЕ
		|	СпецификацииНоменклатурыМашины.Ссылка = &Ссылка";

		ЗапросМашины.УстановитьПараметр("Ссылка",Спецификация);
	
		ВыборкаМашины = ЗапросМашины.Выполнить().Выбрать();
		стрМашины = "";
		сч = 0;
		Пока ВыборкаМашины.Следующий() Цикл
			Если сч = 0 Тогда 
				стрМашины = стрМашины+ВыборкаМашины.Наименование +"; ";
			Иначе	
				стрМашины = стрМашины+Строка(ВыборкаМашины.ПорядковыйНомер)+"; ";
			КонецЕсли;
			сч = сч+1;
		КонецЦикла;
		
		стр.Машины =стрМашины;
	КонецЦикла;
	

	Объект.ВидыРабот.Загрузить(ТЗ);

	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ОригиналМакет,
	|	ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.НомерСтроки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Объект.Этикетки.Загрузить(Запрос.Выполнить().Выгрузить());

		
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпецификацииНоменклатурыПараметрыШтампа.ШтампВырубной КАК ШтампВырубной,
	|	СпецификацииНоменклатурыПараметрыШтампа.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	СпецификацииНоменклатурыПараметрыШтампа.ШиринаРукаваТУ КАК ШиринаРулона,
	|	СпецификацииНоменклатурыПараметрыШтампа.Ручьи КАК Ручьи,
	|	СпецификацииНоменклатурыПараметрыШтампа.Z КАК Z,
	|	СпецификацииНоменклатурыПараметрыШтампа.ШагПечати КАК ШагПечати,
	|	СпецификацииНоменклатурыПараметрыШтампа.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	СпецификацииНоменклатурыПараметрыШтампа.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	СпецификацииНоменклатурыПараметрыШтампа.ШтампВырубной.Артикул КАК Артикул
	|ИЗ
	|	Документ.ЗаказКлиента КАК СпецификацииНоменклатурыПараметрыШтампа
	|ГДЕ
	|	СпецификацииНоменклатурыПараметрыШтампа.Ссылка = &Заказ" ;
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Объект.ПараметрыШтампа.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция КоличествоВариантов(Спецификация)
	//Спецификация		=Объект.Спецификация;
	//НомерВарианта		=Объект.НомерВарианта;
	//НомерПередела		=Объект.НомерПередела;
	//Заказ				=Объект.Заказ;
	//Вариант				=Объект.Вариант;


	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	МАКСИМУМ(СпецификацииНоменклатурыВариантыСпецификации.НомерСтроки) КАК ВсегоВариантов
	//|ИЗ
	//|	Документ.ЗаказКлиента.ВариантыСпецификации КАК СпецификацииНоменклатурыВариантыСпецификации
	//|ГДЕ
	//|	СпецификацииНоменклатурыВариантыСпецификации.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Заказ);
	//Результат = Запрос.Выполнить().Выбрать();
	//Результат.Следующий();
	Возврат 1;
КонецФункции

&НаСервере
Процедура НомерВариантаПриИзменении(Элемент)
	Спецификация		=Объект.Спецификация;
	НомерВарианта		=Объект.НомерВарианта;
	НомерПередела		=Объект.НомерПередела;
	Заказ				=Объект.Заказ;
	Вариант				=Объект.Вариант;

	Если Значениезаполнено(Элемент.Значение) Тогда
		Если Элемент.Значение>Вариант Тогда
			НомерВарианта = Вариант;
		Иначе
			НомерВарианта = Элемент.Значение;
		КонецЕсли;
		ПоказатьЦветаРаботы();
        ЗаполнитьРасчетныеПараметры();

	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьРасчетныеПараметры()
	Спецификация		=Объект.Спецификация;
	НомерВарианта		=Объект.НомерВарианта;
	НомерПередела		=Объект.НомерПередела;
	Заказ				=Объект.Заказ;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ШтампВырубной.Артикул, """") КАК ШтампВырубной,
	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ШиринаРулона, ЗНАЧЕНИЕ(справочник.ЯССМ_Нарезки.пустаяссылка)) КАК Нарезка,
	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.Z, ЗНАЧЕНИЕ(Справочник.Лико_ZКоличествоЗубьев.ПустаяСсылка)) КАК Z,
	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ШагПечати, 0) КАК ШагПечати,
	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ШтампВырубной, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Оснастка
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры.ПараметрыШтампа КАК СпецификацииНоменклатурыПараметрыШтампа
	|ГДЕ
	|	СпецификацииНоменклатурыПараметрыШтампа.Ссылка = &спецификация
	|	И СпецификацииНоменклатурыПараметрыШтампа.НомерВарианта = &номерварианта";
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	ШтампВырубной = Результат.ШтампВырубной;
	Z = Результат.Z;
	ШагПечати = Результат.ШагПечати;
	Нарезка = Результат.Нарезка;
	Оснастка = Результат.Оснастка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) КАК МетрыНаНастройку,
		|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак) КАК МетрыНаБрак,
		|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.ВремяПечати) КАК ВремяПечати,
		|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку) КАК ВремяНаНастройку,
		|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.СкоростьПечати) КАК СкоростьПечати,
		|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ) КАК МетражДляРЦ
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
		|ГДЕ
		|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
		|	И Лико_ПараметрыПроизводстваЗаказа.Спецификация = &Спецификация
		|	И Лико_ПараметрыПроизводстваЗаказа.НомерПередела = 1
		|	И Лико_ПараметрыПроизводстваЗаказа.НомерВарианта = &НомерВарианта";	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий(); 
	
	ВремяНанастройкуЧас = Цел(Результат.ВремяНанастройку/60); 
	ВремяНанастройкуМин =  Результат.ВремяНанастройку-ВремяНанастройкуЧас*60; 
    ВремяНанастройку = Строка(ВремяНанастройкуЧас)+ " ч. "+Строка(ВремяНанастройкуМин)+ " мин.";


	ВремяПечатиЧас = Цел(Результат.ВремяПечати/60); 
	ВремяПечатиМин =  Результат.ВремяПечати-ВремяПечатиЧас*60; 
    ВремяПечати = Строка(ВремяПечатиЧас)+ " ч. "+Строка(ВремяПечатиМин)+ " мин.";

	ВремяИзготовления = Результат.ВремяПечати+Результат.ВремяНаНастройку;
	ВремяВыпЗаказаЧас = Цел(ВремяИзготовления/60); 
	ВремяВыпЗаказаМин = ВремяИзготовления-ВремяВыпЗаказаЧас*60; 
    ВремяИзготовления = Строка(ВремяВыпЗаказаЧас)+ " ч. "+Строка(ВремяВыпЗаказаМин)+ " мин.";
    

	
КонецПроцедуры	

&НаСервере
Процедура УстановитьНажатие(Элемент)
	////Спецификация		=Объект.Спецификация;
	////НомерВарианта		=Объект.НомерВарианта;
	////НомерПередела		=Объект.НомерПередела;
	////Заказ				=Объект.Заказ;
	////Вариант				=Объект.Вариант;
	////Нарезка				=Объект.Нарезка;
	////Оснастка			=Объект.Оснастка;
	////Z				    =Объект.Z;
	////РабочийЦентр		=Объект.РабочийЦентр;

	////Если НомерПередела <> 1 Тогда 
	////	Сообщить("Номер варианта можно изменить только для первого передела");
	////	Возврат;
	////КонецЕсли;
	////
	////Режим = РежимДиалогаВопрос.ДаНет;
	////Текст = "Вы хотите установить новый вариант выполнения этого заказа?";
	////Ответ = Вопрос(Текст, Режим, 0);
	////Если Ответ = КодВозвратаДиалога.Да Тогда
	////	ЗагрузкаЦентров = РегистрыСведений.Лико_ЗагрузкаРабочихЦентров.СоздатьМенеджерЗаписи();
	////	ЗагрузкаЦентров.Заказ =Заказ;
	////	ЗагрузкаЦентров.Спецификация =Спецификация;
	////	ЗагрузкаЦентров.НомерПередела =НомерПередела;
	////	ЗагрузкаЦентров.Прочитать();
	////	ЗагрузкаЦентров.Заказ =Заказ;
	////	ЗагрузкаЦентров.Спецификация =Спецификация;
	////	ЗагрузкаЦентров.НомерПередела =НомерПередела;
	////	ЗагрузкаЦентров.НомерВарианта = НомерВарианта;
	////	ЗагрузкаЦентров.Оснастка = Оснастка;
	////	ЗагрузкаЦентров.Z = Z;
	////	ЗагрузкаЦентров.Нарезка = Нарезка;
	////	ЗагрузкаЦентров.ТипРЦ = Лико_Планирование.ПолучитьТипРЦПоВарианту(Спецификация,НомерВарианта, 1);
	////    ЗагрузкаЦентров.ДатаДоставки = "";
	////	ЗагрузкаЦентров.ВключенВПланЗакупок = Ложь;
	////	ЗагрузкаЦентров.ДатаПроверкиНаличияМатериала = '00010101';
	////    ЗагрузкаЦентров.ЗаменаДопМатериалов = "";
	////	ЗагрузкаЦентров.ЗаменаМатериала = "";
	////	ЗагрузкаЦентров.ЗаменаНарезки = "";
	////	ЗагрузкаЦентров.НаличиеМатериала = "";
	////	ЗагрузкаЦентров.НаличиеРезерва = Ложь;
	////	ЗапросРезерв = Новый Запрос;
	////	ЗапросРезерв.текст = 
	////	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	////	|	Лико_РезервированиеМатериалов.Ссылка
	////	|ИЗ
	////	|	Документ.Лико_РезервированиеМатериалов КАК Лико_РезервированиеМатериалов
	////	|ГДЕ
	////	|	Лико_РезервированиеМатериалов.Заказ = &Заказ
	////	|	И Лико_РезервированиеМатериалов.Спецификация = &Спецификация
	////	|	И Лико_РезервированиеМатериалов.ВидОперации = &ВидОперации";
	////	ЗапросРезерв.УстановитьПараметр("Заказ", Заказ);
	////	ЗапросРезерв.УстановитьПараметр("Спецификация", Спецификация);
	////	ЗапросРезерв.УстановитьПараметр("ВидОперации", Перечисления.ВидыДвиженийПриходРасход.Приход);
	////	Если Не Запросрезерв.Выполнить().Пустой() Тогда
	////		РезультатРезерв = ЗапросРезерв.Выполнить().Выбрать();
	////		РезультатРезерв.Следующий();
	////		ДокРезерв = РезультатРезерв.Ссылка.ПолучитьОбъект();
	////		ДокРезерв.Материалы.Очистить();
	////		ДокРезерв.Записать(РежимЗаписиДокумента.Проведение);
	////	КонецЕсли;

	////	
	////	Запрос = Новый Запрос; 
	////	Если ЗагрузкаЦентров.РабочийЦентр <>Справочники.РабочиеЦентры.СвободныеЗаказы И ЗагрузкаЦентров.РабочийЦентр <>Справочники.РабочиеЦентры.СнятыеЗаказы Тогда	
	////		Запрос.Текст = 
	////		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	////		|	Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку КАК МетрыНаНастройку,
	////		|	Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак КАК МетрыНаБрак,
	////		|	Лико_ПараметрыПроизводстваЗаказа.ВремяПечати КАК ВремяПечати,
	////		|	Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку КАК ВремяНаНастройку,
	////		|	Лико_ПараметрыПроизводстваЗаказа.СкоростьПечати КАК СкоростьПечати,
	////		|	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ,
	////		|	ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр, Значение(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр
	////		
	////		|ИЗ
	////		|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	////		|ГДЕ
	////		|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	////		|	И Лико_ПараметрыПроизводстваЗаказа.Спецификация = &Спецификация
	////		|	И Лико_ПараметрыПроизводстваЗаказа.НомерПередела = 1
	////		|	И Лико_ПараметрыПроизводстваЗаказа.НомерВарианта = &НомерВарианта
	////		|	И Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр = &РабочийЦентр";
	////		Запрос.УстановитьПараметр("Заказ", Заказ);
	////		Запрос.УстановитьПараметр("Спецификация", Спецификация);
	////		Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);
	////		Запрос.УстановитьПараметр("РабочийЦентр", ЗагрузкаЦентров.РабочийЦентр);
	////		
	////		Результат = Запрос.Выполнить().Выбрать();
	////		Результат.Следующий(); 
	////		Если Не ЗначениеЗаполнено(Результат.РабочийЦентр) Тогда
	////			Режим = РежимДиалогаВопрос.ОКОтмена;
	////			Текст = "Данная машина для варианта "+НомерВарианта+ " не предусмотрена! Произвести расчет варианта для этой машины?" ;
	////			Ответ = Вопрос(Текст, Режим, 0);
	////            Если Ответ = КодВозвратаДиалога.Отмена Тогда
	////                Возврат;
	////			КонецЕсли;
	////			//Необходимо провести расчет по данному рабочему центру!!!!!
	////			Лико_Планирование.Добавить_Рассчитать_РЦ(Заказ, Спецификация, РабочийЦентр, НомерПередела, НомерВарианта);
	////			Результат = Запрос.Выполнить().Выбрать();
	////			Результат.Следующий();
	////		Конецесли;	
	////		ЗагрузкаЦентров.Метраж = Результат.МетражДляРЦ;
	////		ЗагрузкаЦентров.ВремяИзготовления = Результат.ВремяПечати+Результат.ВремяНаНастройку;
	////		ЗагрузкаЦентров.ВремяНанастройку = Результат.ВремяНаНастройку;
	////		ЗагрузкаЦентров.Записать();

	////        Лико_Планирование.СкорректироватьЗагрузку(ЗагрузкаЦентров.РабочийЦентр);

	////		
	////	Иначе
	////		Запрос = Новый Запрос;
	////		Запрос.Текст = 
	////			"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	////			|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку) КАК МетрыНаНастройку,
	////			|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак) КАК МетрыНаБрак,
	////			|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.ВремяПечати) КАК ВремяПечати,
	////			|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку) КАК ВремяНаНастройку,
	////			|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.СкоростьПечати) КАК СкоростьПечати,
	////			|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ) КАК МетражДляРЦ
	////			|ИЗ
	////			|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	////			|ГДЕ
	////			|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	////			|	И Лико_ПараметрыПроизводстваЗаказа.Спецификация = &Спецификация
	////			|	И Лико_ПараметрыПроизводстваЗаказа.НомерПередела = 1
	////			|	И Лико_ПараметрыПроизводстваЗаказа.НомерВарианта = &НомерВарианта";	
	////		Запрос.УстановитьПараметр("Заказ", Заказ);
	////		Запрос.УстановитьПараметр("Спецификация", Спецификация);
	////		Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);
	////		Результат = Запрос.Выполнить().Выбрать();
	////		Результат.Следующий(); 

	////		ЗагрузкаЦентров.Метраж = Результат.МетражДляРЦ;
	////		ЗагрузкаЦентров.ВремяИзготовления = Результат.ВремяПечати+Результат.ВремяНаНастройку;
	////		ЗагрузкаЦентров.ВремяНанастройку = Результат.ВремяНаНастройку;
	////        ЗагрузкаЦентров.Записать();
	////	КонецЕсли;
	////	
	//////Проверим, есть ли следующие переделы по этой спецификации, удалим их и создадим новые
	////	ЗапросСлП = Новый Запрос;
	////	ЗапросСлП.Текст = 
	////	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	////	|	Лико_ЗагрузкаРабочихЦентров.Заказ,
	////	|	Лико_ЗагрузкаРабочихЦентров.Спецификация,
	////	|	Лико_ЗагрузкаРабочихЦентров.НомерПередела,
	////	|	Лико_ЗагрузкаРабочихЦентров.РабочийЦентр,
	////	|	Лико_ЗагрузкаРабочихЦентров.НомерВарианта
	////	|ИЗ
	////	|	РегистрСведений.Лико_ЗагрузкаРабочихЦентров КАК Лико_ЗагрузкаРабочихЦентров
	////	|ГДЕ
	////	|	Лико_ЗагрузкаРабочихЦентров.Заказ = &Заказ
	////	|	И Лико_ЗагрузкаРабочихЦентров.Спецификация = &Спецификация
	////	|	И Лико_ЗагрузкаРабочихЦентров.НомерПередела > 1
	////	|	И Лико_ЗагрузкаРабочихЦентров.НомерВарианта <> &НомерВарианта";
	////	ЗапросСлП.УстановитьПараметр("Заказ", Заказ);
	////	ЗапросСлП.УстановитьПараметр("Спецификация", Спецификация);
	////	ЗапросСлП.УстановитьПараметр("НомерВарианта", НомерВарианта);
	////	ВыборкаСлП = ЗапросСлП.Выполнить().Выбрать();
	////	Пока ВыборкаСлП.Следующий() Цикл
	////		ЗагрузкаСлП = РегистрыСведений.Лико_ЗагрузкаРабочихЦентров.СоздатьМенеджерЗаписи();
	////		ЗагрузкаСлП.Заказ =Заказ;
	////		ЗагрузкаСлП.Спецификация =Спецификация;
	////		ЗагрузкаСлП.НомерПередела =ВыборкаСлП.НомерПередела;
	////		ЗагрузкаСлП.Удалить();		
	////	КонецЦикла;
	////    Лико_Планирование.ДобавитьСледующиеПеределы(Заказ, Спецификация, НомерВарианта);		
	////	
	////	Лико_Планирование.ЗаполнитьПотребностиПоВариантуИМашине(Заказ, Спецификация);

	////КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоРЦ(РабочийЦентр,Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
|	ЗаказКлиента.НомерБезПрефикса КАК Номер,
|	ЗаказКлиента.Контрагент КАК Контрагент,
|	Лико_ПараметрыПроизводстваЗаказа.НомерВарианта КАК НомерВарианта,
|	ЗаказКлиента.Z КАК Z,
|	ЗаказКлиента.Нарезка КАК Нарезка,
|	ЗаказКлиента.ШтампВырубной.Артикул КАК Оснастка,
|	ЗаказКлиента.МетражПМ КАК Метраж,
|	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр КАК РабочийЦентр,
|	ЗаказКлиента.ДатаОтгрузки КАК СрокСдачи,
|	ПооперационноеРасписание2_2.Начало КАК ДатаНачала,
|	ПооперационноеРасписание2_2.Окончание КАК ДатаОкончания,
|	ЗаказКлиента.Ссылка КАК Заказ,
|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПередела,
|	Лико_ПараметрыПроизводстваЗаказа.ВремяПечати + Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку+Лико_ПараметрыПроизводстваЗаказа.ВремяНаСменуРоликов КАК ВремяИзготовления,
|	ВЫБОР
|		КОГДА ПооперационноеРасписание2_2.Выполняется > 0
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК Выполняется,
|	ЗаказКлиента.Трафарет КАК Тр,
|	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра КАК ТипРЦ,
|	ЗаказКлиента.Этикетки КАК Этикетки1,
|	ЗаказКлиента.ШагПечати КАК ШагПечати,
|	Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку КАК ВремяНаНастройку
|ИЗ
|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
|		ПО Лико_ПараметрыПроизводстваЗаказа.Заказ = ЗаказКлиента.Ссылка
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
|		ПО Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра = ПооперационноеРасписание2_2.РабочийЦентр.ВидРабочегоЦентра
|			И Лико_ПараметрыПроизводстваЗаказа.Заказ = ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
|ГДЕ
|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
|	И Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра = &ВидРабочегоЦентра";
		
			
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр );
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",РабочийЦентр.ВидРабочегоЦентра );

	Запрос.УстановитьПараметр("Заказ",Заказ );
    Запрос.УстановитьПараметр("ДатаКонтроляМатериала",ТекущаяДата());

	                          
	Возврат Запрос.Выполнить().Выгрузить();

	
	
	
	
	
	
	
	
КонецФункции

&НаСервере
Процедура Заполнить(ТекСтрока) Экспорт
	Заказ = Текстрока.Заказ;
	Объект.Заказ = текСтрока.Заказ;
	Объект.НомерЗаказа  = Прав(Заказ.Номер,7);
	//Объект.Спецификация = текСтрока.Спецификация;
	Объект.НомерПередела = текСтрока.НомерПередела;
    Объект.РабочийЦентр = текСтрока.РабочийЦентр;

	Если ЗначениеЗаполнено(текСтрока.НомерВарианта) Тогда
		Объект.НомерВарианта = текСтрока.НомерВарианта;
	Иначе
		Объект.НомерВарианта = 1;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Лико_ЗагрузкаРабочихЦентров.ВремяНаНастройку, 0) КАК ВремяНаНастройку
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ЗагрузкаРабочихЦентров
	|ГДЕ
	|	Лико_ЗагрузкаРабочихЦентров.Заказ = &Заказ
	|	И Лико_ЗагрузкаРабочихЦентров.НомерПроката = &НомерПередела";
	
	Запрос.УстановитьПараметр("Заказ", ТекСтрока.Заказ);
	Запрос.УстановитьПараметр("НомерПередела", ТекСтрока.НомерВарианта);
	
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();

	
	
	Объект.СрокСдачи = текСтрока.СрокСдачи;
	Если  Текстрока.НомерПередела = 1 Тогда
		Объект.ТехнологическаяОперация = "ПервыйПрокат";
	ИначеЕсли Текстрока.НомерПередела = 2 Тогда
		Объект.ТехнологическаяОперация = "ВторойПрокат2";
	КонецЕсли;
	Объект.Контрагент = ТекСтрока.контрагент;
	Объект.Менеджер = Заказ.Ответственный;
	ФизЛицо = Заказ.Ответственный.ФизическоеЛицо;
	//Если ЗначениеЗаполнено(ФизЛицо) Тогда
	//	Объект.Регион =Лико_Планирование.ПолучитьРегион(ФизЛицо) ;
	//КонецЕсли;
    Объект.ВидЗаказа = Заказ.ВидЗаказа;
    ВремяВыпЗаказаЧас = Цел(ТекСтрока.ВремяИзготовления/60); 
	ВремяВыпЗаказаМин =  ТекСтрока.ВремяИзготовления-ВремяВыпЗаказаЧас*60; 
    Объект.ВремяИзготовления = Строка(ВремяВыпЗаказаЧас)+ " ч. "+Строка(ВремяВыпЗаказаМин)+ " мин.";
    
	ВремяНанастройкуЧас = Цел(ТекСтрока.ВремяНанастройку/60); 
	ВремяНанастройкуМин =  ТекСтрока.ВремяНанастройку-ВремяНанастройкуЧас*60; 
    Объект.ВремяНанастройку = Строка(ВремяНанастройкуЧас)+ " ч. "+Строка(ВремяНанастройкуМин)+ " мин.";

	ВремяПечати = ТекСтрока.ВремяИзготовления- ТекСтрока.ВремяНанастройку;
	ВремяПечатиЧас = Цел(ВремяПечати/60); 
	ВремяПечатиМин =  ВремяПечати-ВремяПечатиЧас*60; 
    Объект.ВремяПечати = Строка(ВремяПечатиЧас)+ " ч. "+Строка(ВремяПечатиМин)+ " мин.";
	
	Объект.Метраж =  ТекСтрока.Метраж;
	Объект.Z =  ТекСтрока.Z;
    Объект.Нарезка =  ТекСтрока.Нарезка;
	//Объект.Шагпечати =  ТекСтрока.Метраж;
	Объект.Штампвырубной =  ТекСтрока.Оснастка;

	//Объект.ОсновнойМатериал =  ТекСтрока.Спецификация.ОсновнойМатериал; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерВариантаПриИзменении1(Элемент)
		Если Значениезаполнено(Элемент.Значение) Тогда
		Если Элемент.Значение>Объект.Вариант Тогда
			НомерВарианта = Объект.Вариант;
		Иначе
			НомерВарианта = Элемент.Значение;
		КонецЕсли;
		ПоказатьЦветаРаботы();
        ЗаполнитьРасчетныеПараметры();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НомерВариантаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Список = Новый СписокЗначений();
    сч = 1;
	Пока сч <= Объект.вариант Цикл
		Список.Добавить(сч);
		сч =сч+1;
	КонецЦикла;

	РезультатВыбора = ВыбратьИзСписка(Список, Элементы.НомерВарианта);
                                                                                              
	Если РезультатВыбора <> Неопределено Тогда

		НомерВарианта                          = РезультатВыбора.Значение;
        ПоказатьЦветаРаботы();
        ЗаполнитьРасчетныеПараметры();
	КонецЕсли;

КонецПроцедуры







