
//&НаСервере
//&Вместо("НайтиСвязанныеДокументыНаСервере")
//Процедура Лико_НайтиСвязанныеДокументыНаСервере(ДокментСсылка, МассивСсылок)


//    НайтиСвязанныеДокументыНаСервереПоЗаказуКлиента(ДокментСсылка, МассивСсылок);
//	Лико_НайтиСвязанныеДокументыНаСервереПоРеализации(ДокментСсылка, МассивСсылок);

//КонецПроцедуры  

//&НаСервереБезКонтекста
//Процедура Лико_НайтиСвязанныеДокументыНаСервереПоРеализации(ДокментСсылка, МассивСсылок)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	Если   ТипЗнч(ДокментСсылка)<> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
//		
//		Возврат;
//		
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СчетФактураВыданный.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
//	|ГДЕ
//	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
//	Запрос.УстановитьПараметр("ДокументОснование",ДокментСсылка );
//	РезультатЗапроса = Запрос.Выполнить();  
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл
//	    МассивСсылок.Добавить(Выборка.Ссылка);
//	КонецЦикла; 
//	
//	
//	

//КонецПроцедуры


