#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СоздатьПередачуПродукцииВФоне(Параметры, АдресХранилища) Экспорт
	
	Основание = Параметры.Основание;
	
	НачатьТранзакцию();
	
	Попытка
		НовыйДокументПередачаНаСклад = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
		
		НовыйДокументПередачаНаСклад.Заполнить(Основание);
		НовыйДокументПередачаНаСклад.Дата = ТекущаяДата();
		НовыйДокументПередачаНаСклад.Комментарий = "" +  Основание;
		
		//НовыйДокументПередачаНаСклад.Записать(РежимЗаписиДокумента.Проведение);
		НовыйДокументПередачаНаСклад.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Создан документ """ + НовыйДокументПередачаНаСклад.Ссылка + """"); 
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(НовыйДокументПередачаНаСклад.Ссылка, АдресХранилища);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//		КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	//// Товарный чек
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.ПечатьТоварногоЧека";
	//КомандаПечати.Идентификатор = "ТоварныйЧек";
	//КомандаПечати.Представление = НСтр("ru = 'Товарный чек'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры
	
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция СформироватьТаблицуДляКорректировкиРегистров(МассивСерий, Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец КАК Характеристика,
		|	СерииНоменклатуры.Ссылка КАК Серия,
		|	СерииНоменклатуры.Лико_КоличествоВУпаковке КАК Количество,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ДвиженияСерийТоваров.Документ КАК Документ.ПриходныйОрдерНаТовары)) КАК ПриходныйОрдерНаТовары
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
		|		ПО СерииНоменклатуры.Ссылка = ДвиженияСерийТоваров.Серия
		|			И (ДвиженияСерийТоваров.Документ ССЫЛКА Документ.ПриходныйОрдерНаТовары)
		|			И (ВЫРАЗИТЬ(ДвиженияСерийТоваров.Документ КАК Документ.ПриходныйОрдерНаТовары).Склад = &Склад)
		|			И (ВЫРАЗИТЬ(ДвиженияСерийТоваров.Документ КАК Документ.ПриходныйОрдерНаТовары).СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаОтПоставщика))
		|ГДЕ
		|	СерииНоменклатуры.Ссылка В(&МассивСерий)
		|
		|СГРУППИРОВАТЬ ПО
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец,
		|	СерииНоменклатуры.Ссылка,
		|	СерииНоменклатуры.Лико_КоличествоВУпаковке,
		|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Серия";
	
	Запрос.УстановитьПараметр("МассивСерий", МассивСерий);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецЕсли

