
Перем КлючиСтруктуры;
Перем ОтключитьЧастьПроверок;
Перем КоличествоЗаказовКоторыеПишутВОбщийЭтап;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Содержимое.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Не выбрано ни одной коробки.");
		Возврат;
	КонецЕсли;
	
	Движения.Лико_АдресноеХранение.Записывать = Истина;
	Движения.Лико_УчетГотовыхЭтикеток.Записывать = Истина;
	
	// регистр ЛикоАдресноеХранение
	Для Каждого ТекСтрокаСодержимое Из Содержимое Цикл
		Движение = Движения.Лико_АдресноеХранение.Добавить();
		Движение.Период = Дата;
		Движение.Серия = ТекСтрокаСодержимое.Серия;
		Движение.Склад = ЯчейкаПолучатель.Владелец;
		Движение.Ячейка = ЯчейкаПолучатель;
		Движение.Паллет = Паллет;
		Движение.ВыбылСоСклада = ТекСтрокаСодержимое.ВыбылСоСклада;
	КонецЦикла;
	
	Если ДополнительныеСвойства.Свойство("ПровестиТолькоПоРегиструАдресноеХранение") Тогда
		// Сформируем движения по СодержимоеРастарки, т.к. обычно они формируются после проведения
		Для Каждого ТекСтрокаСодержимое Из СодержимоеРастарки Цикл
			Движение = Движения.Лико_АдресноеХранение.Добавить();
			Движение.Период = Дата;
			Движение.Серия = ТекСтрокаСодержимое.Серия;
			Движение.Склад = ЯчейкаРастарка.Владелец;
			Движение.Ячейка = ЯчейкаРастарка;
			Движение.ВыбылСоСклада = Истина;
		КонецЦикла;
	
		Возврат;
	КОнецЕслИ;
	
	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
	
		// Проверим, чтобы коробки, выбранные в формировании, не были уже сформированными
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ФормированиеПаллетаСодержимое.Серия КАК Серия,
			|	ВЫБОР
			|		КОГДА Лико_ФормированиеПаллетаСодержимое1.Серия ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК СерияВыпущена,
			|	Лико_ФормированиеПаллетаСодержимое1.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое1
			|		ПО Лико_ФормированиеПаллетаСодержимое.Серия = Лико_ФормированиеПаллетаСодержимое1.Серия
			|			И (Лико_ФормированиеПаллетаСодержимое1.Ссылка <> &ЭтотДокумент)
			|			И (Лико_ФормированиеПаллетаСодержимое1.Ссылка.Проведен)
			|			И (Лико_ФормированиеПаллетаСодержимое1.Ссылка.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции))
			|ГДЕ
			|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &ЭтотДокумент";
		
		Запрос.УстановитьПараметр("ЭтотДокумент", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.СерияВыпущена Тогда
				Отказ = Истина;
				Сообщить("Серия """ + ВыборкаДетальныеЗаписи.Серия + """ уже содержится в документе """ + ВыборкаДетальныеЗаписи.Ссылка + """ (" + ВыборкаДетальныеЗаписи.Ссылка.Паллет + "). Проведение невозможно.");
			КонецЕсли;
		КонецЦикла;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отказ = НЕ СоздатьТиповыеДокументы();
	
	Если НЕ Отказ Тогда
		
		// <-- Начало Лико Яцун С. В. 26.09.2025 
		Если Площадка = Справочники.Лико_Площадки.Линкс И ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции И НЕ ВыпускИзРастарки Тогда 
			УдалитьЗаписиДвиженияПеремотки(); 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.Ответственный КАК Ответстввенный,
			|	Лико_ФормированиеПаллетаСодержимое.Ссылка КАК Документ,
			|	СУММА(СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.КоличествоВРоликеПослеПеремотки) КАК КоличествоТысШт,
			|	СерииНоменклатурыЛико_Содержимое.Ссылка.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК ЗаказКлиента,
			|	СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.НомерБланка КАК НомерБланка,
			|	МАКСИМУМ(СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.КоличествоВРоликеПослеПеремотки) КАК КоличествоВРоликеПослеПеремотки,
			|	СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.РабочийЦентрВыпускаВРоликеПослеПеремотки КАК РабочийЦентрВыпускаВРоликеПослеПеремотки,
			|	НАЧАЛОПЕРИОДА(СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.ДатаФормирования, ДЕНЬ) КАК ДатаФормирования
			|ИЗ
			|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры.Лико_Содержимое КАК СерииНоменклатурыЛико_Содержимое
			|		ПО Лико_ФормированиеПаллетаСодержимое.Серия = СерииНоменклатурыЛико_Содержимое.Ссылка
			|ГДЕ
			|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Лико_ФормированиеПаллетаСодержимое.Ссылка,
			|	СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.Ответственный,
			|	СерииНоменклатурыЛико_Содержимое.Ссылка.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры,
			|	СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.НомерБланка,
			|	СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.РабочийЦентрВыпускаВРоликеПослеПеремотки,
			|	НАЧАЛОПЕРИОДА(СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.ДатаФормирования, ДЕНЬ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаФормирования
			|ИТОГИ ПО
			|	Ответстввенный";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаОтветстввенный = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОтветстввенный.Следующий() Цикл
				// Вставить обработку выборки ВыборкаОтветстввенный
				
				ВыборкаДетальныеЗаписи = ВыборкаОтветстввенный.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ПараметрыДляВыработкиПеремотки = Новый Структура();
					ПараметрыДляВыработкиПеремотки.Вставить("Сотрудник",Лико_Дополнительно.ПолучитьСотрудникаПоФизЛицу(ВыборкаДетальныеЗаписи.Ответстввенный));
					ПараметрыДляВыработкиПеремотки.Вставить("Смена",Неопределено);
					ПараметрыДляВыработкиПеремотки.Вставить("ТипОперацииПеремотки",Справочники.Лико_ТипыОперацийПеремотка.БумажнаяПодложка);
					ПараметрыДляВыработкиПеремотки.Вставить("КоличествоТысШт",ВыборкаДетальныеЗаписи.КоличествоТысШт);
					ПараметрыДляВыработкиПеремотки.Вставить("КоличествоПМ",Неопределено);
					ПараметрыДляВыработкиПеремотки.Вставить("КоличествоНастроек",0);
					ПараметрыДляВыработкиПеремотки.Вставить("ДвойнаяНика",Ложь);
					ПараметрыДляВыработкиПеремотки.Вставить("КоличествоЭтикетокВРолике",ВыборкаДетальныеЗаписи.КоличествоВРоликеПослеПеремотки * 1000);
					ПараметрыДляВыработкиПеремотки.Вставить("КоличествоРучьевПереворота",0);
					ПараметрыДляВыработкиПеремотки.Вставить("ДокументОснование",Ссылка);
					ПараметрыДляВыработкиПеремотки.Вставить("РабочийЦентр",ВыборкаДетальныеЗаписи.РабочийЦентрВыпускаВРоликеПослеПеремотки);

					Лико_Дополнительно.ДобавитьЗаписьВДокументЛико_ДвиженияЗаказаПоЭтапам(
					ВыборкаДетальныеЗаписи.ЗаказКлиента,
					"Перемотка",
					ВыборкаДетальныеЗаписи.КоличествоТысШт,
					Строка(Новый УникальныйИдентификатор),
					АвторДокумента,
					ВыборкаДетальныеЗаписи.ДатаФормирования,
					Ложь,
					ВыборкаДетальныеЗаписи.НомерБланка,
					,,,,ПараметрыДляВыработкиПеремотки);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 26.09.2025 
		
		ЗаполнитьДатыВыпускаВСериях(Отказ);
		ЗаполнитьВесИПлощадьВНоменклатуру(Отказ);
		
		Движения.Лико_АдресноеХранение.Записывать = Истина;
		Для Каждого ТекСтрокаСодержимое Из СодержимоеРастарки Цикл
			Движение = Движения.Лико_АдресноеХранение.Добавить();
			Движение.Период = Дата;
			Движение.Серия = ТекСтрокаСодержимое.Серия;
			Движение.Склад = ЯчейкаРастарка.Владелец;
			Движение.Ячейка = ЯчейкаРастарка;
			Движение.ВыбылСоСклада = Истина;
		КонецЦикла;
		
		Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
			// Обновим среднее количество в заказах
			ТаблицаЗаказов = Новый ТаблицаЗначений;
			ТаблицаЗаказов.Колонки.Добавить("Заказ");
			Для каждого Строка из Содержимое Цикл
				НоваяСтрока = ТаблицаЗаказов.Добавить();
				НоваяСтрока.Заказ = Строка.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры;
			КонецЦикла;
			ТаблицаЗаказов.Свернуть("Заказ");
			Для каждого Строка из ТаблицаЗаказов Цикл
				Лико_Дополнительно.ОбновитьВЗаказеСреднееКоличествоВКоробкеИРолике(Строка.Заказ, Ссылка,, Истина);
			КонецЦикла;
			
			Если НЕ ВыпускИзРастарки Тогда
				ВоВсехКоробкахЗаполненоСодержимое = Истина;
				ТзДляУчетаГотовыхЭтикеток = Новый ТаблицаЗначений;
				ТзДляУчетаГотовыхЭтикеток.Колонки.Добавить("ЗаказКлиента");
				ТзДляУчетаГотовыхЭтикеток.Колонки.Добавить("НомерБланка");
				ТзДляУчетаГотовыхЭтикеток.Колонки.Добавить("Количество");
				Для каждого ТекСтрока из Содержимое Цикл
					Если ТекСтрока.Серия.Лико_Содержимое.Количество() = 0 Тогда
						ВоВсехКоробкахЗаполненоСодержимое = Ложь;
						Прервать;
					КонецЕсли;
					ТекЗаказКлиента = ТекСтрока.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры;
					Для каждого ТекСтрокаРолика1 из ТекСтрока.Серия.Лико_Содержимое Цикл
						Для каждого ТекСтрокаРолика2 из ТекСтрокаРолика1.ОбъектНоменклатуры.СоставРоликаПослеПеремотки Цикл
							Если ЗначениеЗаполнено(ТекСтрокаРолика2.ОбъектНоменклатуры.СтатусРоликаПослеПеремотки) Тогда
								// Это ролик с намотки, нужен еще один цикл
								Для каждого ТекСтрокаРолика3 из ТекСтрокаРолика2.ОбъектНоменклатуры.СоставРоликаПослеПеремотки Цикл
									НоваяСтрока = ТзДляУчетаГотовыхЭтикеток.Добавить();
									НоваяСтрока.ЗаказКлиента = ТекЗаказКлиента;
									НоваяСтрока.НомерБланка = ТекСтрокаРолика3.ОбъектНоменклатуры.НомерБланка;
									НоваяСтрока.Количество = ТекСтрокаРолика3.Количество;
								КонецЦикла;
							Иначе
								// Это ролик с размотки
								НоваяСтрока = ТзДляУчетаГотовыхЭтикеток.Добавить();
								НоваяСтрока.ЗаказКлиента = ТекЗаказКлиента;
								НоваяСтрока.НомерБланка = ТекСтрокаРолика2.ОбъектНоменклатуры.НомерБланка;
								НоваяСтрока.Количество = ТекСтрокаРолика2.Количество; 
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				Если ВоВсехКоробкахЗаполненоСодержимое Тогда
					// Добавим записи в регистр Лико_УчетГотовыхЭтикеток 
					ТзДляУчетаГотовыхЭтикеток.Свернуть("ЗаказКлиента,НомерБланка", "Количество");
					Для каждого ТекСтрока из ТзДляУчетаГотовыхЭтикеток Цикл
						НоваяСтрока = Движения.Лико_УчетГотовыхЭтикеток.Добавить();
						НоваяСтрока.ЗаказКлиента = ТекСтрока.ЗаказКлиента;
						НоваяСтрока.Количество = ТекСтрока.Количество;
						НоваяСтрока.Период = Дата;
						НоваяСтрока.НомерБланка = ТекСтрока.НомерБланка;
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
						НоваяСтрока.Место = Перечисления.Лико_МестаУчетаГотовыхЭтикеток.Упаковка;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

Процедура УдалитьЗаписиДвиженияПеремотки()

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ДвиженияЗаказаПоЭтапамПеремотка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ДвиженияЗаказаПоЭтапам.Перемотка КАК Лико_ДвиженияЗаказаПоЭтапамПеремотка
	|ГДЕ
	|	Лико_ДвиженияЗаказаПоЭтапамПеремотка.ДокументОснование = &ДокументОснование
	|	И НЕ Лико_ДвиженияЗаказаПоЭтапамПеремотка.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ДвиженияЗаказаПоЭтапамПеремотка.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СтрокиДляУдаления = ДвижОбъект.Перемотка.НайтиСтроки(Новый Структура("ДокументОснование",Ссылка));
		Для каждого Стр из СтрокиДляУдаления Цикл
			ДвижОбъект.Перемотка.Удалить(Стр);
		КонецЦикла;
		ДвижОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция СоздатьТиповыеДокументы(ПараметрыДляСозданияОднойЦепочки = Неопределено) Экспорт

	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Заказ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Номенклатура");
	ТаблицаНовыхДокументов.Колонки.Добавить("РаспоряжениеНаРастарку");
	ТаблицаНовыхДокументов.Колонки.Добавить("НомерЦепочкиВРаспоряженииНаРастарку");

	ОтключитьЧастьПроверок = Неопределено;
	ДополнительныеСвойства.Свойство("ОтключитьЧастьПроверок", ОтключитьЧастьПроверок);
	ОтключитьЧастьПроверок = ?(ОтключитьЧастьПроверок = Неопределено, Ложь, ОтключитьЧастьПроверок);

	ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияРеквизитаДокументВРегистреЭтапыЗаказа.ЗначениеПараметра <= ?(ЗначениеЗаполнено(ДатаФормирования), ДатаФормирования, Дата);
	ОбычныйРежимСозданияТиповыхДокументов = НЕ ЗначениеЗаполнено(ДатаУпрощенногоПроведения);

	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.Переупаковка Тогда

		//на переупаковке по типовым механизмам будем делать только перемещение коробок
		НачатьТранзакцию();
		//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
		КлючиСтруктурыБезЭтапа = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "ЭтапПроизводства2_2");
		СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктурыБезЭтапа, Ссылка);
		Если СтруктураТиповыхДокументов = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;

		//найдем в каких ячейках лежат выбранные коробки, причем делать это будем по типовым регистрам
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ФормированиеПаллетаСодержимое.Серия
		|ПОМЕСТИТЬ ВТ_ТоварыДокумента
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|ГДЕ
		|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ФормированиеПаллетаСодержимое.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыДокумента.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Номенклатура,
		|	ВТ_ТоварыДокумента.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
		|	ВТ_ТоварыДокумента.Серия КАК Серия,
		|	ТоварыВЯчейкахОстатки.Ячейка,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
		|	ВТ_ТоварыДокумента.Серия.Лико_КоличествоВУпаковке КАК КоличествоВДокументе
		|ИЗ
		|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				&Дата,
		|				Серия В
		|						(ВЫБРАТЬ
		|							Т.Серия
		|						ИЗ
		|							ВТ_ТоварыДокумента КАК Т)
		|					И Ячейка.Владелец = &Склад) КАК ТоварыВЯчейкахОстатки
		|		ПО ВТ_ТоварыДокумента.Серия = ТоварыВЯчейкахОстатки.Серия
		|ИТОГИ
		|	СУММА(ВНаличииОстаток),
		|	МАКСИМУМ(КоличествоВДокументе)
		|ПО
		|	Серия";

		Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Склад", ЯчейкаПолучатель.Владелец);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаСерия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		//Если НЕ ОтключитьЧастьПроверок Тогда
		Отказ = Ложь;
		Пока ВыборкаСерия.Следующий() Цикл

			Если ВыборкаСерия.КоличествоВДокументе > ВыборкаСерия.ВНаличииОстаток Тогда
				//коробок не хватает
				Отказ = Истина;
				Сообщить("В документе """ + Ссылка + """ не хватает коробки """ + ВыборкаСерия.Серия + """ на выбранном складе.");
				Продолжить;
			КонецЕсли;

		КонецЦикла;
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;

		ВыборкаСерия.Сбросить();
		//КонецЕсли;

		//Создаем новый документ
		НовыйДокументОтборРазмещениеТоваров_Перемещение = СоздатьДокументОтборРазмещениеТоваров(ВыборкаСерия, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Перемещение);
		Если НовыйДокументОтборРазмещениеТоваров_Перемещение = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Перемещение;

	ИначеЕсли ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
		//Лико_Дополнительно.УдалитьЗаписиИзДокументаЛико_ДвиженияЗаказаПоЭтапам(XMLСтрока(Ссылка));
		Если НЕ ВыпускИзРастарки ИЛИ Дата < Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастарки.ЗначениеПараметра Тогда
			// Обычный выпуск
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Т.Серия КАК Серия
			|ПОМЕСТИТЬ ВТ_ТаблицаСгруппирована
			|ИЗ
			|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Т
			|ГДЕ
			|	Т.Ссылка = &Ссылка
			|	И ВЫБОР
			|			КОГДА &ОтборЗаказ = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Т.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры = &ОтборЗаказ
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Т.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК ЗаказКлиента,
			|	ПОДСТРОКА(ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Номер, 5, 7) КАК НомерЗаказа,
			|	ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Номенклатура,
			|	ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
			|	ВТ_ТаблицаСгруппирована.Серия КАК Серия,
			|	ВТ_ТаблицаСгруппирована.Серия.Лико_КоличествоВУпаковке КАК КоличествоВУпаковке
			|ПОМЕСТИТЬ ВТ_ДанныеСЗаказом
			|ИЗ
			|	ВТ_ТаблицаСгруппирована КАК ВТ_ТаблицаСгруппирована
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДанныеСЗаказом.ЗаказКлиента КАК ЗаказКлиента,
			|	ВТ_ДанныеСЗаказом.Номенклатура КАК Номенклатура,
			|	ВТ_ДанныеСЗаказом.Характеристика КАК Характеристика,
			|	СУММА(ВТ_ДанныеСЗаказом.КоличествоВУпаковке) КАК КоличествоВУпаковке
			|ПОМЕСТИТЬ ВТ_ТаблицаДляПроверки
			|ИЗ
			|	ВТ_ДанныеСЗаказом КАК ВТ_ДанныеСЗаказом
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ДанныеСЗаказом.ЗаказКлиента,
			|	ВТ_ДанныеСЗаказом.Номенклатура,
			|	ВТ_ДанныеСЗаказом.Характеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДанныеСЗаказом.ЗаказКлиента КАК ЗаказКлиента,
			|	ВТ_ДанныеСЗаказом.НомерЗаказа КАК НомерЗаказа,
			|	ВТ_ДанныеСЗаказом.Номенклатура КАК Номенклатура,
			|	ВТ_ДанныеСЗаказом.Характеристика КАК Характеристика,
			|	ВТ_ДанныеСЗаказом.Серия КАК Серия,
			|	ВТ_ДанныеСЗаказом.КоличествоВУпаковке КАК КоличествоВУпаковке
			|ИЗ
			|	ВТ_ДанныеСЗаказом КАК ВТ_ДанныеСЗаказом
			|ИТОГИ
			|	СУММА(КоличествоВУпаковке)
			|ПО
			|	ЗаказКлиента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДанныеСЗаказом.ЗаказКлиента КАК ЗаказКлиента,
			|	ВТ_ДанныеСЗаказом.НомерЗаказа КАК НомерЗаказа,
			|	ВТ_ДанныеСЗаказом.Номенклатура КАК Номенклатура,
			|	ВТ_ДанныеСЗаказом.Характеристика КАК Характеристика,
			|	СУММА(ВТ_ДанныеСЗаказом.КоличествоВУпаковке) КАК КоличествоВУпаковке
			|ИЗ
			|	ВТ_ДанныеСЗаказом КАК ВТ_ДанныеСЗаказом
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ДанныеСЗаказом.ЗаказКлиента,
			|	ВТ_ДанныеСЗаказом.НомерЗаказа,
			|	ВТ_ДанныеСЗаказом.Номенклатура,
			|	ВТ_ДанныеСЗаказом.Характеристика
			|ИТОГИ
			|	СУММА(КоличествоВУпаковке)
			|ПО
			|	ЗаказКлиента";

			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Если ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
				Запрос.УстановитьПараметр("ОтборЗаказ", Неопределено);
			Иначе
				Запрос.УстановитьПараметр("ОтборЗаказ", ПараметрыДляСозданияОднойЦепочки.Заказ);
			КонецЕсли;

			МассивРезультатов = Запрос.ВыполнитьПакет();

			ВыборкаЗаказ = МассивРезультатов[МассивРезультатов.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
				НачатьТранзакцию();
				//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
				КлючиСтруктурыБезЭтапа = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "ЭтапПроизводства2_2");
				СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктурыБезЭтапа, Ссылка);
				Если СтруктураТиповыхДокументов = Неопределено Тогда
					Возврат Ложь;
				КонецЕсли;

				// Удалим из этапа строки выпуска, соответствующие этому формированию паллета
				Результат = Лико_Дополнительно.УдалитьИзЭтаповСтрокиВыпускаПоСвязанномуФормированиюПаллета(Ссылка, Новый Структура("Лико_НеРассчитыватьНормативныйГрафик", Истина));
				Если НЕ Результат Тогда
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ОбычныйРежимСозданияТиповыхДокументов И ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
				Упаковка = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
				ВыборкаЗаказПоСериям = МассивРезультатов[МассивРезультатов.Количество()-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЗаказПоСериям.Следующий() Цикл
					
					ОтборТиповыхДокументов = Новый Структура("Заказ", ВыборкаЗаказПоСериям.ЗаказКлиента); 
					СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(,ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
					Если СтруктураТиповыхДокументов = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;

					МассивВыпуск = Новый Массив;
					ВыборкаСерии = ВыборкаЗаказПоСериям.Выбрать();
					Пока ВыборкаСерии.Следующий() Цикл
						СтрокаСтруктура = Новый Структура("Номенклатура,Характеристика,Упаковка,Серия,Количество");
						ЗаполнитьЗначенияСвойств(СтрокаСтруктура, ВыборкаСерии); 
						СтрокаСтруктура.Количество = ВыборкаСерии.КоличествоВУпаковке;
						СтрокаСтруктура.Упаковка = Упаковка;
						МассивВыпуск.Добавить(СтрокаСтруктура);
					КонецЦикла;
					// Создадим корректировку регистров
					НовыйДокументКорректировкаРегистров = СоздатьДокументКорректировкаРегистровУпрощенныйРежим(СтруктураТиповыхДокументов.КорректировкаРегистров, МассивВыпуск);
					Если НовыйДокументКорректировкаРегистров = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
					НоваяСтрока.Документ = НовыйДокументКорректировкаРегистров;
					НоваяСтрока.Заказ = ВыборкаЗаказПоСериям.ЗаказКлиента;
				КонецЦикла;
			КонецЕсли;

			Пока ВыборкаЗаказ.Следующий() Цикл

				Если ВыборкаЗаказ.КоличествоВУпаковке <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ОбычныйРежимСозданияТиповыхДокументов ИЛИ ПараметрыДляСозданияОднойЦепочки <> Неопределено Тогда
					
					ОтборТиповыхДокументов = Новый Структура("Заказ", ВыборкаЗаказ.ЗаказКлиента); 
					СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(,ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
					Если СтруктураТиповыхДокументов = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					
					//Создаем этап для заказа на выпуск продукции
					НовыйЭтапСсылка = СоздатьЭтап(ВыборкаЗаказ, СтруктураТиповыхДокументов.ЭтапПроизводства2_2);
				
					Если НовыйЭтапСсылка = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					
					//Создаем передачу продукции на склад
					НовыйДокументПередачаНаСкладСсылка = СоздатьПередачуПродукции(НовыйЭтапСсылка, ВыборкаЗаказ.ЗаказКлиента, СтруктураТиповыхДокументов.ДвижениеПродукцииИМатериалов);
					Если НовыйДокументПередачаНаСкладСсылка = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;

					//Создаем приходный ордер - тут уже будут серии
					НовыйДокументПриходныйОрдерСсылка = Неопределено;
					Если ЯчейкаПолучатель.ТипСкладскойЯчейки = Перечисления.ТипыСкладскихЯчеек.Приемка Тогда
						Приемка = ЯчейкаПолучатель;
					Иначе
						Приемка = Лико_Дополнительно.ПолучитьЗонуПриемкиПоСкладу(ЯчейкаПолучатель.Владелец);
					КонецЕсли;
					//здесь нам нужна номенклатура с сериями, поэтому будем получать другой пакет запроса (с сериями)
					ВыборкаЗаказПоСериям = МассивРезультатов[МассивРезультатов.Количество()-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаЗаказПоСериям.Следующий() Цикл
						Если ВыборкаЗаказПоСериям.ЗаказКлиента <> ВыборкаЗаказ.ЗаказКлиента Тогда
							Продолжить;
						КонецЕсли;
						//Это нужный заказ
						ВыборкаСерии = ВыборкаЗаказПоСериям.Выбрать();
						НовыйДокументПриходныйОрдерСсылка = СоздатьПриходныйОрдер(НовыйЭтапСсылка, ВыборкаСерии, Приемка, СтруктураТиповыхДокументов.ПриходныйОрдерНаТовары);
						//нужный заказ мы обработали, дальше идти нет смысла
						Прервать;
					КонецЦикла;
					Если НовыйДокументПриходныйОрдерСсылка = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;

					Если ЯчейкаПолучатель <> Приемка Тогда
						НовыйДокументРазмещениеТоваровСсылка = Лико_Дополнительно.СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(НовыйДокументПриходныйОрдерСсылка, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Размещение, ЯчейкаПолучатель);
						Если НовыйДокументРазмещениеТоваровСсылка = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
					КонецЕсли;

					МассивТиповыхДокументов = Новый Массив;
					МассивТиповыхДокументов.Добавить(НовыйЭтапСсылка);
					МассивТиповыхДокументов.Добавить(НовыйДокументПередачаНаСкладСсылка);
					МассивТиповыхДокументов.Добавить(НовыйДокументПриходныйОрдерСсылка);
					МассивТиповыхДокументов.Добавить(НовыйДокументРазмещениеТоваровСсылка);
					Для каждого Строка из МассивТиповыхДокументов Цикл
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = Строка;
						НоваяСтрока.Заказ = ВыборкаЗаказ.ЗаказКлиента;
					КонецЦикла;
				КонецЕсли;
				
				Если ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
					// Добавим запись в Лико_ЭтапыЗаказа
					МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ?(ЗначениеЗаполнено(ДатаФормирования), ДатаФормирования, Дата);
					МенеджерЗаписи.Заказ = ВыборкаЗаказ.ЗаказКлиента;
					МенеджерЗаписи.Площадка = ВыборкаЗаказ.ЗаказКлиента.Площадка;
					МенеджерЗаписи.Количество = ВыборкаЗаказ.КоличествоВУпаковке;
					МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Упаковка;
					МенеджерЗаписи.Ответственный = АвторДокумента;
					Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
						МенеджерЗаписи.Документ = Ссылка;
					КонецЕсли;
					Попытка
						МенеджерЗаписи.Записать(Истина);
					Исключение
						Сообщить("Не удалось добавить запись в регистр ""лк Этапы заказа"": " + ОписаниеОшибки());
						Возврат Ложь;
					КонецПопытки;

					// Добавим запись в документ Лико_ДвиженияЗаказаПоЭтапам
					//Лико_Дополнительно.ДобавитьЗаписьВДокументЛико_ДвиженияЗаказаПоЭтапам(
					//	ВыборкаЗаказ.ЗаказКлиента,
					//	"Упаковка",
					//	ВыборкаЗаказ.КоличествоВУпаковке,
					//	XMLСтрока(Ссылка),
					//	?(ЗначениеЗаполнено(АвторДокумента), АвторДокумента, ПараметрыСеанса.ТекущийПользователь),
					//	Дата,
					//	ВыпускИзРастарки);

					ИзменитьСтатусЗаказаНаВыполнен(ВыборкаЗаказ.ЗаказКлиента);
				КонецЕсли;

			КонецЦикла;

		Иначе

				// Растарка по версии 3, без распоряжения на растарку. Распоряжение и номер цепочки уже содержатся в серии
				РастркаАнгара = ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас;
				Если ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Производство
					ИЛИ РастркаАнгара
					ИЛИ ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион
					ИЛИ ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи
					Тогда
					
					Если ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
						НачатьТранзакцию();
						СодержимоеРастарки.Очистить();
						//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
						КлючиСтруктурыБезЭтапа = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "ЭтапПроизводства2_2");
						СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктурыБезЭтапа, Ссылка);
						Если СтруктураТиповыхДокументов = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;

						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	Лико_ФормированиеПаллетаСодержимое.НомерСтроки КАК НомерСтроки,
						|	Лико_ФормированиеПаллетаСодержимое.Серия КАК Серия,
						|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
						|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку,
						|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке КАК Количество
						|ПОМЕСТИТЬ ВТ_СерииСРаспоряжениями
						|ИЗ
						|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
						|ГДЕ
						|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВТ_СерииСРаспоряжениями.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
						|	ВТ_СерииСРаспоряжениями.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку
						|ПОМЕСТИТЬ ВТ_Распоряжения
						|ИЗ
						|	ВТ_СерииСРаспоряжениями КАК ВТ_СерииСРаспоряжениями
						|
						|СГРУППИРОВАТЬ ПО
						|	ВТ_СерииСРаспоряжениями.Лико_РаспоряжениеНаРастарку,
						|	ВТ_СерииСРаспоряжениями.Лико_НомерЦепочкиВРаспоряженииНаРастарку
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВТ_Распоряжения.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
						|	ВТ_Распоряжения.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку,
						|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика КАК Характеристика,
						|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Намотка КАК Намотка,
						|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
						|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.ЧестныйЗнак КАК ЧестныйЗнак,
						|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерПоставки КАК НомерПоставки,
						|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Город КАК Город,
						|	Лико_ПеремещениеПаллетаСодержимое.Серия КАК Серия
						|ПОМЕСТИТЬ ВТ_СерииИзРаспоряжений
						|ИЗ
						|	ВТ_Распоряжения КАК ВТ_Распоряжения
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПеремещениеПаллета.ЗаказыНаРастарку КАК Лико_ПеремещениеПаллетаЗаказыНаРастарку
						|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
						|			ПО Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка = Лико_ПеремещениеПаллетаСодержимое.Ссылка
						|				И Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец
						|				И Лико_ПеремещениеПаллетаЗаказыНаРастарку.Намотка = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_НаправлениеНамотки
						|				И Лико_ПеремещениеПаллетаЗаказыНаРастарку.КодЭтикеткиЗаказчика = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_КодЭтикеткиЗаказчика
						|				И Лико_ПеремещениеПаллетаЗаказыНаРастарку.ЧестныйЗнак = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ЧестныйЗнак
						|				И Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерПоставки = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_НомерПоставки
						|				И Лико_ПеремещениеПаллетаЗаказыНаРастарку.Город = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_Город
						|		ПО ВТ_Распоряжения.Лико_РаспоряжениеНаРастарку = Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка
						|			И ВТ_Распоряжения.Лико_НомерЦепочкиВРаспоряженииНаРастарку = Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерЦепочки
						|			И (Лико_ПеремещениеПаллетаЗаказыНаРастарку.ЭтоИсходнаяСтрока)
						|			И (Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка.Проведен)
						|			И (Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка.ЯчейкаПолучатель = &ЯчейкаРастарка)
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВТ_СерииСРаспоряжениями.Серия КАК Серия,
						|	ВТ_СерииСРаспоряжениями.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
						|	ВТ_СерииСРаспоряжениями.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку,
						|	ВТ_СерииСРаспоряжениями.Количество КАК Количество,
						|	ВТ_СерииСРаспоряжениями.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
						|	ВТ_СерииСРаспоряжениями.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
						|	&Упаковка КАК Упаковка,
						|	ВЫРАЗИТЬ(ВТ_СерииСРаспоряжениями.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура
						|ИЗ
						|	ВТ_СерииСРаспоряжениями КАК ВТ_СерииСРаспоряжениями
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВТ_СерииИзРаспоряжений.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
						|	ВТ_СерииИзРаспоряжений.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку,
						|	ВТ_СерииИзРаспоряжений.Серия КАК Серия,
						|	МАКСИМУМ(ТоварыВЯчейкахОстатки.ВНаличииОстаток) КАК Количество,
						|	ВТ_СерииИзРаспоряжений.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
						|	ВТ_СерииИзРаспоряжений.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
						|	&Упаковка КАК Упаковка,
						|	ВЫРАЗИТЬ(ВТ_СерииИзРаспоряжений.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура
						|ИЗ
						|	ВТ_СерииИзРаспоряжений КАК ВТ_СерииИзРаспоряжений
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
						|				,
						|				Серия В
						|						(ВЫБРАТЬ
						|							Т.Серия
						|						ИЗ
						|							ВТ_СерииИзРаспоряжений КАК Т)
						|					И Ячейка = &ЯчейкаРастарка) КАК ТоварыВЯчейкахОстатки
						|		ПО ВТ_СерииИзРаспоряжений.Серия = ТоварыВЯчейкахОстатки.Серия
						|
						|СГРУППИРОВАТЬ ПО
						|	ВТ_СерииИзРаспоряжений.Лико_РаспоряжениеНаРастарку,
						|	ВТ_СерииИзРаспоряжений.Лико_НомерЦепочкиВРаспоряженииНаРастарку,
						|	ВТ_СерииИзРаспоряжений.Серия,
						|	ВЫРАЗИТЬ(ВТ_СерииИзРаспоряжений.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура),
						|	ВТ_СерииИзРаспоряжений.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры,
						|	ВТ_СерииИзРаспоряжений.Серия.Лико_ХарактеристикаВладелец";
						Запрос.УстановитьПараметр("Ссылка", Ссылка);
						Запрос.УстановитьПараметр("ЯчейкаРастарка", ЯчейкаРастарка);
						Запрос.УстановитьПараметр("Упаковка", Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра);
						РезультатыЗапроса = Запрос.ВыполнитьПакет();
						ТаблицаСерийСРаспоряжениями = РезультатыЗапроса[РезультатыЗапроса.Количество()-2].Выгрузить();
						ТаблицаСерийИзРаспоряженийВОстатках = РезультатыЗапроса[РезультатыЗапроса.Количество()-1].Выгрузить();

						// Сгруппируем коробки по распоряжениям на растарку
						ТаблицаРаспоряжений = ТаблицаСерийСРаспоряжениями.Скопировать();
						ТаблицаРаспоряжений.Свернуть("Лико_РаспоряжениеНаРастарку,Лико_НомерЦепочкиВРаспоряженииНаРастарку");
						МассивПоРаспоряжениям = Лико_Дополнительно.ТаблицаВМассивСтруктур(ТаблицаРаспоряжений);
						МассивФормированийИзКоторыхОтнялиКоробки = Новый Массив;
						Для каждого Структура из МассивПоРаспоряжениям Цикл
							КопияСтруктурыДляОтборов = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Структура);
							ТаблицаСерийВыпускаПоРаспоряжению = ТаблицаСерийСРаспоряжениями.Скопировать(КопияСтруктурыДляОтборов);
							Структура.Вставить("ТаблицаСерийВыпускаПоРаспоряжению", ТаблицаСерийВыпускаПоРаспоряжению);
							ТаблицаСерийВыпускаПоРаспоряжениюКопия = ТаблицаСерийВыпускаПоРаспоряжению.Скопировать();
							ТаблицаСерийВыпускаПоРаспоряжениюКопия.Свернуть("Лико_РаспоряжениеНаРастарку,Лико_НомерЦепочкиВРаспоряженииНаРастарку", "Количество");
							КоличествоВыпуск = ТаблицаСерийВыпускаПоРаспоряжениюКопия[0].Количество;
							// Найдем в остатках серии по текущему распоряжению
							ТаблицаСерийРастаркиПоРаспоряжению = ТаблицаСерийИзРаспоряженийВОстатках.Скопировать(КопияСтруктурыДляОтборов);

							Если ТаблицаСерийРастаркиПоРаспоряжению.Количество() > 0 И ЗначениеЗаполнено(ТаблицаСерийВыпускаПоРаспоряжению[0].Серия.Лико_ДополнительныеНомераЦепочек) Тогда
								// Костыль для случаев, когда нужно смотать несколько заказов в один
								ТекРаспоряжение = ТаблицаСерийВыпускаПоРаспоряжению[0].Лико_РаспоряжениеНаРастарку;
								МассивДополнительныхНомеровЦепочек = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТаблицаСерийВыпускаПоРаспоряжению[0].Серия.Лико_ДополнительныеНомераЦепочек, ",", Истина, Истина);
								Для каждого ДопНомерЦепочкиСтрока из МассивДополнительныхНомеровЦепочек Цикл
									ДопНомерЦепочки = Число(ДопНомерЦепочкиСтрока);
									Запрос = Новый Запрос;
									Запрос.Текст = 
									"ВЫБРАТЬ
									|	ВЫРАЗИТЬ(Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
									|	&Упаковка КАК Упаковка,
									|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
									|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
									|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке КАК Количество,
									|	Лико_ПеремещениеПаллетаСодержимое.Серия КАК Серия,
									|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерЦепочки КАК Лико_НомерЦепочки,
									|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка КАК Лико_РаспоряжениеНаРастарку
									|ИЗ
									|	Документ.Лико_ПеремещениеПаллета.ЗаказыНаРастарку КАК Лико_ПеремещениеПаллетаЗаказыНаРастарку
									|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
									|		ПО Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка = Лико_ПеремещениеПаллетаСодержимое.Ссылка
									|			И Лико_ПеремещениеПаллетаЗаказыНаРастарку.Характеристика = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец
									|			И Лико_ПеремещениеПаллетаЗаказыНаРастарку.Намотка = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_НаправлениеНамотки
									|			И Лико_ПеремещениеПаллетаЗаказыНаРастарку.КодЭтикеткиЗаказчика = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_КодЭтикеткиЗаказчика
									|			И Лико_ПеремещениеПаллетаЗаказыНаРастарку.ЧестныйЗнак = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ЧестныйЗнак
									|			И Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерПоставки = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_НомерПоставки
									|			И Лико_ПеремещениеПаллетаЗаказыНаРастарку.Город = Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_Город
									|ГДЕ
									|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка = &Ссылка
									|	И Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерЦепочки = &НомерЦепочки
									|	И Лико_ПеремещениеПаллетаЗаказыНаРастарку.ЭтоИсходнаяСтрока
									|
									|СГРУППИРОВАТЬ ПО
									|	ВЫРАЗИТЬ(Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура),
									|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры,
									|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец,
									|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке,
									|	Лико_ПеремещениеПаллетаСодержимое.Серия,
									|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.НомерЦепочки,
									|	Лико_ПеремещениеПаллетаЗаказыНаРастарку.Ссылка";
									Запрос.УстановитьПараметр("НомерЦепочки", ДопНомерЦепочки);
									Запрос.УстановитьПараметр("Ссылка", ТекРаспоряжение);
									Запрос.УстановитьПараметр("Упаковка", Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра);
									ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										ЗаполнитьЗначенияСвойств(ТаблицаСерийРастаркиПоРаспоряжению.Добавить(), ВыборкаДетальныеЗаписи);
									КонецЦикла;
								КонецЦикла;
							КонецЕсли;

							Если ТаблицаСерийРастаркиПоРаспоряжению.Количество() = 0 И НЕ РастркаАнгара Тогда
								// Попробуем отнять нужное количество из других документов
								Запрос = Новый Запрос;
								Запрос.Текст = 
								"ВЫБРАТЬ
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка КАК Ссылка,
								|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ФормированиеПаллетаСодержимоеРастарки.Серия) КАК КоличествоКоробок,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку
								|ПОМЕСТИТЬ ВТ_Формирования
								|ИЗ
								|	Документ.Лико_ФормированиеПаллета.СодержимоеРастарки КАК Лико_ФормированиеПаллетаСодержимоеРастарки
								|ГДЕ
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_РаспоряжениеНаРастарку = &Лико_РаспоряжениеНаРастарку
								|	И Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_НомерЦепочкиВРаспоряженииНаРастарку = &Лико_НомерЦепочкиВРаспоряженииНаРастарку
								|	И Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка.Проведен
								|
								|СГРУППИРОВАТЬ ПО
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_РаспоряжениеНаРастарку,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_НомерЦепочкиВРаспоряженииНаРастарку
								|;
								|
								|////////////////////////////////////////////////////////////////////////////////
								|ВЫБРАТЬ
								|	ВТ_Формирования.Ссылка КАК Ссылка,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Серия КАК Серия,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Серия.Лико_КоличествоВУпаковке КАК Количество,
								|	ВТ_Формирования.КоличествоКоробок КАК КоличествоКоробок,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
								|	Лико_ФормированиеПаллетаСодержимоеРастарки.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
								|	&Упаковка КАК Упаковка,
								|	ВЫРАЗИТЬ(Лико_ФормированиеПаллетаСодержимоеРастарки.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
								|	ВТ_Формирования.Лико_РаспоряжениеНаРастарку КАК Лико_РаспоряжениеНаРастарку,
								|	ВТ_Формирования.Лико_НомерЦепочкиВРаспоряженииНаРастарку КАК Лико_НомерЦепочкиВРаспоряженииНаРастарку
								|ИЗ
								|	ВТ_Формирования КАК ВТ_Формирования
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.СодержимоеРастарки КАК Лико_ФормированиеПаллетаСодержимоеРастарки
								|		ПО ВТ_Формирования.Ссылка = Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка
								|			И ВТ_Формирования.Лико_РаспоряжениеНаРастарку = Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_РаспоряжениеНаРастарку
								|			И ВТ_Формирования.Лико_НомерЦепочкиВРаспоряженииНаРастарку = Лико_ФормированиеПаллетаСодержимоеРастарки.Лико_НомерЦепочкиВРаспоряженииНаРастарку
								|ГДЕ
								|	ВТ_Формирования.КоличествоКоробок > 1
								|
								|УПОРЯДОЧИТЬ ПО
								|	ВТ_Формирования.Ссылка.Дата,
								|	Количество
								|ИТОГИ
								|	СУММА(Количество),
								|	СУММА(КоличествоКоробок)
								|ПО
								|	Ссылка";

								Запрос.УстановитьПараметр("Лико_НомерЦепочкиВРаспоряженииНаРастарку", Структура.Лико_НомерЦепочкиВРаспоряженииНаРастарку);
								Запрос.УстановитьПараметр("Лико_РаспоряжениеНаРастарку", Структура.Лико_РаспоряжениеНаРастарку);
								Запрос.УстановитьПараметр("Упаковка", Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра);
								РезультатЗапроса = Запрос.Выполнить();
								ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								КоличествоОстаток = КоличествоВыпуск;
								Пока ВыборкаСсылка.Следующий() Цикл
									ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
									КоличествоКоробок = ВыборкаДетальныеЗаписи.Количество();
									Сч = 0;
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										сч = сч + 1;
										Если КоличествоОстаток > 0 И сч <= КоличествоКоробок - 1 Тогда
											// Возьмем коробку из этого документа
											ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
											ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьЧастьПроверок", Истина);
											// --> Начало Лико Ефимов ЕВВ 25.10.2020
											// Удалять строку из содержимого растарки оказалось ненужным, т.к. при отмене проведения ТЧ СодержимоеРастарки очищается и при втором удалении валится с ошибкой
											//СтрокаСВыбраннойСерией = ДокументОбъект.СодержимоеРастарки.Найти(ВыборкаДетальныеЗаписи.Серия, "Серия");
											//ДокументОбъект.СодержимоеРастарки.Удалить(СтрокаСВыбраннойСерией);
											// <-- Конец Лико Ефимов ЕВВ 25.10.2020
											Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
												// Отменим проведение
												ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
												МассивФормированийИзКоторыхОтнялиКоробки.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
											Иначе
												//ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
											КонецЕсли;
											ЗаполнитьЗначенияСвойств(ТаблицаСерийРастаркиПоРаспоряжению.Добавить(), ВыборкаДетальныеЗаписи);
											КоличествоОстаток = КоличествоОстаток - ВыборкаДетальныеЗаписи.Количество;
										Иначе
											Прервать;
										КонецЕсли;
									КонецЦикла;
									Если КоличествоОстаток <> КоличествоВыпуск Тогда
										// Хотя бы одну коробку мы уже отняли, на этом остановимся
										Прервать;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;

							Если ТаблицаСерийРастаркиПоРаспоряжению.Количество() = 0 Тогда
								ОтменитьТранзакцию();
								Сообщить("По распоряжению " + Структура.Лико_РаспоряжениеНаРастарку + " (номер цепочки " + Структура.Лико_НомерЦепочкиВРаспоряженииНаРастарку + ") все коробки уже растарены и нет возможности отнять коробку из другого выпуска. Проведение документа невозможно");
								Возврат Ложь;
							КонецЕсли;

							Структура.Вставить("ТаблицаСерийРастаркиПоРаспоряжению", ТаблицаСерийРастаркиПоРаспоряжению);

							Для каждого Строка из ТаблицаСерийРастаркиПоРаспоряжению Цикл
								ЗаполнитьЗначенияСвойств(СодержимоеРастарки.Добавить(), Строка);
							КонецЦикла;

						КонецЦикла;
					Иначе
						МассивПоРаспоряжениям = Новый Массив;
						МассивПоРаспоряжениям.Добавить(ПараметрыДляСозданияОднойЦепочки);
					КонецЕсли;

					Если ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Производство 
						ИЛИ ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион
						ИЛИ ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи
						Тогда
						// Растарка склада производства

						// Раз дошло до сюда, значит таблицы заполнены и можно создавать документы
						//Если НЕ ОбычныйРежимСозданияТиповыхДокументов Тогда
						//	// Создадим корректировку регистров
						//	НовыйДокументКорректировкаРегистров = СоздатьДокументКорректировкаРегистровУпрощенныйРежим(СтруктураТиповыхДокументов.КорректировкаРегистров);
						//	Если НовыйДокументКорректировкаРегистров = Неопределено Тогда
						//		Возврат Ложь;
						//	КонецЕсли;
						//	НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						//	НоваяСтрока.Документ = НовыйДокументКорректировкаРегистров;
						//КонецЕсли;
						
						СкладГП = ЯчейкаПолучатель.Владелец;
						Для каждого Структура из МассивПоРаспоряжениям Цикл
							
							ТаблицаВыпускаБезКоробок = Структура.ТаблицаСерийВыпускаПоРаспоряжению.Скопировать();
							ТаблицаВыпускаБезКоробок.Свернуть("Заказ,Номенклатура,Характеристика,Лико_РаспоряжениеНаРастарку,Лико_НомерЦепочкиВРаспоряженииНаРастарку", "Количество");
							
							ТаблицаРастаркиБезКоробок = Структура.ТаблицаСерийРастаркиПоРаспоряжению.Скопировать();
							ТаблицаРастаркиБезКоробок.Свернуть("Заказ,Номенклатура,Характеристика,Лико_РаспоряжениеНаРастарку,Лико_НомерЦепочкиВРаспоряженииНаРастарку", "Количество");
							Если ТаблицаВыпускаБезКоробок.Количество() = 1 Тогда
								СтрокаСОднойПОзицией = ТаблицаВыпускаБезКоробок[0];
								ТаблицаТоваровДляСборки = ТаблицаРастаркиБезКоробок;
								НужнаРазборкаНераспределенныхВыпусков = Ложь;
							Иначе
								СтрокаСОднойПОзицией = ТаблицаРастаркиБезКоробок[0];
								ТаблицаТоваровДляСборки = ТаблицаВыпускаБезКоробок;
								НужнаРазборкаНераспределенныхВыпусков = Истина;
							КонецЕсли;

							ОтборТиповыхДокументов = Новый Структура("Заказ,Номенклатура,РаспоряжениеНаРастарку,НомерЦепочкиВРаспоряженииНаРастарку",СтрокаСОднойПОзицией.Заказ, СтрокаСОднойПОзицией.Номенклатура, СтрокаСОднойПОзицией.Лико_РаспоряжениеНаРастарку, СтрокаСОднойПОзицией.Лико_НомерЦепочкиВРаспоряженииНаРастарку); 
							СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(, ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
							Если СтруктураТиповыхДокументов = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;

							Если НЕ ОбычныйРежимСозданияТиповыхДокументов И ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
								// Создадим корректировку регистров
								НовыйДокументКорректировкаРегистров = СоздатьДокументКорректировкаРегистровУпрощенныйРежим(СтруктураТиповыхДокументов.КорректировкаРегистров, Структура.ТаблицаСерийВыпускаПоРаспоряжению, Структура.ТаблицаСерийРастаркиПоРаспоряжению);
								Если НовыйДокументКорректировкаРегистров = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументКорректировкаРегистров;
								НоваяСтрока.Заказ = СтрокаСОднойПОзицией.Заказ;
								НоваяСтрока.Номенклатура = СтрокаСОднойПОзицией.Номенклатура;
								НоваяСтрока.РаспоряжениеНаРастарку = СтрокаСОднойПОзицией.Лико_РаспоряжениеНаРастарку;
								НоваяСтрока.НомерЦепочкиВРаспоряженииНаРастарку = СтрокаСОднойПОзицией.Лико_НомерЦепочкиВРаспоряженииНаРастарку;
							КонецЕсли;
							
							Если ОбычныйРежимСозданияТиповыхДокументов ИЛИ ПараметрыДляСозданияОднойЦепочки <> Неопределено Тогда
								
								// Создаем сборку товаров
								НовыйДокументСборкаТоваров = СоздатьСборкуТоваровВер3(СтруктураТиповыхДокументов.СборкаТоваров, СтрокаСОднойПОзицией, ТаблицаТоваровДляСборки, НужнаРазборкаНераспределенныхВыпусков);
								Если НовыйДокументСборкаТоваров = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументСборкаТоваров;
								НоваяСтрока.Заказ = СтрокаСОднойПОзицией.Заказ;
								НоваяСтрока.Номенклатура = СтрокаСОднойПОзицией.Номенклатура;
								НоваяСтрока.РаспоряжениеНаРастарку = СтрокаСОднойПОзицией.Лико_РаспоряжениеНаРастарку;
								НоваяСтрока.НомерЦепочкиВРаспоряженииНаРастарку = СтрокаСОднойПОзицией.Лико_НомерЦепочкиВРаспоряженииНаРастарку;

								// Создаем расходный ордер на товары
								НовыйДокументРасходныйОрдерНаТовары = Лико_Дополнительно.СоздатьДокументРасходныйОрдерНаТоварыНаОснованииРаспоряжения(СтруктураТиповыхДокументов.РасходныйОрдерНаТовары, Структура.ТаблицаСерийРастаркиПоРаспоряжению, НовыйДокументСборкаТоваров);
								Если НовыйДокументСборкаТоваров = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументРасходныйОрдерНаТовары;
								НоваяСтрока.Заказ = СтрокаСОднойПОзицией.Заказ;
								НоваяСтрока.Номенклатура = СтрокаСОднойПОзицией.Номенклатура;
								НоваяСтрока.РаспоряжениеНаРастарку = СтрокаСОднойПОзицией.Лико_РаспоряжениеНаРастарку;
								НоваяСтрока.НомерЦепочкиВРаспоряженииНаРастарку = СтрокаСОднойПОзицией.Лико_НомерЦепочкиВРаспоряженииНаРастарку;

								Если СкладГП.ИспользоватьАдресноеХранение Тогда
									// Создадим отбор товаров
									НовыйДокументОтборРазмещениеТоваров_Отбор = Лико_Дополнительно.СоздатьДокументОтборРазмещениеТоваровНаОснованииРасходногоОрдера(НовыйДокументРасходныйОрдерНаТовары, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Отбор, Ложь, Ложь); 
									Если НовыйДокументОтборРазмещениеТоваров_Отбор = Неопределено Тогда
										Возврат Ложь;
									КонецЕсли;
									НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
									НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Отбор;
									НоваяСтрока.Заказ = СтрокаСОднойПОзицией.Заказ;
									НоваяСтрока.Номенклатура = СтрокаСОднойПОзицией.Номенклатура;
									НоваяСтрока.РаспоряжениеНаРастарку = СтрокаСОднойПОзицией.Лико_РаспоряжениеНаРастарку;
									НоваяСтрока.НомерЦепочкиВРаспоряженииНаРастарку = СтрокаСОднойПОзицией.Лико_НомерЦепочкиВРаспоряженииНаРастарку;
								КонецЕсли;

								Если СкладГП.ИспользоватьОрдернуюСхемуПриОтгрузке И СкладГП.ИспользоватьАдресноеХранение Тогда
									//Проводим документ "Расходный ордер" в статусе "Отгружен"
									Результат = Лико_Дополнительно.ПровестиДокументВДругомСтатусе(НовыйДокументРасходныйОрдерНаТовары, Перечисления.СтатусыРасходныхОрдеров.Отгружен);
									Если НЕ Результат Тогда
										Возврат Ложь;
									КонецЕсли;
								КонецЕсли;

								// Создаем документ "Приходный ордер"
								НовыйДокументПриходныйОрдерНаТовары = Лико_Дополнительно.СоздатьДокументПриходныйОрдерНаТоварыНаОснованииРаспоряжения(НовыйДокументСборкаТоваров, СтруктураТиповыхДокументов.ПриходныйОрдерНаТовары, Структура.ТаблицаСерийВыпускаПоРаспоряжению); 
								Если НовыйДокументПриходныйОрдерНаТовары = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументПриходныйОрдерНаТовары;
								НоваяСтрока.Заказ = СтрокаСОднойПОзицией.Заказ;
								НоваяСтрока.Номенклатура = СтрокаСОднойПОзицией.Номенклатура;
								НоваяСтрока.РаспоряжениеНаРастарку = СтрокаСОднойПОзицией.Лико_РаспоряжениеНаРастарку;
								НоваяСтрока.НомерЦепочкиВРаспоряженииНаРастарку = СтрокаСОднойПОзицией.Лико_НомерЦепочкиВРаспоряженииНаРастарку;

								Если СкладГП.ИспользоватьАдресноеХранение Тогда
									// Создаем документ "Отбор размещение товаров" в ячейку склада хранения
									НовыйДокументОтборРазмещениеТоваров_Размещение = Лико_Дополнительно.СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(НовыйДокументПриходныйОрдерНаТовары, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Размещение, ЯчейкаПолучатель); 
									Если НовыйДокументОтборРазмещениеТоваров_Размещение = Неопределено Тогда
										Возврат Ложь;
									КонецЕсли;
									НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
									НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Размещение;
									НоваяСтрока.Заказ = СтрокаСОднойПОзицией.Заказ;
									НоваяСтрока.Номенклатура = СтрокаСОднойПОзицией.Номенклатура;
									НоваяСтрока.РаспоряжениеНаРастарку = СтрокаСОднойПОзицией.Лико_РаспоряжениеНаРастарку;
									НоваяСтрока.НомерЦепочкиВРаспоряженииНаРастарку = СтрокаСОднойПОзицией.Лико_НомерЦепочкиВРаспоряженииНаРастарку;
								КонецЕсли;
								
							КонецЕсли;
                            Если ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
								Для каждого Строка из ТаблицаВыпускаБезКоробок Цикл
									// Добавим запись в Лико_ЭтапыЗаказа
									МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
									МенеджерЗаписи.Период = ?(ЗначениеЗаполнено(ДатаФормирования), ДатаФормирования, Дата);
									МенеджерЗаписи.Заказ = Строка.Заказ;
									МенеджерЗаписи.Площадка = Строка.Заказ.Площадка;
									МенеджерЗаписи.Количество = Строка.Количество;
									МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Упаковка;
									МенеджерЗаписи.Ответственный = АвторДокумента;
									МенеджерЗаписи.Комментарий = "Выпуск из растарки";
									Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
										МенеджерЗаписи.Документ = Ссылка;
									КонецЕсли;
									Попытка
										МенеджерЗаписи.Записать(Истина);
									Исключение
										Сообщить("Не удалось добавить запись в регистр ""лк Этапы заказа"": " + ОписаниеОшибки());
										Возврат Ложь;
									КонецПопытки;
									// Добавим запись в документ Лико_ДвиженияЗаказаПоЭтапам
									//Лико_Дополнительно.ДобавитьЗаписьВДокументЛико_ДвиженияЗаказаПоЭтапам(
									//	Строка.Заказ,
									//	"Упаковка",
									//	Строка.Количество,
									//	XMLСтрока(Ссылка),
									//	?(ЗначениеЗаполнено(АвторДокумента), АвторДокумента, ПараметрыСеанса.ТекущийПользователь),
									//	Дата,
									//	ВыпускИзРастарки);
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
						
						Если ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
							// В самом конце нужно обратно провести документы, из которых мы отнимали коробки
							Для каждого Документ из МассивФормированийИзКоторыхОтнялиКоробки Цикл
								ДокументОбъект = Документ.ПолучитьОбъект();
								ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьЧастьПроверок", Истина);
								ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
							КонецЦикла;
							// Запишем, чтобы сохранилась ТЧ СодержимоеРастарки
							ЭтотОбъект.ОбменДанными.Загрузка = Истина;
							ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
							ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
						КонецЕсли;
						
					ИначеЕсли ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас Тогда
						// Растарка Ангара
						
						Если ЗначениеЗаполнено(ДатаУпрощенногоПроведения) Тогда
							// Для растарки ангара это не нужно
							ДатаУпрощенногоПроведения = Неопределено;
						КонецЕсли;

						// Проверим, чтобы количество по характеристикам совпадало
						ТаблицаВыпуска = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(Содержимое.ВыгрузитьКолонку("Серия"), ЯчейкаПолучатель.Владелец);
						ТаблицаРастарки = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(СодержимоеРастарки.ВыгрузитьКолонку("Серия"), ЯчейкаРастарка.Владелец);
						//ТаблицаРастаркиИзРаспоряжения = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(РаспоряжениеНаРастарку.Содержимое.ВыгрузитьКолонку("Серия"), ЯчейкаРастарка.Владелец);
						ТаблицаВыпуска.Свернуть("Характеристика", "Количество");
						ТаблицаРастарки.Свернуть("Характеристика", "Количество");
						//ТаблицаРастаркиИзРаспоряжения.Свернуть("Характеристика", "Количество");
						//ТаблицыРазличаются = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТаблицаРастарки, ТаблицаРастаркиИзРаспоряжения, Ложь);
						//Если ТаблицыРазличаются Тогда
						//	Сообщить("Не совпадает растариваемое количество и количество, переданное по распоряжению на растарку");
						//	ОтменитьТранзакцию();
						//	Возврат Ложь;
						//КонецЕсли;
						ТаблицыРазличаются = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТаблицаРастарки, ТаблицаВыпуска, Ложь);
						Если ТаблицыРазличаются Тогда
							Сообщить("Не совпадает выпускаемое и растариваемое количество");
							ОтменитьТранзакцию();
							Возврат Ложь;
						КонецЕсли;

						// Создаем корректировку регистров
						НовыйДокументКорректировкаРегистров = СоздатьДокументКорректировкаРегистровВерсия3Растарка(СтруктураТиповыхДокументов.КорректировкаРегистров, МассивПоРаспоряжениям);
						Если НовыйДокументКорректировкаРегистров = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументКорректировкаРегистров;

						// Запишем, чтобы сохранилась ТЧ СодержимоеРастарки
						ЭтотОбъект.ОбменДанными.Загрузка = Истина;
						ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
						ЭтотОбъект.ОбменДанными.Загрузка = Ложь;

						// --> Начало Лико Ефимов ЕВВ 24.01.2023
						Если ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас Тогда
							// Заполним реквизит в сериях
							Для каждого Структура из МассивПоРаспоряжениям Цикл
								ТекКонтрагент = Структура.ТаблицаСерийРастаркиПоРаспоряжению[0].Серия.Лико_КонтрагентВладелецТовара;
								Для каждого ТекСтрокаТаблицыСерийВыпускаПоРаспоряжению ИЗ Структура.ТаблицаСерийВыпускаПоРаспоряжению Цикл
									ТекСерияОбъект = ТекСтрокаТаблицыСерийВыпускаПоРаспоряжению.Серия.ПолучитьОбъект();
									ТекСерияОбъект.Лико_КонтрагентВладелецТовара = ТекКонтрагент;
									ТекСерияОбъект.ОбменДанными.Загрузка = Истина;
									Попытка
										ТекСерияОбъект.Записать();
									Исключение
										Отказ = Истина;
										Сообщить("Серию """ + ТекСерияОбъект + """ не удалось записать! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
										ОтменитьТранзакцию();
										ВызватьИсключение;
									КонецПопытки;
								КонецЦикла;
							КонецЦикла;
						КонецЕсли;
						// <-- Конец Лико Ефимов ЕВВ 24.01.2023
					КонецЕсли;
				Иначе
					Сообщить("Данный тип склада не поддерживается для растарки");
					Возврат Ложь;
				КонецЕсли;

		КонецЕсли;
		// Проверим реквизит ВыпускИзРастарки в сериях
		Для каждого Строка из Содержимое Цикл
			Если Строка.Серия.Лико_ВыпускИзРастарки <> ВыпускИзРастарки Тогда
				СерияОбъект = Строка.Серия.ПолучитьОбъект();
				СерияОбъект.Лико_ВыпускИзРастарки = ВыпускИзРастарки;
				Попытка
					СерияОбъект.Записать();
				Исключение
					Сообщить("Не удалось записать данные в серию: " + ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ПеремещениеСНеордерногоСклада Тогда

		// Нужно проверить, хватает ли остатков на неордерном складе для перемещения, создать перемещение с неордерного на ордерный, приходный ордер на товары, размещение из ячейки-приемки в ячейу-получатель	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
		|	Лико_ФормированиеПаллетаСодержимое.Серия КАК Серия,
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке КАК Количество,
		|	Лико_ФормированиеПаллетаСодержимое.Ссылка.ЯчейкаПолучатель КАК ЯчейкаПолучатель
		|ПОМЕСТИТЬ ВТ_Серии
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|ГДЕ
		|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Серии.Номенклатура КАК Номенклатура,
		|	ВТ_Серии.Характеристика КАК Характеристика,
		|	СУММА(ВТ_Серии.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	ВТ_Серии КАК ВТ_Серии
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Серии.Номенклатура,
		|	ВТ_Серии.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ВТ_Товары.Количество КАК КоличествоУпаковок,
		|	ЕСТЬNULL(ОстаткиТоваровСгруппированы.ВНаличииОстаток, 0) КАК ВНаличииОстаток
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|			ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|			СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
		|		ИЗ
		|			РегистрНакопления.ТоварыНаСкладах.Остатки(
		|					&ДатаОстатков,
		|					(Номенклатура, Характеристика) В
		|							(ВЫБРАТЬ
		|								Т.Номенклатура,
		|								Т.Характеристика
		|							ИЗ
		|								ВТ_Товары КАК Т)
		|						И Склад = &НеордерныйСклад) КАК ТоварыНаСкладахОстатки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТоварыНаСкладахОстатки.Номенклатура,
		|			ТоварыНаСкладахОстатки.Характеристика) КАК ОстаткиТоваровСгруппированы
		|		ПО ВТ_Товары.Номенклатура = ОстаткиТоваровСгруппированы.Номенклатура
		|			И ВТ_Товары.Характеристика = ОстаткиТоваровСгруппированы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Серии.Номенклатура КАК Номенклатура,
		|	ВТ_Серии.Характеристика КАК Характеристика,
		|	ВТ_Серии.Серия КАК Серия,
		|	ВТ_Серии.Количество КАК Количество,
		|	ВТ_Серии.ЯчейкаПолучатель КАК ЯчейкаПолучатель
		|ИЗ
		|	ВТ_Серии КАК ВТ_Серии";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаОстатков", Дата);
		Запрос.УстановитьПараметр("НеордерныйСклад", СкладОтправитель);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		ТаблицаБезСерий = РезультатыЗапроса[РезультатыЗапроса.Количество()-2].Выгрузить();
		ЕстьОшибкиПоОстаткам = Ложь;
		Для каждого Строка из ТаблицаБезСерий Цикл
			Если Строка.Количество > Строка.ВНаличииОстаток Тогда
				ЕстьОшибкиПоОстаткам = Истина;
				Сообщить("Для позиции """ + Строка.Номенклатура + " / " + Строка.Характеристика + """ не хватает остатков на складе """ + СкладОтправитель + """. Требуется " + Строка.Количество + ", в наличии " + Строка.ВНаличииОстаток);
			КонецЕсли;
		КонецЦикла;
		Если ЕстьОшибкиПоОстаткам Тогда
			Возврат Ложь;
		КонецЕсли;

		ТаблицаСерий = РезультатыЗапроса[РезультатыЗапроса.Количество()-1].Выгрузить();
		Лико_Дополнительно.ДополнитьТаблицуСерийКолонкамиДляПроведенияДокументов(ТаблицаСерий);

		НачатьТранзакцию();
		// Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
		КлючиСтруктурыБезЭтапа = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "ЭтапПроизводства2_2");
		СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктурыБезЭтапа, Ссылка);
		Если СтруктураТиповыхДокументов = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;

		// Создаем перемещение товаров
		НовыйДокументПеремещениеТоваров = СоздатьДокументПеремещениеТоваров(ТаблицаБезСерий, СтруктураТиповыхДокументов.ПеремещениеТоваров);
		Если НовыйДокументПеремещениеТоваров = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументПеремещениеТоваров;

		// Создаем документ "Приходный ордер"
		НовыйДокументПриходныйОрдерНаТовары = Лико_Дополнительно.СоздатьДокументПриходныйОрдерНаТоварыНаОснованииРаспоряжения(НовыйДокументПеремещениеТоваров, СтруктураТиповыхДокументов.ПриходныйОрдерНаТовары, ТаблицаСерий); 
		Если НовыйДокументПриходныйОрдерНаТовары = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументПриходныйОрдерНаТовары;

		// Создаем размещение на складе
		НовыйДокументОтборРазмещениеТоваров_Размещение = Лико_Дополнительно.СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(НовыйДокументПриходныйОрдерНаТовары, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Размещение, ЯчейкаПолучатель);
		Если НовыйДокументОтборРазмещениеТоваров_Размещение = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Размещение;

	Иначе
		Сообщить("Тип документа """ + ТипДокумента + """ не предусмотрен разработчиками");
		Возврат Ложь;
	КонецЕсли;

	Если ПараметрыДляСозданияОднойЦепочки = Неопределено Тогда
		//Запишем типовые документы в регистр ЛикоСвязиСТиповымиДокументами
		Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
		Если НЕ Результат Тогда
			Возврат Ложь;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
		Возврат Истина;  
	Иначе
		Возврат ТаблицаНовыхДокументов;
	КонецЕсли;

КонецФункции

Функция ПодобратьВыпускающийЭтапПоЗаказу(Заказ)
	
	ВыпускающийЭтап = Лико_Дополнительно.НайтиВыпускающийЭтапПоЗаказуКлиента(Заказ);
	Если ВыпускающийЭтап = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Заказ.Площадка <> Справочники.Лико_Площадки.ИксПак Тогда // --> Начало Лико Ефимов ЕВВ 12.10.2020 Для Икс-пака проверять не будем, пусть всегда пишется в исходный заказ 
		ПроверитьВыпускающийЭтапПоДатам(ВыпускающийЭтап);
	КонецЕсли;

	Возврат ВыпускающийЭтап;
	
КонецФункции

Функция СоздатьЭтап(ВыборкаЗаказ, УжеСозданныйДокумент)

	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	//Распоряжение    = Лико_Дополнительно.НайтиЗаказНаПроизводствоПоЗаказуКлиента(ВыборкаЗаказ.ЗаказКлиента);
	//Если Распоряжение = Неопределено Тогда
	//	Отказ = Истина;
	//	Сообщить("Не найден заказ на производство для заказа клиента """ + ВыборкаЗаказ.ЗаказКлиента + """! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
	//	ОтменитьТранзакцию();
	//	Возврат Неопределено;
	//КонецЕсли;
	
	Если УжеСозданныйДокумент = Неопределено ИЛИ УжеСозданныйДокумент.Лико_ЭтоОбщийЭтапНаМесяц Тогда
		УжеСозданныйДокумент = Неопределено;
		ВыпускающийЭтап = ПодобратьВыпускающийЭтапПоЗаказу(ВыборкаЗаказ.ЗаказКлиента);
	КонецЕсли;
	
	Если УжеСозданныйДокумент = Неопределено Тогда
		НовыйДокОбъект = ВыпускающийЭтап.ПолучитьОбъект();
	Иначе
		НовыйДокОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
	КонецЕсли;
	Если НовыйДокОбъект.Лико_ЭтоОбщийЭтапНаМесяц Тогда
		КоличествоЗаказовКоторыеПишутВОбщийЭтап = КоличествоЗаказовКоторыеПишутВОбщийЭтап + 1;
	КонецЕсли;

	Если НовыйДокОбъект.Статус <> Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
		НовыйДокОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.ФактическоеНачалоЭтапа) Тогда
		НовыйДокОбъект.ФактическоеНачалоЭтапа = Дата;
	КонецЕсли;
	НовыйДокОбъект.ПроизводствоОднойДатой = Ложь;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.МаршрутнаяКарта) Тогда
		НовыйДокОбъект.МаршрутнаяКарта = Справочники.Лико_ПредопределенныеЗначения.МаршрутнаяКартаУпаковка.ЗначениеПараметра;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.КоэффициентМаршрутнойКарты) Тогда
		НовыйДокОбъект.КоэффициентМаршрутнойКарты = 1;
	КонецЕсли;
	Если НовыйДокОбъект.МаксимальныйКодСтрокиИзделия = 0 И НовыйДокОбъект.ВыходныеИзделия.Количество() > 0 Тогда
		ТаблицаВыходныеИздения = НовыйДокОбъект.ВыходныеИзделия.Выгрузить(,"КодСтроки");
		ТаблицаВыходныеИздения.Сортировать("КодСтроки Убыв");
		НовыйДокОбъект.МаксимальныйКодСтрокиИзделия = ТаблицаВыходныеИздения[0].КодСтроки;
	КонецЕсли;		
	
	МассивСтрокДляУдаления = Новый Массив;
	Для каждого Строка из НовыйДокОбъект.ВыходныеИзделия Цикл
		Если НЕ Строка.Произведено Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка из МассивСтрокДляУдаления Цикл
		НовыйДокОбъект.ВыходныеИзделия.Удалить(Строка);
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = ВыборкаЗаказ.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоВУпаковке = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НовыйДокОбъект.ВыходныеИзделия.Добавить();	
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
		НоваяСтрока.КоличествоУпаковок = ВыборкаДетальныеЗаписи.КоличествоВУпаковке;
		НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоВУпаковке;
		НоваяСтрока.Получатель = ЯчейкаПолучатель.Владелец;
		НоваяСтрока.Произведено = Истина;
		НоваяСтрока.ДатаПроизводства = Дата;
		НоваяСтрока.ДоляСтоимости = НоваяСтрока.Количество;
		НоваяСтрока.Лико_ФормированиеПаллета = Ссылка;
		НоваяСтрока.Подразделение = НовыйДокОбъект.Подразделение;
	КонецЦикла;
	
	МаксимальнаяДатаПроизводства = Дата(1,1,1);
	МинимальнаяДатаПроизводства = Дата('39991231235959');
	Для каждого Строка из НовыйДокОбъект.ВыходныеИзделия Цикл
		//Строка.ДоляСтоимости = Строка.Количество;
		МаксимальнаяДатаПроизводства = Макс(МаксимальнаяДатаПроизводства, Строка.ДатаПроизводства);
		МинимальнаяДатаПроизводства = Мин(МинимальнаяДатаПроизводства, Строка.ДатаПроизводства);
	КонецЦикла;
	МаксимальнаяДатаПроизводства = Макс(МаксимальнаяДатаПроизводства, Дата);
	НовыйДокОбъект.ФактическоеОкончаниеЭтапа = МаксимальнаяДатаПроизводства;
	Если НовыйДокОбъект.ФактическоеНачалоЭтапа > МинимальнаяДатаПроизводства Тогда
		НовыйДокОбъект.ФактическоеНачалоЭтапа = МинимальнаяДатаПроизводства;		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Лико_НеРассчитыватьНормативныйГрафик") ИЛИ КоличествоЗаказовКоторыеПишутВОбщийЭтап > 1 Тогда
		НовыйДокОбъект.ДополнительныеСвойства.Вставить("Лико_НеРассчитыватьНормативныйГрафик", Истина);
	КонецЕсли;	
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьПередачуПродукции(НовыйЭтапСсылка, Заказ, УжеСозданныйДокумент)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	//ОбъектыОснований = Новый Массив;
	//ОбъектыОснований.Добавить(НовыйЭтапСсылка);
	//
	//ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
	//ОбъектыОснований,
	//ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства"));
	
	НовыйДокОбъект = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	
	//НовыйДокОбъект.Заполнить(ПараметрыОткрытия.Основание);
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Организация = НовыйЭтапСсылка.Организация;
	НовыйДокОбъект.Отправитель = НовыйЭтапСсылка.Подразделение;
	НовыйДокОбъект.Получатель = ЯчейкаПолучатель.Владелец;
	НовыйДокОбъект.Распоряжение = НовыйЭтапСсылка;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.ПоРаспоряжениям = Истина;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства;
	НовыйДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	НовыйДокОбъект.Статус = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	НовыйДокОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	
	Для каждого Строка из НовыйЭтапСсылка.ВыходныеИзделия Цикл
		Если Строка.Лико_ФормированиеПаллета = Ссылка И Строка.Характеристика.Лико_ЗаказНоменклатуры = Заказ Тогда
			НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Количество,КоличествоУпаковок,КодСтроки");
			НоваяСтрока.НазначениеОтправителя = НовыйЭтапСсылка.Назначение;
			НоваяСтрока.Распоряжение = НовыйЭтапСсылка;
		КонецЕсли;
	КонецЦикла;
	
	//// Удалим из передачи те строки, которые не соответствуют текущему формированию паллета
	//МассивКодовСтрокЭтапа = Новый Массив;
	//Для каждого СтрокаТЧ из НовыйЭтапСсылка.ВыходныеИзделия Цикл
	//	Если СтрокаТЧ.Лико_ФормированиеПаллета = Ссылка Тогда
	//		МассивКодовСтрокЭтапа.Добавить(СтрокаТЧ.КодСтроки);
	//	КонецЕсли;
	//КонецЦикла;
	//МассивДляУдаления = Новый Массив;
	//Для каждого СтрокаТЧ из НовыйДокОбъект.Товары Цикл
	//	Если МассивКодовСтрокЭтапа.Найти(СтрокаТЧ.КодСтроки) = Неопределено Тогда
	//		МассивДляУдаления.Добавить(СтрокаТЧ);
	//	КонецЕсли;
	//КонецЦикла;
	//Для каждого Строка из МассивДляУдаления Цикл
	//	НовыйДокОбъект.Товары.Удалить(Строка);
	//КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Сообщить(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьПриходныйОрдер(НовыйЭтапСсылка, ВыборкаСерии, Приемка, УжеСозданныйДокумент)
	
	Отказ = Ложь;
	Основание = Новый Структура;
	Основание.Вставить("Распоряжение",НовыйЭтапСсылка.Ссылка);
	Основание.Вставить("Отправитель",НовыйЭтапСсылка.Подразделение);
	Основание.Вставить("ЗакрыватьГрафикПоступления",Истина);
	Основание.Вставить("Склад", ЯчейкаПолучатель.Владелец);
	Основание.Вставить("Помещение", Справочники.СкладскиеПомещения.ПустаяСсылка());
	Основание.Вставить("ЗонаПриемки", Приемка);
	Основание.Вставить("ДатаВходящегоДокумента", НовыйЭтапСсылка.Дата);
	Основание.Вставить("НомерВходящегоДокумента", НовыйЭтапСсылка.Номер);
	Основание.Вставить("ДатаПоступления", Дата);
	Основание.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);
	
	НовыйДокОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	НовыйДокОбъект.Заполнить(Основание);
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Лико_АвторДокумента = АвторДокумента;
	НовыйДокОбъект.Лико_РабочееМесто = РабочееМесто;
	НовыйДокОбъект.Товары.Очистить();
	//ПредыдущийВид = Неопределено;
	//ПредыдущаяУпаковка = Неопределено;
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Пока ВыборкаСерии.Следующий() Цикл
		Если ВыборкаСерии.КоличествоВУпаковке = 0 Тогда
			Сообщить("У серии " + ВыборкаСерии.Серия + " не заполнен реквизит ""Количество в упаковке""! Данная серия пропущена.");
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаСерии.Номенклатура;
		НоваяСтрока.Характеристика = ВыборкаСерии.Характеристика;
		//Если ПредыдущийВид = НоваяСтрока.Номенклатура.ВидНоменклатуры Тогда
		//	НоваяСтрока.Упаковка = ПредыдущаяУпаковка;
		//Иначе
		//	НоваяСтрока.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(НоваяСтрока.Номенклатура.ВидНоменклатуры);
		//КонецЕсли;
		НоваяСтрока.Упаковка = УпаковкаТысШт;
		НоваяСтрока.КоличествоУпаковок = ВыборкаСерии.КоличествоВУпаковке;
		НоваяСтрока.Количество = ВыборкаСерии.КоличествоВУпаковке;
		НоваяСтрока.СтатусУказанияСерий = 8;
		НоваяСтрока.Серия = ВыборкаСерии.Серия;
		
		//ПредыдущийВид = НоваяСтрока.Номенклатура.ВидНоменклатуры;
		//ПредыдущаяУпаковка = НоваяСтрока.Упаковка;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Сообщить(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументПеремещениеТоваров(Таблица, УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.ДатаРаспоряжения = НовыйДокОбъект.Дата;
	НовыйДокОбъект.Организация = Организация;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Подразделение = Подразделение;
	НовыйДокОбъект.СкладОтправитель = СкладОтправитель;
	НовыйДокОбъект.СкладПолучатель = ЯчейкаПолучатель.Владелец;
	НовыйДокОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	
	Для каждого Строка из Таблица Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументКорректировкаРегистров(УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Ответственный = ?(ЗначениеЗаполнено(РабочееМесто.Пользователь), РабочееМесто.Пользователь, ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.Операция = Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка;
	
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ДвиженияСерийТоваров";
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ТоварыВЯчейках";
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ТоварыНаСкладах";
	
	ТаблицаВыпуска = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(Содержимое.ВыгрузитьКолонку("Серия"), ЯчейкаПолучатель.Владелец);
	ТаблицаРастарки = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(СодержимоеРастарки.ВыгрузитьКолонку("Серия"), ЯчейкаРастарка.Владелец);
	МассивПриходныхОрдеров = ТаблицаРастарки.ВыгрузитьКолонку("ПриходныйОрдерНаТовары");
	МассивПриходныхОрдеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПриходныхОрдеров);
	Если МассивПриходныхОрдеров.Количество() > 1 Тогда
		Сообщить("В распоряжении на растарку содержатся коробки из разных партий");
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	Если МассивПриходныхОрдеров.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(МассивПриходныхОрдеров[0]) Тогда
		Сообщить("Не удалось получить партию коробок");
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	ПриходныйОрдерНаТовары = МассивПриходныхОрдеров[0];
	
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Для каждого Строка из ТаблицаРастарки Цикл
		Движение = НовыйДокОбъект.Движения.ДвиженияСерийТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.Документ = ПриходныйОрдерНаТовары;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Отправитель = Движение.Документ.Отправитель;
		Движение.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
		Движение.Получатель = Движение.Документ.Склад;
		Движение.ЭтоСкладскоеДвижение = Истина;
		Движение.Количество = -Строка.Количество;
		
		Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Упаковка = УпаковкаТысШт;
		Движение.Ячейка = ЯчейкаРастарка;
		Движение.ВНаличии = Строка.Количество;
		
		Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Склад = ЯчейкаРастарка.Владелец;
		Движение.ВНаличии = Строка.Количество;
	КонецЦикла;
	
	Для каждого Строка из ТаблицаВыпуска Цикл
		Движение = НовыйДокОбъект.Движения.ДвиженияСерийТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.Документ = ПриходныйОрдерНаТовары;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Отправитель = Движение.Документ.Отправитель;
		Движение.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
		Движение.Получатель = Движение.Документ.Склад;
		Движение.ЭтоСкладскоеДвижение = Истина;
		Движение.Количество = Строка.Количество;
		
		Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Упаковка = УпаковкаТысШт;
		Движение.Ячейка = ЯчейкаПолучатель;
		Движение.ВНаличии = Строка.Количество;
		
		Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Склад = ЯчейкаПолучатель.Владелец;
		Движение.ВНаличии = Строка.Количество;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		Для каждого СтрокаТЧ из НовыйДокОбъект.ТаблицаРегистров Цикл
			УжеСозданныйДокументОбъект.Движения[СтрокаТЧ.Имя].Загрузить(НовыйДокОбъект.Движения[СтрокаТЧ.Имя].Выгрузить());
			УжеСозданныйДокументОбъект.Движения[СтрокаТЧ.Имя].Записать();
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументКорректировкаРегистровВерсия3Растарка(УжеСозданныйДокумент = Неопределено, МассивПоРаспоряжениям)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Ответственный = ?(ЗначениеЗаполнено(РабочееМесто.Пользователь), РабочееМесто.Пользователь, ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.Операция = Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка;
	
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ДвиженияСерийТоваров";
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ТоварыВЯчейках";
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ТоварыНаСкладах";
	
	ТаблицаВыпуска = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(Содержимое.ВыгрузитьКолонку("Серия"), ЯчейкаПолучатель.Владелец);
	ТаблицаРастарки = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(СодержимоеРастарки.ВыгрузитьКолонку("Серия"), ЯчейкаРастарка.Владелец);
	//МассивПриходныхОрдеров = ТаблицаРастарки.ВыгрузитьКолонку("ПриходныйОрдерНаТовары");
	//МассивПриходныхОрдеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПриходныхОрдеров);
	//Если МассивПриходныхОрдеров.Количество() > 1 Тогда
	//	Сообщить("В распоряжении на растарку содержатся коробки из разных партий");
	//	Отказ = Истина;
	//	Возврат Неопределено;
	//КонецЕсли;
	//Если МассивПриходныхОрдеров.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(МассивПриходныхОрдеров[0]) Тогда
	//	Сообщить("Не удалось получить партию коробок");
	//	Отказ = Истина;
	//	Возврат Неопределено;
	//КонецЕсли;
	//ПриходныйОрдерНаТовары = МассивПриходныхОрдеров[0];
	
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Для каждого Строка из ТаблицаРастарки Цикл
		Движение = НовыйДокОбъект.Движения.ДвиженияСерийТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.Документ = Строка.ПриходныйОрдерНаТовары;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Отправитель = Движение.Документ.Отправитель;
		Движение.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
		Движение.Получатель = Движение.Документ.Склад;
		Движение.ЭтоСкладскоеДвижение = Истина;
		Движение.Количество = -Строка.Количество;
		
		Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Упаковка = УпаковкаТысШт;
		Движение.Ячейка = ЯчейкаРастарка;
		Движение.ВНаличии = Строка.Количество;
		
		Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = НовыйДокОбъект.Дата;
		Движение.Склад = ЯчейкаРастарка.Владелец;
		Движение.ВНаличии = Строка.Количество;
	КонецЦикла;
	
	Для каждого Структура из МассивПоРаспоряжениям Цикл
		Для каждого Строка из Структура.ТаблицаСерийВыпускаПоРаспоряжению Цикл
			// Найдем приходный ордер по любой серии связки распоряжение+номерстроки
			Серия = Структура.ТаблицаСерийРастаркиПоРаспоряжению[0].Серия;
			НайденнаяСтрока = ТаблицаРастарки.Найти(Серия, "Серия");
			Если НайденнаяСтрока = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НайденнаяСтрока.ПриходныйОрдерНаТовары) Тогда
				Сообщить("ОШИБКА. Обратитесь к программистам");
				Отказ = Истина;
				Возврат Неопределено;
			КонецЕсли;
			ТекПриходныйОрдер = НайденнаяСтрока.ПриходныйОрдерНаТовары;
			
			
			Движение = НовыйДокОбъект.Движения.ДвиженияСерийТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			Движение.Документ = ТекПриходныйОрдер;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Отправитель = Движение.Документ.Отправитель;
			Движение.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;
			Движение.Получатель = Движение.Документ.Склад;
			Движение.ЭтоСкладскоеДвижение = Истина;
			Движение.Количество = Строка.Количество;
			
			Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = УпаковкаТысШт;
			Движение.Ячейка = ЯчейкаПолучатель;
			Движение.ВНаличии = Строка.Количество;
			
			Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = ЯчейкаПолучатель.Владелец;
			Движение.ВНаличии = Строка.Количество;
		КонецЦикла;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		Для каждого СтрокаТЧ из НовыйДокОбъект.ТаблицаРегистров Цикл
			УжеСозданныйДокументОбъект.Движения[СтрокаТЧ.Имя].Загрузить(НовыйДокОбъект.Движения[СтрокаТЧ.Имя].Выгрузить());
			УжеСозданныйДокументОбъект.Движения[СтрокаТЧ.Имя].Записать();
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументКорректировкаРегистровУпрощенныйРежим(УжеСозданныйДокумент = Неопределено, ТаблицаПриход = Неопределено, ТаблицаРасход = Неопределено)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Ответственный = ?(ЗначениеЗаполнено(РабочееМесто.Пользователь), РабочееМесто.Пользователь, ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.Операция = Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка;
	
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ТоварыВЯчейках";
	НоваяСтрока = НовыйДокОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "ТоварыНаСкладах";
	Склад = ЯчейкаПолучатель.Владелец;

	Если ТаблицаПриход = Неопределено Тогда
		УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
		Для каждого Строка из Содержимое Цикл
			Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;

			Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = УпаковкаТысШт;
			Движение.Ячейка = ЯчейкаПолучатель;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;
		КонецЦикла;  
	Иначе  
		Для каждого Строка из ТаблицаПриход Цикл
			Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;

			Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = Строка.Упаковка;
			Движение.Ячейка = ЯчейкаПолучатель;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТаблицаРасход = Неопределено Тогда		
		Для каждого Строка из СодержимоеРастарки Цикл
			Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;

			Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = УпаковкаТысШт;
			Движение.Ячейка = ЯчейкаРастарка;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;
		КонецЦикла;
	Иначе
		Для каждого Строка из ТаблицаРасход Цикл
			Движение = НовыйДокОбъект.Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;

			Движение = НовыйДокОбъект.Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = Строка.Упаковка;
			Движение.Ячейка = ЯчейкаРастарка;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;
		КонецЦикла;
	КонецЕсли;
	
		
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		Для каждого СтрокаТЧ из НовыйДокОбъект.ТаблицаРегистров Цикл
			УжеСозданныйДокументОбъект.Движения[СтрокаТЧ.Имя].Загрузить(НовыйДокОбъект.Движения[СтрокаТЧ.Имя].Выгрузить());
			УжеСозданныйДокументОбъект.Движения[СтрокаТЧ.Имя].Записать();
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция _СоздатьДокументКорректировкаРегистровУпрощенныйРежим(УжеСозданныйДокумент = Неопределено, ТаблицаПриход = Неопределено, ТаблицаРасход = Неопределено)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	Склад = ЯчейкаПолучатель.Владелец;

	НовыйДокОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Склад = Склад;    
	НовыйДокОбъект.Распоряжение = Документы.ЭтапПроизводства2_2.ПустаяСсылка(); // Без него не открывается форма
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """"; 
	НовыйДокОбъект.Проведен = Истина;
	НовыйДокОбъект.ОбменДанными.Загрузка = Истина;
	НовыйДокОбъект.УстановитьНовыйНомер();
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборЗаписейТоварыНаСкладах = РегистрыНакопления.ТоварыНаСкладах.СоздатьНаборЗаписей();
	НаборЗаписейТоварыНаСкладах.Отбор.Регистратор.Установить(НовыйДокОбъект.Ссылка);	
	НаборЗаписейТоварыНаСкладах.Прочитать();
		
	НаборЗаписейТоварыВЯчейках = РегистрыНакопления.ТоварыВЯчейках.СоздатьНаборЗаписей();
	НаборЗаписейТоварыВЯчейках.Отбор.Регистратор.Установить(НовыйДокОбъект.Ссылка);	
	НаборЗаписейТоварыВЯчейках.Прочитать();
		
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Если ТаблицаПриход = Неопределено Тогда
		Для каждого Строка из Содержимое Цикл
			Движение = НаборЗаписейТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;

			Движение = НаборЗаписейТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = УпаковкаТысШт;
			Движение.Ячейка = ЯчейкаПолучатель;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;
		КонецЦикла;
	Иначе
		Для каждого Строка из ТаблицаПриход Цикл
			Движение = НаборЗаписейТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;

			Движение = НаборЗаписейТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = Строка.Упаковка;
			Движение.Ячейка = ЯчейкаПолучатель;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;
		КонецЦикла;
	КонецЕсли;

	Если ТаблицаРасход = Неопределено Тогда		
		Для каждого Строка из СодержимоеРастарки Цикл
			Движение = НаборЗаписейТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;

			Движение = НаборЗаписейТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = УпаковкаТысШт;
			Движение.Ячейка = ЯчейкаРастарка;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Движение.Серия.Лико_ХарактеристикаВладелец;
			Движение.Номенклатура = Движение.Характеристика.Владелец;
			Движение.ВНаличии = Движение.Серия.Лико_КоличествоВУпаковке;
		КонецЦикла;
	Иначе
		Для каждого Строка из ТаблицаРасход Цикл
			Движение = НаборЗаписейТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Склад = Склад;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;

			Движение = НаборЗаписейТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НовыйДокОбъект.Дата;
			Движение.Упаковка = Строка.Упаковка;
			Движение.Ячейка = ЯчейкаРастарка;
			Движение.Серия = Строка.Серия; 
			Движение.Характеристика = Строка.Характеристика;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.ВНаличии = Строка.Количество;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписейТоварыНаСкладах.Записать();
	НаборЗаписейТоварыВЯчейках.Записать();

	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НачатьТранзакцию();
	// <-- Начало Лико Яцун С. В. 26.09.2025 
	Если Площадка = Справочники.Лико_Площадки.Линкс И ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции И НЕ ВыпускИзРастарки Тогда 
		УдалитьЗаписиДвиженияПеремотки();
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 26.09.2025 
	//Пометим на удаление связанные типовые документы
	КлючиСтруктурыБезЭтапа = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "ЭтапПроизводства2_2");
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктурыБезЭтапа, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Удалим из этапа строки выпуска, соответствующие этому формированию паллета
	Если ДополнительныеСвойства.Свойство("Лико_НеРассчитыватьНормативныйГрафик") Тогда
		ДопСвойстваЭтапа = Новый Структура("Лико_НеРассчитыватьНормативныйГрафик", Истина);
	Иначе
		ДопСвойстваЭтапа = Неопределено;
	КонецЕсли;
	Результат = Лико_Дополнительно.УдалитьИзЭтаповСтрокиВыпускаПоСвязанномуФормированиюПаллета(Ссылка, ДопСвойстваЭтапа);
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Удалим запись из Лико_ЭтапыЗаказа
	ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияРеквизитаДокументВРегистреЭтапыЗаказа.ЗначениеПараметра <= ?(ЗначениеЗаполнено(ДатаФормирования), ДатаФормирования, Дата);
	Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
		Лико_Дополнительно.УдалитьЗаписиИзРегистраЛико_ЭтапыЗаказовПоДокументу(Ссылка);
	КонецЕсли;
	ТаблицаЗаказов = Новый ТаблицаЗначений;
	ТаблицаЗаказов.Колонки.Добавить("Заказ");
	Для каждого Строка из Содержимое Цикл
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		НоваяСтрока.Заказ = Строка.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры;
	КонецЦикла;
	ТаблицаЗаказов.Свернуть("Заказ");
	Для каждого Строка из ТаблицаЗаказов Цикл
		Если НЕ ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
			МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ?(ЗначениеЗаполнено(ДатаФормирования), ДатаФормирования, Дата);
			МенеджерЗаписи.Заказ = Строка.Заказ;
			МенеджерЗаписи.Площадка = Строка.Заказ.Площадка;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Упаковка Тогда
				Попытка
					МенеджерЗаписи.Удалить();	
				Исключение
					Сообщить("Не удалось удалить запись из регистра ""лк Этапы заказа"": " + ОписаниеОшибки());
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Лико_Дополнительно.ОбновитьВЗаказеСреднееКоличествоВКоробкеИРолике(Строка.Заказ, Ссылка, Истина, Истина);
	КонецЦикла;	

	//Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
	//	// Удалим записи из документа Лико_ДвиженияЗаказаПоЭтапам
	//	Лико_Дополнительно.УдалитьЗаписиИзДокументаЛико_ДвиженияЗаказаПоЭтапам(XMLСтрока(Ссылка));
	//КонецЕсли;
		
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Площадка) Тогда
		Сообщить("В документе """ + Ссылка + """ не заполнена площадка");
		Отказ = Истина;
	КонецЕсли;
	
	Если Площадка.Организация <> Организация Тогда
		Организация = Площадка.Организация;
	КонецЕсли;
	
	Если СозданНаОснованииПолученияГПИзПроизводства И НЕ РольДоступна("ПолныеПрава") И НЕ ДополнительныеСвойства.Свойство("Лико_СозданиеИзПолученияГПИзПроизводства") Тогда
		Сообщить("Документ создан на основании " + Метаданные.Документы.Лико_ПолучениеГПИзПроизводства.Представление() + ", корректировка запрещена");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка)
		И Ссылка.Проведен
		И НЕ РольДоступна("ПолныеПрава")
		И НЕ ДополнительныеСвойства.Свойство("ОтключитьЧастьПроверок")
		Тогда
		Сообщить("Запрещено корректировать проведенный документ");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипДокумента) Тогда
		Отказ = Истина;
		Сообщить("В документе """ + Ссылка + """ не заполнен тип документа. Запись невозможна.");
	КонецЕсли;
	
	РастаркаПоВерсии3 = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()) >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастаркиВерсия3.ЗначениеПараметра И НЕ РастаркаПоСтаройСхемеВерсии2;
	
	Если РастаркаПоВерсии3 Тогда
		// Сбросим признак выпуска из растарки, т.к. он будет установлен ниже
		ВыпускИзРастарки = Ложь;
	КонецЕсли;
	
	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции и РастаркаПоВерсии3 Тогда
		МассивТипов = Новый Массив;
		МассивСкладов = Новый Массив;
		МассивРаспоряжений = Новый Массив;
		СкладПолучатель = ЯчейкаПолучатель.Владелец;
		Для каждого Строка из Содержимое Цикл
			ТекущееРаспоряжение = Строка.Серия.Лико_РаспоряжениеНаРастарку;
			МассивТипов.Добавить(?(ЗначениеЗаполнено(ТекущееРаспоряжение), "Растарка", "Не растарка"));
			Если ЗначениеЗаполнено(ТекущееРаспоряжение) Тогда
				ВыпускИзРастарки = Истина;
			КонецЕсли;
			МассивРаспоряжений.Добавить(ТекущееРаспоряжение);
			МассивСкладов.Добавить(ТекущееРаспоряжение.СкладПолучатель);
		КонецЦикла;
		МассивТипов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
		МассивРаспоряжений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивРаспоряжений);
		МассивСкладов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСкладов);
		Если МассивТипов.Количество() > 1 Тогда
			Сообщить("В документе содержатся коробки из растарки и новые коробки. Необходимо разделить документ:");
			Отказ = Истина;
			Для каждого Строка из Содержимое Цикл
				Сообщить("" + Строка.Серия + ?(ЗначениеЗаполнено(Строка.Серия.Лико_РаспоряжениеНаРастарку), " из растарки", " новая"));
			КонецЦикла;
		КонецЕсли;
		Если НЕ Отказ И ВыпускИзРастарки Тогда
			Если МассивСкладов.Количество() > 1 Тогда
				Сообщить("В документе содержатся коробки растарки по разным складам. Необходимо разделить документ:");
				Отказ = Истина;
				Для каждого Строка из Содержимое Цикл
					Сообщить("" + Строка.Серия + " - склад """ + Строка.Серия.Лико_РаспоряжениеНаРастарку.СкладПолучатель + """");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Если НЕ Отказ И ВыпускИзРастарки Тогда
			Если ЯчейкаПолучатель.Владелец <> МассивСкладов[0] Тогда
				ЯчейкаРастарка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, МассивСкладов[0], "ЯчейкаРастарка");
				ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, МассивСкладов[0], "ЯчейкаХранениеПоУмолчанию");
			КонецЕсли;
		КонецЕсли;
		Если НЕ Отказ И ВыпускИзРастарки И ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас Тогда
			Если МассивРаспоряжений.Количество() > 1 Тогда
				Сообщить("В документе содержатся коробки растарки Ангара по разным распоряжениям. Необходимо разделить документ:");
				Отказ = Истина;
				Для каждого Строка из Содержимое Цикл
					Сообщить("" + Строка.Серия + " - распоряжение """ + Строка.Серия.Лико_РаспоряжениеНаРастарку + """");
				КонецЦикла;
			Иначе
				РаспоряжениеНаРастарку = МассивРаспоряжений[0];
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение И (Ссылка.ТипДокумента <> ТипДокумента ИЛИ Ссылка.РаспоряжениеНаРастарку <> РаспоряжениеНаРастарку ИЛИ Ссылка.ВыпускИзРастарки <> ВыпускИзРастарки) Тогда
		Отказ = Истина;
		Сообщить("" + Ссылка + ": нельзя менять тип документа (или распоряжение на растарку) у проведенного документа. Сначала распроведите документ.");
	КонецЕсли;
	
	Если Дата >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастарки.ЗначениеПараметра Тогда
		Если ВыпускИзРастарки И НЕ ЗначениеЗаполнено(РаспоряжениеНаРастарку) И Дата < Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастаркиВерсия3.ЗначениеПараметра Тогда
			Отказ = Истина;
			Сообщить("Необходимо просканировать распоряжение на растарку");
		КонецЕсли;
		
		Если ВыпускИзРастарки И НЕ ЗначениеЗаполнено(ЯчейкаРастарка) Тогда
			Отказ = Истина;
			Сообщить("Необходимо заполнить ячейку-растарку");
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ЯчейкаРастарка) И ЯчейкаРастарка.Владелец <> ЯчейкаПолучатель.Владелец Тогда
			Отказ = Истина;
			Сообщить("Склады ячейки-растарки и ячейки-получателя должны совпадать");
		КонецЕсли;
	КонецЕсли;
	
	Если ЯчейкаПолучатель.Владелец.Лико_ТипСклада <> Перечисления.Лико_ТипСклада.ГП Тогда
		Отказ = Истина;
		Сообщить("В данном документе можно выбирать только склады с типом ""ГП""");
	КонецЕсли;
	
	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ПеремещениеСНеордерногоСклада И НЕ ЗначениеЗаполнено(СкладОтправитель) Тогда
		Отказ = Истина;
		Сообщить("Для типа документа """ + ТипДокумента + """ небходимо заполнить неордерный склад-отправитель");
	КонецЕсли;
	
	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции И ЗначениеЗаполнено(Ссылка) И НЕ РольДоступна("ПолныеПрава") И НЕ ДополнительныеСвойства.Свойство("ОтключитьЧастьПроверок") Тогда
		УстановитьПривилегированныйРежим(Истина);
		// Проверим, не содержатся ли коробки из формирования в отгрузках
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка КАК Ссылка,
			|	Лико_ЗаявкаНаТранспортировкуПродукция.Серия КАК Серия
			|ИЗ
			|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
			|ГДЕ
			|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Проведен
			|	И Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаявокНаТранспортировку.Закрыт)
			|	И Лико_ЗаявкаНаТранспортировкуПродукция.Мест > 0
			|	И Лико_ЗаявкаНаТранспортировкуПродукция.Серия В(&МассивСерий)";
		
		Запрос.УстановитьПараметр("МассивСерий", Ссылка.Содержимое.ВыгрузитьКолонку("Серия"));
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Отказ = Истина;
			Сообщить("Коробка """ + ВыборкаДетальныеЗаписи.Серия + """ уже содержится в отгрузке """ + ВыборкаДетальныеЗаписи.Ссылка + """. Корректировка документа невозможна");
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);		
	КонецЕсли;

	//Если РастаркаПоВерсии3 Тогда
	Если Дата >= Дата('20200828110000') И ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.Переупаковка И НЕ РольДоступна("ПолныеПрава") Тогда
		// Проверим, чтобы ячейка-получатель и ячейка-растарка отличались
		Если ЯчейкаПолучатель = ЯчейкаРастарка Тогда
			Отказ = Истина;
			//Сообщить("Используется новая схема растарки (версия 3), поэтому формировать паллеты сразу в ячейку-растарку больше нельзя. Вы можете просканировать коробки сразу в перемещение паллета");
			Сообщить("Формировать паллеты сразу в ячейку-растарку больше нельзя. Вы можете просканировать коробки в перемещение паллета");
		КонецЕсли;
	КонецЕсли;

	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции И Содержимое.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка КАК Площадка
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|ГДЕ
			|	СерииНоменклатуры.Ссылка В(&МассивСерий)
			|
			|СГРУППИРОВАТЬ ПО
			|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка";
		
		Запрос.УстановитьПараметр("МассивСерий", Содержимое.ВыгрузитьКолонку("Серия"));
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить("В документе содержатся коробки разных площадок. Необходимо разделить документ:");
			Для каждого Строка из Содержимое Цикл
				Сообщить("" + Строка.Серия + " - площадка """ + Строка.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка + """");
			КонецЦикла;
		КонецЕсли;

		Если НЕ ВыпускИзРастарки И Содержимое[0].Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка <> ЯчейкаПолучатель.Владелец.Лико_Площадка Тогда
			Отказ = Истина;
			Сообщить("Площадка склада не соответствует площадке выпускаемого заказа");
		КонецЕсли;
	КонецЕсли;		
	
	Если НЕ Отказ И НЕ ЗначениеЗаполнено(ДатаФормирования) Тогда
		ДатаФормирования = Дата;
	КонецЕсли;
	
	СодержимоеРастарки.Очистить();
	
	// --> Начало Лико Ефимов ЕВВ 24.01.2023
	Если НЕ Отказ 
		И ЗначениеЗаполнено(Ссылка)
		И Ссылка.ВыпускИзРастарки
		И Ссылка.Проведен
		И Ссылка.ЯчейкаРастарка.Владелец.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас Тогда
		// Очистим контрагента-владельца в сериях ссылки. Если документ потом опять проведется, то контрагент заполнится обратно в проведении
		Для каждого Строка из Ссылка.Содержимое Цикл
			Если ЗначениеЗаполнено(Строка.Серия.Лико_КонтрагентВладелецТовара) Тогда
				СерияОбъект = Строка.Серия.ПолучитьОбъект();
				СерияОбъект.Лико_КонтрагентВладелецТовара = Неопределено;
				СерияОбъект.ОбменДанными.Загрузка = Истина;
				Попытка
					СерияОбъект.Записать();
				Исключение
					Отказ = Истина;
					Сообщить("" + Ссылка + ": не удалось очистить контрагента-владельца в серии """ + СерияОбъект + """.");
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 24.01.2023

	Если НЕ ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(ДатаУпрощенногоПроведения) Тогда
		// Сдвинем на текущую у нового документа
		ДатаУпрощенногоПроведения = ТекущаяДата();
	КонецЕсли; 
	
	Если ТипДокумента <> Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции И ЗначениеЗаполнено(ДатаУпрощенногоПроведения) Тогда
		// Для НЕ выпусков это не нужно
		ДатаУпрощенногоПроведения = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

Функция СоздатьДокументОтборРазмещениеТоваров(ВыборкаСерия, УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение;
	НовыйДокОбъект.ДатаНачалаВыполнения = Дата;
	НовыйДокОбъект.ДатаОкончанияВыполнения = Дата;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Склад = ЯчейкаПолучатель.Владелец;
	НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВРаботе;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	
	Пока ВыборкаСерия.Следующий() Цикл
		Выборка = ВыборкаСерия.Выбрать();
		КоличествоОсталось = ВыборкаСерия.Серия.Лико_КоличествоВУпаковке;
		КоличествоОприходовать = КоличествоОсталось;
		Пока Выборка.Следующий() Цикл
			Если КоличествоОсталось <= 0 Тогда
				Прервать;
			КонецЕсли;
			Если КоличествоОсталось > Выборка.ВНаличииОстаток Тогда
				КоличествоСписываем = Выборка.ВНаличииОстаток;
			Иначе
				КоличествоСписываем = КоличествоОсталось
			КонецЕсли;
			КоличествоОсталось = КоличествоОсталось - КоличествоСписываем;
			
			НоваяСтрокаОтбор = НовыйДокОбъект.ТоварыОтбор.Добавить();
			НоваяСтрокаОтбор.Количество = КоличествоСписываем;
			НоваяСтрокаОтбор.КоличествоОтобрано = КоличествоСписываем;
			НоваяСтрокаОтбор.КоличествоУпаковок = КоличествоСписываем;
			НоваяСтрокаОтбор.КоличествоУпаковокОтобрано = КоличествоСписываем;
			НоваяСтрокаОтбор.Номенклатура = Выборка.Номенклатура;
			//НоваяСтрокаОтбор.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры);
			НоваяСтрокаОтбор.Упаковка = УпаковкаТысШт;
			НоваяСтрокаОтбор.Характеристика = Выборка.Характеристика;
			НоваяСтрокаОтбор.Ячейка = Выборка.Ячейка;
			НоваяСтрокаОтбор.ВесУпаковки = 1;
			НоваяСтрокаОтбор.Серия = Выборка.Серия;
			НоваяСтрокаОтбор.СтатусУказанияСерий = 8;
		КонецЦикла;
		
		НоваяСтрокаРазмещение = НовыйДокОбъект.ТоварыРазмещение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРазмещение, НоваяСтрокаОтбор,,"Ячейка");
		НоваяСтрокаРазмещение.Ячейка = ЯчейкаПолучатель;
		НоваяСтрокаРазмещение.Количество = КоличествоОприходовать;
		НоваяСтрокаРазмещение.КоличествоРазмещено = КоличествоОприходовать;
		НоваяСтрокаРазмещение.КоличествоУпаковок = КоличествоОприходовать;
		НоваяСтрокаРазмещение.КоличествоУпаковокРазмещено = КоличествоОприходовать;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		//чтобы отработали проверки при проведении отбора, его сперва нужно провести в статусе "В работе" или "Подготовлено", а уже потом в статусе "Выполнено без ошибок"
		//(если провести сразу в статусе "Выполнено без ошибок", то проверок не будет и документ без проблем проведется)
		Если НЕ ОтключитьЧастьПроверок Тогда
			// С такими проверками невозможно перепровести документ задним числом (если коробки после этого имеют другие движения), закомментим пока
			//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//меняем статус и проводим еще раз
		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Сообщить(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция НайтиПоследнийЭтапВЦепочкеЗаказаНаПроизводство(ЗаказНаПроизводство)
	
	
КонецФункции

Процедура ПроверитьВыпускающийЭтапПоДатам(ЭтапСсылка)
	
	Если ЭтапСсылка.ВыходныеИзделия.НайтиСтроки(Новый Структура("Произведено", Истина)).Количество() > 0 И ЭтапСсылка.ПроизводствоОднойДатой И ЗначениеЗаполнено(ЭтапСсылка.ДатаПроизводства) Тогда
		МинДатаПроизводства = ЭтапСсылка.ДатаПроизводства;
	Иначе
		// Получим дату производства первой коробки
		МинДатаПроизводства = Дата('39991231');
		Для каждого Строка из ЭтапСсылка.ВыходныеИзделия Цикл
			Если Строка.Произведено И ЗначениеЗаполнено(Строка.ДатаПроизводства) Тогда
				МинДатаПроизводства = Мин(МинДатаПроизводства, Строка.ДатаПроизводства);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 20181003 если по заказу был документ "Бланк этапа" с недавней датой, то нужно писать коробки в первоначальный этап
	ДатаПоследнегоБланка = ПолучитьДатуПоследнегоБланкаЭтапаПоЗаказу(Лико_Дополнительно.НайтиЗаказКлиентаПоЭтапу(ЭтапСсылка));
	// --> Начало Лико Ефимов ЕВВ 15.01.2026 Сравним не месяц, а квартал
	СравниваемаяДата = КонецКвартала(Макс(МинДатаПроизводства, ДатаПоследнегоБланка));
	
	ДатаНачалаДня = НачалоДня(Дата);
	// Если с момента производства первой коробки прошло больше 25 дней и уже наступил следующий месяц, то будем искать другой этап (общий на весь месяц для таких случаев)
	Если СравниваемаяДата < ДатаНачалаДня - Справочники.Лико_ПредопределенныеЗначения.КоличествоДнейСМоментаПервогоВыпускаДоМоментаВыпускаЧерезОбщийЭтап.ЗначениеПараметра*86400 Тогда
		ЭтапСсылка = Лико_Дополнительно.НайтиИлиСоздатьОбщийВыпускающийЭтапНаМесяц(Организация, Дата, Подразделение, Содержимое[0].Серия.Лико_ХарактеристикаВладелец, ЯчейкаПолучатель.Владелец);		
	КонецЕсли;
					
КонецПроцедуры

Функция УдалитьОднуСериюИзФормированияПаллета(СерияДляУдаления) Экспорт
	
	Если Содержимое.Найти(СерияДляУдаления, "Серия") = Неопределено Тогда
		Сообщить("Серии """ + СерияДляУдаления + """ нет в документе """ + Ссылка + """");
		Возврат Ложь;
	КонецЕсли;
	ТекущийЗаказ = СерияДляУдаления.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Серия КАК Серия
	|ПОМЕСТИТЬ ВТ_ТаблицаСгруппирована
	|ИЗ
	|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|	И Т.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры = &Заказ
	|	И Т.Серия <> &Серия
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК ЗаказКлиента,
	|	ПОДСТРОКА(ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Номер, 5, 7) КАК НомерЗаказа,
	|	ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Номенклатура,
	|	ВТ_ТаблицаСгруппирована.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
	|	ВТ_ТаблицаСгруппирована.Серия КАК Серия,
	|	ВТ_ТаблицаСгруппирована.Серия.Лико_КоличествоВУпаковке КАК КоличествоВУпаковке
	|ПОМЕСТИТЬ ВТ_ДанныеСЗаказом
	|ИЗ
	|	ВТ_ТаблицаСгруппирована КАК ВТ_ТаблицаСгруппирована
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСЗаказом.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ДанныеСЗаказом.НомерЗаказа КАК НомерЗаказа,
	|	ВТ_ДанныеСЗаказом.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеСЗаказом.Характеристика КАК Характеристика,
	|	ВТ_ДанныеСЗаказом.Серия КАК Серия,
	|	ВТ_ДанныеСЗаказом.КоличествоВУпаковке КАК КоличествоВУпаковке
	|ИЗ
	|	ВТ_ДанныеСЗаказом КАК ВТ_ДанныеСЗаказом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСЗаказом.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ДанныеСЗаказом.НомерЗаказа КАК НомерЗаказа,
	|	ВТ_ДанныеСЗаказом.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеСЗаказом.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ДанныеСЗаказом.КоличествоВУпаковке) КАК КоличествоВУпаковке
	|ИЗ
	|	ВТ_ДанныеСЗаказом КАК ВТ_ДанныеСЗаказом
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеСЗаказом.ЗаказКлиента,
	|	ВТ_ДанныеСЗаказом.НомерЗаказа,
	|	ВТ_ДанныеСЗаказом.Номенклатура,
	|	ВТ_ДанныеСЗаказом.Характеристика
	|ИТОГИ
	|	СУММА(КоличествоВУпаковке)
	|ПО
	|	ЗаказКлиента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Заказ", ТекущийЗаказ);
	Запрос.УстановитьПараметр("Серия", СерияДляУдаления);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСерии = РезультатыЗапроса[РезультатыЗапроса.Количество()-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЗаказ = РезультатыЗапроса[РезультатыЗапроса.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Заказ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Номенклатура");
	
	ОтключитьЧастьПроверок = Неопределено;
	ДополнительныеСвойства.Свойство("ОтключитьЧастьПроверок", ОтключитьЧастьПроверок);
	ОтключитьЧастьПроверок = ?(ОтключитьЧастьПроверок = Неопределено, Ложь, ОтключитьЧастьПроверок);
	
	НачатьТранзакцию();
	// Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
	// + искать будем с отбором по заказу серии
	КлючиСтруктурыБезЭтапа = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "ЭтапПроизводства2_2");
	Отбор = Новый Структура("Заказ", ТекущийЗаказ);
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина, Отбор, КлючиСтруктурыБезЭтапа, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Удалим из этапа строки выпуска, соответствующие этому формированию паллета
	// + заказу серии
	Результат = Лико_Дополнительно.УдалитьИзЭтаповСтрокиВыпускаПоСвязанномуФормированиюПаллета(Ссылка, Новый Структура("Лико_НеРассчитыватьНормативныйГрафик", Истина), ТекущийЗаказ);
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;
		
	Если ВыборкаЗаказ.Следующий() Тогда
		
		// Еще остались серии по этому заказу
		
		ОтборТиповыхДокументов = Новый Структура("Заказ", ВыборкаЗаказ.ЗаказКлиента); 
		СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(,ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
		Если СтруктураТиповыхДокументов = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		//Создаем этап для заказа на выпуск продукции
		НовыйЭтапСсылка = СоздатьЭтап(ВыборкаЗаказ, СтруктураТиповыхДокументов.ЭтапПроизводства2_2);
		Если НовыйЭтапСсылка = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		//Создаем передачу продукции на склад
		НовыйДокументПередачаНаСкладСсылка = СоздатьПередачуПродукции(НовыйЭтапСсылка, ВыборкаЗаказ.ЗаказКлиента, СтруктураТиповыхДокументов.ДвижениеПродукцииИМатериалов);
		Если НовыйДокументПередачаНаСкладСсылка = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		//Создаем приходный ордер - тут уже будут серии
		НовыйДокументПриходныйОрдерСсылка = Неопределено;
		Если ЯчейкаПолучатель.ТипСкладскойЯчейки = Перечисления.ТипыСкладскихЯчеек.Приемка Тогда
			Приемка = ЯчейкаПолучатель;
		Иначе
			Приемка = Лико_Дополнительно.ПолучитьЗонуПриемкиПоСкладу(ЯчейкаПолучатель.Владелец);
		КонецЕсли;
		
		НовыйДокументПриходныйОрдерСсылка = СоздатьПриходныйОрдер(НовыйЭтапСсылка, ВыборкаСерии, Приемка, СтруктураТиповыхДокументов.ПриходныйОрдерНаТовары);
		Если НовыйДокументПриходныйОрдерСсылка = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ЯчейкаПолучатель <> Приемка Тогда
			НовыйДокументРазмещениеТоваровСсылка = Лико_Дополнительно.СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(НовыйДокументПриходныйОрдерСсылка, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Размещение, ЯчейкаПолучатель);
			Если НовыйДокументРазмещениеТоваровСсылка = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		МассивТиповыхДокументов = Новый Массив;
		МассивТиповыхДокументов.Добавить(НовыйЭтапСсылка);
		МассивТиповыхДокументов.Добавить(НовыйДокументПередачаНаСкладСсылка);
		МассивТиповыхДокументов.Добавить(НовыйДокументПриходныйОрдерСсылка);
		МассивТиповыхДокументов.Добавить(НовыйДокументРазмещениеТоваровСсылка);
		Для каждого Строка из МассивТиповыхДокументов Цикл
			НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
			НоваяСтрока.Документ = Строка;
			НоваяСтрока.Заказ = ВыборкаЗаказ.ЗаказКлиента;
		КонецЦикла;
		
	Иначе
		// В документе не осталось серий по текущему заказу
		а=0;
	КонецЕсли;

	//Запишем типовые документы в регистр ЛикоСвязиСТиповымиДокументами
	Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка, ТекущийЗаказ);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Удаляем серию из Содержимого
	Содержимое.Удалить(Содержимое.Найти(СерияДляУдаления, "Серия"));
	
	// Проводим документ с доп. свойством ПровестиТолькоПоРегиструАдресноеХранение
	ДополнительныеСвойства.Вставить("ПровестиТолькоПоРегиструАдресноеХранение", Истина);
	Если Содержимое.Количество() = 0 Тогда
		// Удаляем документ
		ПометкаУдаления = Истина;
		ЭтотОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Иначе
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

	ЗафиксироватьТранзакцию();
	Возврат Истина;	
	
КонецФункции

Функция ДанныеЗаполненияДляМодификацииЦепочки(ВыпускающийЭтап, Распоряжение, Потребность = Неопределено)

	ОбщиеРеквизиты = СтрСоединить(Документы.ЭтапПроизводства2_2.ОбщиеРеквизитыЦепочкиЭтапов(),",");
	ЗначенияЗаполнения = Новый Структура(ОбщиеРеквизиты);
	
	ЗначенияЗаполнения.Вставить("НомерПартииЗапуска");
	ЗначенияЗаполнения.Вставить("НомерЭтапаВПартииЗапуска");
	
	ВыходныеИзделия = УправлениеПроизводством.СтруктураДанныхИзделияЭтапа();
	
	Если ЗначениеЗаполнено(ВыпускающийЭтап) Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	МАКСИМУМ(ЭтапПроизводства22.НомерЭтапаВПартииЗапуска) КАК НомерЭтапаВПартииЗапуска
			|ПОМЕСТИТЬ ВТНомерЭтапаВПартииЗапуска
			|ИЗ
			|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства22
			|ГДЕ
			|	ЭтапПроизводства22.ИдентификаторЦепочки = &ИдентификаторЦепочки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	" + ОбщиеРеквизиты + ",
			|
			|	ЭтапПроизводства22.НомерПартииЗапуска                                КАК НомерПартииЗапуска,
			|	ЕСТЬNULL(ВТНомерЭтапаВПартииЗапуска.НомерЭтапаВПартииЗапуска, 0) + 1 КАК НомерЭтапаВПартииЗапуска
			|
			|ИЗ
			|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства22
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомерЭтапаВПартииЗапуска КАК ВТНомерЭтапаВПартииЗапуска
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ЭтапПроизводства22.Ссылка = &ИдентификаторЦепочки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыходныеИзделия.*,
			|	ВЫБОР
			|		КОГДА ВыходныеИзделия.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
			|				И ВыходныеИзделия.ЭтапПотребитель = ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)
			|				И ВыходныеИзделия.Назначение      = ВыходныеИзделия.Ссылка.НазначениеМатериалы
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК СнятьОбособление
			|ИЗ
			|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделия
			|ГДЕ
			|	ВыходныеИзделия.Ссылка = &ИдентификаторЦепочки");
		
		Запрос.УстановитьПараметр("ИдентификаторЦепочки", ВыпускающийЭтап);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// ЗначенияЗаполнения
		Выборка = РезультатыЗапроса[1].Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Выборка);
		
		// ВыходныеИзделия
		Выборка = РезультатыЗапроса[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.СнятьОбособление Тогда
				ЗаполнитьЗначенияСвойств(ВыходныеИзделия.Добавить(), Выборка,,"Назначение");
			Иначе
				ЗаполнитьЗначенияСвойств(ВыходныеИзделия.Добавить(), Выборка);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		// ЗначенияЗаполнения
		ЗначенияЗаполнения.Распоряжение = Распоряжение;
		
		ЗначенияЗаполнения.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
		ЗначенияЗаполнения.Запланировано = 1;
		
		ЗначенияЗаполнения.НомерПартииЗапуска = НомераПартийЗапуска(Распоряжение).Получить(Распоряжение);
		ЗначенияЗаполнения.НомерЭтапаВПартииЗапуска = 1;
		
		Если Тип(Потребность) = Тип("Структура") Тогда
			
			КлючСхемы = УправлениеПроизводствомКлиентСервер.КлючСхемыОбособления();
				КлючСхемы.Распоряжение = Потребность.Распоряжение;
				КлючСхемы.Назначение   = Потребность.Назначение;
			СхемаОбособления = Документы.ЗаказНаПроизводство2_2.СхемаОбособленияПоКлючу(КлючСхемы);
			
			ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, СхемаОбособления);
			
			// ВыходныеИзделия
			НоваяСтрока = ВыходныеИзделия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Потребность);
	
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, Новый Структура("ПересчитатьКоличествоУпаковок"), Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ОбщиеРеквизиты", ОбщиеРеквизиты);
	Результат.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Результат.Вставить("ВыходныеИзделия", ВыходныеИзделия);
	Возврат Результат;
	
КонецФункции

Функция НомераПартийЗапуска(Распоряжения)
	
	Результат = Новый Соответствие;
	Если ТипЗнч(Распоряжения) = Тип("Массив") Тогда
		Для каждого Ссылка Из Распоряжения Цикл
			Результат.Вставить(Ссылка, 1);
		КонецЦикла;
	Иначе
		Результат.Вставить(Распоряжения, 1);
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Распоряжение                 КАК Распоряжение,
		|	МАКСИМУМ(Т.НомерПартииЗапуска) КАК НомерПартииЗапуска
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК Т
		|ГДЕ
		|	Т.Распоряжение В (&Распоряжения)
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Распоряжение");
		
	Запрос.УстановитьПараметр("Распоряжения", Распоряжения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить(Выборка.Распоряжение, Выборка.НомерПартииЗапуска + 1);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуПоследнегоБланкаЭтапаПоЗаказу(Заказ)
	
	ДатаБланка = Дата(1,1,1);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_БланкЭтапа.Дата КАК Дата
		|ИЗ
		|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
		|		ПО Лико_БланкЭтапа.Ссылка = ДвижениеПродукцииИМатериалов.Лико_Документ
		|			И (ДвижениеПродукцииИМатериалов.Проведен
		|				И НЕ ДвижениеПродукцииИМатериалов.ПометкаУдаления)
		|ГДЕ
		|	Лико_БланкЭтапа.Проведен
		|	И НЕ Лико_БланкЭтапа.ПометкаУдаления
		|	И Лико_БланкЭтапа.ЗаказПокупателя = &ЗаказПокупателя
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаБланка = ВыборкаДетальныеЗаписи.Дата;
	КонецЕсли;
	
	Возврат ДатаБланка;
	
КонецФункции

Функция ПолучитьДокументыВыпускаПоДанномуРаспоряжениюНаРастарку()
	
	Если НЕ ЗначениеЗаполнено(РаспоряжениеНаРастарку) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка КАК Ссылка,
		|	СУММА(1) КАК КоличествоКоробокРастарки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета.СодержимоеРастарки КАК Лико_ФормированиеПаллетаСодержимоеРастарки
		|ГДЕ
		|	Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка.Проведен
		|	И Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка.РаспоряжениеНаРастарку = &РаспоряжениеНаРастарку
		|	И Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка.ВыпускИзРастарки
		|	И Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка <> &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ФормированиеПаллетаСодержимоеРастарки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.КоличествоКоробокРастарки КАК КоличествоКоробокРастарки,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_СвязиСТиповымиДокументами.ТиповойДокумент) КАК КоличествоСборок
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
		|		ПО (ВТ.Ссылка = (ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ФормированиеПаллета)))
		|			И (Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.СборкаТоваров)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Ссылка,
		|	ВТ.КоличествоКоробокРастарки";
	
	Запрос.УстановитьПараметр("РаспоряжениеНаРастарку", РаспоряжениеНаРастарку);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуСерийПоРаспоряжениюНаРастаркуВсеЕщеЛежащихВРастарке(ОпределеннаяСерия = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПеремещениеПаллетаСодержимое.Серия КАК Серия
		|ПОМЕСТИТЬ ВТ_СерииИзРаспоряжения
		|ИЗ
		|	Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
		|ГДЕ
		|	Лико_ПеремещениеПаллетаСодержимое.Ссылка = &РаспоряжениеНаРастарку
		|	И ВЫБОР
		|			КОГДА &ОпределеннаяСерия = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Лико_ПеремещениеПаллетаСодержимое.Серия = &ОпределеннаяСерия
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Партнер КАК Партнер,
		|	ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
		|	ВЫРАЗИТЬ(ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
		|	ВТ_СерииИзРаспоряжения.Серия КАК Серия,
		|	КОЛИЧЕСТВО(ТоварыВЯчейкахОстатки.Серия) КАК Серия1,
		|	МАКСИМУМ(ТоварыВЯчейкахОстатки.ВНаличииОстаток) КАК Количество
		|ИЗ
		|	ВТ_СерииИзРаспоряжения КАК ВТ_СерииИзРаспоряжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				Серия В
		|						(ВЫБРАТЬ
		|							Т.Серия
		|						ИЗ
		|							ВТ_СерииИзРаспоряжения КАК Т)
		|					И Ячейка = &ЯчейкаРастарка) КАК ТоварыВЯчейкахОстатки
		|		ПО ВТ_СерииИзРаспоряжения.Серия = ТоварыВЯчейкахОстатки.Серия
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СерииИзРаспоряжения.Серия,
		|	ВЫРАЗИТЬ(ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура),
		|	ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец,
		|	ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры,
		|	ВТ_СерииИзРаспоряжения.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Партнер";
	
	Запрос.УстановитьПараметр("РаспоряжениеНаРастарку", РаспоряжениеНаРастарку);
	Запрос.УстановитьПараметр("ЯчейкаРастарка", ЯчейкаРастарка);
	Запрос.УстановитьПараметр("ОпределеннаяСерия", ОпределеннаяСерия);
	
	ТаблицаСерий = Запрос.Выполнить().Выгрузить();
	ТаблицаСерий.Колонки.Добавить("Списано", Новый ОписаниеТипов("Булево"));
	ТаблицаСерий.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,0)));
	ТаблицаСерий.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15,3)));
	ТаблицаСерий.Колонки.Добавить("СтатусУказанияСерий", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1,0)));
	ТаблицаСерий.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	НомерСтроки = 0;
	УпаковкаПоУмолчанию = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Для каждого Строка из ТаблицаСерий Цикл
		НомерСтроки = НомерСтроки + 1;
		Строка.НомерСтроки = НомерСтроки;
		Строка.КоличествоУпаковок = Строка.Количество;
		Строка.СтатусУказанияСерий = 8;
		Строка.Упаковка = УпаковкаПоУмолчанию;
	КонецЦикла;
	Возврат ТаблицаСерий;
	
КонецФункции

Функция СформироватьДеревоВыпуска()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Партнер КАК Партнер,
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
		|	ВЫРАЗИТЬ(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
		|	Лико_ФормированиеПаллетаСодержимое.Серия КАК Серия,
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке КАК Количество,
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке КАК КоличествоУпаковок,
		|	8 КАК СтатусУказанияСерий,
		|	&УпаковкаПоУмолчанию КАК Упаковка
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|ГДЕ
		|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Серия),
		|	СУММА(Количество),
		|	СУММА(КоличествоУпаковок)
		|ПО
		|	Номенклатура,
		|	Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("УпаковкаПоУмолчанию", Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра);
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоВыпуска = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ДеревоВыпуска.Колонки.Добавить("НайденаПара", Новый ОписаниеТипов("Булево"));
	ДеревоВыпуска.Колонки.Добавить("РастариваемыеСтроки", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1000)));
	ДеревоВыпуска.Колонки.Добавить("КоличествоНайденныхКоробок", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10,0)));
	Возврат ДеревоВыпуска;
	
КонецФункции

Процедура ОбработатьНайденныеДляРастаркиСтроки(СтрокаВыпуска, СтрокиРастарки, ДобавитьВсеСтроки = Ложь)
	
	Если СтрокиРастарки.Количество() > 0 Тогда
		// Такие коробки есть
		КоличествоОсталосьСписать = СтрокаВыпуска.Количество;
		Для каждого СтрокаРастарки Из СтрокиРастарки Цикл
			Если КоличествоОсталосьСписать <= 0 И НЕ ДобавитьВсеСтроки Тогда
				// Хватит
				Прервать;
			КонецЕсли;
			// Поставим строке выпуска признак найденной пары, а строке растарки признак "Списано"
			СтрокаВыпуска.НайденаПара = Истина;
			СтрокаВыпуска.РастариваемыеСтроки = СтрокаВыпуска.РастариваемыеСтроки + ?(ЗначениеЗаполнено(СтрокаВыпуска.РастариваемыеСтроки), ",", "") + СтрокаРастарки.НомерСтроки;
			СтрокаВыпуска.КоличествоНайденныхКоробок = СтрокаВыпуска.КоличествоНайденныхКоробок + 1;
			СтрокаРастарки.Списано = Истина;
			КоличествоОсталосьСписать = КоличествоОсталосьСписать - СтрокаРастарки.Количество;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьСборкуТоваров(УжеСозданныйДокумент, СтрокаВыпуска, ТаблицаДляРастаркиСвернута, НужнаРазборкаНераспределенныхВыпусков = Ложь, ДеревоВыпуска = Неопределено, ТаблицаСерийВыпуска)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.СборкаТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Количество = СтрокаВыпуска.Количество;
	НовыйДокОбъект.КоличествоУпаковок = НовыйДокОбъект.Количество;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Номенклатура = СтрокаВыпуска.Номенклатура;
	НовыйДокОбъект.Организация = Организация; // Подумать про икс-пак
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Характеристика = СтрокаВыпуска.Характеристика;
	НовыйДокОбъект.Склад = ЯчейкаПолучатель.Владелец;
	НовыйДокОбъект.ДатаРаспоряжения = Дата;
	НовыйДокОбъект.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	НовыйДокОбъект.СборкаПодДеятельность = Справочники.Организации.НалогообложениеНДС(НовыйДокОбъект.Организация, НовыйДокОбъект.Склад, Дата);
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	НовыйДокОбъект.Подразделение = Подразделение;
	НовыйДокОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	
	Для каждого Строка из ТаблицаДляРастаркиСвернута Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
	КонецЦикла;
	
	Для каждого СтрокаСерия из СтрокаВыпуска.Строки Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСерийВыпуска.Добавить(), СтрокаСерия);
	КонецЦикла;
	
	Если НужнаРазборкаНераспределенныхВыпусков И ТаблицаДляРастаркиСвернута.Количество() = 1 Тогда
		// Сбросим флаг
		НужнаРазборкаНераспределенныхВыпусков = Ложь;
		// Поменяем местами товары из ТЧ и из тела
		ПеределатьСборкуВРазборку(НовыйДокОбъект);
		// Добавим все выпуски, для которых не найдена пара
		Для каждого СтрокаНоменклатура из ДеревоВыпуска.Строки Цикл
			Для каждого СтрокаХарактеристика из СтрокаНоменклатура.Строки Цикл
				
				Если СтрокаХарактеристика.НайденаПара Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
				НоваяСтрока.Номенклатура = СтрокаХарактеристика.Номенклатура;
				НоваяСтрока.Характеристика = СтрокаХарактеристика.Характеристика;
				НоваяСтрока.Количество = СтрокаХарактеристика.Количество;
				НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
				НоваяСтрока.ДоляСтоимости = НоваяСтрока.Количество * 1000;

				// Добавим коробки выпуски в таблицу серий выпуска
				Для каждого СтрокаСерия из СтрокаХарактеристика.Строки Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаСерийВыпуска.Добавить(), СтрокаСерия);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		НовыйДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Сообщить(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьСборкуТоваровВер3(УжеСозданныйДокумент, СтрокаВыпуска, ТаблицаДляРастаркиСвернута, НужнаРазборкаНераспределенныхВыпусков = Ложь)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.СборкаТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Количество = СтрокаВыпуска.Количество;
	НовыйДокОбъект.КоличествоУпаковок = НовыйДокОбъект.Количество;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Номенклатура = СтрокаВыпуска.Номенклатура;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Характеристика = СтрокаВыпуска.Характеристика;
	НовыйДокОбъект.Склад = ЯчейкаПолучатель.Владелец;
	ВладелецТовараНаЭтомСкладе = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.Склад, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
	Если НовыйДокОбъект.Склад.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион И НЕ ЗначениеЗаполнено(ВладелецТовараНаЭтомСкладе) Тогда
		// Найдем организацию по регистру ТоварыОрганизаций
		ВладелецТовараНаЭтомСкладе = Лико_Дополнительно.ОпределитьОрганизациюВладельцаТовара(ТаблицаДляРастаркиСвернута[0].Номенклатура, ТаблицаДляРастаркиСвернута[0].Характеристика, НовыйДокОбъект.Склад, НовыйДокОбъект.Дата, УжеСозданныйДокумент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецТовараНаЭтомСкладе) Тогда
		НовыйДокОбъект.Организация = ВладелецТовараНаЭтомСкладе;
	Иначе
		НовыйДокОбъект.Организация = Организация;
	КонецЕсли;
	НовыйДокОбъект.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	НовыйДокОбъект.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	НовыйДокОбъект.Подразделение = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.Склад, "Подразделение_8b6aafc5a2e14ba0889da315170788bd");
	НовыйДокОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	
	Если НужнаРазборкаНераспределенныхВыпусков Тогда
		НужнаРазборкаНераспределенныхВыпусков = Ложь;
		НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров;
	КонецЕсли;
	
	Для каждого Строка из ТаблицаДляРастаркиСвернута Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		Если НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
			НоваяСтрока.ДоляСтоимости = НоваяСтрока.КоличествоУпаковок * 1000;
		КонецЕсли;
	КонецЦикла;
	
	//Если НужнаРазборкаНераспределенныхВыпусков Тогда
	//	// Сбросим флаг
	//	НужнаРазборкаНераспределенныхВыпусков = Ложь;
	//	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров;
	//	// Поменяем местами товары из ТЧ и из тела
	//	//ПеределатьСборкуВРазборку(НовыйДокОбъект);
	//КонецЕсли;
	
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	//Если РольДоступна("ПолныеПрава") Тогда // не помню, зачем делал это только для полных прав. Отключил, т.к. столкнулся с проблемой при выпуске растарки по складу ОКИЛ Спб ОРД
		НовыйДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
	//КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		//Сообщить(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ПеределатьСборкуВРазборку(ДокОбъект)
	
	ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров;
	
	ТЗТовары = ДокОбъект.Товары.Выгрузить();
	
	ДокОбъект.Товары.Очистить();
	НоваяСтрока = ДокОбъект.Товары.Добавить();
	НоваяСтрока.Номенклатура = ДокОбъект.Номенклатура;
	НоваяСтрока.Характеристика = ДокОбъект.Характеристика;
	НоваяСтрока.Количество = ДокОбъект.Количество;
	НоваяСтрока.КоличествоУпаковок = ДокОбъект.Количество;
	НоваяСтрока.ДоляСтоимости = НоваяСтрока.Количество * 1000;
	
	ДокОбъект.Номенклатура = ТЗТовары[0].Номенклатура;
	ДокОбъект.Характеристика = ТЗТовары[0].Характеристика;
	ДокОбъект.Количество = ТЗТовары[0].Количество;
	ДокОбъект.КоличествоУпаковок = ТЗТовары[0].КоличествоУпаковок;
	
КонецПроцедуры

Процедура ЗаполнитьДатыВыпускаВСериях(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Для каждого Строка из Содержимое Цикл
			Если Строка.Серия.Лико_ДатаВыпуска <> Дата Тогда
				СерияОбъект = Строка.Серия.ПолучитьОбъект();
				СерияОбъект.Лико_ДатаВыпуска = Дата;
				Попытка
					СерияОбъект.Записать();
				Исключение
					Сообщить("Не удалось записать дату выпуска в серию """ + СерияОбъект + """: " + ОписаниеОшибки());
					Отказ = Истина;
					Возврат;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;				
	
КонецПроцедуры

Процедура ЗаполнитьВесИПлощадьВНоменклатуру(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец КАК Характеристика
		|ПОМЕСТИТЬ ВТ_ХарактеристикиВыпуска
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|ГДЕ
		|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец,
		|	ВЫРАЗИТЬ(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ХарактеристикиВыпуска.Номенклатура КАК Номенклатура,
		|	ВТ_ХарактеристикиВыпуска.Характеристика КАК Характеристика,
		|	СУММА(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке) КАК Количество,
		|	СУММА(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ВесКоробки) КАК Вес
		|ПОМЕСТИТЬ ВТ_ХарактристикиВыпускаСКоличествомИВесом
		|ИЗ
		|	ВТ_ХарактеристикиВыпуска КАК ВТ_ХарактеристикиВыпуска
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|		ПО (Лико_ФормированиеПаллетаСодержимое.Ссылка.Проведен)
		|			И (НЕ Лико_ФормированиеПаллетаСодержимое.Ссылка.ПометкаУдаления)
		|			И (Лико_ФормированиеПаллетаСодержимое.Ссылка.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции))
		|			И ВТ_ХарактеристикиВыпуска.Характеристика = Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ХарактеристикиВыпуска.Характеристика,
		|	ВТ_ХарактеристикиВыпуска.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура КАК Номенклатура,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика КАК Характеристика,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ВесЗнаменатель КАК НоменклатураВесЗнаменатель,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ВесЧислитель КАК НоменклатураВесЧислитель,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ВесИспользовать КАК НоменклатураВесИспользовать,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ПлощадьИспользовать КАК НоменклатураПлощадьИспользовать,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ПлощадьЧислитель КАК НоменклатураПлощадьЧислитель,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ПлощадьЗнаменатель КАК НоменклатураПлощадьЗнаменатель,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ПлощадьЕдиницаИзмерения КАК НоменклатураПлощадьЕдиницаИзмерения,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК НоменклатураКоэффициентЕдиницыДляОтчетов,
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом.Номенклатура.ЕдиницаДляОтчетов КАК НоменклатураЕдиницаДляОтчетов,
		|	ВЫРАЗИТЬ(ВТ_ХарактристикиВыпускаСКоличествомИВесом.Вес / ВТ_ХарактристикиВыпускаСКоличествомИВесом.Количество КАК ЧИСЛО(15, 3)) КАК ВесЗаТысШтИзСерийЭтогоЗаказа,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика.Лико_ЗаказНоменклатуры.Тираж = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика.Лико_ЗаказНоменклатуры.МетражКВМ / ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика.Лико_ЗаказНоменклатуры.Тираж
		|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК ПлощадьЗаТысШтИзПараметровЗаказа,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика.Лико_ЗаказНоменклатуры.МетражКВМ = 0
		|					ИЛИ ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика.Лико_ЗаказНоменклатуры.Тираж = 0
		|				ТОГДА 0
		|			ИНАЧЕ 1 / (ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика.Лико_ЗаказНоменклатуры.МетражКВМ / ВТ_ХарактристикиВыпускаСКоличествомИВесом.Характеристика.Лико_ЗаказНоменклатуры.Тираж)
		|		КОНЕЦ КАК ЧИСЛО(15, 5)) КАК КоэффициентЕдиницыДляОтчетовИзПараметровЗаказа
		|ИЗ
		|	ВТ_ХарактристикиВыпускаСКоличествомИВесом КАК ВТ_ХарактристикиВыпускаСКоличествомИВесом";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		ЕдИзмВеса = Справочники.Лико_ПредопределенныеЗначения.ЕИКг.ЗначениеПараметра;
		ЕдИзмПлощади = Справочники.Лико_ПредопределенныеЗначения.ЕИКвадрМетр.ЗначениеПараметра;
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.НоменклатураВесЕдиницаИзмерения <> ЕдИзмВеса
				ИЛИ Выборка.НоменклатураВесЗнаменатель <> 1
				ИЛИ Выборка.НоменклатураВесЧислитель <> Выборка.ВесЗаТысШтИзСерийЭтогоЗаказа
				ИЛИ НЕ Выборка.НоменклатураВесИспользовать
				ИЛИ НЕ Выборка.НоменклатураПлощадьИспользовать
				ИЛИ Выборка.НоменклатураПлощадьЧислитель <>  Выборка.ПлощадьЗаТысШтИзПараметровЗаказа
				ИЛИ Выборка.НоменклатураПлощадьЗнаменатель <> 1
				ИЛИ Выборка.НоменклатураПлощадьЕдиницаИзмерения <> ЕдИзмПлощади
				ИЛИ Выборка.НоменклатураКоэффициентЕдиницыДляОтчетов <> Выборка.КоэффициентЕдиницыДляОтчетовИзПараметровЗаказа
				ИЛИ Выборка.НоменклатураЕдиницаДляОтчетов <> ЕдИзмПлощади
				Тогда
				НоменклатураОбъект = Выборка.Номенклатура.ПолучитьОбъект();
				НоменклатураОбъект.ВесЕдиницаИзмерения = ЕдИзмВеса;
				НоменклатураОбъект.ВесЗнаменатель = 1;
				НоменклатураОбъект.ВесЧислитель = Выборка.ВесЗаТысШтИзСерийЭтогоЗаказа;
				НоменклатураОбъект.ВесИспользовать = Истина;
				НоменклатураОбъект.ПлощадьИспользовать = Истина;
				НоменклатураОбъект.ПлощадьЧислитель = Выборка.ПлощадьЗаТысШтИзПараметровЗаказа;
				НоменклатураОбъект.ПлощадьЗнаменатель = 1;
				НоменклатураОбъект.ПлощадьЕдиницаИзмерения = ЕдИзмПлощади;
				НоменклатураОбъект.ЕдиницаДляОтчетов = ЕдИзмПлощади;
				НоменклатураОбъект.КоэффициентЕдиницыДляОтчетов = Выборка.КоэффициентЕдиницыДляОтчетовИзПараметровЗаказа;
				Попытка
					НоменклатураОбъект.Записать();
				Исключение
					Сообщить("Не удалось записать площадь или вес в номенклатуру """ + НоменклатураОбъект + """: " + ОписаниеОшибки());
					Отказ = Истина;
					Возврат;
				КонецПопытки;			
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;				
	
КонецПроцедуры

Процедура ИзменитьСтатусЗаказаНаВыполнен(Заказ)
	
	УстановитьПривилегированныйРежим(Истина);
	Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра ИЛИ Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра Тогда
		Если Заказ.Состояние <> Перечисления.Лико_СостоянияЗаказов.Выполнен И Заказ.Состояние <> Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда 
			ЗаказОбъект = Заказ.ПолучитьОбъект();
			ЗаказОбъект.Состояние = Перечисления.Лико_СостоянияЗаказов.Выполнен;
			Попытка 
				ЗаказОбъект.ОбменДанными.Загрузка=Истина;
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение				
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Дата = ОбъектКопирования.Дата;
	Комментарий = "";
	СодержимоеРастарки.Очистить();
	СозданНаОснованииПолученияГПИзПроизводства = Ложь;
КонецПроцедуры

КоличествоЗаказовКоторыеПишутВОбщийЭтап = 0;

КлючиСтруктуры =	"ОтборРазмещениеТоваров_Размещение,
					|ОтборРазмещениеТоваров_Перемещение,
					|ОтборРазмещениеТоваров_Отбор,
					|РасходныйОрдерНаТовары,
					|ПриходныйОрдерНаТовары,
					|СборкаТоваров,
					|КорректировкаРегистров,
					|ДвижениеПродукцииИМатериалов,
					|ПеремещениеТоваров,
					|ЭтапПроизводства2_2";
