&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+ Лико m.shenderov 26.01.2022
	Список.ТекстЗапроса=ПолучитьТекстЗапросаСпискаЗаказовСервер();
	//- Лико m.shenderov 26.01.2022
	
	Если РольДоступна("Лико_ЗаказыКлиентов") Тогда 
		Элементы.ГруппаПеределки.Видимость = Ложь;
	КонецЕсли;	
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьАннулированные", ЛОжь);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если Не  Пользователь.Лико_ПоказыватьЦеныВЗаказе Тогда 
		Элементы.Цена.Видимость = Ложь;
		Элементы.Валюта.Видимость = Ложь;
		Элементы.ЦенаДляДокументов.Видимость = Ложь;
		Элементы.СуммаДокумента.Видимость = Ложь;
		Элементы.Доходность.Видимость = Ложь;
		Элементы.Доход.Видимость = Ложь;
		Элементы.Рентабельность.Видимость = Ложь;

	КонецЕсли;
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПеределкаНаСервере(Заказ)
	КлючПеределки = Лико_Планирование.СоздатьПеределкуНаСервере(Заказ);
	Возврат КлючПеределки;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗаказПоНомеру(Номер)
	Заказ = Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса", Номер);
	Возврат Заказ;
КонецФункции

&НаКлиенте
Процедура ОтборПартнерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Партнер", Партнер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Партнер));
КонецПроцедуры

&НаКлиенте
Процедура ОтборПартнерОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭтикеткиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Этикетки", Этикетки, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(Этикетки));

КонецПроцедуры

&НаКлиенте
Процедура ОтборЭтикеткиОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Этикетки) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборРабочийЦентрПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "РабочийЦентр", Рабочийцентр, ВидСравненияКомпоновкиДанных.ВИерархии,, ЗначениеЗаполнено(РабочийЦентр));
КонецПроцедуры

&НаКлиенте
Процедура ОтборРабочийЦентрОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(РабочийЦентр) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборШтампВырубнойПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ШтампВырубной", ШтампВырубной, ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(СокрЛП(ШтампВырубной)));
КонецПроцедуры

&НаКлиенте
Процедура ОтборШтампВырубнойОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ШтампВырубной) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеределку(Команда)
	текстр = Элементы.Список.ТекущиеДанные;
	Если Элементы.Найти("Заказ")<>Неопределено Тогда 
		Если текстр<>Неопределено Тогда 
			Заказ = текстр.Ссылка;
			ИдентификаторПеределки = ПеределкаНаСервере(Заказ);		
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ",Заказ);
			ПараметрыФормы.Вставить("Идентификатор",ИдентификаторПеределки);	
			ПараметрыФормы.Вставить("УбратьЦветоделение",Истина);	
			ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаЗаявкиНаЦветоделение", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура АннулироватьЗаказНаСервере(Заказ)     
	Если Лико_Планирование.ЕстьЭтапыНеДоПечати(Заказ) И Не (РольДоступна("Лико_ИзменениеВыполненныхЗаказов") ИЛИ РольДоступна("ПолныеПрава")) Тогда 
		Сообщить("Заказ передавался в печать и не может быть аннулирован");
	Иначе
		Лико_Планирование.АннулироватьЗаказ(Заказ);                                                                     
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьЗаказ(Команда)
	текстр = Элементы.Список.ТекущиеДанные;
	Если Элементы.Найти("Заказ")<>Неопределено Тогда 
		Если текстр<>Неопределено Тогда 
			Режим = РежимДиалогаВопрос.ДаНет;
			ДопПараметры = Новый Структура("Заказ", текстр.Ссылка);
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбАнулировании", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Вы уверены, что хотите аннулировать заказ??'"), Режим,0);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбАнулировании(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		АннулироватьЗаказНаСервере(Параметры.Заказ);
		// --> Начало Лико Ефимов ЕВВ 09.06.2021 
		Элементы.Список.Обновить();
		// <-- Конец Лико Ефимов ЕВВ 09.06.2021 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАннулированныеПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьАннулированные",ПоказыватьАннулированные);
	Элементы.Список.Обновить();
	ОбновитьИнтерфейс();

КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Номер) Тогда 
		Заказ =  ПолучитьЗаказПоНомеру(Номер);
		Если ЗначениеЗаполнено(Заказ) Тогда 
			Элементы.Список.ТекущаяСтрока =  Заказ;
			// --> Начало Лико Ефимов ЕВВ 10.10.2018 
			ЭтаФорма.ТекущийЭлемент = Элементы.Номер;
			// <-- Конец Лико Ефимов ЕВВ 10.10.2018 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЦветоделение(Команда)
	текстр = Элементы.Список.ТекущиеДанные;
	Если Элементы.Найти("Заказ")<>Неопределено Тогда 
		Если текстр<>Неопределено Тогда 
			Заказ = текстр.Ссылка;
			ПараметрыФормы    = новый Структура("Заказ", Заказ);
			ОткрытьФорму("РегистрСведений.Лико_Цветоделение.ФормаСписка", ПараметрыФормы,,,,,,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСостояниеЗаказа(Команда) // --> Начало Лико Ефимов ЕВВ 31.05.2018
	
	Если НЕ ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		Сообщить("Сначала выберите заказ.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("ЗаказКлиента", Элементы.Список.ТекущаяСтрока));
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "Лико_СостояниеЗаказа");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета,, Новый УникальныйИдентификатор);

КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 31.05.2018

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ПеренестиЗаказИзУППНаСервере(НомерЗаказа)
	 Лико_Планирование.ПеренестиЗаказИзУПП(НомерЗаказа)
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиЗаказИзУПП(Команда)
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПеренестиЗаказИзУППВыбранНомер", ЭтотОбъект),, "Введите номер заказа", 7);	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗаказИзУППВыбранНомер(НомерЗаказа, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(НомерЗаказа) И СтрДлина(НомерЗаказа) = 7 Тогда
		 ПеренестиЗаказИзУППНаСервере(НомерЗаказа);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//+ Лико m.shenderov 26.01.2022  
&НаСервере
Функция ПолучитьТекстЗапросаСпискаЗаказовСервер() //+Лико m.shenderov 26.01.2022
	
	Возврат 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	ЗаказКлиентаДок.Дата КАК Дата,
	        	|	ЗаказКлиентаДок.НомерБезПрефикса КАК Номер,
	        	|	ЗаказКлиентаДок.Ссылка КАК Ссылка,
	        	|	ЗаказКлиентаДок.Версия КАК Версия,
	        	|	ЗаказКлиентаДок.ПовторЗаказа.НомерБезПрефикса КАК НомерПовторЗаказа,
	        	|	ЗаказКлиентаДок.Состояние КАК Состояние,
	        	|	ЗаказКлиентаДок.ТипЗаказа КАК ТипЗаказа,
	        	|	ЗаказКлиентаДок.ВидЗаказа КАК ВидЗаказа,
	        	|	ЗаказКлиентаДок.Этикетки КАК Этикетки,
	        	|	ЗаказКлиентаДок.Партнер КАК Партнер,
	        	|	ЗаказКлиентаДок.Тираж КАК Тираж,
	        	|	ЗаказКлиентаДок.ЦенаСредняя КАК Цена,
	        	|	ЗаказКлиентаДок.ЦенаДляДокументовСредняя КАК ЦенаДляДокументов,
	        	|	ЗаказКлиентаДок.Валюта КАК Валюта,
	        	|	ЗаказКлиентаДок.СуммаДокумента КАК СуммаДокумента,
	        	|	ЗаказКлиентаДок.МетражПМ КАК МетражПМ,
	        	|	ЗаказКлиентаДок.МетражКВМ КАК МетражКВМ,
	        	|	ЗаказКлиентаДок.ШтампВырубной.Артикул КАК ШтампВырубной,
	        	|	ЗаказКлиентаДок.ДлинаЭтикетки КАК ДлинаЭтикетки,
	        	|	ЗаказКлиентаДок.ШиринаЭтикетки КАК ШиринаЭтикетки,
	        	|	ЗаказКлиентаДок.Нарезка КАК Нарезка,
	        	|	ЗаказКлиентаДок.ОсновнойМатериал КАК Материал,
	        	|	ЗаказКлиентаДок.ЦветаСтрокой КАК Цвета,
	        	|	ЗаказКлиентаДок.Менеджер КАК Менеджер,
	        	|	ЗаказКлиентаДок.Тиснение КАК Тиснение,
	        	|	ЗаказКлиентаДок.Ламинация КАК Ламинация,
	        	|	ЗаказКлиентаДок.Конгрев КАК Конгрев,
	        	|	ЗаказКлиентаДок.ШтампыСтрокой КАК Штампы,
	        	|	ЗаказКлиентаДок.РабочийЦентр КАК РабочийЦентр,
	        	|	ЗаказКлиентаДок.Площадка КАК Площадка,
	        	|	ЗаказКлиентаДок.СтоимостьОснастки КАК СтоимостьОснастки,
	        	|	ЗаказКлиентаДок.Регион КАК Регион,
	        	|	ЗаказКлиентаДок.НомераКонтрактов КАК НомераКонтрактов,
	        	|	ЗаказКлиентаДок.ФормыСтрокой КАК Формы,
	        	|	ЗаказКлиентаДок.ОригиналМакет КАК ОригиналМакет,
	        	|	ЗаказКлиентаДок.Сканы КАК Сканы,
	        	|	ЗаказКлиентаДок.ДоходностьПлан КАК Доходность,
	        	|	ЗаказКлиентаДок.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузку,
	        	|	ЗаказКлиентаДок.СчетНаПредоплату КАК СчетНаПредоплату,
	        	|	ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.ПустаяСсылка) КАК Этап,
	        	|	"""" КАК КомментарийЭтапа,
	        	|	"""" КАК ПричинаБлокировки,
	        	|	ЗаказКлиентаДок.Артикулы КАК Артикулы,
	        	|	ЗаказКлиентаДок.ДоходПлан КАК Доход,
	        	|	ЗаказКлиентаДок.РентабельностьПлан КАК Рентабельность,
	        	|	ЗаказКлиентаДок.МетражПланКВМ КАК МетражПланКВМ,
	        	|	ЗаказКлиентаДок.МетражПланПМ КАК МетражПланПМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа КАК РезультатЗаказа,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ТиражВыпуск КАК ТиражВыпуск,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.МетражВыпускКВМ КАК МетражВыпускКВМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.МетражФактКВМ КАК МетражФактКВМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ПерерасходКВМ КАК ПерерасходКВМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ОсновнойМатериал КАК ОсновнойМатериал,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ДопМатериалы КАК ДопМатериалы,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Глубокая КАК Глубокая,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Флексо КАК Флексо,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Офсет КАК Офсет,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Трафарет КАК Трафарет,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Инкджет КАК Инкджет,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Индиго КАК Индиго,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Клики КАК Клики,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Оснастка КАК Оснастка,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ФормыЗасветки КАК ФормыЗасветки,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Прочее КАК Прочее,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Упаковка КАК Упаковка,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.СебестоимостьТабаш КАК Себестоимость,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Стоимость КАК Стоимость,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ДоходТабаш КАК ДоходФакт,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.РентабельностьТабаш КАК РентабельностьФакт,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ПроцентОтгрузки КАК ПроцентОтгрузки,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.КоличествоОстаток КАК КоличествоОстаток
	        	|ИЗ
	        	|	Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	        	|ГДЕ
	        	|	ВЫБОР
	        	|			КОГДА &ПоказыватьАннулированные = ЛОЖЬ
	        	|				ТОГДА ЗаказКлиентаДок.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
	        	|			ИНАЧЕ ИСТИНА
	        	|		КОНЕЦ";
			
		
	
КонецФункции  //-Лико m.shenderov 26.01.2022

//- Лико m.shenderov 26.01.2022

 &НаКлиенте
Процедура БлокироватьЗаказ(Команда)
	
	текстр = Элементы.Список.ТекущиеДанные;

	
	Если Элементы.Найти("Заказ") <> Неопределено Тогда 
		
		Если текстр <> Неопределено Тогда  
			
			Если ВозможноЗаблокироватьЗаказ(текстр.Ссылка) Тогда
				
				Режим = РежимДиалогаВопрос.ДаНет;
				ДопПараметры = Новый Структура("Заказ", текстр.Ссылка);
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОБлокировке", ЭтаФорма, ДопПараметры);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Вы уверены, что хотите заблокировать заказ??'"), Режим,0);
				
			Иначе
				Сообщить("Этот заказ нельзя заблокировать");
				
			КонецЕсли;
		
		КонецЕсли;  
		
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозможноЗаблокироватьЗаказ(Заказ)  	

		Возврат НЕ ПлощадкаУрал(Заказ.Площадка) или ПлощадкаСибирь(Заказ.Площадка)   
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОБлокировке(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе         
		
		Если ЗаказВПечати(Параметры.Заказ) Тогда
			Сообщить("Заказ нельзя заблокировать, так как заказ уже в печати");
		    Возврат
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаПричиныБлокировки",   ЭтотОбъект, Параметры.Заказ);
		
		ПоказатьВводСтроки(Оповещение,
		, // пропускаем начальное значение
		"Причина блокировки:",
		0, // (необ.) длина
		Истина // (необ.) многострочность
		);
		
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ЗаказВПечати(Заказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЭтапыЗаказа.Этап КАК Этап
		|ИЗ
		|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
		|ГДЕ
		|	Лико_ЭтапыЗаказа.Заказ = &Заказ
		|	И Лико_ЭтапыЗаказа.Этап.ДоПечати = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина	
	КонецЕсли;
	
    Возврат Ложь
	
КонецФункции   

Функция БылЭтапПроизводство(Заказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЭтапыЗаказа.Этап КАК Этап
		|ИЗ
		|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
		|ГДЕ
		|	Лико_ЭтапыЗаказа.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Этап");
	
	Возврат РезультатЗапроса.Найти(Справочники.Лико_ЭтапыВыполненияЗаказа.Производство) <> Неопределено 
	
КонецФункции


&НаСервере
Процедура БлокироватьЗаказНаСервере(Заказ, Причина)
	
	Запись = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
	
	Запись.Период 			 = ТекущаяДата();
	Запись.Заказ 			 = Заказ;
	Запись.Этап 			 = справочники.Лико_ЭтапыВыполненияЗаказа.Заблокирован;	
	Запись.Площадка 		 = Заказ.Площадка;
	Запись.Ответственный 	 = Заказ.Ответственный;
	Запись.ПричинаБлокировки = Справочники.Лико_ПричиныБлокировки.НайтиПоНаименованию("Приостановлен");
	Запись.Комментарий		 = Причина;
	//
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	ЗаказОбъект.Заблокирован = Истина;
	ЗаказОбъект.Состояние	 = Перечисления.Лико_СостоянияЗаказов.Заблокирован;
	
	Попытка 
		ЗаказОбъект.ОбменДанными.Загрузка = Истина;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись,);
	Исключение
	КонецПопытки;  
	
	Если Заказ.Площадка = Справочники.Лико_Площадки.Ликофлекс Тогда 
		СписокПолучателей = "OPP@okil-sato.ru";
		
		Если БылЭтапПроизводство(Заказ) Тогда  
			СписокПолучателей = СписокПолучателей + "; alazarev@okil-sato.ru; otokarenko@okil-sato.ru; apodegrad@okil-sato.ru; dpetrov@okil-sato.ru"
		КонецЕсли;
		
		Лико_Планирование.ОтправитьПисьмо("", СтрШаблон( "%1 приостановлен", Заказ ), СписокПолучателей);   
	КонецЕсли;   
	
	Если Заказ.Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
		
		СписокПолучателей = "otk-xpack@okil-sato.ru; vplaksin@okil-sato.ru; psolodky@okil-sato.ru; 
							|rsalyakhov@okil-sato.ru; eshalaginova@okil-sato.ru; emoskvina@okil-sato.ru";	
		Лико_Планирование.ОтправитьПисьмо("", СтрШаблон( "%1 приостановлен", Заказ ), СписокПолучателей);   
		
	КонецЕсли;   
	
	Если Заказ.Площадка = Справочники.Лико_Площадки.Линкс Тогда 
		
		СписокПолучателей = "DSezemina@okil-sato.ru; TPetrova@okil-sato.ru; opp-uz@okil-sato.ru";	
		Лико_Планирование.ОтправитьПисьмо("", СтрШаблон( "%1 приостановлен", Заказ ), СписокПолучателей);   
		
   КонецЕсли; 


	Запись.Записать();
	Сообщить("Заказ заблокирован");  
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаПричиныБлокировки(Результат, Заказ) Экспорт
 
	Если Результат <> Неопределено Тогда
		
		БлокироватьЗаказНаСервере(Заказ, Результат);
		Элементы.Список.Обновить();	
		
	КонецЕсли;
 
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПлощадкаУрал(Площадка)
	
	Возврат Площадка = Справочники.Лико_Площадки.Урал;  
	
КонецФункции

&НаСервереБезКонтекста
Функция ПлощадкаСибирь(Площадка)
	
	Возврат Площадка = Справочники.Лико_Площадки.Сибирь; 

КонецФункции

&НаКлиенте
Процедура ПроверкаОснастки(Команда)
	
	ТекЗаказ = Элементы.Список.ТекущиеДанные.Ссылка;
	Если НЕ ЗначениеЗаполнено(ТекЗаказ) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполняемаяОбработка = НайтиВПФ("Отчет ""Проверка оснастки""");
	Если НЕ ЗначениеЗаполнено(ВыполняемаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
	ДопПараметры = Новый Структура("Заказ", ТекЗаказ);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма",ДопПараметры,, Новый УникальныйИдентификатор);   
	
КонецПроцедуры

&НаСервере
Функция НайтиВПФ(Наименование)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование);
	Возврат ВПФ;
КонецФункции

&НаКлиенте
Процедура ГрупповоеСозданиеЗаказов(Команда)
	
	ЧЗ = Ложь;
	ЗаголовокФормыОбработки = Неопределено;
	Если Команда.Имя = "СтикерыЧЗПоПовторам" Тогда
		ВыполняемаяОбработка = НайтиВПФ("Обработка ""Групповое создание заказов""");
		ЧЗ = Истина;         
		ЗаголовокФормыОбработки = "Групповое создание заказов на стикеры ЧЗ";
	ИначеЕсли Команда.Имя = "СтикерыЧЗПоШаблонам" Тогда
		ВыполняемаяОбработка = НайтиВПФ("Обработка ""Групповое создание заказов по шаблону"""); 
	ИначеЕсли Команда.Имя = "ПолныеПовторы" Тогда
		ВыполняемаяОбработка = НайтиВПФ("Обработка ""Групповое создание заказов"""); 
		ЗаголовокФормыОбработки = "Групповое создание полных повторов";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыполняемаяОбработка) Тогда
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
		ПараметрыФормы = Новый Структура("ЧЗ,Заголовок",ЧЗ,ЗаголовокФормыОбработки);
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли; 
	
КонецПроцедуры    

&НаКлиенте
Процедура СоздатьЗаявкуНаОтгрузку(Команда)      
	текстр = Элементы.Список.ТекущиеДанные;	
	Если Элементы.Найти("Заказ") <> Неопределено Тогда 
		Если текстр<>Неопределено Тогда       
			// <-- Начало Лико Яцун С. В. 13.01.2026
			СЗ = Новый СписокЗначений;  
			СЗ.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);
			РезультатПроверки = ПроверитьСтавкуНДСВЗаказах(СЗ);
			// <-- Конец Лико Яцун С. В. 13.01.2026
			Партнер = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(текстр.Ссылка, "Партнер"); 
			//Если есть шаблоны отгрузки, выбираем шаблон, если нет, показываем список заявок этого партнера для копирования
            Если ЕстьШаблоныОтгрузок(Партнер) Тогда 
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораШаблонаОтгрузки", ЭтотОбъект, РезультатПроверки);
				Отбор = Новый Структура("Партнер",Партнер);
				ПараметрыФормы = Новый Структура("Отбор",Отбор);
				ОткрытьФорму("Справочник.Лико_ШаблоныЗаявокНаОтгрузку.ФормаВыбора",ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			Иначе   
				Контрагент = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(текстр.Ссылка, "Контрагент");
				ОрганизацияПродавец = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(текстр.Ссылка, "Организация");  
				Отбор = Новый Структура("Контрагент",Контрагент);
				Отбор.Вставить("ОрганизацияПродавец", ОрганизацияПродавец);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗаявкиНаОтгрузку", ЭтотОбъект, РезультатПроверки);
				ПараметрыФормы = Новый Структура("Отбор",Отбор);
				ОткрытьФорму("Документ.Лико_ЗаявкаНаОтгрузку.ФормаВыбора",ПараметрыФормы,ЭтаФорма,Новый УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПроверитьСтавкуНДСВЗаказах(СписокЗаказов) // <-- Начало Лико Яцун С. В. 13.01.2026
	
	ЗадатьВопросОбИзмененииСтавкиНДС = Ложь;
	МассивЗаказовДляУвеличенияЦены = Новый Массив;
	Для каждого ВыделенныйЗаказ Из СписокЗаказов Цикл
		Если ВыделенныйЗаказ.Значение.ЦенаДляДокументовВключаетНДС Тогда
			Для каждого СтрТовар Из ВыделенныйЗаказ.Значение.Товары Цикл
				Если СтрТовар.СтавкаНДС.Ставка = 20 Тогда
					ЗадатьВопросОбИзмененииСтавкиНДС = Истина;
					МассивЗаказовДляУвеличенияЦены.Добавить(ВыделенныйЗаказ.Значение);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура("ЗадатьВопросОбИзмененииСтавкиНДС,МассивЗаказовДляУвеличенияЦены",ЗадатьВопросОбИзмененииСтавкиНДС,МассивЗаказовДляУвеличенияЦены);
	
	Возврат СтруктураВозврата;
	
КонецФункции // <-- Конец Лико Яцун С. В. 13.01.2026

&НаСервере
Функция ЕстьШаблоныОтгрузок(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ШаблоныЗаявокНаОтгрузку.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ШаблоныЗаявокНаОтгрузку КАК Лико_ШаблоныЗаявокНаОтгрузку
	|ГДЕ
	|	Лико_ШаблоныЗаявокНаОтгрузку.Партнер = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат  Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораШаблонаОтгрузки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		// <-- Начало Лико Яцун С. В. 14.01.2026
		Если ДополнительныеПараметры.Свойство("ЗадатьВопросОбИзмененииСтавкиНДС") И ДополнительныеПараметры.ЗадатьВопросОбИзмененииСтавкиНДС Тогда
			ДопПараметры = Новый Структура("Результат,Процедура,МассивЗаказовДляУвеличенияЦены",Результат,"ПослеВыбораШаблонаОтгрузки",ДополнительныеПараметры.МассивЗаказовДляУвеличенияЦены);
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииСтавкиНДС", ЭтотОбъект, ДопПараметры),"В заказе ставка НДС 20%. Увеличить цену в заявке до 22% НДС?",РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("УвеличитьЦенуСНДС") И ДополнительныеПараметры.УвеличитьЦенуСНДС Тогда
			ДопПараметрыЗаполнения = ДополнительныеПараметры;
		Иначе
			ДопПараметрыЗаполнения = Новый Структура("УвеличитьЦенуСНДС,МассивЗаказовДляУвеличенияЦены",Ложь,Новый Массив);	
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 14.01.2026
		Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда 
			Сп = Новый СписокЗначений;  
			сП.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);	
			
			ФормаЗаявки = ПолучитьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаДокумента");
			ДанныеФормы = ФормаЗаявки.Объект; 
			ЗаполнитьЗаявкуНаОтгрузкуНаСервере(ДанныеФормы, Результат, СП, ДопПараметрыЗаполнения);
			КопироватьДанныеФормы(ДанныеФормы, ФормаЗаявки.Объект); // копируем наш объект в объект формы и далее открываем ее
			ФормаЗаявки.Открыть();

    			
		КонецЕсли;
   КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция ЗаполнитьЗаявкуНаОтгрузкуНаСервере(ДанныеФормы, ШаблонЗаявкиНаОтгрузку,СписокЗаказов,ДопПараметрыЗаполнения)   
		
	МетаданныеИсточник = Метаданные.Справочники.Лико_ШаблоныЗаявокНаОтгрузку;
	МетаданныеНазначение= Метаданные.Документы.Лико_ЗаявкаНаОтгрузку; 
	ДокЗаявка = Документы.Лико_ЗаявкаНаОтгрузку.СоздатьДокумент();
    ДокЗаявка.Дата = ТекущаяДата();  
	ДокЗаявка.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан;  
	ДокЗаявка.Ответственный = ШаблонЗаявкиНаОтгрузку.Менеджер;

    Для Каждого Реквизит Из МетаданныеИсточник.Реквизиты Цикл
		Имя = Реквизит.Имя;
		Если МетаданныеНазначение.Реквизиты.Найти(Имя) <> Неопределено Тогда
			ДокЗаявка[Имя] =  ШаблонЗаявкиНаОтгрузку[Имя];
		КонецЕсли;
	КонецЦикла;   
	ДокЗаявка.СозданаИзЗаказаСчета = Истина; 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.NКонтракта КАК НомерПоставки,
	|	ЗаказКлиентаТовары.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА ЗаказКлиентаТовары.Цена
	|					ИНАЧЕ ЗаказКлиентаТовары.Цена * 100 / (100 + ЕСТЬNULL(ЗаказКлиентаТовары.СтавкаНДС.Ставка, 0))
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ КАК Цена,
	|	ЗаказКлиентаТовары.ВнутреннийДиаметр КАК Втулка,
	|	ЗаказКлиентаТовары.Направление КАК Намотка,
	|	ЗаказКлиентаТовары.Город КАК Город,
	|	ЗаказКлиентаТовары.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ЗаказКлиентаТовары.ЦенаДляДокументов КАК ЦенаДляДокументов,
	|	ЗаказКлиентаТовары.Ссылка.ВалютаДляДокументов КАК ВалютаЦены
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&СписокЗаказов)"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		нстр = ДокЗаявка.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборка);
		Если ДопПараметрыЗаполнения.УвеличитьЦенуСНДС И ДопПараметрыЗаполнения.МассивЗаказовДляУвеличенияЦены.Найти(выборка.ЗаказКлиента) <> Неопределено Тогда
			нстр.Цена = (нстр.Цена/1.20)*1.22;	
		КонецЕсли;
		нстр.Контрагент =   ШаблонЗаявкиНаОтгрузку.Контрагент;
		нстр.АдресДоставки = ШаблонЗаявкиНаОтгрузку.АдресДоставки; 
		нстр.АдресДоставкиЗначенияПолей = ШаблонЗаявкиНаОтгрузку.АдресДоставкиЗначенияПолей; 
	//	нстр.ВалютаЦены = ШаблонЗаявкиНаОтгрузку.ВалютаЦены; 
		нстр.Грузополучатель = ШаблонЗаявкиНаОтгрузку.Грузополучатель;
		нстр.ОтгрузкаВРублях = ШаблонЗаявкиНаОтгрузку.ОтгрузкаВРублях;  
		нстр.Примечание = ШаблонЗаявкиНаОтгрузку.Примечание;    
		нстр.РеальныйДоговор = ШаблонЗаявкиНаОтгрузку.РеальныйДоговор;  

	КонецЦикла;
	
	
	ЗначениеВДанныеФормы(ДокЗаявка,ДанныеФормы);


КонецФункции   

&НаСервере
Функция ЗаполнитьЗаявкуНаОтгрузкупоЗаявкеНаОтгрузку(ДанныеФормы, ЗаявкаНаотгрузку,СписокЗаказов,ДопПараметрыЗаполнения)   
		
	ДокЗаявка = ЗаявкаНаотгрузку.Скопировать();
	ДокЗаявка.Дата = ТекущаяДата(); 
	ДокЗаявка.ДатаОтгрузки = '00010101';
	ДокЗаявка.СозданаИзЗаказаСчета = Истина;

	ДокЗаявка.Товары.Очистить();
	ДокЗаявка.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан; 
    стр = ЗаявкаНаотгрузку.Товары[0];

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.NКонтракта КАК НомерПоставки,
	|	ЗаказКлиентаТовары.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА ЗаказКлиентаТовары.Цена
	|					ИНАЧЕ ЗаказКлиентаТовары.Цена * 100 / (100 + ЕСТЬNULL(ЗаказКлиентаТовары.СтавкаНДС.Ставка, 0))
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ КАК Цена,
	|	ЗаказКлиентаТовары.ВнутреннийДиаметр КАК Втулка,
	|	ЗаказКлиентаТовары.Направление КАК Намотка,
	|	ЗаказКлиентаТовары.Город КАК Город,
	|	ЗаказКлиентаТовары.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ЗаказКлиентаТовары.ЦенаДляДокументов КАК ЦенаДляДокументов,
	|	ЗаказКлиентаТовары.Ссылка.ВалютаДляДокументов КАК ВалютаЦены
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&СписокЗаказов)"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Пока Выборка.Следующий() Цикл
		нстр = ДокЗаявка.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборка);
		Если ДопПараметрыЗаполнения.УвеличитьЦенуСНДС И ДопПараметрыЗаполнения.МассивЗаказовДляУвеличенияЦены.Найти(выборка.ЗаказКлиента) <> Неопределено Тогда
			нстр.Цена = (нстр.Цена/1.20)*1.22;	
		КонецЕсли;
		нстр.Контрагент =   стр.Контрагент;
		нстр.АдресДоставки = стр.АдресДоставки; 
		нстр.АдресДоставкиЗначенияПолей = стр.АдресДоставкиЗначенияПолей; 
		нстр.ВалютаЦены = стр.ВалютаЦены; 
		нстр.Грузополучатель = стр.Грузополучатель;
		нстр.ОтгрузкаВРублях = стр.ОтгрузкаВРублях;  
		нстр.Примечание = стр.Примечание;    
		нстр.РеальныйДоговор = стр.РеальныйДоговор;  

	КонецЦикла;
	
	
	ЗначениеВДанныеФормы(ДокЗаявка,ДанныеФормы);


КонецФункции


 &НаКлиенте
Процедура ПослеВыбораЗаявкиНаОтгрузку(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат <> Неопределено Тогда
		// <-- Начало Лико Яцун С. В. 14.01.2026
		Если ДополнительныеПараметры.Свойство("ЗадатьВопросОбИзмененииСтавкиНДС") И ДополнительныеПараметры.ЗадатьВопросОбИзмененииСтавкиНДС Тогда
			ДопПараметры = Новый Структура("Результат,Процедура,МассивЗаказовДляУвеличенияЦены",Результат,"ПослеВыбораЗаявкиНаОтгрузку",ДополнительныеПараметры.МассивЗаказовДляУвеличенияЦены);
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииСтавкиНДС", ЭтотОбъект, ДопПараметры),"В заказе ставка НДС 20%. Увеличить цену в заявке до 22% НДС?",РежимДиалогаВопрос.ДаНет); 
			Возврат;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("УвеличитьЦенуСНДС") И ДополнительныеПараметры.УвеличитьЦенуСНДС Тогда
			ДопПараметрыЗаполнения = ДополнительныеПараметры;
		Иначе
			ДопПараметрыЗаполнения = Новый Структура("УвеличитьЦенуСНДС,МассивЗаказовДляУвеличенияЦены",Ложь,Новый Массив);	
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 14.01.2026
    	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда 
    		Сп = Новый СписокЗначений;  
    		сП.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);	
    		
    		ФормаЗаявки = ПолучитьФорму("Документ.Лико_ЗаявкаНаОтгрузку.Форма.ФормаДокумента");
    		ДанныеФормы = ФормаЗаявки.Объект; 
    		ЗаполнитьЗаявкуНаОтгрузкупоЗаявкеНаОтгрузку(ДанныеФормы, Результат, СП, ДопПараметрыЗаполнения);
    		КопироватьДанныеФормы(ДанныеФормы, ФормаЗаявки.Объект); // копируем наш объект в объект формы и далее открываем ее
    		ФормаЗаявки.Открыть();			
    	КонецЕсли;
   КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииСтавкиНДС(РезультатВопроса, ДополнительныеПараметры) Экспорт // <-- Начало Лико Яцун С. В. 14.01.2026
    
	Результат = РезультатВопроса;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.Процедура = "ПослеВыбораЗаявкиНаОтгрузку" Тогда
			ПослеВыбораЗаявкиНаОтгрузку(ДополнительныеПараметры.Результат, Новый Структура("УвеличитьЦенуСНДС,МассивЗаказовДляУвеличенияЦены",Истина,ДополнительныеПараметры.МассивЗаказовДляУвеличенияЦены));
		ИначеЕсли ДополнительныеПараметры.Процедура = "ПослеВыбораШаблонаОтгрузки" Тогда	
			ПослеВыбораШаблонаОтгрузки(ДополнительныеПараметры.Результат, Новый Структура("УвеличитьЦенуСНДС,МассивЗаказовДляУвеличенияЦены",Истина,ДополнительныеПараметры.МассивЗаказовДляУвеличенияЦены));
		КонецЕсли;
	ИначеЕсли ДополнительныеПараметры.Процедура = "ПослеВыбораЗаявкиНаОтгрузку" Тогда
    	ПослеВыбораЗаявкиНаОтгрузку(ДополнительныеПараметры.Результат, Новый Структура());
	ИначеЕсли ДополнительныеПараметры.Процедура = "ПослеВыбораШаблонаОтгрузки" Тогда	
		ПослеВыбораШаблонаОтгрузки(ДополнительныеПараметры.Результат, Новый Структура());
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 14.01.2026

&НаКлиенте
Процедура СоздатьСчетНаПредоплату(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда 
		Сп = Новый СписокЗначений;  
		сП.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);	
		ФормаСчета = ПолучитьФорму("Документ.Лико_СчетНаОплатуКлиенту.Форма.ФормаДокумента");
		ДанныеФормы = ФормаСчета.Объект; 
		ЗаполнитьСчетНапредоплатуНаСервере(ДанныеФормы,  СП);
		КопироватьДанныеФормы(ДанныеФормы, ФормаСчета.Объект); // копируем наш объект в объект формы и далее открываем ее
		ФормаСчета.Открыть();        	
   КонецЕсли;

КонецПроцедуры

 &НаСервере
Процедура ЗаполнитьСчетНапредоплатуНаСервере(ДанныеФормы,СписокЗаказов)
	ДокСчет = Документы.Лико_СчетНаОплатуКлиенту.СоздатьДокумент();
    ДокСчет.Дата = ТекущаяДата();  
	ДокСчет.Менеджер = ПараметрыСеанса.ТекущийПользователь;  
	ПервыйЗаказ = СписокЗаказов[0].Значение;
	ДокСчет.Организация = ПервыйЗаказ.Организация;
	ДокСчет.Партнер = ПервыйЗаказ.Партнер; 
	ДокСчет.Контрагент = ПервыйЗаказ.Контрагент;
    ДокСчет.ЦенаВключаетНДС  = ПервыйЗаказ.ЦенаДляДокументовВключаетНДС;
    ДокСчет.Валюта  = ПервыйЗаказ.ВалютаДляДокументов;  
	ДокСчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;


   	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА ЗаказКлиентаТовары.Цена
	|					ИНАЧЕ ЗаказКлиентаТовары.Цена * 100 / (100 + ЕСТЬNULL(ЗаказКлиентаТовары.СтавкаНДС.Ставка, 0))
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ КАК Цена,
	|	ЗаказКлиентаТовары.ЦенаДляДокументов КАК ЦенаДляДокументов,
	|	ЗаказКлиентаТовары.Ссылка.ВалютаДляДокументов КАК ВалютаЦены,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&СписокЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.ЦенаДляДокументов,
	|	ЗаказКлиентаТовары.СтавкаНДС,
	|	ЗаказКлиентаТовары.Ссылка.ВалютаДляДокументов,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА ЗаказКлиентаТовары.Цена
	|					ИНАЧЕ ЗаказКлиентаТовары.Цена * 100 / (100 + ЕСТЬNULL(ЗаказКлиентаТовары.СтавкаНДС.Ставка, 0))
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	СтруктураКурсов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУпр,  ТекущаяДата());
	Если СтруктураКурсов.Курс = 0 Тогда
		СтруктураКурсов.Курс = 1;
	КонецЕсли;
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	Пока Выборка.Следующий() Цикл
		нстр = ДокСчет.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборка, , "Цена"); 
		Если ЗначениеЗаполнено(выборка.ЦенаДляДокументов) Тогда
			//Если нстр.Лико_ВалютаДляДокументов = Объект.Валюта Тогда
				нстр.Цена = Выборка.ЦенаДляДокументов;
			//Иначе
			//	Если Объект.Валюта = ВалютаРегл Тогда
			//		нстр.Цена = Строка.ЦенаДляДокументов * СтруктураКурсов.Курс;
			//	Иначе
			//		нстр.Цена = Строка.ЦенаДляДокументов / СтруктураКурсов.Курс;
			//	КонецЕсли;
			//КонецЕсли;
		Иначе
			Если Выборка.ВалютаЦены = ВалютаРегл Тогда
				нстр.Цена = Выборка.Цена * СтруктураКурсов.Курс;
			Иначе
				нстр.Цена = Выборка.Цена;
			КонецЕсли;
		КонецЕсли;
        СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", ДокСчет.ЦенаВключаетНДС, нстр.СтавкаНДС));
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(нстр, СтруктураДействий, КэшированныеЗначения);

		
	КонецЦикла;
	
	
	ЗначениеВДанныеФормы(ДокСчет,ДанныеФормы);

КонецПроцедуры



&НаКлиенте
Процедура СоздатьКП(Команда)
			
	МассивВыделенных = Элементы.Список.ВыделенныеСтроки;
    Если МассивВыделенных.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    
    // Платформа 1С умеет принимать МАССИВ в качестве параметра "Основание"
    ПараметрыОткрытия = Новый Структура("Основание", МассивВыделенных);
    ОткрытьФорму("Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента", ПараметрыОткрытия);
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьСвойстваМатериалов(Команда) // <-- Начало Лико Яцун С. В. 22.12.2025
	
	ВыделеноЗаказов = Элементы.Список.ВыделенныеСтроки.Количество();
	Если УстановленыОтборыЗаказов() ИЛИ ВыделеноЗаказов > 1 Тогда
		Обработка = НайтиВПФ("лк Список рулонных материалов");  
		ОбъектПередачи = Элементы.Список.ТекущаяСтрока;
		Лико_Площадка = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"Площадка");
		Организация = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Площадка,"Организация");
		Если Обработка <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Организация, "Лико_УчетНаСкладеПоBRC", Ложь)) Тогда 
				BRC = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Организация, "Лико_УчетНаСкладеПоBRC", Ложь);
			Иначе
				BRC = Ложь;
			КонецЕсли;
			
			Если BRC Тогда
				BRC_ДатаКарантина = ТекущаяДата() - Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.BRC_ДлительностьКарантинаЧас"),"ЗначениеПараметра")*60*60;
			Иначе
				BRC_ДатаКарантина = ТекущаяДата();
			КонецЕсли;
			
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Дата", ТекущаяДата());
			ПараметрыОткрытия.Вставить("Партнер", Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"Партнер"));  
			ПараметрыОткрытия.Вставить("Заказ", ОбъектПередачи);  
			ПараметрыОткрытия.Вставить("BRC", BRC);
			ПараметрыОткрытия.Вставить("BRC_ДатаКарантина",BRC_ДатаКарантина);
			ПараметрыОткрытия.Вставить("Организация", Организация);
			ПараметрыОткрытия.Вставить("Площадка", Организация);
			ПараметрыОткрытия.Вставить("ИзСпискаЗаказов", Истина); 
			ПараметрыОткрытия.Вставить("Лико_Площадка", Лико_Площадка);
			Если ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал")) И ТипЗнч(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал")) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
				ПараметрыОткрытия.Вставить("ЦеноваяГруппаОтбор", Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал"));
				ПараметрыОткрытия.Вставить("ПоЦенновойГруппеОтбор", Ложь);
				ПараметрыОткрытия.Вставить("НоменклатураОтбор", Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал"),"ОсновнаяНоменклатура"));
				ПоставщикОтбор = Новый  СписокЗначений;
				ПоставщикОтбор.Добавить(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал"),"ОсновнаяНоменклатура"),"Производитель"));
				ПараметрыОткрытия.Вставить("ПоставщикОтбор", ПоставщикОтбор);
				ПараметрыОткрытия.Вставить("ПоНоменклатуреОтбор", Ложь);
			ИначеЕсли ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал")) И ТипЗнч(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал")) = Тип("СправочникСсылка.Номенклатура") Тогда
				ПараметрыОткрытия.Вставить("ЦеноваяГруппаОтбор", Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал"),"ЦеноваяГруппа"));
				ПараметрыОткрытия.Вставить("ПоЦенновойГруппеОтбор", Ложь);
				ПараметрыОткрытия.Вставить("НоменклатураОтбор", Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал"));
				ПоставщикОтбор = Новый  СписокЗначений;
				ПоставщикОтбор.Добавить(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектПередачи,"ОсновнойМатериал"),"Производитель"));
				ПараметрыОткрытия.Вставить("ПоставщикОтбор", ПоставщикОтбор);
				ПараметрыОткрытия.Вставить("ПоНоменклатуреОтбор", Ложь);
			КонецЕсли;
			ПараметрыОткрытия.Вставить("КоличествоЗаказовДляСохраненияСвойств", ?(ВыделеноЗаказов > 1,ВыделеноЗаказов,ПолучитьКоличествоЗаказовДляСохраненияСвойств()));
			ПараметрыОткрытия.Вставить("ТекстЗапросаОстаткиНоменклатуры", Неопределено);
			ПараметрыДляОткрытия = Новый Структура("ДанныеЗаполненияОтборов",ПараметрыОткрытия);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыАналоговМатериала", ЭтаФорма);  
			ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаПодбораАналогаМатериала",ПараметрыДляОткрытия,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			//ОткрытьФорму("Обработка.Лико_СписокРулонныхМатериалов.Форма.ФормаПодбораАналогаМатериала",ПараметрыДляОткрытия,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	Иначе
		Сообщить("Не установлен отбор заказов, установите отбор, для каких заказов хотите заполнить свойства материала");	
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 22.12.2025

&НаСервере
Функция УстановленыОтборыЗаказов() // <-- Начало Лико Яцун С. В. 22.12.2025

	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	УстановленыОтборыЗаказов = Ложь;
	
	Для каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			УстановленыОтборыЗаказов = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат УстановленыОтборыЗаказов;

КонецФункции // <-- Конец Лико Яцун С. В. 22.12.2025

&НаСервере
Функция ПолучитьКоличествоЗаказовДляСохраненияСвойств() // <-- Начало Лико Яцун С. В. 22.12.2025
	
	ТЗизДинамическогоСписка = ПолучитьТЗизДинамическогоСписка();
	КоличествоЗаказовДляСохраненияСвойств = ТЗизДинамическогоСписка.Количество();
	
	Возврат КоличествоЗаказовДляСохраненияСвойств;

КонецФункции // <-- Конец Лико Яцун С. В. 22.12.2025

&НаСервере
Функция ПолучитьТЗизДинамическогоСписка() // <-- Начало Лико Яцун С. В. 22.12.2025

	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ТабЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТабЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	Возврат ТабЗначений;

КонецФункции // <-- Конец Лико Яцун С. В. 22.12.2025

&НаКлиенте
Процедура ПослеЗакрытияФормыАналоговМатериала(Результат, Параметры) Экспорт // <-- Начало Лико Яцун С. В. 19.12.2025    
	
	Если Результат <> Неопределено Тогда
		СвойстваМатериалаДляХранилища = Результат;
		ЗаполнитьСвойстваМатериаловНаСервере(СвойстваМатериалаДляХранилища)
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 19.12.2025 

&НаСервере
Процедура ЗаполнитьСвойстваМатериаловНаСервере(СвойстваМатериалаДляХранилища) // <-- Начало Лико Яцун С. В. 22.12.2025
	
	ТЗизДинамическогоСписка = ПолучитьТЗизДинамическогоСписка();
	Для каждого Стр Из ТЗизДинамическогоСписка Цикл
		//Если выделено несколько строк, то заполняется только в них
		Если Элементы.Список.ВыделенныеСтроки.Количество() > 1 Тогда
			Если Элементы.Список.ВыделенныеСтроки.Найти(Стр.Ссылка) = Неопределено Тогда
				Продолжить;
			Иначе
				Если НЕ Стр.Ссылка.ПоставщикМатериалаЛюбой Тогда
					ЗаказОбъект = Стр.Ссылка.ПолучитьОбъект();
					
					ЗаказОбъект.СвойстваМатериала = Новый ХранилищеЗначения(СвойстваМатериалаДляХранилища);
					ЗаказОбъект.ОбменДанными.Загрузка = Истина;
					ЗаказОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если НЕ Стр.Ссылка.ПоставщикМатериалаЛюбой Тогда
				ЗаказОбъект = Стр.Ссылка.ПолучитьОбъект();
				
				ЗаказОбъект.СвойстваМатериала = Новый ХранилищеЗначения(СвойстваМатериалаДляХранилища);
				ЗаказОбъект.ОбменДанными.Загрузка = Истина;
				ЗаказОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  // <-- Конец Лико Яцун С. В. 22.12.2025

