#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Ссылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыЗаявокДляВыбора() Экспорт

	ТипЗаявкиМенеджер = Перечисления.ТипыЗаявокКабинетСотрудника;
	
	ТипыЗаявок = Новый Массив;
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Отпуск);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускБезОплаты);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.УчебныйОтпуск);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.КомпенсацияОтпуска);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеНаНалоговыеВычеты);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаНДФЛ);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Болезнь);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускПоБеременностиИРодам);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ИзменениеЛичныхДанных);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОбращениеСотрудника);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеНаУдержаниеДСВ);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаСМестаРаботы);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаОбОстаткеОтпуска);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОпозданиеЛичныеДела);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускПоУходуЗаРебенком);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Отгул);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Командировка);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ДниУходаЗаДетьмиИнвалидами);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ПособиеПриРожденииРебенка);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЕжемесячноеПособиеПоУходуЗаРебенком);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ВозвратИзОтпускаПоУходуЗаРебенком);
	
	Возврат ТипыЗаявок;

КонецФункции

#КонецОбласти

#КонецЕсли
