&НаСервере
Процедура ОбновитьЗаголовокДлинаШирина()
	
	Если Объект.Площадка = Справочники.Лико_Площадки.Урал Тогда
		Элементы.ОснасткаДлинаЭтикетки.Заголовок = "Длина этикетки";
		Элементы.ОснасткаШиринаЭтикетки.Заголовок = "Ширина этикетки";
		Элементы.ОснасткаДлинаЭтикетки1.Заголовок = "Длина этикетки";
		Элементы.ОснасткаШиринаЭтикетки1.Заголовок = "Ширина этикетки";

	Иначе
		Элементы.ОснасткаДлинаЭтикетки.Заголовок = "Высота этикетки (по нарезке)";
		Элементы.ОснасткаШиринаЭтикетки.Заголовок = "Ширина этикетки (по раппорту)";
		Элементы.ОснасткаДлинаЭтикетки1.Заголовок = "Высота этикетки (по нарезке)";
		Элементы.ОснасткаШиринаЭтикетки1.Заголовок = "Ширина этикетки (по раппорту)";
	КонецЕсли;

КонецПроцедуры
	

&НаСервере
Процедура ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	Если Объект.ВидОперации  = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ  И 
		Не РольДоступна("Лико_ИнженерОснастки") И 
		Не  РольДоступна("ПолныеПрава")Тогда
 
		    
		УстановитьВидимостьПараметров(Ложь,Ложь);
	Иначе
		УстановитьВидимостьПараметров(Истина,Истина);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(параметры.ЗначениеКопирования) Тогда 
		Для каждого стр из Объект.Оснастка Цикл
			стр.статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан;	
		КонецЦикла;
	КонецЕсли;	
	Если Не (РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке") ИЛИ  РольДоступна("Лико_ИнженерОснастки")) Тогда 
		Элементы.Комментарий.Доступность = Ложь;
	КонецЕсли;
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.Номер.Доступность = Ложь;
	КонецЕсли;
	
	Если   РольДоступна("Лико_Разработчик3dМоделей")  И Не РольДоступна("ПолныеПрава") Тогда
		 УстановитьВидемостьДляРазработчика3dМоделей();
	КонецЕсли;
	
	
	ДобавитьУсловноеОформление();
	ОбновитьЗаголовокДлинаШирина();

КонецПроцедуры






&НаСервере
Процедура УстановитьВидимостьПараметров(ВидимостьПараметров, ДоступностьПараметров)
	Элементы.ОснасткаКонтрагент.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаТираж.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаВидПечати.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаКоличествоЦветов.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаМатериал.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаТипРЦ.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаТипИнструмента.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаШиринаРукава.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаТипВырубки.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаНарезка.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаНаправлениеНамотки.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаШагПечати.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаZ.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаРучьи.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаПодложка.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаЭтикетокНаЛисте.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаДлинаЭтикетки.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаШиринаЭтикетки.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаИнтервалМеждуРучьями.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаИнтервалМеждуЭтикетками.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаДиаметр.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаРадиус.Видимость = ВидимостьПараметров;	
	Элементы.ГруппаПараметры.Видимость = ВидимостьПараметров;
	Элементы.Этикетки.Видимость = ВидимостьПараметров;
	Элементы.Оснастка_3DМодель.Видимость = ВидимостьПараметров;
	Элементы.ОснасткаКнижка.Видимость = ВидимостьПараметров;
	
	Элементы.Этикетки.Доступность = ДоступностьПараметров;
	Элементы.ОснасткаВидШтампа.Доступность = ДоступностьПараметров;
	Элементы.ОснасткаНоменклатура.Доступность = ДоступностьПараметров;
	Элементы.ОснасткаМенеджер.Доступность = ДоступностьПараметров;
	Элементы.ОснасткаЗаказ.Доступность = ДоступностьПараметров;
	Элементы.ОснасткаСтатус.Доступность = ДоступностьПараметров;
	Элементы.ОснасткаРабочийЦентр.Доступность = ДоступностьПараметров;
	Элементы.Комментарий.Доступность = ДоступностьПараметров;
	Элементы.ОснасткаПримечание.Доступность = ДоступностьПараметров;

КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление()
	
	//ИмяТаблицы = "Оснастка";
	//ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы );
	//ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".Статус");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных(Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан); 
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоКоралловый);

КонецПроцедуры


&НаСервере
Процедура ОтправитьПисьмоНаСервере(ПисьмоТехнологу, ПисьмоМенеджерам)
	АдресатМенеджер = "";
	АдресатТехнолог = "";
	Адресат = "";
	
	
	Если ПисьмоТехнологу Тогда 
		АдресатТехнолог = Лико_Планирование.ПолучитьПочтуПользователя(Справочники.Пользователи.НайтиПоНаименованию("Ромса Виталий"));
	КонецЕсли;
	Если Объект.ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ Тогда 
		Тема = "Создан заказ на оснастку №"+ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер)+" для перезаказа ранее использованных штампов: ";
    КонецЕсли;
	
	Если ПисьмоМенеджерам Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаказОснасткиОснастка.Менеджер КАК Менеджер,
		|	Лико_ЗаказОснасткиОснастка.Номенклатура,
		|	Лико_ЗаказОснасткиОснастка.Номенклатура.Артикул КАК Артикул,
		|	Лико_ЗаказОснасткиОснастка.Заказ,
		|	Лико_ЗаказОснасткиОснастка.Заказ.НомерБезПрефикса Как НомерЗаказа
		|ИЗ
		|	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
		|ГДЕ
		|	Лико_ЗаказОснасткиОснастка.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ЗаказОснасткиОснастка.Менеджер,
		|	Лико_ЗаказОснасткиОснастка.Номенклатура,
		|	Лико_ЗаказОснасткиОснастка.Номенклатура.Артикул,
		|	Лико_ЗаказОснасткиОснастка.Заказ,
		|	Лико_ЗаказОснасткиОснастка.Заказ.НомерБезПрефикса
		|ИТОГИ ПО
		|	Менеджер";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		ВыборкаМенеджер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Менеджер");
		Пока ВыборкаМенеджер.Следующий()  Цикл
			АдресатМенеджер = Лико_Планирование.ПолучитьПочтуПользователя(ВыборкаМенеджер.Менеджер);
			СтрОснастки = "";
			Выборка = ВыборкаМенеджер.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрОснастки = СтрОснастки+ " Заказ №"+Выборка.НомерЗаказа+" штамп " +Выборка.Номенклатура.Артикул;
			КонецЦикла;	
			текст = Тема+ СтрОснастки;
			Адресат = АдресатТехнолог+?(ЗначениеЗаполнено(АдресатТехнолог), "; ", "")+АдресатМенеджер;
			Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат) ;

		КонецЦикла;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаказОснасткиОснастка.Менеджер КАК Менеджер,
		|	Лико_ЗаказОснасткиОснастка.Номенклатура,
		|	Лико_ЗаказОснасткиОснастка.Номенклатура.Артикул КАК Артикул,
		|	Лико_ЗаказОснасткиОснастка.Заказ
		|ИЗ
		|	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
		|ГДЕ
		|	Лико_ЗаказОснасткиОснастка.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Менеджер";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		СтрОснастки = "";
		Пока Выборка.Следующий() Цикл
			СтрОснастки = СтрОснастки+ " Заказ №"+ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Заказ.Номер)+" штамп " +Выборка.Номенклатура.Артикул;
		КонецЦикла;
		текст = Тема+ СтрОснастки;
		Лико_Планирование.ОтправитьПисьмо(текст, Тема, АдресатТехнолог) ;
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Функция ПечатьЗаказОснасткиНаСервере(НомерСтроки = 0)
	Макет = Документы.Лико_ЗаказОснастки.ПОлучитьМакет("ЗаказОснастки");
	ТабДокумент = Новый ТабличныйДокумент;
	Запрос = Новый Запрос;

	Если НомерСтроки>0 Тогда 
		УсловиеСтроки = "	И Лико_ЗаказОснасткиОснастка.НомерСтроки = &НомерСтроки";
	Иначе
		УсловиеСтроки = "";
	КонецЕсли;	

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаказОснасткиОснастка.Заказ КАК Заказ,
	|	Лико_ЗаказОснасткиОснастка.Заказ.Регион КАК Регион,
	|	Лико_ЗаказОснасткиОснастка.Менеджер КАК Менеджер,
	|	Лико_ЗаказОснасткиОснастка.Партнер КАК Контрагент,
	|	Лико_ЗаказОснасткиОснастка.Тираж КАК Тираж,
	|	Лико_ЗаказОснасткиОснастка.КоличествоЦветов КАК КоличествоЦветов,
	|	Лико_ЗаказОснасткиОснастка.Материал КАК Материал,
	|	Лико_ЗаказОснасткиОснастка.Нарезка КАК Нарезка,
	|	Лико_ЗаказОснасткиОснастка.Подложка КАК Подложка,
	|	Лико_ЗаказОснасткиОснастка.ВидШтампа КАК ВидШтампа,
	|	Лико_ЗаказОснасткиОснастка.Номенклатура.Артикул КАК Артикул,
	|	Лико_ЗаказОснасткиОснастка.Номенклатура КАК Номенклатура,
	|	Лико_ЗаказОснасткиОснастка.Количество КАК Количество,
	|	Лико_ЗаказОснасткиОснастка.ВидРЦ КАК ТипРЦ,
	|	Лико_ЗаказОснасткиОснастка.ТипВырубки КАК ТипВырубки,
	|	Лико_ЗаказОснасткиОснастка.ТипИнструмента КАК ТипИнструмента,
	|	Лико_ЗаказОснасткиОснастка.ШиринаРукава КАК ШиринаРукава,
	|	Лико_ЗаказОснасткиОснастка.ШагПечати КАК ШагПечати,
	|	Лико_ЗаказОснасткиОснастка.Z КАК Z,
	|	Лико_ЗаказОснасткиОснастка.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	Лико_ЗаказОснасткиОснастка.Ручьи КАК Ручьи,
	|	Лико_ЗаказОснасткиОснастка.ДлинаЭтикетки КАК ДлинаЭтикетки,
	|	Лико_ЗаказОснасткиОснастка.ШиринаЭтикетки КАК ШиринаЭтикетки,
	|	Лико_ЗаказОснасткиОснастка.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
	|	Лико_ЗаказОснасткиОснастка.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками,
	|	Лико_ЗаказОснасткиОснастка.НаправлениеНамотки КАК НаправлениеНамотки,
	|	Лико_ЗаказОснасткиОснастка.Диаметр КАК Диаметр,
	|	Лико_ЗаказОснасткиОснастка.Радиус КАК Радиус,
	|	Лико_ЗаказОснасткиОснастка.ВидПечати КАК ВидПечати,
	|	Лико_ЗаказОснасткиОснастка.Статус КАК Статус,
	|	Лико_ЗаказОснасткиОснастка.КлючСтроки КАК КлючСтроки,
	|	Лико_ЗаказОснасткиОснастка.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Лико_ЗаказОснасткиОснастка.Ручьи > 0
	|			ТОГДА Лико_ЗаказОснасткиОснастка.ЭтикетокНаЛисте / Лико_ЗаказОснасткиОснастка.Ручьи
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧислоЭтикеток,
	|	Лико_ЗаказОснасткиОснастка.Примечание КАК Примечание,
	|	Лико_ЗаказОснасткиОснастка.РабочийЦентр КАК РЦ,
	|	Лико_ЗаказОснасткиОснастка._3DМодель КАК _3DМодель,
	|	Лико_ЗаказОснасткиОснастка.Книжка КАК Книжка,
	|	Лико_ЗаказОснасткиОснастка.Вклейка КАК Вклейка
	|ИЗ
	|	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
	|ГДЕ
	|	Лико_ЗаказОснасткиОснастка.Ссылка = &Ссылка"+УсловиеСтроки;
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Выборка = Запрос.Выполнить().Выбрать();
	сч = 0;
	Пока Выборка.Следующий() Цикл
		Если сч>0 Тогда 
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;	
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		НомерДок =  ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер);
		ОбластьМакета.Параметры.ТекстЗаголовка = "Заявка № "+ НомерДок;
		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьШапка.Параметры.НомерДок =  НомерДок;
		ОбластьШапка.Параметры.Дата =  Объект.Дата;
		ОбластьШапка.Параметры.Площадка = Объект.Площадка;
		//ОбластьШапка.Параметры.НомерЗаказа = ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.Заказ);

		ТабДокумент.Вывести(ОбластьШапка);	
		ЗапросЭт = Новый Запрос;
		ЗапросЭт.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_ЗаказОснасткиЭтикетки.Этикетка
		|ИЗ
		|	Документ.Лико_ЗаказОснастки.Этикетки КАК Лико_ЗаказОснасткиЭтикетки
		|ГДЕ
		|	Лико_ЗаказОснасткиЭтикетки.Ссылка = &Ссылка
		|	И Лико_ЗаказОснасткиЭтикетки.КлючСтроки = &ключстроки";
		ЗапросЭт.УстановитьПараметр("Ссылка", Объект.Ссылка);
		ЗапросЭт.УстановитьПараметр("КлючСтроки", Выборка.КлючСтроки);
		ВыборкаЭт = ЗапросЭт.Выполнить().Выбрать();
		Пока ВыборкаЭт.Следующий() Цикл
			ОбластьЭт = Макет.ПолучитьОбласть("стрЭт");
			ОбластьЭт.Параметры.Заполнить(ВыборкаЭт);
			ТабДокумент.Вывести(ОбластьЭт);	
		КонецЦикла;
		Если Не Объект.Площадка.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
			ОбластьПоНарезке = Макет.Область("ПоНарезке");
			ОбластьПоНарезке.Текст = "";
			ОбластьПоРаппорту = Макет.Область("ПоРаппорту");
			ОбластьПоРаппорту.Текст = "";
			ОбластьКнижка = Макет.Область("Книжка");
			ОбластьКнижка.Текст = "";
			Область3DМодель = Макет.Область("_3DМодель");
			Область3DМодель.Текст = "";
		КонецЕсли;
		Если Объект.Площадка = Справочники.Лико_Площадки.Урал Тогда
			ОбластьВысотаДлина = Макет.Область("ВысотаДлина");
			ОбластьВысотаДлина.Текст = "В - длина этикетки:";
		КонецЕсли;
		Если Выборка.ТипРЦ <> Справочники.ВидыРабочихЦентров.Omega Тогда
			ОбластьРЦ = Макет.Область("РЦ");
			ОбластьРЦ.Текст = "";
		КонецЕсли;
		
		ОбластьОснастка = Макет.ПолучитьОбласть("Оснастка");
		ОбластьОснастка.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьОснастка);	
		сч = сч+1;
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции

&НаСервере
Процедура ПроверкаНаСервереПередЗаписью(Отказ)
	Для каждого стр из  Объект.Оснастка Цикл
		Если Не ЗначениеЗаполнено(стр.менеджер)  Тогда 
			Сообщить("Не указан менеджер в строке "+стр.номерстроки +" документ не может быть записан" , СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	


&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
    Возврат ВнешниеОбработки.Подключить(АдресХранилища);
КонецФункции   

&НаСервере
Функция ПолучитьКлючСтрокиНаСервере()
	МаксКлюч = 0;
	Если Объект.Оснастка.Количество() > 1 Тогда
		// Если в табл. части уже присутствуют строки, то новое «свободное» значение ключа
		// рассчитывается от максимального существующего значения или равно 1, если такого ключа нет
		СписокКлючей = Новый СписокЗначений;
		ТЗ = Объект.Оснастка.Выгрузить(, "КлючСтроки");
		ТЗ.Сортировать("КлючСтроки Убыв"); 
		//СписокКлючей.ЗагрузитьЗначения(массив.выгрузитьКолонку);
		//СписокКлючей.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		//МаксКлюч = СписокКлючей[0].Значение + 1;
		МаксКлюч = ТЗ[0].КлючСтроки+1;
	Иначе 
		Возврат 1;	
	КонецЕсли;

	Возврат МаксКлюч;
КонецФункции	

&НаСервере
Функция НайтиВПФ(Наименование)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование);
	Возврат ВПФ;

КонецФункции

&НаСервере
Функция ПроверитьКорректностьЗаполненияЗаказаНаОснастку280821(стр)
	Сообщение = "";
	Если Объект.ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Новый Тогда
		Если ЗначениеЗаполнено(стр.Номенклатура.Артикул) И Не Объект.ВнутреннийЗаказ Тогда
			Сообщение = "Для Нового заказа на оснастку нельзя указывать Артикул!";
			Возврат Сообщение;
		КонецЕсли;
		Если стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega Тогда
			Если Не ЗначениеЗаполнено(стр.РабочийЦентр) Тогда
				Сообщение = "Для Вида РЦ = Omega необходимо заполнить Рабочий центр";
				Возврат Сообщение;
			КонецЕсли;
		КонецЕсли;
		
		Если стр.ВидШтампа = Справочники.ВидыРаботСотрудников.Вырубка И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega ИЛИ
			стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Gallus ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MO3300 ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Drent) ИЛИ
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Flexo И стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",10)) Тогда
			
			Если Не ЗначениеЗаполнено(стр.ВидШтампа) Тогда
				Сообщение = Сообщение + "Не заполнен поле Вид штампа"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ШагПечати) Тогда
				Сообщение = Сообщение + "Не заполнено поле Шаг печати"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Нарезка) Тогда
				Сообщение = Сообщение + "Не заполнено поле Нарезка"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда
				
				Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ИнтервалМеждуЭтикетками) Тогда
				Сообщение = Сообщение + "Не заполнено поле Интервал между этикетками"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ИнтервалМеждуРучьями) Тогда
				Сообщение = Сообщение + "Не заполнено поле Интервал между ручьями"+ Символы.ПС;
			КонецЕсли;
			
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				ШагПечати = Окр((стр.ШиринаЭтикетки + стр.ИнтервалМеждуЭтикетками) * (стр.ЭтикетокНаЛисте/стр.Ручьи),2);
				Если (стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129) ИЛИ стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",8)) Тогда
					Если стр.ШагПечати*1000 < 200 Тогда
						Сообщение = "Шаг печати для Omega 129 и Omega 108 должен быть не менее 200мм";
						Возврат Сообщение;
					КонецЕсли;
					Если стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеРотационное Тогда
						Сообщение = "Нельзя выбирать Ротационное тиснение для Omega 129 и Omega 108!";
						Возврат Сообщение;
					КонецЕсли;		
				КонецЕсли;
					
				Если (стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",123)) Тогда
					Если стр.ШагПечати <> ШагПечати/1000 Тогда
						Сообщение = "Значение поля ШагПечати не совпадает с расчитанным значением: " + ШагПечати/1000;
						Возврат Сообщение;
					КонецЕсли;
				Иначе
					Если стр.ШагПечати*1000 < 50 Тогда
						Сообщение = "Шаг печати для Omega 23 должен быть не менее 50мм";
						Возврат Сообщение;
					КонецЕсли;
	            КонецЕсли;
						
				Нарезка = (стр.ДлинаЭтикетки + стр.ИнтервалМеждуРучьями)*стр.Ручьи - стр.ИнтервалМеждуРучьями + 13;
				Если стр.Нарезка.Размер < Нарезка Тогда
					Сообщение = "Нарезка должна быть больше или равна " + Нарезка;
					Возврат Сообщение;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли (стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное ИЛИ стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное) И
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil ИЛИ 
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И (стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129) ИЛИ стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",8)))) Тогда
			
			Если Не ЗначениеЗаполнено(стр.ВидШтампа) Тогда
				Сообщение = Сообщение + "Не заполнен поле Вид штампа"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда

				Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Материал) Тогда
				Сообщение = Сообщение + "Не заполнено поле Материал"+ Символы.ПС;
			КонецЕсли;
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				Если ТипЗнч(стр.Материал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
					Если стр.Материал.Родитель = Справочники.ЦеновыеГруппы.НайтиПоКоду("000000030") Тогда
						Сообщение = "Необходимо выбрать материал, на котром печатается тираж, нельзя выбирать фольгу!";
						Возврат Сообщение;
					КонецЕсли;
				КонецЕсли;				
				Если (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil) И стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеРотационное Тогда
					Сообщение = "Нельзя выбирать ротационное тиснение для Cartes и NewFoil!";
				КонецЕсли;								
			КонецЕсли;
		ИначеЕсли (стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное ИЛИ стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное) И 
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И (стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 29") И стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 8")
			И стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 19"))) Тогда
					Сообщение = "Плоское тиснение разрешено только  для Omega 129, Omega 108 и Omega 19!";
					Возврат Сообщение;
		ИначеЕсли стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеРотационное И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Gallus ИЛИ
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И (стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 29") И стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 8")))
			ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MO3300 ИЛИ (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Flexo И стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",10))) Тогда
			
			Если Не ЗначениеЗаполнено(стр.ВидШтампа) Тогда
				Сообщение = Сообщение + "Не заполнен поле Вид штампа"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда

				Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;


			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;	
		
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				Если Не ЗначениеЗаполнено(стр.РабочийЦентр) Тогда
					Сообщение = "Необходимо заполнить Рабочий Центр для Ротационного тиснения!";
					Возврат Сообщение;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли стр.ВидШтампа = Справочники.ВидыРаботСотрудников.Конгрев И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS
			ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ
			стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil ИЛИ
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",8)Или
			стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129)Или
			стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",19))) Тогда
			
			Если Не ЗначениеЗаполнено(стр.ВидШтампа) Тогда
				Сообщение = Сообщение + "Не заполнен поле Вид штампа"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда

				Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Материал) Тогда
				Сообщение = Сообщение + "Не заполнено поле Материал"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Подложка) Тогда   ///Временно
				Сообщение = Сообщение + "Не заполнено поле Подложка"+ Символы.ПС;
			КонецЕсли;
				
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				Если Не ЗначениеЗаполнено(стр.РабочийЦентр) Тогда
					Сообщение = "Необходимо заполнить Рабочий Центр для Плоского конгрева!";
					Возврат Сообщение;
				КонецЕсли;
			КонецЕсли;

		//ИначеЕсли стр.ВидШтампа = Справочники.ВидыРаботСотрудников.Конгрев И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И стр.РЦ = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129)) Тогда
		//	Сообщение = "Для машины Omega 129 нельзя выбирать конгрев!";
		//	Возврат Сообщение;
		КонецЕсли;
		Возврат Сообщение;
	Иначе
		Возврат Сообщение;
	КонецЕсли;
		
КонецФункции


&НаСервере
Функция ПроверитьКорректностьЗаполненияЗаказаНаОснастку(стр)
		Сообщение = "";
	Если Объект.ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Новый Тогда
		Если ЗначениеЗаполнено(стр.Номенклатура.Артикул) Тогда
			Сообщение = "Для Нового заказа на оснастку нельзя указывать Артикул!";
			Возврат Сообщение;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(стр.ВидШтампа) Тогда
			Сообщение = "Не заполнен Вид штампа!";
			Возврат Сообщение;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(стр.ВидРЦ) Тогда
			Сообщение = "Не заполнен Вид РЦ!";
			Возврат Сообщение;
		КонецЕсли;
		Если стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega Тогда
			Если Не ЗначениеЗаполнено(стр.РабочийЦентр) Тогда
				Сообщение = "Для Вида РЦ = Omega необходимо заполнить Рабочий центр";
				Возврат Сообщение;
			КонецЕсли;
		КонецЕсли;
		
		Если стр.ВидШтампа = Справочники.ВидыРаботСотрудников.Вырубка И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega ИЛИ
			стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Gallus ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MO3300 ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Drent) ИЛИ
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Flexo И стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",10)) Тогда
			
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ШагПечати) Тогда
				Сообщение = Сообщение + "Не заполнено поле Шаг печати"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Нарезка) Тогда
				Сообщение = Сообщение + "Не заполнено поле Нарезка"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда
				
				Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ИнтервалМеждуЭтикетками) Тогда
				Сообщение = Сообщение + "Не заполнено поле Интервал между этикетками"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;
			Если ЗначениеЗаполнено(стр.Ручьи) Тогда
				Если стр.Ручьи > 1 Тогда
					Если Не ЗначениеЗаполнено(стр.ИнтервалМеждуРучьями) Тогда
						Сообщение = Сообщение + "Не заполнено поле Интервал между ручьями"+ Символы.ПС;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				ШагПечати = Окр((стр.ШиринаЭтикетки + стр.ИнтервалМеждуЭтикетками) * (стр.ЭтикетокНаЛисте/стр.Ручьи),2);
				Если (стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129) ИЛИ стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",8)) Тогда
					Если стр.ШагПечати*1000 < 200 Тогда
						Сообщение = "Шаг печати для Omega 129 и Omega 108 должен быть не менее 200мм";
						Возврат Сообщение;
					КонецЕсли;
					Если стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеРотационное Тогда
						Сообщение = "Нельзя выбирать Ротационное тиснение для Omega 129 и Omega 108!";
						Возврат Сообщение;
					КонецЕсли;		
				КонецЕсли;
					
				Если (стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",123)) Тогда
					Если стр.ШагПечати <> ШагПечати/1000 Тогда
						Сообщение = "Значение поля ШагПечати не совпадает с расчитанным значением: " + ШагПечати/1000;
						Возврат Сообщение;
					КонецЕсли;
				Иначе
					Если стр.ШагПечати*1000 < 50 Тогда
						Сообщение = "Шаг печати для Omega 23 должен быть не менее 50мм";
						Возврат Сообщение;
					КонецЕсли;
	            КонецЕсли;
						
				Нарезка = (стр.ДлинаЭтикетки + стр.ИнтервалМеждуРучьями)*стр.Ручьи - стр.ИнтервалМеждуРучьями + 13;
				Если стр.Нарезка.Размер < Нарезка Тогда
					Сообщение = "Нарезка должна быть больше или равна " + Нарезка;
					Возврат Сообщение;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли (стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное ИЛИ стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное) И
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil ИЛИ 
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И (стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129) ИЛИ стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",8)
			ИЛИ стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",19)))) Тогда
			
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда

				Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Материал) Тогда
				Сообщение = Сообщение + "Не заполнено поле Материал"+ Символы.ПС;
			КонецЕсли;
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				Если ТипЗнч(стр.Материал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
					Если стр.Материал.Родитель = Справочники.ЦеновыеГруппы.НайтиПоКоду("000000030") Тогда
						Сообщение = "Необходимо выбрать материал, на котром печатается тираж, нельзя выбирать фольгу!";
						Возврат Сообщение;
					КонецЕсли;
				КонецЕсли;				
				Если (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil) И стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеРотационное Тогда
					Сообщение = "Нельзя выбирать ротационное тиснение для Cartes и NewFoil!";
				КонецЕсли;								
			КонецЕсли;
		ИначеЕсли (стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное ИЛИ стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное) И 
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И (стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 29") И стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 8") 
			И стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 19"))) Тогда
					Сообщение = "Плоское тиснение разрешено только  для Omega 129, Omega 108 и Omega 19!";
					Возврат Сообщение;
		ИначеЕсли стр.ВидШтампа = Справочники.ВидыРаботСотрудников.ГорячееТиснениеРотационное И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Gallus ИЛИ
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И (стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 29") И стр.РабочийЦентр <> Справочники.РабочиеЦентры.НайтиПоНаименованию("Omega № 8")))
			ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MO3300 ИЛИ (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Flexo И стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",10))) Тогда
			
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда

				Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;


			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;	
		
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				Если Не ЗначениеЗаполнено(стр.РабочийЦентр) Тогда
					Сообщение = "Необходимо заполнить Рабочий Центр для Ротационного тиснения!";
					Возврат Сообщение;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли стр.ВидШтампа = Справочники.ВидыРаботСотрудников.Конгрев И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.MPS ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Cartes ИЛИ стр.ВидРЦ = Справочники.ВидыРабочихЦентров.NewFoil ИЛИ
			(стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И (стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",8) ИЛИ стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129)
			ИЛИ стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",19)))) Тогда
			
			Если Не ЗначениеЗаполнено(стр.Количество) Тогда
				Сообщение = Сообщение + "Не заполнено поле Количество"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ДлинаЭтикетки) Тогда

			Если Объект.Площадка = Справочники.Лико_Площадки.Урал  Тогда   
					Сообщение = Сообщение + "Не заполнено поле Длина этикетки"+ Символы.ПС;		
				Иначе
					Сообщение = Сообщение + "Не заполнено поле Высота этикетки"+ Символы.ПС
				КонецЕсли;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(стр.ШиринаЭтикетки) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ширина эткетки"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Ручьи) Тогда
				Сообщение = Сообщение + "Не заполнено поле Ручи"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.ЭтикетокНаЛисте) Тогда
				Сообщение = Сообщение + "Не заполнено поле Этикеток на листе"+ Символы.ПС;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(стр.Материал) Тогда
				Сообщение = Сообщение + "Не заполнено поле Материал"+ Символы.ПС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(стр.Подложка) Тогда   ///Временно
				Сообщение = Сообщение + "Не заполнено поле Подложка"+ Символы.ПС;
			КонецЕсли;
				
			Если Сообщение <> "" Тогда
				Возврат Сообщение
			Иначе
				Если Не ЗначениеЗаполнено(стр.РабочийЦентр) Тогда
					Сообщение = "Необходимо заполнить Рабочий Центр для Плоского конгрева!";
					Возврат Сообщение;
				КонецЕсли;
			КонецЕсли;

		//ИначеЕсли стр.ВидШтампа = Справочники.ВидыРаботСотрудников.Конгрев И (стр.ВидРЦ = Справочники.ВидыРабочихЦентров.Omega И стр.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",129)) Тогда
		//	Сообщение = "Для машины Omega 129 нельзя выбирать конгрев!";
		//	Возврат Сообщение;
		КонецЕсли;
		Возврат Сообщение;
	Иначе
		Возврат Сообщение;
	КонецЕсли;

КонецФункции




&НаСервере
Процедура ПодтвердитьВсеНаСервере()
	Для каждого стр из Объект.Оснастка Цикл
		Если Объект.Площадка = Справочники.Лико_Площадки.Ликофлекс И НЕ Лико_Дополнительно.РольДоступнаНаСервере("Лико_ИнженерОснастки") Тогда
			Сообщение = ПроверитьКорректностьЗаполненияЗаказаНаОснастку(стр);
			Если Сообщение <> "" Тогда
				Сообщить(Сообщение);
				Продолжить
			Иначе
				стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Подтвержден");
			КонецЕсли
		Иначе			
		    стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Подтвержден");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодтвержденНаСервере()
	стр = Объект.Оснастка.НайтиПоИдентификатору(Элементы.Оснастка.ТекущаяСтрока);
	Если Объект.Площадка = Справочники.Лико_Площадки.Ликофлекс И НЕ Лико_Дополнительно.РольДоступнаНаСервере("Лико_ИнженерОснастки") Тогда
		Сообщение = ПроверитьКорректностьЗаполненияЗаказаНаОснастку(стр);
		Если Сообщение <> "" Тогда
			Сообщить(Сообщение,СтатусСообщения.Важное);
		Иначе
			Если стр <> Неопределено Тогда 
				стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Подтвержден");
			КонецЕсли;
		КонецЕсли
	Иначе
		Если стр <> Неопределено Тогда 
			стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Подтвержден");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подвержден(Команда)
	ПодтвержденНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Размещен(Команда)
	стр = Элементы.Оснастка.ТекущиеДанные;

	Если стр <> Неопределено Тогда 
		стр = Элементы.Оснастка.ТекущиеДанные;
		стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Размещен");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВсе(Команда)
	ПодтвердитьВсеНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура РазместитьВсе(Команда)
	Для каждого стр из Объект.Оснастка Цикл;
		стр.статус =ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Размещен");
    КонецЦикла;
КонецПроцедуры



&НаКлиенте
Процедура СтатусыЗаказа(Команда)


	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаказНаОснастку",объект.ссылка);
		
	ОткрытьФорму("РегистрСведений.Лико_ЗаказыНаОснастку.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОснасткаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если новаяСтрока Тогда 
		КлючСтроки = Новый УникальныйИдентификатор;
		Элемент.ТекущиеДанные.КлючСтроки =   КлючСтроки;
		ТД=Элемент.ТекущиеДанные;
		ТД.ВнутреннийЗаказ=Неопределено;
        ТД.ЗаказНаПроизводство=Неопределено; 		
   КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОснасткаПриАктивизацииСтроки(Элемент)
	стр = Элементы.Оснастка.ТекущиеДанные;
	Если стр<>Неопределено Тогда 
		КлючСтроки =стр.КлючСтроки;
		Элементы.Этикетки.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", КлючСтроки); 
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЭтикеткиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	стр = Элементы.Оснастка.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		Элемент.ТекущиеДанные.КлючСтроки = стр.ключстроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоТехнологу(Команда)
	ОтправитьПисьмоНаСервере(Истина, ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоТехнологуИМенеджерам(Команда)
	ОтправитьПисьмоНаСервере(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоМенеджерам(Команда)
	ОтправитьПисьмоНаСервере(Ложь,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьДоступностьЗаказаНаПроизводствоКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЗаказаНаПроизводствоКлиент() //+Лико m.shenderov 26.08.2021
	//Элементы.ОснасткаСоздатьОткрытьЗаказНаПроизводство.Доступность=
	//	Элементы.Оснастка.ТекущиеДанные<>Неопределено 
	//	И Элементы.Оснастка.ТекущиеДанные.ВнутреннийЗаказ; 
КонецПроцедуры //-Лико m.shenderov 26.08.2021



&НаКлиенте
Процедура ВидимостьПараметров(Команда)
	ВидимостьПараметров = НЕ Элементы.ОснасткаДиаметр.Видимость;
	УстановитьВидимостьПараметров(ВидимостьПараметров, ВидимостьПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если Объект.ВидОперации  = ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийЗаказОснастки.Перезаказ") Тогда 
		УстановитьВидимостьПараметров(Ложь,Ложь);
	Иначе
		УстановитьВидимостьПараметров(Истина,Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОснасткаПередУдалением(Элемент, Отказ)
	стр = Элементы.Оснастка.ТекущиеДанные;
	//Если Не (РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("Лико_Технолог")) Тогда 
	//	Если ЗначениеЗаполнено(стр.Статус) ТОгда 
	//		Если НЕ (стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Создан")  ИЛИ   стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Отменен") ) Тогда
	//			СообщениеПользователю = "Нельзя удалять строки со статусом отличным от Создан или Отменен";
	//			//Сообщить(СообщениеПользователю);
	//			Предупреждение(СообщениеПользователю, 15);
	//			Отказ = Истина;
	//			Возврат;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЕсли;	
	УдалитьЭтикетки(стр.КлючСтроки);

КонецПроцедуры


&НаКлиенте
Процедура УдалитьЭтикетки(Ключстроки)
//Удаляем все строки из Машины данного варианта 	
	МассивСтрок = Объект.Этикетки.НайтиСтроки(Новый Структура("КлючСтроки",  КлючСтроки));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект.Этикетки.Удалить(ЭлементМассива);
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДокумент = ПечатьЗаказОснасткиНаСервере();
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ЭкземпляровНаСтранице=1;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.Показать();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличие(Команда)
	текстр = Элементы.Оснастка.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.Заказ) Тогда 
		ВыполняемаяОбработка=НайтиВПФ("Отчет ""Проверка оснастки""");
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
		ДопПараметры = Новый Структура("Заказ", текстр.Заказ);
		ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма",ДопПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Сч=0;
	Для каждого Оснастка  Из Объект.Оснастка Цикл
		Если Не ЗначениеЗаполнено(Оснастка.Заказ) И Не ЗначениеЗаполнено(Оснастка.Партнер) Тогда
			Отказ= Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заполните поле: ""Заказ"" или поле:""Партнер""";
			Сообщение.Поле = СтрШаблон("Объект.Оснастка[%1].Заказ",Строка(Сч)); //имя реквизита 
			Сообщение.УстановитьДанные("Объект"); //Ссылка на объект ИБ
			Сообщение.Сообщить();
		КонецЕсли;
		Сч=Сч+1;
	КонецЦикла;
	
	ПроверкаНаСервереПередЗаписью(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура Отменен(Команда)
	стр = Элементы.Оснастка.ТекущиеДанные;

	Если стр <> Неопределено Тогда 
		стр = Элементы.Оснастка.ТекущиеДанные;
		стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Отменен");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого стр из Объект.Оснастка Цикл;
		стр.статус =ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Отменен");
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СрочныйПриИзменении(Элемент)
	Если Объект.Срочный = Истина Тогда 
		Для каждого стр из Объект.Оснастка Цикл;
			Если стр.статус =ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Создан") Тогда 
				стр.статус =ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Подтвержден");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснасткаПередНачаломИзменения(Элемент, Отказ)
	//стр = Элементы.Оснастка.ТекущиеДанные;
	////Если Не (РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("Лико_Технолог")) Тогда 
	//Если ЗначениеЗаполнено(стр.Статус) ТОгда 
	//	Если НЕ (стр.статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан  ИЛИ   стр.статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Отменен ) Тогда
	//		Если Элемент.ТекущийЭлемент.Имя <> "ОснасткаЗаказ" И Элемент.ТекущийЭлемент.Имя <>   "ОснасткаКонтрагент" И  Элемент.ТекущийЭлемент.Имя <>   "ОснасткаТираж"   Тогда
	//			
	//			СообщениеПользователю = "Нельзя изменять строки со статусом отличным от Создан или Отменен";
	//			//Сообщить(СообщениеПользователю);
	//			Предупреждение(СообщениеПользователю, 15);
	//			Отказ = Истина;
	//			Возврат;
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;
	////	//КонецЕсли;	
	
КонецПроцедуры



&НаКлиенте
Процедура ПечатьПоСтроке(Команда)
	стр = Элементы.Оснастка.ТекущиеДанные;

	ТабДокумент = ПечатьЗаказОснасткиНаСервере(стр.номерстроки);
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ЭкземпляровНаСтранице=1;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.Показать();

КонецПроцедуры

&НаКлиенте
Процедура ОснасткаПриАктивизацииЯчейки(Элемент)
	стр = Элементы.Оснастка.ТекущиеДанные;
	Если стр<> Неопределено Тогда 
		//Если Не (РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("Лико_Технолог")) Тогда 
		//	Если ЗначениеЗаполнено(стр.Статус) ТОгда 
		//		Если НЕ (стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Создан")  ИЛИ   стр.статус = ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.Отменен") ) Тогда
		//			Если Элемент.ТекущийЭлемент.Имя <> "ОснасткаЗаказ" И Элемент.ТекущийЭлемент.Имя <>   "ОснасткаКонтрагент" И  Элемент.ТекущийЭлемент.Имя <>   "ОснасткаТираж"   Тогда
		//				элемент.ТекущийЭлемент.Доступность = Ложь;
		//				Возврат;
		//			КонецЕсли;
		//		КонецЕсли;	
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	УстановитьДоступностьЗаказаНаПроизводствоКлиент();
КонецПроцедуры

&НаКлиенте
Процедура БыстраяПечать(Команда)
	стр = Элементы.Оснастка.ТекущиеДанные;

	ТабДокумент = ПечатьЗаказОснасткиНаСервере(стр.номерстроки);
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ЭкземпляровНаСтранице=1;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.Напечатать(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОБЗ(Команда)
	стр = Элементы.Оснастка.ТекущиеДанные;
	Если ЗначениеЗаполнено(Стр.Заказ) Тогда
			ВыполняемаяОбработка=НайтиВПФ("Печатная форма ""Офисный бланк заказа""");
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ОбъектыНазначения=Новый Массив;
		ОбъектыНазначения.Добавить(Стр.Заказ);
		//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
		ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
		ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
		ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
		ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ПечатнаяФормаОфисныйБланкЗаказа";
		ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия); 

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	ОбновитьЗаголовокДлинаШирина();
КонецПроцедуры

&НаКлиенте
Процедура ОснасткаТипРЦ1ПриИзменении(Элемент)
	
КонецПроцедуры

Процедура УстановитьВидемостьДляРазработчика3dМоделей() //+Лико m.shenderov 14.04.2021
УстановитьВидимостьПараметров(Ложь,Ложь);
Элементы.ФормаВидимостьПараметров.Доступность=Ложь;
Элементы.ШапкаВерх.Доступность               =Ложь;
Элементы.ГруппаВнутреннийЗаказ.Доступность   =Ложь;
Элементы.Оснастка.КоманднаяПанель.Видимость  =Ложь;
Элементы.ОснасткаРазработчик.Видимость       =Ложь;
Элементы.ОснасткаТрудозатраты.Видимость      =Ложь;
Элементы.Оснастка.ИзменятьПорядокСтрок       =Ложь;
Элементы.Оснастка.ИзменятьСоставСтрок        =Ложь;
Элементы.Комментарий.Видимость               =Ложь;
Элементы.ГруппаПараметры.Видимость           =Ложь;
Элементы.ОснасткаПримечание.Видимость        =Ложь;

	
КонецПроцедуры //-Лико m.shenderov 14.04.2021

&НаКлиенте
Процедура СоздатьОткрытьЗаказНаПроизводство(Команда)
	  СоздатьОткрытьЗаказНаПроизводствоКлиент();
		
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьОткрытьЗаказНаПроизводствоКлиент () //+Лико m.shenderov 13.09.2021
	
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли; 	
	
	ТД=Элементы.Оснастка.ТекущиеДанные; 
	
	Если  ТД<>Неопределено  Тогда
		Если Не ЗначениеЗаполнено(ТД.ЗаказНаПроизводство) Тогда
			
			ЕстьРегион=ЗначениеЗаполнено(ТД.Регион) Или 
			ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Регион")) Или
			ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Партнер,"БизнесРегион"));
			
			Если Не ЗначениеЗаполнено(ТД.Номенклатура) Тогда
				СообщитьПользвателюКлиент("Номенклатура");
			     Возврат ;
			КонецЕсли;
			
			Если Не ЕстьРегион Тогда
				СообщитьПользвателюКлиент("Регион");
				Возврат ;
			КонецЕсли;
			
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Ждать ВопросАсинх(СтрШаблон("Создать заказ на производство для : %1 %2 ?",ТД.Номенклатура,ТД.Номенклатура), Режим, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
			
			Организация   = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Организация");
			Организация   = ?(ЗначениеЗаполнено(Организация),Организация,Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Получатель,"Организация"));
			
			Регион=
			?(
			ЗначениеЗаполнено(ТД.Регион),
			ТД.Регион,
			Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Регион")
			);  			
			
			ТД.ЗаказНаПроизводство=СоздатьЗаказНаполуфабрикатСервер(Организация,Объект.Площадка,ТД.Заказ,ТД.Партнер,Регион,ТД.Номенклатура,ТД.Количество,Истина);
			//ТД.ЗаказНаПроизводство=Документы.Лико_ЗаказОснастки.СоздатьЗаказНаполуфабрикат(Организация,Объект.Площадка,ТД.Заказ,ТД.Партнер,Регион,ТД.Номенклатура,ТД.Количество,Истина);

			Записать(Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный));  			
			//НаправитьВРаботуСервер(ТД.ЗаказНаПроизводство,ТД.Номенклатура);
			
			Возврат;
			
		КонецЕсли;
		Если ЗначениеЗаполнено(ТД.ЗаказНаПроизводство) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ",ТД.ЗаказНаПроизводство);
			ОписаниеОповещение=Новый ОписаниеОповещения("ЗакрытиеФормыЗаказаЗавершение",ЭтаФорма);
			ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента_ЗаказОснастки",ПараметрыФормы,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;

	
	
КонецПроцедуры //-Лико m.shenderov 13.09.2021

&НаКлиенте
Асинх Процедура СоздатьЗаказыНаПроизводствоКлиент () //+Лико m.shenderov 13.09.2021
	
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли;
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Ждать ВопросАсинх(СтрШаблон("Создать заказы на производство?"), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	
	Отказ=Ложь;
	ТД=Элементы.Оснастка.ТекущиеДанные; 
	
	Для каждого ТД Из Объект.Оснастка Цикл
		
		Если ТД.ВнутреннийЗаказ И Не ЗначениеЗаполнено(ТД.ЗаказНаПроизводство) Тогда
			
			ЕстьРегион=ЗначениеЗаполнено(ТД.Регион) Или 
			ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Регион")) Или
			ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Партнер,"БизнесРегион"));
			
			Если Не ЗначениеЗаполнено(ТД.Номенклатура) Тогда
				СообщитьПользвателюКлиент("Номенклатура");
				Отказ=Истина;
			КонецЕсли;
			
			Если Не ЕстьРегион Тогда
				СообщитьПользвателюКлиент("Регион");
				Отказ=Истина;
			КонецЕсли;
			
			
			
			Организация   = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Организация");
			Организация   = ?(ЗначениеЗаполнено(Организация),Организация,Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Получатель,"Организация"));
			
			Регион=
			?(
			ЗначениеЗаполнено(ТД.Регион),
			ТД.Регион,
			Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Регион")
			);  			
			
			ТД.ЗаказНаПроизводство=СоздатьЗаказНаполуфабрикатСервер(Организация,Объект.Площадка,ТД.Заказ,ТД.Партнер,Регион,ТД.Номенклатура,?(ТД.Количество=0,1,ТД.Количество),Истина);
			Записать(Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный));  			
			//НаправитьВРаботуСервер(ТД.ЗаказНаПроизводство,ТД.Номенклатура);
			
			
			
		КонецЕсли;
	КонецЦикла;
	

	
	
КонецПроцедуры //-Лико m.shenderov 13.09.2021




&НаКлиенте
Процедура ЗакрытиеФормыЗаказаЗавершение(Результат,Параметры) Экспорт//+Лико m.shenderov 02.09.2021
	Элементы.Оснастка.Обновить();
КонецПроцедуры //-Лико m.shenderov 02.09.2021

&НаСервереБезКонтекста
Процедура 	НаправитьВРаботуСервер(Заказ,Номенклатура) //+Лико m.shenderov 02.09.2021
	
	Лико_Планирование.НаправитьВРаботуЗаказОснастки(Заказ);
	Этап=Лико_Дополнительно.НайтиВыпускающийЭтапПоЗаказуКлиента(Заказ,,Ложь);
	РабочийЦентр=НайтиРЦПерессГравировкиСервер();
	Если  УправлениеСвойствами.ЗначениеСвойства(Номенклатура,"ОстасткаВидШтампа")=Справочники.Лико_ВидШтампа.КонгревКонтрМатрица Тогда
		
		Лико_Дополнительно.ДобавитьЭтапПроизводстваВКонецПлана(Этап,РабочийЦентр,Заказ,1);
	КонецЕсли;
	//ОснасткаСоздатьСообщение(Заказ);
	Документы.Лико_ЗаказОснастки.ОснасткаСоздатьСообщение(Заказ);
КонецПроцедуры  //-Лико m.shenderov 02.09.2021



&НаСервереБезКонтекста
Функция  СоздатьЗаказНаполуфабрикатСервер(Организация,Площадка,ЗаказКлиента,Партнер,Регион,Номенклатура,Количество,НаправитьВРаботу=Ложь)
	
	Возврат Документы.Лико_ЗаказОснастки.СоздатьЗаказНаполуфабрикат(Организация,Площадка,ЗаказКлиента,Партнер,Регион,Номенклатура,Количество,НаправитьВРаботу=Ложь);
	
	
	Если СтрНайти(НРег(Номенклатура.Наименование),"контрматрица") Тогда		
		
		Этап   = Справочники.Лико_ЭтапыВыполненияЗаказа.ГотовКГравировке;
		Статус = Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ГотовКГравировке;
		
	Иначе 		
		
		Этап   = Справочники.Лико_ЭтапыВыполненияЗаказа.ВключенВПлан;
		Статус = Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан;
		
	КонецЕсли;
	
	
	Ссылка=Неопределено;
	НачатьТранзакцию();
	
	НовыйЗаказ              							=  Документы.ЗаказКлиента.СоздатьДокумент();
	НовыйЗаказ.ИнициализироватьНачальныеПараметры(Неопределено);
	НовыйЗаказ.ТипЗаказа    								= Перечисления.Лико_ТипыЗаказов.Полуфабрикат;
	// <-- Начало Лико Яцун С. В. 21.10.2025 
	НовыйЗаказ.Менеджер   									= ЗаказКлиента.Менеджер;
	// <-- Конец Лико Яцун С. В. 21.10.2025
	НовыйЗаказ.Партнер      								= ?(ЗначениеЗаполнено(ЗаказКлиента),ЗаказКлиента.Партнер,Партнер);
	НовыйЗаказ.Контрагент   								= ЗаказКлиента.Контрагент;
	//НовыйЗаказ.СтатусЗаказаНаПроизводствоОснасткиОснастки	= Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан;
	НовыйЗаказ.СтатусЗаказаНаПроизводствоОснасткиОснастки	= Статус;
	НовыйЗаказ.Организация  							 	= Организация;
	НовыйЗаказ.ВидЗаказа    							 	= Перечисления.Лико_ВидыЗаказов.Оснастка;
	НовыйЗаказ.Склад										= ПараметрыСеанса.Лико_РабочееМесто.СкладСИМ;
	НовыйЗаказ.Регион       								= Регион;
	НовыйЗаказ.Площадка     								= Площадка;
	НовыйЗаказ.Валюта       								= ЗаказКлиента.Валюта;
	НовыйЗаказ.Этикетки     								= ЗаказКлиента.Этикетки;
	РЦ														= ПолучитьРабочийЦентрГравировальныйУчастокСервер(Площадка);
	НовыйЗаказ.ВалютаДляДокументов 							= ЗаказКлиента.ВалютаДляДокументов;
	НовыйЗаказ.Дата         								= ТекущаяДата(); 	
	ТЧТовары                								= НовыйЗаказ.Товары;
	НоваяСтрокаПФ           								= ТЧТовары.Добавить();
	НоваяСтрокаПФ.Номенклатура 								= Номенклатура;
	НоваяСтрокаПФ.КоличествоУпаковок 						= Количество;
	НоваяСтрокаПФ.Количество        						= Количество;
	НоваяСтрокаПФ.Заказ 									= ЗаказКлиента;
	НовыйВидРабот											= НовыйЗаказ.ВидыРабот.Добавить();
	НовыйВидРабот.РабочийЦентр								= ПолучитьРабочийЦентрГравировальныйУчастокСервер(Площадка);
	НовыйВидРабот.ВидРабот									= Справочники.ВидыРаботСотрудников.Гравировка;
	НовыйВидРабот.НомерПроката								= 1;
	НовыйЗаказ.Подразделение								= НовыйВидРабот.РабочийЦентр.ВидРабочегоЦентра.Подразделение;
	НовыйЗаказ.Записать();
	
	Лико_ОбщегоНазначенияСервер.ЗаписатьРСЛико_ЭтапыЗаказа(
															ЗаказКлиента,
															Площадка,
															Этап,
															НовыйЗаказ.Дата,
															Новый Структура("Ответственный,Количество",Пользователи.ТекущийПользователь(),1)	
															);
	Ссылка=НовыйЗаказ.Ссылка;	
	Если НаправитьВРаботу Тогда
		НаправитьВРаботуСервер(Ссылка,Номенклатура);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();											
	
	Возврат Ссылка;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРабочийЦентрГравировальныйУчастокСервер(Площадка) //+Лико m.shenderov 24.08.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РабочиеЦентры.Ссылка КАК Ссылка,
	|	РабочиеЦентры.ПорядковыйНомер КАК ПорядковыйНомер
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Лико_Площадка = &Площадка
	|	И РабочиеЦентры.ПорядковыйНомер <> 0
	|	И РабочиеЦентры.ВидРабочегоЦентра = &ВидРабочегоЦентра
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеЦентры.ПорядковыйНомер";
	Запрос.УстановитьПараметр("Площадка",Площадка );
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",Справочники.ВидыРабочихЦентров.ГравировальныйУчасток);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
КонецФункции  //-Лико m.shenderov 24.08.2021


&НаСервереБезКонтекста
Процедура ОснасткаСоздатьСообщение(Заказ) //+Лико m.shenderov 02.09.2021
	УстановитьПривилегированныйРежим(Истина);	
	Если Заказ.СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан  Тогда		
		ЗаголовокСообщения="Включен в план.";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ПрограммированиеОснастки;		
	Иначе
		ЗаголовокСообщения="готов к гравировке.";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ГотовКГравировкеОснастки;		
	КонецЕсли;
	
	Текст =  СтрШаблон("Заказ N %1 %2",Заказ.НомерБезПрефикса,ЗаголовокСообщения);
	
	Тема  = Текст;
	Текст=Текст+ Символы.ПС+ "Ссылка : "+Символы.ПС+Символы.ВК+ПолучитьНавигационнуюСсылку(Заказ.Ссылка);
	Для каждого Товар  Из Заказ.Товары  Цикл
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+ "        Номенклатура :  "+ СокрЛП(Товар.Номенклатура.Артикул)+" "+Строка(Товар.Номенклатура.Наименование);			
	КонецЦикла;	
	Текст=Текст+Символы.ПС+Символы.ВК;
	Текст=Текст+Заказ.Комментарий+Символы.ПС+Символы.ВК;
	
	
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Заказ.Площадка); 		
	
	Лико_Планирование.ОтправитьПисьмо(Текст, Тема, Адресат,,"textBody"); 
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.09.2021

&НаСервереБезКонтекста 
Функция НайтиРЦПерессГравировкиСервер() //+Лико m.shenderov 13.09.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Ссылка КАК РЦ ИЗ Справочник.РабочиеЦентры КАК РЦ ГДЕ РЦ.Лико_ПрессГравировки";
		

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	     Возврат Выборка.РЦ;
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 13.09.2021 




// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры


&НаКлиенте
Процедура ВнутреннийЗаказПриИзменении(Элемент)
	Для каждого СтрОснастка Из Объект.Оснастка Цикл
		СтрОснастка.ВнутреннийЗаказ=Объект.ВнутреннийЗаказ;
	КонецЦикла;
	УстановитьДоступностьЗаказаНаПроизводствоКлиент();
КонецПроцедуры


&НаКлиенте
Процедура ОснасткаВнутреннийЗаказПриИзменении(Элемент)
	ТД=Элементы.Оснастка.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Тд.ЗаказНаПроизводство) И Не ТД.ВнутреннийЗаказ Тогда
		ТД.ВнутреннийЗаказ=Истина;
	КонецЕсли;
	
	Статус= ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказовНаОснастку.ВнутреннийЗаказ");
	
	Если ТД.ВнутреннийЗаказ И ТД.Статус<>Статус Тогда
		ТД.Статус=Статус;
	КонецЕсли;
	
	
	УстановитьДоступностьЗаказаНаПроизводствоКлиент();
	УстановитьВидимостьСервер();
КонецПроцедуры


&НаКлиенте
Процедура ОснасткаКонтрагентПриИзменении(Элемент)
	ТД=Элементы.Оснастка.ТекущиеДанные;
	ТД.Регион=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Партнер,"БизнесРегион");
	
КонецПроцедуры


&НаКлиенте
Процедура ОснасткаЗаказПриИзменении(Элемент)
	ТД=Элементы.Оснастка.ТекущиеДанные;
	ТД.Партнер=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Заказ,"Партнер");
	ТД.Регион=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Партнер,"БизнесРегион");

КонецПроцедуры


&НаКлиенте
Процедура ОснасткаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭтоИнженерОСнасткиСервер() И  (Поле.Имя="ОснасткаЗаказНаПроизводствоНомерБезПрефикса" Или 
		Поле.Имя="ОснасткаЗаказНаПроизводствоСтатусЗаказаНаПроизводствоОснасткиОснастки") Тогда
		Тд=Элементы.Оснастка.ТекущиеДанные;
		Если  ТД<>Неопределено И  ТД.ВнутреннийЗаказ Тогда
			СоздатьОткрытьЗаказНаПроизводство(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	
	//*************************
	//************************* 
	
	Если Объект.ВидОперации  = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ  И
		НЕ РольДоступна("Лико_ИнженерОснастки") И
		НЕ РольДоступна("ПолныеПрава")	Тогда 
		
		УстановитьВидимостьПараметров(Ложь,Ложь);
	Иначе
		УстановитьВидимостьПараметров(Истина,Истина);
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЗаказКлиента")
		И Параметры.Ключ.Пустая() И НЕ Лико_Дополнительно.РольДоступнаНаСервере("Лико_ИнженерОснастки") Тогда
		Элементы.ВидОперации.Доступность = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		Для каждого стр из Объект.Оснастка Цикл
			стр.статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан;	
		КонецЦикла;
	КонецЕсли;	
	
	Если Не (РольДоступна("ПолныеПрава") ИЛИ 
		РольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке") ИЛИ 
		Лико_Дополнительно.РольДоступнаНаСервере("Лико_ИнженерОснастки")) Тогда 
		Элементы.Комментарий.Доступность = Ложь;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.Номер.Доступность = Ложь;
	КонецЕсли;
	
	Если  Не РольДоступна("ПолныеПрава") И  УправлениеДоступом.ЕстьРоль("Лико_Разработчик3dМоделей") Тогда
		УстановитьВидемостьДляРазработчика3dМоделей();
	КонецЕсли; 	
	
	
	//************************
	//************************
	
	
	
	
	
	ДобавитьУсловноеОформление();
	ОбновитьЗаголовокДлинаШирина();

	УстановитьВидимостьСервер();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСервер() //+Лико m.shenderov 01.09.2021

Элементы.ОснасткаСоздатьЗаказыНаПроизводство.Видимость=ЭтоИнженерОСнасткиСервер();	
		
	
КонецПроцедуры  //-Лико m.shenderov 01.09.2021

&НаКлиенте
Процедура СообщитьПользвателюКлиент(ИмяРеквизита) //+Лико m.shenderov 13.09.2021
	            ИндексСтроки=Строка( Элементы.Оснастка.ТекущаяСтрока);
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не заполнен реквизит %1 !",ИмяРеквизита);
				Сообщение.Поле = СтрШаблон("Объект.Оснастка[%1].%2",ИндексСтроки,ИмяРеквизита); //имя реквизита 
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();

КонецПроцедуры //-Лико m.shenderov 13.09.2021

&НаКлиенте
Процедура СоздатьЗаказыНаПроизводство(Команда)
	
	СоздатьЗаказыНаПроизводствоКлиент();
	
КонецПроцедуры

&НаСервере
Функция ЭтоИнженерОСнасткиСервер() //+Лико m.shenderov 21.09.2021
 Возврат РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ИнженерОснастки"); 	
КонецФункции  //-Лико m.shenderov 21.09.2021

&НаКлиенте
Процедура ДопОснастка(Команда)
	ТД=Элементы.Оснастка.ТекущиеДанные;
	Если ТД=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Артикул=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Номенклатура,"Артикул");
	Структура = Новый Структура;
	Структура.Вставить("Артикул",Артикул);

	ОО= Новый ОписаниеОповещения("ДопОснасткаЗавершение",ЭтаФорма);
	
	ОткрытьФорму("Документ.Лико_ЗаказОснастки.Форма.ФормаПодбораДопОснастки",Структура,,,,,ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопОснасткаЗавершение(Результат, Параметры) Экспорт  //+Лико m.shenderov 13.10.2021
	
	Если ТипЗнч(Результат)=Тип("Массив") и Результат.Количество()>0 Тогда
		ТД=Элементы.Оснастка.ТекущиеДанные;
		//Массив = Новый Массив();
		//Массив.Добавить(ТД);
		
		//Тз=Объект.ОСнастка.Выгрузить(Массив);
		
		Для каждого Номенклатура Из Результат Цикл
			
			НоваяОснастка=Объект.Оснастка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяОснастка,ТД,,"КлючСтроки,Номенклатура,ЗаказНаПроизводство");
			НоваяОснастка.Номенклатура=Номенклатура;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 13.10.2021

