
&НаКлиенте
Процедура СписокРеквизитовДокументаФормулаПриИзменении(Элемент)
	ТекущаяСтрока= СписокРеквизитовДокумента.НайтиПоИдентификатору(Элементы.СписокРеквизитовДокумента.ТекущаяСтрока);
	ТекущаяСтрока.ЕстьФормула=?(ЗначениеЗаполнено(ТекущаяСтрока.Формула),Истина,Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокументОснование") И Параметры.Свойство("Документ") Тогда
		ДокументОснование=Параметры.ДокументОснование;
		Документ=Параметры.Документ;
		НовыйРеквизит=СписокРеквизитовДокумента.Добавить();
			НовыйРеквизит.Имя="Номер";
			НовыйРеквизит.Синоним="Номер";
			Если Параметры.Свойство("Реквизиты") Тогда
				//НайденыйРеквизит= Параметры.Реквизиты.НайтиСтроки(Новый Структура("Имя",НовыйРеквизит.Имя));	
				Для каждого Реквизит Из Параметры.Реквизиты  Цикл 					
					Если Реквизит.Имя=НовыйРеквизит.Имя Тогда					
						НовыйРеквизит.Формула=Реквизит.Формула;
						НовыйРеквизит.ЕстьФормула=?(ЗначениеЗаполнено(НовыйРеквизит.Формула),Истина,Ложь);
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли; 
			
			НовыйРеквизит=СписокРеквизитовДокумента.Добавить();
			НовыйРеквизит.Имя="Дата";
			НовыйРеквизит.Синоним="Дата";
			Если Параметры.Свойство("Реквизиты") Тогда
				//НайденыйРеквизит= Параметры.Реквизиты.НайтиСтроки(Новый Структура("Имя",НовыйРеквизит.Имя));	
				Для каждого Реквизит Из Параметры.Реквизиты  Цикл 					
					Если Реквизит.Имя=НовыйРеквизит.Имя Тогда					
						НовыйРеквизит.Формула=Реквизит.Формула;
						НовыйРеквизит.ЕстьФормула=?(ЗначениеЗаполнено(НовыйРеквизит.Формула),Истина,Ложь);
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли; 

		
		
		Для каждого РеквизитДокумента Из Метаданные.Документы[Документ].Реквизиты  Цикл
			НовыйРеквизит=СписокРеквизитовДокумента.Добавить();
			НовыйРеквизит.Имя=РеквизитДокумента.Имя;
			НовыйРеквизит.Синоним=РеквизитДокумента.Синоним;  			
			Если Параметры.Свойство("Реквизиты") Тогда
				//НайденыйРеквизит= Параметры.Реквизиты.НайтиСтроки(Новый Структура("Имя",НовыйРеквизит.Имя));	
				Для каждого Реквизит Из Параметры.Реквизиты  Цикл 					
					Если Реквизит.Имя=НовыйРеквизит.Имя Тогда					
						НовыйРеквизит.Формула=Реквизит.Формула;
						НовыйРеквизит.ЕстьФормула=?(ЗначениеЗаполнено(НовыйРеквизит.Формула),Истина,Ложь);
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;
		КонецЦикла; 
		Для каждого ТЧ Из Метаданные.Документы[Документ].ТабличныеЧасти Цикл
			Для каждого РеквизитДокумента Из ТЧ.Реквизиты  Цикл
				НовыйРеквизит=СписокРеквизитовДокумента.Добавить();
				НовыйРеквизит.Имя=ТЧ.Имя+"."+РеквизитДокумента.Имя;
				НовыйРеквизит.Синоним=РеквизитДокумента.Синоним;	
				
				Если Параметры.Свойство("Реквизиты") Тогда
					//НайденыйРеквизит= Параметры.Реквизиты.Найти(НовыйРеквизит.Имя);
					Для каждого Реквизит Из Параметры.Реквизиты  Цикл 					
					Если Реквизит.Имя=НовыйРеквизит.Имя Тогда					
						НовыйРеквизит.Формула=Реквизит.Формула;
						НовыйРеквизит.ЕстьФормула=?(ЗначениеЗаполнено(НовыйРеквизит.Формула),Истина,Ложь);
					КонецЕсли;
				КонецЦикла;
					
				КонецЕсли;			
				
			КонецЦикла;
		КонецЦикла;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)	
	Закрыть(СписокРеквизитовДокумента.НайтиСтроки(Новый Структура("ЕстьФормула",Истина)));	
КонецПроцедуры
