
&Вместо("УстановитьПартнера")
Процедура Лико_УстановитьПартнера(ОбъектыНоменклатуры)

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_РезервСерийСрезПоследних.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_РезервСерийСрезПоследних.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВтПартнер
	|ИЗ
	|	РегистрСведений.Лико_РезервСерий.СрезПоследних(, ОбъектНоменклатуры В (&ОбъектыНоменклатуры)) КАК Лико_РезервСерийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтОбъектыНоменклатуры
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка В(&ОбъектыНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыНоменклатуры.Ссылка КАК ОбъектНоменклатуры,
	|	ЕСТЬNULL(ВтПартнер.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.Пустаяссылка)) КАК Партнер,
	|	ВтОбъектыНоменклатуры.Ссылка.Партнер КАК СсылкаПартнер
	|ИЗ
	|	ВтОбъектыНоменклатуры КАК ВтОбъектыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПартнер КАК ВтПартнер
	|		ПО ВтОбъектыНоменклатуры.Ссылка = ВтПартнер.ОбъектНоменклатуры
	|ГДЕ
	|	ВтОбъектыНоменклатуры.Ссылка.Партнер <> ЕСТЬNULL(ВтПартнер.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.Пустаяссылка))";
	Запрос.УстановитьПараметр("ОбъектыНоменклатуры",ОбъектыНоменклатуры );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Результатзапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		СпрОбъект			             	=	Выборка.ОбъектНоменклатуры.ПолучитьОбъект();		
		СпрОбъект.ОбменДанными.Загрузка  	=	Истина;		
		СпрОбъект.Партнер					=	Выборка.Партнер;
		СпрОбъект.Резерв					=	Выборка.Партнер;

		СпрОбъект.Записать();

	КонецЦикла; 




КонецПроцедуры
