
&Вместо("ОпределитьПоследнийНомерПоставкиДляНоменклатуры")
Функция Лико_ОпределитьПоследнийНомерПоставкиДляНоменклатуры(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЯССМ_ОбъектыНоменклатуры.НомерПоставки КАК НомерПоставки
	               |ПОМЕСТИТЬ Вт
	               |ИЗ
	               |	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	               |ГДЕ
	               |	ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
	               |	И НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Вт.НомерПоставки) КАК НомерПоставки
	               |ИЗ
	               |	Вт КАК Вт";
	Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультата = РезультатЗапроса.Выбрать();
		ВыборкаРезультата.Следующий();

		Если ВыборкаРезультата.НомерПоставки=NULL Тогда
			Возврат 0; // первый объект данной номенклатуры
		Иначе
			Возврат ВыборкаРезультата.НомерПоставки;
		КонецЕсли;
	КонецЕсли;

	Возврат 0;

КонецФункции
