
//&Вместо("ЗаписатьСтоимтостьЦеновыхГрупп")
//Процедура Лико_ЗаписатьСтоимтостьЦеновыхГрупп(Организация, Регистратор) Экспорт 
//	УстановитьПривилегированныйРежим(Истина);
//	НачатьТранзакцию(); 
//	ЗаказПоставщику=Документы.ЗаказПоставщику.ПустаяСсылка();
//	Рассчитывается=Ложь;
//	
//	НаборЗаписей = РегистрыСведений.Лико_СтоимостьЦеновыхГрупп.СоздатьНаборЗаписей(); 
//	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
//	НаборЗаписей.Записать();

//	
//	Если ТипЗнч(Регистратор)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
//		ЗаказПоставщику=Регистратор.Распоряжение; 
//		Если ЗначениеЗаполнено(ЗаказПоставщику) 
//			И   ТипЗнч(ЗаказПоставщику)=Тип("ДокументСсылка.ЗаказПоставщику")Тогда
//			
//			Рассчитывается=Истина; 
//		Иначе
//			
//			Возврат;			
//			
//		КонецЕсли;		
//	КонецЕсли;
//	
//	
//		
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//|	Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа,
//|	СУММА(Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Цена) КАК Цена,
//|	МАКСИМУМ(ВЫБОР
//|			КОГДА Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
//|				ТОГДА Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Ссылка.Валюта
//|			ИНАЧЕ Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Валюта
//|		КОНЕЦ) КАК Валюта,
//|	0 КАК Количество
//|ПОМЕСТИТЬ ВтЦеновыеГруппы
//|ИЗ
//|	Документ.Лико_УстановкаСтоимостиЦеновыхГрупп.ЦеновыеГруппы КАК Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы
//|ГДЕ
//|	Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Ссылка = &Регистратор
//|
//|СГРУППИРОВАТЬ ПО
//|	Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.ЦеноваяГруппа
//|
//|ОБЪЕДИНИТЬ ВСЕ
//|
//|ВЫБРАТЬ
//|	ВложенныйЗапрос.ЦеноваяГруппа,
//|	ВложенныйЗапрос.Цена,
//|	ВложенныйЗапрос.Валюта,
//|	СУММА(ПриходныйОрдерНаТоварыТовары.Количество)
//|ИЗ
//|	(ВЫБРАТЬ
//|		ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
//|		ВЫБОР
//|			КОГДА ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
//|				ТОГДА ЗаказПоставщикуТовары.Ссылка.Валюта
//|			ИНАЧЕ ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета
//|		КОНЕЦ КАК Валюта,
//|		МАКСИМУМ(ЗаказПоставщикуТовары.Лико_ЦенаИтого) КАК Цена
//|	ИЗ
//|		Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_АвтоРасчетЦенЦГ.СрезПоследних(&Период, ) КАК Лико_АвтоРасчетЦенЦГСрезПоследних
//|			ПО ЗаказПоставщикуТовары.Ссылка.Организация = Лико_АвтоРасчетЦенЦГСрезПоследних.Организация
//|				И ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа = Лико_АвтоРасчетЦенЦГСрезПоследних.ЦеноваяГруппа
//|	ГДЕ
//|		ЗаказПоставщикуТовары.Ссылка = &ЗаказПоставщику
//|		И Лико_АвтоРасчетЦенЦГСрезПоследних.АвтоРасчет
//|		И ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
//|	
//|	СГРУППИРОВАТЬ ПО
//|		ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа,
//|		ВЫБОР
//|			КОГДА ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
//|				ТОГДА ЗаказПоставщикуТовары.Ссылка.Валюта
//|			ИНАЧЕ ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета
//|		КОНЕЦ) КАК ВложенныйЗапрос
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
//|		ПО (ВложенныйЗапрос.ЦеноваяГруппа = ПриходныйОрдерНаТоварыТовары.Номенклатура.ЦеноваяГруппа)
//|ГДЕ
//|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Регистратор
//|
//|СГРУППИРОВАТЬ ПО
//|	ВложенныйЗапрос.ЦеноваяГруппа,
//|	ВложенныйЗапрос.Валюта,
//|	ВложенныйЗапрос.Цена
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ВтЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа,
//|	МАКСИМУМ(ВтЦеновыеГруппы.Цена) КАК Цена,
//|	МАКСИМУМ(ВтЦеновыеГруппы.Валюта) КАК Валюта,
//|	СУММА(ВтЦеновыеГруппы.Количество) КАК Количество
//|ПОМЕСТИТЬ ВтЦГСГруп
//|ИЗ
//|	ВтЦеновыеГруппы КАК ВтЦеновыеГруппы
//|
//|СГРУППИРОВАТЬ ПО
//|	ВтЦеновыеГруппы.ЦеноваяГруппа
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ВтЦГСГруп.ЦеноваяГруппа КАК ЦеноваяГруппа,
//|	ВтЦГСГруп.Цена КАК Цена,
//|	ВтЦГСГруп.Валюта КАК Валюта,
//|	ВтЦГСГруп.Количество КАК Количество,
//|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)) КАК КоличествоОстаток,
//|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаОстаток,
//|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Цена, 0) КАК ЦенаОстаток
//|ИЗ
//|	ВтЦГСГруп КАК ВтЦГСГруп
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
//|				&Период,
//|				Ячейка.Лико_Организация = &Организация
//|					И Номенклатура.ЦеноваяГруппа В
//|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
//|							ВтЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа
//|						ИЗ
//|							ВтЦеновыеГруппы КАК ВтЦеновыеГруппы)) КАК ТоварыВЯчейкахОстатки
//|		ПО ВтЦГСГруп.ЦеноваяГруппа = ТоварыВЯчейкахОстатки.Номенклатура.ЦеноваяГруппа
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СтоимостьЦеновыхГрупп.СрезПоследних(
//|				&Период,
//|				Организация = &Организация
//|					И ЦеноваяГруппа В
//|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
//|							ВтЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа
//|						ИЗ
//|							ВтЦеновыеГруппы КАК ВтЦеновыеГруппы)) КАК Лико_СтоимостьЦеновыхГруппСрезПоследних
//|		ПО ВтЦГСГруп.ЦеноваяГруппа = Лико_СтоимостьЦеновыхГруппСрезПоследних.ЦеноваяГруппа
//|
//|СГРУППИРОВАТЬ ПО
//|	ВтЦГСГруп.ЦеноваяГруппа,
//|	ВтЦГСГруп.Цена,
//|	ВтЦГСГруп.Валюта,
//|	ВтЦГСГруп.Количество,
//|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)),
//|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Цена, 0)";
//	Запрос.УстановитьПараметр("Организация",Организация ); 
//	Запрос.УстановитьПараметр("Регистратор",Регистратор );
//	Запрос.УстановитьПараметр("ЗаказПоставщику",ЗаказПоставщику ); 
//	Запрос.УстановитьПараметр("Период",Регистратор.Дата );

//	
//	Параметры = Новый Массив(2);
//	Параметры[0] = Регистратор.Дата;
//	Параметры[1] = ВидГраницы.Включая;
//	Граница = Новый(Тип("Граница"),Параметры);
//	
//	Запрос.УстановитьПараметр("Период",Граница );
//	
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		//Если Не Выборка.ЦеноваяГруппа.Лико_АвтоРасчетЦены Тогда
//		//	  Продолжить;
//		//КонецЕсли; 
//		
//		Если Не РегистрыСведений.Лико_АвтоРасчетЦенЦГ.Установлен(
//			Организация,
//			Выборка.ЦеноваяГруппа,
//			КонецДня(Регистратор.Дата)) Тогда
//			
//			Продолжить; 
//			
//		КонецЕсли;
//		
//		
//		Если Не Рассчитывается 
//			Или  Выборка.Количество>0 
//			И  (Выборка.Валюта<>Выборка.ВалютаОстаток 
//			Или Выборка.Цена<>Выборка.ЦенаОстаток)Тогда
//			
//			Запись					=	НаборЗаписей.Добавить();
//			Запись.Период			=	Регистратор.Дата;
//			Запись.Валюта			=	Выборка.Валюта;
//			Запись.ЦеноваяГруппа	=	Выборка.ЦеноваяГруппа;
//			Запись.ЗаказПоставщику	=	ЗаказПоставщику;
//			Запись.Организация		=	Организация;
//			Запись.ЦенаОстаток		=	Выборка.ЦенаОстаток;
//			
//			Если Рассчитывается Тогда
//				Запись.КоличествоПриход =   Выборка.Количество;
//				Запись.ЦенаПриход	 =   Выборка.Цена;	
//				
//			КонецЕсли;
//			
//			
//			Запись.Количество=Выборка.Количество;
//			Запись.КоличествоОСтаток=?(Выборка.КоличествоОСтаток=0,Выборка.Количество,Выборка.КоличествоОСтаток-Выборка.Количество);
//			Запись.ВалютаОстаток=Выборка.ВалютаОстаток;
//			
//			Запись.Рассчитывается=Рассчитывается;
//			Если Рассчитывается И Запись.КоличествоОСтаток<>0 Тогда
//				Массив = Новый Массив();
//				Массив.Добавить(Новый Структура("Цена,Валюта,Количество",Выборка.Цена,Выборка.Валюта,Выборка.Количество));
//				Массив.Добавить(Новый Структура("Цена,Валюта,Количество",Выборка.ЦенаОстаток,Выборка.ВалютаОстаток,Выборка.КоличествоОстаток-Выборка.Количество));
//				
//				СредняяЦена=РассчитатьСреденеВзвешеннуюЦену(Массив,Выборка.Валюта,Регистратор.Дата);
//				
//				Запись.Цена		        =СредняяЦена.Цена;
//				Запись.КроссКурс			=СредняяЦена.Валюта[Выборка.ВалютаОстаток].КроссКурс;
//				
//				Если  Запись.КроссКурс=1 Тогда
//					Запись.ЦенаОстатокКрос=Выборка.ЦенаОстаток;
//				Иначе
//					
//					Запись.ЦенаОстатокКрос  =СредняяЦена.Валюта[Выборка.ВалютаОстаток].КросЦена; 
//					
//				КонецЕсли;
//				
//			Иначе
//				
//				Запись.Цена					=Выборка.Цена;
//				Запись.ЦенаОстатокКрос		=0;
//				Запись.КроссКурс	=0;
//				
//			КонецЕсли;
//			
//		КонецЕсли;  
//		
//	КонецЦикла; 
//	
//	НаборЗаписей.Записать();
//	
//	Если ТипЗнч(НаборЗаписей.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
//		И Дата('2024.10.25')<НаборЗаписей.Отбор.Регистратор.Значение.Дата Тогда
//		
//		
//		Для каждого Запись Из НаборЗаписей Цикл 
//			
//			НаборЗаписейЦГ = РегистрыСведений.Лико_ЦеныГруппНоменклатуры.СоздатьНаборЗаписей();
//			НаборЗаписейЦГ.Отбор.Период.Установить(Запись.Период);
//			НаборЗаписейЦГ.Отбор.ТипЦен.Установить(Перечисления.Лико_ТипЦен.ЦенаПоставщика);
//			НаборЗаписейЦГ.Отбор.ЦеноваяГруппа.Установить(Запись.ЦеноваяГруппа);
//			НаборЗаписейЦГ.Отбор.Площадка.Установить(Запись.Организация);
//			
//			НоваяЗапись = НаборЗаписейЦГ.Добавить();
//			НоваяЗапись.Период = Запись.Период;
//			НоваяЗапись.ТипЦен = Перечисления.Лико_ТипЦен.ЦенаПоставщика;
//			НоваяЗапись.ЦеноваяГруппа = Запись.ЦеноваяГруппа;
//			НоваяЗапись.ЕдиницаИзмерения = НоваяЗапись.ЦеноваяГруппа.ОсновнаяНоменклатура.ЕдиницаИзмерения;
//			НоваяЗапись.Площадка = Запись.Организация; 
//			
//			НоваяЗапись.Цена = Запись.Цена;
//			НоваяЗапись.Валюта = Запись.Валюта;
//			НоваяЗапись.Основание = НаборЗаписей.Отбор.Регистратор.Значение;
//			НоваяЗапись.АвтоРасчетЦены = Истина;
//			
//			Если  ТипЗнч(Запись.Регистратор.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
//				
//				НоваяЗапись.Ответственный = Запись.Регистратор.Распоряжение.Менеджер;
//				
//			КонецЕсли;
//			
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Наценка КАК Наценка,
//			|	Лико_ЦеныГруппНоменклатурыСрезПоследних.ПотериНаРезке КАК ПотериНаРезке,
//			|	Лико_ЦеныГруппНоменклатурыСрезПоследних.СкладскиеРасходы КАК СкладскиеРасходы
//			|ИЗ
//			|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
//			|			&Период,
//			|			ЦеноваяГруппа = &ЦеноваяГруппа
//			|				И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ЦенаПоставщика)
//			|				И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних";
//			Запрос.УстановитьПараметр("Период",Запись.Период-1 );
//			Запрос.УстановитьПараметр("Площадка",Запись.Организация); 
//			Запрос.УстановитьПараметр("ЦеноваяГруппа",Запись.ЦеноваяГруппа);


//			РезультатЗапроса = Запрос.Выполнить();
//			Выборка = РезультатЗапроса.Выбрать();
//			Пока Выборка.Следующий() Цикл
//			    ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка); 
//			КонецЦикла; 
//			
//			
//		
//			
//			НаборЗаписейЦГ.Записать();
//			
//		КонецЦикла;
//		
//		
//	КонецЕсли;

//	
//	
//	
//	
//	ЗафиксироватьТранзакцию();	
//КонецПроцедуры

//&Вместо("ПересчитатьСтоимостьЦеновыхГрупп")
//Процедура Лико_ПересчитатьСтоимостьЦеновыхГрупп(Организация, Дата = Неопределено) Экспорт 
//	УстановитьПривилегированныйРежим(Истина);
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Лико_УстановкаСтоимостиЦеновыхГрупп.Ссылка КАК Ссылка,
//	|	Лико_УстановкаСтоимостиЦеновыхГрупп.Дата КАК Дата
//	|ИЗ
//	|	Документ.Лико_УстановкаСтоимостиЦеновыхГрупп КАК Лико_УстановкаСтоимостиЦеновыхГрупп
//	|ГДЕ
//	|	Лико_УстановкаСтоимостиЦеновыхГрупп.Организация = &Организация
//	|	И Лико_УстановкаСтоимостиЦеновыхГрупп.Проведен
//	|	И Лико_УстановкаСтоимостиЦеновыхГрупп.Дата >= &Дата
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ПриходныйОрдерНаТовары.Ссылка,
//	|	ПриходныйОрдерНаТовары.Дата
//	|ИЗ
//	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
//	|ГДЕ
//	|	ПриходныйОрдерНаТовары.Проведен
//	|	И ПриходныйОрдерНаТовары.Распоряжение.Организация = &Организация
//	|	И ПриходныйОрдерНаТовары.Распоряжение Ссылка Документ.ЗаказПоставщику
//	//|	И ПриходныйОрдерНаТовары.Распоряжение.ХозяйственнаяОперация В(&МассивОпераций)
//	|	И ПриходныйОрдерНаТовары.Дата >= &Дата
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПриходныйОрдерНаТовары.Ссылка,
//	|	ПриходныйОрдерНаТовары.Дата
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Дата";
//	Запрос.УстановитьПараметр("Организация",Организация ); 
//	Запрос.УстановитьПараметр("Дата",Дата ); 
//	Запрос.УстановитьПараметр("МассивОпераций",РегистрыСведений.Лико_АвтоРасчетЦенЦГ.ХозяйственныеОперации()); 



//	РезультатЗапроса = Запрос.Выполнить(); 
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		ЗаписатьСтоимтостьЦеновыхГрупп(Организация,Выборка.Ссылка);
//	КонецЦикла; 




//КонецПроцедуры

//&Вместо("РассчитатьСреденеВзвешеннуюЦену")
//Функция Лико_РассчитатьСреденеВзвешеннуюЦену(МассивЦен, Валюта, Дата)

//	УстановитьПривилегированныйРежим(Истина);	
//	Структура = Новый Структура;
//	Структура.Вставить("Цена",0);
//	Структура.Вставить("Валюта",Неопределено);
//	Соответствие = Новый Соответствие;

//	ЦенаКоличество=0;
//	КоличествоВсего=0;

//	Для каждого СтруктураЦены Из МассивЦен Цикл

//		Если СтруктураЦены.Валюта<>Валюта Тогда

//			Цена =	РаботаСКурсамиВалют.ПересчитатьВВалюту(СтруктураЦены.Цена, СтруктураЦены.Валюта,Валюта,Дата );

//			Если  СтруктураЦены.Валюта.Лико_Рейтинг>=Валюта.Лико_Рейтинг Тогда
//				КроссКурс=СтруктураЦены.Цена/Цена;
//			Иначе
//				КроссКурс=Цена/СтруктураЦены.Цена;							
//			КонецЕсли; 
//			КросЦена=Цена;	
//		Иначе
//			Цена=СтруктураЦены.Цена;
//			КроссКурс=1;
//			КросЦена=СтруктураЦены.Цена;
//		КонецЕсли;

//		Если Соответствие.Получить(СтруктураЦены.Валюта)= Неопределено Тогда
//			Соответствие.Вставить(СтруктураЦены.Валюта,Новый Структура("КроссКурс,КросЦена",КроссКурс,КросЦена));
//		КонецЕсли;

//		ЦенаКоличество=ЦенаКоличество+(Цена*СтруктураЦены.Количество);
//		КоличествоВсего=КоличествоВсего+СтруктураЦены.Количество;

//	КонецЦикла;

//	Если КоличествоВсего<>0 Тогда
//		Структура.Цена= ЦенаКоличество/КоличествоВсего;
//	КонецЕсли;

//	Структура.Валюта=Соответствие;

//	Возврат Структура; 
//КонецФункции
