
&После("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ, Замещение)  // --> Маковеева А.Ю. 04.05.2023
	
	ЕстьПравоИзмененияСчетовВСтатьях = РольДоступна("Лико_ИзменениеСчетаУчетаВСтатьяхДоходовИРасходов") Или РольДоступна("ПолныеПрава");       
	Для Каждого Стр Из ЭтотОбъект Цикл
		Если НЕ (ЕстьПравоИзмененияСчетовВСтатьях Или Стр.ВидСчета = Перечисления.ВидыСчетовРеглУчета.ДенежныеСредства Или ТипЗнч(Стр.АналитикаУчета) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") 
			И Стр.АналитикаУчета.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры // <-- Маковеева А.Ю. 04.05.2023
