
&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) И НЕ ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
		Сообщить("Необходимо заполнить контрагента");
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки();
	
	Владелец = Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяВладельца];
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", Владелец);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьАдресЗавершение", ЭтотОбъект, ИмяРеквизитаИВладельцаАдресаДоставки);
	ОткрытьФорму("ОбщаяФорма.Лико_ФормаВыбораАдреса", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат.Представление;
		Объект[ДополнительныеПараметры.ИмяРеквизита + "ЗначенияПолей"] = Результат.ЗначенияПолей;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяРеквизитаИВладельцаАдресаДоставки()
	
	Результат = Новый Структура("ПолныйПутьКСтрокеТЧ,ИмяРеквизита,ИмяВладельца", Ложь, "АдресДоставки", ?(ЗначениеЗаполнено(Объект.Грузополучатель), "Грузополучатель", "Контрагент"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки();
	АдресПредставление = "";
	АдресЗначениеПолей = "";
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита],
		Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	АдресДоставкиПриИзменении(Элемент);
КонецПроцедуры
