
&Вместо("ПроведениеВыполнить")
Процедура Лико_ПроведениеВыполнить(МассивСсылок, ИмяОперации, Параметр)

	Для каждого Ссылка Из МассивСсылок Цикл
		НачатьТранзакцию();
		Попытка
	

			Объект=Ссылка.ПолучитьОбъект();
			Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
			Объект.Записать(РежимЗаписиДокумента.Проведение); 
						
		

		Исключение  
			ОтменитьТранзакцию();

			//ОписаниеОшибки()
		КонецПопытки; 
		Если ТранзакцияАктивна() Тогда
			
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
		

	КонецЦикла;	
КонецПроцедуры
