

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТС_ЗаявкаНаРемонтРабочихЦентров") Тогда	
		
		СотрудникОбнаружившийБрак = ДанныеЗаполнения.Автор;
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		Организация = ДанныеЗаполнения.РабочийЦентр.Лико_Площадка.Организация;
		РабочийЦентр = ДанныеЗаполнения.РабочийЦентр;
		Распоряжение = ДанныеЗаполнения.Ссылка;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Автор = ДанныеЗаполнения.Автор;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	ЗаписатьК2ВОбъектНоменклатуры();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗаписатьК2ВОбъектНоменклатуры(Истина);
КонецПроцедуры

Процедура ЗаписатьК2ВОбъектНоменклатуры(Отмена=Ложь)

	Для каждого стр Из ЭтотОбъект.Товары Цикл
	
		ОбъектНоменклатуры = стр.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
		ОбъектНоменклатуры.Категория2 = ?(Отмена,Ложь,стр.К2);
		ОбъектНоменклатуры.Записать();
	КонецЦикла;
	ОбработкаСерий();

КонецПроцедуры

Процедура ОбработкаСерий() 	
	Для каждого Товар Из Товары Цикл
		Если ЗначениеЗаполнено(Товар.Серия) Тогда	
			Товар.СтатусУказанияСерий=8;
		Иначе
			Товар.СтатусУказанияСерий=7;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверим, все ли обязательные реквизиты заполнены
	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Дефект) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Решение) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Серия) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Проведен Тогда
		ТЗОснастки = Ссылка.Товары.Выгрузить();
	КонецЕсли;
	
	Если НЕ ТЗОснастки = Неопределено Тогда 
		Сч = 0;
		Для каждого Строка из ТЗОснастки Цикл
			Если ЗначениеЗаполнено(Ссылка) И Строка.ПисьмоПоРешениюОтправлено И Строка.Решение <> Товары[Сч].Решение Тогда
				Товары[Сч].ПисьмоПоРешениюОтправлено = Ложь;
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры
