
&Вместо("ОбработкаПолученияДанныхВыбора")
Процедура Лико_ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СписокЗначений=Новый СписокЗначений;
	СтандартнаяОбработка=Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	|	Лико_ЗаказНаРаскрой.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаказНаРаскрой КАК Лико_ЗаказНаРаскрой
	|ГДЕ
	|	ПОДСТРОКА(Лико_ЗаказНаРаскрой.Номер, 6, 6) = &Номер";
	Запрос.УстановитьПараметр("Номер",Формат(Число(Параметры.СтрокаПоиска),"ЧЦ=6; ЧВН=; ЧГ="));
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ДанныеВыбора=СписокЗначений; 	
	// Вставить содержимое обработчика.
	//ПродолжитьВызов(ДанныеВыбора, Параметры, СтандартнаяОбработка);

КонецПроцедуры

