
&НаКлиенте
&Вместо("ОбработкаКоманды")
Процедура Лико_ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Структура = Новый Структура;
	Структура.Вставить("ПодразделениеПолучатель",ПредопределенноеЗначение("Справочник.ТС_Подразделения.СГИ"));
	Обработка = ПолучитьВнешнююОбработку();
	Если Обработка <> Неопределено Тогда 
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма",Структура,,Новый УникальныйИдентификатор);
	КонецЕсли;	

КонецПроцедуры
