Функция СтрокаXML(Значение) Экспорт
	Если Значение = ВсеСтрахователи Тогда
		Возврат "amountForAllInsurers";
	ИначеЕсли Значение = ТекущийСтрахователь Тогда
		Возврат "amountForCurrentInsurer";
	ИначеЕсли Значение = ВсеСтрахователиЗаТекущийПериодРаботы Тогда
		Возврат "amountForCurrentAndPrevOtherInsurers";
	ИначеЕсли Значение = ТекущиеСтрахователиЗаТекущийПериодРаботыИДругие Тогда
		Возврат "amountForCurrentInsurerAndPrevOtherInsurersAndAllInsurers";
	ИначеЕсли Значение = ВсеСтрахователиГПХ Тогда
		Возврат "amountForAllInsurersGph";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ЗначениеИзXML(КодСФР) Экспорт
	Если СтрСравнить(КодСФР, "amountForAllInsurers") = 0 Тогда
		Возврат ВсеСтрахователи;
	ИначеЕсли СтрСравнить(КодСФР, "amountForCurrentInsurer") = 0 Тогда
		Возврат ТекущийСтрахователь;
	ИначеЕсли СтрСравнить(КодСФР, "amountForCurrentAndPrevOtherInsurers") = 0 Тогда
		Возврат ВсеСтрахователиЗаТекущийПериодРаботы;
	ИначеЕсли СтрСравнить(КодСФР, "amountForCurrentInsurerAndPrevOtherInsurersAndAllInsurers") = 0 Тогда
		Возврат ТекущиеСтрахователиЗаТекущийПериодРаботыИДругие;
	ИначеЕсли СтрСравнить(КодСФР, "amountForAllInsurersGph") = 0 Тогда
		Возврат ВсеСтрахователиГПХ;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции