
&Вместо("ЗарегистрироватьУчетныеМеханизмы")
Процедура Лико_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)

	//++ Локализация
	МеханизмыДокумента.Добавить("РегламентированныйУчет");
	//-- Локализация
	
		
	//+ ---> Лико2.5 m.shenderov 20.04.2022
	МеханизмыДокумента.Добавить("Лико_Склад"); 
	//- <--- Лико2.5 m.shenderov 20.04.2022

КонецПроцедуры

&После("ДополнитьТекстыЗапросовПроведения")
Процедура Лико_ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры)
	
 //+ ---> Лико2.5 m.shenderov 20.04.2022
	 ТекстЗапросаТаблицаЛико_ТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
	 //- <--- Лико2.5 m.shenderov 20.04.2022
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаЛико_ТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры) //+ Лико m.shenderov 04.03.2018
	
	ИмяРегистра = "Лико_ТоварыКПоступлению";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	&Период КАК Период,
	               |	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество,
	               |	ПриобретениеТоваровУслугТовары.Лико_ПриходныйОрдер КАК ПриходныйОрдер
	               |ИЗ
	               |	Документ.ПоступлениеОтПереработчика.Товары КАК ПриобретениеТоваровУслугТовары
	               |ГДЕ
	               |	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
	               |	И ПриобретениеТоваровУслугТовары.Лико_ПриходныйОрдер <> ЗНАЧЕНИЕ(Документ.ПриходныйОрдерНаТовары.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриобретениеТоваровУслугТовары.Номенклатура,
	               |	ПриобретениеТоваровУслугТовары.Характеристика,
	               |	ПриобретениеТоваровУслугТовары.Лико_ПриходныйОрдер";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции //- Лико m.shenderov 04.03.2018
