#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Свойства состояния загрузки.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.ЗагрузкаНСИСостояния
// 
// Возвращаемое значение:
//  Структура - Свойства состояния загрузки:
// * Состояние - ПеречислениеСсылка.ЗагрузкаНСИСостояния
// * Цвет - Строка - название цвета из стиля
Функция СвойстваСостоянияЗагрузки(Состояние) Экспорт
	
	Результат = Новый Структура("Состояние,Цвет", Состояние, "ЦветНедоступногоТекста");
	
	Если Состояние = НеВыполнялась Тогда
		Результат.Цвет      = "ЦветНедоступногоТекста";
	ИначеЕсли Состояние = НетДанных Тогда
		Результат.Цвет      = "ЦветНедоступногоТекста";
	ИначеЕсли Состояние = НеВыполнена Тогда
		Результат.Цвет      = "ЦветТекстаЗагрузкаНеВыполнена";
	ИначеЕсли Состояние = ВыполненаСОшибками Тогда
		Результат.Цвет      = "ЦветТекстаЗагрузкаЕстьПроблемы";
	ИначеЕсли Состояние = ВыполненаУспешно Тогда
		Результат.Цвет      = "ЦветТекстаЗагрузкаУспешная";
	ИначеЕсли Состояние = УдалитьВыполненаЧастично Тогда
		Результат.Цвет      = "ЦветТекстаЗагрузкаЕстьПроблемы";
	Иначе
		Результат.Состояние = НеВыполнялась;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перечень состояний, обозначающих наличие проблем
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.ЗагрузкаНСИСостояния -  Проблемные состояния
Функция ПроблемныеСостояния() Экспорт
	
	Результат = Новый СписокЗначений();
	
	Результат.Добавить(Перечисления.ЗагрузкаНСИСостояния.НеВыполнена);
	Результат.Добавить(Перечисления.ЗагрузкаНСИСостояния.ВыполненаСОшибками);
	Результат.Добавить(Перечисления.ЗагрузкаНСИСостояния.УдалитьВыполненаЧастично);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли