&НаКлиенте
Перем ПропуститьВопросПередЗаписью; // Для отработки записи после вопроса

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания


&НаКлиенте
Процедура ПровестиДокумент(Команда)
	//Если ЗаполнитьСразуЭтап Тогда
	//	
	//	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма,,"ВосстановитьЭтап");
	//Иначе
	//	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	//	
	//	
	//КонецЕсли;
	
	
	Если ЗаполнитьСразуЭтап Тогда
		ОписаниеОповещение=Новый ОписаниеОповещения("ВосстановитьЭтапЗавершение",ЭтаФорма);
		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма,,ОписаниеОповещение);
	Иначе
		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	Если ЗаполнитьСразуЭтап Тогда
		
		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма,,"ВосстановитьЭтап");
		
	Иначе
		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьЭтап ()  //+Лико m.shenderov 16.02.2018
	
	Лико_Дополнительно.Лико_ВосстановлениеЭтаповПроизводства(Объект.Ссылка);
	
КонецПроцедуры //-Лико m.shenderov 16.02.2018


&НаКлиенте
Процедура ВосстановитьЭтапЗавершение (Результат,Парам) Экспорт //+Лико m.shenderov 16.02.2018
	
	Лико_Дополнительно.Лико_ВосстановлениеЭтаповПроизводства(Объект.Ссылка);
	
КонецПроцедуры //-Лико m.shenderov 16.02.2018




&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьПослеПроведения()  //+Лико m.shenderov 19.10.2017
	
	Если ПечататьБиркиПриЗакрытииБланка() Тогда
		Если Объект.РежимЗакрытия=ПредопределенноеЗначение("Перечисление.Лико_РежимЗакрытияЗаказа.ПереместитьНаСклад") Или ИспользоватьАлгоритмПоФакту Тогда
			
			ПечатьИзмененныхОбъектовНоменклатуры() ;
		КонецЕсли;
	КонецЕсли;
	
	Если ПечататьСтикерыТЧВыпуска Тогда
		ПечатьВыпущеннойПродукции();
		Если ЦифорвоеРЦСервер(Объект.РабочийЦентр) Тогда
			ПечатьВыпущеннойПродукции(); 				 
		КонецЕсли;
		
		
		ПечатьСтикераДокумента();
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 19.10.2017

&НаСервереБезКонтекста
Функция ПечататьБиркиПриЗакрытииБланка() //+Лико m.shenderov 19.10.2017
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечататьБиркиПриЗакрытииБланка",Ложь);
	
КонецФункции  //-Лико m.shenderov 19.10.2017



&НаСервере
Функция ПолучиьСтруктуруПараметровДляРоликовВыпущеннойПродукции()
	Структура = Новый Структура;
	
	//=--------- попробуем определить нарезку -----
	ЗапросВТ = Новый Запрос;
	ЗапросВТ.Текст =
	"ВЫБРАТЬ
	|	Таблица.Серия КАК Серия
	|ПОМЕСТИТЬ ТаблицаНарезок
	|ИЗ
	|	&Таб КАК Таблица";
	
	ЗапросВТ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросВТ.УстановитьПараметр("Таб", Объект.Товары.Выгрузить());
	ЗапросВТ.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=ЗапросВТ.МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНарезок.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка КАК Нарезка
	|ИЗ
	|	ТаблицаНарезок КАК ТаблицаНарезок
	|ГДЕ
	|	ТаблицаНарезок.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)"; 
	
	ТЗНарезки = Запрос.Выполнить().Выгрузить();
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЯССМ_ОбъектыНоменклатуры.Нарезка КАК Нарезка
	//|ИЗ
	//|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	//|ГДЕ
	//|	ЯССМ_ОбъектыНоменклатуры.Нарезка <> ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	//|	И ЯССМ_ОбъектыНоменклатуры.Серия В(&Серия)";
	//Запрос.УстановитьПараметр("Серия",Объект.Товары.Выгрузить().ВыгрузитьКолонку("Серия"));
	//РезультатЗапроса = Запрос.Выполнить().Выгузить;
	
	
	
	
	
	
	Если ТЗНарезки.Количество()=1 Тогда
		Нарезка = ТЗНарезки[0].Нарезка;
	Иначе
		Нарезка = Справочники.ЯССМ_Нарезки.ПустаяСсылка();
	КонецЕсли;
	
	Втулка = Справочники.Лико_Втулки.НайтиПоРеквизиту("Размер", 76);
	
	//--------== Конец попробуем определить нарезку
	
	// !!!!!????? пока "забыдлокодил"
	ОбъектНоменклатураAmcor = Неопределено;
	//ГруппаЯССМ_ОбъектыНоменклатурыAmcor = Справочники.ЯССМ_ОбъектыНоменклатуры.НайтиПоКоду("647918");
	ГруппаЯССМ_ОбъектыНоменклатурыAmcor = Справочники.Лико_ПредопределенныеЗначения.ГруппаЛиматор.ЗначениеПараметра;
	
	Если ЗначениеЗаполнено(ГруппаЯССМ_ОбъектыНоменклатурыAmcor) Тогда
		
		Для Каждого СтрокаТовары Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры) Тогда
				Если СтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ПринадлежитЭлементу(ГруппаЯССМ_ОбъектыНоменклатурыAmcor) Тогда
					ОбъектНоменклатураAmcor = СтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РабочийЦентрПолучатель = Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ТСРабочийЦентрДляВыпущеннойПродукции",Неопределено);
	
	
	
	Структура.Вставить("НомерЗаказа",Объект.НомерЗаказа);
	Структура.Вставить("НомерБланка",Объект.НомерБланка);
	Структура.Вставить("Нарезка",Нарезка);
	Структура.Вставить("Втулка",Втулка);
	Структура.Вставить("АвторДокумента",Объект.АвторДокумента);
	Структура.Вставить("ОбъектНоменклатураAmcor",ОбъектНоменклатураAmcor);
	
	Возврат Структура;
	
	
	
	
	
КонецФункции

&НаКлиенте
Процедура СоздатьРоликиВыпущеннойПродукции(Команда)
	Если Не ЗначениеЗаполнено(Объект.НомерЗаказа) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен номер заказа. Заполните его.";
		Сообщение.Поле = "Объект.НомерЗаказа";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить(); 		
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.НомерБланка) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен номер бланка. Заполните его.";
		Сообщение.Поле = "Объект.НомерБланка";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить(); 		
		Возврат;
	КонецЕсли; 	
	
	ОписаниеОповещения= Новый ОписаниеОповещения("СоздатьРоликиВыпущеннойПродукцииЗавершение",ЭтаФорма);
	СтруктураПараметров=ПолучиьСтруктуруПараметровДляРоликовВыпущеннойПродукции();
	ОткрытьФорму("Документ.Лико_БланкЭтапа.Форма.ФормаСозданияРоликовВыпущеннойПродукции",СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРоликиВыпущеннойПродукцииЗавершение (РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 14.09.2017
	МассивРоликов= РезультатФормы;
	Если МассивРоликов<>Неопределено Тогда
		Для Каждого РоликМассива Из МассивРоликов Цикл
			НоваяСтрока = Объект.Выпуск.Добавить();
			НоваяСтрока.Серия=ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(РоликМассива,"Серия");
			НоваяСтрока.Характеристика=ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(РоликМассива,"Характеристика");
			НоваяСтрока.Номенклатура=ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(РоликМассива,"Номенклатура");
		КонецЦикла;
	КонецЕсли; 	
КонецПроцедуры //-Лико m.shenderov 14.09.2017


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	
	
	ГруппаПользователя=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ГруппаПользователя");
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	УстановитьДоступностьЭлементов();
	Если Параметры.Ключ.Пустая() Тогда 		
		Структура = Новый Структура; 		
		Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура); 	
		ЗаполнитьЗначенияСвойств(Объект,Структура);
		Объект.ДатаОкончания=ТекущаяДата();
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийЗакрытияБланка.ЗакрытиеБланка");
		
	КонецЕсли; 
	
	
	Если ЦифорвоеРЦСервер(Объект.РабочийЦентр) Тогда
		ВводитьКликиПриЗакрытииЗаказа=Истина;
	КонецЕсли;
	
	УстановитьУсловноеОформление(); 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ПриЧтенииСозданииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 		
		//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий); 		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	
	ОпределитьРежимЗакрытия(Отказ);
	ПечататьСтикерыТЧВыпуска=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечататьСтикерыТЧВыпуска");
	Если  Объект.Проведен  Тогда
		ЭтотОбъект.ТолькоПросмотр=Истина;

		Если   РольДоступна("АдминистраторСистемы") Или РольДоступна("ПолныеПраваЯССМ_Склад") Тогда 
			ЭтотОбъект.ТолькоПросмотр=Ложь;
		КонецЕсли;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиДокумент.Доступность=Ложь;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьДокумент.Доступность=Ложь;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиИЗакрыть.Доступность=Ложь;
		//Иначе
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиДокумент.Доступность=Истина;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьДокумент.Доступность=Истина;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиИЗакрыть.Доступность=Истина;
	КонецЕсли;
	Если  РольДоступна("АдминистраторСистемы") Или РольДоступна("Лико_РедактированиеКоличестоУУ") Тогда
		Элементы.ТоварыКоличествоРасходУУ.Видимость			=Истина;
		Элементы.ВыпускКоличествоУУ.Видимость				=Истина;
		Элементы.ТоварыКоличествоРасходУУ.ТолькоПросмотр	=Ложь;
		Элементы.ТоварыКоличество.ТолькоПросмотр			=Ложь;
		
		Элементы.ВыпускКоличествоУУ.ТолькоПросмотр			=Ложь;
		Элементы.СтраницаДоплнительно.Видимость				=Истина;
		Элементы.НомерПроката.Доступность					=Истина;
		Элементы.ТоварыНомерРаботы.РедактированиеТекста		=Истина;
		Элементы.ОстаткиПоЗатратам.Видимость				=Истина;
		Элементы.ТоварыНомерРаботыАдм.Видимость				=Истина;
		Элементы.ТоварыСтатусЗаказа.Видимость				=Истина;
	Иначе
		Элементы.ТоварыКоличество.ТолькоПросмотр		=Истина;
		
		Элементы.ТоварыКоличествоРасходУУ.Видимость		=Ложь;
		Элементы.ВыпускКоличествоУУ.Видимость			=Ложь;
		Элементы.ТоварыКоличествоРасходУУ.ТолькоПросмотр=Истина;
		Элементы.ВыпускКоличествоУУ.ТолькоПросмотр		=Истина;
		Элементы.СтраницаДоплнительно.Видимость			=Ложь;
		Элементы.ТоварыНомерРаботы.РедактированиеТекста =Ложь;
		Элементы.НомерПроката.Доступность=Истина;
		Элементы.ОстаткиПоЗатратам.Видимость=Истина;
		Элементы.ТоварыНомерРаботыАдм.Видимость         =Ложь;
		Элементы.ТоварыСтатусЗаказа.Видимость			=Ложь;

	КонецЕсли;
	
	Если Объект.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
		Элементы.НомерПроката.Доступность=Истина;
		
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("Лико_НеВосстанавливатьЭтапЛико_БланкЭтапа") Тогда 
		Элементы.НеВосстанавливатьЭтап.Видимость=Истина;
	КонецЕсли;
	
	Если РольДоступна("Лико_КонтрольИзмененияЗакрытияБланка") И  Не РольДоступна("ПолныеПрава") Тогда 
		ТребуетсяПодписьДокумента=Истина;
	КонецЕсли;

	
		
	
	
	лкЗакрытиеБланкаЗаказаНеНомерБланкаИзВБЗ=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("лкЗакрытиеБланкаЗаказаНеНомерБланкаИзВБЗ",Ложь);
	
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 	
	
	//Пока Отказ
	ЗаполнитьВидыРабот();
	ЗаполнитьНомерВидаРабот();
	РаспределяемыеМатериалы();
	ЗаполнитьТаблицуТиповыеДокументы();
	
	
	// Подсистема WebSocket
	ПоказыватьQRCode=Ложь;
	WebSocketСервер.Инициализация(ЭтаФорма,ПоказыватьQRCode);
	// Подсистема WebSocket

	 УчетПравилПеремещенияТМЦ = Справочники.Лико_ПравилаПеремещенияТМЦ.СтартСистемы(Объект.Дата);


КонецПроцедуры


&НаСервере
Процедура ОпределитьРежимЗакрытия(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ГруппаПользователя=Перечисления.Лико_ГруппаПользователя.ЦифровойУчасток Тогда
			РежимЗакрытия = Перечисления.Лико_РежимЗакрытияЗаказа.ОставитьНаРабочемЦентре;
		Иначе
			РежимЗакрытия = Перечисления.Лико_РежимЗакрытияЗаказа.ПереместитьНаСклад;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ОпределитьРежимЗакрытия


&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Если ГруппаПользователя=Перечисления.Лико_ГруппаПользователя.ЦифровойУчасток Тогда
		Элементы.ТоварыВозвратКоличество.Видимость=Ложь;
	Иначе
		Элементы.ТоварыВозвратКоличество.Видимость=Истина;
	КонецЕсли;
	
	
	//
	УсловноеОформление.Элементы.Очистить(); 	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспределяемыеМатериалыПравилоНаименование.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РаспределяемыеМатериалы.ПравилоНаименование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненноеПолеТаблицы);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Проверка выполнена успешно!");
	
	
	
	
	//НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма); 
	//НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	//НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма); 
	//УстановитьУсловноеОформлениеВидаОпераци(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	//ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.Лико_ПередачаТоваров);
	//
	//
	//СтруктураУстанавливаемыхПараметров = Новый Структура;
	//СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	//
	//УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	//
	//ПараметрыЗаполненияРеквизитов = Новый Структура;
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	//Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	//Новый Структура("Номенклатура", "ТипНоменклатуры"));
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
	//Новый Структура("Номенклатура", "Артикул"));
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	//ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	//
	//НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов); 	
	//ПересчитатьВесОбъемВСтрокахТЧ();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УчетПоВидуСекций=УстановитьВидУчетаПоСекцииСервер(Объект.Дата);
	
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор)и Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ОчиститьСообщения();
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","Лико_БланкЭтапа");
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		//ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Отказ=Истина;
	КонецЕсли; 
	
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		//Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		//	Сообщить("Не выполнена авторизация!");
		//	Отказ=Истина;
		//КонецЕсли;
		Объект.АвторДокумента=ГлЛико_Оператор;
	КонецЕсли;
	
	
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьВидимостьКликов() ;
	УстановитьВидимостьУдаров();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		
		МенеджерыОбъектов = Новый Массив();
		
		МенеджерыОбъектов.Добавить(ПредопределенноеЗначение("Документ.Лико_ЗаказНаРаскрой.ПустаяСсылка"));       
		
		
		МассивСсылок = ПолучитьМассивСсылокСервер(ДанныеШтрихкода.Штрихкод, МенеджерыОбъектов);
		
		
		
		
		Если МассивСсылок.Количество() > 0 Тогда
			Объект.ЗаказНаРаскрой = МассивСсылок[0]; 				
		Иначе 	
			
			Сообщить(Результат.Ошибка);
		КонецЕсли;
		
		
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			//Объект.Сотрудник = Результат.Сотрудник;
			Объект.Сотрудник = ПолучитьСотрудникаПоФизЛицуСервер(Результат.Сотрудник);
			
			//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДоплнительно;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			ОбработатьНоменклатуру(Результат);
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") Тогда
			Объект.ЗаказПокупателя=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			ОчиститьВидыРабот();
			ЗаполнитьВидыРабот();
			Если Не лкЗакрытиеБланкаЗаказаНеНомерБланкаИзВБЗ ТОгда	
				Объект.НомерБланка=Результат.НомерБланка;
			КонецЕсли;
			
			ПолучитьНомерПроката();
			Попытка
				
				
				//ОписаниеОшибки()
				
				Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказПокупателя,"Номер"),7));
				
			Исключение
			КонецПопытки;
			
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
			Объект.РабочийЦентр=Результат.РабочийЦентр;
			ОчиститьВидыРабот();
			ЗаполнитьВидыРабот();
			ПолучитьНомерПроката(); 			
			ВводКликов();
			РаспределяемыеМатериалы();
			УстановитьПодразделение();
			
			
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			Объект.ЗаказПокупателя=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			Если Не лкЗакрытиеБланкаЗаказаНеНомерБланкаИзВБЗ ТОгда	
				
				Объект.НомерБланка=Результат.НомерБланка; 
			КонецЕсли;
			
			ПолучитьНомерПроката();  			
			Попытка				
				//ОписаниеОшибки()				
				Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказПокупателя,"Номер"),7));
				
			Исключение
			КонецПопытки;
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//Это ячейка
			Объект.ЯчейкаПолучатель = Результат.АдресаХранения;
			ЯчейкаПолучательПриИзмененииНаСервере();
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДоплнительно;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьМассивСсылокСервер(Штрихкод, МенеджерыОбъектов) //+Лико m.shenderov 25.04.2018
	
	Возврат  ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, МенеджерыОбъектов);	
КонецФункции  //-Лико m.shenderov 25.04.2018


&НаСервереБезКонтекста
Функция УстановитьВидУчетаПоСекцииСервер(Дата) //+Лико m.shenderov 11.10.2023
	
	     Возврат Документы.Лико_БланкЭтапа.УчетПоВидуСекцииУстановлен(Дата);
	
КонецФункции  //-Лико m.shenderov 11.10.2023



&НаСервереБезКонтекста
Функция ПолучитьСотрудникаПоФизЛицуСервер(ФизЛицо) //+Лико m.shenderov 04.01.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Сотрудники.ВАрхиве
	|	И Сотрудники.ФизическоеЛицо = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо",ФизЛицо );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
	
КонецФункции  //-Лико m.shenderov 04.01.2018


&НаКлиенте
Процедура ОбработатьНоменклатуру(Результат) //+Лико m.shenderov 08.12.2017
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка") Тогда
		
		СтруктураНоменклатура = Новый Структура;
		ПолучитьСтруктуруОбъектаНоменклатуры(СтруктураНоменклатура,Результат.ОбъектНоменклатуры);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",СтруктураНоменклатура.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика",СтруктураНоменклатура.Характеристика);
		СтруктураПоиска.Вставить("Серия",СтруктураНоменклатура.Серия);
		
		НайденныеСтроки=Объект.Товары.НайтиСтроки(СтруктураПоиска);	
		
		Если  НайденныеСтроки.Количество()=0 Тогда
			
			НовыйТовар = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатура);
			//Если СтруктураНоменклатура.Уникальный Тогда
			//НовыйТовар.СтатусУказанияСерий=8;		
			
			//КонецЕсли;
			Элементы.Товары.ТекущаяСтрока=НовыйТовар.ПолучитьИдентификатор(); 
			//ТоварыНоменклатураПриИзменении(Неопределено);
			//ТоварыКоличествоУпаковокПриИзменении(Неопределено);
			//ПослеЗаписиНаСервере();
			Если Не ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.АдресХранения) Тогда
				
				ОткрытьПодборСерий("Товары");
			КонецЕсли;
		КонецЕсли;
		
		
		
		
	Иначе
		
		
		СтруктураНоменклатуры= СформироватьСтруктуруНоменклатуры();
		ПолучитьСтруктуруНоменклатурыСервер(СтруктураНоменклатуры,Результат.ОбъектНоменклатуры);
		Если ЗначениеЗаполнено(СтруктураНоменклатуры.Номенклатура) Тогда
			СтруктураПоиска = Новый Структура;
			
			СтруктураПоиска.Вставить("Номенклатура",СтруктураНоменклатуры.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика",СтруктураНоменклатуры.Характеристика);
			СтруктураПоиска.Вставить("Серия",СтруктураНоменклатуры.Серия);
			НайденныеСтроки=Объект.Товары.НайтиСтроки(СтруктураПоиска);	
			
			Если НайденныеСтроки.Количество()>0  Тогда
				Возврат;		
			КонецЕсли;
			РЦ=Неопределено;
			НайтиНаСкладе(РЦ,СтруктураНоменклатуры);
			Если РЦ=Неопределено Тогда
				
				ОчиститьСообщения(); 	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден материал!'"), ,
				"Объект.КоличествоКликов");  
				
				
			Иначе
				НоваяСтрока=Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураНоменклатуры);
				НоваяСтрока.РабочийЦентр=РЦ;
				Элементы.Товары.ТекущаяСтрока=НоваяСтрока.ПолучитьИдентификатор();
				Если ИспользоватьАлгоритмПоФакту Тогда
					РасчитатьДлинуРолика("ПриСканировании");
				Иначе
					ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКоличестваНоменклатуры", ЭтаФорма);
					ПоказатьВводЧисла(ОписаниеОповещения,,"Введите количество:",15,3); 			
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 08.12.2017

&НаСервереБезКонтекста
Процедура ПолучитьСтруктуруОбъектаНоменклатуры(Структура,ОбъектНоменклатуры) //+Лико m.shenderov 14.01.2018
	
	Структура.Вставить("Номенклатура"	,	ОбъектНоменклатуры.Номенклатура);
	Структура.Вставить("Характеристика" ,	ОбъектНоменклатуры.Характеристика);
	Структура.Вставить("Упаковка"       ,   ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);
	Структура.Вставить("Количество",        ОбъектНоменклатуры.Количество);
	Структура.Вставить("КоличествоУУ"     ,	ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);
	Структура.Вставить("КоличествоРасход",        ОбъектНоменклатуры.Количество);
	Структура.Вставить("КоличествоРасходУУ"     ,	ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);
	
	
	Структура.Вставить("Серия"          ,	ОбъектНоменклатуры.Серия);
	Структура.Вставить("Уникальный"     ,   ОбъектНоменклатуры.Уникальный);
	
	АдресХранения=Неопределено;
	
	
	
	Если ОбъектНоменклатуры.Уникальный И ЗначениеЗаполнено(ОбъектНоменклатуры.Серия) Тогда
		
		АдресХранения=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерии(ОбъектНоменклатуры.Серия);
	КонецЕсли;
	Структура.Вставить("АдресХранения" ,АдресХранения);
	
	
	
КонецПроцедуры  //-Лико m.shenderov 14.01.2018


&НаКлиенте
Процедура ПослеВводаКоличестваНоменклатуры(Число, Параметры) Экспорт
	Если НЕ Число = Неопределено Тогда
		ТекущаяСтрока= Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
		
		//ТекущаяСтрока.Количество = Число;
		//ТекущаяСтрока.КоличествоУУ= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(ТекущаяСтрока.Серия,текущаяСтрока.Количество);
		
		ТекущаяСтрока.КоличествоРасход = ?(Число=0,текущаяСтрока.Количество,Число);
		ТекущаяСтрока.КоличествоРасходУУ= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(ТекущаяСтрока.Серия,ТекущаяСтрока.КоличествоРасход);
		РасчетКоличестваТаблицыТовары();
		
		//Если ТекущаяСтрока.ВозвратКоличество<>0 Тогда
		ТекущаяСтрока.Списать = Истина;
		//КонецЕсли;
		//Иванова Анна 20181023
		Если ЗначениеЗаполнено(текущаяСтрока.Номенклатура) И  ЗначениеЗаполнено(Объект.ЗаказПокупателя) ТОгда 
			ЗаполнитьВидРаботНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());	
		КонецЕсли;
		
		СразуНаПринтер=ПолучитьСвойствоСерверСразуНапринтер();
		Если СразуНаПринтер И ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			//Если ИспользоватьАлгоритмПоФакту Тогда
			ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Серия,"ЯССМ_ОбъектНоменклатуры");
			ОбъектНоменклатуры_Количество=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектНоменклатуры,"Количество");				
			
			Если ТекущаяСтрока.ВозвратКоличество>0 и  ТекущаяСтрока.Количество<>ТекущаяСтрока.ВозвратКоличество ТОгда
				КоличествоНаПечать=ТекущаяСтрока.ВозвратКоличество;
			Иначе
				КоличествоНаПечать=0;
			КонецЕсли;
			
			Если КоличествоНаПечать>0 Тогда	
				
				//+m.shenderov 03.10.2016 			
				//ЯССМ_Печать.ПечатьШтрихкодаОбъектаНоменклатуры(СтрокаТовары.ОбъектНоменклатуры, 1, СразуНаПринтер, , );
				
				КолНаПечать=КоличествоНаПечать;
				ТекСерия=ТекущаяСтрока.Серия;
				ПодключитьОбработчикОжидания("ПечатьБиркиОстаток",1,Истина);
				////Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ЗначениеРеквизитаОбъектаСервер(ТекущаяСтрока.Серия,"ЯССМ_ОбъектНоменклатуры"),,,КоличествоНаПечать);
				
				//-m.shenderov 03.10.2016 			
			КонецЕсли; 				
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьБиркиОстаток() //+Лико m.shenderov 22.06.2018
	Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ЗначениеРеквизитаОбъектаСервер(ТекСерия,"ЯССМ_ОбъектНоменклатуры"),,,КолНаПечать);
	
КонецПроцедуры //-Лико m.shenderov 22.06.2018




&НаСервереБезКонтекста
Функция ПолучитьСвойствоСерверСразуНапринтер() //+Лико m.shenderov 18.12.2017
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);	
КонецФункции  //-Лико m.shenderov 18.12.2017




&НаСервереБезКонтекста
Процедура НайтиНаСкладе (РЦ,СтруктураНоменклатуры) //+Лико m.shenderov 08.12.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеЦентры.Ссылка КАК РЦ
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Серия = &Серия
	|				И Характеристика = &Характеристика) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры КАК РабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = РабочиеЦентры.ЛикоЯчейка";
	Запрос.УстановитьПараметр("Номенклатура",СтруктураНоменклатуры.Номенклатура );
	Запрос.УстановитьПараметр("Серия",?(ЗначениеЗаполнено(СтруктураНоменклатуры.Серия),СтруктураНоменклатуры.Серия,Справочники.СерииНоменклатуры.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Характеристика",?(ЗначениеЗаполнено(СтруктураНоменклатуры.Характеристика),СтруктураНоменклатуры.Характеристика,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Рц=Выборка.РЦ;
	КонецЦикла; 
	
	
КонецПроцедуры  //-Лико m.shenderov 08.12.2017



&НаКлиенте
Функция СформироватьСтруктуруНоменклатуры() //+Лико m.shenderov 08.12.2017
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура");
	Структура.Вставить("Характеристика");
	Структура.Вставить("Серия");
	Структура.Вставить("Нарезка");
	Структура.Вставить("ЕдиницаИзмерения");
	Структура.Вставить("Количество");
	Структура.Вставить("КоличествоУУ"); 
	Возврат Структура;
КонецФункции  //-Лико m.shenderov 08.12.2017



&НаСервереБезКонтекста
Процедура ПолучитьСтруктуруНоменклатурыСервер(СтруктураНоменклатуры,ОбъектНоменклатуры) //+Лико m.shenderov 08.12.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия,
	|	ЯССМ_ОбъектыНоменклатуры.Характеристика КАК Характеристика,
	|	ЯССМ_ОбъектыНоменклатуры.Нарезка КАК Нарезка,
	|	ЯССМ_ОбъектыНоменклатуры.ЕдиницаИзмеренияУУ КАК ЕдиницаИзмерения,
	|	ЯССМ_ОбъектыНоменклатуры.Количество КАК Количество,
	|	ЯССМ_ОбъектыНоменклатуры.Количество * ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК КоличествоУУ
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ОбъектНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Выборка);
	КонецЦикла; 
	
	
	
КонецПроцедуры  //-Лико m.shenderov 08.12.2017



&НаСервереБезКонтекста
Функция ПолучитьЗаказКлиентаПоНомеру260521(НомерЗаказа) //+Лико m.shenderov 30.11.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерБезПрефикса = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомерЗаказа );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
	
	
КонецФункции  //-Лико m.shenderov 30.11.2017

&НаСервереБезКонтекста
Функция ПолучитьЗаказКлиентаПоНомеру(НомерЗаказа)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерБезПрефикса = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомерЗаказа );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
КонецФункции


&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	Если Объект.Проведен Тогда
		
		ПечатьПослеПроведения();
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ДействиеПослеЗаписи") Тогда
		Если ПараметрыЗаписи.ДействиеПослеЗаписи="ВосстановитьЭтап" Тогда
			ВосстановитьЭтап();
		КонецЕсли;
		
	КонецЕсли;
	ЗаполнитьТаблицуТиповыеДокументы();
	
КонецПроцедуры

Процедура ОписаниеОповещения() //+Лико m.shenderov 19.10.2017
	
	
	
КонецПроцедуры //-Лико m.shenderov 19.10.2017





&НаКлиенте
Процедура ПечатьИзмененныхОбъектовНоменклатуры() 	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Если Не СтрокаТовары.Списать Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТовары.Серия)Тогда
			Продолжить;
		КонецЕсли;
		
		// если возвращаем частичный товар
		ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(СтрокаТовары.Серия,"ЯССМ_ОбъектНоменклатуры");
		ОбъектНоменклатуры_Количество=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектНоменклатуры,"Количество");
		
		Если  СтрокаТовары.ВозвратКоличество<>0   Тогда
			
			КоличествоНаПечать = СтрокаТовары.ВозвратКоличество;
		Иначе
			Продолжить;
		КонецЕсли;
		
		//+m.shenderov 03.10.2016 			
		//ЯССМ_Печать.ПечатьШтрихкодаОбъектаНоменклатуры(СтрокаТовары.ОбъектНоменклатуры, 1, СразуНаПринтер, , );
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ЗначениеРеквизитаОбъектаСервер(СтрокаТовары.Серия,"ЯССМ_ОбъектНоменклатуры"),,,КоличествоНаПечать);
		//-m.shenderov 03.10.2016 			
		
	КонецЦикла;
	
	
	
КонецПроцедуры //ПечатьИзмененныхОбъектовНоменклатуры


&НаКлиенте
Процедура ПечатьОбъектовНоменклатуры() 	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Если Не СтрокаТовары.Списать Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТовары.Серия)Тогда
			Продолжить;
		КонецЕсли;
		
		
		
		//+m.shenderov 03.10.2016 			
		//ЯССМ_Печать.ПечатьШтрихкодаОбъектаНоменклатуры(СтрокаТовары.ОбъектНоменклатуры, 1, СразуНаПринтер, , );
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ЗначениеРеквизитаОбъектаСервер(СтрокаТовары.Серия,"ЯССМ_ОбъектНоменклатуры"),,,);
		//-m.shenderov 03.10.2016 			
		
	КонецЦикла;
	
	
	
КонецПроцедуры //ПечатьИзмененныхОбъектовНоменклатуры



&НаКлиенте
Процедура ПечатьВыпущеннойПродукции() 	
	Для Каждого СтрокаТовары Из Объект.Выпуск Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.Серия)Тогда
			Продолжить;
		КонецЕсли; 		
		// если возвращаем частичный товар
		
		
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ЗначениеРеквизитаОбъектаСервер(СтрокаТовары.Серия,"ЯССМ_ОбъектНоменклатуры"),,,СтрокаТовары.Количество);
		//-m.shenderov 03.10.2016 			
		
	КонецЦикла;
	
	
	
КонецПроцедуры //ПечатьИзмененныхОбъектовНоменклатуры


&НаКлиенте
Процедура ПечатьСтикераДокумента(БыстраяПечать=Истина)  	
	ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСтикераДокумента(Объект.Ссылка);	
	
	Если ПечатьСразуНаПринтер() Тогда
		ТабДокумент.Напечатать(БыстраяПечать);
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПечатьСразуНаПринтер() //+Лико m.shenderov 19.10.2017
	Возврат	Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
КонецФункции  //-Лико m.shenderov 19.10.2017


&НаКлиенте
Процедура ЯчейкаПолучательПриИзменении(Элемент)
	ЯчейкаПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЯчейкаПолучательПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ЯчейкаПолучатель) Тогда
		Объект.СкладПолучатель = Объект.ЯчейкаПолучатель.Владелец;
	КонецЕсли;
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	//Элементы.СкладПолучатель.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ЯчейкаПолучатель);
КонецПроцедуры

&НаКлиенте
Процедура ПаллетПриИзменении(Элемент)
	ПаллетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПаллетПриИзмененииНаСервере()
	
	ОбъектДокумент = РеквизитФормыВЗначение("Объект");
	ОбъектДокумент.ПаллетПриИзменении();
	ЗначениеВРеквизитФормы(ОбъектДокумент, "Объект");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураПоШтрихкоду(ПараметрыОбработки, КэшированныеЗначения)
	
	Возврат ШтрихкодированиеНоменклатурыСервер.НоменклатураПоШтрихкоду(ПараметрыОбработки, КэшированныеЗначения); 
	
КонецФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСерииПоПаллету(Команда)
	ПаллетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	Объект.ЯчейкаПолучатель = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура СодержимоеПриИзменении(Элемент)
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьПоРабочемуЦентруНаСервере()
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		Объект.Товары.Очистить(); 		
	КонецЕсли; 	
	
	ТоварыВДокументе = Объект.Товары.Выгрузить();
	ТоварыВОстатках = Лико_Склады.ОстаткиПоСкладу(Объект.РабочийЦентр,Неопределено).Выгрузить();
	
	
	ТоварыОбщее = ТоварыВДокументе.СкопироватьКолонки();
	
	Для Каждого СтрокаТоварыВДокументе Из ТоварыВДокументе Цикл
		НоваяСтрока = ТоварыОбщее.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоварыВДокументе, , "Количество,КоличествоУУ");
	КонецЦикла;
	Для Каждого СтрокаТоварыВОстатках Из ТоварыВОстатках Цикл
		НоваяСтрока = ТоварыОбщее.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоварыВОстатках);
	КонецЦикла;
	
	ТоварыОбщее.Свернуть("Номенклатура,Характеристика,Серия,РабочийЦентр","Списать, Количество, КоличествоУУ, ВозвратКоличество, ВозвратКоличествоУУ, ГотоваяПродукцияКоличество, ГотоваяПродукцияКоличествоУУ");
	
	Объект.Товары.Загрузить(ТоварыОбщее);
	Объект.Товары.Сортировать("Серия Возр");
	
	//+ Лико m.shenderov 09.04.2018
	//+m.shenderov 22.12.2016
	Если ЗначениеЗаполнено(Объект.ЗаказПокупателя) Тогда
		ТзНоменклатура=Объект.Товары.Выгрузить(,"Серия");
		НоменклатураКСписанию=ПолучитьНоменклатуруКСписаниюНаЗаказ(ТзНоменклатура,(Объект.ЗаказПокупателя));
		Для каждого Ном  Из НоменклатураКСписанию Цикл
			Структура = Новый Структура;
			Структура.Вставить("Серия",Ном.Серия);
			//СтрНом=Объект.Товары.НайтиСтроки(Ном.Серия,"Серия");
			НайденныеСтроки=Объект.Товары.НайтиСтроки(Структура);
			Для каждого СтрНом Из НайденныеСтроки Цикл
				СтрНом.Списать=Истина;
				Если СтрНом.КоличествоРасход=0 И СтрНом.ВозвратКоличество=0 Тогда
					СтрНом.КоличествоРасход=СтрНом.Количество;
					РасчетКоличестваТаблицыТоварыСервер(СтрНом);
				КонецЕсли;
				
				
			КонецЦикла;
			
			//		Если СтрНом<>Неопределено Тогда 
			//			СтрНом.Списать=Истина;
			//		КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	//- Лико m.shenderov 09.04.2018
	
	
	
	//Объект.Товары.Загрузить(Лико_Склады.ОстаткиПоСкладу(Объект.СкладОтправитель).Выгрузить());
КонецПроцедуры

&НаСервере
Функция  	ПолучитьНоменклатуруКСписаниюНаЗаказ(ТзНоменклатура,НомерЗаказа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ТоварыНаРабочихЦентрах.Серия
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках КАК ЯССМ_ТоварыНаРабочихЦентрах
	|ГДЕ
	|	ЯССМ_ТоварыНаРабочихЦентрах.Серия В(&Серии)
	|	И ЯССМ_ТоварыНаРабочихЦентрах.Регистратор.ЗаказКлиента = &НомерЗаказа
	|	И ЯССМ_ТоварыНаРабочихЦентрах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (ЯССМ_ТоварыНаРабочихЦентрах.Номенклатура.ВидНоменклатуры=&ГруппаКраска
	|			ИЛИ ЯССМ_ТоварыНаРабочихЦентрах.Номенклатура.ВидНоменклатуры=&ГруппаХимия)";
	Запрос.УстановитьПараметр("Серии",ТзНоменклатура );
	Запрос.УстановитьПараметр("НомерЗаказа",НомерЗаказа );
	Запрос.УстановитьПараметр("ГруппаКраска",Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Краска"));
	Запрос.УстановитьПараметр("ГруппаХимия",Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Краска"));
	
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
	
	
КонецФункции



&НаКлиенте
Процедура ЗагрузитьПоРабочемуЦентру(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		Предупреждение("Необходимо указать рабочий центр!");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьПоРабочемуЦентруНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьДлинуРолика(Команда)
	ТекущиеДанные= Элементы.Товары.ТекущиеДанные;
	
	//ТекущаяСтрока= Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
	Структура.Вставить("НачальныйДиаметр",РазмерНаружногоДиаметра(ТекущиеДанные.Серия));
	
	ОписаниеОповещения= Новый ОписаниеОповещения("РассчитатьДлинуРоликаЗавершение",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.Лико_РасчетДлиныРолика",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДлинуРоликаЗавершение(РезультатФормы,ПараметрыФормы) Экспорт//+Лико m.shenderov 12.09.2017
	ТекущаяСтрока= Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Если РезультатФормы<>Неопределено Тогда
		Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
			
			Если ГруппаПользователя=ПредопределенноеЗначение("Перечисление.Лико_ГруппаПользователя.ЦифровойУчасток") Тогда
				ТекущаяСтрока.КоличествоРасход = РезультатФормы.ДлинаРолика;
				ТекущаяСтрока.КоличествоРасходУУ= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(ТекущаяСтрока.Серия,текущаяСтрока.Количество);
				ТекущаяСтрока.Списать = Истина;
				РасчетКоличестваТаблицыТовары();
			Иначе
				
				ТекущаяСтрока.ВозвратКоличество = РезультатФормы.ДлинаРолика;
				ТекущаяСтрока.ВозвратКоличествоУУ= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(ТекущаяСтрока.Серия,текущаяСтрока.ВозвратКоличество);
				
				Если ТекущаяСтрока.ВозвратКоличество<>0 Тогда
					ТекущаяСтрока.Списать = Истина;
				КонецЕсли;
				РасчетКоличестваТаблицыТовары(Истина);
				
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 12.09.2017



&НаСервереБезКонтекста
Функция РазмерНаружногоДиаметра(Серия) //+Лико m.shenderov 12.09.2017
	РазмерНаружногоДиаметра=0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Втулка.РазмерНаружногоДиаметра КАК Размер
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Ссылка = &Серия";
	Запрос.УстановитьПараметр("Серия",Серия );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		РазмерНаружногоДиаметра=Выборка.Размер;
	КонецЦикла; 
	Возврат РазмерНаружногоДиаметра;
	
КонецФункции //РазмерНаружногоДиаметра -Лико m.shenderov 12.09.2017


&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);		
КонецФункции 

&НаКлиенте
Процедура ВыпускКоличествоПриИзменении(Элемент)
	Элементы.Выпуск.ТекущиеДанные.КоличествоУУ=Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Элементы.Выпуск.ТекущиеДанные.Серия,Элементы.Выпуск.ТекущиеДанные.Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// <-- Начало Лико Яцун С. В. 25.06.2024
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РезультатПроверкиЗаполненияТУ = ПроверитьЗаполнениеПараметровТУ();
		Если ЗначениеЗаполнено(РезультатПроверкиЗаполненияТУ) Тогда
			Сообщить(РезультатПроверкиЗаполненияТУ);
			Отказ = Истина;
			Возврат; 
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 25.06.2024
	
	//Если Объект.Проведен  Тогда
		//	Отказ=Истина;
		//Лико_ДополнительноКлиент.СообщитьДляКлиента("Для записи документа необходимо сделать отмену проведения!");
		
		
		
				
	//КонецЕсли; 
	
	
	Если  УчетПравилПеремещенияТМЦ Тогда
		
		Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение  
			И Не ПараметрыЗаписи.Свойство("ПроверкаПравилПеремещенияТМЦПередЗаписью") Тогда
			
			
			Ответ = ПроверитьПеремещенияТМЦСервер(Отказ,ПараметрыЗаписи.РежимЗаписи, УчетПравилПеремещенияТМЦ);
			
			Если ТипЗнч(Ответ)=Тип("Массив") И  Ответ.Количество()>0 Тогда
				
				Текст ="";
				Для каждого Комментарий Из Ответ Цикл
					Текст = Текст+?(ЗначениеЗаполнено(Текст),"|"+Комментарий,Комментарий);
					Сообщить(Комментарий);
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(Текст) Тогда
					
					Текст=Текст+"
					| Продолжить?";
					
					Режим = РежимДиалогаВопрос.ДаНет;
					Оповещение = Новый ОписаниеОповещения("ПроверкаПравилПеремещенияТМЦПередЗаписью", ЭтотОбъект, Новый Структура("Отказ,ПроверкаПравилПеремещенияТМЦПередЗаписью",Отказ,Ложь));
					ПоказатьВопрос(Оповещение, Текст, Режим, 0); 
					Отказ=Истина;
					Возврат;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

	
	// Вставить содержимое обработчика.
КонецПроцедуры 

&НаСервере
Функция ПроверитьПеремещенияТМЦСервер(Отказ,РежимЗаписи, УчетПравилПеремещенияТМЦ)  //+Лико m.shenderov 16.02.2026

	Ответ = "";		
	Если УчетПравилПеремещенияТМЦ Тогда
		
		Результат  = Неопределено; 
		Если 	РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(Объект,Отказ,Результат);
			
		КонецЕсли;
		
		
		Если ТипЗнч(Результат)=Тип("Структура") И Результат.Свойство("ПроверкаПравил") Тогда
			
			Если ТипЗнч(Результат.ПроверкаПравил)=Тип("ТаблицаЗначений") Тогда
				
				Ответ=Результат.ПроверкаПравил.ВыгрузитьКолонку("Комментарий");	
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
		
  Возврат Ответ;
	
КонецФункции  //-Лико m.shenderov 16.02.2026


&НаКлиенте
Процедура ПроверкаПравилПеремещенияТМЦПередЗаписью(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	НеВыполнятьПроверкуПередЗаписью=Истина;
	Структура = Новый Структура;
	Структура.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	Структура.Вставить("ПроверкаПравилПеремещенияТМЦПередЗаписью",Истина);
	Записать(Структура);
	
КонецПроцедуры





&НаСервере
Функция ПроверитьЗаполнениеПараметровТУ() // <-- Начало Лико Яцун С. В. 25.06.2024
	
	РезультатПроверкиЗаполненияТУ = "";
	
	Если ЗначениеЗаполнено(Объект.РабочийЦентр)
		И Объект.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки
		И ЗначениеЗаполнено(Объект.ЗаказПокупателя)
		// --> Начало Лико Ефимов ЕВВ 10.07.2024
		И Объект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра
		// <-- Конец Лико Ефимов ЕВВ 10.07.2024
		Тогда
		НайденныеСтрокиПараметрыСклейки = Объект.ЗаказПокупателя.ПараметрыСклейки.НайтиСтроки(Новый Структура("РабочийЦентр",Объект.РабочийЦентр));
		НайденныеСтрокиПараметрыПродувки = Объект.ЗаказПокупателя.ПараметрыПродувки.Количество();
		Если НайденныеСтрокиПараметрыСклейки.Количество() = 0 Тогда
			РезультатПроверкиЗаполненияТУ = "Для заказа " + Объект.ЗаказПокупателя.НомерБезПрефикса + " не заполнены параметры склейки ТУ по указанному рабочему центру " + Объект.РабочийЦентр;
		КонецЕсли;
		Если НайденныеСтрокиПараметрыПродувки = 0 Тогда
			РезультатПроверкиЗаполненияТУ = ?(ЗначениеЗаполнено(РезультатПроверкиЗаполненияТУ),
			"Для заказа " + Объект.ЗаказПокупателя.НомерБезПрефикса + " не заполнены параметры склейки ТУ по указанному рабочему центру " + Объект.РабочийЦентр + ". Не заполнены параметры продувки ТУ",
			"Для заказа " + Объект.ЗаказПокупателя.НомерБезПрефикса + " не заполнены параметры продувки ТУ");
		КонецЕсли; 
	КонецЕсли;
	
	Возврат РезультатПроверкиЗаполненияТУ;
		
КонецФункции // <-- Конец Лико Яцун С. В. 25.06.2024

&НаКлиенте
Процедура ТоварыВозвратКоличествоПриИзменении(Элемент)
	
	РасчетКоличестваТаблицыТовары(Истина);
	//Элементы.Товары.ТекущиеДанные.ВозвратКоличествоУУ=Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Элементы.Товары.ТекущиеДанные.Серия,Элементы.Товары.ТекущиеДанные.ВозвратКоличество);
	//Лико_ОбщегоНазначенияСервер.ИзменитьКоличествоВОбъектеНоменклатуры(Элементы.Товары.ТекущиеДанные.Серия,Элементы.Товары.ТекущиеДанные.ВозвратКоличество); 	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПокупателяПриИзменении(Элемент)
	ПолучитьНомерПроката();
	Попытка
		Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказПокупателя,"Номер"),7));
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	ОчиститьВидыРабот();
	
	//Пока Не используем	
	ЗаполнитьВидыРабот();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьБирок(Команда)
	ПечатьВыпущеннойПродукции();
	ПечатьОбъектовНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСтикераДокумента1(Команда)
	ПечатьСтикераДокумента();
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъектНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ААА=111;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияИмяКороткоеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ААА=111;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочийЦентрПриИзменении(Элемент)
	ПолучитьНомерПроката();
	ВводКликов();
	ОчиститьВидыРабот();
	//пока не используем
	ЗаполнитьВидыРабот();
	РаспределяемыеМатериалы();
	УстановитьВидимостьУдаров();
	УстановитьПодразделение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНомерПроката() //+Лико m.shenderov 21.11.2017
	Объект.НомерПроката=0;
	МассивНомеровПроката=Лико_ОбщегоНазначенияСервер.ПолучитьНомерПроката(Объект.ЗаказПокупателя,Объект.РабочийЦентр);

	Если МассивНомеровПроката.Количество()=1 Тогда
		Объект.НомерПроката=МассивНомеровПроката[0];
	ИначеЕсли  МассивНомеровПроката.Количество()>1 Тогда
		ОписаниеОповещение= Новый ОписаниеОповещения("ПолучитьНомерПрокатаЗавершение",ЭтаФорма);
		СЗ = Новый СписокЗначений;
		Сз.ЗагрузитьЗначения(МассивНомеровПроката);
		Структура = Новый Структура;
		Структура.Вставить("Прокаты",МассивНомеровПроката);
		ОткрытьФорму("Документ.Лико_БланкЭтапа.Форма.ФормаВыбораПроката",Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;


	//Объект.НомерПроката=Лико_ОбщегоНазначенияСервер.ПолучитьНомерПроката(Объект.ЗаказПокупателя,Объект.РабочийЦентр);
	Если Не ЗначениеЗаполнено(Объект.НомерБланка) и ЗначениеЗаполнено(Объект.ЗаказПокупателя) Тогда
		Объект.НомерБланка= ПолучитьНомерБланкаСервер(Объект.ЗаказПокупателя);
	КонецЕсли;

КонецПроцедуры //-Лико m.shenderov 21.11.2017

&НаКлиенте
Процедура ПолучитьНомерПрокатаЗавершение(Результат,Параметры) Экспорт//+Лико m.shenderov 08.06.2020
Объект.НомерПроката=Результат;	
КонецПроцедуры //-Лико m.shenderov 08.06.2020


&НаСервереБезКонтекста
Функция ПолучитьНомерБланкаСервер(ЗаказКлиента) //+Лико m.shenderov 18.12.2017
	Если Не Справочники.Лико_РабочиеМеста.ПолучитьСвойство("АвтоНумерацияБланковВЗакрытии",Ложь) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Лико_БланкЭтапа.НомерБланка), 0) КАК НомерБланка
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|ГДЕ
	|	Лико_БланкЭтапа.ЗаказПокупателя = &ЗаказКлиента
	|	И Лико_БланкЭтапа.Проведен
	|	И НЕ Лико_БланкЭтапа.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерБланка+1;
	КонецЦикла; 
	
	Возврат 1;	
КонецФункции  //-Лико m.shenderov 18.12.2017



&НаКлиенте
Процедура ВводКликов() //+Лико m.shenderov 08.12.2017
	Если  ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		ИспользоватьАлгоритмПоФакту=ИспользоватьАлгоритмПоФактуСервер(Объект.РабочийЦентр);	
		
		
		
		Если ЦифорвоеРЦСервер(Объект.РабочийЦентр) Тогда
			ВводитьКликиПриЗакрытииЗаказа=Истина;
			КликИндиго=ПолучитьКликИндигоСервер();
			Объект.КоличествоКликов=0;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтаФорма);
			ПоказатьВводЧисла(ОписаниеОповещения,,"Введите количество кликов:",15,3); 		
			
		КонецЕсли;
		
		
	Иначе
		ИспользоватьАлгоритмПоФакту=Ложь;
		ВводитьКликиПриЗакрытииЗаказа=Ложь;
		
		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 08.12.2017

&НаКлиенте
Процедура ПослеВводаКоличества(Число, Параметры) Экспорт
	Если НЕ Число = Неопределено Тогда
		КликИндиго=ПолучитьКликИндигоСервер();
		
		НайденаяСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",КликИндиго));
		Если   НайденаяСтроки.Количество()>0 Тогда
			НовыйТовар=НайденаяСтроки[0];
		Иначе
			НовыйТовар					=Объект.Товары.Добавить();
		КонецЕсли;
		
		
		НовыйТовар.Номенклатура	=КликИндиго;
		НовыйТовар.КоличествоРасход			=Число;
		НовыйТовар.КоличествоРасходУУ		=Число;
		НовыйТовар.Списать					=Истина;
		УстановитьВидимостьКликов();
		
		
		
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ИспользоватьАлгоритмПоФактуСервер(РЦ) //+Лико m.shenderov 09.12.2017
	
	Возврат РЦ.Лико_ИспользоватьАлгоритмПоФакту;	
	
КонецФункции  //-Лико m.shenderov 09.12.2017



&НаСервереБезКонтекста
Функция ЦифорвоеРЦСервер(РЦ) //+Лико m.shenderov 08.12.2017
	Если Рц.Лико_ВводитьКликиПриЗакрытииЗаказа Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции  //-Лико m.shenderov 08.12.2017

&НаСервереБезКонтекста
Функция ПолучитьКликИндигоСервер() //+Лико m.shenderov 08.12.2017
	
	Возврат Справочники.Лико_ПредопределенныеЗначения.CLICKS_INDIGO.ЗначениеПараметра;
	
КонецФункции  //-Лико m.shenderov 08.12.2017

&НаКлиенте
Процедура УстановитьВидимостьКликов() //+Лико m.shenderov 08.12.2017
	Если ВводитьКликиПриЗакрытииЗаказа Тогда
		Элементы.ГруппаКлик.Видимость=Истина;
	Иначе
		Элементы.ГруппаКлик.Видимость=Ложь;
		
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 08.12.2017
&НаСервере
Процедура УстановитьВидимостьУдаров() //+Лико m.shenderov 08/01/2020
Если Объект.РабочийЦентр.Лико_ВводитьУдарыПриЗакрытииЗаказа Тогда
		Элементы.КоличествоУдаров.Видимость=Истина;
	Иначе
		Элементы.КоличествоУдаров.Видимость=Ложь;
		
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 08/01/2020



&НаКлиенте
Процедура ОчиститьТовары(Команда)
	Объект.Товары.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКликовПриИзменении(Элемент)
	Если значениеЗаполнено(Объект.РабочийЦентр) Тогда 
		Если ЗначениеЗаполнено(Объект.КоличествоКликов) Тогда 
			Раппорт=РабочийЦентрРаппортСервер(Объект.РабочийЦентр);
			Если Раппорт =0.98 Тогда
				Если Объект.КоличествоКликов/2 > Цел(Объект.КоличествоКликов/2) Тогда
					
					ОчиститьСообщения(); 	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Проверьте количество кликов для раппорта 0.98. Должно быть четное число'"), ,
					"Объект.КоличествоКликов");  
					Объект.КоличествоКликов = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РабочийЦентрРаппортСервер(РабочийЦентр) //+Лико m.shenderov 09.12.2017
	
	Возврат РабочийЦентр.Раппорт;	
	
КонецФункции  //-Лико m.shenderov 09.12.2017

&НаКлиенте
Процедура ДобавитьРолик(Команда)
	Товар=Элементы.Товары.ТекущиеДанные;	
	Структура = Новый Структура;
	Структура.Вставить("ВидОперации","ДобавитьВОрдер");
	Структура.Вставить("BRC",Ложь); 
	Структура.Вставить("ЗакрытиеБланка",Истина);


	Если Товар<>Неопределено  Тогда  
		Структура.Вставить("Номенклатура",Товар.Номенклатура);
		Структура.Вставить("Характеристика",Товар.Характеристика);
		Структура.Вставить("Количество",Товар.КоличествоУУ);
		Структура.Вставить("КоличествоУпаковок",Товар.Количество);
		Нарезка= Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Характеристика,"ЯССМ_Нарезка");
		Если ЗначениеЗаполнено(Нарезка) Тогда
			
			Структура.Вставить("Упаковка",ПолучтьУпаковкуПоНарезкеСервер(Нарезка));
		КонецЕсли;
		
	КонецЕсли;
	ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ПодборСерийЗавершение",ЭтаФорма);
	ОткрытьФорму("Обработка.Лико_СозданиеОбъектовНоменклатурыГрупповое.Форма.Форма",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучтьУпаковкуПоНарезкеСервер(Нарезка) //+Лико m.shenderov 15.12.2017
	
	Возврат Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка);
	
КонецФункции  //-Лико m.shenderov 15.12.2017


&НаКлиенте 
Процедура Лико_ПодборСерийЗавершение(РезультатФорма,ПараметрыФорма) Экспорт 
	
	Если ТипЗнч(РезультатФорма)=Тип("Массив") Тогда
		
		Для каждого ОбъектНоменклатуры Из РезультатФорма  Цикл
			
			СтруктураНоменклатуры=ПолучитьСтруктуруОбъектНоменклатуры(ОбъектНоменклатуры);
			
			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура",СтруктураНоменклатуры.Номенклатура);
			СтруктураОтбора.Вставить("Характеристика",СтруктураНоменклатуры.Характеристика);
			СтруктураОтбора.Вставить("Серия",ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
			
			СтрокиСПустымиСериями=Объект.Выпуск.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаСПустйСерией Из СтрокиСПустымиСериями Цикл				
				Объект.Выпуск.Удалить(Объект.Товары.Индекс(СтрокаСПустйСерией));				
			КонецЦикла;
			//Если Объект.Выпуск.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
			НовыйТовар=Объект.Выпуск.Добавить(); 				 
			
			ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатуры);
			//НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
			//НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
			//НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");      
			
			
			
			//КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруОбъектНоменклатуры(Ссылка) //+Лико m.shenderov 24.10.2017
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Неопределено);
	Структура.Вставить("Характеристика",Неопределено);
	Структура.Вставить("Количество",Неопределено);
	Структура.Вставить("Серия",Неопределено);
	Структура.Вставить("Упаковка",Неопределено);
	Структура.Вставить("КоличествоУУ",Неопределено); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия,
	|	ЯССМ_ОбъектыНоменклатуры.Характеристика КАК Характеристика,
	|	ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	ЯССМ_ОбъектыНоменклатуры.Количество КАК Количество,
	|	ЯССМ_ОбъектыНоменклатуры.Количество * ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК КоличествоУУ
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.10.2017

&НаКлиенте
Процедура ТоварыСерияИмяКороткоеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.Товары.ТекущиеДанные.Серия,"ЯССМ_ОбъектНоменклатуры");
	
	Если ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Ключ",ОбъектНоменклатуры);
		ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъектНоменклатурыРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.Товары.ТекущиеДанные.Серия,"ЯССМ_ОбъектНоменклатуры");
	
	Если ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Ключ",ОбъектНоменклатуры);
		ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъектНоменклатурыОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.Товары.ТекущиеДанные.Серия,"ЯССМ_ОбъектНоменклатуры");
	
	Если ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Ключ",ОбъектНоменклатуры);
		ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Лико_СкладыКлиент.ПоказатьФормуОбъектаНоменклатуры(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка,"ТоварыСерияИмяКороткое");
	
	////Если Поле.Имя="ТоварыСерияИмяКороткое" Тогда
	////	СтандартнаяОбработка=Ложь;  		 
	////	ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.Товары.ТекущиеДанные.Серия,"ЯССМ_ОбъектНоменклатуры");
	////	
	////	Если ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
	////		
	////		Структура = Новый Структура;
	////		Структура.Вставить("Ключ",ОбъектНоменклатуры);
	////		ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	////	КонецЕсли; 		
	////КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпускВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Лико_СкладыКлиент.ПоказатьФормуОбъектаНоменклатуры(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка,"ВыпускСерия");
	
КонецПроцедуры


&НаКлиенте
Процедура РасчетКоличестваТаблицыТовары(ВозвратКоличества=Ложь,УУ=Ложь) //+Лико m.shenderov 24.12.2017
	Данные=Элементы.Товары.ТекущиеДанные;
	НомерСтроки=Строка(Элементы.Товары.ТекущаяСтрока);
	Если ВозвратКоличества Тогда 
		Если УУ Тогда 
			Данные.ВозвратКоличество	= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Данные.Серия,Данные.ВозвратКоличествоУУ,УУ);
		Иначе
			
		Данные.ВозвратКоличествоУУ		= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Данные.Серия,Данные.ВозвратКоличество);
		КонецЕсли;
		Данные.КоличествоРасход			= Данные.Количество		- Данные.ВозвратКоличество;
		Данные.КоличествоРасходУУ		= Данные.КоличествоУУ	- Данные.ВозвратКоличествоУУ;
	Иначе
		Если УУ Тогда
			Данные.КоличествоРасход		= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Данные.Серия,Данные.КоличествоРасходУУ,УУ); 			
		Иначе
			Данные.КоличествоРасходУУ		= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Данные.Серия,Данные.КоличествоРасход);
		КонецЕсли;
		Данные.ВозвратКоличество		= Макс(Данные.Количество		- Данные.КоличествоРасход,0);
		Данные.ВозвратКоличествоУУ		= Макс(Данные.КоличествоУУ	- Данные.КоличествоРасходУУ,0); 		
	КонецЕсли;
	Если  Данные.ВозвратКоличество<>0 Или Данные.КоличествоРасход<>0 Тогда
		Данные.Списать=Истина;
		//Начало изменений Иванова Анна 20181023
		
		Если ЗначениеЗаполнено(Данные.Номенклатура) И  ЗначениеЗаполнено(Объект.ЗаказПокупателя) ТОгда 
			ЗаполнитьВидРаботНаСервере(Данные.ПолучитьИдентификатор());	
		КонецЕсли;
		//Начало изменений Иванова Анна 20181023
		
	Иначе
		Данные.Списать=ЛОжь;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 24.12.2017

&НаКлиенте
Процедура ТоварыКоличествоРасходПриИзменении(Элемент)
	РасчетКоличестваТаблицыТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСписатьПриИзменении(Элемент)
	ИзминенияФлагаСписания();
КонецПроцедуры

&НаКлиенте
Процедура ИзминенияФлагаСписания() //+Лико m.shenderov 24.12.2017
	Данные=Элементы.Товары.ТекущиеДанные;
	
	Если Данные.Списать Тогда
		Если Данные.КоличествоРасход=0 И Данные.ВозвратКоличество=0 Тогда
			Данные.КоличествоРасход=Данные.Количество;
			РасчетКоличестваТаблицыТовары();
		КонецЕсли;
		//Начало изменений Иванова Анна 20181022
		
		
		Если ЗначениеЗаполнено(Объект.ЗаказПокупателя) И ЗначениеЗаполнено(Данные.Номенклатура) Тогда
			ЗаполнитьВидРаботНаСервере(Данные.ПолучитьИдентификатор());
		КонецЕсли;	
		//Конец изменений Иванова Анна 20181022
		
		//+ Лико m.shenderov 16.11.2018
		//Если НЕ ЗначениеЗаполнено(Данные.ВидРабот) Тогда
		//	Данные.ВидРабот = ТекущийВидРабот;
		//КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Данные.КлючСтрокиЗаказа) Тогда
		//	Данные.КлючСтрокиЗаказа = ТекущийИдентификаторВидаРаботы;
		//КонецЕсли;
		
		//- Лико m.shenderov 16.11.2018
		
	Иначе
		Данные.КоличествоРасход		=0;
		Данные.КоличествоРасходУУ	=0;
		Данные.ВозвратКоличество	=0;
		Данные.ВозвратКоличествоУУ	=0;	
		Данные.ВидРабот = Неопределено;
		Данные.КлючСтрокиЗаказа = Неопределено;
		Данные.НомерРаботы = Неопределено;
		Данные.ВидСекции=Неопределено;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 24.12.2017

//Начало изменений Иванова Анна 20181022
&НаСервере
Процедура ЗаполнитьВидРаботНаСервере(идентификатор)
	
	Если УчетПоВидуСекций Тогда 
		
		ЗаполнитьВидСекцииНаСервере(идентификатор); 
		
		Возврат;	
	КонецЕсли;
	 
		 
	
	стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	Ном = стр.Номенклатура;
	Если Ном.ВидНоменклатуры.Лико_РулонныйМатериал И стрНайти(Ном.Наименование, "Незавершенное производство")=0 Тогда 
		//ЗаполнитьВидыРабот();
		
		
		НайденныйВидРабот=Лико_Планирование.НайтиРаботуПоНоменклатуре(Объект.ЗаказПокупателя,Объект.НомерПроката,Ном);
		стр.видРабот = НайденныйВидРабот.ВидРабот;
		Стр.НомерРаботы=НайденныйВидРабот.НомерРаботы;
		
		НайденныйВидРабот=Документы.Лико_ПодготовкаМатериалов.ПолучитьВидРаботыИзРезерваМатериала(Объект.ЗаказПокупателя,Ном);
		
		ЕСли ЗначениеЗаполнено(НайденныйВидРабот.ВидРабот) Тогда
			стр.видРабот = НайденныйВидРабот.ВидРабот;
			Стр.НомерРаботы=НайденныйВидРабот.НомерРаботы;
			
		КонецЕсли; 	
			
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВидСекцииНаСервере(идентификатор)
	стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	Ном = стр.Номенклатура;
	Если Ном.ВидНоменклатуры.Лико_РулонныйМатериал И стрНайти(Ном.Наименование, "Незавершенное производство")=0 Тогда 
		//ЗаполнитьВидыРабот();
		
		
		НайденныйВидСекции=Лико_Планирование.НайтиВидСекцииПоНоменклатуре(Объект.ЗаказПокупателя,Объект.НомерПроката,Ном);
		стр.ВидСекции = НайденныйВидСекции.ВидСекции;
		Стр.НомерРаботы=НайденныйВидСекции.НомерРаботы;
		НайденныйВидСекции=Документы.Лико_ПодготовкаМатериалов.ПолучитьВидРаботыИзРезерваМатериала(Объект.ЗаказПокупателя,Ном);
		
		ЕСли ЗначениеЗаполнено(НайденныйВидСекции.ВидСекции) Тогда
			стр.ВидСекции = НайденныйВидСекции.ВидСекции;
			Стр.НомерРаботы=НайденныйВидСекции.НомерРаботы; 
		КонецЕсли;
		
			
	КонецЕсли;	
КонецПроцедуры

//Конец изменений Иванова Анна 20181022

&НаКлиенте
Процедура ТоварыКоличествоРасходУУПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.КорректировкаРасходаУУ=Истина;
	РасчетКоличестваТаблицыТовары(,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпускКоличествоУУПриИзменении(Элемент)
	Элементы.Выпуск.ТекущиеДанные.КорректировкаРасходаУУ=Истина;
	
КонецПроцедуры



&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийЗакрытияБланка.ЗакрытиеБланка") Тогда
		Элементы.ХозяйственнаяОперация.Видимость						=Ложь;
		Элементы.РежимЗакрытия.Видимость								=Истина;
		Объект.ХозяйственнаяОперация									=Неопределено;
		Элементы.ГруппаОрганизацияПодразделение.Видимость				=Истина;
		Элементы.ГруппаПериод.Видимость									=Истина;
		Элементы.ГруппаЗаказ.Видимость									=Истина;

		Элементы.ТоварыРабочийЦентр.Видимость							=Истина;
		Элементы.ТоварыСерияЯССМ_ОбъектНоменклатурыНомерБланка.Видимость=Истина;
		Элементы.ТоварыАдресХранения.Видимость							=Ложь;
		Элементы.ТоварыКоличество.Видимость								=Истина;
		Элементы.ТоварыВозвратКоличество.Видимость						=Истина;
		Элементы.ВыпускСоздатьРоликиВыпущеннойПродукции.Видимость		=Истина;
		Элементы.ВыпускРабочийЦентрПолучатель.Видимость					=Истина;
		Элементы.ВыпускАдресХранения.Видимость							=Ложь;

		Элементы.ТоварыЗагрузитьПоРабочемуЦентру.Видимость             =Истина;
		Элементы.ТоварыРасчитатьДлинуРолика.Видимость                  =Истина;
		Элементы.ТоварыУказатьСерии.Видимость                          =Ложь;
		Элементы.ТоварыПодборНоменклатуры.Видимость                    =ЛОжь;
		Элементы.ВыпускПодборНоменклатуры.Видимость                    =ЛОжь;


	ИначеЕсли Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка") Тогда
		Элементы.ХозяйственнаяОперация.Видимость=Истина;
		Элементы.РежимЗакрытия.Видимость=Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.ХозяйственнаяОперация) Тогда
			Объект.ХозяйственнаяОперация=ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РазборкаТоваров");

		КонецЕсли;
		Элементы.ГруппаОрганизацияПодразделение.Видимость=Ложь;
		Элементы.ГруппаПериод.Видимость=Ложь;
		Элементы.ГруппаЗаказ.Видимость=Ложь;

		Элементы.ТоварыРабочийЦентр.Видимость							=Ложь;
		Элементы.ТоварыСерияЯССМ_ОбъектНоменклатурыНомерБланка.Видимость=Ложь;
		Элементы.ТоварыАдресХранения.Видимость							=Истина;
		Элементы.ТоварыКоличество.Видимость								=Ложь;
		Элементы.ТоварыВозвратКоличество.Видимость						=Ложь;
		Элементы.ВыпускСоздатьРоликиВыпущеннойПродукции.Видимость		=Ложь;
		Элементы.ВыпускРабочийЦентрПолучатель.Видимость					=Ложь;
		Элементы.ВыпускАдресХранения.Видимость			                =Истина;

		Элементы.ТоварыЗагрузитьПоРабочемуЦентру.Видимость             =Ложь;
		Элементы.ТоварыРасчитатьДлинуРолика.Видимость                  =Ложь;
		Элементы.ТоварыУказатьСерии.Видимость                          =Истина;
		Элементы.ТоварыПодборНоменклатуры.Видимость                    =Истина;
		Элементы.ВыпускПодборНоменклатуры.Видимость                    =ЛОжь;

	КонецЕсли;

	УстановитьВидимостьПодбораНоменклатуры();
    УстановитьВидимостьПодписиДокумента(); 
	УстановитьВидимостьУчетПоСекции();
	//УстановитьВидимостьПеремотка();

КонецПроцедуры


   &НаКлиенте
   Процедура УстановитьВидимостьПодписиДокумента() //+Лико m.shenderov 25.07.2023
	   
	   Если ТребуетсяПодписьДокумента И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		   
		   Элементы.ГруппаПодписьДокумента.Видимость=Истина;
	   Иначе
		   Элементы.ГруппаПодписьДокумента.Видимость=Ложь; 	   
	   КонецЕсли; 	   
	   
   КонецПроцедуры //-Лико m.shenderov 25.07.2023
   
   
   
   &НаКлиенте
  Процедура УстановитьВидимостьУчетПоСекции() //+Лико m.shenderov 12.10.2023
	   
	   Если УчетПоВидуСекций Тогда 
		   
		   Элементы.ТоварыВидСекции.Видимость	=Истина;
		   Элементы.ТоварыВидСекции.Заголовок	="Вид работы";
		   Элементы.ТоварыВидРабот.Видимость	=Ложь;
		   
	   Иначе
		   
		   Элементы.ТоварыВидСекции.Видимость	=Ложь;
		   Элементы.ТоварыВидРабот.Видимость	=Истина; 
		   
	   КонецЕсли;
	   
	   Если РольДоступнаСервер("ПолныеПрава") Тогда
		   
		   Элементы.ТоварыВидСекции.Видимость	=Истина;
		   Элементы.ТоварыВидРабот.Заголовок	="Вид работы(старый)";
		   Элементы.ТоварыВидРабот.Видимость	=Истина;
		   
	   КонецЕсли;
	   
	   
	   
   КонецПроцедуры //-Лико m.shenderov 12.10.2023
   
      &НаКлиенте
  Процедура УстановитьВидимостьПеремотка() //+Лико m.shenderov 12.10.2023
	   
	   Элементы.ГруппаПеремотка.Видимость = Ложь;
	   
	  
	   Если РольДоступнаСервер("ПолныеПрава") Тогда
		   
		   Элементы.ГруппаПеремотка.Видимость	=Истина;
		   
	   Иначе
		   Если  ЗначениеЗаполнено(Объект.СтатусВыпуска) Тогда 
			   
			    Элементы.ГруппаПеремотка.Видимость = Истина;
				Элементы.СтатусВыпуска.Доступность = Ложь; 
				Элементы.СерияУпаковки.Доступность = Ложь;
				
			   
		   КонецЕсли;
		   
			   
		   
			   
	   КонецЕсли;
	   
	   
	   
   КонецПроцедуры //-Лико m.shenderov 12.10.2023

   
   
 &НаСервереБезКонтекста
 Функция РольДоступнаСервер (Роль) //+Лико m.shenderov 12.10.2023
	 
	 Возврат РольДоступна(Роль); 
	 
 КонецФункции  //-Лико m.shenderov 12.10.2023
 
 
 

&НаСервере
Процедура УстановитьВидимостьПодбораНоменклатуры()
	
	Если  РольДоступна("АдминистраторСистемы") Или РольДоступна("Лико_РедактированиеКоличестоУУ") Тогда 			
		Элементы.ТоварыПодборНоменклатуры.Видимость                    		=Истина;
		Элементы.ВыпускПодборНоменклатуры.Видимость                    		=Истина; 			
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 18.02.2018

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Объект.Товары.Очистить();
	Объект.Выпуск.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	ОткрытьПодборСерий("Товары");
КонецПроцедуры



&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Склад",Объект.Склад);
	Структура.Вставить("Помещение",Объект.Помещение);
	Структура.Вставить("Период",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	Структура.Вставить("ТолькоОстатки",Истина);
	
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 25.10.2017
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.СтраницаСырье Тогда
			Для каждого Товар Из РезультатФормы  Цикл
				ТекущаяСтрока = Товар;
				
				
				СтруктураНоменклатуры = Новый Структура;
				СтруктураНоменклатуры.Вставить("Номенклатура");
				СтруктураНоменклатуры.Вставить("Характеристика");
				СтруктураНоменклатуры.Вставить("Серия");
				
				ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
				Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
					НовыйТовар=Объект.Товары.Добавить(); 		
					ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);				
					НовыйТовар.АдресХранения=Товар.Ячейка;				
					НовыйТовар.Количество=Товар.КоличествоУпаковок;			
					НовыйТовар.КоличествоУУ=Товар.Количество;
					НовыйТовар.КоличествоРасход=Товар.КоличествоУпаковок;			
					НовыйТовар.КоличествоРасходУУ=Товар.Количество;					
				КонецЕсли;
				
				
			КонецЦикла;
		Иначе
			Для каждого Товар Из РезультатФормы  Цикл
				ТекущаяСтрока = Товар;
				
				
				СтруктураНоменклатуры = Новый Структура;
				СтруктураНоменклатуры.Вставить("Номенклатура");
				СтруктураНоменклатуры.Вставить("Характеристика");
				СтруктураНоменклатуры.Вставить("Серия");
				
				ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
				Если Объект.Выпуск.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
					НовыйТовар=Объект.Выпуск.Добавить(); 		
					ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);				
					//НовыйТовар.АдресХранения=Товар.Ячейка;				
					НовыйТовар.Количество=Товар.КоличествоУпаковок;			
					НовыйТовар.КоличествоУУ=Товар.Количество;
					//НовыйТовар.КоличествоРасход=Товар.КоличествоУпаковок;			
					//НовыйТовар.КоличествоРасходУУ=Товар.Количество;					
				КонецЕсли;
				
				
			КонецЦикла;
			
			
		КонецЕсли;
		
		
		
		
		
		
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 25.10.2017



&НаКлиенте
Процедура ОткрытьПодборСерий(ИмяТЧ, Текст = "", ТекущиеДанные = Неопределено)
	//НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные) ;
	
	//Если ТекущиеДанные=Неопределено Тогда
	
	Номенклатура=Элементы.Товары.ТекущиеДанные.Номенклатура;
	Характеристика=Элементы.Товары.ТекущиеДанные.Характеристика;
	//    Иначе
	//    Номенклатура=ТекущиеДанные.Номенклатура;
	//    Характеристика=ТекущиеДанные.Характеристика;  		 
	//КонецЕсли;
	
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Номенклатура);
	Структура.Вставить("Характеристика",Характеристика);
	Структура.Вставить("Склад",Объект.Склад);
	Структура.Вставить("ТолькоОстатки",Истина);
	
	
	ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ОткрытьПодборСерийЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 28.09.2017
	
	Если РезультатФормы<>Неопределено Тогда
		Счет=0;
		Для каждого Результат Из РезультатФормы Цикл
			
			ТекСтрока				=Элементы.Товары.ТекущиеДанные;			
			ТекСтрока.Серия			=Результат.Серия;
			Данныесерии				=ПолучитьДанныеПоСерии(Результат.Серия);
			ТекСтрока.Упаковка		=ДанныеСерии.Упаковка;
			ТекСтрока.АдресХранения	=Результат.АдресХранения;
			ТекСтрока.КоличествоРасход=Данныесерии.Количество;
			//ТекСтрока.СтатусУказанияСерий=8;
			ТекСтрока.КоличествоРасходУУ=Данныесерии.КоличествоУУ;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 28.09.2017


&НаСервереБезКонтекста
Функция ПолучитьДанныеПоСерии(Серия) //+Лико m.shenderov 28.09.2017
	
	//Серия=Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Если Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
		Количество= Серия.ЯССМ_ОбъектНоменклатуры.Количество;
	Иначе
		Количество=1
	КонецЕсли;
	
	
	Структура = Новый Структура;
	
	Структура.Вставить("Количество",Количество);
	Структура.Вставить("КоличествоУУ",Количество*Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);
	
	Структура.Вставить("Упаковка",Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);	
	Возврат Структура; 
	
	
КонецФункции  //-Лико m.shenderov 28.09.2017

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если  Объект.Проведен  Тогда
		//ЭтотОбъект.ТолькоПросмотр=Истина;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиДокумент.Доступность=Ложь;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьДокумент.Доступность=Ложь;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиИЗакрыть.Доступность=Ложь;
		//Иначе
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиДокумент.Доступность=Истина;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьДокумент.Доступность=Истина;
		//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиИЗакрыть.Доступность=Истина;
	КонецЕсли;
	ЗаполнитьНомерВидаРабот();	
КонецПроцедуры

&НаСервере
Процедура НомерЗаказаПриИзмененииНаСервере()
	Попытка
		
		Объект.ЗаказПокупателя=Лико_Дополнительно.НайтиДокументПоНомеру7Символов(Объект.НомерЗаказа,"ЗаказКлиента");
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	НомерЗаказаПриИзмененииНаСервере();
	ОчиститьВидыРабот();
	ЗаполнитьВидыРабот();
КонецПроцедуры


&НаСервере
Процедура РасчетКоличестваТаблицыТоварыСервер(Данные,ВозвратКоличества=Ложь) //+Лико m.shenderov 24.12.2017
	
	Если ВозвратКоличества Тогда
		Данные.ВозвратКоличествоУУ		= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Данные.Серия,Данные.ВозвратКоличество);
		Данные.КоличествоРасход			= Данные.Количество		- Данные.ВозвратКоличество;
		Данные.КоличествоРасходУУ		= Данные.КоличествоУУ	- Данные.ВозвратКоличествоУУ;
	Иначе
		Данные.КоличествоРасходУУ		= Лико_ОбщегоНазначенияСервер.КоличествоПоСерии(Данные.Серия,Данные.КоличествоРасход);
		Данные.ВозвратКоличество		= Макс(Данные.Количество		- Данные.КоличествоРасход,0);
		Данные.ВозвратКоличествоУУ		= Макс(Данные.КоличествоУУ	- Данные.КоличествоРасходУУ,0);
		
	КонецЕсли;
	Если  Данные.ВозвратКоличество<>0 Или Данные.КоличествоРасход<>0 Тогда
		Данные.Списать=Истина;
	Иначе
		Данные.Списать=ЛОжь;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 24.12.2017

//Начало изменений Иванова Анна 20181020
&НаКлиенте 
Процедура ТоварыВидРаботНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ЗаказПокупателя) Тогда 
		СтандартнаяОбработка = Ложь;
		СписокРабот = ПолучитьСписокРаботНаСервере(Объект.ЗаказПокупателя, Объект.НомерПроката); 
		СписокРабот2=ПолучитьСписокРаботПоПодготовкеМатериаловНаСервере(Объект.ЗаказПокупателя,Элементы.Товары.ТекущиеДанные.Номенклатура);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВидРаботВыборИзСпискаЗавершение", ЭтотОбъект); 		
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокРабот, Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРаботПоПодготовкеМатериаловНаСервере(ЗаказПокупателя,Номенклатура)
	
	Возврат Документы.Лико_ПодготовкаМатериалов.ПолучитьВидРаботыИзРезерваМатериала(ЗаказПокупателя,Номенклатура);
	
КонецФункции



&НаСервере
Функция ПолучитьСписокРаботНаСервере(Заказ, НомерПроката)
	ЗаполнитьВидыРабот();
	
	СП = Новый СписокЗначений;
	Для каждого СписокРабот Из ТЗВидыРабот Цикл
		Сп.Добавить(СписокРабот.Наименование); 
	КонецЦикла;
	
	Возврат СП;
КонецФункции


&НаСервере
Функция ПолучитьСписокСекцийНаСервере(Заказ, НомерПроката)
	ЗаполнитьВидыСекций();
	
	СП = Новый СписокЗначений;
	Для каждого СписокСекций Из ТЗВидыСекций Цикл
		Сп.Добавить(СписокСекций.Наименование); 
	КонецЦикла;
	
	Возврат СП;
КонецФункции



&НаКлиенте
Процедура ВидРаботВыборИзСпискаЗавершение(Знач ВыбранныйЭлемент, Параметры)Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		Текстр = Элементы.ТОвары.ТекущиеДанные;
		Структура = Новый Структура;
		Структура.Вставить("Наименование",ВыбранныйЭлемент.Значение);
		НайденныеСтроки=ТЗВидыРабот.НайтиСтроки(Структура);
		Текстр.видРабот= НайденныеСтроки[0].ВидРабот;	
		Попытка
			Текстр.КлючСтрокиЗаказа= Новый УникальныйИдентификатор(НайденныеСтроки[0].КлючСтроки);		
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
		Текстр.НомерРаботы=НайденныеСтроки[0].НомерРаботы;
		ЗаполнитьНомерВидаРабот();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСекцийВыборИзСпискаЗавершение(Знач ВыбранныйЭлемент, Параметры)Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		Текстр = Элементы.ТОвары.ТекущиеДанные;
		Структура = Новый Структура;
		Структура.Вставить("Наименование",ВыбранныйЭлемент.Значение);
		НайденныеСтроки=ТЗВидыСекций.НайтиСтроки(Структура);
		Текстр.ВидСекции= НайденныеСтроки[0].ВидСекции;	
		Текстр.НомерРаботы=НайденныеСтроки[0].НомерРаботы;
		//ЗаполнитьНомерВидаРабот();
	КонецЕсли;	
	
КонецПроцедуры




#Область ВидыРабот


&НаСервере
Процедура ЗаполнитьВидыРабот()
	ТЗВидыРабот.Очистить();	
	
	НайденныеСтроки = Объект.ЗаказПокупателя.ВидыРабот.НайтиСтроки(Новый Структура("НомерПроката", Объект.НомерПроката)); 	
	
	НомерПоПорядку=0;
	Для каждого Строка из НайденныеСтроки Цикл		
		Если Строка.ВидРабот.Лико_Материал Или Строка.ВидРабот.Лико_Клей Или Строка.ВидРабот=Справочники.ВидыРаботСотрудников.Печать Тогда
			НомерПоПорядку=НомерПоПорядку+1;
			НоавяСтрокаТЗ=ТЗВидыРабот.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоавяСтрокаТЗ, Строка);
			НоавяСтрокаТЗ.Наименование=  ?(ЗначениеЗаполнено(Строка.НомерРаботы), " (" + Строка(Строка.НомерРаботы) + ")","")+Строка(Строка.ВидРабот);
			//НоавяСтрокаТЗ.НомерВидаРабот=НомерПоПорядку;
		КонецЕсли;
	КонецЦикла;

	Элементы.ТекущийИдентификаторВидаРаботы.СписокВыбора.Очистить();
	ТекущийИдентификаторВидаРаботы = "";
	ТекущийВидРабот = Неопределено;
	
	Если ТЗВидыРабот.Количество() = 0 Тогда
		НоавяСтрокаТЗ=ТЗВидыРабот.Добавить(); 
		НоавяСтрокаТЗ.ВидРабот=Справочники.ВидыРаботСотрудников.Печать;
		НоавяСтрокаТЗ.НомерРаботы=1;
		НоавяСтрокаТЗ.Наименование=  "(1)Печать";

		Возврат;
	КонецЕсли;
	
	ТЗВидыРабот.Сортировать("НомерСтроки");

	Элементы.ТекущийИдентификаторВидаРаботы.СписокВыбора.Очистить();
	МассивДобавленныхВидовРабот = Новый Массив;
	НомерПоПорядку=0;
	Для каждого Строка из ТЗВидыРабот Цикл
		НомерПоПорядку=НомерПоПорядку+1;
		//Элементы.ТекущийИдентификаторВидаРаботы.СписокВыбора.Добавить(Строка.КлючСтроки, Строка(Строка.ВидРабот) +  " (" + Строка(НомерПоПорядку) + ")", ""));

		Элементы.ТекущийИдентификаторВидаРаботы.СписокВыбора.Добавить(Строка.КлючСтроки, Строка(Строка.ВидРабот) + ?(ЗначениеЗаполнено(Строка.Оснастка), " (" + Строка.Оснастка.Артикул + ")", ""));
	КонецЦикла;
	ТекущийИдентификаторВидаРаботы = ТЗВидыРабот[0].КлючСтроки;
	ТекущийВидРабот = ТЗВидыРабот[0].ВидРабот;

	ЗаполнитьНомерВидаРабот();

	Структура = Новый Структура;
	Структура.Вставить("ВидРабот",Справочники.ВидыРаботСотрудников.Печать);



	Если Не ЗначениеЗаполнено(ТЗВидыРабот.НайтиСтроки(Структура))  Тогда
		НомерПоПорядку=НомерПоПорядку+1;
		НоавяСтрокаТЗ=ТЗВидыРабот.Добавить(); 
		НоавяСтрокаТЗ.ВидРабот=Справочники.ВидыРаботСотрудников.Печать;
		НоавяСтрокаТЗ.НомерРаботы=1;
		НоавяСтрокаТЗ.Наименование=  "(1)Печать";
	КонецЕсли




КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыСекций()
	
	ТЗВидыСекций.Очистить();	
	
	НайденныеСтроки =Документы.Лико_ПодготовкаМатериалов.ПолучитьВидыСекцийИзЗаказа(Объект.ЗаказПокупателя,Объект.НомерПроката); 	
	
	НомерПоПорядку=0;
	Для каждого Строка из НайденныеСтроки Цикл		
		//Если Строка.ВидРабот.Лико_Материал Или Строка.ВидРабот.Лико_Клей Или Строка.ВидРабот=Справочники.ВидыРаботСотрудников.Печать Тогда
		НомерПоПорядку=НомерПоПорядку+1;
		НоавяСтрокаТЗ=ТЗВидыСекций.Добавить(); 
		//ЗаполнитьЗначенияСвойств(НоавяСтрокаТЗ, Строка); 
		НоавяСтрокаТЗ.НомерРаботы=Строка.НомерРаботы;
		НоавяСтрокаТЗ.ВидСекции=Строка.ВидСекции;
		НоавяСтрокаТЗ.Наименование=  ?(ЗначениеЗаполнено(Строка.НомерРаботы), " (" + Строка(Строка.НомерРаботы) + ")","")+Строка(Строка.ВидСекции);
			//НоавяСтрокаТЗ.НомерВидаРабот=НомерПоПорядку;
		//КонецЕсли;
	КонецЦикла;

	Элементы.ТекущийИдентификаторВидаРаботы.СписокВыбора.Очистить();
	ТекущийИдентификаторВидаРаботы = "";
	ТекущийВидРабот = Неопределено;
	Если ТЗВидыСекций.Количество() = 0 Тогда
		//НоавяСтрокаТЗ=ТЗВидыСекций.Добавить(); 
		//НоавяСтрокаТЗ.ВидСекции=Справочники.Лико_ВидыСекций.Печать;
		//НоавяСтрокаТЗ.НомерРаботы=1;
		//НоавяСтрокаТЗ.Наименование=  "(1)Печать";

		Возврат;
	КонецЕсли;
	
	ТЗВидыСекций.Сортировать("НомерСтроки");

	Элементы.ТекущийИдентификаторВидаРаботы.СписокВыбора.Очистить();
	МассивДобавленныхВидовРабот = Новый Массив;
	НомерПоПорядку=0;
	
	Структура = Новый Структура;
	Структура.Вставить("ВидСекции",Справочники.Лико_ВидыСекций.Печать);



	//Если Не ЗначениеЗаполнено(ТЗВидыСекций.НайтиСтроки(Структура))  Тогда
	//	НомерПоПорядку=НомерПоПорядку+1;
	//	НоавяСтрокаТЗ=ТЗВидыСекций.Добавить(); 
	//	НоавяСтрокаТЗ.ВидСекции=Справочники.Лико_ВидыСекций.Печать;
	//	НоавяСтрокаТЗ.НомерРаботы=1;
	//	НоавяСтрокаТЗ.Наименование=  "(1)Печать";
	//КонецЕсли




КонецПроцедуры




&НаКлиенте
Процедура ТекущийИдентификаторВидаРаботыПриИзменении(Элемент)
	УстановитьФильтрПоВидуРаботы();
КонецПроцедуры


&НаСервере 
Процедура УстановитьФильтрПоВидуРаботы()
	
	Если ЗначениеЗаполнено(ТекущийИдентификаторВидаРаботы) Тогда
		ТекущийВидРабот = ТЗВидыРабот.НайтиСтроки(Новый Структура("КлючСтроки", ТекущийИдентификаторВидаРаботы))[0].ВидРабот;
	Иначе
		ТекущийВидРабот = Неопределено;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьНомерВидаРабот() //+Лико m.shenderov 19.11.2018
	
	Возврат;
	
	Для каждого Товар Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Товар.КлючСтрокиЗаказа) Тогда
			Структура = Новый Структура;
			Структура.Вставить("КлючСтроки",Строка(Товар.КлючСтрокиЗаказа));
			НайденныеСтроки=ТЗВидыРабот.НайтиСтроки(Структура);
			Если НайденныеСтроки.Количество()>0  Тогда
				Товар.НомерВидаРабот=НайденныеСтроки[0].НомерВидаРабот;
				
			КонецЕсли;
		Иначе
			Товар.НомерВидаРабот=Неопределено;
		КонецЕсли;		
	КонецЦикла;
	
	
КонецПроцедуры  //-Лико m.shenderov 19.11.2018

&НаСервере
Процедура ТоварыПриОкончанииРедактированияНаСервере()
	ЗаполнитьНомерВидаРабот();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элемент.ТекущийЭлемент.Имя="ТоварыВозвратКоличество" Тогда
		Данные=Элементы.Товары.ТекущиеДанные;
		НомерСтроки=Строка(Элементы.Товары.ТекущаяСтрока);
		
		Если Данные.Количество<Данные.ВозвратКоличество Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Возврат больше исходного значения!";
			Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].ВозвратКоличество"; //имя реквизита 
			Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
			Сообщение.Сообщить();
			ОтменаРедактирования=Истина;
			Возврат;			
		КонецЕсли;
	КонецЕсли; 
	ТоварыПриОкончанииРедактированияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьВидыРабот()
	РаспределяемыеМатериалы();
	
КонецПроцедуры




&НаКлиенте
Процедура НомерПрокатаПриИзменении(Элемент)
	ОчиститьВидыРабот();
	ЗаполнитьВидыРабот();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНомерРаботыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КоличествоРабот = ПолучитьКоличествоРаботНаСервере(Элементы.Товары.ТекущиеДанные.Номенклатура);
	//+Заглушка для Икс-Пак.
	ОрганизацияИксПак=ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ОрганизацияИксПак");
	Если Объект.Организация=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОрганизацияИксПак,"ЗначениеПараметра") Тогда
		КоличествоРабот=5;
	КонецЕсли;
	//-Заглушка для Икс-Пак.
	
	
	КоличествоРаботСписокЗначений= Новый СписокЗначений;
	Если ЗначениеЗаполнено(КоличествоРабот) ТОгда
		Для Ном=1 По КоличествоРабот Цикл
			
			КоличествоРаботСписокЗначений.Добавить(Ном);
			
		КонецЦикла;
		
	КонецЕсли;
	
	//			
	ОписаниеОповещения = Новый ОписаниеОповещения("КоличествоРаботВыборИзСпискаЗавершение", ЭтотОбъект);
	//	
	ПоказатьВыборИзСписка(ОписаниеОповещения, КоличествоРаботСписокЗначений, Элемент);
	//КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Функция ПолучитьКоличествоРаботНаСервере(Ном) //+Лико m.shenderov 21.11.2018  
	НайденныйВидРабот=Лико_Планирование.НайтиРаботуПоНоменклатуре(Объект.ЗаказПокупателя,Объект.НомерПроката,Ном);
	Возврат НайденныйВидРабот.КоличествоРабот;
КонецФункции  //-Лико m.shenderov 21.11.2018



&НаКлиенте
Процедура КоличествоРаботВыборИзСпискаЗавершение(Знач ВыбранныйЭлемент, Параметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		Текстр = Элементы.ТОвары.ТекущиеДанные;
		
		Текстр.НомерРаботы=ВыбранныйЭлемент.Значение;
		
	КонецЕсли;	
КонецПроцедуры	


&НаСервере
Процедура РаспределяемыеМатериалы251019() //+Лико m.shenderov 30.11.2018
	Правила=Справочники.Лико_НастройкиУчетаПроизводственныхЗатрат.РаспределяемыеМатериалы(ОБъект.Организация,Объект.РабочийЦентр,Объект.Дата);
	Объект.РаспределяемыеМатериалы.Очистить();
	
	Если Правила.Количество()=0 Тогда		
		Объект.ЕстьРаспределяемыйМатериал=Ложь;
		Элементы.СтраницаРаспределяемыеМатериалы.Видимость=Ложь;
		
	Иначе
		
		
		Элементы.СтраницаРаспределяемыеМатериалы.Видимость=Истина;
		
		Если Не Объект.Проведен  Тогда	
			Объект.ЕстьРаспределяемыйМатериал=Истина;
			
			Для каждого Правило Из Правила Цикл
				
				Структура = Новый Структура;
				Структура.Вставить("Правило",Правило);
				Если Объект.РаспределяемыеМатериалы.НайтиСтроки(Структура).Количество()=0 Тогда 			
					НоваяСтрока=Объект.РаспределяемыеМатериалы.Добавить();
					НоваяСтрока.Правило=Правило;
				КонецЕсли;	
				
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  //-Лико m.shenderov 30.11.2018

&НаСервере
Процедура РаспределяемыеМатериалы()
	Правила=Справочники.Лико_НастройкиУчетаПроизводственныхЗатрат.РаспределяемыеМатериалы(ОБъект.Организация,Объект.РабочийЦентр,Объект.Дата);
	

	Если Правила.Количество()=0 Тогда		
		Объект.ЕстьРаспределяемыйМатериал=Ложь;
		Элементы.СтраницаРаспределяемыеМатериалы.Видимость=Ложь;
		 Объект.РаспределяемыеМатериалы.Очистить();

	Иначе
		
		
		Элементы.СтраницаРаспределяемыеМатериалы.Видимость=Истина;
		
		Если Не Объект.Проведен  Тогда	
			Объект.ЕстьРаспределяемыйМатериал=Истина;
			
			Для каждого Правило Из Правила Цикл
				
				Структура = Новый Структура;
				Структура.Вставить("Правило",Правило);
				Если Объект.РаспределяемыеМатериалы.НайтиСтроки(Структура).Количество()=0 Тогда 			
					НоваяСтрока=Объект.РаспределяемыеМатериалы.Добавить();
					НоваяСтрока.Правило=Правило;
				КонецЕсли;	
				
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура РаспределяемыеМатериалыПравилоНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Список = ПолучитьСписокПравилНаСервере(Элементы.РаспределяемыеМатериалы.ТекущиеДанные.Правило); 		
	Если ЗначениеЗаполнено(Список) Тогда	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПравилаВыборИзСпискаЗавершение", ЭтаФорма); 	
		
		ПоказатьВыборИзСписка(ОписаниеОповещения, Список, Элемент);
	Иначе
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Объект.ЗаказПокупателя);
		Структура.Вставить("НомерПроката",Объект.НомерПроката);
		
		ОписаниеОповещение= Новый ОписаниеОповещения("ОткрытиеФормыДокументаЦветаРаботыЗавершение",ЭтаФорма);
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокументаЦветаРаботы",Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФормыДокументаЦветаРаботыЗавершение(прРезультьат,прПараметры) Экспорт //+Лико m.shenderov 12.10.2019
	Элементы.РаспределяемыеМатериалы.ТекущиеДанные.ПравилоНаименование=прРезультьат;
	
КонецПроцедуры //-Лико m.shenderov 12.10.2019



&НаСервере
Функция ПолучитьСписокПравилНаСервере(Правило) //+Лико m.shenderov 30.11.2018  
	СписокЗначение= Новый СписокЗначений;	
	Для каждого Товар Из Правило.Товары Цикл
		СписокЗначение.Добавить(Товар.Номенклатура,Товар.Представление);
	КонецЦикла;
	Возврат СписокЗначение;
КонецФункции  //-Лико m.shenderov 30.11.2018

&НаКлиенте
Процедура ПравилаВыборИзСпискаЗавершение(Результат,РезультатПрараметры) Экспорт //+Лико m.shenderov 30.11.2018
	Если Результат <> Неопределено Тогда    
		текСтрока = Элементы.РаспределяемыеМатериалы.ТекущиеДанные;
		текСтрока.Номенклатура=Результат.Значение;
		текСтрока.ПравилоНаименование=Результат.Представление;
		//Структура = Новый Структура;
		//Структура.Вставить("Наименование",Результат.Значение);
		//НайденныеСтроки=ТЗВидыРабот.НайтиСтроки(Структура);
		//Текстр.видРабот= НайденныеСтроки[0].ВидРабот;	
		//Текстр.КлючСтрокиЗаказа= Новый УникальныйИдентификатор(НайденныеСтроки[0].КлючСтроки);	
		//Текстр.НомерРаботы=НайденныеСтроки[0].НомерРаботы;
		//ЗаполнитьНомерВидаРабот();
	КонецЕсли;	
	
КонецПроцедуры //-Лико m.shenderov 30.11.2018







&НаСервере
Процедура ЗаполнитьТаблицуТиповыеДокументы() //+Лико m.shenderov 21.08.2018
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Распоряжение",Объект.Распоряжение);
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Распоряжение2",Объект.РаспоряжениеНаОтгрузку);
	
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка",Объект.Ссылка);
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("ПоказыватьДокумент",ЗначениеЗаполнено(Объект.Ссылка));
	
КонецПроцедуры  //-Лико m.shenderov 21.08.2018

&НаКлиенте
Процедура СписокТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьТиповыеДокументы(Команда)
	ЗаполнитьТаблицуТиповыеДокументы();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыВозвратКоличествоИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура РаспределяемыеМатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	Если ЭтотОбъект.ТолькоПросмотр=Истина Тогда		
		Если Поле.Имя="РаспределяемыеМатериалыПравилоНаименование"  Тогда			
			Список = ПолучитьСписокПравилНаСервере(Элементы.РаспределяемыеМатериалы.ТекущиеДанные.Правило); 		
			Если НЕ ЗначениеЗаполнено(Список) Тогда	
				Структура = Новый Структура;
				Структура.Вставить("Ключ",Объект.ЗаказПокупателя);
				Структура.Вставить("НомерПроката",Объект.НомерПроката);
				ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокументаЦветаРаботы",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;			
		КонецЕсли; 		
	КонецЕсли;	


КонецПроцедуры

&НаСервере
Процедура УстановитьПодразделение() //+Лико m.shenderov 30.08.2021
	
	УстановитьПривилегированныйРежим(Истина);
	
	Подразделение=Объект.РабочийЦентр.Лико_Площадка.ПодразделениеПроизводство;
	
	Если     ЗначениеЗаполнено(Подразделение) Тогда
		Объект.Подразделение=Подразделение;
	КонецЕсли;
	
КонецПроцедуры  //-Лико m.shenderov 30.08.2021



#Область ПодписьДокумента  

&НаКлиенте
Процедура ПодписьДокументаУспех(Результат) //+Лико m.shenderov 20.07.2023
	
	
	Объект.ПодписьДокументаСотрудником=Результат.СчитанноеЗначение;
	
КонецПроцедуры //-Лико m.shenderov 20.07.2023



             
&НаКлиенте
Процедура ПодписьДокумента(Команда)
		
ПолучитьПодпись();	

КонецПроцедуры 

&НаКлиенте
Функция ПолучитьПодпись() //+Лико m.shenderov 20.07.2023
	ДопПараметры = Новый Структура;

	//ДопПараметры.Вставить("ИмяПроцедурыПриУспешномПодтверждении", "ПодписьДокументаЗавершение(ДопПараметры)");
	ДопПараметры.Вставить("Должности", "ДолжностьНачальникСменыУПО,ДолжностьНачальникОтделаПослепечатнойОбработки");
	ОписаниеОповещенияПриЗакрытииДругойФормы = Новый ОписаниеОповещения("РезультатЧтенияПропускаОтвЛица", ЭтотОбъект, ДопПараметры);
	ТСОтладка = Ложь;
	ПараметрыОткрытияДругойФормы = Новый Структура("ТекстЗаголовка,ТСОтладка,ИмяЗначения", "Считайте пропуск", ТСОтладка, "Сотрудник");
	ПараметрыКоманды = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнейОбработки(,, "ТСРабочийСтолЕРП");
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ПараметрыКоманды.Ссылка);
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаЗапросаЧтенияШтрихкода", ПараметрыОткрытияДругойФормы, ЭтаФорма,,,,ОписаниеОповещенияПриЗакрытииДругойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецФункции  //-Лико m.shenderov 20.07.2023

&НаКлиенте
Процедура РезультатЧтенияПропускаОтвЛица(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Ошибка)
		ИЛИ НЕ ЗначениеЗаполнено(Результат.СчитанноеЗначение)
		ИЛИ ТипЗнч(Результат.СчитанноеЗначение) <> Тип("СправочникСсылка.ФизическиеЛица")
		Тогда
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			Сообщить(Результат.Ошибка);
		Иначе
			Сообщить("Пропуск не был считан");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	
	НомерТелефона = "";
	ЗапрашиватьСМС = Ложь;
	Должности = "";
	ДопПараметры.Свойство("Должности", Должности);
	Если ФизЛицоОбладаетПравамиНачальникаСмены(Результат.СчитанноеЗначение, НомерТелефона, ЗапрашиватьСМС, Должности) Тогда
		ЗапрашиватьСМС = Ложь; // для упаковки поставим принудительно
		ДопПараметры.Вставить("ФизЛицоПодтверждения", Результат.СчитанноеЗначение);
		ДопПараметры.Вставить("СчитанПропускБригадира");
		Если ЗапрашиватьСМС Тогда
			// Потребуем подтверждение пропуска по смс
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				Сообщить("У физ лица " + Результат.СчитанноеЗначение + " не заполнен номер телефона, подтверждение невозможно");
				Возврат;
			КонецЕсли;
			
			// Сформируем код подверждения через генератор случайных чисел
			КодПотверждения = ОтправитьКодПодтвержденияПоСмс(НомерТелефона);
			
			// Запросим код подтверждения
			ДопПараметры.Вставить("КодПодтверждения", КодПотверждения);
			ОписаниеОповещенияПослеВводаВозврата = Новый ОписаниеОповещения("ВведенКодПодтвержденияДляПодтвержденияПропускаОтвЛица", ЭтотОбъект, ДопПараметры);
			//ПараметрыДляКлавиатуры = Новый Структура("НабираемыйТекст,ТекстЗаголовка", "", "Введите код из смс на номер " + НомерТелефона);
			//ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатураЦифровая", ПараметрыДляКлавиатуры,,,,, ОписаниеОповещенияПослеВводаВозврата, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  
			ПоказатьВводСтроки(ОписаниеОповещенияПослеВводаВозврата, "", "Введите код из смс на номер " + НомерТелефона, 4, Ложь);
		Иначе	
			// СМС не нужны, считаем проверку пройденной
			//Выполнить("" + ДопПараметры.ИмяПроцедурыПриУспешномПодтверждении); 
			ПодписьДокументаУспех(Результат);
		КонецЕсли;
		
	Иначе
		Сообщить("Считан пропуск сотрудника, не обладающего требуемыми правами");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФизЛицоОбладаетПравамиНачальникаСмены(ФизЛицо, НомерТелефона = "", ЗапрашиватьСМС = Ложь, СтрокаДолжностей = "")
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ТСРабочийСтолЕРП");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("Не найдена дополнительная обработка с именем объекта ТСРабочийСтолЕРП");
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
	
	Организация=Объект.Организация;
	
	Результат = ФизЛицоОбладаетПравамиНачальникаСменыСервер(ФизЛицо, Организация, НомерТелефона, ЗапрашиватьСМС, СтрокаДолжностей,Истина);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции 

&НаСервере
Функция ФизЛицоОбладаетПравамиНачальникаСменыСервер(ФизЛицо, Организация, НомерТелефона = "", ЗапрашиватьСМС = Ложь, СтрокаДолжностей = "",НеПроверятьБезОрганизации=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МассивДолжностей = Новый Массив;
	Если НЕ ЗначениеЗаполнено(СтрокаДолжностей) Тогда
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьНачальникПроизводства.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьНачальникСмены.ЗначениеПараметра);
		//МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьМенеджерПоПланированиюПроизводства.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьТехнолог.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьЗамГлТехнолога.ЗначениеПараметра);
		МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения.ДолжностьНачальникЦУ.ЗначениеПараметра);
	Иначе
		МассивДолжностейСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДолжностей, ",");
		Для каждого ДолжностьСтрока из МассивДолжностейСтрок Цикл
			Если   ДолжностьСтрока="ДолжностьКладовщик" Тогда
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик 3 категории"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик 2 категории"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Кладовщик 1 категории"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Начальник складского комплекса"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Менеджер по планированию производства"));
				МассивДолжностей.Добавить(Справочники.Должности.НайтиПоНаименованию("Диспетчер склада"));

			Иначе
				МассивДолжностей.Добавить(Справочники.Лико_ПредопределенныеЗначения[ДолжностьСтрока].ЗначениеПараметра); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДолжностьФизЛица = Лико_Дополнительно.НайтиДолжностьФизЛица(ФизЛицо, Организация, ТекущаяДата(),НеПроверятьБезОрганизации);
	
	Если МассивДолжностей.Найти(ДолжностьФизЛица) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		// найдем номер телефона
		НомерТелефона = Лико_Дополнительно.НайтиСотовыйНомерФизЛица(ФизЛицо);
		ЗапрашиватьСМС = ПараметрыСеанса.Лико_РабочееМесто.ТСПодтверждениеСчитыванияПропускаБригадираПоСмс;
		
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ОтправитьКодПодтвержденияПоСмс(НомерТелефона)
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ТСРабочийСтолЕРП");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("Не найдена дополнительная обработка с именем объекта ТСРабочийСтолЕРП");
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);

	Результат =  ВнешняяОбработка.ОтправитьКодПодтвержденияПоСмс(НомерТелефона, Объект.РабочееМесто);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции


&НаКлиенте
Процедура ПодписьДокументаЗавершение(ДопПараметры) Экспорт
	ДанОтветНаВопрос = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВведенКодПодтвержденияДляПодтвержденияПропускаОтвЛица(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Результат) Тогда
		//ИнформационныеСообщения = "Не введен код подтверждения из смс";
		//ОбновилосьИнформационноеСообщение = Истина;
		//ПомигатьСообщением();
		Возврат;
	КонецЕсли;
	
	ВведенныйКод = Формат(Результат, "ЧЦ=4; ЧВН=; ЧГ=0");
	
	ТекущаяДата = ТекущаяДатаСеансаСервер();
	
	// на всякий случай будем генерить код на сегодня
	КодНаСегодня = Прав(Формат(День(ТекущаяДата) * Месяц(ТекущаяДата) * Год(ТекущаяДата) - День(ТекущаяДата) - Месяц(ТекущаяДата) - Год(ТекущаяДата), "ЧЦ=10; ЧВН=; ЧГ=0"), 4);
	
	Если ВведенныйКод <> ДопПараметры.КодПодтверждения И ВведенныйКод <> КодНаСегодня Тогда
		//ИнформационныеСообщения = "Код подтверждения не совпал: вы ввели " + ВведенныйКод + ", был отправлен " + ДопПараметры.КодПодтверждения;
		//ОбновилосьИнформационноеСообщение = Истина;
		//ПомигатьСообщением();
		Возврат;
	КонецЕсли;
	
	// Если дошло до сюда, значит все проверки пройдены, вызовем нужную процедуру, имя которой сохранено в ДопПараметры
	Выполнить("" + ДопПараметры.ИмяПроцедурыПриУспешномПодтверждении);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ТекущаяДатаСеансаСервер() //+Лико m.shenderov 20.07.2023
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции  //-Лико m.shenderov 20.07.2023
#КонецОбласти





// Подсистема WebSocket
&НаКлиенте
Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);	
КонецПроцедуры  

&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;   
КонецПроцедуры 



&НаКлиенте
Процедура QrМобильныйСканер(Команда)//+Лико m.shenderov 13.12.2021
	
	ОткрытьФорму("ОбщаяФорма.Лико_QR_code",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-Лико m.shenderov 13.12.2021

&НаКлиенте
Процедура ТоварыВидСекцииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ЗаказПокупателя) Тогда 
		СтандартнаяОбработка = Ложь;
		СписокСекций = ПолучитьСписокСекцийНаСервере(Объект.ЗаказПокупателя, Объект.НомерПроката); 
		//СписокСекций2=ПолучитьСписокРаботПоПодготовкеМатериаловНаСервере(Объект.ЗаказПокупателя,Элементы.Товары.ТекущиеДанные.Номенклатура);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВидСекцийВыборИзСпискаЗавершение", ЭтотОбъект); 		
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокСекций, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВозвратКоличествоУУПриИзменении(Элемент)
		РасчетКоличестваТаблицыТовары(Истина,Истина)
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


// Подсистема WebSocket

