
&НаСервере
&Вместо("ЗаполнитьЗатратыНаСервере")
Процедура Лико_ЗаполнитьЗатратыНаСервере()
	Объект.Затраты.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
    "ВЫБРАТЬ
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ПОМЕСТИТЬ ВТИсключений
	|ИЗ
	|	Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка
	|ИЗ
	|	Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьБезНДСРасход + СебестоимостьТоваровОбороты.ДопРасходыБезНДСРасход) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов > 0
	|				ТОГДА СебестоимостьТоваровОбороты.КоличествоРасход / СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|			ИНАЧЕ СебестоимостьТоваровОбороты.КоличествоРасход
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ ВТСклад
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Площадка
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа.Лико_РасчетКакОсновнойКраски
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВТИсключений.ЦеноваяГруппа КАК ЦеноваяГруппа
	|						ИЗ
	|							ВТИсключений КАК ВТИсключений)
	|				И АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.ГП)) КАК СебестоимостьТоваровОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|		ПО СебестоимостьТоваровОбороты.Регистратор = Лико_ПередачаТоваров.Распоряжение
	|			И (Лико_ПередачаТоваров.БракМатериала = ИСТИНА)
	|ГДЕ
	|	(СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров)
	|	И ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|				ТОГДА СебестоимостьТоваровОбороты.Регистратор.СкладПолучатель.ЦеховаяКладовая
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Лико_ПередачаТоваров.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров
	|				ТОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура <> СебестоимостьТоваровОбороты.Регистратор.Номенклатура
	|						И НЕ СебестоимостьТоваровОбороты.Регистратор.Лико_Документ ССЫЛКА Документ.ЛикоРаспределениеРасходовПоЭтапам
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСклад.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВТСклад.Стоимость КАК Стоимость,
	|	ВТСклад.Количество КАК Количество,
	|	ВТСклад.Стоимость / ВТСклад.Количество КАК ЦенаФакт
	|ПОМЕСТИТЬ ВТФакт
	|ИЗ
	|	ВТСклад КАК ВТСклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТФакт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВТФакт.Стоимость КАК Стоимость,
	|	ВТФакт.Количество КАК Количество,
	|	ВТФакт.ЦенаФакт КАК ЦенаФакт,
	|	СУММА(ЕСТЬNULL(Лико_ЗатратыПоЗаказуОбороты.КоличествоПланОборот, 0)) КАК КоличествоПлан
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТФакт КАК ВТФакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				,
	|				ЗаказКлиента.Площадка.Организация = &Площадка
	|					И НЕ ДавальческоеСырье) КАК Лико_ЗатратыПоЗаказуОбороты
	|		ПО (ВТФакт.ЦеноваяГруппа = Лико_ЗатратыПоЗаказуОбороты.Затрата
	|				ИЛИ ВТФакт.ЦеноваяГруппа = Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТФакт.ЦенаФакт,
	|	ВТФакт.Стоимость,
	|	ВТФакт.Количество,
	|	ВТФакт.ЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.ЦеноваяГруппа.Код КАК КодЦг,
	|	ВТРасчет.ЦеноваяГруппа КАК Затрата,
	|	ВТРасчет.Стоимость КАК Стоимость,
	|	ВТРасчет.Количество КАК Количество,
	|	ЕСТЬNULL(ВТРасчет.КоличествоПлан, 0) КАК КоличествоПлан,
	|	ВТРасчет.ЦенаФакт КАК ЦенаФакт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТРасчет.КоличествоПлан, 0) > 0
	|			ТОГДА ВТРасчет.Стоимость / ВТРасчет.КоличествоПлан
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаТабашФакт
	|ИЗ
	|	ВТРасчет КАК ВТРасчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодЦг";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Площадка", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = Объект.Затраты.добавить();
		заполнитьзначенияСвойств(стр, выборка);
	КонецЦикла;

КонецПроцедуры
