
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Выбрать(Неопределено, Истина);
	//СтруктураВозврата = Новый Структура("Характеристика,Намотка,НомерПоставки,КодЭтикеткиЗаказчика,Город,Количество");
	//ЗаполнитьЗначенияСвойств(СтруктураВозврата, ТекущаяСтрока);
	//ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимВыбора = "";
	Параметры.Свойство("РежимВыбора", РежимВыбора);
	Если НЕ ЗначениеЗаполнено(РежимВыбора) Тогда
		РежимВыбора = "Одиночный";
	КонецЕсли;
	Если РежимВыбора = "Одиночный" Тогда
		Элементы.ТоварыОтметка.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Заказ") Тогда
		Заказ = Параметры.Заказ;
		Заголовок = Заголовок + " № " + Заказ.НомерБезПрефикса;
		Для каждого Строка из Заказ.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.НомерПоставки = Строка.NКонтракта;
			НоваяСтрока.Намотка = Строка.Направление;
		КонецЦикла; 
	ИначеЕсли Параметры.Свойство("Товары") Тогда
		Заголовок = "Выберите позицию";
		Для каждого Строка из Параметры.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда, ВыборСтроки = Ложь)
	
	Если Элементы.ТоварыОтметка.Видимость Тогда
		МассивОтмеченныхСтрок = ПодготовитьМассивСтрок(ВыборСтроки, ?(ВыборСтроки, Элементы.Товары.ТекущаяСтрока, Неопределено));
		Если МассивОтмеченныхСтрок.Количество() = 0 Тогда
			Сообщить("Необходимо отметить строки");
			Возврат;
		Иначе
			ЭтаФорма.Закрыть(Новый Структура("МассивСтрок", МассивОтмеченныхСтрок));
		КонецЕсли;
	Иначе
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		СтруктураВозврата = Новый Структура("Характеристика,Намотка,НомерПоставки,КодЭтикеткиЗаказчика,ЧестныйЗнак,Город,Количество,НомерСтроки");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ТекущаяСтрока);
		ЭтаФорма.Закрыть(СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьМассивСтрок(ВыборСтроки, ИдТекСтр)
	
	ТЗТовары = Товары.Выгрузить(Новый Структура(), "Характеристика,Количество");
	ТЗТовары.Очистить();
	
	МассивОтмеченныхСтрок = Новый Массив;
	Если ВыборСтроки Тогда
		ТекущаяСтрока = Товары.НайтиПоИдентификатору(ИдТекСтр);
		ЗаполнитьЗначенияСвойств(ТЗТовары.Добавить(), ТекущаяСтрока);
	Иначе
		Для каждого Строка из Товары Цикл
			Если Строка.Отметка Тогда
				ЗаполнитьЗначенияСвойств(ТЗТовары.Добавить(), Строка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТЗТовары.Свернуть("Характеристика", "Количество");
	Для каждого Строка из ТЗТовары Цикл
		СтруктураВозврата = Новый Структура("Характеристика,Количество");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Строка);
		МассивОтмеченныхСтрок.Добавить(СтруктураВозврата);
	КонецЦикла;
	
	Возврат МассивОтмеченныхСтрок;
	
КонецФункции

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
