
&НаКлиенте
Процедура Лико_ЗаполнитьЦеныПосле(Команда)
	ПроверитьЦены();
КонецПроцедуры


Процедура ПроверитьЦены() //+Лико m.shenderov 10.05.2023
	УстановитьПривилегированныйРежим(Истина);
	ЕстьИзменения=Ложь; 
	ВалютаНомененклатуры=Неопределено;
	Итого=0; 
	ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
	
	Для каждого Материал Из Объект.Материалы Цикл
		
		Если Не ЗначениеЗаполнено(Материал.Цена) Тогда
			
			СтруктураЦены=ПолучитьЦенуСервер(Материал.Номенклатура,Объект.Организация,Объект.Дата);
			
			Если ЗначениеЗаполнено(СтруктураЦены.Цена) Тогда
				
				Материал.Цена=СтруктураЦены.Цена;
				ВалютаНомененклатуры=СтруктураЦены.Валюта;
				ЕстьИзменения=Истина;
			КонецЕсли;
			
			
		КонецЕсли;  		 
		
		Итого=Итого+(Материал.Цена*Материал.МетражКВМ);
		
		
		ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
		Если не ЗначениеЗаполнено(Объект.Поставщик) Тогда
			Если Материал.Серия<>Неопределено и Материал.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
				
				Лико_ОбщегоНазначенияСервер.НайтиДокументПоступления(ДокументПоступления,Объект.Организация,Материал.Серия,Объект.Дата); 
				Если ЗначениеЗаполнено(ДокументПоступления)  Тогда
					Объект.Поставщик=ДокументПоступления.Контрагент;
				КонецЕсли;
				
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		Объект.Валюта=ВалютаНомененклатуры;
		Объект.СуммаБрака=Итого;
		
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 10.05.2023


Функция ПолучитьЦенуСервер(Номенклатура, Площадка, Дата) Экспорт 
	Структура = Новый Структура;
	Структура.Вставить("Цена"); 
	Структура.Вставить("Валюта");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена КАК Цена,
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта КАК Валюта
		|ИЗ
		|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|			&Дата,
		|			ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ЦенаПоставщика)
		|				И Площадка = &Площадка
		|				И ЦеноваяГруппа = &ЦеноваяГруппа) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("ЦеноваяГруппа", Номенклатура.ЦеноваяГруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();		
		Выборка.Следующий();	
		Структура.Цена = Выборка.Цена;
		Структура.Валюта = Выборка.Валюта;
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
&Вместо("Подключаемый_ВыполнитьКоманду")
Процедура Лико_Подключаемый_ВыполнитьКоманду(Команда)

	Если Команда.Имя = "ПодменюПечатьОбычное__АктБрака" И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НеобходимыеРеквизиты = Лико_Дополнительно.ПолучитьЗначенияРеквизитовСсылки(Объект.Ссылка, "СотрудникПринявшийРешение,Дефект,ОписаниеДефекта");
		Структура = Новый Структура;
		Структура.Вставить("СсылкаНаОбъект",Объект.Ссылка);
		//Структура.Вставить("ПредседательКомисии",Объект.ЧленКомиссии1) ;
		//Структура.Вставить("ГлавныйТехнолог", НеобходимыеРеквизиты.СотрудникПринявшийРешение);
		//Структура.Вставить("НачальникОтделаЗакупок",Объект.ЧленКомиссии3) ;
		//Структура.Вставить("ОписаниеНедостатков", "" + НеобходимыеРеквизиты.Дефект + ?(ЗначениеЗаполнено(НеобходимыеРеквизиты.ОписаниеДефекта), " (" + НеобходимыеРеквизиты.ОписаниеДефекта + ")", ""));
		ОткрытьФорму("Обработка.ЯССМ_АктБрака.Форма.ОтчетУпр",Структура,,,,,,);
		Возврат;
	КонецЕсли;

	Если Команда.Имя = "ПодменюПечатьОбычное__ОбразецНПБракМатериала" И НЕ ЗначениеЗаполнено(Объект.СотрудникОформившийОбразец) Тогда
		Объект.СотрудникОформившийОбразец = ?(ЗначениеЗаполнено(ГлЛико_Оператор), ГлЛико_Оператор, ПользователиКлиент.ТекущийПользователь());
		Записать();
		Прочитать();
	КонецЕсли;

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
