
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Отказ)
	
	
	
	Если ЗначениеЗаполнено(Родитель.Организация) Тогда
		
		Организация = Родитель.Организация;
		
	КонецЕсли;
	
	
	Если ЭтоГруппа=Истина Тогда
		
		Наименование=СтрШаблон("%1 (%2)",ВидНоменклатуры.Наименование, Организация);
	Иначе
		
		Если Приоритет=0 Или Родитель<>Ссылка.Родитель Тогда
			Приоритет=Справочники.Лико_ПравилаПеремещенияТМЦ.ПолучитьПриоритетМакс(ВидНоменклатуры, Организация)+1;
		КонецЕсли;
		
		Если Не СложнаяНастройка Тогда
			
			Описание="";
			ЕстьДанные=Ложь;
			Для каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда	
					ЕстьДанные=Истина;
					Описание=Описание+" " +ДопРеквизит.Свойство.Наименование+ ?(ДопРеквизит.Исключить," <> "," = ")+Строка(ДопРеквизит.Значение)+";";	
				КонецЕсли;	
			КонецЦикла;
			Если ЕстьДанные Тогда
				Описание=Лев(Описание,СтрДлина(Описание)-1);
			КонецЕсли;
		КонецЕсли;
		Наименование=СтрШаблон("%4 - %1 %2 (%3)",Строка(ВидНоменклатуры),Описание, Организация, Код);
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
    МассивНепроверяемыхРеквизитов.Добавить("Организация"); 	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Не ЭтоГруппа Тогда 
		Если Не ДополнительныеСвойства.Свойство("Записан") Тогда
			
			ДополнительныеСвойства.Вставить("Записан", Истина);	
			Записать();
			
		КонецЕсли;
		
		Справочники.Лико_ПравилаПеремещенияТМЦ.СохранитьНастройкуПравил(ВидНоменклатуры,Организация);
		
	КонецЕсли;


КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Приоритет = 0;
	НастройкиОбъектаКопирования = ОбъектКопирования.ОтборНастройки.Получить();
	ОтборНастройки =  Новый ХранилищеЗначения(НастройкиОбъектаКопирования, Новый СжатиеДанных(9)); 
	
КонецПроцедуры


#КонецОбласти




#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли


