
&НаКлиенте
Процедура Ок(Команда)
	СЗ = Новый СписокЗначений;
	
	Для каждого СтрТз Из ТЗ Цикл
		Если СтрТз.Отметка ТОгда
			Сз.Добавить(СтрТз.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(СЗ);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокЗначений") Тогда
		Для каждого СтрСЗ Из Параметры.СписокЗначений Цикл
			НоваяСтрТз=Тз.Добавить();
			НоваяСтрТз.Значение=СтрСЗ.Значение;
		КонецЦикла;	
	КонецЕсли;
	
	Если Параметры.Свойство("СписокЗначенийОтметка") Тогда
		Для каждого СтрСЗ Из Параметры.СписокЗначенийОтметка Цикл
			
			Структура = Новый Структура;
			Структура.Вставить("Значение",СтрСЗ.Значение);
			Для каждого НайденнаяСтрТз  Из Тз.НайтиСтроки(Структура)  Цикл
				НайденнаяСтрТз.Отметка=Истина;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок=Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("Ширина") Тогда
		Ширина=Параметры.Ширина;
	КонецЕсли;
	
	Если Параметры.Свойство("Высота") Тогда
		Высота=Параметры.Высота;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Ширина>0 Тогда
		ЭтаФорма.Ширина=Ширина;
		
	КонецЕсли;
	Если Высота Тогда
		ЭтаФорма.Высота=Высота;
		
	КонецЕсли;
	
	
КонецПроцедуры
