
&НаСервере
Процедура ЗаполнитьЦеныПоБазеРасчетаНаСервере()
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лико_ПараметрыРасчетаНормативовБазаРасчетаЦены.Ссылка КАК Ссылка,
	//|	СУММА(ЗакупкиОбороты.СуммаОборот) КАК Сумма,
	//|	СУММА(ЗакупкиОбороты.КоличествоОборот) КАК Количество
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Справочник.Лико_ПараметрыРасчетаНормативов.БазаРасчетаЦены КАК Лико_ПараметрыРасчетаНормативовБазаРасчетаЦены
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ЗакупкиОбороты
	//|		ПО Лико_ПараметрыРасчетаНормативовБазаРасчетаЦены.ЦеноваяГруппа = ЗакупкиОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Лико_ПараметрыРасчетаНормативовБазаРасчетаЦены.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.Ссылка КАК Ссылка,
	//|	ВТ.Сумма КАК Сумма,
	//|	ВТ.Количество КАК Количество
	//|ИЗ
	//|	ВТ КАК ВТ";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоБазеРасчета(Команда)
	Обработка = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнейОбработки(,, "ЗаполнитьЦеныПоБазеРасчета");

	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка.Ссылка);
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма");

	//ЗаполнитьЦеныПоБазеРасчетаНаСервере();
КонецПроцедуры
