#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет в переданный параметр значения перечисление "Группировки затрат в заказе переработчику"
//
// Параметры:
//  ДанныеВыбора - СписокЗначений, Массив - коллекция, в которую добавляются значения перечисление
//  Параметры    - см. ПараметрыИспользования
//
Процедура ЗаполнитьДанныеВыбора(ДанныеВыбора, Знач Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыИспользования();
	КонецЕсли;
	
	ДанныеВыбора.Очистить();
	
	Для каждого Параметр Из Параметры Цикл
		
		Если Параметр.Значение Тогда
			ДанныеВыбора.Добавить(Перечисления.ГруппировкиЗатратВЗаказеПереработчику[Параметр.Ключ]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает параметры использования группировки затрат.
//
// Возвращаемое значение:
//  Структура - содержит:
//   * БезГруппировки          - Булево - 
//   * ПоПродукции             - Булево - 
//   * ПоСпецификациям         - Булево - 
//   * ПоЭтапамПроизводства    - Булево -
//   * ПоЗаказамНаПроизводство - Булево -
//
Функция ПараметрыИспользования() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("БезГруппировки",              Истина);
	Параметры.Вставить("ПоПродукции",                 Истина);
	Параметры.Вставить("ПоПродукцииИНазначениям",     Ложь);
	Параметры.Вставить("ПоСпецификациям",             Истина);
	Параметры.Вставить("ПоСпецификациямИНазначениям", Ложь);
	Параметры.Вставить("ПоЭтапамПроизводства",        Ложь);
	
	//++ НЕ УТКА
	Параметры.Вставить(
		"ПоЭтапамПроизводства",
		ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2"));
	//-- НЕ УТКА
	
	//++ Устарело_Производство21
	Параметры.Вставить("ПоЗаказамНаПроизводство",     Ложь);
	//-- Устарело_Производство21
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецЕсли