Функция КолЭтВРоликеПачке(ЗаказКлиента,Количество,Автор,ДатаПеремотки,НомерБланка,Сотрудник,РабочийЦентр,ДокументОснование) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Линкс Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.КоличествоВРоликеПослеПеремотки) КАК КоличествоВРоликеПослеПеремотки
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры.Лико_Содержимое КАК СерииНоменклатурыЛико_Содержимое
		|		ПО Лико_ФормированиеПаллетаСодержимое.Серия = СерииНоменклатурыЛико_Содержимое.Ссылка
		|ГДЕ
		|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.ДатаФормирования = &ДатаФормирования
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.Ответственный = &Ответственный
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.НомерБланка = &НомерБланка
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.РабочийЦентрВыпускаВРоликеПослеПеремотки = &РабочийЦентрВыпускаВРоликеПослеПеремотки";
		
		Запрос.УстановитьПараметр("ДатаФормирования", ДатаПеремотки);
		Запрос.УстановитьПараметр("НомерБланка", НомерБланка);
		Запрос.УстановитьПараметр("Ответственный", Сотрудник);
		Запрос.УстановитьПараметр("РабочийЦентрВыпускаВРоликеПослеПеремотки", РабочийЦентр);
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаОтветстввенный = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОтветстввенный.Следующий() Цикл
			// Вставить обработку выборки ВыборкаОтветстввенный
			
			ВыборкаДетальныеЗаписи = ВыборкаОтветстввенный.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Возврат ВыборкаДетальныеЗаписи.КоличествоВРоликеПослеПеремотки * 1000;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ТЗГородов = ЗаказКлиента.Товары.Выгрузить(, "Город");
	ТЗГородов.Свернуть("Город");
	КоличествоГородов = ТЗГородов.Количество();
	
	ВыбранныйГород = Неопределено;	
	Если КоличествоГородов > 1 Тогда
		Для каждого Город Из ТЗГородов Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	&Город КАК Город
			|ИЗ
			|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
			|ГДЕ
			|	Лико_ЭтапыЗаказа.Заказ = &Заказ
			|	И Лико_ЭтапыЗаказа.Ответственный = &Ответственный
			|	И Лико_ЭтапыЗаказа.Период = &Период
			|	И Лико_ЭтапыЗаказа.Количество = &Количество
			|	И Лико_ЭтапыЗаказа.Комментарий ПОДОБНО ""%"" + &Город + ""%""";
			
			Запрос.УстановитьПараметр("Город", Город[0]);
			Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
			Запрос.УстановитьПараметр("Количество", Количество);
			Запрос.УстановитьПараметр("Ответственный", Автор);
			Запрос.УстановитьПараметр("Период", ДатаПеремотки);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ВыбранныйГород = Город[0];
			КонецЦикла;
			Если ЗначениеЗаполнено(ВыбранныйГород) Тогда
				Прервать;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.КоличествоЭтикетокВРолике КАК КоличествоЭтикетокВРолике
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Город = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиентаТовары.Город = &Город
	|		КОНЕЦ
	|	И ЗаказКлиентаТовары.Ссылка = &Заказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиентаТовары.НомерСтроки";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	Запрос.УстановитьПараметр("Город", ВыбранныйГород);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоЭтикетокВРолике;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции