
&НаКлиенте
Процедура НомерПрокатаПриИзменении(Элемент)
	ИзменитьВидимостьРабочийЦентр();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьРабочийЦентр()
	Элементы.РабочийЦентр.Видимость = ЗначениеЗаполнено(НомерПроката);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	текПараметрыВыбора = Новый Структура;
	текПараметрыВыбора.Вставить("РежимВыбора", Истина);
	текПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
	текПараметрыВыбора.Вставить("Площадка", фПлощадка);
	
	Если Не ЗначениеЗаполнено(РабочийЦентр) Тогда
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтотОбъект,"Подбор");
		
		ОткрытьФорму("Справочник.РабочиеЦентры.Форма.Лико_ФормаВыбора",текПараметрыВыбора,
		ЭтаФорма, , , , ОбработкаВыбора);
	Иначе 
		ЗаполнитьТаблицыПоРЦ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт	
	Если Значение = Неопределено Тогда
		ЭтаФорма.Закрыть();
        Возврат;
    КонецЕсли;
	
	РабочийЦентр = Значение;

	ЗаполнитьТаблицыПоРЦ();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицыПоРЦ()
	
	Если Не ЗначениеЗаполнено(НомерПроката) Тогда
		НомерПроката = 1;
	КонецЕсли;
	
	ЭтоОшибка = Ложь;
	ЗаполнитьТаблицуСекцийНаСервере(ЭтоОшибка);
		
	Если ЭтоОшибка Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
	МассивДопСекций = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеПоСекциям) Тогда
		ЗаполнитьТаблицаСекцииПриОткрытии(МассивДопСекций);
		НомерНачальнойСтроки = ЭтаФорма.ТаблицаСекции[0].ПолучитьИдентификатор(); 
	КонецЕсли;
	
	НомерКонечнойСтроки = ЭтаФорма.ТаблицаСекции[ТаблицаСекции.Количество()-1].ПолучитьИдентификатор();
	
	ОбходДереваТаблицаДопСекций();
	
	Если МассивДопСекций.Количество() <> 0 Тогда 
		Для Каждого элМассива из МассивДопСекций Цикл
			НовСтр = ТаблицаСекцийДобавитьСтроку(Лев(элМассива.Номер, СтрНайти(элМассива.Номер, "/")-1));
			ЗаполнитьЗначенияСвойств(НовСтр, элМассива);			
			//Изменяем данные в таблице источнике	
			УдалениеСтрокКоличестваВДопСекциях(НовСтр);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеСтрокКоличестваВДопСекциях(НовСтр)
	ЭлементыДерева = ТаблицаДопСекций.ПолучитьЭлементы();
	СекцияБылаНайдена = Ложь;
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если СекцияБылаНайдена Тогда
			Прервать;
		КонецЕсли;
		//ЭлементДерева - строка Первого уровня
		//ПодСтроки - строка Второго уровня уровня
		Если НовСтр.Секция = ЭлементДерева.Секция Тогда
			Если ЭлементДерева.Количество <> 0 Тогда
				ЭлементДерева.Количество = ЭлементДерева.Количество - 1;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		ПодСтроки = ЭлементДерева.ПолучитьЭлементы();
		Если ПодСтроки.Количество() > 0 Тогда 
			Для каждого ЭлементПодДерева  из ПодСтроки Цикл
				Если НовСтр.Секция = ЭлементПодДерева.ВидыРабот И  ЭлементДерева.Количество <> 0 Тогда
					ЭлементДерева.Количество = ЭлементДерева.Количество - 1;
					СекцияБылаНайдена = Истина;
					Прервать;
				ИначеЕсли НовСтр.Секция = ЭлементПодДерева.ВидыРабот И ЭлементПодДерева.Количество <> 0 Тогда
					ЭлементПодДерева.Количество = ЭлементПодДерева.Количество - 1;
					СекцияБылаНайдена = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если СекцияБылаНайдена Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РабочийЦентр") Тогда
		РабочийЦентр = Параметры.РабочийЦентр; 
		НомерПроката = Параметры.НомерПроката;
			
		Если Параметры.Свойство("ТЗСекции") Тогда
			ДанныеПоСекциям = Параметры.ТЗСекции;
		КонецЕсли;
	
	Иначе 		
		НомерПроката = Параметры.НомерПроката + 1;
	КонецЕсли;
	фПлощадка = Параметры.Площадка;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСекцийНаСервере(ЭтоОшибка = Ложь)	

	Пакет = ПолучитьТаблицуСекцийПоРЦ(РабочийЦентр);
	
	ТаблицаРезультат = Пакет[1].Выгрузить();
	Если ТаблицаРезультат.Количество() = 0 Тогда 
		ЭтоОшибка = Истина;
		Сообщить("Для данного РЦ не указанны Секции");
		Возврат;
	КонецЕсли;	
	//Определение параметров	
	ИмяПоля 			= "Колонка_";
	ИмяКоличество 		= "Количество";
	ИмяТаблицы 			= "ТаблицаСекции";
	ТипСекцииОсновная 	= Перечисления.Лико_ТипСекции.Основная;
	
	ЭлементТаблица = Элементы.ТаблицаСекции;
	
	ОписаниеБулева = Новый ОписаниеТипов("Булево");
	ОписаниеЧисла = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0));
	МассивРеквизитов = Новый Массив;
	
	РазмерТаблицы = 1;
	Для Каждого Строка Из ТаблицаРезультат Цикл
		СтрокаВид = Строка.ВидыРабот.Наименование;
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяПоля + РазмерТаблицы, ОписаниеБулева, ИмяТаблицы, СтрокаВид));
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяПоля + РазмерТаблицы + "Доступность", ОписаниеБулева, ИмяТаблицы, СтрокаВид + "Доступность"));
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяПоля + РазмерТаблицы + ИмяКоличество, ОписаниеЧисла));

		РазмерТаблицы = РазмерТаблицы + 1;	
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);  
	//Заполнение таблицы Доп в дерево
    ЗначениеВДанныеФормы(Пакет[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), ТаблицаДопСекций); 
	//ОбойтиДеревоДопСекций();
	
	РазмерТаблицы = 0;
	Для Каждого Колонка Из ТаблицаРезультат Цикл

		РазмерТаблицы = РазмерТаблицы + 1;
		ИмяКолонки = ИмяПоля + РазмерТаблицы;
				
		НовыйЭлемент = Элементы.Добавить(ИмяТаблицы + ИмяКолонки, Тип("ПолеФормы"), ЭлементТаблица);       
		НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.Заголовок 		= Колонка.ВидыРабот.Наименование;
		НовыйЭлемент.ПутьКДанным 	= "ТаблицаСекции." + ИмяКолонки;
		НовыйЭлемент.ШиринаЭлемента = 1;
		НовыйЭлемент.ПутьКДаннымПодвала = ИмяПоля + РазмерТаблицы + ИмяКоличество;
		НовыйЭлемент.Подсказка		= Колонка.ВидыРабот.Код;
		ЭлементТаблица.УстановитьДействие("ПриИзменении","ТаблицаСекцииКолонкиСекцийПриИзменении");      
				
		НовыйЭлемент = Элементы.Добавить(ИмяТаблицы + ИмяКолонки + "Доступность", Тип("ПолеФормы"), ЭлементТаблица);       
		НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.Заголовок 		= Колонка.ВидыРабот.Наименование + "Доступность";
		НовыйЭлемент.ПутьКДанным 	= "ТаблицаСекции." + ИмяКолонки + "Доступность";
		НовыйЭлемент.ШиринаЭлемента = 1;
		НовыйЭлемент.Видимость = Ложь;
	КонецЦикла;	
	ЧислоСекций = РазмерТаблицы;
	ЧислоУдаленныхСтрок = 0;
	
	СтрокаКоличество = ТаблицаРезультат.ВыгрузитьКолонку(ИмяКоличество);
	
	РазмерТаблицы = 0;
	Для каждого КолонкаКоличества из СтрокаКоличество Цикл
		РазмерТаблицы = РазмерТаблицы +1;
		ЭтаФорма[ИмяПоля + РазмерТаблицы + ИмяКоличество] = КолонкаКоличества;
	КонецЦикла;
	
	ЗаполнитьСтрокиТаблицыСекций(ТаблицаРезультат, ИмяТаблицы, ИмяПоля);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиТаблицыСекций(ТаблицаРезультат, ИмяТаблицы, ИмяПоля)
	
	ОбъектТаблицаСекции = ЭтаФорма[ИмяТаблицы];

	Для РазмерТаблицы = 1 По 20 Цикл
		НовСтр = ОбъектТаблицаСекции.Добавить();
		НовСтр.Номер = РазмерТаблицы;
		НовСтр.ТипСекции = Перечисления.Лико_ТипСекции.Основная;
		СтрокаДанныхСНомером = ТаблицаРезультат.ВыгрузитьКолонку("Номер" + РазмерТаблицы);
		НомерКолонки = 1;
		//СекцийНет - проверяет, что все колонки пусты
		СекцийНет = Истина;
		Для каждого КолонкаДанных из СтрокаДанныхСНомером Цикл
			НовСтр[ИмяПоля+ НомерКолонки+ "Доступность"] = КолонкаДанных;
			НомерКолонки = НомерКолонки + 1;
			//Если СекцийНет еще не проставлена, то когда Поле - Истина, проставляем
			Если КолонкаДанных И СекцийНет Тогда
				СекцийНет = Ложь
			КонецЕсли;
		КонецЦикла;
		//У данной Строки все поля пусты, удаляем пустую строку и прекращаем заполнение строк
		Если СекцийНет Тогда 
			ОбъектТаблицаСекции.Удалить(НовСтр);
			Прервать;
		КонецЕсли;
	  	ДобавлениеУсловногоОформления(РазмерТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуСекцийПоРЦ(РабочийЦентр)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РабочиеЦентрыСекции.Секция КАК Секция,
	|	РабочиеЦентрыСекции.ВидыРабот КАК ВидыРабот,
	|	РабочиеЦентрыСекции.Количество КАК Количество,
	|	РабочиеЦентрыСекции.ТипСекции КАК ТипСекции,
	|	РабочиеЦентрыСекции.Номер1 КАК Номер1,
	|	РабочиеЦентрыСекции.Номер2 КАК Номер2,
	|	РабочиеЦентрыСекции.Номер3 КАК Номер3,
	|	РабочиеЦентрыСекции.Номер4 КАК Номер4,
	|	РабочиеЦентрыСекции.Номер5 КАК Номер5,
	|	РабочиеЦентрыСекции.Номер6 КАК Номер6,
	|	РабочиеЦентрыСекции.Номер7 КАК Номер7,
	|	РабочиеЦентрыСекции.Номер8 КАК Номер8,
	|	РабочиеЦентрыСекции.Номер9 КАК Номер9,
	|	РабочиеЦентрыСекции.Номер10 КАК Номер10,
	|	РабочиеЦентрыСекции.Номер11 КАК Номер11,
	|	РабочиеЦентрыСекции.Номер12 КАК Номер12,
	|	РабочиеЦентрыСекции.Номер13 КАК Номер13,
	|	РабочиеЦентрыСекции.Номер14 КАК Номер14,
	|	РабочиеЦентрыСекции.Номер15 КАК Номер15,
	|	РабочиеЦентрыСекции.Номер16 КАК Номер16,
	|	РабочиеЦентрыСекции.Номер17 КАК Номер17,
	|	РабочиеЦентрыСекции.Номер18 КАК Номер18,
	|	РабочиеЦентрыСекции.Номер19 КАК Номер19,
	|	РабочиеЦентрыСекции.Номер20 КАК Номер20
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	Справочник.РабочиеЦентры.Секции КАК РабочиеЦентрыСекции
	|ГДЕ
	|	РабочиеЦентрыСекции.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Секция КАК Секция,
	|	ВТ_Итог.ВидыРабот КАК ВидыРабот,
	|	ВТ_Итог.Количество КАК Количество,
	|	ВТ_Итог.ТипСекции КАК ТипСекции,
	|	ВТ_Итог.Номер1 КАК Номер1,
	|	ВТ_Итог.Номер2 КАК Номер2,
	|	ВТ_Итог.Номер3 КАК Номер3,
	|	ВТ_Итог.Номер4 КАК Номер4,
	|	ВТ_Итог.Номер5 КАК Номер5,
	|	ВТ_Итог.Номер6 КАК Номер6,
	|	ВТ_Итог.Номер7 КАК Номер7,
	|	ВТ_Итог.Номер8 КАК Номер8,
	|	ВТ_Итог.Номер9 КАК Номер9,
	|	ВТ_Итог.Номер10 КАК Номер10,
	|	ВТ_Итог.Номер11 КАК Номер11,
	|	ВТ_Итог.Номер12 КАК Номер12,
	|	ВТ_Итог.Номер13 КАК Номер13,
	|	ВТ_Итог.Номер14 КАК Номер14,
	|	ВТ_Итог.Номер15 КАК Номер15,
	|	ВТ_Итог.Номер16 КАК Номер16,
	|	ВТ_Итог.Номер17 КАК Номер17,
	|	ВТ_Итог.Номер18 КАК Номер18,
	|	ВТ_Итог.Номер19 КАК Номер19,
	|	ВТ_Итог.Номер20 КАК Номер20
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	ВТ_Итог.ТипСекции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСекции.Основная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Секция КАК Секция,
	|	ВТ_Итог.ВидыРабот КАК ВидыРабот,
	|	ВТ_Итог.Количество КАК Количество,
	|	"""" КАК Параметры,
	|	ВТ_Итог.Номер1 КАК Номер1,
	|	ВТ_Итог.Номер2 КАК Номер2,
	|	ВТ_Итог.Номер3 КАК Номер3,
	|	ВТ_Итог.Номер4 КАК Номер4,
	|	ВТ_Итог.Номер5 КАК Номер5,
	|	ВТ_Итог.Номер6 КАК Номер6,
	|	ВТ_Итог.Номер7 КАК Номер7,
	|	ВТ_Итог.Номер8 КАК Номер8,
	|	ВТ_Итог.Номер9 КАК Номер9,
	|	ВТ_Итог.Номер10 КАК Номер10,
	|	ВТ_Итог.Номер11 КАК Номер11,
	|	ВТ_Итог.Номер12 КАК Номер12,
	|	ВТ_Итог.Номер13 КАК Номер13,
	|	ВТ_Итог.Номер14 КАК Номер14,
	|	ВТ_Итог.Номер15 КАК Номер15,
	|	ВТ_Итог.Номер16 КАК Номер16,
	|	ВТ_Итог.Номер17 КАК Номер17,
	|	ВТ_Итог.Номер18 КАК Номер18,
	|	ВТ_Итог.Номер19 КАК Номер19,
	|	ВТ_Итог.Номер20 КАК Номер20,
	|	ВТ_Итог.ТипСекции КАК ТипСекции
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	ВТ_Итог.ТипСекции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСекции.Дополнительная)
	|ИТОГИ ПО
	|	Секция";
	
	Запрос.УстановитьПараметр("Ссылка", РабочийЦентр);
	Выборка = Запрос.ВыполнитьПакет();
	
	Возврат Выборка;
	
КонецФункции

&НаСервере
Процедура ДобавлениеУсловногоОформления(РазмерТаблицы)
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаСекции.Колонка_" + РазмерТаблицы + "Доступность");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборУО.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСекцииКолонка_" + РазмерТаблицы);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноЗеленый);
	
	//Добавочное УО когда Количество 0
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Колонка_" + РазмерТаблицы + "Количество");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборУО.ПравоеЗначение = 0;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСекцииКолонка_" + РазмерТаблицы);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Перламутровый);
	
	//Добавочное УО когда Количество 0 И чтобы были видны доступные поля
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора           = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборУО = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаСекции.Колонка_" + РазмерТаблицы + "Доступность");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборУО.ПравоеЗначение = Истина;  
	ОтборУО.Использование  = Истина;
	
	ОтборУО = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Колонка_" + РазмерТаблицы + "Количество");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборУО.ПравоеЗначение = 0;   
	ОтборУО.Использование  = Истина;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСекцииКолонка_" + РазмерТаблицы);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лимонный);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСекцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Секция) Тогда
		Сообщить("Вид секции не задан!");    
		Возврат;
	КонецЕсли;

	текПараметрыВыбора = Новый Структура;
	текПараметрыВыбора.Вставить("РежимВыбора", Истина);
	текПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);	
	текПараметрыВыбора.Вставить("Секция", Элемент.ТекущиеДанные.Секция);
	текПараметрыВыбора.Вставить("ПараметрыСекции", Элемент.ТекущиеДанные.Параметры);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированиеПараметровСекции", ЭтотОбъект,"Подбор");

	ОткрытьФорму("Справочник.Лико_ВидыСекций.Форма.Лико_РедактированиеПараметровСекции",текПараметрыВыбора,
	        ЭтаФорма, , , , ОбработкаВыбора);
			
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированиеПараметровСекции(Значение, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
    Элементы.ТаблицаСекции.ТекущиеДанные.Параметры = Значение;
	СтруктураПараметров = ЗначениеИзСтрокиВнутрНаСервере(Значение);
	
	Элементы.ТаблицаСекции.ТекущиеДанные.ПараметрыПредставление = ПолучитьПредставлениеПараметра(СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеПараметра(СтруктураПараметров)
	текТекст = "";
	
	Для Каждого текПарамер из СтруктураПараметров Цикл
		текТекст = текТекст + текПарамер.Ключ + ": " + текПарамер.Значение + ", ";
	КонецЦикла;
	
	Если текТекст <> "" Тогда
		текТекст = Лев(текТекст, СтрДлина(текТекст) - 2);
	КонецЕсли;
	Возврат текТекст;
КонецФункции

&НаСервере
Функция ПолучитьПредставлениеПараметраНаСервере(СтруктураПараметров)
	текТекст = "";
	
	Для Каждого текПарамер из СтруктураПараметров Цикл
		текТекст = текТекст + текПарамер.Ключ + ": " + текПарамер.Значение + ", ";
	КонецЦикла;
	
	Если текТекст <> "" Тогда
		текТекст = Лев(текТекст, СтрДлина(текТекст) - 2);
	КонецЕсли;
	Возврат текТекст;
КонецФункции

&НаКлиенте
Процедура ТаблицаСекцииИспользуетсяПриИзменении(Элемент)
	текТекущиеДанные = Элементы.ТаблицаСекции.ТекущиеДанные;
	Если Не текТекущиеДанные.Используется И (ЗначениеЗаполнено(текТекущиеДанные.ПараметрыПредставление)
		ИЛИ ЗначениеЗаполнено(текТекущиеДанные.Параметры)) Тогда
		текТекущиеДанные.Параметры = "";
		текТекущиеДанные.ПараметрыПредставление = "";
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	ПередаваемыеДанные  = ПолучитьСекции();
    Оповестить("ПередаваемыеДанные",ПередаваемыеДанные,);
	Закрыть(ПередаваемыеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
			"Изменения не будут сохранены! Продолжить?",
			РежимДиалогаВопрос.ДаНет,
			0, // таймаут в секундах
			КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
			"Оповещение"); 
	Иначе
		Закрыть();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт 
    Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть();
	Иначе
		Возврат;
    КонецЕсли;	 
КонецПроцедуры

&НаСервере
Функция ПолучитьСекции()
	текТЗ = ТаблицаСекции.Выгрузить();

	МассивДанных = Новый Массив;
	
	Для Каждого СтрокаТЗ из текТЗ Цикл		
		СтруктураДанных = Новый Структура;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.Параметры) Тогда 
			Для Каждого СтрПараметры из ЗначениеИзСтрокиВнутрНаСервере(СтрокаТЗ.Параметры) Цикл 
				СтруктураДанных.Вставить(СтрПараметры.Ключ , СтрПараметры.Значение);
			КонецЦикла;
		КонецЕсли;
		
		СтруктураДанных.Вставить("НомерПроката", НомерПроката);
		СтруктураДанных.Вставить("НомерВарианта", 1);
		СтруктураДанных.Вставить("РабочийЦентр", РабочийЦентр);
		СтруктураДанных.Вставить("ВидСекции", 	СтрокаТЗ.Секция);
		СтруктураДанных.Вставить("Номер", 		СтрокаТЗ.Номер);
		
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;	
	
    Возврат МассивДанных; 
КонецФункции

&НаКлиенте
Процедура ОбходДереваТаблицаДопСекций()
	//Разворачиваем все Эллементы
	ЭлементыДерева = ТаблицаДопСекций.ПолучитьЭлементы();
	МассивИндексовУдаляемыхСтрок = Новый Массив;
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ТаблицаДопСекций.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
		//ЭлементДерева - строка Первого уровня
		//ПодСтроки - строка Второго уровня уровня
		ПодСтроки = ЭлементДерева.ПолучитьЭлементы();
		Если  ПодСтроки.Количество() > 1 Тогда 
			ЭтоПервый = Истина;
			Для каждого ЭлементПодДерева  из ПодСтроки Цикл
				Если ЭтоПервый Тогда 
					ЭтоПервый = Ложь;
					ЗаполнитьЗначенияСвойств(ЭлементДерева, ЭлементПодДерева);
					ЭлементДерева.ВидыРабот = Неопределено;
					ЭлементДерева.Параметры = ЗаполнитьПараметрыСекций(ЭлементПодДерева);
				КонецЕсли;
				ЭлементПодДерева.Количество = 0;				
			КонецЦикла;
		Иначе 
			//В групперовке всего 1на строка
			Для каждого ЭлементПодДерева из ПодСтроки Цикл
				ЗаполнитьЗначенияСвойств(ЭлементДерева, ЭлементПодДерева);
				ЭлементДерева.ВидыРабот = Неопределено;
				ЭлементДерева.Параметры = ЗаполнитьПараметрыСекций(ЭлементПодДерева);
				ПодСтроки.Удалить(0);	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПараметрыСекций(СтрокаСПараметрами)
	СтрокаПараметры = "";
	ЭтоЕдинственный = Истина;
	Для РазмерТаблицы = 1 По 20 Цикл
		Если СтрокаСПараметрами["Номер" + РазмерТаблицы] Тогда
			СтрокаПараметры = СтрокаПараметры + Строка(РазмерТаблицы) + ", ";
			Если ЭтоЕдинственный Тогда 
				ЭтоЕдинственный = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЭтоЕдинственный Тогда 
		СтрокаПараметры = Лев(СтрокаПараметры, СтрДлина(СтрокаПараметры)-2);
	КонецЕсли;
	
	Возврат СтрокаПараметры;
КонецФункции

&НаКлиенте
Процедура ТаблицаСекцииПередНачаломИзменения(Элемент, Отказ)
	
	ИсхИмя = ТекущийЭлемент.ТекущийЭлемент.Имя;
	текИмя = СтрЗаменить(ИсхИмя, "ТаблицаСекции", "");	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номер", Элемент.ТекущиеДанные.Номер);
	НайденныеСтроки = ТаблицаСекции.НайтиСтроки(ПараметрыОтбора);
	
	ЭтоКолонкаПараметров = СтрНайти(ИсхИмя, "ТаблицаСекцииКолонка_") <> 0;
	
	Если НЕ ЭтоКолонкаПараметров Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ЭтоКолонкаПараметров И НЕ НайденныеСтроки[0][текИмя+"Доступность"] Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ИсхИмя <> текИмя Тогда 
		Если (ЭтаФорма[текИмя+"Количество"] = 0 И (НЕ НайденныеСтроки[0][текИмя])) тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСекцииКолонкиСекцийПриИзменении(Элемент)
	ИмяТекЭлемента 	= Элемент.ТекущийЭлемент.Имя;
	ИмяПоля 		= "Колонка_";
		
	Если  СтрНайти(ИмяТекЭлемента, ИмяПоля) = 0 Тогда
		Возврат;
	КонецЕсли;
	ИмяТаблицы 		= "ТаблицаСекции";
	ИмяКоличество 	= "Количество";

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номер", Элемент.ТекущиеДанные.Номер);
	НайденныеСтроки = ТаблицаСекции.НайтиСтроки(ПараметрыОтбора);
	
	текСтрокаТаблицыСекции = НайденныеСтроки[0];
	текИмяКолонки = СтрЗаменить(имяТекЭлемента, ИмяТаблицы, "");
	текКоличествоВПадвале = ЭтаФорма[текИмяКолонки+ИмяКоличество];
	ТекЗначение = текСтрокаТаблицыСекции[текИмяКолонки];
	
	Если Не ТекЗначение Тогда 
		текСтрокаТаблицыСекции.Параметры = "";
		текСтрокаТаблицыСекции.ПараметрыПредставление = "";
		текСтрокаТаблицыСекции.Секция = Неопределено;
		ЭтаФорма[текИмяКолонки+ИмяКоличество] = текКоличествоВПадвале + 1;
		Возврат;
	КонецЕсли;
	
	ТекНомерСекции = Число(СтрЗаменить(имяТекЭлемента, ИмяТаблицы + ИмяПоля, ""));
	
	Для ТекКолонка = 1 По ЧислоСекций Цикл
		Если ТекНомерСекции = ТекКолонка Тогда 
			текСтрокаТаблицыСекции.Секция = ПолучитьВидСекцийНаСервере(Элемент.ТекущийЭлемент.Подсказка);
			СтруктураЭлементов = Новый Структура;
			СтруктураЭлементов.Вставить("Секция", текСтрокаТаблицыСекции.Секция); 	
			текСтрокаТаблицыСекции.Параметры = ЗначениеВСтрокуВнутрНаСервере(СтруктураЭлементов);
			текСтрокаТаблицыСекции.ПараметрыПредставление = ПолучитьПредставлениеПараметра(СтруктураЭлементов);
			Продолжить;
		КонецЕсли;
		КолонкаТаблицы = текСтрокаТаблицыСекции[ИмяПоля + ТекКолонка];
		Если КолонкаТаблицы Тогда 
			текСтрокаТаблицыСекции[ИмяПоля + ТекКолонка] = Ложь;
			текНовоеКоличество = ЭтаФорма[ИмяПоля + ТекКолонка+ИмяКоличество] + 1;
			ЭтаФорма[ИмяПоля + ТекКолонка+ИмяКоличество] = текНовоеКоличество;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма[текИмяКолонки+ИмяКоличество] = текКоличествоВПадвале - 1;
	
КонецПроцедуры

&НаСервере
Функция ЗначениеВСтрокуВнутрНаСервере(СтруктураЭлементов)
	Возврат ЗначениеВСтрокуВнутр(СтруктураЭлементов);
КонецФункции

&НаСервере
Функция  ЗначениеИзСтрокиВнутрНаСервере(Значение)
	Возврат ЗначениеИзСтрокиВнутр(Значение);
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицаСекцииПриОткрытии(пМассивДопСекций)
	МассивСекций = Новый Массив;
	Для текКолонка = 1 По ЧислоСекций Цикл
		МассивСекций.Добавить(Элементы.ТаблицаСекции.ПодчиненныеЭлементы["ТаблицаСекцииКолонка_" + текКолонка].Заголовок);
	КонецЦикла;
	
	ТекТабСекции = РеквизитФормыВЗначение("ТаблицаСекции");
	ПолученнаяТЗ = ЗначениеИзСтрокиВнутрНаСервере(ДанныеПоСекциям);
	
	
	Для каждого ТекСтр из ПолученнаяТЗ Цикл
		текНомерСекции = МассивСекций.Найти(Строка(ТекСтр.ВидСекции));
		Если текНомерСекции = Неопределено  Тогда
			Если СтрНайти(ТекСтр.Номер, "/") = 0 Тогда 
				Продолжить;
			Иначе
				//Тут доп секции
				ДобавитьДопСекцииВМассив(пМассивДопСекций, ТекСтр);
			КонецЕсли;
		Иначе 
			Если СтрНайти(ТекСтр.Номер, "/") = 0 Тогда 
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Номер", ТекСтр.Номер);
				НайденныеСтроки = ТекТабСекции.НайтиСтроки(ПараметрыОтбора);
				//Значение должно быть одно если оно найдено или не быть вовсе
				Если НайденныеСтроки.Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				НайденныеСтроки[0]["Колонка_"+(текНомерСекции+1)] = Истина;
				
				этаформа["Колонка_"+(текНомерСекции+1)+"количество"] = этаформа["Колонка_"+(текНомерСекции+1)+"количество"] - 1;

				ЗаполнитьПараметрыПоСтроке(ТекСтр, НайденныеСтроки[0]);
			Иначе 
				//Тут доп секции, и вид Секции совпадает с одной из колонок!
				ДобавитьДопСекцииВМассив(пМассивДопСекций, ТекСтр);
			КонецЕсли;		
		КонецЕсли;	
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТекТабСекции, "ТаблицаСекции");
	ДанныеПоСекциям = "";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоСтроке(ТекСтрИзТЗ, НоваяСтрокаПарам, пНомер = "")
	НоваяСтрокаПарам.Секция = ТекСтрИзТЗ.ВидСекции;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Секция", ТекСтрИзТЗ.ВидСекции);
	Для каждого ПараметрСекции Из ТекСтрИзТЗ.ВидСекции.ПараметрыСекций Цикл
		текНаименованиеПараметра = ПараметрСекции.ПараметрСекции.Наименование;
		Попытка
			Если ЗначениеЗаполнено(ТекСтрИзТЗ[текНаименованиеПараметра]) Тогда
				СтруктураПараметров.Вставить(текНаименованиеПараметра, ТекСтрИзТЗ[текНаименованиеПараметра]);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	НоваяСтрокаПарам.Параметры = ЗначениеВСтрокуВнутрНаСервере(СтруктураПараметров);
	НоваяСтрокаПарам.ПараметрыПредставление = ПолучитьПредставлениеПараметраНаСервере(СтруктураПараметров);
	Если пНомер <> "" Тогда
		НоваяСтрокаПарам.Номер = пНомер;
	КонецЕсли;
КонецПроцедуры
			
&НаСервере
Процедура ДобавитьДопСекцииВМассив(пМассивДопСекций, пТекСтр)
	//	ЭлементСтруктура = Новый Структура;			
	//	Для Каждого ИмяКолонки Из пКолонки Цикл					
	//		ЭлементСтруктура.Вставить(ИмяКолонки.Имя, пТекСтр[ИмяКолонки.Имя]);				
	//	КонецЦикла;			
	//	пМассивДопСекций.Добавить(ЭлементСтруктура);
	СтруктураДляМассива = Новый Структура;
	СтруктураДляМассива.Вставить("Секция");
	СтруктураДляМассива.Вставить("Параметры");
	СтруктураДляМассива.Вставить("ПараметрыПредставление");
	СтруктураДляМассива.Вставить("Номер");
	ЗаполнитьПараметрыПоСтроке(пТекСтр, СтруктураДляМассива, пТекСтр.Номер);
	пМассивДопСекций.Добавить(СтруктураДляМассива);
КонецПроцедуры
			
&НаСервере
Функция ПолучитьВидСекцийНаСервере(пКод)
	Возврат Справочники.Лико_ВидыСекций.НайтиПоКоду(пКод);	
КонецФункции

&НаКлиенте
Процедура ТаблицаСекцииПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если Строка > НомерКонечнойСтроки Тогда 
		Возврат
	КонецЕсли;
	
	НомерСтроки = Строка+1 - НомерНачальнойСтроки; 
	Если Элемент.Имя = "ТаблицаСекции" И ПараметрыПеретаскивания.Значение[0]["Номер"+(НомерСтроки)] 
		И типЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ДанныеФормыЭлементДерева") Тогда
		
		НовыйНомерСтроки = "" + НомерСтроки + "/" + (НомерСтроки + 1);
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номер", НовыйНомерСтроки);
		НайденныеСтроки = ТаблицаСекции.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
		
		НовСтр = ТаблицаСекцийДобавитьСтроку(Строка(НомерСтроки));
		
		СтрокаПеренос = ПараметрыПеретаскивания.Значение[0];
		НовСтр.Секция = ?(ЗначениеЗаполнено(СтрокаПеренос.ВидыРабот), СтрокаПеренос.ВидыРабот, СтрокаПеренос.Секция);
		СтруктураЭлементов = Новый Структура;
		СтруктураЭлементов.Вставить("Секция", НовСтр.Секция);
		НовСтр.Параметры = ЗначениеВСтрокуВнутрНаСервере(СтруктураЭлементов);
		НовСтр.ПараметрыПредставление = ПолучитьПредставлениеПараметра(СтруктураЭлементов);
		НовСтр.Номер = НовыйНомерСтроки; 
		//Изменяем данные в таблице источнике
		текРодитель = ПолучитьРодителяВДереве(ПараметрыПеретаскивания.Значение[0], ПараметрыПеретаскивания.Значение[0]);
		текРодитель.Количество = текРодитель.Количество - 1;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Функция ТаблицаСекцийДобавитьСтроку(пНомерСтроки)
	НовСтр = ТаблицаСекции.Добавить();
	ТекНомерСтроки = НовСтр.ПолучитьИдентификатор() - 1 - ЧислоУдаленныхСтрок ;
	ТаблицаСекции.Сдвинуть(ТаблицаСекции.Индекс(НовСтр), ?(НомерНачальнойСтроки = 0, 0, НомерНачальнойСтроки-1) + ПолучитьЧислоСдвига(пНомерСтроки) - ТекНомерСтроки);
	
	Возврат НовСтр;
КонецФункции	

&НаКлиенте
Функция ПолучитьЧислоСдвига(ИскомыйНомер)
	КоличествоСдвигов = 0;
	Для каждого ТекСтр Из ТаблицаСекции Цикл
		КоличествоСдвигов = КоличествоСдвигов + 1;
		Если ТекСтр.Номер = ИскомыйНомер Тогда
			Возврат КоличествоСдвигов 
		КонецЕсли;
	КонецЦикла;
 	
	Возврат КоличествоСдвигов; 
КонецФункции

&НаКлиенте
Процедура ТаблицаДопСекцийНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	текРодитель = ПолучитьРодителяВДереве(Элемент.ТекущиеДанные, ТаблицаДопСекций.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]));  
	Если текРодитель.Количество <= 0 
		ИЛИ ТаблицаДопСекций.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]).ПолучитьЭлементы().Количество() > 0 Тогда
		Выполнение = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРодителяВДереве(Элемент, ПараметрыПеретаскивания)
	Если ЗначениеЗаполнено(Элемент.ВидыРабот) Тогда
		Возврат ПараметрыПеретаскивания.ПолучитьРодителя();
	Иначе
		Возврат ПараметрыПеретаскивания;
	КонецЕсли;                                                    
КонецФункции

&НаКлиенте
Процедура ТаблицаСекцииНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
	Возврат;
	//Не удалять вдруг понадобится
	//Если Элемент.ТекущиеДанные.ТипСекции = ПредопределенноеЗначение("Перечисление.Лико_ТипСекции.Основная") Тогда
	//	Выполнение = Ложь;
	//	Возврат;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСекцииПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.ТипСекции = ПредопределенноеЗначение("Перечисление.Лико_ТипСекции.Основная") Тогда
		Отказ = Истина;
		Возврат;
	Иначе
		ЭлементыДерева = ТаблицаДопСекций.ПолучитьЭлементы();
		Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
			//ЭлементДерева - строка Первого уровня
			//ПодСтроки - строка Второго уровня уровня
			Если Элемент.ТекущиеДанные.Секция = ЭлементДерева.Секция Тогда
				 ЭлементДерева.Количество = ЭлементДерева.Количество + 1;
				 Прервать;
			КонецЕсли;
			СекцияБылаНайдена = Ложь; 
			ПодСтроки = ЭлементДерева.ПолучитьЭлементы();
			Если  ПодСтроки.Количество() > 0 Тогда 
				ЭтоПервый = Истина;
				Для каждого ЭлементПодДерева  из ПодСтроки Цикл
					Если Элемент.ТекущиеДанные.Секция = ЭлементПодДерева.ВидыРабот Тогда
						ЭлементДерева.Количество = ЭлементДерева.Количество + 1;
						СекцияБылаНайдена = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если СекцияБылаНайдена Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ЧислоУдаленныхСтрок = ЧислоУдаленныхСтрок + 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДопСекцийПередСворачиванием(Элемент, Строка, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДопСекцийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДопСекцийПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСекцииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДопСекцийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
