#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает код вида оплаты на терминале
// 
// 
// Возвращаемое значение:
//  Соответствие
//                  
Функция КодВидаОплатыНаТерминале() Экспорт
	
	Результат = Новый Соответствие(); 
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.Карта")  , 0);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.СБПQR")  , 1);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ПлатиQR"), 2);
	Возврат Результат;
	
КонецФункции

// Возвращает вид оплаты на терминале по коду.
// 
// 
// Возвращаемое значение:
//  Соответствие
//
Функция ВидОплатыНаТерминалеПоКоду() Экспорт
	
	Результат = Новый Соответствие();   
	Результат.Вставить(0, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.Карта"));
	Результат.Вставить(1, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.СБПQR"));
	Результат.Вставить(2, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ПлатиQR"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#КонецЕсли