#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

КонецПроцедуры

//Функция ПолучитьСостояниеЗаявки(Заявка) экспорт
//		
//	Если ЗАявка = Неопределено Тогда
//		Сообщить("Не указана заявка для определения состояния!", СтатусСообщения.ОченьВажное);
//	Иначе
//		
//		Состояние = Перечисления.ЛикоСостояниеЗаявокНаТранспортировку.Создан;
//		
//		Отбор			= Новый Структура("Заявка", Заявка);
//		
//		РегСостояний    = РегистрыСведений.Лико_СостояниеЗаявокНаТранспортировку.СрезПоследних(ТекущаяДата(), Отбор);
//		Если РегСостояний.Количество() > 0 Тогда
//			Состояние = РегСостояний.Получить(0).Состояние;
//		КонецЕсли;
//	КонецЕсли;

//	Возврат Состояние;
//	
//КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//		КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецЕсли

Функция РассчитатьВесКоробокДляТаблицыСерий(ТаблицаСерий) Экспорт
	
	Если ТаблицаСерий.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Серия
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.Серия.Лико_ВесКоробки) КАК Вес
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаСерий);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщийВесКоробок = 0;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОбщийВесКоробок = ВыборкаДетальныеЗаписи.Вес;
	КонецЕсли;
	
	Возврат ОбщийВесКоробок;
	
КонецФункции
