Перем КлючиСтруктуры;
Перем СтруктураСоответствияТЧ;
Перем ОрганизацияПродавецКлиенту;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Если ДополнительныеСвойства.Свойство("Лико_ПровестиТолькоПоРНЛико_СтоимостьДоставки") Тогда
	//	Лико_СформироватьДвиженияПоРНЛико_СтоимостьДоставки(Отказ);
	//	Возврат;
	//КонецЕсли;
	
	//АдресХраненияТоваровВПути = ЛикоМодулиРаботыСоСкладамиСервер.ПолучитьСвойствоОбъекта("АдресХраненияТоваровВПути", СкладРегиона);
	//В УПП нет такого свойства "АдресХраненияТоваровВПути"
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт
		И СкладРегиона.ИспользоватьОрдернуюСхемуПриПоступлении
		И (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона // вряд ли нужен, но пусть будет на всякий случай
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона2
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки)
		Тогда
		Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
			Тогда
			ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладРегиона, "ЯчейкаХранениеПоУмолчанию");
		Иначе
			ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗонуПриемкиПоСкладу(СкладРегиона);
		КонецЕсли;
		Для каждого Строка из Продукция Цикл
			Если Строка.Мест > 0 Тогда
				Движение = Движения.Лико_АдресноеХранение.Добавить();
				Движение.Период = ДатаОтгрузки;
				Движение.Регистратор = Ссылка;
				Движение.Серия = Строка.Серия;
				Движение.Паллет = Строка.Паллет;
				Движение.Ячейка = ЯчейкаПолучатель;
				Движение.ВыбылСоСклада = Ложь;
				Движение.Склад = СкладРегиона;
			КонецЕсли;
		КонецЦикла;
	Иначе
		АдресХраненияТоваровВПути = Неопределено;
		Движения.Лико_АдресноеХранение.Записывать = Истина;
		ВыборкаЯС = ДополнительныеСвойства.ВыборкаЯС;
		Пока ВыборкаЯС.Следующий() Цикл
			Если ВыборкаЯС.Мест = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.Лико_АдресноеХранение.Добавить();
			// Если дата документа больше даты размещения, поставим ее, иначе поставим дату размещения + 1
			// В противном случае может получится ситуация: 1 числа создали заявку, 2 числа переместили коробку в другую ячейку, 3 числа ее подобрали в заявку.
			// Если сделать запись датой документа, то по регистру коробка останется в "другой ячейке" от 2 числа
			Движение.Период = ДатаПроведенияПоАдресномуСкладу;
			Движение.Регистратор = Ссылка;
			Движение.Серия = ВыборкаЯС.Серия;
			Движение.Паллет = ?(ЗначениеЗАполнено(АдресХраненияТоваровВПути), ВыборкаЯС.Паллет, Справочники.Лико_Паллеты.ПустаяСсылка());
			Движение.Ячейка = АдресХраненияТоваровВПути;
			Движение.ВыбылСоСклада = НЕ ЗначениеЗАполнено(АдресХраненияТоваровВПути);
		КонецЦикла;
	КонецЕсли;
	
	СформироватьДвиженияПоЛико_ЗаявкиНаОтгрузку();
	
	Если НЕ Отказ Тогда 
		//Если НЕ ЗначениеЗаполнено(АдресХраненияТоваровВПути) Тогда
		//	СхемаФормированияДокументов = ЛикоМодулиРаботыСоСкладами.ОпределитьСхемуФормированияДокументовРеализации(Грузоотправитель, Дата);
		//	ПерепровестиЗаявку(СхемаФормированияДокументов);
		//КонецЕсли;
		//
		//СостояниеЗаявки = Перечисления.ЛикоСостояниеЗаявокНаТранспортировку.Закрыт;
		//
		//ИзменитьСтатусЗаявки(СостояниеЗаявки, ЭтотОбъект.Дата);
	КонецЕсли;
	
	Если НЕ Отказ И Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
		// Добавим записи в Лико_ЭтапыЗаказа
		ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияРеквизитаДокументВРегистреЭтапыЗаказа.ЗначениеПараметра <= ДатаОтгрузки;
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаЗаказов = Продукция.Выгрузить(,"ЗаказКлиента,Количество,Мест");
		ТаблицаЗаказов.Очистить();
		Для каждого Строка из Продукция Цикл
			Если Строка.Мест > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаЗаказов.Добавить(), Строка);
			КонецЕсли;
		КонецЦикла;
		ТаблицаЗаказов.Свернуть("ЗаказКлиента", "Количество");
		Для каждого Строка из ТаблицаЗаказов Цикл
			МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ДатаОтгрузки;
			МенеджерЗаписи.Заказ = Строка.ЗаказКлиента;
			МенеджерЗаписи.Площадка = Строка.ЗаказКлиента.Площадка;
			МенеджерЗаписи.Количество = Строка.Количество;
			МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Отгрузка;
			//МенеджерЗаписи.Ответственный = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
			МенеджерЗаписи.Ответственный = ?(ЗначениеЗаполнено(Кладовщик), Кладовщик, ПараметрыСеанса.ТекущийПользователь);
			МенеджерЗаписи.Комментарий = ТипОтгрузки;
			Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту
				Тогда
				// Нужен грузополучатель
				МенеджерЗаписи.Комментарий = МенеджерЗаписи.Комментарий + " (грузополучатель """ + Контрагент + """)";
			ИначеЕсли ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки
				Тогда
				// Нужно 2 склада
				МенеджерЗаписи.Комментарий = МенеджерЗаписи.Комментарий + " (со склада """ + СкладГП + """ на склад """ + СкладРегиона + """)";
			ИначеЕсли ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона2 
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
                Тогда
				// Нужен склад региона
				МенеджерЗаписи.Комментарий = МенеджерЗаписи.Комментарий + " (склад """ + СкладРегиона + """)";
			ИначеЕсли ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения Тогда
				// Нужен склад ГП
				МенеджерЗаписи.Комментарий = МенеджерЗаписи.Комментарий + " (склад """ + СкладГП + """)";
			ИначеЕсли ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения Тогда
				// Нужен грузополучатель и склад ГП
				МенеджерЗаписи.Комментарий = МенеджерЗаписи.Комментарий + " (грузополучатель """ + Контрагент + """, склад """ + СкладГП + """)";
			ИначеЕсли ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона 
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона
				Тогда
				// Нужен грузополучатель и склад региона
				МенеджерЗаписи.Комментарий = МенеджерЗаписи.Комментарий + " (грузополучатель """ + Контрагент + """, склад """ + СкладРегиона + """)";
			КонецЕсли;
			
			Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
				МенеджерЗаписи.Документ = Ссылка;
			КонецЕсли;
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				Сообщить("Не удалось добавить запись в регистр ""лк Этапы заказа"": " + ОписаниеОшибки());
				Отказ = Истина;
				Прервать;
			КонецПопытки;
			ИзменитьСтатусЗаказаНаЗакрыт(Строка.ЗаказКлиента);
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Лико_СформироватьДвиженияПоРНЛико_СтоимостьДоставки(Отказ);
	
	//Начало изменений Иванова А.В. 20190524
	Лико_СформироватьДвиженияПОЛико_ЗатратыПоЗаказу(Отказ);
	//Конец изменений Иванова А.В. 20190524
	
	Если ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ИзменитьИнформациюОПеревозчике") Тогда
		УстановитьПривилегированныйРежим(Истина);
		// Поменяем информацию о перевозчике
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК ТиповойДокумент
		|ИЗ
		|	РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
		|ГДЕ
		|	(ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.Документ КАК Документ.Лико_ЗаявкаНаТранспортировку)) = &Документ
		|	И (Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ИЛИ Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.ТранспортнаяНакладная
		|			ИЛИ Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.ПеремещениеТоваров)";
		
		Запрос.УстановитьПараметр("Документ", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Перевозчик = ?(ЗначениеЗаполнено(Диспетчер), Диспетчер.Партнер, ПеревозчикЖДиАвиа.Партнер);
		Если ЗначениеЗаполнено(Перевозчик) И ЗначениеЗаполнено(АдресДоставки) Тогда
			СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
		Иначе
			СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
		КонецЕсли;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = ВыборкаДетальныеЗаписи.ТиповойДокумент;
			ТипДокумента = ТипЗнч(Документ);
			Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
				Если Документ.АдресДоставки <> АдресДоставки ИЛИ Документ.ПеревозчикПартнер <> Перевозчик Тогда
					ДокументОбъект = Документ.ПолучитьОбъект();
					ДокументОбъект.АдресДоставки = АдресДоставки;
					ДокументОбъект.АдресДоставкиЗначенияПолей = АдресДоставкиЗначенияПолей;
					ДокументОбъект.СпособДоставки = СпособДоставки;
					ДокументОбъект.ПеревозчикПартнер = Перевозчик;
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
				// Полностью переделаем ее
				СоздатьДокументТраспортнаяНакладная(Документ, Неопределено, Неопределено, Истина);
			КонецЕсли;	
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Отказ = НЕ СоздатьТиповыеДокументы();
	КонецЕсли;
	//Если НЕ Отказ Тогда
	//	ПровестиПереупаковкиПаллет();
	//КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТиповыеДокументы() Экспорт
	
	Отказ = Ложь;	
	Если ДополнительныеСвойства.Свойство("ЗаписьИзОтборРазмещениеТоваров") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Грузоотправитель2) Тогда
		ОрганизацияПродавецКлиенту = Грузоотправитель2;
	Иначе
		Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.Организации") Тогда
			ОрганизацияПродавецКлиенту = Грузоотправитель;
		Иначе
			ОрганизацияПродавецКлиенту = Лико_Дополнительно.ПолучитьОрганизациюПоКонтрагенту(Грузоотправитель);
			Если НЕ ЗначениеЗаполнено(ОрганизацияПродавецКлиенту) Тогда
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("" + Ссылка + ": контрагент, выбранный в грузоотправителе 1 (" + Грузоотправитель + "), не соответствует ни одной организации.");
				Отказ = Истина;
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	ОрганизацияВладелецСкладаГП = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладГП, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
	
	НачатьТранзакцию();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДополнительныеСвойства.Свойство("ИзменилисьКорректируемыеПараметры") И ДополнительныеСвойства.ИзменилисьКорректируемыеПараметры Тогда
		// Переделаем ключевые параметры в регистре Лико_СвязиСТиповымиДокументам
		Если НЕ ПеределатьКлючевыеПараметрыВСвязяхСТиповымиДокументами() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Контрагент");
	ТаблицаНовыхДокументов.Колонки.Добавить("Валюта");
	ТаблицаНовыхДокументов.Колонки.Добавить("Регион");
	ЕстьРеализации = Ложь;
	
	// Перед тем как создавать, нужно сначала их все пометить на удаление. Причем ОтборРазмещениеТоваров_Перемещение и Лико_ПередачаТоваровМеждуОрганизациями трогать не нужно
	КлючиСтруктурыУдаляемыхДокументов = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "ОтборРазмещениеТоваров_Перемещение"); 
	КлючиСтруктурыУдаляемыхДокументов = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктурыУдаляемыхДокументов, "Лико_ПередачаТоваровМеждуОрганизациями"); 
	СтруктураТиповыхДокументовУдаление = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктурыУдаляемыхДокументов, Ссылка,,"Лико_АвтоматическоеСоздание");
	Если СтруктураТиповыхДокументовУдаление = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Найдем ОтборРазмещениеТоваров_Перемещение 
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(,, "ОтборРазмещениеТоваров_Перемещение", Ссылка, Ложь);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СкладГП.ИспользоватьАдресноеХранение Тогда
		
		Если НЕ ДополнительныеСвойства.Свойство("ЗаписьИзОтборРазмещениеТоваров") Тогда
			НовыйДокументОтборРазмещениеТоваров_Перемещение = СоздатьДокументОтборРазмещениеТоваров(СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Перемещение);
			Если НовыйДокументОтборРазмещениеТоваров_Перемещение = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Перемещение;
		
	КонецЕсли;
	
	// Найдем Лико_ПередачаТоваровМеждуОрганизациями 
	// СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(,, "Лико_ПередачаТоваровМеждуОрганизациями", Ссылка, Ложь);
	//Если СтруктураТиповыхДокументов = Неопределено Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СтруктураТиповыхДокументов.Лико_ПередачаТоваровМеждуОрганизациями) Тогда
		// Нужно удалить из этого документа связанные строки
		УдалитьИзЛико_ПередачаТоваровМеждуОрганизациямиСвязанныеСтроки();
	//КонецЕсли;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
		
		//Типовые документы с пустым контрагентом и с пустой валютой
		ОтборТиповыхДокументов = Новый Структура("Контрагент,Валюта,Регион", Справочники.Контрагенты.ПустаяСсылка(), Справочники.Валюты.ПустаяСсылка(), Справочники.БизнесРегионы.ПустаяСсылка()); 
		СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(, ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
		Если СтруктураТиповыхДокументов = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Нужно создать реализации, расходные ордера и отборы из ячеек
		ПредыдущийКонтрагент = Неопределено;
		ПредыдущаяВалюта = Неопределено;
		ПредыдущийРегион = Неопределено;
		ПерваяСтрокаДляПеремещения = Истина;
		ТЗТовары = СформироватьТаблицуДляСозданияРеализаций();
		//МассивСчетов = ПолучитьМассивСчетов(ТЗТовары);
		//Если МассивСчетов.Количество() > 1 Тогда
		//	Сообщить("В заявках на отгрузку содержаться разные счета на предоплату. Закрытие невозможно. Необходимо разбить заявку на транспортировку на разные заявки (чтобы в каждой был только один счет на предоплату)");
		//	Возврат Ложь;
		//КонецЕсли;
		ТЗВсехСерий = Продукция.Выгрузить(,"Номенклатура,Характеристика,ЗаказКлиента,Контрагент,Намотка,Город,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки,Серия,Мест,ЗаявкаНаОтгрузку,Паллет");
		ТЗВсехСерий.Колонки.Добавить("Списано");
		// Если Мест = 0, сразу поставим признак Списано, чтобы эта серия не подбиралась
		Для каждого Строка из ТЗВсехСерий Цикл
			Строка.Списано = Строка.Мест = 0;
		КонецЦикла;
		
		ЭтоСписание = ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя;
		ЭтоРеализацияСПеремещениемНаСкладХранения = ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения;
		ЭтоПеремещениеСоСкладаХранения = (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения);
		ЭтоРеализацияКлиентуЧерезСкладРегиона = ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона;
		ЭтоПеремещениеНаСкладХраненияДругойПлощадки = ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки;
		ЭтоПеремещениеСоСкладаХрененияДругойПлощадки = ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки;
		ЭтоРеализацияБезДенегСоСкладаХраненияДругойПлощадки = СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи И ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца;
		АктВыполненныхРаботСоздан = Ложь;
		Ответственный = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
		
		ЕстьПерепродажаСОрганизацииНаГрузоотправителя = Ложь;
		// Если грузополучателем выбран Окил для заказов или Окил для отгрузок, то это скорее всего пробники и отгружать будем на разные склады (в зависимости от регионов заказов)
		ОтгружаемНаРазныеСкладыВЗависимостиОтРегиона = НЕ ЭтоСписание
														И НЕ ЭтоПеремещениеНаСкладХраненияДругойПлощадки
														И НЕ ЭтоПеремещениеСоСкладаХрененияДругойПлощадки
														И НЕ СкладРегиона.ИспользоватьОрдернуюСхемуПриОтгрузке // при откгрузке на склад региона не нужно
														И СтрНайти(Контрагент.Наименование, "Окил для ") > 0;

		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения)
			И НЕ СозданНаОснованииПолученияГПИзПроизводства
			И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТЗТовары[0].Контрагент.Партнер, "Лико_РегистрироватьОтправкуДокументов", Ложь)
			Тогда
			МенеджерЗаписи = РегистрыСведений.Лико_РегистрацияОтправкиДокументов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ДатаОтгрузки;
			МенеджерЗаписи.Пакет = Ссылка;
			МенеджерЗаписи.Статус = Перечисления.Лико_СтатусыОтправкиДокументов.Создан;
			Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения Тогда
				МенеджерЗаписи.Контрагент = ТЗТовары[0].Контрагент;
			Иначе
				МенеджерЗаписи.Контрагент = ?(ЗначениеЗаполнено(КорректировкаГрузополучатель), КорректировкаГрузополучатель, ?(ЗначениеЗаполнено(ТЗТовары[0].Грузополучатель), ТЗТовары[0].Грузополучатель, ТЗТовары[0].Контрагент));
			КонецЕсли;
			МенеджерЗаписи.Ответственный = ОтпускПроизвел;
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				Отказ = Истина;
				Сообщить("" + Ссылка + ": не удалось добавить записи в Лико_РегистрацияОтправкиДокументов: " + ОписаниеОшибки());
				ОтменитьТранзакцию();
				ВызватьИсключение;
				Возврат Ложь
			КонецПопытки;			
		КонецЕсли;
		
		Если 
			НЕ ЭтоСписание
			И НЕ ЭтоПеремещениеСоСкладаХранения
			И ТЗТовары[0].ПлощадкаОрганизация <> ОрганизацияПродавецКлиенту
			И (ТЗТовары[0].ПлощадкаОрганизация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра
				ИЛИ НЕ (ТЗТовары[0].ПлощадкаОрганизация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра     // ОКИЛ продает товар Ликофлекса - перепродажу создавать не нужно
						И ОрганизацияПродавецКлиенту = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра)
				ИЛИ (ОрганизацияВладелецСкладаГП = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра               // ОКИЛ продает товар Линкс
						И ОрганизацияПродавецКлиенту = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра)
			)
			И НЕ ЭтоПеремещениеНаСкладХраненияДругойПлощадки
			И НЕ ЭтоПеремещениеСоСкладаХрененияДругойПлощадки
			И НЕ ЭтоРеализацияБезДенегСоСкладаХраненияДругойПлощадки
			И СкладГП.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион // Продают с ордерного склада региона, значит перепродажа между организациями уже сформирована (при отгрузке со склада производства)
			И НЕ (ОрганизацияВладелецСкладаГП = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра  // Для линкс ГП до 17 создавать не надо, если продает сам Линкс
					И ОрганизацияПродавецКлиенту = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра)
			Тогда
			
			ТоварыДляПередачи = ТЗТовары.Скопировать();
			ТоварыДляПередачи.Сортировать("Валюта");
			Для каждого Строка из ТоварыДляПередачи Цикл
				Если ПредыдущаяВалюта = Неопределено ИЛИ ПредыдущаяВалюта <> Строка.Валюта Тогда
					ОтборТиповыхДокументов = Новый Структура("Контрагент,Регион,Валюта", Справочники.Контрагенты.ПустаяСсылка(), Справочники.БизнесРегионы.ПустаяСсылка(), Строка.Валюта); 
					СтруктураТиповыхДокументовВалюта = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(, ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
					Если СтруктураТиповыхДокументовВалюта = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					
					Отбор = Новый Структура();
					Отбор.Вставить("Валюта", Строка.Валюта);
					ТоварыДляПередачиСОднойВалютой = ТоварыДляПередачи.Скопировать(Отбор);
					ДляКаждойОтгрузкиСвойДокумент = ТЗТовары[0].ПлощадкаОрганизация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра ИЛИ ОрганизацияВладелецСкладаГП = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра;
					НовыйДокументЛико_ПередачаТоваровМеждуОрганизациями = СоздатьДокументЛико_ПередачаТоваровМеждуОрганизациями(ТоварыДляПередачиСОднойВалютой, СтруктураТиповыхДокументовВалюта.Лико_ПередачаТоваровМеждуОрганизациями, ДляКаждойОтгрузкиСвойДокумент);
					Если НовыйДокументЛико_ПередачаТоваровМеждуОрганизациями = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
					НоваяСтрока.Документ = НовыйДокументЛико_ПередачаТоваровМеждуОрганизациями;
					НоваяСтрока.Валюта = Строка.Валюта;
					
					ЕстьПерепродажаСОрганизацииНаГрузоотправителя = Истина;
					
				КонецЕсли;
				ПредыдущаяВалюта = Строка.Валюта;
			КонецЦикла;
			ПредыдущаяВалюта = Неопределено;
		КонецЕсли;
		
		Для каждого Строка из ТЗТовары Цикл
			
			Если Строка.СоздаватьДокументыРеализацииВТранспортномМодуле Тогда
				
				//Если ПредыдущийКонтрагент = Неопределено ИЛИ Строка.Грузополучатель <> ПредыдущийКонтрагент ИЛИ ПредыдущаяВалюта = Неопределено ИЛИ Строка.Валюта <> ПредыдущаяВалюта ИЛИ Строка.Регион <> ПредыдущийРегион Тогда
				Если ПредыдущийКонтрагент = Неопределено ИЛИ Строка.Грузополучатель <> ПредыдущийКонтрагент ИЛИ ПредыдущаяВалюта = Неопределено ИЛИ Строка.Валюта <> ПредыдущаяВалюта Тогда
					
					ОтборТиповыхДокументов = Новый Структура("Контрагент,Валюта,Регион", Строка.Грузополучатель, Строка.Валюта, Строка.Регион); 
					СтруктураТиповыхДокументовКонтрагентВалютаРегион = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(, ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
					Если СтруктураТиповыхДокументовКонтрагентВалютаРегион = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					
					Отбор = Новый Структура();
					Отбор.Вставить("Грузополучатель", Строка.Грузополучатель);
					Отбор.Вставить("Валюта", Строка.Валюта);
					//Отбор.Вставить("Регион", Строка.Регион);
					ТоварыВРеализацию = ТЗТовары.Скопировать(Отбор);
					ТаблицаСерий = СформироватьТаблицуСерий(ТоварыВРеализацию, ТЗВсехСерий);
					СтрокаКолонокДляГруппировки = "";
					Для каждого Колонка из ТоварыВРеализацию.Колонки Цикл
						Если Колонка.Имя = "КодЭтикеткиЗаказчика" ИЛИ Колонка.Имя = "ЧестныйЗнак" ИЛИ Колонка.Имя = "НомерПоставки" ИЛИ Колонка.Имя = "Намотка" ИЛИ Колонка.Имя = "Город" ИЛИ Колонка.Имя = "КоличествоОтгружено" ИЛИ Колонка.Имя = "Мест" ИЛИ Колонка.Имя = "НомерСтрокиВЗаявкеНаОтгрузку" ИЛИ Колонка.Имя = "ЗаявкаНаОтгрузку" ИЛИ Колонка.Имя = "НомерСтрокиВЗаказеКлиента" Тогда   
							Продолжить;
						Иначе
							СтрокаКолонокДляГруппировки = СтрокаКолонокДляГруппировки + Колонка.Имя + ",";
						КонецЕсли;
					КонецЦикла;
					СтрокаКолонокДляГруппировки = Лев(СтрокаКолонокДляГруппировки, СтрДлина(СтрокаКолонокДляГруппировки) - 1);
					ТоварыВРеализацию.Свернуть(СтрокаКолонокДляГруппировки, "КоличествоОтгружено,Мест");
					Если НЕ ЭтоПеремещениеСоСкладаХранения Тогда
						СчетНаОплату = Неопределено;
						
						Если ЭтоРеализацияКлиентуЧерезСкладРегиона Тогда
							//Создаем документ "Перемещение товаров" со СкладГП на СкладРегиона
							НовыйДокументПеремещениеТоваров = СоздатьДокументПеремещениеТоваров(ТоварыВРеализацию, СтруктураТиповыхДокументовКонтрагентВалютаРегион.ПеремещениеТоваров, СкладРегиона, ?(ЕстьПерепродажаСОрганизацииНаГрузоотправителя, ОрганизацияПродавецКлиенту, Организация));
							Если НовыйДокументПеремещениеТоваров = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;
							НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
							НоваяСтрока.Документ = НовыйДокументПеремещениеТоваров;
							НоваяСтрока.Контрагент = Строка.Грузополучатель;
							НоваяСтрока.Валюта = Строка.Валюта;
							НоваяСтрока.Регион = Строка.Регион;
						КонецЕсли;						
						
						// Получим массив счетов для этой реализации
						МассивСчетовНаОплату = ПолучитьМассивСчетов(ТоварыВРеализацию);
						
						// Создаем реализацию
						ЕстьРеализации = Истина;
						НовыйДокументРеализацияТоваровУслуг = СоздатьДокументРеализацияТоваровУслуг(СтруктураТиповыхДокументовКонтрагентВалютаРегион.РеализацияТоваровУслуг, ТоварыВРеализацию, МассивСчетовНаОплату, ?(ЭтоРеализацияКлиентуЧерезСкладРегиона, СкладРегиона, СкладГП));
						Если НовыйДокументРеализацияТоваровУслуг = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументРеализацияТоваровУслуг;
						НоваяСтрока.Контрагент = Строка.Грузополучатель;
						НоваяСтрока.Валюта = Строка.Валюта;
						НоваяСтрока.Регион = Строка.Регион;
						
						НовыйДокументАктВыполненныхРабот = Неопределено;
						Если НЕ АктВыполненныхРаботСоздан И ЗначениеЗаполнено(Строка.ЗаявкаНаОтгрузку) И Строка.ЗаявкаНаОтгрузку.Услуги.Количество() > 0 Тогда
							
							Если ПоЗаявкеНаОтгрузкуУжеЕстьЗакрытаяЗаявкаНаТранспортировку(Строка.ЗаявкаНаОтгрузку) Тогда
								АктВыполненныхРаботСоздан = Истина;
							Иначе
								// Создаем акт выполненных работ
								НовыйДокументАктВыполненныхРабот = СоздатьДокументАктВыполненныхРабот(СтруктураТиповыхДокументовКонтрагентВалютаРегион.АктВыполненныхРабот, НовыйДокументРеализацияТоваровУслуг, Строка.ЗаявкаНаОтгрузку);
								Если НовыйДокументАктВыполненныхРабот = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументАктВыполненныхРабот;
								НоваяСтрока.Контрагент = Строка.Грузополучатель;
								НоваяСтрока.Валюта = Строка.Валюта;
								НоваяСтрока.Регион = Строка.Регион;
								
								АктВыполненныхРаботСоздан = Истина;
							КонецЕсли;
							
						КонецЕсли;
						
						// Привязываем оплаты по счетам к реализации
						//ПривязатьОплатыКРеализации(МассивСчетовНаОплату, НовыйДокументРеализацияТоваровУслуг);
						
						Если МассивСчетовНаОплату.Количество() > 0 Тогда
							// Нужно провести реализацию в статусе "Отгружен"
							Результат = Лико_Дополнительно.ПровестиДокументВДругомСтатусе(НовыйДокументРеализацияТоваровУслуг, Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено);
							Если НЕ Результат Тогда
								Возврат Ложь;
							КонецЕсли;
						КонецЕсли;
						
						//Создаем транспортную накладную
						НовыйДокументТраспортнаяНакладная = СоздатьДокументТраспортнаяНакладная(СтруктураТиповыхДокументовКонтрагентВалютаРегион.ТранспортнаяНакладная, НовыйДокументРеализацияТоваровУслуг, ТаблицаСерий);
						Если НовыйДокументТраспортнаяНакладная = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументТраспортнаяНакладная;
						НоваяСтрока.Контрагент = Строка.Грузополучатель;
						НоваяСтрока.Валюта = Строка.Валюта;
						НоваяСтрока.Регион = Строка.Регион;
						
						// Создаем счет-фактуру
						НовыйДокументСчетФактураВыданный = СоздатьДокументСчетФактураВыданный(СтруктураТиповыхДокументовКонтрагентВалютаРегион.СчетФактураВыданный, НовыйДокументРеализацияТоваровУслуг, НовыйДокументАктВыполненныхРабот);
						Если НовыйДокументСчетФактураВыданный = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументСчетФактураВыданный;
						НоваяСтрока.Контрагент = Строка.Грузополучатель;
						НоваяСтрока.Валюта = Строка.Валюта;
						НоваяСтрока.Регион = Строка.Регион;
						
						// Создадим расходный ордер
						НовыйДокументРасходныйОрдерНаТовары = Лико_Дополнительно.СоздатьДокументРасходныйОрдерНаТоварыНаОснованииРаспоряжения(СтруктураТиповыхДокументовКонтрагентВалютаРегион.РасходныйОрдерНаТовары, ТаблицаСерий, ?(ЭтоРеализацияКлиентуЧерезСкладРегиона, НовыйДокументПеремещениеТоваров, НовыйДокументРеализацияТоваровУслуг));
						Если НовыйДокументРасходныйОрдерНаТовары = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументРасходныйОрдерНаТовары;
						НоваяСтрока.Контрагент = Строка.Грузополучатель;
						НоваяСтрока.Валюта = Строка.Валюта;
						НоваяСтрока.Регион = Строка.Регион;
						
						Если СкладГП.ИспользоватьАдресноеХранение Тогда
							// Создадим отбор товаров
							НовыйДокументОтборРазмещениеТоваров_Отбор = Лико_Дополнительно.СоздатьДокументОтборРазмещениеТоваровНаОснованииРасходногоОрдера(НовыйДокументРасходныйОрдерНаТовары, СтруктураТиповыхДокументовКонтрагентВалютаРегион.ОтборРазмещениеТоваров_Отбор, Ложь, Истина); 
							Если НовыйДокументОтборРазмещениеТоваров_Отбор = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;
							НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
							НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Отбор;
							НоваяСтрока.Контрагент = Строка.Грузополучатель;
							НоваяСтрока.Валюта = Строка.Валюта;
							НоваяСтрока.Регион = Строка.Регион;
						КонецЕсли;
						
						Если СкладГП.ИспользоватьОрдернуюСхемуПриОтгрузке И СкладГП.ИспользоватьАдресноеХранение Тогда
							//Проводим документ "Расходный ордер" в статусе "Отгружен"
							Результат = Лико_Дополнительно.ПровестиДокументВДругомСтатусе(НовыйДокументРасходныйОрдерНаТовары, Перечисления.СтатусыРасходныхОрдеров.Отгружен);
							Если НЕ Результат Тогда
								Возврат Ложь;
							КонецЕсли;
						КонецЕсли;
						
						// Создаем счет на оплату клиенту
						Если МассивСчетовНаОплату.Количество() = 0 Тогда
							Если ЗначениеЗаполнено(НовыйДокументАктВыполненныхРабот) Тогда
								// Нужно создать счет на предоплату, т.к. есть услуги
								НовыйДокументСчетНаОплатуКлиенту = СоздатьДокументЛико_СчетНаОплатуКлиенту(СтруктураТиповыхДокументовКонтрагентВалютаРегион.Лико_СчетНаОплатуКлиенту, НовыйДокументРеализацияТоваровУслуг, НовыйДокументАктВыполненныхРабот);
							Иначе
								НовыйДокументСчетНаОплатуКлиенту = СоздатьДокументСчетНаОплатуКлиенту(СтруктураТиповыхДокументовКонтрагентВалютаРегион.СчетНаОплатуКлиенту, НовыйДокументРеализацияТоваровУслуг);
							КонецЕсли;
							Если НовыйДокументСчетНаОплатуКлиенту = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;
							НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
							НоваяСтрока.Документ = НовыйДокументСчетНаОплатуКлиенту;
							НоваяСтрока.Контрагент = Строка.Грузополучатель;
							НоваяСтрока.Валюта = Строка.Валюта;
							НоваяСтрока.Регион = Строка.Регион;
						КонецЕсли;
						
						Если ЭтоРеализацияСПеремещениемНаСкладХранения Тогда
							// Создаем документ "Приемка товаров на хранение"
							НовыйДокументПриемкаТоваровНаХранение = СоздатьДокументПриемкаТоваровНаХранение(НовыйДокументРеализацияТоваровУслуг, СтруктураТиповыхДокументовКонтрагентВалютаРегион.ПриемкаТоваровНаХранение); 
							Если НовыйДокументПриемкаТоваровНаХранение = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;
							НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
							НоваяСтрока.Документ = НовыйДокументПриемкаТоваровНаХранение;
							НоваяСтрока.Контрагент = Строка.Грузополучатель;
							НоваяСтрока.Валюта = Строка.Валюта;
							НоваяСтрока.Регион = Строка.Регион;
							
							Если СкладРегиона.ИспользоватьОрдернуюСхемуПриПоступлении Тогда
								// Создаем документ "Приходный ордер" на склад хранения
								НовыйДокументПриходныйОрдерНаТовары_НаСкладХранения = Лико_Дополнительно.СоздатьДокументПриходныйОрдерНаТоварыНаОснованииРаспоряжения(НовыйДокументПриемкаТоваровНаХранение, СтруктураТиповыхДокументовКонтрагентВалютаРегион.ПриходныйОрдерНаТовары, ТаблицаСерий); 
								Если НовыйДокументПриходныйОрдерНаТовары_НаСкладХранения = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументПриходныйОрдерНаТовары_НаСкладХранения;
								НоваяСтрока.Контрагент = Строка.Грузополучатель;
								НоваяСтрока.Валюта = Строка.Валюта;
								НоваяСтрока.Регион = Строка.Регион;
							
								Если СкладРегиона.ИспользоватьАдресноеХранение Тогда
									// Создаем документ "Отбор размещение товаров" в ячейку склада хранения
									ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладРегиона, "ЯчейкаХранениеПоУмолчанию");
									НовыйДокументОтборРазмещениеТоваров_Размещение = Лико_Дополнительно.СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(НовыйДокументПриходныйОрдерНаТовары_НаСкладХранения, СтруктураТиповыхДокументовКонтрагентВалютаРегион.ОтборРазмещениеТоваров_Размещение, ЯчейкаПолучатель); 
									Если НовыйДокументОтборРазмещениеТоваров_Размещение = Неопределено Тогда
										Возврат Ложь;
									КонецЕсли;
									НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
									НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Размещение;
									НоваяСтрока.Контрагент = Строка.Грузополучатель;
									НоваяСтрока.Валюта = Строка.Валюта;
									НоваяСтрока.Регион = Строка.Регион;
									
									// Добавим записи в регистр Адресное хранение
									//Для каждого СтрокаСерии из ТаблицаСерий Цикл
									//	Движение = Движения.Лико_АдресноеХранение.Добавить();
									//	Движение.Период = ДатаОтгрузки;
									//	Движение.Регистратор = Ссылка;
									//	Движение.Серия = СтрокаСерии.Серия;
									//	Движение.Паллет = Неопределено;
									//	Движение.Ячейка = ЯчейкаПолучатель;
									//	Движение.ВыбылСоСклада = Ложь;
									//КонецЦикла;
								КонецЕсли;
							КонецЕсли;
							
							// --> Начало Лико Ефимов ЕВВ 24.01.2023
							ТекКонтрагент = НовыйДокументПриемкаТоваровНаХранение.Контрагент;
							Для каждого ТекСтрокаТаблицыСерий из ТаблицаСерий Цикл
								//Если ТекСтрокаТаблицыСерий.Серия.Лико_КонтрагентВладелецТовара <> ТекКонтрагент Тогда
								ТекСерияОбъект = ТекСтрокаТаблицыСерий.Серия.ПолучитьОбъект();
								ТекСерияОбъект.Лико_КонтрагентВладелецТовара = ТекКонтрагент;
								ТекСерияОбъект.ОбменДанными.Загрузка = Истина;
								Попытка
									ТекСерияОбъект.Записать();
								Исключение
									Отказ = Истина;
									Сообщить("Серию """ + ТекСерияОбъект + """ не удалось записать! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
									ОтменитьТранзакцию();
									ВызватьИсключение;
								КонецПопытки;
								//КонецЕсли;
							КонецЦикла;																		
							// <-- Конец Лико Ефимов ЕВВ 24.01.2023
						КонецЕсли;
						
						Если СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи Тогда
							// Создаем документ "Отгрузка товаров с хранения"
							НовыйДокументОтгрузкаТоваровСХранения = СоздатьДокументОтгрузкаТоваровСХранения(СтруктураТиповыхДокументовКонтрагентВалютаРегион.ОтгрузкаТоваровСХранения, ТоварыВРеализацию); 
							Если НовыйДокументОтгрузкаТоваровСХранения = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;
							НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
							НоваяСтрока.Документ = НовыйДокументОтгрузкаТоваровСХранения;
							НоваяСтрока.Контрагент = Строка.Грузополучатель;
							НоваяСтрока.Валюта = Строка.Валюта;
							НоваяСтрока.Регион = Строка.Регион;
						КонецЕсли;
						
					Иначе
						// Создаем документ "Отгрузка товаров с хранения"
						НовыйДокументОтгрузкаТоваровСХранения = СоздатьДокументОтгрузкаТоваровСХранения(СтруктураТиповыхДокументовКонтрагентВалютаРегион.ОтгрузкаТоваровСХранения, ТоварыВРеализацию); 
						Если НовыйДокументОтгрузкаТоваровСХранения = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументОтгрузкаТоваровСХранения;
						НоваяСтрока.Контрагент = Строка.Грузополучатель;
						НоваяСтрока.Валюта = Строка.Валюта;
						НоваяСтрока.Регион = Строка.Регион;
						
						// --> Начало Лико Ефимов ЕВВ 24.01.2023
						// Проверим, что все коробки соответствуют контрагенту
						ТекКонтрагент = НовыйДокументОтгрузкаТоваровСХранения.Контрагент;
						Для каждого ТекСтрокаТаблицыСерий из ТаблицаСерий Цикл
							Если ТекСтрокаТаблицыСерий.Серия.Лико_КонтрагентВладелецТовара <> ТекКонтрагент Тогда
								Отказ = Истина;
								Сообщить("Серия """ + ТекСтрокаТаблицыСерий.Серия + """ принадлежит контрагенту """ + ТекСтрокаТаблицыСерий.Серия.Лико_КонтрагентВладелецТовара + """, поэтому ее нельзя отгрузить контрагенту """ + ТекКонтрагент + """");
							КонецЕсли;
						КонецЦикла;
						Если Отказ Тогда
							Возврат Ложь;
						КонецЕсли;
						// <-- Конец Лико Ефимов ЕВВ 24.01.2023
						
						//Создаем транспортную накладную
						НовыйДокументТраспортнаяНакладная = СоздатьДокументТраспортнаяНакладная(СтруктураТиповыхДокументовКонтрагентВалютаРегион.ТранспортнаяНакладная, НовыйДокументОтгрузкаТоваровСХранения, ТаблицаСерий);
						Если НовыйДокументТраспортнаяНакладная = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументТраспортнаяНакладная;
						НоваяСтрока.Контрагент = Строка.Грузополучатель;
						НоваяСтрока.Валюта = Строка.Валюта;
						НоваяСтрока.Регион = Строка.Регион;
						
						// Создаем документ "Расходный ордер" со склада хранения
						НовыйДокументРасходныйОрдерНаТовары = Лико_Дополнительно.СоздатьДокументРасходныйОрдерНаТоварыНаОснованииРаспоряжения(СтруктураТиповыхДокументовКонтрагентВалютаРегион.РасходныйОрдерНаТовары, ТаблицаСерий, НовыйДокументОтгрузкаТоваровСХранения);
						Если НовыйДокументРасходныйОрдерНаТовары = Неопределено Тогда
							Возврат Ложь;
						КонецЕсли;
						НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
						НоваяСтрока.Документ = НовыйДокументРасходныйОрдерНаТовары;
						НоваяСтрока.Контрагент = Строка.Грузополучатель;
						НоваяСтрока.Валюта = Строка.Валюта;
						НоваяСтрока.Регион = Строка.Регион;
						
						Если СкладГП.ИспользоватьАдресноеХранение Тогда
							// Создаем документ "Отбор размещение товаров" из ячейки склада хранения
							НовыйДокументОтборРазмещениеТоваров_Отбор = Лико_Дополнительно.СоздатьДокументОтборРазмещениеТоваровНаОснованииРасходногоОрдера(НовыйДокументРасходныйОрдерНаТовары, СтруктураТиповыхДокументовКонтрагентВалютаРегион.ОтборРазмещениеТоваров_Отбор, Ложь, Истина); 
							Если НовыйДокументОтборРазмещениеТоваров_Отбор = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;
							НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
							НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Отбор;
							НоваяСтрока.Контрагент = Строка.Грузополучатель;
							НоваяСтрока.Валюта = Строка.Валюта;
							НоваяСтрока.Регион = Строка.Регион;
						КонецЕсли;
						
						Если СкладГП.ИспользоватьОрдернуюСхемуПриОтгрузке И СкладГП.ИспользоватьАдресноеХранение Тогда
							//Проводим документ "Расходный ордер" в статусе "Отгружен"
							Результат = Лико_Дополнительно.ПровестиДокументВДругомСтатусе(НовыйДокументРасходныйОрдерНаТовары, Перечисления.СтатусыРасходныхОрдеров.Отгружен);
							Если НЕ Результат Тогда
								Возврат Ложь;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
			Иначе				
				// Для всех остальных строк не нужно создавать реализации. Если заполнен склад региона, то раскидаем эти строки по складам, соответствующим регионам, которые выбраны в заказе клиента
				ТекущийСклад = СкладРегиона;
				Если ЭтоСписание Тогда
					ТекущийСклад = СкладГП;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекущийСклад) Тогда
					
					Если ПерваяСтрокаДляПеремещения ИЛИ ПредыдущийРегион <> Строка.Регион Тогда
						ПерваяСтрокаДляПеремещения = Ложь;
						
						Если ОтгружаемНаРазныеСкладыВЗависимостиОтРегиона Тогда
							ТекущийСклад = Лико_Дополнительно.НайтиСкладРегиона(Строка.Регион);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ТекущийСклад) И (ТекущийСклад <> СкладГП ИЛИ ЭтоСписание) Тогда
							ОтборТиповыхДокументов = Новый Структура("Регион,Контрагент,Валюта", Строка.Регион, Справочники.Контрагенты.ПустаяСсылка(), Справочники.Валюты.ПустаяСсылка()); 
							СтруктураТиповыхДокументовРегион = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(, ОтборТиповыхДокументов, КлючиСтруктуры, Ссылка, Ложь);
							Если СтруктураТиповыхДокументовРегион = Неопределено Тогда
								Возврат Ложь;
							КонецЕсли;
							
							Отбор = Новый Структура();
							Отбор.Вставить("СоздаватьДокументыРеализацииВТранспортномМодуле", Ложь);
							Отбор.Вставить("Регион", Строка.Регион);
							ТоварыВПеремещение = ТЗТовары.Скопировать(Отбор);
							ТаблицаСерий = СформироватьТаблицуСерий(ТоварыВПеремещение, ТЗВсехСерий);
							
							Если ЭтоСписание Тогда
								// Создаем списание товаров на доп. расходы
								СтруктураПараметров = Новый Структура("Склад,Организация,ЭтоСписаниеСПроизводителя,Дата,Ответственный,Основание", СкладГП, ТоварыВПеремещение[0].ПлощадкаОрганизация, Истина, ДатаОтгрузки, Ответственный, Ссылка);
								Если СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион Тогда
									СтруктураПараметров.Организация = ОрганизацияВладелецСкладаГП;
									Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
										СтруктураПараметров.Организация = Лико_Дополнительно.ОпределитьОрганизациюВладельцаТовара(ТоварыВПеремещение[0].Номенклатура, ТоварыВПеремещение[0].Характеристика, СкладГП, ДатаОтгрузки, СтруктураТиповыхДокументовРегион.ВнутреннееПотребление);
									КонецЕсли;
									СтруктураПараметров.ЭтоСписаниеСПроизводителя = Ложь; 
								ИначеЕсли ЗначениеЗаполнено(ОрганизацияВладелецСкладаГП) И Организация <> ОрганизацияВладелецСкладаГП Тогда
									СтруктураПараметров.Организация = ОрганизацияВладелецСкладаГП;
								КонецЕсли;
								НовыйДокументВнутреннееПотребление = Лико_Дополнительно.СоздатьДокументВнутреннееПотребление(ТоварыВПеремещение, СтруктураТиповыхДокументовРегион.ВнутреннееПотребление, СтруктураПараметров);
								Если НовыйДокументВнутреннееПотребление = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументВнутреннееПотребление;
								НоваяСтрока.Регион = Строка.Регион;
							Иначе
								//Создаем документ "Перемещение товаров" со СкладГП на СкладРегиона
								Если ЕстьПерепродажаСОрганизацииНаГрузоотправителя Тогда
									ОрганизацияДляПеремещения = ОрганизацияПродавецКлиенту;
								//ИначеЕсли ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения Тогда
								//	ОрганизацияДляПеремещения = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладГП, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
								ИначеЕсли ЗначениеЗаполнено(ОрганизацияВладелецСкладаГП) Тогда
									ОрганизацияДляПеремещения = ОрганизацияВладелецСкладаГП;
								Иначе
									ОрганизацияДляПеремещения = Организация;
								КонецЕсли;	
								НовыйДокументПеремещениеТоваров = СоздатьДокументПеремещениеТоваров(ТоварыВПеремещение, СтруктураТиповыхДокументовРегион.ПеремещениеТоваров, ТекущийСклад, ОрганизацияДляПеремещения, ЭтоПеремещениеНаСкладХраненияДругойПлощадки ИЛИ ЭтоПеремещениеСоСкладаХрененияДругойПлощадки ИЛИ ЭтоРеализацияБезДенегСоСкладаХраненияДругойПлощадки);
								Если НовыйДокументПеремещениеТоваров = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументПеремещениеТоваров;
								НоваяСтрока.Регион = Строка.Регион;
								
								Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца Тогда
									// Создаем списание товаров на доп. расходы
									СтруктураПараметров = Новый Структура("Склад,Организация,ЭтоСписаниеСПроизводителя,Дата,Ответственный,Основание", ТекущийСклад, ОрганизацияПродавецКлиенту, Ложь, ДатаОтгрузки, Ответственный, Ссылка);
									НовыйДокументВнутреннееПотребление = Лико_Дополнительно.СоздатьДокументВнутреннееПотребление(ТоварыВПеремещение, СтруктураТиповыхДокументовРегион.ВнутреннееПотребление, СтруктураПараметров);
									Если НовыйДокументВнутреннееПотребление = Неопределено Тогда
										Возврат Ложь;
									КонецЕсли;
									НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
									НоваяСтрока.Документ = НовыйДокументВнутреннееПотребление;
									НоваяСтрока.Регион = Строка.Регион;
								КонецЕсли;
							КонецЕсли;
							
							//Создаем транспортную накладную
							Если НЕ ЭтоСписание Тогда
								НовыйДокументТраспортнаяНакладная = СоздатьДокументТраспортнаяНакладная(СтруктураТиповыхДокументовРегион.ТранспортнаяНакладная, НовыйДокументПеремещениеТоваров, ТаблицаСерий);
								Если НовыйДокументТраспортнаяНакладная = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								// <-- Начало Лико Яцун С. В. 28.02.2023
								// Проверим, что все коробки соответствуют контрагенту
								Если ЭтоПеремещениеСоСкладаХранения Тогда
									ТекКонтрагентВладелецТовара = НовыйДокументТраспортнаяНакладная.Плательщик;
									Для каждого ТекСтрокаТаблицыСерий из ТаблицаСерий Цикл
										Если ТекСтрокаТаблицыСерий.Серия.Лико_КонтрагентВладелецТовара <> ТекКонтрагентВладелецТовара Тогда
											Отказ = Истина;
											Сообщить("Серия """ + ТекСтрокаТаблицыСерий.Серия + """ принадлежит контрагенту """ + ТекСтрокаТаблицыСерий.Серия.Лико_КонтрагентВладелецТовара + """, поэтому ее нельзя отгрузить контрагенту """ + ТекКонтрагентВладелецТовара + """");
										КонецЕсли;
									КонецЦикла;
									Если Отказ Тогда
										Возврат Ложь;
									КонецЕсли;
								КонецЕсли;
								// <-- Конец Лико Яцун С. В. 28.02.2023
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументТраспортнаяНакладная;
								НоваяСтрока.Регион = Строка.Регион;
							КонецЕсли;
							
							Если СкладГП.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
								//Создаем документ "Расходный ордер" в статусе "К отбору" (для адресных сладов) или "Отгружен" (для остальных)
								Если ЭтоСписание Тогда
									НовыйДокументРасходныйОрдерНаТовары_ДляПеремещения = Лико_Дополнительно.СоздатьДокументРасходныйОрдерНаТоварыНаОснованииРаспоряжения(СтруктураТиповыхДокументовРегион.РасходныйОрдерНаТовары, ТаблицаСерий, НовыйДокументВнутреннееПотребление);
								Иначе
									НовыйДокументРасходныйОрдерНаТовары_ДляПеремещения = Лико_Дополнительно.СоздатьДокументРасходныйОрдерНаТоварыНаОснованииРаспоряжения(СтруктураТиповыхДокументовРегион.РасходныйОрдерНаТовары, ТаблицаСерий, НовыйДокументПеремещениеТоваров);
								КонецЕсли;
								Если НовыйДокументРасходныйОрдерНаТовары_ДляПеремещения = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументРасходныйОрдерНаТовары_ДляПеремещения;
								НоваяСтрока.Регион = Строка.Регион;
							КонецЕсли;
							
							Если СкладГП.ИспользоватьАдресноеХранение Тогда
								//Создаем документ "Отбор товаров"
								НовыйДокументОтборРазмещениеТоваров_Отбор_ДляПеремещения = Лико_Дополнительно.СоздатьДокументОтборРазмещениеТоваровНаОснованииРасходногоОрдера(НовыйДокументРасходныйОрдерНаТовары_ДляПеремещения, СтруктураТиповыхДокументовРегион.ОтборРазмещениеТоваров_Отбор, Ложь, Истина); 
								Если НовыйДокументОтборРазмещениеТоваров_Отбор_ДляПеремещения = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Отбор_ДляПеремещения;
								НоваяСтрока.Регион = Строка.Регион;
							КонецЕсли;
							
							Если СкладГП.ИспользоватьОрдернуюСхемуПриОтгрузке И СкладГП.ИспользоватьАдресноеХранение Тогда
								//Проводим документ "Расходный ордер" в статусе "Отгружен"
								Результат = Лико_Дополнительно.ПровестиДокументВДругомСтатусе(НовыйДокументРасходныйОрдерНаТовары_ДляПеремещения, Перечисления.СтатусыРасходныхОрдеров.Отгружен);
								Если НЕ Результат Тогда
									Возврат Ложь;
								КонецЕсли;
							КонецЕсли;
							
							Если ТекущийСклад.ИспользоватьОрдернуюСхемуПриПоступлении И НЕ ЭтоСписание Тогда
								//Создаем документ "Приходный ордер"
								НовыйДокументПриходныйОрдерНаТовары_ДляПеремещения = Лико_Дополнительно.СоздатьДокументПриходныйОрдерНаТоварыНаОснованииРаспоряжения(НовыйДокументПеремещениеТоваров, СтруктураТиповыхДокументовРегион.ПриходныйОрдерНаТовары, ТаблицаСерий); 
								Если НовыйДокументПриходныйОрдерНаТовары_ДляПеремещения = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументПриходныйОрдерНаТовары_ДляПеремещения;
								НоваяСтрока.Регион = Строка.Регион;
								
							КонецЕсли;
							
							// <-- Начало Лико Яцун С. В. 02.03.2023 
							Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения Тогда
								// Создаем документ "Отбор размещение товаров" в ячейку склада хранения
								ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладРегиона, "ЯчейкаХранениеПоУмолчанию");
								НовыйДокументОтборРазмещениеТоваров_Размещение = Лико_Дополнительно.СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(НовыйДокументПриходныйОрдерНаТовары_ДляПеремещения, СтруктураТиповыхДокументовРегион.ОтборРазмещениеТоваров_Размещение, ЯчейкаПолучатель); 
								Если НовыйДокументОтборРазмещениеТоваров_Размещение = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Размещение;
								НоваяСтрока.Регион = Строка.Регион;
							КонецЕсли;
							// <-- Конец Лико Яцун С. В. 02.03.2023
							
							Если ЭтоПеремещениеНаСкладХраненияДругойПлощадки Тогда
								// Создаем приемку товаров на отв. хранение
								НовыйДокументПриемкаТоваровНаХранение = СоздатьДокументПриемкаТоваровНаХранение(НовыйДокументПеремещениеТоваров, СтруктураТиповыхДокументовРегион.ПриемкаТоваровНаХранение); 
								Если НовыйДокументПриемкаТоваровНаХранение = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументПриемкаТоваровНаХранение;
								НоваяСтрока.Регион = Строка.Регион;
							КонецЕсли;
							
							Если ЭтоПеремещениеСоСкладаХрененияДругойПлощадки
								ИЛИ ЭтоРеализацияБезДенегСоСкладаХраненияДругойПлощадки
								Тогда
								// Создаем отгрузку товаров с отв. хранения
								НовыйДокументОтгрузкаТоваровСХранения = СоздатьДокументОтгрузкаТоваровСХранения(СтруктураТиповыхДокументовРегион.ОтгрузкаТоваровСХранения, Неопределено, НовыйДокументПеремещениеТоваров); 
								Если НовыйДокументОтгрузкаТоваровСХранения = Неопределено Тогда
									Возврат Ложь;
								КонецЕсли;
								НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
								НоваяСтрока.Документ = НовыйДокументОтгрузкаТоваровСХранения;
								НоваяСтрока.Регион = Строка.Регион;
								
							КонецЕсли;
							
						Иначе
							Если ТекущийСклад = Неопределено Тогда
								Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Для региона """ + Строка.Регион + """ не найден склад. Перемещение не создано. Транзакция по созданию типовых документов отменена.");
								Возврат Ложь;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			ПредыдущийКонтрагент = Строка.Грузополучатель;
			ПредыдущаяВалюта = Строка.Валюта;
			ПредыдущийРегион = Строка.Регион;
		КонецЦикла;
		
	КонецЕсли;
	
	// Запишем типовые документы в регистр Лико_СвязиСТиповымиДокументами
	Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	// Если были созданы реализации, запустим фоновое задание по распределению расчетов с клиентами (в транзакции оно скорее всего не выполнилось из-за блокировок)
	Если ЕстьРеализации Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ТекущаяДата());
		МассивПараметров.Добавить(Неопределено);
		//ОбщегоНазначения.ВыполнитьМетодКонфигурации("РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами", МассивПараметров);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПоЗаявкеНаОтгрузкуУжеЕстьЗакрытаяЗаявкаНаТранспортировку(ЗаявкаНаОтгрузку)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
	|ГДЕ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Проведен
	|	И НЕ Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ПометкаУдаления
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаявокНаТранспортировку.Закрыт)
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Ссылка <> &Ссылка
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Мест <> 0
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.ЗаявкаНаОтгрузку = &ЗаявкаНаОтгрузку
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ДатаОтгрузки <= &ДатаОтгрузки";
	
	Запрос.УстановитьПараметр("ЗаявкаНаОтгрузку", ЗаявкаНаОтгрузку);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция СоздатьДокументОтборРазмещениеТоваров(УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	
	// Если документ уже создан, будет все сложнее. Кладовщик к этому времени уже мог что-то в него насканировать.
	// Для начала проверим, есть ли в документе размещенные (отсканированные) коробки. Если нет, то просто перезаполним его также, как и для нового докумнета.
	// Если размещенные коробки уже есть, то нельзя допустить, чтобы они пропали из документа - в этом случае будем отменять тразнакцию
	// (пусть руками открывают документ и убирают в нем эти коробки сами, а после этого записывают заявку).
	
	// Также интересна ситуация, когда документ просто перезаписывается и никакие данные не меняются. Статус документа ОтборРазмещениеТоваров менять в этом случае не нужно,
	// да и вообще записывать его лишний раз ни к чему. А если хотя бы какие-то данные поменялись, будем ставить статус "Подготовлено" и записывать документ.
	// Сравнивать будем табличные части заново заполненного (но еще не записанного) документа ОтборРазмещениеТоваров со старыми ТЧ этого же документа (выгрузим их перед перезаполнением)
	
	// Для регионов же (если в складе стоит Истина у доп. реквизита Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку", СкладГП)
	// места операторы будут ставить в заявке руками, а в отбор вообще заходить не будут. Поэтому будем при записи заявки места всегда ставить из документа,
	// а что там стоит в отборе вообще проверять не будем
	
	Если ДополнительныеСвойства.Свойство("ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку") И ДополнительныеСвойства.ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку Тогда
		ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку = Истина;
	Иначе
		ЗначениеДопРеквизита = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку", СкладГП);
		ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку = ?(ЗначениеДопРеквизита = Неопределено, Ложь, ЗначениеДопРеквизита);
	КонецЕсли;
	ЗонаОтгрузки = Лико_Дополнительно.ПолучитьЗонуОтгрузкиПоСкладу(СкладГП);
	ЗаякаЗакрыта = Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт;
	
	Если УжеСозданныйДокумент = Неопределено ИЛИ УжеСозданныйДокумент.ТоварыРазмещение.Итог("КоличествоУпаковокРазмещено") = 0 ИЛИ ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку Тогда
		
		НовыйДокОбъект = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
		НовыйДокОбъект.Дата = ДатаПроведенияПоАдресномуСкладу;
		НовыйДокОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение;
		НовыйДокОбъект.ДатаНачалаВыполнения = ДатаПроведенияПоАдресномуСкладу;
		НовыйДокОбъект.ДатаОкончанияВыполнения = ДатаПроведенияПоАдресномуСкладу;
		НовыйДокОбъект.Ответственный = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
		НовыйДокОбъект.Склад = СкладГП;
		НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
		
		//ПредыдущийВид = Неопределено;
		//ПредыдущаяУпаковка = Неопределено;
		УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
		Для каждого Строка из Продукция Цикл
			Если ЗаякаЗакрыта И Строка.Мест = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаОтбор = НовыйДокОбъект.ТоварыОтбор.Добавить();
			НоваяСтрокаОтбор.Количество = Строка.Серия.Лико_КоличествоВУпаковке;
			НоваяСтрокаОтбор.КоличествоУпаковок = НоваяСтрокаОтбор.Количество;
			НоваяСтрокаОтбор.Номенклатура = Строка.Номенклатура;
			//Если ПредыдущийВид = НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры Тогда
			//	НоваяСтрокаОтбор.Упаковка = ПредыдущаяУпаковка;
			//Иначе
			//	НоваяСтрокаОтбор.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры);
			//КонецЕсли; 
			НоваяСтрокаОтбор.Упаковка = УпаковкаТысШт;
			НоваяСтрокаОтбор.Характеристика = Строка.Характеристика;
			НоваяСтрокаОтбор.Ячейка = Строка.АдресХранения;
			НоваяСтрокаОтбор.ВесУпаковки = 1;
			НоваяСтрокаОтбор.Серия = Строка.Серия;
			НоваяСтрокаОтбор.СтатусУказанияСерий = 8;
			
			НоваяСтрокаРазмещение = НовыйДокОбъект.ТоварыРазмещение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРазмещение, НоваяСтрокаОтбор,,"Ячейка");
			НоваяСтрокаРазмещение.Ячейка = ЗонаОтгрузки;
			
			Если ИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку И Строка.Мест <> 0 Тогда
				НоваяСтрокаОтбор.КоличествоОтобрано = НоваяСтрокаОтбор.Количество;
				НоваяСтрокаОтбор.КоличествоУпаковокОтобрано = НоваяСтрокаОтбор.Количество;
				НоваяСтрокаРазмещение.КоличествоРазмещено = НоваяСтрокаОтбор.Количество;
				НоваяСтрокаРазмещение.КоличествоУпаковокРазмещено = НоваяСтрокаОтбор.Количество;
			КонецЕсли;
			
			//ПредыдущийВид = НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры;
			//ПредыдущаяУпаковка = НоваяСтрокаОтбор.Упаковка;
		КонецЦикла;
		
		Если УжеСозданныйДокумент <> Неопределено Тогда
			УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
			Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
				УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
			КонецЦикла;
			НовыйДокОбъект = УжеСозданныйДокументОбъект;
		КонецЕсли;
		
	Иначе
		
		// Документ уже создан и в нем есть размещенные коробки
		
		// Первым делом проверим склад
		Если УжеСозданныйДокумент.Склад <> СкладГП Тогда
			Сообщить("" + Ссылка + ". Склад ГП документа отличается от склада, с которого уже есть отобранные коробки по заявке.");
			ОтменитьТранзакцию();
			Возврат Неопределено;
		КонецЕсли;			
		
		// Заполним ТЧ ТоварыОтбор И ТоварыРазмещение по данным заявки, затем проверим ТаблицаТоварыРазмещение по ТЧ ТоварыОтбор.
		// Если ошибок нет, то перенесем размещенное количество из ТаблицаТоварыРазмещение в обе ТЧ документа 
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		УжеСозданныйДокументОбъект.Дата = ДатаПроведенияПоАдресномуСкладу;
		УжеСозданныйДокументОбъект.ДатаНачалаВыполнения = ДатаПроведенияПоАдресномуСкладу;
		УжеСозданныйДокументОбъект.ДатаОкончанияВыполнения = ДатаПроведенияПоАдресномуСкладу;
		ТаблицаТоварыОтбор = УжеСозданныйДокументОбъект.ТоварыОтбор.Выгрузить();
		ТаблицаТоварыРазмещение = УжеСозданныйДокументОбъект.ТоварыРазмещение.Выгрузить();
		УжеСозданныйДокументОбъект.ТоварыОтбор.Очистить();
		УжеСозданныйДокументОбъект.ТоварыРазмещение.Очистить();
		//ПредыдущийВид = Неопределено;
		//ПредыдущаяУпаковка = Неопределено;
		УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
		Для каждого Строка из Продукция Цикл
			Если ЗаякаЗакрыта И Строка.Мест = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаОтбор = УжеСозданныйДокументОбъект.ТоварыОтбор.Добавить();
			НоваяСтрокаОтбор.Количество = Строка.Количество;
			НоваяСтрокаОтбор.КоличествоОтобрано = 0;
			НоваяСтрокаОтбор.КоличествоУпаковок = НоваяСтрокаОтбор.Количество;
			НоваяСтрокаОтбор.КоличествоУпаковокОтобрано = 0;
			НоваяСтрокаОтбор.Номенклатура = Строка.Номенклатура;
			//Если ПредыдущийВид = НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры Тогда
			//	НоваяСтрокаОтбор.Упаковка = ПредыдущаяУпаковка;
			//Иначе
			//	НоваяСтрокаОтбор.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры);
			//КонецЕсли;
			НоваяСтрокаОтбор.Упаковка = УпаковкаТысШт;
			НоваяСтрокаОтбор.Характеристика = Строка.Характеристика;
			НоваяСтрокаОтбор.Ячейка = Строка.АдресХранения;
			НоваяСтрокаОтбор.ВесУпаковки = 1;
			НоваяСтрокаОтбор.Серия = Строка.Серия;
			НоваяСтрокаОтбор.СтатусУказанияСерий = 8;
			
			НоваяСтрокаРазмещение = УжеСозданныйДокументОбъект.ТоварыРазмещение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРазмещение, НоваяСтрокаОтбор,,"Ячейка");
			НоваяСтрокаРазмещение.Ячейка = ЗонаОтгрузки;
			НоваяСтрокаРазмещение.КоличествоРазмещено = 0;
			НоваяСтрокаРазмещение.КоличествоУпаковокРазмещено = 0;
			
			//ПредыдущийВид = НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры;
			//ПредыдущаяУпаковка = НоваяСтрокаОтбор.Упаковка;
		КонецЦикла;
		
		Отбор = Новый Структура("Номенклатура,Упаковка,Характеристика,Назначение,Серия,СтатусУказанияСерий");
		Для каждого Строка из ТаблицаТоварыРазмещение Цикл
			Если Строка.КоличествоУпаковокРазмещено > 0 Тогда
				ЗаполнитьЗначенияСвойств(Отбор, Строка);
				НайденныеСтроки = УжеСозданныйДокументОбъект.ТоварыОтбор.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 0 Тогда
					// Такой коробки нет, отменяем транзакцию
					Сообщить("" + Ссылка + ". Коробка " + Строка.Номенклатура + " / " + Строка.Серия + ": уже отобрана на складе, но ее нет в заявке.");
					ОтменитьТранзакцию();
					Возврат Неопределено;
				Иначе
					// Заполним размещенное количество в ТЧ документа
					СтрокаТоварыОтбор = НайденныеСтроки[0];
					СтрокаТоварыОтбор.КоличествоОтобрано = Строка.КоличествоРазмещено;
					СтрокаТоварыОтбор.КоличествоУпаковокОтобрано = Строка.КоличествоУпаковокРазмещено;
					
					// Индексы строк табличных частей совпадают, т.к. мы их только что перезаполнили
					СтрокаТоварыРазмещение = УжеСозданныйДокументОбъект.ТоварыРазмещение[СтрокаТоварыОтбор.НомерСтроки - 1];
					СтрокаТоварыРазмещение.КоличествоРазмещено = Строка.КоличествоРазмещено;
					СтрокаТоварыРазмещение.КоличествоУпаковокРазмещено = Строка.КоличествоУпаковокРазмещено;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицыРазличаются = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТаблицаТоварыОтбор, УжеСозданныйДокументОбъект.ТоварыОтбор.Выгрузить())
		ИЛИ  Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТаблицаТоварыРазмещение, УжеСозданныйДокументОбъект.ТоварыРазмещение.Выгрузить());
		Если НЕ ТаблицыРазличаются И УжеСозданныйДокументОбъект.Проведен И УжеСозданныйДокументОбъект.Дата = УжеСозданныйДокумент.Дата Тогда
			// Не надо записывать
			Возврат УжеСозданныйДокумент;
		КонецЕсли;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
		
	КонецЕсли;
	
	//// Установим статус в соответствии с подобранным количеством: если ничего не подобрано - подготовлено, если все подобрано - выполнено без ошибок, если часть подобрано - выполнено с ошибками
	//Если НовыйДокОбъект.ТоварыРазмещение.Итог("КоличествоРазмещено") = 0 Тогда
	//	НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено;
	//Иначе
	//	ВсеРазмещено = Истина;
	//	Для каждого Строка из НовыйДокОбъект.ТоварыРазмещение Цикл
	//		Если Строка.КоличествоРазмещено <> Строка.Количество Тогда
	//			ВсеРазмещено = Ложь;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если ВсеРазмещено Тогда
	//		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
	//	Иначе
	//		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоСОшибками;
	//	КонецЕсли;
	//КонецЕсли;
	
	// Статус специально ставлю "ВРаботе", чтобы в подписке на событие он проставился правильный в зависимости от подобранного количества
	// Если оставить, то при текущем статусе документа "ВыполненоБезОшибок" перед записью документа подоранное количество заполнится из колонки "Количество"
	Если СозданНаОснованииПолученияГПИзПроизводства Тогда
		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
	Иначе
		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВРаботе;
	КонецЕсли;
	НовыйДокОбъект.ПометкаУдаления = Ложь;
	НовыйДокОбъект.Проведен = Истина;
	НовыйДокОбъект.ДополнительныеСвойства.Вставить("Лико_АвтоматическоеСоздание");
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументРеализацияТоваровУслуг(УжеСозданныйДокумент = Неопределено, ТоварыВРеализацию, МассивСчетов, ТекущийСклад)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	//ТоварыВРеализацию = Лико_Дополнительно.НайтиСтрокиВозвращаетТЗ(СтруктураПараметров.ТЗПродукция.Выгрузить(), Новый Структура("Контрагент,Валюта", СтруктураПараметров.Контрагент, СтруктураПараметров.Валюта));
	Если ТоварыВРеализацию.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	ПерваяСтрока = ТоварыВРеализацию[0];
	
	НовыйДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокОбъект.Дата = ДатаОтгрузки;
	//Если ЗначениеЗаполнено(ПерваяСтрока.АдресДоставки) Тогда 
	//	НовыйДокОбъект.АдресДоставки = ПерваяСтрока.АдресДоставки;
	//Иначе
	НовыйДокОбъект.АдресДоставки = АдресДоставки;
	НовыйДокОбъект.АдресДоставкиЗначенияПолей = АдресДоставкиЗначенияПолей;
	//КонецЕсли;
	
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();
	НовыйДокОбъект.Организация = ОрганизацияПродавецКлиенту;
	//НовыйДокОбъект.БанковскийСчетОрганизации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовыйДокОбъект.Организация);
	//Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.БанковскийСчетОрганизации) Тогда
	//	НовыйДокОбъект.БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовыйДокОбъект.Организация, ВалютаРуб);
	//КонецЕсли;
	Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.Контрагенты") Тогда
		НовыйДокОбъект.Грузоотправитель = Грузоотправитель;
		НовыйДокОбъект.БанковскийСчетГрузоотправителя = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Грузоотправитель, ВалютаРуб);
	КонецЕсли;
	Если ПерваяСтрока.Грузополучатель <> ПерваяСтрока.Контрагент Тогда
		НовыйДокОбъект.Грузополучатель = ПерваяСтрока.Грузополучатель;
		НовыйДокОбъект.БанковскийСчетГрузополучателя = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(ПерваяСтрока.Грузополучатель, ВалютаРуб);
	КонецЕсли;
	НовыйДокОбъект.Валюта = ПерваяСтрока.Валюта;
	НакладнаяНаЭкспорт = ПерваяСтрока.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
	Если НакладнаяНаЭкспорт Тогда
		НовыйДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт;
	Иначе
		НовыйДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	КонецЕсли;
	НовыйДокОбъект.ВалютаВзаиморасчетов = НовыйДокОбъект.Валюта;
	НовыйДокОбъект.Контрагент = ПерваяСтрока.Контрагент;
	НовыйДокОбъект.Менеджер = ПерваяСтрока.ЗаказКлиента.Менеджер;
	
	//ПриСозданииОтгрузкиБратьПартнераИзЗаказаАНеИзКонтрагента = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ПерваяСтрока.Контрагент.Партнер, "ПриСозданииОтгрузкиБратьПартнераИзЗаказаАНеИзКонтрагента_087633c41e41426fb319ce4c41e3ffab", Ложь);
	
	// По требованию Капкина теперь партнер будет всегда браться из заказа
	//ПриСозданииОтгрузкиБратьПартнераИзЗаказаАНеИзКонтрагента = Истина;
	
	// сделал наоборот: по умолчанию брать из заказа, а для некоторых случаев брать из контрагента
	ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ПерваяСтрока.Контрагент.Партнер, "ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа_fca67e4d4a11435ca3926adb18a18d38", Ложь);
	Если ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа Тогда
		НовыйДокОбъект.Партнер = ПерваяСтрока.Контрагент.Партнер;
	Иначе
		НовыйДокОбъект.Партнер = ПерваяСтрока.ЗаказКлиента.Партнер;
	КонецЕсли;
	
	Если НовыйДокОбъект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра ИЛИ НовыйДокОбъект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра ИЛИ НовыйДокОбъект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра Тогда
		//НовыйДокОбъект.Подразделение = Справочники.Лико_ПредопределенныеЗначения.ПодразделениеПроизводство.ЗначениеПараметра;
		НовыйДокОбъект.Подразделение = ПерваяСтрока.ЗаказКлиента.Площадка.ПодразделениеПроизводство; // --> Начало Лико Ефимов ЕВВ 17.12.2024
	Иначе
		Если ЗначениеЗаполнено(НовыйДокОбъект.Менеджер.Подразделение) Тогда
			НовыйДокОбъект.Подразделение = НовыйДокОбъект.Менеджер.Подразделение;
		Иначе
			НовыйДокОбъект.Подразделение = ПолучитьПодразделениеПоРегиону(ПерваяСтрока.ЗаказКлиента.Регион);
		КонецЕсли;
	КонецЕсли;
	НовыйДокОбъект.Склад = ТекущийСклад;
	НовыйДокОбъект.Согласован = Истина;
	НовыйДокОбъект.Соглашение = ПерваяСтрока.ЗаказКлиента.Соглашение;
	НовыйДокОбъект.ХозяйственнаяОперация = ПерваяСтрока.ЗаказКлиента.ХозяйственнаяОперация;
	НовыйДокОбъект.ЦенаВключаетНДС = ?(ПерваяСтрока.ПересчитыватьЦеныВЦеныБезНДС, Ложь, ПерваяСтрока.ЦенаВключаетНДС);
	НовыйДокОбъект.Автор = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	Отбор = Новый Структура("Валюта", НовыйДокОбъект.Валюта);
	//КурсВалюты = РегистрыСведений.КурсыВалют.СрезПоследних(ДатаОтгрузки, Отбор);
	//НовыйДокОбъект.Курс = КурсВалюты[0].Курс;
	//НовыйДокОбъект.Кратность = КурсВалюты[0].Кратность;
	НовыйДокОбъект.КурсЧислитель = 1;
	НовыйДокОбъект.КурсЗнаменатель = 1;
	НовыйДокОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	Перевозчик = ?(ЗначениеЗаполнено(Диспетчер), Диспетчер.Партнер, ПеревозчикЖДиАвиа.Партнер);
	Если ЗначениеЗаполнено(Перевозчик) Тогда
		НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
		НовыйДокОбъект.ПеревозчикПартнер = Перевозчик;
	Иначе
		НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	КонецЕсли;
	НовыйДокОбъект.Комментарий = ПерваяСтрока.Комментарий + Символы.ПС;
	НовыйДокОбъект.Комментарий = "" + НовыйДокОбъект.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
	ЗаполнитьОтветственныхЛиц(НовыйДокОбъект);
	
	НовыйДокОбъект.ГруппаФинансовогоУчета = Лико_Дополнительно.НайтиГруппуФинУчетаПоВалютеИНалогообложению(НовыйДокОбъект.Валюта, НовыйДокОбъект.НалогообложениеНДС);
	
	// если есть счета на оплату, проведем сперва в статусе "К предоплате", а после зачета оплаты отдельно проведем в статусе "Отгружено"
	//Если МассивСчетов.Количество() > 0 Тогда
	//	НовыйДокОбъект.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате;
	//Иначе
	НовыйДокОбъект.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	//КонецЕсли;
	
	СтавкаНДС0 = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС0);
	Для каждого Строка из ТоварыВРеализацию Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Упаковка = Строка.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоОтгружено;
		НоваяСтрока.Количество = Строка.КоличествоОтгружено;
		НоваяСтрока.Цена = Строка.Цена;
		Если НакладнаяНаЭкспорт Тогда
			// не резидент, ставка НДС = 0
			НоваяСтрока.СтавкаНДС = СтавкаНДС0;
			НоваяСтрока.КодТНВЭД = НоваяСтрока.Номенклатура.КодТНВЭД;
		Иначе
			// резидент
			НоваяСтрока.СтавкаНДС = Строка.СтавкаНДС;
		КонецЕсли;
		НоваяСтрока.Склад = НовыйДокОбъект.Склад;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", НовыйДокОбъект.НалогообложениеНДС);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовыйДокОбъект.ЦенаВключаетНДС, НоваяСтрока.СтавкаНДС));
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
	КонецЦикла;
	//НовыйДокОбъект.Товары.Сортировать("Характеристика,Номенклатура");
	
	// Заполняем договор
	НовыйДокОбъект.Договор = ПодобратьДоговорВРеализацию(ПерваяСтрока.ЗаказКлиента, НовыйДокОбъект, МассивСчетов, ПерваяСтрока.РеальныйДоговор);
	Если ЗначениеЗаполнено(НовыйДокОбъект.Договор) Тогда
		СтруктураОснования = Лико_Дополнительно.СформироватьОснованиеРеализацииПоДоговору(НовыйДокОбъект.Договор, НовыйДокОбъект.Дата);
		Если СтруктураОснования <> Неопределено И ЗначениеЗаполнено(СтруктураОснования.ТекстОснования) Тогда
			НовыйДокОбъект.Основание = СтруктураОснования.ТекстОснования;
			НовыйДокОбъект.ОснованиеНомер = СтруктураОснования.Номер;
			НовыйДокОбъект.ОснованиеДата = СтруктураОснования.Дата;
		КонецЕсли;
	КонецЕсли;
	НовыйДокОбъект.БанковскийСчетОрганизации = НовыйДокОбъект.Договор.БанковскийСчет;
	НовыйДокОбъект.ОплатаВВалюте = НовыйДокОбъект.Договор.ОплатаВВалюте;
	НовыйДокОбъект.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(ПерваяСтрока.Контрагент, ?(НовыйДокОбъект.ОплатаВВалюте, Неопределено, ВалютаРуб));
	
	// Заполним даты и суммы платежей
	//НовыйДокОбъект.ЗаполнитьЭтапыГрафикаОплаты();
	
	НовыйДокОбъект.УстановитьНовыйНомер();
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер,Сканы,Лико_ОбщаяСтоимостьДоставки,Лико_СкладДляРасчетаСтоимостиДоставки");
		Если Лев(УжеСозданныйДокументОбъект.Номер, 2) <> Лев(НовыйДокОбъект.Номер, 2)
			ИЛИ Сред(УжеСозданныйДокументОбъект.Номер, 6, 1) <> Сред(НовыйДокОбъект.Номер, 6, 1)
			Тогда
			// Если префиксы организаций или года разные, то номер тоже будем менять
			УжеСозданныйДокументОбъект.Номер = НовыйДокОбъект.Номер;
		КонецЕсли;
		
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументАктВыполненныхРабот(УжеСозданныйДокумент = Неопределено, РеализацияТоваровУслуг, ЗаявкаНаОтгрузку)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();
	ПерваяСтрокаТоваров = ЗаявкаНаОтгрузку.Товары[0];
	
	НовыйДокОбъект = Документы.АктВыполненныхРабот.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(НовыйДокОбъект, РеализацияТоваровУслуг, "Номер,Дата,БанковскийСчетКонтрагента,БанковскийСчетОрганизации,Контрагент,Менеджер,НалогообложениеНДС,Организация,Партнер,Подразделение,Соглашение,Договор,Автор,Руководитель,ГлавныйБухгалтер,ПорядокРасчетов,Основание,ОснованиеДата,ОснованиеНомер,Комментарий");
	
	КурсВалюты = 1;
	Если ПерваяСтрокаТоваров.ВалютаЦены = ВалютаРуб Тогда
		НовыйДокОбъект.Валюта = ВалютаРуб;
	Иначе
		Если ПерваяСтрокаТоваров.ОтгрузкаВРублях Тогда
			// Требуется пересчет в рубли
			КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПерваяСтрокаТоваров.ВалютаЦены, НовыйДокОбъект.Дата).Курс;
			НовыйДокОбъект.Валюта = ВалютаРуб;
		Иначе
			НовыйДокОбъект.Валюта = ПерваяСтрокаТоваров.ВалютаЦены;
		КонецЕсли;
	КонецЕсли;
	
	НовыйДокОбъект.ВалютаВзаиморасчетов = НовыйДокОбъект.Валюта;
	//НовыйДокОбъект.Комментарий = "" + НовыйДокОбъект.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.ЦенаВключаетНДС = ?(ЗначениеЗаполнено(ЗаявкаНаОтгрузку.Услуги[0].Характеристика.Лико_ЗаказНоменклатуры), ЗаявкаНаОтгрузку.Услуги[0].Характеристика.Лико_ЗаказНоменклатуры.ЦенаДляДокументовВключаетНДС, ПерваяСтрокаТоваров.ЗаказКлиента.ЦенаДляДокументовВключаетНДС);
	НовыйДокОбъект.КурсЧислитель = 1;
	НовыйДокОбъект.КурсЗнаменатель = 1;
	
	СтавкаНДС = РеализацияТоваровУслуг.Товары[0].СтавкаНДС;
	
	Для каждого СтрокаУслуги из ЗаявкаНаОтгрузку.Услуги Цикл
		
		НоваяСтрока = НовыйДокОбъект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги, "Номенклатура,Характеристика,Содержание,Количество");
		//НоваяСтрока.Характеристика = НайтиИлиСоздатьХарактеристикуДляУслуги(СтрокаУслуги.Номенклатура, СтрокаУслуги.ЗаказКлиента);
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Содержание) Тогда
			НоваяСтрока.Содержание = НоваяСтрока.Номенклатура.НаименованиеПолное + ?(ЗначениеЗаполнено(НоваяСтрока.Характеристика), " (" + НоваяСтрока.Характеристика.НаименованиеПолное + ")", "");
		КонецЕсли;
		
		НоваяСтрока.Цена = СтрокаУслуги.Цена * КурсВалюты;
		НоваяСтрока.СтавкаНДС = СтавкаНДС;
		СтруктураДействий = Новый Структура;
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокОбъект);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ИмяКоличества", Ложь, "Количество"));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
		СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Сканы");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументТраспортнаяНакладная(УжеСозданныйДокумент = Неопределено, Основание, ТаблицаСерий, ИзменитьТолькоДанныеПеревозчика = Ложь)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИзменитьТолькоДанныеПеревозчика Тогда
		НовыйДокОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
	Иначе
		НовыйДокОбъект = Документы.ТранспортнаяНакладная.СоздатьДокумент();
		НовыйДокОбъект.Номер = Основание.Номер;
		//МассивРаспоряжений = Новый Массив;
		//МассивРаспоряжений.Добавить(Основание);
		//РеквизитыТранспортнойНакладной = Документы.ТранспортнаяНакладная.РеквизитыТранспортнойНакладнойЗаполненные(МассивРаспоряжений);
		НовыйДокОбъект.Заполнить(Основание);
		НовыйДокОбъект.ВыводДанныхОТоварномСоставе = Перечисления.ВариантыВыводаДанныхОТоварномСоставе.ТоварныйСостав;
		НовыйДокОбъект.ВидПеревозки = ТипЗаявки;
		НовыйДокОбъект.МассаБрутто = Документы.Лико_ЗаявкаНаТранспортировку.РассчитатьВесКоробокДляТаблицыСерий(ТаблицаСерий);
		НовыйДокОбъект.МассаНетто = НовыйДокОбъект.МассаБрутто;
		НовыйДокОбъект.СрокДоставки = СрокДоставки;
		НовыйДокОбъект.Лико_Логист = ОтпускРазрешил;
		НовыйДокОбъект.Лико_КоличествоМест = Лико_Дополнительно.РассчитатьКоличествоКоробокВТЗ(ТаблицаСерий);
		НовыйДокОбъект.ГлавныйБухгалтер = Основание.ГлавныйБухгалтер;
		НовыйДокОбъект.БанковскийСчетЗаказчикаПеревозки = Основание.БанковскийСчетОрганизации;
		НовыйДокОбъект.АдресПогрузки = АдресГрузоотправителя;
		НовыйДокОбъект.АдресПогрузкиЗначенияПолей = АдресГрузоотправителяЗначенияПолей;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеТоваров")    
			// --> Начало Лико Ефимов ЕВВ 16.02.2023 Странно, что ОтгрузкаТоваровСХранения я сделал по аналогии с перемещением. Нужно ее делать по аналогии с реализацией, поэтому пусть идет в Иначе
			//ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения") 
			Тогда
			ТекГрузополучатель = ?(ЗначениеЗаполнено(КорректировкаГрузополучатель), КорректировкаГрузополучатель, Контрагент);
			ВТранспортнойНакладнойПлательщикЭтоКонтрагентРеализации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТекГрузополучатель.Партнер, "ВТранспортнойНакладнойПлательщикКонтрагентРеализации", Ложь);
			
			НовыйДокОбъект.Организация = ОрганизацияПродавецКлиенту;
			НовыйДокОбъект.Грузоотправитель = НовыйДокОбъект.Организация;
			НовыйДокОбъект.Грузополучатель = ТекГрузополучатель;
			Если ВТранспортнойНакладнойПлательщикЭтоКонтрагентРеализации Тогда
				НовыйДокОбъект.Плательщик = ТекГрузополучатель;
				НовыйДокОбъект.БанковскийСчетПлательщика = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(НовыйДокОбъект.Плательщик, Константы.ВалютаРегламентированногоУчета.Получить());
			Иначе
				НовыйДокОбъект.Плательщик = НовыйДокОбъект.Организация;
				НовыйДокОбъект.БанковскийСчетПлательщика = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовыйДокОбъект.Плательщик);
				Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.БанковскийСчетПлательщика) Тогда
					НовыйДокОбъект.БанковскийСчетПлательщика = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовыйДокОбъект.Плательщик, Константы.ВалютаРегламентированногоУчета.Получить());
				КонецЕсли;
			КонецЕсли;
			НовыйДокОбъект.ЗаказчикПеревозки = НовыйДокОбъект.Организация;
			ЗаполнитьОтветственныхЛиц(НовыйДокОбъект);
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения") Тогда
			ТекГрузополучатель = ?(ЗначениеЗаполнено(КорректировкаГрузополучатель), КорректировкаГрузополучатель, Контрагент);
			ВТранспортнойНакладнойПлательщикЭтоКонтрагентРеализации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Основание.Партнер, "ВТранспортнойНакладнойПлательщикКонтрагентРеализации", Ложь);
			
			НовыйДокОбъект.Организация = Основание.Организация;
			НовыйДокОбъект.Грузоотправитель = НовыйДокОбъект.Организация;
			НовыйДокОбъект.Грузополучатель = ТекГрузополучатель;
			Если ВТранспортнойНакладнойПлательщикЭтоКонтрагентРеализации Тогда
				НовыйДокОбъект.Плательщик = Основание.Контрагент;
				НовыйДокОбъект.БанковскийСчетПлательщика = Основание.БанковскийСчетКонтрагента;
			Иначе
				НовыйДокОбъект.Плательщик = Основание.Организация;
				НовыйДокОбъект.БанковскийСчетПлательщика = Основание.БанковскийСчетОрганизации;
			КонецЕсли;
			НовыйДокОбъект.ЗаказчикПеревозки = Основание.Организация;
			ЗаполнитьОтветственныхЛиц(НовыйДокОбъект);
		Иначе
			ВТранспортнойНакладнойПлательщикЭтоКонтрагентРеализации = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Основание.Партнер, "ВТранспортнойНакладнойПлательщикКонтрагентРеализации", Ложь);
			
			Если ВТранспортнойНакладнойПлательщикЭтоКонтрагентРеализации Тогда
				НовыйДокОбъект.Плательщик = Основание.Контрагент;
				НовыйДокОбъект.БанковскийСчетПлательщика = Основание.БанковскийСчетКонтрагента;
			Иначе
				НовыйДокОбъект.Плательщик = Основание.Организация;
				НовыйДокОбъект.БанковскийСчетПлательщика = Основание.БанковскийСчетОрганизации;
			КонецЕсли;
			НовыйДокОбъект.ЗаказчикПеревозки = Основание.Организация;
		КонецЕсли;
		
		Если НовыйДокОбъект.Плательщик = НовыйДокОбъект.ЗаказчикПеревозки Тогда
			НовыйДокОбъект.БанковскийСчетЗаказчикаПеревозки = НовыйДокОбъект.БанковскийСчетПлательщика;
		Иначе
			НовыйДокОбъект.БанковскийСчетЗаказчикаПеревозки = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитОрганизацииБанковскийСчетПоУмолчанию", НовыйДокОбъект.ЗаказчикПеревозки);
			Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.БанковскийСчетЗаказчикаПеревозки) Тогда
				НовыйДокОбъект.БанковскийСчетЗаказчикаПеревозки = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(НовыйДокОбъект.ЗаказчикПеревозки, Константы.ВалютаРегламентированногоУчета.Получить());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НовыйДокОбъект.Лико_Пломба = Пломба;
	НовыйДокОбъект.АвтомобильВместимостьВКубическихМетрах = Машина.ВместимостьВКубическихМетрах;
	НовыйДокОбъект.АвтомобильГосударственныйНомер = Машина.Код;
	НовыйДокОбъект.АвтомобильГрузоподъемностьВТоннах = Машина.ГрузоподъемностьВТоннах;
	НовыйДокОбъект.АвтомобильМарка = Машина.Марка;
	НовыйДокОбъект.АвтомобильТип = Машина.Тип;
	НовыйДокОбъект.Водитель = Водитель;
	НовыйДокОбъект.ГосударственныйНомерПрицепа = Машина.ГосударственныйНомерПрицепа;
	НовыйДокОбъект.ЛицензионнаяКарточкаВид = Машина.ЛицензионнаяКарточкаВид;
	НовыйДокОбъект.ЛицензионнаяКарточкаНомер = Машина.ЛицензионнаяКарточкаНомер;
	НовыйДокОбъект.ЛицензионнаяКарточкаРегистрационныйНомер = Машина.ЛицензионнаяКарточкаРегистрационныйНомер;
	НовыйДокОбъект.ЛицензионнаяКарточкаСерия = Машина.ЛицензионнаяКарточкаСерия;
	НовыйДокОбъект.Перевозчик = ?(ЗначениеЗаполнено(Диспетчер), Диспетчер, ПеревозчикЖДиАвиа);
	НовыйДокОбъект.БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(НовыйДокОбъект.Перевозчик, Константы.ВалютаРегламентированногоУчета.Получить());
	НовыйДокОбъект.Прицеп = Машина.Прицеп;
	ДанныеВодУдостоверения = Лико_Дополнительно.ПолучитьДанныеВодУдостоверения(Водитель, НовыйДокОбъект.Дата);
	НовыйДокОбъект.УдостоверениеНомер = ДанныеВодУдостоверения.УдостоверениеНомер;
	НовыйДокОбъект.УдостоверениеСерия = ДанныеВодУдостоверения.УдостоверениеСерия;
	НовыйДокОбъект.Лико_ДатаВыдачиУдостоверения = ДанныеВодУдостоверения.Лико_ДатаВыдачиУдостоверения;
	НовыйДокОбъект.АдресДоставки = АдресДоставки;
	НовыйДокОбъект.АдресДоставкиЗначенияПолей = АдресДоставкиЗначенияПолей;
	
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Сканы");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьОтветственныхЛиц(НовыйДокОбъект)
	
	ФизЛицо = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	НовыйДокОбъект.Отпустил = ?(ЗначениеЗаполнено(Кладовщик), Кладовщик, ФизЛицо);
	НовыйДокОбъект.ОтпустилДолжность = Лико_Дополнительно.НайтиДолжностьФизЛица(НовыйДокОбъект.Отпустил, НовыйДокОбъект.Организация, НовыйДокОбъект.Дата);
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.ОтпустилДолжность) Тогда
		НовыйДокОбъект.ОтпустилДолжность = "Кладовщик";
	КонецЕсли;
	
	Если НовыйДокОбъект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра ИЛИ НовыйДокОбъект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра Тогда
		Руководитель = ?(ЗначениеЗаполнено(ОтпускРазрешил), ОтпускРазрешил, НовыйДокОбъект.Отпустил);
		ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ОтпускПроизвел), ОтпускПроизвел, НовыйДокОбъект.Отпустил);
	Иначе
		Руководитель = НовыйДокОбъект.Отпустил;
		ГлавныйБухгалтер = НовыйДокОбъект.Отпустил;
	КонецЕсли;
	
	НовыйДокОбъект.Руководитель = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовыйДокОбъект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Руководитель, НовыйДокОбъект.Дата); 
	НовыйДокОбъект.ГлавныйБухгалтер = Лико_Дополнительно.НайтиЛицоСПравомПодписи(НовыйДокОбъект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ГлавныйБухгалтер, НовыйДокОбъект.Дата); 
	
КонецПроцедуры

Функция ПолучитьМассивСчетов(ТоварыВРеализацию)
	
	МассивСчетов = Новый Массив;
	ТаблицаСчетов = ТоварыВРеализацию.Скопировать(,"СчетНаОплату");
	ТаблицаСчетов.Свернуть("СчетНаОплату");
	Для каждого Строка из ТаблицаСчетов Цикл
		Если ЗначениеЗаполнено(Строка.СчетНаОплату) Тогда
			МассивСчетов.Добавить(Строка.СчетНаОплату);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСчетов;
	
КонецФункции

Функция ПодобратьДоговорВРеализацию(ЗаказКлиента, Реализация, МассивСчетов, РеальныйДоговор)
	
	Договор = Неопределено;
	ДоговорИзСчета = Ложь;
	//Если ЗаказКлиента.Соглашение.ИспользуютсяДоговорыКонтрагентов Тогда
	Если МассивСчетов.Количество() = 0 Тогда
		Договор = Лико_Дополнительно.ПодобратьДоговор(ЗаказКлиента, Реализация);
	Иначе
		Для каждого Счет из МассивСчетов Цикл
			Если ЗначениеЗаполнено(Счет.Договор) Тогда
				Договор = Счет.Договор;
				ДоговорИзСчета = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(Договор) Тогда
			// Договор будем формировать исходя из ЗаказаКлиента (он получен из первой строки реализации)
			Договор = Лико_Дополнительно.ПодобратьДоговор(ЗаказКлиента, Реализация);
		КонецЕсли;
	КонецЕсли;
	//КонецЕсли;
	Если Договор.Организация <> Реализация.Организация
		ИЛИ Договор.Контрагент <> Реализация.Контрагент
		ИЛИ Договор.Партнер <> Реализация.Партнер
		//ИЛИ Договор.ПорядокОплаты <> Реализация.ПорядокОплаты
		ИЛИ Договор.ГруппаФинансовогоУчета <> Реализация.ГруппаФинансовогоУчета
		ИЛИ Договор.ВалютаВзаиморасчетов <> Реализация.ВалютаВзаиморасчетов
		ИЛИ (НЕ ДоговорИзСчета И Договор.Дата <> НачалоДня(Реализация.Дата))
		ИЛИ (ЗначениеЗаполнено(РеальныйДоговор) И Договор.Лико_СсылкаНаРеальныйДоговор <> РеальныйДоговор)
		ИЛИ (НЕ ДоговорИзСчета И Договор.СтавкаНДС <> Реализация.Товары[0].СтавкаНДС)
		ИЛИ Договор.Лико_Площадка <> ЗаказКлиента.Площадка
		ИЛИ Договор.Менеджер <> Реализация.Менеджер
		ИЛИ Договор.ПометкаУдаления
		Тогда
		
		ДоговорОбъект = Договор.ПолучитьОбъект();
		ДоговорОбъект.Организация = Реализация.Организация;
		//ДоговорОбъект.ПорядокОплаты = Реализация.ПорядокОплаты;
		ДоговорОбъект.ГруппаФинансовогоУчета = Реализация.ГруппаФинансовогоУчета;
		ДоговорОбъект.ВалютаВзаиморасчетов = Реализация.ВалютаВзаиморасчетов;
		ДоговорОбъект.Контрагент = Реализация.Контрагент;
		ДоговорОбъект.Партнер = Реализация.Партнер;
		Если НЕ ДоговорИзСчета Тогда
			ДоговорОбъект.Дата = Реализация.Дата;
			ДоговорОбъект.СтавкаНДС = Реализация.Товары[0].СтавкаНДС;
		КонецЕсли;
		Если ЗначениеЗаполнено(РеальныйДоговор) Тогда
			ДоговорОбъект.Лико_СсылкаНаРеальныйДоговор = РеальныйДоговор;
		Иначе
			ДоговорОбъект.Лико_СсылкаНаРеальныйДоговор = Лико_Дополнительно.НайтиРеальныйДоговор(ДоговорОбъект.Организация, ДоговорОбъект.Контрагент, ДоговорОбъект.Дата, ДоговорОбъект.ВалютаВзаиморасчетов);
		КонецЕсли;
		ДоговорОбъект.Лико_Площадка = ЗаказКлиента.Площадка;
		ДоговорОбъект.ПометкаУдаления = Ложь;
		ДоговорОбъект.Записать();
	КонецЕсли;
	Возврат Договор;
	
КонецФункции

Процедура ПривязатьОплатыКРеализации(МассивСчетов, Реализация)
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого СчетНаОплату из МассивСчетов Цикл
		// Найдем для счета документы оплаты и привяжем их к накладной
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|ГДЕ
		|	(ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа КАК Документ.Лико_СчетНаОплатуКлиенту)) = &ОснованиеПлатежа
		|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ <> &Реализация";
		
		Запрос.УстановитьПараметр("ОснованиеПлатежа", СчетНаОплату);
		Запрос.УстановитьПараметр("Реализация", Реализация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СтрокаРасшифровкаПлатежа = ДокОбъект.РасшифровкаПлатежа[Выборка.НомерСтроки-1];
			СтрокаРасшифровкаПлатежа.Заказ = Реализация;
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Платеж """ + Выборка.Ссылка + """ привязан к накладной """ + Реализация + """");
			Исключение
				Сообщить("Документ """ + Выборка.Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция СоздатьДокументСчетФактураВыданный(УжеСозданныйДокумент = Неопределено, Основание, АктВыполненныхРабот)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
	НовыйДокОбъект.Дата = Основание.Дата;
	НовыйДокОбъект.Номер = Основание.Номер;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", Основание);
	Если ЗначениеЗаполнено(АктВыполненныхРабот) Тогда
		МассивОснований = Новый Массив;
		МассивОснований.Добавить(Основание);
		МассивОснований.Добавить(АктВыполненныхРабот);
		ДанныеЗаполнения.ДокументОснование = МассивОснований;
		ДанныеЗаполнения.Вставить("Корректировочный", Ложь);
		ДанныеЗаполнения.Вставить("Исправление", Ложь);
		ДанныеЗаполнения.Вставить("РеализацияЧерезКомиссионера", Ложь);
	КонецЕсли;
	ДанныеЗаполнения.Вставить("Организация", Основание.Организация);
	ДанныеЗаполнения.Вставить("ДатаВыставления", Основание.Дата);
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	Если НовыйДокОбъект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		НовыйДокОбъект.Валюта = Основание.Валюта;
	КонецЕсли;
	НовыйДокОбъект.Ответственный = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.ПредставлениеНомера = Документы.СчетФактураВыданный.ПолучитьПредставлениеНомера(НовыйДокОбъект);
	ЗаполнитьЗначенияСвойств(НовыйДокОбъект, Основание, "Руководитель,ГлавныйБухгалтер");
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Сканы");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Если НовыйДокОбъект.Номер <> Основание.Номер Тогда
			НовыйДокОбъект.Номер = Основание.Номер;
			НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументСчетНаОплатуКлиенту(УжеСозданныйДокумент = Неопределено, Основание)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
	НовыйДокОбъект.Дата = Основание.Дата;
	НомерДоговора = СокрЛП(Основание.Договор.Номер);
	НовыйДокОбъект.Заполнить(Основание);	
	НовыйДокОбъект.Менеджер = Основание.Менеджер;
	СтруктураОснования = Лико_Дополнительно.СформироватьОснованиеРеализацииПоДоговору(Основание.Договор, Основание.Дата, Истина);
	Если СтруктураОснования <> Неопределено И ЗначениеЗаполнено(СтруктураОснования.ТекстОснования) Тогда
		НовыйДокОбъект.ДополнительнаяИнформация = СтруктураОснования.ТекстОснования;
	КонецЕсли;
	
	НовыйДокОбъект.ГлавныйБухгалтер = Основание.ГлавныйБухгалтер;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	
	Если НовыйДокОбъект.ЭтапыГрафикаОплаты.Количество() > 0 И НовыйДокОбъект.ЭтапыГрафикаОплаты.Итог("ПроцентПлатежа") < 100 Тогда
		НовыйДокОбъект.ЭтапыГрафикаОплаты[0].ПроцентПлатежа = НовыйДокОбъект.ЭтапыГрафикаОплаты[0].ПроцентПлатежа + 100 - НовыйДокОбъект.ЭтапыГрафикаОплаты.Итог("ПроцентПлатежа");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерДоговора) И СтрДлина(НомерДоговора) <=10 Тогда
		НовыйДокОбъект.Номер = Лико_Дополнительно.ПолучитьНомерДокументаДляСчетаНаОплатуКлиенту(НовыйДокОбъект, НомерДоговора);
	КонецЕсли;
	
	//Если УжеСозданныйДокумент = Неопределено Тогда
	//	// Попробуем найти документ с таким номером
	//	УжеСозданныйДокумент = Документы.СчетНаОплатуКлиенту.НайтиПоНомеру(НовыйДокОбъект.Номер, НовыйДокОбъект.Дата);
	//	Если НЕ ЗначениеЗаполнено(УжеСозданныйДокумент) Тогда
	//		УжеСозданныйДокумент = Неопределено;
	//	КонецЕсли;
	//КонецЕсли;		
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		СписокИсключаемыхРеквизитов = "Ссылка";
		Если НовыйДокОбъект.Номер = "" Тогда
			СписокИсключаемыхРеквизитов = СписокИсключаемыхРеквизитов + ",Номер";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,СписокИсключаемыхРеквизитов);
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НомерДоЗаписи = НовыйДокОбъект.Номер;
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Если НовыйДокОбъект.Номер <> НомерДоЗаписи Тогда
			НовыйДокОбъект.Номер = НомерДоЗаписи;
			НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументЛико_СчетНаОплатуКлиенту(УжеСозданныйДокумент = Неопределено, Реализация, АктВыполненныхРабот)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.Лико_СчетНаОплатуКлиенту.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДокОбъект, Реализация, "Дата,Организация,Валюта,Менеджер,Партнер,Контрагент,Договор,Руководитель,ГлавныйБухгалтер,ЦенаВключаетНДС,ХозяйственнаяОперация");
	НомерДоговора = СокрЛП(Реализация.Договор.Номер);
	Если ЗначениеЗаполнено(НомерДоговора) И СтрДлина(НомерДоговора) <=10 Тогда
		НовыйДокОбъект.Номер = Лико_Дополнительно.ПолучитьНомерДокументаДляСчетаНаОплатуКлиенту(НовыйДокОбъект, НомерДоговора);
	КонецЕсли;
	НовыйДокОбъект.БанковскийСчет = Реализация.БанковскийСчетОрганизации;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """, т.к. в комплекте документов есть акт выполненных работ";
	
	Для каждого Строка из Реализация.Товары Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СуммаСНДС");
		НоваяСтрока.ЗаказКлиента = НоваяСтрока.Характеристика.Лико_ЗаказНоменклатуры;
	КонецЦикла;
	
	Для каждого Строка из АктВыполненныхРабот.Услуги Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СуммаСНДС,Содержание");
		НоваяСтрока.ЗаказКлиента = НоваяСтрока.Характеристика.Лико_ЗаказНоменклатуры;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		СписокИсключаемыхРеквизитов = "Ссылка";
		Если НовыйДокОбъект.Номер = "" Тогда
			СписокИсключаемыхРеквизитов = СписокИсключаемыхРеквизитов + ",Номер";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,СписокИсключаемыхРеквизитов);
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	НовыйДокОбъект.ДополнительныеСвойства.Вставить("Лико_ПрограммноеСоздание");
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументПередачаТоваровМеждуОрганизациями(УжеСозданныйДокумент = Неопределено, ТЗТовары)
	
	Отказ = Ложь;  
	УстановитьПривилегированныйРежим(Истина);
	
	//ТоварыВРеализацию = Лико_Дополнительно.НайтиСтрокиВозвращаетТЗ(СтруктураПараметров.ТЗПродукция.Выгрузить(), Новый Структура("Контрагент,Валюта", СтруктураПараметров.Контрагент, СтруктураПараметров.Валюта));
	Если ТЗТовары.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	ПерваяСтрока = ТЗТовары[0];
	
	НовыйДокОбъект = Документы.ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
	НовыйДокОбъект.Дата = ДатаОтгрузки;
	//Если ЗначениеЗаполнено(ПерваяСтрока.АдресДоставки) Тогда 
	//	НовыйДокОбъект.АдресДоставки = ПерваяСтрока.АдресДоставки;
	//Иначе
	//	НовыйДокОбъект.АдресДоставки = АдресДоставки;
	//КонецЕсли;
	ОрганизацияПродавец = Организация;
	Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.Организации") Тогда
		ОрганизацияПокупатель = Грузоотправитель;
	Иначе
		ОрганизацияПокупатель = Лико_Дополнительно.ПолучитьОрганизациюПоКонтрагенту(Грузоотправитель);
		Если НЕ ЗначениеЗаполнено(ОрганизацияПокупатель) Тогда
			Сообщить("" + Ссылка + ": контрагент, выбранный в грузоотправителе 1 (" + Грузоотправитель + "), не соответствует ни одной организации.");
			Отказ = Истина;
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ВалютаЕвр = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	
	НовыйДокОбъект.Валюта = ПерваяСтрока.Валюта;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию;
	НовыйДокОбъект.Организация = ОрганизацияПродавец;
	НовыйДокОбъект.ЦенаВключаетНДС = Истина;
	НовыйДокОбъект.Склад = СкладГП;
	Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.Контрагенты") Тогда
		НовыйДокОбъект.БанковскийСчетГрузоотправителя = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Грузоотправитель, ВалютаЕвр);
		НовыйДокОбъект.Грузоотправитель = Грузоотправитель;
	КонецЕсли;
	НовыйДокОбъект.НалогообложениеНДС = Справочники.Организации.НалогообложениеНДС(НовыйДокОбъект.Организация, НовыйДокОбъект.Склад, НовыйДокОбъект.Дата);
	НовыйДокОбъект.ДатаПлатежа = ДатаОтгрузки;
	НовыйДокОбъект.БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ОрганизацияПродавец, ВалютаЕвр);
	НовыйДокОбъект.БанковскийСчетОрганизацииПолучателя = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ОрганизацияПокупатель, ВалютаЕвр);
	НовыйДокОбъект.ВалютаВзаиморасчетов = ВалютаЕвр;
	НовыйДокОбъект.ОрганизацияПолучатель = ОрганизацияПокупатель;
	НовыйДокОбъект.ПередачаПодДеятельность = НовыйДокОбъект.НалогообложениеНДС;
	НовыйДокОбъект.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	Отбор = Новый Структура("Валюта", НовыйДокОбъект.ВалютаВзаиморасчетов);
	НовыйДокОбъект.Курс = 1;
	НовыйДокОбъект.Кратность = 1;
	//Если НовыйДокОбъект.Валюта = ВалютаРуб Тогда	
	//	НовыйДокОбъект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВРублях;
	//Иначе
	//	НовыйДокОбъект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте;
	//КонецЕсли;
	НовыйДокОбъект.Менеджер = ПерваяСтрока.ЗаказКлиента.Менеджер;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	
	Для каждого Строка из ТЗТовары Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Упаковка = Строка.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоОтгружено;
		НоваяСтрока.Количество = Строка.КоличествоОтгружено;
		НоваяСтрока.Цена = 0.9 * 0.9 * Строка.Цена; // 90% от цены продажи Грузоотправителя 1 Грузоотправителю 2 (которая также составляет 90% от цены продажи Грузоотправителя 2 клиенту)
		НоваяСтрока.СтавкаНДС = Строка.СтавкаНДС;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", НовыйДокОбъект.НалогообложениеНДС);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовыйДокОбъект.ЦенаВключаетНДС, НоваяСтрока.СтавкаНДС));
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументЛико_ПередачаТоваровМеждуОрганизациями(ТЗТовары, УжеСозданныйДокумент = Неопределено, ДляКаждойОтгрузкиСвойДокумент = Ложь)
	
	Отказ = Ложь;  
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТЗТовары.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	
	ПерваяСтрока = ТЗТовары[0];
	ВалютаЕвро = Константы.ВалютаУправленческогоУчета.Получить();
	ОрганизацияВладелецСкладаГП = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладГП, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
	
	Если ПерваяСтрока.ПлощадкаОрганизация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра
		ИЛИ ОрганизацияПродавецКлиенту = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра 
		ИЛИ ПерваяСтрока.ПлощадкаОрганизация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра 
		ИЛИ ОрганизацияПродавецКлиенту = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра
		ИЛИ ОрганизацияВладелецСкладаГП = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра
		Тогда
		ТипДокумента = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.РеализацияИПоступление;
	Иначе
		ТипДокумента = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.Интеркампани;
	КонецЕсли;
	
	// запрос вставляю здесь, чтобы потом можно было использовать его параметры для заполнения нового документа
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Валюта", ПерваяСтрока.Валюта);
	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаОтгрузки));
	Запрос.УстановитьПараметр("ОрганизацияПокупатель", ОрганизацияПродавецКлиенту);
	Если ОрганизацияВладелецСкладаГП = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛинкс.ЗначениеПараметра Тогда
		Запрос.УстановитьПараметр("ОрганизацияПродавец", ОрганизацияВладелецСкладаГП);
	Иначе
		Запрос.УстановитьПараметр("ОрганизацияПродавец", ПерваяСтрока.ПлощадкаОрганизация);
	КонецЕсли;
	Запрос.УстановитьПараметр("СкладПродажи", СкладГП);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	Запрос.УстановитьПараметр("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС", Истина);
	
	Если ДляКаждойОтгрузкиСвойДокумент Тогда
		Если ЗначениеЗаполнено(УжеСозданныйДокумент) Тогда
			НовыйДокОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		Иначе
			НовыйДокОбъект = Документы.Лико_ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
		КонецЕсли;
	Иначе
		// Сначала попробуем найти документ
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПередачаТоваровМеждуОрганизациями.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_ПередачаТоваровМеждуОрганизациями КАК Лико_ПередачаТоваровМеждуОрганизациями
		|ГДЕ
		|	КОНЕЦПЕРИОДА(Лико_ПередачаТоваровМеждуОрганизациями.Дата, ДЕНЬ) = &Дата
		|	И Лико_ПередачаТоваровМеждуОрганизациями.ОрганизацияПродавец = &ОрганизацияПродавец
		|	И Лико_ПередачаТоваровМеждуОрганизациями.ОрганизацияПокупатель = &ОрганизацияПокупатель
		|	И Лико_ПередачаТоваровМеждуОрганизациями.СкладПродажи = &СкладПродажи
		|	И (Лико_ПередачаТоваровМеждуОрганизациями.СкладПриобретения = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ИЛИ Лико_ПередачаТоваровМеждуОрганизациями.СкладПриобретения = Лико_ПередачаТоваровМеждуОрганизациями.СкладПродажи)
		|	И Лико_ПередачаТоваровМеждуОрганизациями.ТипДокумента = &ТипДокумента
		|	И Лико_ПередачаТоваровМеждуОрганизациями.Валюта = &Валюта
		|	И Лико_ПередачаТоваровМеждуОрганизациями.ЦенаВключаетНДС = &ЦенаВключаетНДС
		|	И Лико_ПередачаТоваровМеждуОрганизациями.НалогообложениеНДС = &НалогообложениеНДС
		|	И НЕ Лико_ПередачаТоваровМеждуОрганизациями.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лико_ПередачаТоваровМеждуОрганизациями.Номер";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			НовыйДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			НовыйДокОбъект = Документы.Лико_ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
		КонецЕсли;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Ссылка) Тогда
	//	// Для нового документа заполним шапку
	ЗаполнитьЗначенияСвойств(НовыйДокОбъект, Запрос.Параметры);
	Если ТипДокумента = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.РеализацияИПоступление Тогда
		НовыйДокОбъект.КонтрагентПродавец = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.ОрганизацияПродавец, "КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2", Справочники.Контрагенты.ПустаяСсылка());
		НовыйДокОбъект.КонтрагентПокупатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.ОрганизацияПокупатель, "КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2", Справочники.Контрагенты.ПустаяСсылка());
		Если НовыйДокОбъект.КонтрагентПокупатель.Наименование = "Окил для Заказов" Тогда
			НовыйДокОбъект.КонтрагентПокупатель = Справочники.Контрагенты.НайтиПоНаименованию("ОКИЛ-САТО", Истина);
		КонецЕсли;	
		НовыйДокОбъект.СкладПриобретения = НовыйДокОбъект.СкладПродажи;
		НовыйДокОбъект.ДоговорПродажи = Лико_Дополнительно.НайтиСоглашениеИлиДоговорВРегистреЗаполненияРеглДок("ДоговорыКонтрагентов", НовыйДокОбъект.ОрганизацияПродавец, НовыйДокОбъект.КонтрагентПокупатель, Перечисления.ТипыДоговоров.СПокупателем, НовыйДокОбъект.Валюта, Перечисления.Лико_ТипыПродукции.ГотоваяПродукция);
		НовыйДокОбъект.ДоговорПокупки = Лико_Дополнительно.НайтиСоглашениеИлиДоговорВРегистреЗаполненияРеглДок("ДоговорыКонтрагентов", НовыйДокОбъект.ОрганизацияПокупатель, НовыйДокОбъект.КонтрагентПродавец, Перечисления.ТипыДоговоров.СПоставщиком, НовыйДокОбъект.Валюта, Перечисления.Лико_ТипыПродукции.ГотоваяПродукция);
		НовыйДокОбъект.СоглашениеПродажи = Лико_Дополнительно.НайтиСоглашениеИлиДоговорВРегистреЗаполненияРеглДок("СоглашенияСКлиентами", НовыйДокОбъект.ОрганизацияПродавец, НовыйДокОбъект.КонтрагентПокупатель,, НовыйДокОбъект.Валюта, Перечисления.Лико_ТипыПродукции.ГотоваяПродукция);
		НовыйДокОбъект.СоглашениеПокупки = Лико_Дополнительно.НайтиСоглашениеИлиДоговорВРегистреЗаполненияРеглДок("СоглашенияСПоставщиками", НовыйДокОбъект.ОрганизацияПокупатель, НовыйДокОбъект.КонтрагентПродавец,, НовыйДокОбъект.Валюта, Перечисления.Лико_ТипыПродукции.ГотоваяПродукция);
		Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.ДоговорПродажи) ИЛИ НЕ ЗначениеЗаполнено(НовыйДокОбъект.ДоговорПокупки) ИЛИ НЕ ЗначениеЗаполнено(НовыйДокОбъект.СоглашениеПродажи) ИЛИ НЕ ЗначениеЗаполнено(НовыйДокОбъект.СоглашениеПокупки) Тогда
			ОтменитьТранзакцию();
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		НовыйДокОбъект.ДоговорМеждуОрганизациями = Лико_Дополнительно.НайтиСоглашениеИлиДоговорВРегистреЗаполненияРеглДок("ДоговорыКонтрагентов", НовыйДокОбъект.ОрганизацияПродавец, НовыйДокОбъект.ОрганизацияПокупатель, Перечисления.ТипыДоговоровМеждуОрганизациями.КупляПродажа, НовыйДокОбъект.Валюта, Перечисления.Лико_ТипыПродукции.ГотоваяПродукция);
		Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.ДоговорМеждуОрганизациями) Тогда
			ОтменитьТранзакцию();
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	НовыйДокОбъект.Автор = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
	
	ОтветственноеФизЛицо = НовыйДокОбъект.СкладПродажи.Лико_Площадка.ОтветственныйЗаПодписьПередач; // --> Начало Лико Ефимов ЕВВ 15.04.2025
	Если НЕ ЗначениеЗаполнено(ОтветственноеФизЛицо) Тогда
		ОтветственноеФизЛицо = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.ОрганизацияПродавец, "ОтветственныйЗаПодписьПередачМеждуОрганизациями_ce671d90ae534ad3a6853d1aae491b7a");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтветственноеФизЛицо) Тогда
		НовыйДокОбъект.ПодписьЗаРуководителя = ОтветственноеФизЛицо;
		НовыйДокОбъект.ПодписьЗаГлавногоБухгалтера = ОтветственноеФизЛицо;
		ОтветственноеФизЛицоЗаОтпускТовара = НовыйДокОбъект.СкладПродажи.Лико_Площадка.ОтветственныйЗаОтпускТовараГП; // --> Начало Лико Ефимов ЕВВ 16.01.2025
		Если НЕ ЗначениеЗаполнено(ОтветственноеФизЛицоЗаОтпускТовара) Тогда
			ОтветственноеФизЛицоЗаОтпускТовара = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.ОрганизацияПродавец, "ОтветственныйЗаПодписьПередачМеждуОрганизациямиЗаОтпускТовара_37683eb7070b410793b210117ccc3756");
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтветственноеФизЛицоЗаОтпускТовара) Тогда
			НовыйДокОбъект.ПодписьОтпустил = ОтветственноеФизЛицоЗаОтпускТовара;
		Иначе
			НовыйДокОбъект.ПодписьОтпустил = ОтветственноеФизЛицо;
		КонецЕсли;
	Иначе
		НовыйДокОбъект.ПодписьОтпустил = ?(ЗначениеЗаполнено(Кладовщик), Кладовщик, ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо);
		НовыйДокОбъект.ПодписьЗаРуководителя = ?(ЗначениеЗаполнено(ОтпускРазрешил), ОтпускРазрешил, НовыйДокОбъект.ПодписьОтпустил);
		НовыйДокОбъект.ПодписьЗаГлавногоБухгалтера = ?(ЗначениеЗаполнено(ОтпускПроизвел), ОтпускПроизвел, НовыйДокОбъект.ПодписьОтпустил);
	КонецЕсли;
	
	//КонецЕсли;
	
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	
	ПроцентУменьшенияЦеныПродажиОкилДляПередач = Лико_Дополнительно.ПолучитьНаценкуЦенуПерепродажи(НовыйДокОбъект.Дата, НовыйДокОбъект.ОрганизацияПродавец, НовыйДокОбъект.ОрганизацияПокупатель, НовыйДокОбъект.Валюта, "ГП", "Наценка");
	Если НЕ ЗначениеЗаполнено(ПроцентУменьшенияЦеныПродажиОкилДляПередач) Тогда
		Сообщить("Не задан процент уменьшения цены для продажи");
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	// Для пробников цену берем в евро всегда, а потом переводим по текущему курсу, если необходимо
	ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро = Лико_Дополнительно.ПолучитьНаценкуЦенуПерепродажи(НовыйДокОбъект.Дата, НовыйДокОбъект.ОрганизацияПродавец, НовыйДокОбъект.ОрганизацияПокупатель, ВалютаЕвро, "ГП_Пробники", "Цена");
	Если НЕ ЗначениеЗаполнено(ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро) Тогда
		Сообщить("Не задана цена перепродажи пробников");
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	КурсЕвро = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаЕвро, НовыйДокОбъект.Дата).Курс;
	КурсВалютыДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовыйДокОбъект.Валюта, НовыйДокОбъект.Дата).Курс;
	ЦенаПерепродажиПробниковМеждуОрганизациямиВРуб = ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро * КурсЕвро;
	КоэффициентЦены = (100 - ПроцентУменьшенияЦеныПродажиОкилДляПередач) / 100;
	ПробникиПродаватьПоОбычнымЦенам = НовыйДокОбъект.ОрганизацияПродавец = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра И (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона);
	
	Для каждого Строка из ТЗТовары Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Характеристика = Строка.Характеристика;
		НоваяСтрока.Количество = Строка.КоличествоОтгружено;
		НоваяСтрока.СтавкаНДС = Строка.СтавкаНДС;
		СтавкаНДСЧислом = НоваяСтрока.СтавкаНДС.Ставка;
		Если Строка.ЭтоПробник И НЕ ПробникиПродаватьПоОбычнымЦенам Тогда
			Если НовыйДокОбъект.Валюта = ВалютаЕвро Тогда
				НоваяСтрока.Цена = ЦенаПерепродажиПробниковМеждуОрганизациямиВЕвро;
			Иначе
				НоваяСтрока.Цена = ЦенаПерепродажиПробниковМеждуОрганизациямиВРуб / КурсВалютыДокумента;
			КонецЕсли;
			Если НоваяСтрока.Количество > 1 Тогда
				НоваяСтрока.Сумма = НоваяСтрока.Цена;
				НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
			КонецЕсли;
		Иначе
			НоваяСтрока.Цена = Строка.Цена;
			Если НЕ Строка.ЦенаВключаетНДС
				И Строка.ИсточникЦены <> "ЗаказКлиентаЦена" // Если истоник цены такой, значит цена уже с НДС и добавлять дополнительно не нужно
				Тогда
				// Нужно добавить НДС
				НоваяСтрока.Цена = НоваяСтрока.Цена * (100 + СтавкаНДСЧислом) / 100; 
			КонецЕсли;
			// Вычтем "наценку"
			НоваяСтрока.Цена = НоваяСтрока.Цена * КоэффициентЦены;
		КонецЕсли; 
		// --> Начало Лико Ефимов ЕВВ 01.12.2022
		Если НоваяСтрока.Цена = 0 Тогда
			НоваяСтрока.Цена = 1;
			НовыйДокОбъект.Комментарий = НовыйДокОбъект.Комментарий + Символы.ПС + "Для строки №" + НоваяСтрока.НомерСтроки + " не найдена цена, поэтому автоматически установлена 1";
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 01.12.2022
		Если НоваяСтрока.Сумма = 0 Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		КонецЕсли;
		НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		НоваяСтрока.Сумма,
		СтавкаНДСЧислом,
		НовыйДокОбъект.ЦенаВключаетНДС,
		НовыйДокОбъект.НалогообложениеНДС);
		НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма + ?(НовыйДокОбъект.ЦенаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
		НоваяСтрока.СвязанныйДокумент = Ссылка;
	КонецЦикла;
	
	НовыйДокОбъект.ПометкаУдаления = Ложь;
	
	Попытка
		//НовыйДокОбъект.Записать(?(НовыйДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось " + ?(НовыйДокОбъект.Проведен, "провести", "записать") + "! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьДокументПеремещениеТоваров(Таблица, УжеСозданныйДокумент = Неопределено, ТекущийСклад, ОрганизацияПеремещения, ЭтоПеремещениеСкладХраненияДругойПлощадки = Ложь)

	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	Если Таблица.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	ПерваяСтрока = Таблица[0];

	НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = ДатаОтгрузки;
	НовыйДокОбъект.СкладОтправитель = СкладГП;
	НовыйДокОбъект.Организация = ОрганизацияПеремещения;
	Если НовыйДокОбъект.СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион Тогда
		//НовыйДокОбъект.Организация = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.СкладОтправитель, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
		//Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.Организация) Тогда
			НовыйДокОбъект.Организация = Лико_Дополнительно.ОпределитьОрганизациюВладельцаТовара(ПерваяСтрока.Номенклатура, ПерваяСтрока.Характеристика, НовыйДокОбъект.СкладОтправитель, НовыйДокОбъект.Дата, УжеСозданныйДокумент);
		//КонецЕсли;
	КонецЕсли;
	Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки
		ИЛИ (НовыйДокОбъект.СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи
		И ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца)
		Тогда
		НовыйДокОбъект.Организация = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладГП, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
	КонецЕсли;
	НовыйДокОбъект.Ответственный = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.СкладПолучатель = ТекущийСклад;
	НовыйДокОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовыйДокОбъект.Комментарий = ПерваяСтрока.Комментарий + Символы.ПС;
	НовыйДокОбъект.Комментарий = "" + НовыйДокОбъект.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Перевозчик = ?(ЗначениеЗаполнено(Диспетчер), Диспетчер.Партнер, ПеревозчикЖДиАвиа.Партнер);
	Если ЗначениеЗаполнено(Перевозчик) И ЗначениеЗаполнено(АдресДоставки) Тогда
		НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
		НовыйДокОбъект.ПеревозчикПартнер = Перевозчик;
		НовыйДокОбъект.АдресДоставки = АдресДоставки;
		НовыйДокОбъект.АдресДоставкиЗначенияПолей = АдресДоставкиЗначенияПолей;
	Иначе
		НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	КонецЕсли;

	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	КурсВалюты = РегистрыСведений.КурсыВалют.СрезПоследних(ДатаОтгрузки, Новый Структура("Валюта", ВалютаУпр));
	Курс = КурсВалюты[0].Курс;
	Если Курс = 0 Тогда
		Курс = 1;
	КонецЕсли;
	Если ДатаОтгрузки >= Дата('20260101') Тогда
		СтавкаНДС = 22;
	ИначеЕсли ДатаОтгрузки >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
		СтавкаНДС = 20;
	Иначе
		СтавкаНДС = 18;
	КонецЕсли;
	Для каждого Строка из Таблица Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, "Упаковка");
		НоваяСтрока.Количество = Строка.КоличествоОтгружено;
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		Если ЭтоПеремещениеСкладХраненияДругойПлощадки Тогда
			НоваяСтрока.Лико_Цена = Строка.ЦенаИзЗаказа;
			НоваяСтрока.Лико_ЦенаРегл = НоваяСтрока.Лико_Цена * Курс;
		Иначе
			НоваяСтрока.Лико_Цена = Строка.ЦенаЕвро;
			Если Строка.Валюта = ВалютаУпр Тогда
				НоваяСтрока.Лико_ЦенаРегл = Строка.ЦенаЕвро * Курс;
			Иначе
				НоваяСтрока.Лико_ЦенаРегл = Строка.Цена;
			КонецЕсли;
			Если НЕ Строка.ЦенаВключаетНДС Тогда
				НоваяСтрока.Лико_Цена = НоваяСтрока.Лико_Цена * (100 + СтавкаНДС) / 100;
				НоваяСтрока.Лико_ЦенаРегл = НоваяСтрока.Лико_ЦенаРегл * (100 + СтавкаНДС) / 100;
			КонецЕсли;
		КонецЕсли;

		НоваяСтрока.Лико_Сумма = НоваяСтрока.Количество * НоваяСтрока.Лико_Цена;
	КонецЦикла;

	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;

	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;

КонецФункции

Функция СоздатьДокументПриемкаТоваровНаХранение(Основание, УжеСозданныйДокумент = Неопределено) 
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ПриемкаТоваровНаХранение.СоздатьДокумент();
	НовыйДокОбъект.Склад = СкладРегиона;
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЗаполнитьЗначенияСвойств(НовыйДокОбъект, Основание, "Дата,Валюта,Партнер,Организация,Подразделение,Контрагент,Менеджер,Согласован");
		СписокРеквизитовТЧДляКопирования = "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Количество,Цена,Сумма";
		ЦенаВключаетНДС = Основание.ЦенаВключаетНДС;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		СписокРеквизитовТЧДляКопирования = "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Количество";
		НовыйДокОбъект.Дата = Основание.Дата;
		НовыйДокОбъект.Подразделение = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.Склад, "Подразделение_8b6aafc5a2e14ba0889da315170788bd");
		НовыйДокОбъект.Организация = СкладРегиона.Лико_Площадка.Организация;
		НовыйДокОбъект.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		НовыйДокОбъект.Контрагент = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Основание.Товары[0].Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация, "КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
		НовыйДокОбъект.Партнер = НовыйДокОбъект.Контрагент.Партнер;
		НовыйДокОбъект.Менеджер = Основание.Ответственный;
		ЦенаВключаетНДС = Истина;
		НовыйДокОбъект.Согласован = Истина;
		Если НовыйДокОбъект.Дата >= Дата('20260101') Тогда
			СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);
		ИначеЕсли НовыйДокОбъект.Дата >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
			СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
		Иначе
			СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
		КонецЕсли;
	КонецЕсли;
	
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи;
	НовыйДокОбъект.Договор = Лико_Дополнительно.НайтиИлиСоздатьДоговорНаОтветственноеХранение(НовыйДокОбъект.Дата, НовыйДокОбъект.Контрагент, НовыйДокОбъект.Организация, НовыйДокОбъект.Валюта);
	НовыйДокОбъект.Автор = ?(ЗначениеЗаполнено(СоздалЗаявку) И ТипЗнч(СоздалЗаявку) = ТИП("СправочникСсылка.Пользователи"), СоздалЗаявку, ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
	НовыйДокОбъект.ВидЦеныПоставщика = Лико_Дополнительно.НайтиИлиСоздатьВидЦеныПоставщика(НовыйДокОбъект.Партнер, НовыйДокОбъект.Валюта, ЦенаВключаетНДС);
	НовыйДокОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + ЭтотОбъект + """";
	
	Для каждого Строка из Основание.Товары Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, СписокРеквизитовТЧДляКопирования);
		НоваяСтрока.Склад = НовыйДокОбъект.Склад;
		Если ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			// --> Начало Лико Ефимов ЕВВ 31.05.2023
			// Из документа ПриемкаТоваровНаХранение убрали признак НДС. Полагаю, что теперь цены должны быть всегда с НДС
			Если НЕ Основание.ЦенаВключаетНДС Тогда
				НоваяСтрока.Сумма = Строка.СуммаСНДС;
				НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок;
			КонецЕсли;
			// <-- Конец Лико Ефимов ЕВВ 31.05.2023
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			НоваяСтрока.Цена = Строка.Лико_Цена;
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
			//НоваяСтрока.СтавкаНДС = СтавкаНДС;
			//СтруктураДействий = Новый Структура;
			//СтруктураДействий.Вставить("ПересчитатьСумму");
			//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовыйДокОбъект.ЦенаВключаетНДС, НоваяСтрока.СтавкаНДС));
			//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
			//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции 

Функция СоздатьДокументОтгрузкаТоваровСХранения(УжеСозданныйДокумент = Неопределено, ТоварыВРеализацию, ПеремещениеТоваров = Неопределено) 
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаРуб = Константы.ВалютаРегламентированногоУчета.Получить();
	ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи = СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи;
	
	Если ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		ПерваяСтрока = ПеремещениеТоваров.Товары[0];
	Иначе
		ПерваяСтрока = ТоварыВРеализацию[0];
	КонецЕсли;
	
	НовыйДокОбъект = Документы.ОтгрузкаТоваровСХранения.СоздатьДокумент();
	Если ЗначениеЗаполнено(ПеремещениеТоваров) ИЛИ ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи Тогда
		НовыйДокОбъект.Контрагент = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ПерваяСтрока.Характеристика.Лико_ЗаказНоменклатуры.Площадка.Организация, "КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
		НовыйДокОбъект.Организация = СкладРегиона.Лико_Площадка.Организация;
		НовыйДокОбъект.Склад = СкладГП;
		НовыйДокОбъект.Подразделение = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйДокОбъект.Склад, "Подразделение_8b6aafc5a2e14ba0889da315170788bd");
		НовыйДокОбъект.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
		НовыйДокОбъект.Партнер = НовыйДокОбъект.Контрагент.Партнер;
	Иначе
		НовыйДокОбъект.Контрагент = ПерваяСтрока.Контрагент;
		НовыйДокОбъект.Организация = ОрганизацияПродавецКлиенту;
		НовыйДокОбъект.Подразделение = ПолучитьПодразделениеПоРегиону(ПерваяСтрока.ЗаказКлиента.Регион);
		НовыйДокОбъект.Склад = СкладГП;
		НовыйДокОбъект.Валюта = ПерваяСтрока.Валюта;
		Если ПерваяСтрока.Грузополучатель <> ПерваяСтрока.Контрагент Тогда
			НовыйДокОбъект.Грузополучатель = ПерваяСтрока.Грузополучатель;
			НовыйДокОбъект.БанковскийСчетГрузополучателя = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(ПерваяСтрока.Грузополучатель, Константы.ВалютаРегламентированногоУчета.Получить());
		КонецЕсли;
		ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ПерваяСтрока.Контрагент.Партнер, "ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа_fca67e4d4a11435ca3926adb18a18d38", Ложь);
		Если ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа Тогда
			НовыйДокОбъект.Партнер = ПерваяСтрока.Контрагент.Партнер;
		Иначе
			НовыйДокОбъект.Партнер = ПерваяСтрока.ЗаказКлиента.Партнер;
		КонецЕсли;
	КонецЕсли;
	
	НовыйДокОбъект.Дата = ДатаОтгрузки;
	НовыйДокОбъект.Менеджер = Менеджер; 
	
	НовыйДокОбъект.Договор = Лико_Дополнительно.НайтиИлиСоздатьДоговорНаОтветственноеХранение(НовыйДокОбъект.Дата, НовыйДокОбъект.Контрагент, НовыйДокОбъект.Организация, НовыйДокОбъект.Валюта);
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтгрузкаПринятыхСПравомПродажиТоваровСХранения;
	НовыйДокОбъект.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(НовыйДокОбъект.Контрагент, ВалютаРуб);
	НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	НовыйДокОбъект.Лико_ЭтоСписаниеСоСкладаОтветственногоХранения = ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения;
	НовыйДокОбъект.АдресДоставки = АдресДоставки;
	НовыйДокОбъект.АдресДоставкиЗначенияПолей = АдресДоставкиЗначенияПолей;
	НовыйДокОбъект.Комментарий = "" + НовыйДокОбъект.Комментарий + "Создан автоматически на основании документа """ + Ссылка + """";
	
	Если ПеремещениеТоваров = Неопределено Тогда
		Для каждого Строка из ТоварыВРеализацию Цикл
			НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Характеристика = Строка.Характеристика;
			НоваяСтрока.Упаковка = Строка.Номенклатура.ЕдиницаИзмерения;
			НоваяСтрока.КоличествоУпаковок = Строка.КоличествоОтгружено;
			НоваяСтрока.Количество = Строка.КоличествоОтгружено;
			Если ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи Тогда
				НоваяСтрока.Цена = Строка.ЦенаИзЗаказа;
			Иначе
				НоваяСтрока.Цена = Строка.Цена;
			КонецЕсли;
			//НоваяСтрока.СтавкаНДС = Строка.СтавкаНДС;
			НоваяСтрока.Склад = НовыйДокОбъект.Склад;
			
			Если НЕ ПерваяСтрока.ЦенаВключаетНДС Тогда
				// добавим НДС
				НоваяСтрока.Цена = НоваяСтрока.Цена * (100 + Строка.СтавкаНДС.Ставка) / 100;
			КонецЕсли;
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
			
			//СтруктураДействий = Новый Структура;
			//СтруктураДействий.Вставить("ПересчитатьСумму");
			//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовыйДокОбъект.ЦенаВключаетНДС, НоваяСтрока.СтавкаНДС));
			//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
			//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		КонецЦикла;
	Иначе
		Для каждого Строка из ПеремещениеТоваров.Товары Цикл
			НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Количество");
			НоваяСтрока.Склад = НовыйДокОбъект.Склад;
			НоваяСтрока.Цена = Строка.Лико_Цена;
			НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
			//НоваяСтрока.СтавкаНДС = СтавкаНДС;
			//СтруктураДействий = Новый Структура;
			//СтруктураДействий.Вставить("ПересчитатьСумму");
			//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", НовыйДокОбъект.ЦенаВключаетНДС, НоваяСтрока.СтавкаНДС));
			//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
			//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		КонецЦикла;
	КонецЕсли;
	
	//НовыйДокОбъект.Товары.Сортировать("Характеристика,Номенклатура");
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер,Лико_ОбщаяСтоимостьДоставки,Лико_СкладДляРасчетаСтоимостиДоставки");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции 

Процедура ПриКопировании(ОбъектКопирования)
	
	Сканы = Ложь;
	ОбщаяСтоимостьДоставки = 0;
	СозданНаОснованииПолученияГПИзПроизводства = Ложь;
	СтатусВыгрузкиЭлектронныхДокументов = Неопределено;
	СтатусОтправкиПакетаДокументовКлиентуПоПочте = Неопределено;
	Комментарий = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//
	//Если ДополнительныеСвойства.Свойство("Лико_ПровестиТолькоПоРНЛико_СтоимостьДоставки") Тогда
	//	РассчитатьСтоимостьДоставки();
	//	Возврат;
	//КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Площадка) Тогда
		Сообщить("В документе """ + Ссылка + """ не заполнена площадка");
		Отказ = Истина;
	КонецЕсли;
	
	Если Площадка.Организация <> Организация Тогда
		Организация = Площадка.Организация;
	КонецЕсли;
	
	Если СозданНаОснованииПолученияГПИзПроизводства И НЕ РольДоступна("ПолныеПрава") И НЕ ДополнительныеСвойства.Свойство("Лико_СозданиеИзПолученияГПИзПроизводства") И НЕ ДополнительныеСвойства.Свойство("ЗаписьИзОтборРазмещениеТоваров") Тогда
		Сообщить("Документ создан на основании " + Метаданные.Документы.Лико_ПолучениеГПИзПроизводства.Представление() + ", корректировка запрещена");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ ДополнительныеСвойства.Свойство("РазрешеноМенятьЗакрытуюЗаявку") И НЕ ДополнительныеСвойства.Свойство("ЗаписьИзОтборРазмещениеТоваров") Тогда
		Сообщить("Заявка уже закрыта. Изменения запрещены");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Дата > ТекущаяДата() И НЕ РольДоступна("ПолныеПрава") Тогда
		Сообщить("Дата (и время) документа не может быть больше текущей даты");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ СкладГП.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
		Сообщить("Складом ГП возможно выбрать только ордерные склады");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.СкладГП <> СкладГП И (Ссылка.Продукция.Количество() > 0 ИЛИ Продукция.Количество() > 0) Тогда
		// Меняют склад ГП в заявке, у которой уже есть коробки
		Сообщить("Для изменения склада ГП необходимо сначала очистить таблицу ""Продукция"", затем сохранить заявку, а уже после этого изменить склад");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда // Проверки для закрытых заявок
		
		Если Продукция.Итог("Мест") = 0 Тогда
			Сообщить("Запись в статусе ""Закрыт"" невозможна, т.к. не отобрано ни одной коробки");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(АдресДоставки)
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
			Тогда
			Сообщить("Нужно заполнить адрес доставки");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
			//ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
			//ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки)
			И НЕ ЗначениеЗаполнено(СкладРегиона) Тогда
			Сообщить("Нужно заполнить склад хранения");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона2 
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца 
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона) 
			И НЕ ЗначениеЗаполнено(СкладРегиона) Тогда
			Сообщить("Нужно заполнить склад региона");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТипОтгрузки) И НЕ ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента") Тогда
			Сообщить("Нужно заполнить тип отгрузки");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Грузоотправитель) И НЕ ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента") Тогда
			Сообщить("Нужно заполнить грузоотправителя");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Грузоотправитель = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра И ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца Тогда
			Сообщить("Для списания этикетки с организации ""Ликофлекс"" необходимо выбирать тип отгрузки ""Списание со склада производства""");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца 
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона 
			//ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона2 
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона)
			И (НЕ ЗначениеЗаполнено(СкладРегиона)
			ИЛИ СкладРегиона.ИспользоватьОрдернуюСхемуПриОтгрузке) Тогда
			Сообщить("Для выбранного типа отгрузки нужно выбрать склад региона (неордерный)");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения 
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки 
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки)
			И (НЕ ЗначениеЗаполнено(СкладРегиона)
			ИЛИ НЕ СкладРегиона.ИспользоватьОрдернуюСхемуПриОтгрузке) Тогда
			Сообщить("Для выбранного типа отгрузки нужно выбрать склад региона (ордерный)");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки И СкладГП.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки И СкладГП.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи)
			ИЛИ (ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки И СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки)
			Тогда
			Отказ = Истина;
			Сообщить("Для склада """ + СкладГП + """ недоступен тип отгрузки """ + ТипОтгрузки + """");
		КонецЕсли;
		
		Если (СкладРегиона.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки)
			ИЛИ (СкладРегиона.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки И СкладРегиона.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи И ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки)
			Тогда
			Отказ = Истина;
			Сообщить("Для склада """ + СкладРегиона + """ недоступен тип отгрузки """ + ТипОтгрузки + """");
		КонецЕсли;
		
		Если СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи
			И НЕ (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца) Тогда
			Отказ = Истина;
			Сообщить("Для склада """ + СкладГП + """ недоступен тип отгрузки """ + ТипОтгрузки + """");
		КонецЕсли;
		
		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки)
			И СкладРегиона.Лико_Площадка.Организация = Организация Тогда
			Отказ = Истина;
			Сообщить("Нельзя перемещать товар на склад отв. хранения СВОЕЙ площадки");
		КонецЕсли;
		
		Если СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки Тогда
			Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки)
				И СкладРегиона.Лико_Площадка.Организация <> Организация Тогда
				Отказ = Истина;
				Сообщить("Нельзя перемещать товар со склада отв. хранения на склад ЧУЖОЙ площадки");
			КонецЕсли;
			
			Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки)
				И СкладГП.Лико_Площадка.Организация = Организация Тогда
				Отказ = Истина;
				Сообщить("Нельзя перемещать товар со склада отв. хранения СВОЕЙ площадки");
			КонецЕсли;
		КонецЕсли;
		
		Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения)
			И ЗначениеЗаполнено(СкладРегиона)
			И Дата >= Дата('20201111000000') Тогда
			Отказ = Истина;
			Сообщить("Для типа отгрузки """ + ТипОтгрузки + """ не нужно заполнять склад региона");
		КонецЕсли;
		
		Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца
			И СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион
			И ЗначениеЗаполнено(СкладРегиона.Лико_Площадка)
			И СкладРегиона.Лико_Площадка = СкладГП.Лико_Площадка
			Тогда
			// Когда Урал реализует беслатно этикетки со склад "ОКИЛ Авантаж ОРДЕРНЫЙ" и указывает складом региона "АВ Не ордерный"
			Отказ = Истина;
			Сообщить("При бесплатной отгрузке со склада ГП с типом склада ""Регион"" реквизит ""Площадка"" у склада ГП и у склада региона не могут быть одинаковыми. Измените склад региона")
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(КорректировкаКонтрагент) И НЕ ЗначениеЗаполнено(КорректировкаГрузополучатель) И НЕ ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента") Тогда
		//	Сообщить("Вы изменили корректируемого контрагента, поэтому нужно заполнить еще и корректируемого грузополучателя (даже если они совпадают)");
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		
		Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
			И СкладРегиона.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас
			Тогда
			Отказ = Истина;
			Сообщить("Для типа отгрузки """ + ТипОтгрузки + """ нужно выбрать склад хранения с типом """ + Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас + """");
		КонецЕсли;
		
		Если СкладРегиона.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Производство 
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки
			Тогда
			Отказ = Истина;
			Сообщить("Складом региона / хранения не может быть склад производства");
		КонецЕсли;
		
		Если СкладГП = СкладРегиона Тогда
			Отказ = Истина;
			Сообщить("Склад ГП и склад региона не может совпадать");
		КонецЕсли;
		
		Если СкладРегиона.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
			Тогда
			Отказ = Истина;
			Сообщить("Для типа отгрузки """ + ТипОтгрузки + """ запрещено выбирать склад хранения с типом """ + Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас + """");
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СкладРегиона) И Площадка = Справочники.Лико_Площадки.Линкс Тогда
			ОрганизацияВладелецСкладаРегиона = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладРегиона, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
			Если Грузоотправитель <> ОрганизацияВладелецСкладаРегиона Тогда
				Отказ = Истина;
				Сообщить("Склад региона """ + СкладРегиона + """ не принадлежит организации-продавцу """ + Грузоотправитель + """. Формирование документов невозможно");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Статус <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт 
		И (ДополнительныеСвойства.Свойство("ПерезаполнитьТипОтгрузкиИзЗаявки")
		ИЛИ ЗаказыНаОтгрузку.Количество() <> Ссылка.ЗаказыНаОтгрузку.Количество())
		Тогда
		
		Если ЗаказыНаОтгрузку.Количество() > 0 Тогда
			ТипОтгрузки = ЗаказыНаОтгрузку[ЗаказыНаОтгрузку.Количество()-1].ЗаявкаНаОтгрузку.ТипОтгрузки;
			ТипЗаявки = ЗаказыНаОтгрузку[ЗаказыНаОтгрузку.Количество()-1].ЗаявкаНаОтгрузку.ТипЗаявки;
			
			Грузоотправитель = ЗаказыНаОтгрузку[ЗаказыНаОтгрузку.Количество()-1].ЗаявкаНаОтгрузку.ОрганизацияПродавец;
			СтруктураАдрес = ПолучитьАдресГрузоотправителя();
			АдресГрузоотправителя = СтруктураАдрес.Адрес;
			АдресГрузоотправителяЗначенияПолей = СтруктураАдрес.АдресЗначенияПолей;
			
			Если ЗначениеЗаполнено(ЗаказыНаОтгрузку[ЗаказыНаОтгрузку.Количество()-1].ЗаявкаНаОтгрузку.СкладХранения) Тогда
				СкладРегиона = ЗаказыНаОтгрузку[ЗаказыНаОтгрузку.Количество()-1].ЗаявкаНаОтгрузку.СкладХранения;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Ссылка.ТипОтгрузки) И Ссылка.ТипОтгрузки <> ТипОтгрузки Тогда
				Сообщить("Внимание! В заявке " + Номер + " изменен тип отгрузки с """ + Ссылка.ТипОтгрузки + """ на """ + ТипОтгрузки);
			КонецЕсли;
			Если ЗначениеЗаполнено(Ссылка.ТипЗаявки) И Ссылка.ТипЗаявки <> ТипЗаявки Тогда
				Сообщить("Внимание! В заявке " + Номер + " изменен тип заявки с """ + Ссылка.ТипЗаявки + """ на """ + ТипЗаявки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Дата >= Дата('20190131')
		// --> Начало Лико Ефимов ЕВВ 10.05.2023
		// Сделаем исключение для ПеремещениеКлиентуСоСкладаХранения, т.к. здесь нет продажи клиенту, поэтому площадку проверять не нужно
		// Скорее всего со временем сюда можно будет в исключения написать все типы, при которых не создается реализация, потому что насколько
		// я помню, ограничение делали для того, чтобы в договоре реализации однозначно можно было проставить площадку, которой пользуется Капкин в своих отчетах
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		// <-- Конец Лико Ефимов ЕВВ 10.05.2023
		Тогда
		// Проверим, чтобы не было повторяющихся площадок
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧЗаявки.ЗаказКлиента КАК ЗаказКлиента
		|ПОМЕСТИТЬ ВТ_ТЧЗаявки
		|ИЗ
		|	&ТЧЗаявки КАК ТЧЗаявки
		|;
		|ВЫБРАТЬ
		|	ТЧПродукция.ЗаказКлиента КАК ЗаказКлиента
		|ПОМЕСТИТЬ ВТ_ТЧПродукция
		|ИЗ
		|	&ТЧПродукция КАК ТЧПродукция
		|;
		|ВЫБРАТЬ
		|	ВТ_ТЧЗаявки.ЗаказКлиента
		|ПОМЕСТИТЬ ВТ_ВсеЗаказы
		|ИЗ
		|	ВТ_ТЧЗаявки КАК ВТ_ТЧЗаявки
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ВТ_ТЧПродукция.ЗаказКлиента
		|ИЗ
		|	ВТ_ТЧПродукция КАК ВТ_ТЧПродукция
		|;
		|ВЫБРАТЬ
		|	ВТ_ВсеЗаказы.ЗаказКлиента.Площадка КАК ЗаказКлиентаПлощадка
		|ИЗ
		|	ВТ_ВсеЗаказы КАК ВТ_ВсеЗаказы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеЗаказы.ЗаказКлиента.Площадка";
		Запрос.УстановитьПараметр("ТЧЗаявки", ЗаказыНаОтгрузку.Выгрузить(,"ЗаказКлиента"));	
		Запрос.УстановитьПараметр("ТЧПродукция", Продукция.Выгрузить(,"ЗаказКлиента"));	
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			Сообщить("В одной заявке на транспортировку не могут содержаться заказы с разными площадками");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 27.06.2022
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт 
		И НачалоДня(Дата) = НачалоДня(ТекущаяДата()) 
		И Дата < ТекущаяДата() 
		И НЕ РольДоступна("ПолныеПрава")
		И НЕ ДополнительныеСвойства.Свойство("ИзменитьИнформациюОПеревозчике")
        И НЕ ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента")
		Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 27.06.2022
	
	// Перезаполним количество из серий
	//Для каждого Строка из Продукция Цикл
	//	Строка.Количество = Строка.Серия.Лико_КоличествоВУпаковке;
	//КонецЦикла;
	ПерезаполнитьКоличествоИзСерий();
	
	// Проверим, чтобы в ТЧ ЗаказыНаОтгрузку не было дублирующихся строк
	ТЗЗаказыНаОтгрузку = ЗаказыНаОтгрузку.Выгрузить();
	//ТЗЗаказыНаОтгрузку.Свернуть("ЗаказКлиента,Номенклатура,Характеристика,Контрагент,Намотка,Город,КодЭтикеткиЗаказчика,НомерПоставки,ЗаявкаНаОтгрузку");
	ТЗЗаказыНаОтгрузку.Свернуть("ЗаказКлиента,Номенклатура,Характеристика,Контрагент,Намотка,Город,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки");
	Если ТЗЗаказыНаОтгрузку.Количество() <> ЗаказыНаОтгрузку.Количество() Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В ТЧ ""Заявки"" есть дублирующиеся строки (скорее всего в заявках на отгрузку содержатся одинаковые заказы)");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПересчитатьПодобранноеКоличество();
	Если НЕ ЗначениеЗаполнено(Контрагент) И ЗаказыНаОтгрузку.Количество() > 0 Тогда
		Контрагент = ЗаказыНаОтгрузку[0].Контрагент;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
	Если Ссылка.Статус <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда // --> Начало Лико Ефимов ЕВВ 24.03.2022 Будем перезаполнять менеджера для всех незакрытых заявок, чтобы избежать ситуаций, когда меняется заявка на отгрузку, а менеджер остается из старой заявки
		Попытка
			// Менеджера нужно брать из контрагента, а не из грузополучателя (в заявке на транспортироку в реквизите контрагент на самом деле хранится грузополучатель)
			// 20180927 поменяли - теперь берем менеджера из заказа
			Менеджер = ЗаказыНаОтгрузку[0].ЗаказКлиента.Менеджер;
		Исключение
			Если Продукция.Количество() > 0 Тогда
				Менеджер = Продукция[0].ЗаказКлиента.Менеджер;
			КонецЕсли;
		КонецПопытки;
	КонецЕсли;
	
	Если ЗаказыНаОтгрузку.Количество() > 0 И НЕ ЗначениеЗаполнено(АдресДоставки) Тогда
		АдресДоставки = ЗаказыНаОтгрузку[0].АдресДоставки;
		АдресДоставкиЗначенияПолей = ЗаказыНаОтгрузку[0].АдресДоставкиЗначенияПолей;
		// --> Начало Лико Ефимов ЕВВ 02.08.2022
		// уберу, чтобы посмотреть, к чему это приведет
		//Если НЕ ЗначениеЗаполнено(АдресДоставки) И ЗначениеЗаполнено(Контрагент) Тогда
		//	АдресаДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.Лико_ПредопределенныеЗначения.ВидКонтактнойИнформацииАдресДоставки.ЗначениеПараметра, Дата, Ложь);
		//	Если НЕ ЗначениеЗаполнено(АдресаДоставки) Тогда
		//		АдресаДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, Дата, Ложь);
		//	КонецЕсли;
		//	Если ЗначениеЗаполнено(АдресаДоставки) И АдресаДоставки.Количество() > 0 Тогда
		//		АдресДоставкиЗначенияПолей = АдресаДоставки[0].ЗначенияПолей;
		//		АдресДоставки = АдресаДоставки[0].Представление;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона Тогда
		МассивСчетовНаОплату = Новый Массив;
		Для каждого Строка из ЗаказыНаОтгрузку Цикл
			Если МассивСчетовНаОплату.Найти(Строка.СчетНаОплату) = Неопределено Тогда
				МассивСчетовНаОплату.Добавить(Строка.СчетНаОплату);
			КонецЕсли;
		КонецЦикла;
		Если МассивСчетовНаОплату.Количество() > 1 Тогда
			Сообщить("Вы пытаетесь сохранить заявку, в которой больше одного счета на предоплату (либо есть строки со счетом и есть строки без счета)");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения И Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента") Тогда
			// не нужно	
		Иначе
			
			Таблица = Продукция.Выгрузить(,"Серия,Мест,НомерСтроки");
			Таблица.Очистить();
			Для каждого Строка из Продукция Цикл
				Если Строка.Мест > 0 Тогда
					НоваяСтрока = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				КонецЕсли;
			КонецЦикла;
			
			ЗапросЯС = Новый Запрос;
			ЗапросЯС.Текст = "ВЫБРАТЬ
			|	Т.НомерСтроки,
			|	Т.Серия,
			|	Т.Мест
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&Таблица КАК Т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.НомерСтроки,
			|	ВТ.Серия,
			|	ВТ.Мест,
			|	МАКСИМУМ(Лико_АдресноеХранение.Период) КАК ДатаРазмещения,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_АдресноеХранение.Паллет) КАК КоличествоРазличныхПаллет,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_АдресноеХранение.Ячейка) КАК КоличествоРазличныхАдресХранения,
			|	МАКСИМУМ(ЕСТЬNULL(Лико_АдресноеХранение.Ячейка, НЕОПРЕДЕЛЕНО)) КАК Ячейка,
			|	МАКСИМУМ(Лико_АдресноеХранение.Паллет) КАК Паллет
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_АдресноеХранение.СрезПоследних(&Период, Регистратор <> &Ссылка) КАК Лико_АдресноеХранение
			|		ПО (Лико_АдресноеХранение.Серия = ВТ.Серия)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ.НомерСтроки,
			|	ВТ.Серия,
			|	ВТ.Мест";
			
			ЗапросЯС.УстановитьПараметр("Таблица", Таблица);
			ЗапросЯС.УстановитьПараметр("Ссылка", Ссылка);
			Если (Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента")) // Коловалов добавляет стоимость доставки
				ИЛИ ДополнительныеСвойства.Свойство("ПроверятьАдресноеХранениеНаДатуДокумента") // На всякий случай, вдруг нужно будет провести такой документ
				Тогда
				ЗапросЯС.УстановитьПараметр("Период", ДатаОтгрузки);
			Иначе
				ЗапросЯС.УстановитьПараметр("Период", Дата('39991231'));
			КонецЕсли;
			
			
			РезультатЗапросаЯС = ЗапросЯС.Выполнить();
			ВыборкаЯС = РезультатЗапросаЯС.Выбрать();
			
			ЯС_ТекстОшибки = "";
			ДатаПроведенияПоАдресномуСкладу = Дата;
			Пока ВыборкаЯС.Следующий() Цикл
				
				Если ВыборкаЯС.КоличествоРазличныхАдресХранения > 1 Тогда
					ЯС_ТекстОшибки = ЯС_ТекстОшибки + "Внимание! Коробка " + ВыборкаЯС.Серия + " находится по " + ВыборкаЯС.КоличествоРазличныхАдресХранения + " разным адресам" + Символы.ПС;
					Отказ = Истина;
				КонецЕсли;
				
				Если ВыборкаЯС.КоличествоРазличныхПаллет > 1 Тогда
					ЯС_ТекстОшибки = ЯС_ТекстОшибки + "Внимание! Коробка " + ВыборкаЯС.Серия+" находится по " + ВыборкаЯС.КоличествоРазличныхПаллет + " разным паллетам" + Символы.ПС;
					Отказ = Истина;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаЯС.Ячейка) Тогда
					ЯС_ТекстОшибки = ЯС_ТекстОшибки + "Внимание! Коробка (" + ВыборкаЯС.Серия + ") не зарегистрирована в ячеистом складе" + Символы.ПС;
					Отказ = Истина;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаЯС.Ячейка)
					И ВыборкаЯС.Ячейка.Владелец <> СкладГП
					И НЕ (Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента")) // У Коновалова проблемы из-за переноса ячеек ГП на основной склад
					Тогда
					ЯС_ТекстОшибки = ЯС_ТекстОшибки + "Внимание! Коробка (" + ВыборкаЯС.Серия + ") лежит на другом ячеистом складе (" + ВыборкаЯС.Ячейка.Владелец + ")" + Символы.ПС;
					Отказ = Истина;
				КонецЕсли;
				
				Если НЕ Отказ Тогда
					ДатаПроведенияПоАдресномуСкладу = ?(ДатаПроведенияПоАдресномуСкладу > ВыборкаЯС.ДатаРазмещения, ДатаПроведенияПоАдресномуСкладу, ВыборкаЯС.ДатаРазмещения + 1);
				КонецЕсли;	
			КонецЦикла;
			
			Если СокрЛП(ЯС_ТекстОшибки) <> "" Тогда
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("ОШИБКА! Есть ошибки по хранению: " + Символы.ПС + ЯС_ТекстОшибки);
			КонецЕсли;
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
			ВыборкаЯС.Сбросить();
			Пока ВыборкаЯС.Следующий() Цикл
				СтрокаПродукции = Продукция[ВыборкаЯС.НомерСтроки - 1];
				СтрокаПродукции.АдресХранения = ВыборкаЯС.Ячейка;
				СтрокаПродукции.Паллет = ВыборкаЯС.Паллет;
			КонецЦикла;
			
			ВыборкаЯС.Сбросить();
			
			ДополнительныеСвойства.Вставить("ВыборкаЯС", ВыборкаЯС);
		КонецЕсли;
		
		Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И ЗначениеЗаполнено(НачалоСборки) И НЕ ЗначениеЗаполнено(ОкончаниеСборки) Тогда
			ОкончаниеСборки = ТекущаяДата();
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресДоставкиЗначенияПолей) Тогда
		ОбщегоНазначенияУТВызовСервера.ЗаполнитьЗначенияПолейКИПоПредставлению(АдресДоставки, АдресДоставкиЗначенияПолей);
	КонецЕсли;
	
	ДатаОтгрузки = Макс(Дата, ДатаПроведенияПоАдресномуСкладу);
	РассчитатьСтоимостьДоставки();
	
	Если КорректировкаВалюта <> Ссылка.КорректировкаВалюта ИЛИ КорректировкаГрузополучатель <> Ссылка.КорректировкаГрузополучатель ИЛИ КорректировкаКонтрагент <> Ссылка.КорректировкаКонтрагент ИЛИ КорректировкаОтгрузкаВРублях <> Ссылка.КорректировкаОтгрузкаВРублях Тогда
		ДополнительныеСвойства.Вставить("ИзменилисьКорректируемыеПараметры", Истина);
	КонецЕсли;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И Ссылка.Статус <> Статус Тогда
		// Изменился статус на закрыт
		ДатаЗакладкиТермодатчиков = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НачалоСборки) Тогда
		НачалоСборки = ТекущаяДата();
		Сборщик = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И Ссылка.Статус <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
		ЛикоИспользоватьВыгрузкуEDIСообщений = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Контрагент, "ЛикоИспользоватьВыгрузкуEDIСообщений", Ложь);
		Если ЛикоИспользоватьВыгрузкуEDIСообщений И СтатусВыгрузкиЭлектронныхДокументов = 0 Тогда
			СтатусВыгрузкиЭлектронныхДокументов = 1;
		ИначеЕсли НЕ ЛикоИспользоватьВыгрузкуEDIСообщений И СтатусВыгрузкиЭлектронныхДокументов <> 0 Тогда
			СтатусВыгрузкиЭлектронныхДокументов = 0;
		КонецЕсли;
	КонецЕсли;
	
	// --> Начало Лико Яцун 02.02.2023 
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт 
		И (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту 
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения 
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения) Тогда
		Если СтатусОтправкиПакетаДокументовКлиентуПоПочте <> 2 Тогда
			КонтрагентДляОтправкиПакетаДокументовПоПочте = Неопределено;
			Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения Тогда
				Если ЗначениеЗаполнено(КорректировкаКонтрагент) Тогда
					КонтрагентДляОтправкиПакетаДокументовПоПочте = КорректировкаКонтрагент;
				Иначе
					МассивКонтрагентовДляОтправкиПакетаДокументовПоПочте = ПолучитьМассивКонтрагентовПартнеров();
					Если МассивКонтрагентовДляОтправкиПакетаДокументовПоПочте.Количество() = 1 Тогда
						КонтрагентДляОтправкиПакетаДокументовПоПочте = МассивКонтрагентовДляОтправкиПакетаДокументовПоПочте[0];
					КонецЕсли;
				КонецЕсли;
			Иначе
				КонтрагентДляОтправкиПакетаДокументовПоПочте = ?(ЗначениеЗаполнено(КорректировкаГрузополучатель), КорректировкаГрузополучатель, Контрагент);
			КонецЕсли;
				
			Если ЗначениеЗаполнено(КонтрагентДляОтправкиПакетаДокументовПоПочте) Тогда
				АдресЭлектроннойПочтыДляОтправкиПакетаДокументов = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,КонтрагентДляОтправкиПакетаДокументовПоПочте,"АдресЭлектроннойПочтыДляОтправкиПакетаДокументов");
				Если ЗначениеЗаполнено(АдресЭлектроннойПочтыДляОтправкиПакетаДокументов) И СтатусОтправкиПакетаДокументовКлиентуПоПочте = 0 Тогда
					СтатусОтправкиПакетаДокументовКлиентуПоПочте = 1;
				ИначеЕсли НЕ ЗначениеЗаполнено(АдресЭлектроннойПочтыДляОтправкиПакетаДокументов) И СтатусОтправкиПакетаДокументовКлиентуПоПочте <> 0 Тогда
					СтатусОтправкиПакетаДокументовКлиентуПоПочте = 0;
				КонецЕсли;
			Иначе
				СтатусОтправкиПакетаДокументовКлиентуПоПочте = 0;
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтатусОтправкиПакетаДокументовКлиентуПоПочте = 0;
	КонецЕсли;
	// <-- Конец Лико Яцун 02.02.2023
	
	Если НЕ Отказ
		И ЗначениеЗаполнено(Ссылка)
		И Ссылка.Проведен
		И Ссылка.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
		И Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт
		И НЕ ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента")
		И НЕ ДополнительныеСвойства.Свойство("ИзменитьИнформациюОПеревозчике")
		Тогда
		// Очистим контрагента-владельца в сериях ссылки. Если документ потом опять проведется, то контрагент заполнится обратно в проведении
		Для каждого Строка из Ссылка.Продукция Цикл
			Если Строка.Мест > 0 И ЗначениеЗаполнено(Строка.Серия.Лико_КонтрагентВладелецТовара) Тогда
				СерияОбъект = Строка.Серия.ПолучитьОбъект();
				СерияОбъект.Лико_КонтрагентВладелецТовара = Неопределено;
				СерияОбъект.ОбменДанными.Загрузка = Истина;
				Попытка
					СерияОбъект.Записать();
				Исключение
					Отказ = Истина;
					Сообщить("" + Ссылка + ": не удалось очистить контрагента-владельца в серии """ + СерияОбъект + """.");
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если НЕ Отказ
		И ЗначениеЗаполнено(Ссылка)
		И НЕ ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента")
		И НЕ ДополнительныеСвойства.Свойство("ИзменитьИнформациюОПеревозчике")
		Тогда 
		// Удалим записи из связанных регистров. Они создадутся еще раз при проведении документа
		УдалитьЗаписиИзЭтаповЗаказа();
		УдалитьЗаписиИзЛико_РегистрацияОтправкиДокументов();
	КонецЕсли;
			
КонецПроцедуры

Процедура УдалитьЗаписиИзЛико_РегистрацияОтправкиДокументов()

	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.Лико_РегистрацияОтправкиДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Ссылка.ДатаОтгрузки;
	МенеджерЗаписи.Пакет = Ссылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран()
		И МенеджерЗаписи.Статус = Перечисления.Лико_СтатусыОтправкиДокументов.Создан
		Тогда
		
		Попытка
			МенеджерЗаписи.Удалить();	
		Исключение
			Сообщить("Не удалось удалить запись из регистра ""лк Регистрация отправки документов"": " + ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивКонтрагентовПартнеров(Тип = "Контрагент") // --> Начало Лико Яцун 02.02.2023
	
	ТаблицаСтрок = ЗаказыНаОтгрузку.Выгрузить();
	ТаблицаСтрок.Сортировать("НомерСтроки");
	ПартнерыМассив = Новый Массив;
	Для каждого Строка из ТаблицаСтрок Цикл
		Если Строка.КоличествоПодобранное > 0 Тогда
			СтруктураДляОтбора = Новый Структура("Характеристика,Намотка,Город,КодЭтикеткиЗаказчика,НомерПоставки,ЧестныйЗнак");
			ЗаполнитьЗначенияСвойств(СтруктураДляОтбора, Строка);
			НайденныеСтроки = Строка.ЗаявкаНаОтгрузку.Товары.НайтиСтроки(СтруктураДляОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если Тип = "Контрагент" Тогда
				ПартнерыМассив.Добавить(НайденныеСтроки[0].Контрагент);
			ИначеЕсли Тип = "Партнер" Тогда
				ПартнерыМассив.Добавить(НайденныеСтроки[0].Контрагент.Партнер);
			Иначе
				ВызватьИсключение("В функцию ""ПолучитьМассивКонтрагентовПартнеров"" модуля объекта документа ""Лико_ЗаявкаНаТранспортировку"" передан несовместимый тип");
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	//ВспомогательнаяТаблица = Новый ТаблицаЗначений;
	//ВспомогательнаяТаблица.Колонки.Добавить("Значение");
	//
	//Для Инд = 0 По ПартнерыМассив.ВГраница() Цикл
	//	ВспомогательнаяТаблица.Добавить();
	//КонецЦикла;
	//
	//ВспомогательнаяТаблица.ЗагрузитьКолонку(ПартнерыМассив, "Значение");
	//ВспомогательнаяТаблица.Свернуть("Значение");
	//ВспомогательнаяТаблица.Сортировать("Значение");
	//
	//ПартнерыМассив = ВспомогательнаяТаблица.ВыгрузитьКолонку("Значение");

	ПартнерыМассив = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПартнерыМассив);
	
	Возврат ПартнерыМассив;
	
КонецФункции // <-- Конец Лико Яцун 02.02.2023

Процедура ПересчитатьПодобранноеКоличество() Экспорт

	ТолькоСМестами = Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт ИЛИ Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Подтвержден;
	Для каждого СтрокаЗаказыНаОтгрузку из ЗаказыНаОтгрузку Цикл
		ЗаполнитьЗначенияСвойств(СтруктураСоответствияТЧ, СтрокаЗаказыНаОтгрузку);
		СтрокиПродукция = Продукция.НайтиСтроки(СтруктураСоответствияТЧ);
		КоличествоПодобранное = 0;
		Для каждого СтрокаПродукция из СтрокиПродукция Цикл
			Если ТолькоСМестами И СтрокаПродукция.Мест = 0 Тогда
				Продолжить;
			КонецЕсли;
			КоличествоПодобранное = КоличествоПодобранное + СтрокаПродукция.Количество;
		КонецЦикла;
		СтрокаЗаказыНаОтгрузку.КоличествоПодобранное = КоличествоПодобранное;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("Лико_ПровестиТолькоПоРНЛико_СтоимостьДоставки") ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьШтрихкод();
	
КонецПроцедуры

Процедура СоздатьШтрихкод() Экспорт
	
	Если НЕ РегистрыСведений.Лико_ШтрихкодыДокументов.Выбрать(Новый Структура("Док", Ссылка)).Следующий() Тогда
		ШтрихКод			= Лико_Дополнительно.ВычислитьКонтрольнуюСумму("2010" + Прав(Формат(Год(Дата), "ЧВН=; ЧГ="), 2) + Прав(Формат(Номер, "ЧВН=; ЧГ="), 5));
		МЗаписей			= РегистрыСведений.Лико_ШтрихкодыДокументов.СоздатьМенеджерЗаписи();
		МЗаписей.Док		= ЭтотОбъект.Ссылка;
		МЗаписей.ШтрихКод	= ШтрихКод;
		МЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТаблицуДляСозданияРеализаций()
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить(); //руб
	ВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить(); //euro
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Номенклатура КАК Номенклатура,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Характеристика КАК Характеристика,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Контрагент КАК Грузополучатель,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Намотка КАК Намотка,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Город КАК Город,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЧестныйЗнак КАК ЧестныйЗнак,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.НомерПоставки КАК НомерПоставки,
	|	СУММА(Лико_ЗаявкаНаТранспортировкуПродукция.Мест) КАК Мест,
	|	СУММА(Лико_ЗаявкаНаТранспортировкуПродукция.Мест * Лико_ЗаявкаНаТранспортировкуПродукция.Серия.Лико_КоличествоВУпаковке) КАК КоличествоОтгружено
	|ПОМЕСТИТЬ ВТ_СЗаявкамиНаОтгрузку
	|ИЗ
	|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
	|ГДЕ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка = &Ссылка
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Мест > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Номенклатура,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Характеристика,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаказКлиента,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Контрагент,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Город,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.КодЭтикеткиЗаказчика,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЧестныйЗнак,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.НомерПоставки,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Намотка,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаявкаНаОтгрузку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СЗаявкамиНаОтгрузку.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_СЗаявкамиНаОтгрузку.Номенклатура КАК Номенклатура,
	|	ВТ_СЗаявкамиНаОтгрузку.Характеристика КАК Характеристика,
	|	ВТ_СЗаявкамиНаОтгрузку.Грузополучатель КАК Грузополучатель,
	|	ВТ_СЗаявкамиНаОтгрузку.Намотка КАК Намотка,
	|	ВТ_СЗаявкамиНаОтгрузку.Город КАК Город,
	|	ВТ_СЗаявкамиНаОтгрузку.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ_СЗаявкамиНаОтгрузку.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВТ_СЗаявкамиНаОтгрузку.НомерПоставки КАК НомерПоставки,
	|	ВТ_СЗаявкамиНаОтгрузку.Мест КАК Мест,
	|	ВТ_СЗаявкамиНаОтгрузку.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	|	ВТ_СЗаявкамиНаОтгрузку.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузкуПодобранная,
	|	МИНИМУМ(ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.НомерСтроки, -1)) КАК НомерСтрокиВЗаявкеНаОтгрузку,
	|	ВТ_СЗаявкамиНаОтгрузку.КоличествоОтгружено КАК КоличествоОтгружено
	|ИЗ
	|	ВТ_СЗаявкамиНаОтгрузку КАК ВТ_СЗаявкамиНаОтгрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ЗаявкаНаОтгрузку.Товары КАК Лико_ЗаявкаНаОтгрузкуТовары
	|		ПО ВТ_СЗаявкамиНаОтгрузку.ЗаявкаНаОтгрузку = Лико_ЗаявкаНаОтгрузкуТовары.Ссылка
	|			И ВТ_СЗаявкамиНаОтгрузку.ЗаказКлиента = Лико_ЗаявкаНаОтгрузкуТовары.ЗаказКлиента
	|			И ВТ_СЗаявкамиНаОтгрузку.Номенклатура = Лико_ЗаявкаНаОтгрузкуТовары.Номенклатура
	|			И ВТ_СЗаявкамиНаОтгрузку.Характеристика = Лико_ЗаявкаНаОтгрузкуТовары.Характеристика
	|			И (ВТ_СЗаявкамиНаОтгрузку.Грузополучатель = ВЫБОР
	|				КОГДА Лико_ЗаявкаНаОтгрузкуТовары.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА Лико_ЗаявкаНаОтгрузкуТовары.Контрагент
	|				ИНАЧЕ Лико_ЗаявкаНаОтгрузкуТовары.Грузополучатель
	|			КОНЕЦ)
	|			И ВТ_СЗаявкамиНаОтгрузку.Намотка = Лико_ЗаявкаНаОтгрузкуТовары.Намотка
	|			И ВТ_СЗаявкамиНаОтгрузку.Город = Лико_ЗаявкаНаОтгрузкуТовары.Город
	|			И ВТ_СЗаявкамиНаОтгрузку.КодЭтикеткиЗаказчика = Лико_ЗаявкаНаОтгрузкуТовары.КодЭтикеткиЗаказчика
	|			И ВТ_СЗаявкамиНаОтгрузку.ЧестныйЗнак = Лико_ЗаявкаНаОтгрузкуТовары.ЧестныйЗнак
	|			И ВТ_СЗаявкамиНаОтгрузку.НомерПоставки = Лико_ЗаявкаНаОтгрузкуТовары.НомерПоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СЗаявкамиНаОтгрузку.ЗаказКлиента,
	|	ВТ_СЗаявкамиНаОтгрузку.Номенклатура,
	|	ВТ_СЗаявкамиНаОтгрузку.Характеристика,
	|	ВТ_СЗаявкамиНаОтгрузку.Грузополучатель,
	|	ВТ_СЗаявкамиНаОтгрузку.Намотка,
	|	ВТ_СЗаявкамиНаОтгрузку.Город,
	|	ВТ_СЗаявкамиНаОтгрузку.КодЭтикеткиЗаказчика,
	|	ВТ_СЗаявкамиНаОтгрузку.ЧестныйЗнак,
	|	ВТ_СЗаявкамиНаОтгрузку.НомерПоставки,
	|	ВТ_СЗаявкамиНаОтгрузку.Мест,
	|	ВТ_СЗаявкамиНаОтгрузку.ЗаявкаНаОтгрузку,
	|	ВТ_СЗаявкамиНаОтгрузку.КоличествоОтгружено";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Таблица = Запрос.Выполнить().Выгрузить();
	// Получим номер первой строки, у которой заполнена заявка на отгрузку
	НомерПервойСтрокиСЗаявкойНаОтгрузку = -1;
	Для каждого Строка из Таблица Цикл
		Если Строка.НомерСтрокиВЗаявкеНаОтгрузку <> -1 Тогда
			НомерПервойСтрокиСЗаявкойНаОтгрузку = Строка.НомерСтрокиВЗаявкеНаОтгрузку;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка из Таблица Цикл
		Если Строка.НомерСтрокиВЗаявкеНаОтгрузку = -1 Тогда
			// Заявка не нашлась
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура");
			Отбор.Вставить("Характеристика");
			Отбор.Вставить("Намотка");
			Отбор.Вставить("Город");
			Отбор.Вставить("КодЭтикеткиЗаказчика");
			Отбор.Вставить("ЧестныйЗнак");
			Отбор.Вставить("НомерПоставки");
			// Будем убирать по одному полю
			ЗаполнитьЗначенияСвойств(Отбор, Строка);
			Отбор.Удалить("Город");
			НайденныеСтроки = ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Удалить("Намотка");
				НайденныеСтроки = ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
			КонецЕсли;
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Удалить("КодЭтикеткиЗаказчика");
				НайденныеСтроки = ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
			КонецЕсли;
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Удалить("ЧестныйЗнак");
				НайденныеСтроки = ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
			КонецЕсли;
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Удалить("НомерПоставки");
				НайденныеСтроки = ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
			КонецЕсли;
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Удалить("Характеристика");
				НайденныеСтроки = ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
			КонецЕсли;
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				ЗаявкаНаОтгрузку = НайденнаяСтрока.ЗаявкаНаОтгрузку;
				ОтборВЗаявкеНаОтгрузку = Новый Структура("Номенклатура,Характеристика,Намотка,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки,Город");
				ЗаполнитьЗначенияСвойств(ОтборВЗаявкеНаОтгрузку, НайденнаяСтрока);
				НайденныеСтрокиЗаявки = ЗаявкаНаОтгрузку.Товары.НайтиСтроки(ОтборВЗаявкеНаОтгрузку);
				Если НайденныеСтрокиЗаявки.Количество() > 0 Тогда
					НайденнаяСтрокаЗаявки = НайденныеСтрокиЗаявки[0];
					//ЗаполнитьЗначенияСвойств(Строка, НайденнаяСтрокаЗаявки);
					Строка.Грузополучатель = ?(ЗначениеЗаполнено(НайденнаяСтрокаЗаявки.Грузополучатель), НайденнаяСтрокаЗаявки.Грузополучатель, НайденнаяСтрокаЗаявки.Контрагент);
					Строка.ЗаявкаНаОтгрузкуПодобранная = ЗаявкаНаОтгрузку;
					Строка.НомерСтрокиВЗаявкеНаОтгрузку = НайденнаяСтрокаЗаявки.НомерСтроки;
				КонецЕсли;
			КонецЕсли;						
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЗаказКлиента КАК Документ.ЗаказКлиента) КАК ЗаказКлиента,
	|	ВЫРАЗИТЬ(ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Грузополучатель КАК Грузополучатель,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Намотка КАК Намотка,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Мест КАК Мест,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЗаявкаНаОтгрузкуПодобранная КАК ЗаявкаНаОтгрузкуПодобранная,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.НомерСтрокиВЗаявкеНаОтгрузку КАК НомерСтрокиВЗаявкеНаОтгрузку,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Город КАК Город,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВЫРАЗИТЬ(ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.НомерПоставки КАК Справочник.Лико_НомераПоставок) КАК НомерПоставки,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.КоличествоОтгружено КАК КоличествоОтгружено
	|ПОМЕСТИТЬ ВТ_СоСтрокойТЧЗаявкиНаОтгрузку
	|ИЗ
	|	&Таблица КАК ВТ_СоСтрокойТЧЗаявкиНаОтгрузку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Номенклатура КАК Номенклатура,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Характеристика КАК Характеристика,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Грузополучатель КАК Грузополучатель,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Намотка КАК Намотка,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Мест КАК Мест,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.НомерСтрокиВЗаявкеНаОтгрузку КАК НомерСтрокиВЗаявкеНаОтгрузку,
	|	ВЫБОР
	|		КОГДА Лико_ЗаявкаНаОтгрузкуТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьЗаявкаНаОтгрузку,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.Примечание, """") КАК СТРОКА(1000)) КАК Примечание,
	|	ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.ВалютаЦены, Неопределено) КАК ВалютаЦены,
	|	ВЫРАЗИТЬ(Лико_ЗаявкаНаОтгрузкуТовары.АдресДоставки КАК СТРОКА(1000)) КАК АдресДоставки,
	|	ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.СчетНаОплату, Неопределено) КАК СчетНаОплату,
	|	ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.РеальныйДоговор, Неопределено) КАК РеальныйДоговор,
	|	ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.НомерКомплекта, Неопределено) КАК НомерКомплекта,
	|	ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.ОтгрузкаВРублях, ЛОЖЬ) КАК ОтгрузкаВРублях,
	|	ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.Контрагент, ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Грузополучатель) КАК Контрагент,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.Город КАК Город,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.НомерПоставки КАК НомерПоставки,
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.КоличествоОтгружено КАК КоличествоОтгружено,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Комментарий, """") КАК СТРОКА(1000)) КАК Комментарий
	|ПОМЕСТИТЬ ВТ_СЦенамиИзЗаявкиНаОтгрузку
	|ИЗ
	|	ВТ_СоСтрокойТЧЗаявкиНаОтгрузку КАК ВТ_СоСтрокойТЧЗаявкиНаОтгрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ЗаявкаНаОтгрузку.Товары КАК Лико_ЗаявкаНаОтгрузкуТовары
	|		ПО ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.ЗаявкаНаОтгрузкуПодобранная = Лико_ЗаявкаНаОтгрузкуТовары.Ссылка
	|			И ВТ_СоСтрокойТЧЗаявкиНаОтгрузку.НомерСтрокиВЗаявкеНаОтгрузку = Лико_ЗаявкаНаОтгрузкуТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Номенклатура КАК Номенклатура,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Характеристика КАК Характеристика,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Контрагент КАК Контрагент,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Намотка КАК Намотка,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Мест КАК Мест,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.НомерСтрокиВЗаявкеНаОтгрузку КАК НомерСтрокиВЗаявкеНаОтгрузку,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузку,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Примечание КАК Примечание,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Цена КАК Цена,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ВалютаЦены КАК ВалютаЦены,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.АдресДоставки КАК АдресДоставки,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.СчетНаОплату КАК СчетНаОплату,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.РеальныйДоговор КАК РеальныйДоговор,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.НомерКомплекта КАК НомерКомплекта,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ОтгрузкаВРублях КАК ОтгрузкаВРублях,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Грузополучатель КАК Грузополучатель,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Город КАК Город,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.НомерПоставки КАК НомерПоставки,
	|	МИНИМУМ(ЕСТЬNULL(ЗаказКлиентаТовары.НомерСтроки, -1)) КАК НомерСтрокиВЗаказеКлиента,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.КоличествоОтгружено КАК КоличествоОтгружено,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ВТ_СоСтрокойТЧЗаказаКлиента
	|ИЗ
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку КАК ВТ_СЦенамиИзЗаявкиНаОтгрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ВТ_СЦенамиИзЗаявкиНаОтгрузку.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|			И ВТ_СЦенамиИзЗаявкиНаОтгрузку.Характеристика = ЗаказКлиентаТовары.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЗаказКлиента,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Номенклатура,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Характеристика,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Контрагент,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Намотка,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Мест,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЗаявкаНаОтгрузку,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.НомерСтрокиВЗаявкеНаОтгрузку,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЕстьЗаявкаНаОтгрузку,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Цена,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ВалютаЦены,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.СчетНаОплату,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.РеальныйДоговор,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.НомерКомплекта,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ОтгрузкаВРублях,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Грузополучатель,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Примечание,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.АдресДоставки,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Город,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.КодЭтикеткиЗаказчика,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.ЧестныйЗнак,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.НомерПоставки,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.КоличествоОтгружено,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Комментарий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Номенклатура КАК Номенклатура,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Характеристика КАК Характеристика,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Контрагент КАК Контрагент,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Намотка КАК Намотка,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Мест КАК Мест,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.НомерСтрокиВЗаявкеНаОтгрузку КАК НомерСтрокиВЗаявкеНаОтгрузку,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузку,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Примечание КАК Примечание,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Город КАК Город,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.НомерПоставки КАК НомерПоставки,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Цена КАК ЦенаЗаявкаНаОтгрузку,
	|	ЗаказКлиентаТовары.ЦенаДляДокументов КАК ЦенаЗаказКлиентаЦенаДляДокументов,
	|	ЗаказКлиентаТовары.Цена КАК ЦенаЗаказКлиентаЦена,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ВалютаЦены КАК ВалютаЗаявкаНаОтгрузку,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ЗаказКлиента.ВалютаДляДокументов КАК ВалютаЗаказКлиентаЦенаДляДокументов,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ЗаказКлиента.Валюта КАК ВалютаЗаказКлиентаЦена,
	|	ВЫБОР
	|		КОГДА ВТ_СоСтрокойТЧЗаказаКлиента.Цена <> 0
	|			ТОГДА ""ЗаявкаНаОтгрузку""
	|		КОГДА ЕСТЬNULL(ЗаказКлиентаТовары.ЦенаДляДокументов, 0) <> 0
	|			ТОГДА ""ЗаказКлиентаЦенаДляДокументов""
	|		КОГДА ЕСТЬNULL(ЗаказКлиентаТовары.Цена, 0) <> 0
	|			ТОГДА ""ЗаказКлиентаЦена""
	|		ИНАЧЕ ""НетЦены""
	|	КОНЕЦ КАК ИсточникЦены,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.АдресДоставки КАК АдресДоставки,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.СчетНаОплату КАК СчетНаОплату,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.РеальныйДоговор КАК РеальныйДоговор,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.НомерКомплекта КАК НомерКомплекта,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.ОтгрузкаВРублях КАК ОтгрузкаВРублях,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Грузополучатель КАК Грузополучатель,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.НомерСтрокиВЗаказеКлиента КАК НомерСтрокиВЗаказеКлиента,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.КоличествоОтгружено КАК КоличествоОтгружено,
	|	ВТ_СоСтрокойТЧЗаказаКлиента.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ВТ_СЦенамиИВалютами
	|ИЗ
	|	ВТ_СоСтрокойТЧЗаказаКлиента КАК ВТ_СоСтрокойТЧЗаказаКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТ_СоСтрокойТЧЗаказаКлиента.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ВТ_СоСтрокойТЧЗаказаКлиента.НомерСтрокиВЗаказеКлиента = ЗаказКлиентаТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Контрагент.Партнер КАК Партнер,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ВсеКонтрагентыЗаявки
	|ИЗ
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку КАК ВТ_СЦенамиИзЗаявкиНаОтгрузку
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Контрагент.Партнер,
	|	ВТ_СЦенамиИзЗаявкиНаОтгрузку.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеКонтрагентыЗаявки.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ЕСТЬNULL(ПартнерыДополнительныеРеквизитыПересчитыватьЦены.Значение, ЛОЖЬ)) КАК ПересчитыватьЦеныВЦеныБезНДС,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ПартнерыДополнительныеРеквизитыТипСортировки.Значение, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)) КАК Справочник.ЗначенияСвойствОбъектов)) КАК ТипСортировкиПриАвтоматическомСозданииРеализаций
	|ПОМЕСТИТЬ ВТ_КонтрагентыСДопРеквизитами
	|ИЗ
	|	ВТ_ВсеКонтрагентыЗаявки КАК ВТ_ВсеКонтрагентыЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыПересчитыватьЦены
	|		ПО ВТ_ВсеКонтрагентыЗаявки.Партнер = ПартнерыДополнительныеРеквизитыПересчитыватьЦены.Ссылка
	|			И (ПартнерыДополнительныеРеквизитыПересчитыватьЦены.Свойство = &ДопРеквизитПартнераПересчитыватьЦены)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизитыТипСортировки
	|		ПО ВТ_ВсеКонтрагентыЗаявки.Партнер = ПартнерыДополнительныеРеквизитыТипСортировки.Ссылка
	|			И (ПартнерыДополнительныеРеквизитыТипСортировки.Свойство.Имя = ""ТипСортировкиПриАвтоматическомСозданииРеализаций"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеКонтрагентыЗаявки.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СЦенамиИВалютами.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_СЦенамиИВалютами.ЗаказКлиента.Площадка КАК Площадка,
	|	ВТ_СЦенамиИВалютами.ЗаказКлиента.Площадка.Организация КАК ПлощадкаОрганизация,
	|	ВЫБОР КОГДА ВТ_СЦенамиИВалютами.ЗаказКлиента.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.Пробник) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоПробник,
	|	ВТ_СЦенамиИВалютами.Номенклатура КАК Номенклатура,
	|	ВТ_СЦенамиИВалютами.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ВТ_СЦенамиИВалютами.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_СЦенамиИВалютами.Характеристика КАК Характеристика,
	|	ВТ_СЦенамиИВалютами.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименованиеПолное,
	|	ВТ_СЦенамиИВалютами.Контрагент КАК Контрагент,
	|	ВТ_СЦенамиИВалютами.Намотка КАК Намотка,
	|	ВТ_СЦенамиИВалютами.Мест КАК Мест,
	|	ВТ_СЦенамиИВалютами.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
	|	ВТ_СЦенамиИВалютами.НомерСтрокиВЗаявкеНаОтгрузку КАК НомерСтрокиВЗаявкеНаОтгрузку,
	|	ВТ_СЦенамиИВалютами.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузку,
	|	ВТ_СЦенамиИВалютами.Примечание КАК Примечание,
	|	ВТ_СЦенамиИВалютами.Город КАК Город,
	|	ВТ_СЦенамиИВалютами.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ_СЦенамиИВалютами.ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВТ_СЦенамиИВалютами.НомерПоставки КАК НомерПоставки,
	|	ВТ_СЦенамиИВалютами.НомерПоставки.Наименование КАК НомерПоставкиНаименование,
	|	ВЫБОР
	|		КОГДА ВТ_СЦенамиИВалютами.ИсточникЦены = ""ЗаявкаНаОтгрузку""
	|			ТОГДА ВТ_СЦенамиИВалютами.ЦенаЗаявкаНаОтгрузку
	|		КОГДА ВТ_СЦенамиИВалютами.ИсточникЦены = ""ЗаказКлиентаЦенаДляДокументов""
	|			ТОГДА ВТ_СЦенамиИВалютами.ЦенаЗаказКлиентаЦенаДляДокументов
	|		КОГДА ВТ_СЦенамиИВалютами.ИсточникЦены = ""ЗаказКлиентаЦена""
	|			ТОГДА ВТ_СЦенамиИВалютами.ЦенаЗаказКлиентаЦена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВТ_СЦенамиИВалютами.ЦенаЗаказКлиентаЦена КАК ЦенаИзЗаказа,
	|	ВЫБОР
	|		КОГДА ВТ_СЦенамиИВалютами.ИсточникЦены = ""ЗаявкаНаОтгрузку""
	|			ТОГДА ВТ_СЦенамиИВалютами.ВалютаЗаявкаНаОтгрузку
	|		КОГДА ВТ_СЦенамиИВалютами.ИсточникЦены = ""ЗаказКлиентаЦенаДляДокументов""
	|			ТОГДА ВТ_СЦенамиИВалютами.ВалютаЗаказКлиентаЦенаДляДокументов
	|		КОГДА ВТ_СЦенамиИВалютами.ИсточникЦены = ""ЗаказКлиентаЦена""
	|			ТОГДА ВТ_СЦенамиИВалютами.ВалютаЗаказКлиентаЦена
	|		ИНАЧЕ ВТ_СЦенамиИВалютами.ВалютаЗаказКлиентаЦена
	|	КОНЕЦ КАК Валюта,
	|	ВТ_СЦенамиИВалютами.ИсточникЦены КАК ИсточникЦены,
	|	ВТ_СЦенамиИВалютами.АдресДоставки КАК АдресДоставки,
	|	ВТ_СЦенамиИВалютами.СчетНаОплату КАК СчетНаОплату,
	|	ВТ_СЦенамиИВалютами.РеальныйДоговор КАК РеальныйДоговор,
	|	ВТ_СЦенамиИВалютами.НомерКомплекта КАК НомерКомплекта,
	|	ВТ_СЦенамиИВалютами.ОтгрузкаВРублях КАК ОтгрузкаВРублях,
	|	ВТ_СЦенамиИВалютами.Грузополучатель КАК Грузополучатель,
	|	ВТ_СЦенамиИВалютами.НомерСтрокиВЗаказеКлиента КАК НомерСтрокиВЗаказеКлиента,
	|	ВТ_СЦенамиИВалютами.ЗаказКлиента.Соглашение КАК Соглашение,
	|	ВТ_СЦенамиИВалютами.ЗаказКлиента.Регион КАК Регион,
	|	ВЫБОР
	|		КОГДА ВТ_СЦенамиИВалютами.ЗаказКлиента.Соглашение.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ВТ_СЦенамиИВалютами.ЗаказКлиента.Договор.ВалютаВзаиморасчетов
	|		ИНАЧЕ ВТ_СЦенамиИВалютами.ЗаказКлиента.Соглашение.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаВзаиморасчетов,
	|	ВТ_СЦенамиИВалютами.КоличествоОтгружено КАК КоличествоОтгружено,
	|	&СтавкаНДСПоУмолчанию КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &ТипОтгрузки В (ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения), ЗНАЧЕНИЕ(Перечисление.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СоздаватьДокументыРеализацииВТранспортномМодуле,
	|	ВТ_СЦенамиИВалютами.Комментарий КАК Комментарий,
	|	ВТ_СЦенамиИВалютами.ЗаказКлиента.ЦенаДляДокументовВключаетНДС КАК ЦенаВключаетНДС,
	|	ВТ_КонтрагентыСДопРеквизитами.ПересчитыватьЦеныВЦеныБезНДС КАК ПересчитыватьЦеныВЦеныБезНДС,
	|	ВТ_КонтрагентыСДопРеквизитами.ТипСортировкиПриАвтоматическомСозданииРеализаций.Наименование КАК ТипСортировкиПриАвтоматическомСозданииРеализаций
	|ИЗ
	|	ВТ_СЦенамиИВалютами КАК ВТ_СЦенамиИВалютами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыСДопРеквизитами КАК ВТ_КонтрагентыСДопРеквизитами
	|		ПО ВТ_СЦенамиИВалютами.Контрагент = ВТ_КонтрагентыСДопРеквизитами.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидНоменклатуры";		
	Запрос.УстановитьПараметр("Таблица", Таблица);	
	Запрос.УстановитьПараметр("ТипОтгрузки", ТипОтгрузки);	
	//Запрос.УстановитьПараметр("ДопРеквизитПартнера", Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитПартнераСоздаватьДокументыРеализацииВТранспортномМодуле.ЗначениеПараметра);	
	Запрос.УстановитьПараметр("ДопРеквизитПартнераПересчитыватьЦены", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ПересчитыватьЦеныВЦеныБезНДСПриСозданииРеализаций_fe9b76240f4042419e569d14908c63fb"));	
	Если ДатаОтгрузки >= Дата('20260101') Тогда
		СтавкаНДСПоУмолчанию = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС22);
	ИначеЕсли ДатаОтгрузки >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
		СтавкаНДСПоУмолчанию = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
	Иначе
		СтавкаНДСПоУмолчанию = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
	КонецЕсли;
	Запрос.УстановитьПараметр("СтавкаНДСПоУмолчанию", СтавкаНДСПоУмолчанию);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Таблица.Колонки.Добавить("Упаковка");
	Таблица.Колонки.Добавить("ЦенаЕвро");
	
	КурсВалюты = РегистрыСведений.КурсыВалют.СрезПоследних(ДатаОтгрузки, Новый Структура("Валюта", ВалютаУпрУчета));
	Курс = КурсВалюты[0].Курс;
	Если Курс = 0 Тогда
		Курс = 1;
	КонецЕсли;
	
	ПредыдущийВид = Неопределено;
	ПредыдущаяУпаковка = Неопределено;
	ЭтоСписание = ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя;
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Для каждого Строка Из Таблица Цикл
		Если ЭтоСписание Тогда
			Строка.Регион = Неопределено;
		Иначе
			Если Строка.Регион = Справочники.БизнесРегионы.Производство Тогда
				Строка.Регион = Справочники.БизнесРегионы.Акватория;
			ИначеЕсли Строка.Регион = Справочники.БизнесРегионы.Авантаж Тогда
				Строка.Регион = Справочники.БизнесРегионы.Екатеринбург;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Валюта) Тогда
			Строка.Валюта = ВалютаУпрУчета;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Грузополучатель) Тогда
			Строка.Грузополучатель = Строка.Контрагент;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КорректировкаКонтрагент) Тогда
			Строка.Контрагент = КорректировкаКонтрагент;
		КонецЕсли;
		Если ЗначениеЗаполнено(КорректировкаГрузополучатель) Тогда
			Строка.Грузополучатель = КорректировкаГрузополучатель;
		КонецЕсли;
		Если ЗначениеЗаполнено(КорректировкаВалюта) Тогда
			Строка.Валюта = КорректировкаВалюта;
		КонецЕсли;
		Если ЗначениеЗаполнено(КорректировкаОтгрузкаВРублях) Тогда
			Если КорректировкаОтгрузкаВРублях = 1 Тогда
				Строка.ОтгрузкаВРублях = Истина;
			ИначеЕсли КорректировкаОтгрузкаВРублях = 2 Тогда
				Строка.ОтгрузкаВРублях = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		//Если ПредыдущийВид = Строка.ВидНоменклатуры Тогда
		//	Строка.Упаковка = ПредыдущаяУпаковка;
		//Иначе
		//	Строка.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(Строка.Номенклатура.ВидНоменклатуры);
		//КонецЕсли;
		Строка.Упаковка = УпаковкаТысШт;
		
		Если Строка.Цена <> 0 Тогда
			Если Строка.ОтгрузкаВРублях И Строка.Валюта <> ВалютаРеглУчета Тогда
				Строка.Цена = Окр(Строка.Цена * Курс, 4);
				Строка.Валюта = ВалютаРеглУчета;
			КонецЕсли;
		Иначе
			// ХЗ что с этим делать, потому что цену поискали и в заявке на отгрузку, и в заказе в двух местах ("цена для документов" и просто "цена")
			// Поставлю очень большую цену - знак того, что нужно искать ошибку и переделывать накладную
			//Строка.Цена = 99999999;
			Если НЕ ЗначениеЗаполнено(Строка.Валюта) Тогда
				Строка.Валюта = ВалютаРеглУчета;
			КонецЕсли;
			Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона Тогда
				Строка.Цена = 99999999; // --> Начало Лико Ефимов ЕВВ 07.02.2022 Перенес установку цены внутрь условия наличия реализации
				Сообщить("" + Строка.Номенклатура + " / " + Строка.Характеристика + " / " + Строка.Контрагент + ": не найдена цена!!! Для формирования документов поставлена цена 999999, но это нужно исправлять!");
			КонецЕсли;
		КонецЕсли;
		Если Строка.ПересчитыватьЦеныВЦеныБезНДС
			И Строка.ЦенаВключаетНДС
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения 
			Тогда
			ТекПроцентНДС = Строка.СтавкаНДС.Ставка;
			Строка.Цена = Строка.Цена * 100 / (100+ТекПроцентНДС);
		КонецЕсли;
		Если Строка.Валюта = ВалютаУпрУчета Тогда
			Строка.ЦенаЕвро = Строка.Цена;
		Иначе
			Строка.ЦенаЕвро = Окр(Строка.Цена / Курс, 4);
		КонецЕсли;
		
		ПредыдущийВид = Строка.ВидНоменклатуры;
		ПредыдущаяУпаковка = Строка.Упаковка;
	КонецЦикла;
	//Таблица.Сортировать("СоздаватьДокументыРеализацииВТранспортномМодуле УБЫВ,Регион,Грузополучатель,Валюта");
	СтрокаСортировки = "СоздаватьДокументыРеализацииВТранспортномМодуле УБЫВ";
	Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладРегиона2 ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца Тогда
		СтрокаСортировки = СтрокаСортировки + ",Регион";
	КонецЕсли;
	СтрокаСортировки = СтрокаСортировки + ",Грузополучатель,Валюта";
	ТипСортировкиПриАвтоматическомСозданииРеализаций = Таблица[0].ТипСортировкиПриАвтоматическомСозданииРеализаций;
	Если ЗначениеЗаполнено(ТипСортировкиПриАвтоматическомСозданииРеализаций) Тогда
		Если ТипСортировкиПриАвтоматическомСозданииРеализаций = "Номер поставки" Тогда
			СтрокаСортировки = СтрокаСортировки + ",НомерПоставкиНаименование";
		ИначеЕсли ТипСортировкиПриАвтоматическомСозданииРеализаций = "Код этикетки заказчика" Тогда
			СтрокаСортировки = СтрокаСортировки + ",КодЭтикеткиЗаказчика";
		КонецЕсли;			
	КонецЕсли;
	СтрокаСортировки = СтрокаСортировки + ",НоменклатураНаименованиеПолное,ХарактеристикаНаименованиеПолное";
	Таблица.Сортировать(СтрокаСортировки);
	
	Возврат Таблица;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	НачатьТранзакцию();
	//Пометим на удаление связанные типовые документы
	КлючиСтруктурыУдаляемыхДокументов = Лико_Дополнительно.ПолучитьКлючиСтруктурыБезДокумента(КлючиСтруктуры, "Лико_ПередачаТоваровМеждуОрганизациями"); 
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктурыУдаляемыхДокументов, Ссылка,,"Лико_АвтоматическоеСоздание");
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	// Найдем Лико_ПередачаТоваровМеждуОрганизациями 
	//СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(,, "Лико_ПередачаТоваровМеждуОрганизациями", Ссылка, Ложь);
	//Если СтруктураТиповыхДокументов = Неопределено Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	//Если НЕ Отказ И ЗначениеЗаполнено(СтруктураТиповыхДокументов.Лико_ПередачаТоваровМеждуОрганизациями) Тогда
		// Нужно удалить из этого документа связанные строки
		УдалитьИзЛико_ПередачаТоваровМеждуОрганизациямиСвязанныеСтроки();
	//КонецЕсли;
	//Если НЕ Отказ Тогда
	//	// Удалим запись из Лико_ЭтапыЗаказа
	//	УдалитьЗаписиИзЭтаповЗаказа();
	//КонецЕсли;
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	//Если НЕ Отказ Тогда
	//	ПровестиПереупаковкиПаллет();
	//КонецЕсли;
КонецПроцедуры

Процедура УдалитьЗаписиИзЭтаповЗаказа() 
	
	ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияРеквизитаДокументВРегистреЭтапыЗаказа.ЗначениеПараметра <= ДатаОтгрузки;
	Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
		Лико_Дополнительно.УдалитьЗаписиИзРегистраЛико_ЭтапыЗаказовПоДокументу(Ссылка);
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаЗаказов = Ссылка.Продукция.Выгрузить(,"ЗаказКлиента,Количество");
		ТаблицаЗаказов.Свернуть("ЗаказКлиента", "Количество");
		Для каждого Строка из ТаблицаЗаказов Цикл
			МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = Ссылка.ДатаОтгрузки;
			МенеджерЗаписи.Заказ = Строка.ЗаказКлиента;
			МенеджерЗаписи.Площадка = Строка.ЗаказКлиента.Площадка;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Отгрузка Тогда
				Попытка
					МенеджерЗаписи.Удалить();	
				Исключение
					Сообщить("Не удалось удалить запись из регистра ""лк Этапы заказа"": " + ОписаниеОшибки());
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоЛико_ЗаявкиНаОтгрузку()
	
	Движения.Лико_ЗаявкиНаОтгрузку.Записывать = Истина;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
		МассивЗаявок = Новый Массив;
		МассивЗаказов = Новый Массив;
		МассивХарактеристик = Новый Массив;
		Для каждого Строка из Продукция Цикл
			Если Строка.Мест > 0 Тогда
				Если ЗначениеЗаполнено(Строка.ЗаявкаНаОтгрузку) И МассивЗаявок.Найти(Строка.ЗаявкаНаОтгрузку) = Неопределено Тогда
					МассивЗаявок.Добавить(Строка.ЗаявкаНаОтгрузку);
				КонецЕсли;
				Если МассивЗаказов.Найти(Строка.ЗаказКлиента) = Неопределено Тогда
					МассивЗаказов.Добавить(Строка.ЗаказКлиента);
				КонецЕсли;
				Если МассивХарактеристик.Найти(Строка.Характеристика) = Неопределено Тогда
					МассивХарактеристик.Добавить(Строка.Характеристика);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаявкиНаОтгрузкуОстатки.ЗаказКлиента КАК ЗаказКлиента,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Номенклатура КАК Номенклатура,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Характеристика КАК Характеристика,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.ДокументОприходования КАК ДокументОприходования,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Город КАК Город,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Намотка КАК Намотка,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Грузополучатель КАК Грузополучатель,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.НомерПоставки КАК НомерПоставки,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.ЧестныйЗнак КАК ЧестныйЗнак,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.КоличествоОстаток КАК Количество,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.КоличествоНеОтгруженоОстаток КАК КоличествоНеОтгружено
		|ИЗ
		|	РегистрНакопления.Лико_ЗаявкиНаОтгрузку.Остатки(
		|			,
		|			ДокументОприходования В (&ДокументыОприходования)
		|				И ЗаказКлиента В (&ЗаказыКлиентов)
		|				И Характеристика В (&МассивХарактеристик)) КАК Лико_ЗаявкиНаОтгрузкуОстатки";
		
		Запрос.УстановитьПараметр("ДокументыОприходования", МассивЗаявок);
		Запрос.УстановитьПараметр("ЗаказыКлиентов", МассивЗаказов);
		Запрос.УстановитьПараметр("МассивХарактеристик", МассивХарактеристик);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		МенятьСтатусЗаявки = Ложь;
		Пока Выборка.Следующий() Цикл
			Движение = Движения.Лико_ЗаявкиНаОтгрузку.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаОтгрузки;
			МенятьСтатусЗаявки = Истина;
		КонецЦикла;
		Если МенятьСтатусЗаявки Тогда
			Для каждого ЗаявкаНаОтгрузку из МассивЗаявок Цикл
				Если ЗаявкаНаОтгрузку.СостояниеЗаявки <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
					ЗаявкаНаОтгрузкуОбъект = ЗаявкаНаОтгрузку.ПолучитьОбъект();
					ЗаявкаНаОтгрузкуОбъект.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт;
					ЗаявкаНаОтгрузкуОбъект.ОбменДанными.Загрузка = Истина;
					Попытка
						ЗаявкаНаОтгрузкуОбъект.Записать();
					Исключение
						Сообщить("Не удалось установить статус ""Закрыт"" документу """ + ЗаявкаНаОтгрузку + """: " + ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;						
	Иначе
		// пока закомментил, т.к. кладовщики хотят видеть в ТМ заявки на отгрузку до тех пор, пока заявка на транспортировку не закроется
		//Для каждого Строка из ЗаказыНаОтгрузку Цикл
		//	Если ЗначениеЗаполнено(Строка.ЗаявкаНаОтгрузку) Тогда
		//		Движение = Движения.Лико_ЗаявкиНаОтгрузку.Добавить();
		//		ЗаполнитьЗначенияСвойств(Движение, Строка);
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//		Движение.ДокументОприходования = Строка.ЗаявкаНаОтгрузку;
		//		Движение.Период = Дата;
		//		Движение.Грузополучатель = Строка.Контрагент;
		//	КонецЕслИ;
		//КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТаблицуСерий(ТоварыБезСерий, ТЗВсехСерий)
	
	ТаблицаСерий = ТЗВсехСерий.СкопироватьКолонки("Номенклатура,Характеристика,Серия,Паллет");
	ТаблицаСерий.Колонки.Добавить("Количество");
	ТаблицаСерий.Колонки.Добавить("КоличествоУпаковок");
	ТаблицаСерий.Колонки.Добавить("СтатусУказанияСерий");
	ТаблицаСерий.Колонки.Добавить("Упаковка");
	
	Отбор = Новый Структура("Номенклатура,Характеристика,ЗаказКлиента,Намотка,Город,НомерПоставки,КодЭтикеткиЗаказчика,ЧестныйЗнак,Списано,ЗаявкаНаОтгрузку");
	Отбор.Списано = Ложь;
	Для каждого Строка из ТоварыБезСерий Цикл
		
		ОсталосьСписатьСерий = Строка.КоличествоОтгружено;
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		//Отбор.Контрагент = Строка.Грузополучатель;
		Серии = ТЗВсехСерий.НайтиСтроки(Отбор);
		Для каждого СтрокаСерии из Серии Цикл
			Если ОсталосьСписатьСерий <= 0 Тогда
				Прервать;
			КонецЕсли;
			НоваяСтрока = ТаблицаСерий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСерии);
			НоваяСтрока.СтатусУказанияСерий = 8;
			НоваяСтрока.Количество = СтрокаСерии.Мест * СтрокаСерии.Серия.Лико_КоличествоВУпаковке;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
			НоваяСтрока.Упаковка = Строка.Упаковка;
			СтрокаСерии.Списано = Истина;
			ОсталосьСписатьСерий = ОсталосьСписатьСерий - НоваяСтрока.Количество;
		КонецЦикла;
		Если ОсталосьСписатьСерий > 0 Тогда
			Сообщить("По складу списались не все коробки! Обязательно отправьте письмо программистам, пусть разбираются.");
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаСерий;
	
КонецФункции

Процедура РассчитатьСтоимостьДоставки() Экспорт
	
	КурсДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), ?(ЗначениеЗаполнено(ДатаОтгрузки), ДатаОтгрузки, Дата)).Курс;
	ОбщийВесКоробок = РассчитатьОбщийВесКоробок();
	//СтоимостьДоставкиЗаКг = ?(ОбщийВесКоробок = 0, 0, ОбщаяСтоимостьДоставки / ОбщийВесКоробок);
	ОбщаяСтоимостьДоставкиВЕвро = ?(КурсДокумента = 0, 0, ОбщаяСтоимостьДоставки / КурсДокумента);
	СтоимостьДоставкиВЕвроЗаКг = ?(ОбщийВесКоробок = 0, 0, ОбщаяСтоимостьДоставкиВЕвро / ОбщийВесКоробок);
	
	//Для каждого СтрокаЗаказыНаОтгрузку из ЗаказыНаОтгрузку Цикл
	//	Отбор = СтруктураСоответствияТЧ;
	//	ЗаполнитьЗначенияСвойств(Отбор, СтрокаЗаказыНаОтгрузку);
	//	СтрокиПродукция = Продукция.НайтиСтроки(Отбор);
	//	Если СтрокиПродукция.Количество() = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	ВесКоробки = СтрокиПродукция[0].Серия.Лико_ВесКоробки;
	//	СтрокаЗаказыНаОтгрузку.Стоимость = СтоимостьДоставкиВЕвроЗаКг * ВесКоробки;
	//КонецЦикла;
	Для каждого Строка из Продукция Цикл
		Строка.Стоимость = 0;
	КонецЦикла;
	
	Таблица = Продукция.Выгрузить(, "НомерСтроки,Серия,Мест");
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.НомерСтроки,
	|	Т.Серия,
	|	Т.Мест
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Серия.Лико_ВесКоробки * ВТ.Мест * &СтоимостьЗаКг КАК Стоимость
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("СтоимостьЗаКг", СтоимостьДоставкиВЕвроЗаКг);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Продукция[ВыборкаДетальныеЗаписи.НомерСтроки-1].Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
	КонецЦикла;
	
КонецПроцедуры

Функция РассчитатьОбщийВесКоробок() Экспорт
	
	Таблица = Продукция.Выгрузить(, "Серия,Мест");
	Если Таблица.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Серия,
	|	Т.Мест
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.Серия.Лико_ВесКоробки * ВТ.Мест) КАК Вес
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщийВесКоробок = 0;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОбщийВесКоробок = ВыборкаДетальныеЗаписи.Вес;
	КонецЕсли;
	
	Возврат ОбщийВесКоробок;
	
КонецФункции

Функция ПолучитьПодразделениеПоРегиону(Регион)
	
	Подразделение = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Регион, "Подразделение_b50d06645caa487988f64db637024d3a");
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Сообщить("В регионе """ + Регион + """ не заполнено подразделение");
		Возврат ПараметрыСеанса.ТекущийПользователь.Подразделение;
	Иначе
		Возврат Подразделение;
	КонецЕсли;
	
КонецФункции

Процедура ПровестиПереупаковкиПаллет()
	
	// Проведем все Формирования паллетов с типом "Переупаковка", содержащие серии документа
	// Смысл в том, что иногда возникают расхождения. Пример: кладовщик закачал коробки в заявку в 00:00, по регистру Товары в ячейках коробки переместились из ячейки "1"
	// в ячейку "Отгрузка". Потом кладовщик в 00:01 делает формирование паллета с типом "Переупаковка", система берет коробки из ячейки "Отгрузка" 
	// и кладет их в ячейку "Новые паллеты". В 00:02 кладовщик закрывает заявку, заявка еще раз проверяет где лежат коробки и берет коробку уже из "Новые паллеты" и опять кидает ее в "Отгрузка",
	// НО еще система сдвигает дату документа на дату последнего движения по ячеистоиму складу, т.е. на 00:02. Получается документ формирование паллета взял коробки из ячейки "Отгрузка", а на 00:01
	// коробки дежали не в "Отгрузка", а в ячейке "1" (дата-то сдвинулась). Перепроведем эти формирования и все встанет на свои места (формирование возьмет коробки уже из ячейки "1").
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Серия КАК Серия
	|ПОМЕСТИТЬ ВТ_СерииДокумента
	|ИЗ
	|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
	|ГДЕ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка = &Ссылка
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Мест > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ФормированиеПаллета.Ссылка КАК Ссылка,
	|	Лико_ФормированиеПаллета.Дата КАК Дата
	|ИЗ
	|	Документ.Лико_ФормированиеПаллета КАК Лико_ФормированиеПаллета
	|ГДЕ
	|	Лико_ФормированиеПаллета.Содержимое.Серия В
	|			(ВЫБРАТЬ
	|				Т.Серия
	|			ИЗ
	|				ВТ_СерииДокумента КАК Т)
	|	И Лико_ФормированиеПаллета.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.Переупаковка)
	|	И Лико_ФормированиеПаллета.Проведен
	|	И НЕ Лико_ФормированиеПаллета.ПометкаУдаления
	|	И Лико_ФормированиеПаллета.ЯчейкаПолучатель.Владелец = &Склад
	|	И Лико_ФормированиеПаллета.Дата >= &ДатаНачала
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ФормированиеПаллета.Ссылка,
	|	Лико_ФормированиеПаллета.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_ФормированиеПаллета.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", СкладГП);
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата() - 86400*3);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ШаблонЗапретаДанных = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
		СтрокаШаблона = ШаблонЗапретаДанных.Добавить();
		СтрокаШаблона.Дата   = ВыборкаДетальныеЗаписи.Дата;
		Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ШаблонЗапретаДанных) Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ФормированиеПаллетаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ФормированиеПаллетаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			// не получилось
			а=0; // для возможности поставить точку останова
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура Лико_СформироватьДвиженияПоРНЛико_СтоимостьДоставки(Отказ)
	
	Движения.Лико_СтоимостьДоставки.Записывать = Истина;
	КурсДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), ?(ЗначениеЗаполнено(ДатаОтгрузки), ДатаОтгрузки, Дата)).Курс;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ДатаОтгрузки КАК Период,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.СкладГП КАК Склад,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаказКлиента КАК Заказ,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Номенклатура КАК Номенклатура,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Характеристика КАК Характеристика,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Серия КАК Серия,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Количество КАК Количество,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Стоимость КАК Сумма,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Стоимость * &Курс КАК СуммаРегл
	|ИЗ
	|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
	|ГДЕ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка = &Ссылка
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Мест > 0
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Стоимость > 0";
	
	Запрос.УстановитьПараметр("Курс", ?(ЗначениеЗаполнено(КурсДокумента), КурсДокумента, 1));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.Лико_СтоимостьДоставки.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура Лико_СформироватьДвиженияПОЛико_ЗатратыПоЗаказу(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	Движения.Лико_ЗатратыПоЗаказу.Записывать = Истина;
	Движения.Лико_ЗатратыНаПродажи.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ДатаОтгрузки КАК Период,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаказКлиента.РабочийЦентр КАК РабочийЦентр,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ТранспортныеРасходы)) КАК СтатьяЗатрат,
	|	СУММА(Лико_ЗаявкаНаТранспортировкуПродукция.Количество) КАК Количество,
	|	СУММА(Лико_ЗаявкаНаТранспортировкуПродукция.Стоимость / 1.2) КАК Сумма,
	|	МАКСИМУМ(1) КАК НомерПроката,
	|	СУММА(Лико_ЗаявкаНаТранспортировкуПродукция.Стоимость) КАК СуммаПлан,
	|	СУММА(Лико_ЗаявкаНаТранспортировкуПродукция.Количество) КАК КоличествоПлан,
	|	СУММА(Лико_ЗаявкаНаТранспортировкуПродукция.Стоимость / 1.2) КАК Транспорт,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК Поле1,
	|	ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг) КАК ДокументПродажи
	|ИЗ
	|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СвязиСТиповымиДокументами КАК Лико_СвязиСТиповымиДокументами
	|		ПО Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка = Лико_СвязиСТиповымиДокументами.Документ
	|			И (Лико_СвязиСТиповымиДокументами.ТиповойДокумент ССЫЛКА Документ.РеализацияТоваровУслуг)
	|			И (НЕ ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг).ПометкаУдаления)
	|			И (ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг).Проведен)
	|ГДЕ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка = &Ссылка
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Мест > 0
	|	И (ВЫРАЗИТЬ(Лико_ЗаявкаНаТранспортировкуПродукция.Стоимость КАК ЧИСЛО(15, 2))) > 0
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ОбщаяСтоимостьДоставки <> 1
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ДатаОтгрузки,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаказКлиента,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.ЗаказКлиента.РабочийЦентр,
	|	ВЫРАЗИТЬ(Лико_СвязиСТиповымиДокументами.ТиповойДокумент КАК Документ.РеализацияТоваровУслуг)";
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.Лико_ЗатратыПоЗаказу.Добавить(), Выборка);
		Запись =  Движения.Лико_ЗатратыНаПродажи.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.Заказ = Выборка.ЗаказКлиента;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПеределатьКлючевыеПараметрыВСвязяхСТиповымиДокументами()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписи = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Документ.Установить(Ссылка);
	НаборЗаписи.Прочитать();
	
	Если КорректировкаОтгрузкаВРублях = 1 Тогда
		НоваяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Иначе
		Если ЗначениеЗаполнено(КорректировкаВалюта) Тогда
			НоваяВалюта = КорректировкаВалюта;
		ИначеЕсли ЗаказыНаОтгрузку.Количество() > 0 И ЗначениеЗаполнено(ЗаказыНаОтгрузку[0].Валюта) Тогда
			Если ЗаказыНаОтгрузку[0].ЗаявкаНаОтгрузку.Товары.Количество() > 0 И ЗаказыНаОтгрузку[0].ЗаявкаНаОтгрузку.Товары[0].ОтгрузкаВРублях Тогда
				НоваяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
			Иначе
				НоваяВалюта = ЗаказыНаОтгрузку[0].Валюта;
			КонецЕсли;
		ИначеЕсли Продукция.Количество() > 0 И Продукция[0].ЗаявкаНаОтгрузку.Товары.Количество() > 0 И ЗначениеЗаполнено(Продукция[0].ЗаявкаНаОтгрузку.Товары[0].ВалютаЦены) Тогда
			Если Продукция[0].ЗаявкаНаОтгрузку.Товары[0].ОтгрузкаВРублях Тогда
				НоваяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
			Иначе
				НоваяВалюта = Продукция[0].ЗаявкаНаОтгрузку.Товары[0].ВалютаЦены;
			КонецЕсли;
		Иначе
			НоваяВалюта = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Запись из НаборЗаписи Цикл
		Если ЗначениеЗаполнено(Запись.Валюта) И ЗначениеЗаполнено(НоваяВалюта) Тогда
			Запись.Валюта = НоваяВалюта;
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.Контрагент) И ЗначениеЗаполнено(КорректировкаГрузополучатель) Тогда
			Запись.Контрагент = КорректировкаГрузополучатель;
		КонецЕсли;			
	КонецЦикла;
	
	Попытка
		НаборЗаписи.Записать(Истина);
	Исключение
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось записать данные в регистр сведений ЛикоСвязиСТиповымиДокументами! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура УдалитьИзЛико_ПередачаТоваровМеждуОрганизациямиСвязанныеСтроки()

	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПередачаТоваровМеждуОрганизациями.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_ПередачаТоваровМеждуОрганизациями КАК Лико_ПередачаТоваровМеждуОрганизациями
		|ГДЕ
		|	Лико_ПередачаТоваровМеждуОрганизациями.Товары.СвязанныйДокумент = &СвязанныйДокумент";
	
	Запрос.УстановитьПараметр("СвязанныйДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		МассивУдаляемыхСтрок = ДокОбъект.Товары.НайтиСтроки(Новый Структура("СвязанныйДокумент", Ссылка));
		
		Для каждого Строка из МассивУдаляемыхСтрок Цикл
			ДокОбъект.Товары.Удалить(Строка);
		КонецЦикла;
		
		Попытка
			Если ДокОбъект.Товары.Количество() = 0 И ДокОбъект.Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				РежимЗаписи = ?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			КонецЕсли;
			ДокОбъект.Записать(РежимЗаписи);
		Исключение
			Отказ = Истина;
			Сообщить("Документ """ + ДокОбъект + """ не удалось выполнить операцию """ + РежимЗаписи + """ после удаления из него связанных строк! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;                  
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьАдресГрузоотправителя() Экспорт
	
	СтруктураВозврата = Новый Структура("Адрес,АдресЗначенияПолей");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.ЗначенияПолей
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Ссылка", Грузоотправитель);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Адрес = Выборка.Представление;
		СтруктураВозврата.АдресЗначенияПолей = Выборка.ЗначенияПолей;
	Иначе
		СтруктураВозврата.Адрес = "";
		СтруктураВозврата.АдресЗначенияПолей = "";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ИзменитьСтатусЗаказаНаЗакрыт(Заказ)
	
	// --> Начало Лико Ефимов ЕВВ 21.07.2021
	// Пока отключаем
	Возврат;
	// <-- Конец Лико Ефимов ЕВВ 21.07.2021
	
	УстановитьПривилегированныйРежим(Истина);
	Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра Тогда
		Если Заказ.Состояние <> Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда 
			//ЗаказОбъект = Заказ.ПолучитьОбъект();
			//ЗаказОбъект.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт;
			//Попытка 
			//	ЗаказОбъект.ОбменДанными.Загрузка=Истина;
			//	ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
			//Исключение				
			//КонецПопытки;
			Лико_Дополнительно.ЗакрытьЭтапыИЗаказ(Заказ, ТекущаяДата(), Ложь);
			Лико_Планирование.ПеренестиЗаказ(Заказ, Справочники.Лико_ЭтапыВыполненияЗаказа.ЗакрытиеЗаказа);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПерезаполнитьКоличествоИзСерий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продукция.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(Продукция.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	Продукция.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Продукция КАК Продукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Серия КАК Серия,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Серия.Лико_КоличествоВУпаковке КАК КоличествоВСерии
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Количество <> ВТ.Серия.Лико_КоличествоВУпаковке";
	
	Запрос.УстановитьПараметр("Продукция", Продукция.Выгрузить(,"НомерСтроки,Серия,Количество"));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Продукция[ВыборкаДетальныеЗаписи.НомерСтроки-1].Количество = ВыборкаДетальныеЗаписи.КоличествоВСерии;
	КонецЦикла;
	
КонецПроцедуры

КлючиСтруктуры =	"ОтборРазмещениеТоваров_Отбор,
|РасходныйОрдерНаТовары,
|СчетФактураВыданный,
|Лико_СчетНаОплатуКлиенту,
|СчетНаОплатуКлиенту,
|АктВыполненныхРабот,
|РеализацияТоваровУслуг,
|ТранспортнаяНакладная,
|ПриходныйОрдерНаТовары,
|РасходныйОрдерНаТовары,
|ПеремещениеТоваров,
|ВнутреннееПотребление,
|ПриемкаТоваровНаХранение,
|ОтгрузкаТоваровСХранения,
|ОтборРазмещениеТоваров_Размещение,
|ПередачаТоваровМеждуОрганизациями,
|Лико_ПередачаТоваровМеждуОрганизациями,
|ОтборРазмещениеТоваров_Перемещение";
СтруктураСоответствияТЧ = Новый Структура("ЗаказКлиента,Номенклатура,Характеристика,Контрагент,Намотка,ЗаявкаНаОтгрузку,Город,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки");
