
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если  ТипЗнч(ДанныеЗаполнения)= Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЗаполнитьНаОснованииЗаказаКлиента(ДанныеЗаполнения);
	КонецЕсли;	
КонецПроцедуры

Процедура  ЗаполнитьНаОснованииЗаказаКлиента(Знач Основание)
	Заказ = Основание;
	//стрВариант = ВариантыСпецификации.Добавить();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Заказ);

	Для каждого стрТовары Из Заказ.товары Цикл
		стр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стр, стрТовары);
	КонецЦикла;
	Для каждого стрЦвета Из Заказ.Цвета Цикл
		НоваяСтрЦвета =  Цвета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрЦвета, стрЦвета);
		НоваяСтрЦвета.номерВарианта = 1;
		НоваяСтрЦвета.КлючСтроки = Новый УникальныйИдентификатор;
		СтрокиФорм = Заказ.Формы.НайтиСтроки(Новый Структура("КлючСтроки", СтрЦвета.КлючСтроки)) ;
		Для Каждого стрФорм из СтрокиФорм Цикл
			новаястрформ = Формы.добавить();
			ЗаполнитьЗначенияСвойств(новаястрформ, стрформ);
			новаястрформ.КлючСтроки = НоваяСтрЦвета.ключстроки;
		КонецЦикла;
		
	КонецЦикла;
	Для каждого стрРаботы Из Заказ.ВидыРабот Цикл
		НоваяСтрРаботы = ВидыРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрРаботы, стрРаботы);
		НоваяСтрРаботы.номерВарианта = 1;
		НоваяСтрРаботы.КлючСтроки = Новый УникальныйИдентификатор;
	
	КонецЦикла;
	//СтрШтамп = ПараметрыШтампа.Добавить();
	//ЗаполнитьЗначенияСвойств(стрШтамп, Заказ);
	//СтрШтамп.НомерВарианта = 1;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// --> Начало Лико Ефимов ЕВВ 06.06.2018
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 06.06.2018 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// --> Начало лк Субботин 28.01.22
	Для каждого стр из Цвета цикл  
		Если  стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") и НЕ ЭтоЦифра(стр.РабочийЦентр)  Тогда
			Если Не ЗначениеЗаполнено(стр.ТипНумератора) Тогда
				Сообщить("не заполнен Тип нумератора в строке " + стр.НомерСтроки);	
				Возврат;
			КонецЕсли;	
			
			Если Не  ЗначениеЗаполнено(стр.ТипКраски) Тогда
				Сообщить("не заполнены Чернила в строке " + стр.НомерСтроки);	
				Возврат;
			КонецЕсли;  
			
			Если Не  ЗначениеЗаполнено(стр.ТипКода) Тогда
				Сообщить("не заполнен Тип кода в строке " + стр.НомерСтроки);	
				Возврат;
			КонецЕсли;   
			
			Если Не  ЗначениеЗаполнено(стр.КоличествоКодовНаЛисте)  Тогда
				Сообщить("не заполнено Количество кодов на листе в строке " + стр.НомерСтроки);	
				Возврат;
			КонецЕсли;
			
			Если Не  ЗначениеЗаполнено(стр.КоличествоРучьевНумератора)  Тогда
				Сообщить("не заполнено Количество ручьев нумератора в строке " + стр.НомерСтроки);	
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	// <-- Конец лк Субботин 28.01.22
	
	
	//Заполним Этикетки	
	Таб = Товары.Выгрузить();
	Таб.Свернуть("Номенклатура,КодЭтикеткиЗаказчика");
	Этикетки = "";
	АртикулыЭтикеток = "";
	Для каждого стр из Таб Цикл
		Этикетки = Этикетки + стр.Номенклатура.Лико_ТипЭтикетки+" "+СокрЛП(стр.Номенклатура.Наименование);
		АртикулыЭтикеток = АртикулыЭтикеток+?(ЗначениеЗаполнено(АртикулыЭтикеток), ", ", "")+стр.Номенклатура.Артикул;

		Если ЗначениеЗаполнено(стр.КодЭтикеткиЗаказчика)Тогда
			Этикетки = Этикетки +" * "+ стр.КодЭтикеткиЗаказчика;
		КонецЕсли;	
	КонецЦикла;	
		
	НомераКонтрактов = "";
	Таб = Товары.Выгрузить();
	Таб.Свернуть("NКонтракта");
	Для каждого стр из Таб Цикл
		Если ЗначениеЗаполнено(стр.NКонтракта) Тогда 
			НомераКонтрактов = НомераКонтрактов+ ?(ЗначениеЗаполнено(НомераКонтрактов)," * ", "") + стр.NКонтракта;	
		КонецЕсли;	
	КонецЦикла;
			

	
	//ОригиналМакет = Ложь;
	//Таб = Источник.Товары.Выгрузить();
	//Таб.Свернуть("ОригиналМакет");
	//Для каждого стр из Таб Цикл
	//	Если ЗначениеЗаполнено(стр.ОригиналМакет) Тогда 
	//		ОригиналМакет = Истина;
	//	КонецЕсли;	
	//КонецЦикла;
	//Источник.ОригиналМакет =ОригиналМакет;
	
	//ШтампыСтрокой = "";
	//ДопМатериалыСтрокой = "";
	//НаличиеЦифры = ЛОжь;

	//Для каждого стр из Источник.ВидыРабот Цикл
	//	Если ЗначениеЗаполнено(стр.Оснастка) Тогда 
	//		ШтампыСтрокой = ШтампыСтрокой+ ?(ЗначениеЗаполнено(ШтампыСтрокой)," * ", "") + стр.Оснастка.Артикул;	
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(стр.Материал) Тогда
	//		Если стрНайти(ДопМатериалыСтрокой,стр.Материал.Наименование)=0 Тогда  
	//			ДопМатериалыСтрокой = ДопМатериалыСтрокой+?(ЗначениеЗаполнено(ДопМатериалыСтрокой)," * ", "") +стр.Нарезка+" "+ стр.Материал.Наименование;
	//		КонецЕсли;	
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(стр.ВидРабот) Тогда
	//		Если Стр.ВидРабот.Родитель = Справочники.ВидыРаботСотрудников.Тиснение Тогда  
	//			Источник.Тиснение = Истина;
	//		КонецЕсли;
	//		Если Стр.ВидРабот.Родитель = Справочники.ВидыРаботСотрудников.Ламинирование Тогда  
	//			Источник.Ламинация = Истина;
	//		КонецЕсли;
	//		Если Стр.ВидРабот.Родитель = Справочники.ВидыРаботСотрудников.Конгревы Тогда  
	//			Источник.Конгрев = Истина;
	//		КонецЕсли;		
	//	КонецЕсли;		
	//	Если ЗначениеЗаполнено(стр.РабочийЦентр) Тогда 
	//		Если Стр.РабочийЦентр.ВидРабочегоЦентра  = Справочники.ВидыРабочихЦентров.NewFoil Тогда  
	//			Источник.НФ = Истина;
	//		ИначеЕсли Стр.РабочийЦентр.ВидРабочегоЦентра  = Справочники.ВидыРабочихЦентров.Indigo Тогда  
	//			НаличиеЦифры = Истина;	
	//		КонецЕсли;		
	//	КонецЕсли;		
	//КонецЦикла;
	//Источник.Цифровой = НаличиеЦифры;

	
	//Источник.ДопМатериалыСтрокой =ДопМатериалыСтрокой;
	//СтруктураЦены = ПолучитьСреднююЦену(Источник.Ссылка);
	//Источник.ЦенаСредняя = СтруктураЦены.ЦенаСредняя;
	//Источник.ЦенаДляДокументовСредняя = СтруктураЦены.ЦенаДляДокументовСредняя;
	//Источник.СуммаДокумента = Источник.Товары.Итог("СуммаСНДС")+Источник.СтоимостьОснастки;
	
	//Заполним Цвета
	//ЦветаСтрокой = ПолучитьСтрокуЦветов(Ссылка);
	//ФормыСтрокой =ПолучитьСтрокуФорм(Ссылка);
	//Первый Рабочий Центр
	//Если Заказ отправлен в работу, то рабочий центр не меняем
	//Если Не ЗначениеЗаполнено(Источник.ДатаОтправкиВРаботу) Тогда 
	//	стр = Источник.ВидыРабот.Найти(1, "НомерПроката");
	//	Если стр<>Неопределено Тогда 
	//		Источник.РабочийЦентр = стр.РабочийЦентр;
	//	КонецЕсли;
	//КонецЕсли;	
	//Если Не РучнойВводПрокатов Тогда
	//	ЗаполнитьНомерПроката() ;
	//КонецЕсли;	
	
	Лико_Планирование.ПроставитьНомераРабот(ЭтотОбъект);

КонецПроцедуры


Функция ЭтоЦифра(РабочийЦентр)
	
	ВидРЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочийЦентр, "ВидРабочегоЦентра").ВидРабочегоЦентра;     
	Если ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") или ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet") Тогда
		Возврат Истина	
	Иначе
		Возврат Ложь		
	КонецЕсли;

	
КонецФункции

