
Функция СодатьНоменклатуруСмеси070222(Формула,ВидТМЦ,ВидПечати,БазоваяНоменклатура) Экспорт //+Лико m.shenderov 25.01.2021
	
	Если ТипЗнч(Формула)=Тип("Строка") Тогда
	НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула);
Иначе
	НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула.Наименование);

	КонецЕсли;
	Смесь=Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеСмеси);

	Если  ЗначениеЗаполнено(Смесь) Тогда
		Возврат Смесь;
	КонецЕсли;
	
	
	
	СпрОбъект					                =Справочники.Номенклатура.СоздатьЭлемент();
	СпрОбъект.Лико_ВидТМЦ		                =ВидТМЦ;
	СпрОбъект.Лико_ВидПечати	                =ВидПечати;
	СпрОбъект.ВидНоменклатуры	                =Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра;
	СпрОбъект.Наименование		                =НаименованиеСмеси;
	СпрОбъект.ЕдиницаИзмерения	                =БазоваяНоменклатура.ЕдиницаИзмерения;
	СпрОбъект.ЕдиницаДляОтчетов	                =БазоваяНоменклатура.ЕдиницаДляОтчетов;
	СпрОбъект.ВесЗнаменатель	                =БазоваяНоменклатура.ВесЗнаменатель;
	СпрОбъект.ВесИспользовать	                =БазоваяНоменклатура.ВесИспользовать;
	СпрОбъект.ВесМожноУказыватьВДокументах      =БазоваяНоменклатура.ВесМожноУказыватьВДокументах;
	СпрОбъект.ГруппаДоступа		                =БазоваяНоменклатура.ГруппаДоступа;
	СпрОбъект.ИспользоватьУпаковки		        =БазоваяНоменклатура.ИспользоватьУпаковки;
	СпрОбъект.НаборУпаковок						=БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.НаборУпаковок                     =БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.ГруппаФинансовогоУчета            =БазоваяНоменклатура.ГруппаФинансовогоУчета;
	СпрОбъект.ГруппаАналитическогоУчета         =БазоваяНоменклатура.ГруппаАналитическогоУчета;
	СпрОбъект.ЦеноваяГруппа                     =Формула.ЦеноваяГруппа;
	СпрОбъект.ТипНоменклатуры                   =Перечисления.ТипыНоменклатуры.Товар;		
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;	
	
	
КонецФункции  //-Лико m.shenderov 25.01.2021


Функция СодатьНоменклатуруСмеси(Формула, ВидТМЦ, ВидПечати, БЗ) Экспорт 

	Если ТипЗнч(Формула)=Тип("Строка") Тогда
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула);
	Иначе
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула.Наименование);

	КонецЕсли;
	Смесь=Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеСмеси);

	Если  ЗначениеЗаполнено(Смесь) Тогда
		СпрОбъект= Смесь.ПолучитьОбъект(); 
	Иначе
		СпрОбъект					                =Справочники.Номенклатура.СоздатьЭлемент(); 		
	КонецЕсли;
	



	
	
	ЗаполнитьЗначенияСвойств(СпрОбъект,БЗ.БазоваяНоменклатура,,"Ссылка");
	
	
	
	СпрОбъект.Лико_ВидТМЦ		                =ВидТМЦ;
	СпрОбъект.Лико_ВидПечати	                =ВидПечати;
	СпрОбъект.ВидНоменклатуры	                =Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра;
	СпрОбъект.Наименование		                =НаименованиеСмеси;
	СпрОбъект.ЕдиницаИзмерения	                =БЗ.БазоваяНоменклатура.ЕдиницаИзмерения;
	СпрОбъект.ЕдиницаДляОтчетов	                =БЗ.БазоваяНоменклатура.ЕдиницаДляОтчетов;
	СпрОбъект.ВесЗнаменатель	                =БЗ.БазоваяНоменклатура.ВесЗнаменатель;
	СпрОбъект.ВесИспользовать	                =БЗ.БазоваяНоменклатура.ВесИспользовать;
	СпрОбъект.ВесМожноУказыватьВДокументах      =БЗ.БазоваяНоменклатура.ВесМожноУказыватьВДокументах;
	СпрОбъект.ГруппаДоступа		                =БЗ.БазоваяНоменклатура.ГруппаДоступа;
	СпрОбъект.ИспользоватьУпаковки		        =БЗ.БазоваяНоменклатура.ИспользоватьУпаковки;
	СпрОбъект.НаборУпаковок						=БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.НаборУпаковок                     =БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.ГруппаФинансовогоУчета            =БЗ.БазоваяНоменклатура.ГруппаФинансовогоУчета;
	СпрОбъект.ГруппаАналитическогоУчета         =БЗ.БазоваяНоменклатура.ГруппаАналитическогоУчета;
	СпрОбъект.ЦеноваяГруппа                     =Формула.ЦеноваяГруппа;
	СпрОбъект.ТипНоменклатуры                   =Перечисления.ТипыНоменклатуры.Товар;
	СпрОбъект.Записать();
	
		МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",
	ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("КраскаВид", Истина),
	УправлениеСвойствами.ЗначениеСвойства(БЗ,"КраскаВид")));
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(СпрОбъект.Ссылка,МассивСтруктур);


	Возврат СпрОбъект.Ссылка;	


КонецФункции


Функция ПроверкаЗаполненияПолей(Формула)Экспорт //+Лико m.shenderov 27.07.2021
	Поля="";
	Если  Не ЗначениеЗаполнено(Формула.Состав) Тогда
		Поля=Поля+"
		| Состав;";
	КонецЕсли;
	
	Если  Не ЗначениеЗаполнено(Формула.ВидПечати) Тогда
		Поля=Поля+"
		| Вид печати;";
	КонецЕсли;
	
	Если  Не ЗначениеЗаполнено(Формула.ВидТМЦ) Тогда
		Поля=Поля+"
		| Вид ТМЦ;";
	КонецЕсли;
	
	Если Формула.Площадка = Справочники.Лико_Площадки.ИксПак Тогда		
		Если  Не ЗначениеЗаполнено(Формула.ЦеноваяГруппа) Тогда
			Поля=Поля+"
			| Ценовая группа;";
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(Формула.Номенклатура) Тогда
			Поля=Поля+"
			| Номенклатура;";
		КонецЕсли;				
	КонецЕсли;
	Если ЗначениеЗаполнено(Поля) Тогда
		Поля=Лев(Поля,СтрДлина(Поля)-1)+".";
		Поля="В формуле не заполнены следующие реквизиты: "+Поля;
	КонецЕсли;
	
	Возврат Поля;

	
КонецФункции //-Лико m.shenderov 27.07.2021 
