
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;	
	Если Площадка = Справочники.Лико_Площадки.ИксПак Тогда
		ПроверяемыеРеквизиты.Добавить("Номенклатура");
		ПроверяемыеРеквизиты.Добавить("ВидТМЦ");
		ПроверяемыеРеквизиты.Добавить("ВидПечати");
		ПроверяемыеРеквизиты.Добавить("ЦеноваяГруппа");
		
	КонецЕсли; 	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов); 	
КонецПроцедуры
