
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_КлейЛаминации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_КлейЛаминации КАК Лико_КлейЛаминации
	|ГДЕ
	|	Лико_КлейЛаминации.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка = ЭтотОбъект.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Отказ = Истина;
		Сообщить("Элемент с наименованием: """ + Наименование + """ уже существует");
	КонецЦикла;
	
КонецПроцедуры
