
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Площадка") Тогда
		Brc=УправлениеСвойствами.ЗначениеСвойства(Параметры.Площадка,"Лико_УчетНаСкладеПоBRC");
		Brc=?(ЗначениеЗаполнено(Brc),Brc,Ложь);
		
		Если Brc Тогда
			Элементы.СписокРедактироватьОбъектНоменклатуры.Видимость=истина;
		Иначе
			Элементы.СписокРедактироватьОбъектНоменклатуры.Видимость=Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура",Параметры.Номенклатура);
	КонецЕсли; 	
	
	Если Параметры.Свойство("Характеристика") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Характеристика",Параметры.Характеристика);
	КонецЕсли; 		 
	
	//Если Параметры.Свойство("МассивПомещений") Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("МассивПомещений",Параметры.МассивПомещений);
	//КонецЕсли; 
	
	Если Параметры.Свойство("Площадка") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Площадка",Параметры.Площадка);
	КонецЕсли;
	
	Если Параметры.Свойство("ТипСклада") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТипСклада",Параметры.ТипСклада);
	КонецЕсли; 
	Если Параметры.Свойство("УдаленныйСклад") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("УдаленныйСклад",Параметры.УдаленныйСклад);
	КонецЕсли; 
	
	Если Параметры.Свойство("ВидНастроечногоМатериала") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ВидНастроечногоМатериала",Параметры.ВидНастроечногоМатериала);
	КонецЕсли; 
	
Если Параметры.Свойство("ОтветХранение") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтветХранение",Параметры.ОтветХранение);
	КонецЕсли;	
	
	
	
	Если Параметры.Свойство("К2") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("К2",Параметры.К2);
	КонецЕсли; 	
	
	Если Параметры.Свойство("ЗаказКлиента") Тогда
		ЗаказКлиента=Параметры.ЗаказКлиента;
	КонецЕсли; 
	
	
	Если Параметры.Свойство("Партнер") Тогда
		Партнер=Параметры.Партнер;
	КонецЕсли; 
	
		Если Параметры.Свойство("Резерв") И ТипЗнч(Резерв) = Тип("Массив") Тогда
					Резерв.ЗагрузитьЗначения(Параметры.Резерв);
			//Партнер=Параметры.Партнер;
	КонецЕсли; 

	//
	// <-- Начало Лико Яцун С. В. 25.11.2024 
	Если Параметры.Свойство("ПоказыватьВсе") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе",Параметры.ПоказыватьВсе);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе",Ложь);
	КонецЕсли; 
	// <-- Конец Лико Яцун С. В. 25.11.2024  
	
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьОбъектНоменклатуры(Команда)
	ТД=Элементы.Список.ТекущиеДанные;
	Если ТД<>Неопределено Тогда
		Если ЗначениеЗаполнено(Тд.ОбъектНоменклатуры) Тогда
			ПоказатьЗначение(,Тд.ОбъектНоменклатуры);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарезервироватьПодКлиента(Команда)
	
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		ГлЛико_Оператор=СотрудникПоF2НаСервере();		
	КонецЕсли;
	
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Партнер",Партнер);
	ПараметрыЗаполнения.Вставить("Сотрудник",ГлЛико_Оператор);
	
	МассивСерий= Новый Массив;
	Для каждого Индекс Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Данные=Элементы.Список.ДанныеСтроки(Индекс);  
		
		Если ЗначениеЗаполнено(Данные.Резерв) Тогда
			//Продолжить;
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Данные.Номенклатура);
		Структура.Вставить("Характеристика",Данные.Характеристика);
		Структура.Вставить("Упаковка",Данные.Упаковка);
		Структура.Вставить("Серия",Данные.Серия); 
		Структура.Вставить("СтатусУказанияСерий",8);
		Структура.Вставить("КоличествоУпаковок",Данные.Количество);
		Структура.Вставить("Количество",Данные.КоличествоУУ);
		Структура.Вставить("АдресХранения",Данные.Адрес);
		Структура.Вставить("ВидНастроечногоМатериала",Данные.ВидНастроечногоМатериала); 		
		МассивСерий.Добавить(Структура);
		
	КонецЦикла; 
	ПараметрыЗаполнения.Вставить("МассивСерий",МассивСерий);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ПараметрыЗаполнения);
	
	
	
	
	ОписаниеОповещение= Новый ОписаниеОповещения("ЗарезервироватьПодКлиентаЗавершение",ЭтаФорма);
	ОткрытьФорму("Документ.Лико_УстановкаРезерваМатериалов.Форма.ФормаДокумента",ПараметрыФормы,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарезервироватьПодКлиентаЗавершение(прРезультат,прПараметры) Экспорт//+Лико m.shenderov 18/11/2019
	
	Элементы.Список.Обновить();
	
КонецПроцедуры //-Лико m.shenderov 18/11/2019

&НаСервере
Функция СотрудникПоF2НаСервере()
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СотрудникПоF2",Неопределено);
	
КонецФункции
