
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	//++ kit:mih web 16.07.21
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Лико_ЗабраковкаМатериалов";
	КомандаПечати.Идентификатор = "ОбразецНПБракМатериала";
	КомандаПечати.Представление = НСтр("ru = 'Образец НП брак материала';
	|en = '-'");
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ЗаголовокФормы = "Образец НП брак материала"; 
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	//-- kit:mih web 16.07.21
	
	//++ kit:mih web 16.08.21
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Лико_ЗабраковкаМатериалов";
	КомандаПечати.Идентификатор = "АктБрака";
	КомандаПечати.Представление = НСтр("ru = 'Акт брака';
	|en = '-'");
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ЗаголовокФормы = "Акт брака"; 
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	//-- kit:mih web 16.08.21

	
КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	//++ kit:mih web 16.07.21
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОбразецНПБракМатериала") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ОбразецНПБракМатериала",
		НСтр("ru = 'Образец НП брак материала';
		|en = '-'"),
		СформироватьПечатнуюФорму(МассивОбъектов[0], ПараметрыПечати, ОбъектыПечати));
	КонецЕсли;
	//-- kit:mih web 16.07.21
	
	//++ kit:mih web 16.08.21
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктБрака") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"АктБрака",
		НСтр("ru = 'Акт брака';
		|en = '-'"),
		СформироватьПечатнуюФормуАктаБрака(МассивОбъектов[0], ПараметрыПечати, ОбъектыПечати));
	КонецЕсли;
	//-- kit:mih web 16.08.21

КонецПроцедуры

Функция СформироватьПечатнуюФормуАктаБрака(Ссылка, ПараметрыПечати, ОбъектыПечати) //++ kit:mih web 16.08.21
	
	// --> Начало Лико Ефимов ЕВВ 01.12.2021
	Возврат Неопределено;
	// <-- Конец Лико Ефимов ЕВВ 01.12.2021
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Лико_ЗабраковкаМатериалов.ПФ_MXL_АктБрака");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(Область);
	//КодНаполнения
	
	Возврат ТабличныйДокумент;
	
КонецФункции //-- kit:mih web 16.08.21

Функция СформироватьПечатнуюФорму(Ссылка, ПараметрыПечати, ОбъектыПечати) Экспорт //++ kit:mih web 16.07.21
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Лико_ЗабраковкаМатериалов.ПФ_MXL_ОбразецНПБракМатериала");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗабраковкаМатериалов.Номер КАК Номер,
		|	Лико_ЗабраковкаМатериалов.Дата КАК Дата,
		|	Лико_ЗабраковкаМатериалов.Представление КАК Наименование,
		|	ВЫБОР
		|		КОГДА Лико_ЗабраковкаМатериалов.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
		|			ТОГДА Лико_ЗабраковкаМатериалов.МестоОбнаружения
		|		ИНАЧЕ Лико_ЗабраковкаМатериалов.РабочийЦентр
		|	КОНЕЦ КАК МестоОбнаружения,
		|	Лико_ЗабраковкаМатериалов.ЗаказКлиента.Номер КАК НомерЗаказаКлиента,
		|	Лико_ЗабраковкаМатериалов.Дефект КАК ВидДефекта,
		|	Лико_ЗабраковкаМатериалов.СотрудникОбнаружившийБрак КАК КемОбнаружен,
		|	Лико_ЗабраковкаМатериалов.ОписаниеДефекта КАК ОписаниеДефекта,
		|	Лико_ЗабраковкаМатериалов.Решение КАК Решение,
		|	Лико_ЗабраковкаМатериалов.СотрудникОформившийОбразец КАК СотрудникОформившийОбразец,
		|	Лико_ЗабраковкаМатериалов.МетражПМ КАК МетражПМ,
		|	Лико_ЗабраковкаМатериалов.СотрудникПринявшийРешение КАК СотрудникПринявшийРешение,
		|	Лико_ЗабраковкаМатериалов.ОбразцыПриложеныКНП КАК ОбразцыПриложеныКНП
		|ИЗ
		|	Документ.Лико_ЗабраковкаМатериалов КАК Лико_ЗабраковкаМатериалов
		|ГДЕ
		|	Лико_ЗабраковкаМатериалов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ТабличныйДокумент.РазмерСтраницы = "A4";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если Выборка.Следующий() Тогда
		
		ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьТелоВерх = Макет.ПолучитьОбласть("ТелоВерх");
		ОбластьТелоНиз = Макет.ПолучитьОбласть("ТелоНиз");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПустаяОбласть = Макет.ПолучитьОбласть("ПустаяОбласть");
		ОбластьНадписьОбразцы = Макет.ПолучитьОбласть("ОбразцыПриложеныКНП");
			
		ЗаполнитьЗначенияСвойств(ОбластьШапки.Параметры, Выборка, "Номер");
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		ЗаполнитьЗначенияСвойств(ОбластьТелоВерх.Параметры, Выборка);
		ТабличныйДокумент.Вывести(ОбластьТелоВерх);
		
		Если Выборка.ОбразцыПриложеныКНП Тогда
			ТабличныйДокумент.Вывести(ОбластьНадписьОбразцы);
		КонецЕсли;
	
		ЗаполнитьЗначенияСвойств(ОбластьТелоНиз.Параметры, Выборка);
		ТабличныйДокумент.Вывести(ОбластьТелоНиз);
		
		ОбластьПодвал.Параметры.СотрудникОформившийОбразец = Выборка.СотрудникОформившийОбразец;
		ОбластьПодвал.Параметры.ДатаОформления = ТекущаяДата();
		
		Массив = Новый Массив;
		Массив.Добавить(ОбластьПустаяОбласть);
		Массив.Добавить(ОбластьПодвал);
		
		Пока ТабличныйДокумент.ПроверитьВывод(Массив) Цикл
			ТабличныйДокумент.Вывести(ОбластьПустаяОбласть);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЕсли;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции //-- kit:mih web 16.07.21

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

Функция ПолучитьЦену(Номенклатура, Площадка, Дата) Экспорт 
	Структура = Новый Структура;
	Структура.Вставить("Цена"); 
	Структура.Вставить("Валюта");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена КАК Цена,
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта КАК Валюта
		|ИЗ
		|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|			&Дата,
		|			ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ЦенаПоставщика)
		|				И Площадка = &Площадка
		|				И ЦеноваяГруппа = &ЦеноваяГруппа) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("ЦеноваяГруппа", Номенклатура.ЦеноваяГруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();		
		Выборка.Следующий();	
		Структура.Цена = Выборка.Цена;
		Структура.Валюта = Выборка.Валюта;
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции
