
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТС_ЗаявкаНаРемонтРабочихЦентров") Тогда	
		
		СотрудникОбнаружившийБрак = ДанныеЗаполнения.Автор;
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		Организация = ДанныеЗаполнения.РабочийЦентр.Лико_Площадка.Организация;
		РабочийЦентр = ДанныеЗаполнения.РабочийЦентр;
		Распоряжение = ДанныеЗаполнения.Ссылка;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Проведен И НЕ ЗначениеЗаполнено(РабочийЦентр) И НЕ ЗначениеЗаполнено(МестоОбнаружения) Тогда
		Отказ = Истина;
		Сообщить(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", ""), + "Необходимо заполнить рабочий центр или место обнаружения");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Проведен Тогда
		ТЗНоменклатур = Материалы.Выгрузить(,"Номенклатура");
		ТЗНоменклатур.Свернуть("Номенклатура");
		Если ТЗНоменклатур.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", "") + "В одном документе не могут содержаться материалы с разной номенклатурой");
		КонецЕсли;
	КонецЕсли;
	
	МетражСтрокой = "";
	МетражКВМ = 0;
	МетражПМ = 0;
	УникальныеНомераРоликов = "";
	Для Каждого Строка Из Материалы Цикл
		МетражКВМ = МетражКВМ + Строка.МетражКВМ;
		МетражПМ = МетражПМ + Строка.МетражПМ;
		МетражСтрокой = МетражСтрокой + ?(ЗначениеЗаполнено(МетражСтрокой), "; ", "") +  ?(ЗначениеЗаполнено(Строка.Нарезка), "" + Строка.Нарезка + " - ", "") +  Строка.МетражКВМ;
		ТекНомерРолика = Формат(Строка.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки, "ЧГ=0");
		Если НЕ ЗначениеЗаполнено(ТекНомерРолика) Тогда
			ТекНомерРолика = "не заполнен";
		КонецЕсли;
		УникальныеНомераРоликов = ?(ЗначениеЗаполнено(УникальныеНомераРоликов), УникальныеНомераРоликов + ", " + ТекНомерРолика, ТекНомерРолика); 
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.ПисьмоПоРешениюОтправлено И Ссылка.Решение <> Решение Тогда
		ПисьмоПоРешениюОтправлено = Ложь;
	КонецЕсли; 
	// -->  Субботин 29.11.2022 
	Если Материалы.Количество() > 0 Тогда
		Номенклатура = Материалы[0].Номенклатура;
	КонецЕсли;
	// <--  Субботин 29.11.2022 
	
	
	ПроверитьЦены();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Неопределено;
	Распоряжение = Неопределено;
	СотрудникОбнаружившийБрак = Неопределено;
	СотрудникПринявшийРешение = Неопределено;
	СотрудникОформившийОбразец = Неопределено;
	Акт = Неопределено;
	СтатусПретензии = Неопределено;
	ДатаВыставленияПретензии = Неопределено;
	ДатаОжиданияОтвета = Неопределено;
	ТипВозвратаПоставщику = Неопределено;
	СуммаБрака = Неопределено;
	ОкончательноеРешение = Неопределено;
	ДатаВыполнения = Неопределено;
	МетражКВМ = Неопределено;
	МетражСтрокой = Неопределено;
	ПисьмоПоРешениюОтправлено = Неопределено;
	ПисьмоКладовщикамОтправлено = Неопределено;
	ДокументОснование = Неопределено;
	ЭтоНовыйДокумент = Неопределено;
	ОбразцыПриложеныКНП = Неопределено;
	МетражПМ = Неопределено;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//+ ---> Лико m.shenderov 12.12.2022
	УстановитьПривилегированныйРежим(Истина);	
	Движения.Лико_БракСерий.Записывать = Истина;
	
	Для каждого Материал Из Материалы  Цикл 
		
		Движение 						=	Движения.Лико_БракСерий.Добавить();
		Движение.Серия					=	Материал.Серия;
		Движение.ОбъектНоменклатуры		=	Материал.Серия.ЯССМ_ОбъектНоменклатуры;
		Движение.Дефект					=	Дефект;
		Движение.Документ				=	Ссылка;
		Движение.ОписаниеДефекта		= 	ОписаниеДефекта;  
		Движение.Решение				=	Решение;
		Движение.КомментарийКРешению	= 	КомментарийКРешению;
		
		
		
	КонецЦикла; 	
	//- <--- Лико m.shenderov 12.12.2022	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Решение=Справочники.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2 Тогда
		ПроверяемыеРеквизиты.Добавить("ОписаниеДефекта");
	КонецЕсли;
	
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	
	
КонецПроцедуры

Процедура ПроверитьЦены() //+Лико m.shenderov 10.05.2023
	УстановитьПривилегированныйРежим(Истина);
	ЕстьИзменения=Ложь; 
	ВалютаНомененклатуры=Неопределено;
	Итого=0; 
	ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
	
	Для каждого Материал Из Материалы Цикл
		
		Если Не ЗначениеЗаполнено(Материал.Цена) Тогда
			
			СтруктураЦены=Документы.Лико_ЗабраковкаМатериалов.ПолучитьЦену(Материал.Номенклатура,Организация,Дата);
			
			Если ЗначениеЗаполнено(СтруктураЦены.Цена) Тогда
				
				Материал.Цена=СтруктураЦены.Цена;
				ВалютаНомененклатуры=СтруктураЦены.Валюта;
				ЕстьИзменения=Истина;
			КонецЕсли;
			
			
		КонецЕсли;  		 
		
		Итого=Итого+(Материал.Цена*Материал.МетражКВМ);
		
		
		ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
		Если не ЗначениеЗаполнено(Поставщик) Тогда
			Если Материал.Серия<>Неопределено и Материал.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
				
				Лико_ОбщегоНазначенияСервер.НайтиДокументПоступления(ДокументПоступления,Организация,Материал.Серия,Дата); 
				Если ЗначениеЗаполнено(ДокументПоступления)  Тогда
					Поставщик=ДокументПоступления.Контрагент;
				КонецЕсли;
				
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		Валюта=ВалютаНомененклатуры;
		СуммаБрака=Итого;
		
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 10.05.2023


