#Область ОбработчикиСобытий

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеДляПоискаПоИменам() Экспорт
	Результат = Новый Соответствие;
	Результат.Вставить(НРег("elnInfo.code"), НомерЭЛН);
	
	Результат.Вставить(НРег("insurerInfo.regNum"), РегистрационныйНомерФСС);
	Результат.Вставить(НРег("insurerInfo.partTime"), ВнешнееСовместительство);
	Результат.Вставить(НРег("insurerInfo.parentNo"), КодПодчиненностиФСС);
	
	Результат.Вставить(НРег("insuredInfo.category"), СотрудникКатегория);
	Результат.Вставить(НРег("insuredInfo.snils"), СотрудникСНИЛС);
	Результат.Вставить(НРег("insuredInfo.inn"), СотрудникИНН);
	Результат.Вставить(НРег("insuredInfo.fullName"), СотрудникФИО);
	Результат.Вставить(НРег("insuredInfo.birthDate"), СотрудникДатаРождения);
	Результат.Вставить(НРег("insuredInfo.gender"), СотрудникПол);
	Результат.Вставить(НРег("insuredInfo.taxpayer"), СотрудникНалогоплательщик);
	Результат.Вставить(НРег("insuredInfo.id"), СотрудникУдостоверениеЛичности);
	Результат.Вставить(НРег("insuredInfo.workContract"), СотрудникТрудовойДоговор);
	
	Результат.Вставить(НРег("receivePayment"), СпособВыплатыПособия);
	
	Результат.Вставить(НРег("calculationData.years.changeYear"), ГодыДляРасчета);
	Результат.Вставить(НРег("calculationData.years.year.calc"), ГодыДляРасчета);
	Результат.Вставить(НРег("calculationData.years.year.baseSum"), ГодыДляРасчета);
	Результат.Вставить(НРег("calculationData.kfReg"), РайонныйКоэффициентРФ);
	Результат.Вставить(НРег("calculationData.kfShortDays"), ДоляВремени);
	Результат.Вставить(НРег("calculationData.experience.insurYY"), СтраховойСтаж);
	Результат.Вставить(НРег("calculationData.experience.insurMM"), СтраховойСтаж);
	Результат.Вставить(НРег("calculationData.experience.notInsurYY"), НестраховойСтаж);
	Результат.Вставить(НРег("calculationData.experience.notInsurMM"), НестраховойСтаж);
	Результат.Вставить(НРег("calculationData.calcConditionList.calcCondition"), УсловияИсчисления);
	Результат.Вставить(НРег("calculationData.causeRadiation"), Льготы);
	Результат.Вставить(НРег("calculationData.payPeriodFSS.begin"), ПериодОплатыЗаСчетФСС);
	Результат.Вставить(НРег("calculationData.payPeriodFSS.end"), ПериодОплатыЗаСчетФСС);
	Результат.Вставить(НРег("calculationData.excludePeriodList.excludePeriod.type"), ИсключаемыеПериоды);
	Результат.Вставить(НРег("calculationData.excludePeriodList.excludePeriod.period"), ИсключаемыеПериоды);
	Результат.Вставить(НРег("calculationData.downPeriodList.downPeriod.period"), ПериодыПростоя);
	Результат.Вставить(НРег("calculationData.downPeriodList.downPeriod.idleAverage"), ПериодыПростоя);
	
	
	Результат.Вставить(НРег("vacation"), ОтпускПоУходу);
	
	
	Результат.Вставить(НРег("wardInfo"), УсыновлениеОпека);
	Результат.Вставить(НРег("refFamilyInfo"), ПередачаНаВоспитание);
	Результат.Вставить(НРег("birthInfo"), ИнформацияОРожденииРебенка);
	Результат.Вставить(НРег("refNpayOther"), СправкаОтДругогоРодителя);
	Результат.Вставить(НРег("otherMissing"), СправкаОтДругогоРодителя);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли