#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает префикс переданного пространства имен.
// 
// Параметры:
//  ПространствоИмен - Строка - Полное пространство имен
// 
// Возвращаемое значение:
//  Строка - Префикс пространства имен
Функция ПрефиксПространстваИмен(ПространствоИмен) Экспорт
	
	Если ВРег(ПространствоИмен) = ВРег("http://www.w3.org/2001/XMLSchema-instance") Тогда
		Возврат "xsi";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://www.w3.org/2001/XMLSchema") Тогда
		Возврат "xs";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActInventoryABInfo")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActInventoryF1F2Info") Тогда
		Возврат "iab";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ProductRef")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ProductRef_v2") Тогда
		Возврат "pref";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ClientRef")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ClientRef_v2") Тогда
		Возврат "oref";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/WB_DOC_SINGLE_01") Тогда
		Возврат "ns";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActTTNSingle")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActTTNSingle_v2")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActTTNSingle_v3")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActTTNSingle_v4") Тогда
		Возврат "wa";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActChargeOn")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActChargeOn_v2")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActChargeOnShop_v2") Тогда
		Возврат "ainp";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOff")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOff_v2")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOff_v3")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOff_v4")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActUnFixBarCode")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActFixBarCode")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOffShop_v2") Тогда
		Возврат "awr";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryParameters")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RequestRepealWB")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RequestRepealACO")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RequestRepealAWO")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/InfoVersionTTN") Тогда
		Возврат "qp";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryFormAB")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryFormF1F2") Тогда
		Возврат "qf";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ConfirmTicket")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ConfirmRepealWB") Тогда
		Возврат "wt";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TTNSingle")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TTNSingle_v2")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TTNSingle_v3")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TTNSingle_v4") Тогда
		Возврат "wb";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TransferToShop") Тогда
		Возврат "tts";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TransferFromShop") Тогда
		Возврат "tfs";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryBarcode") Тогда
		Возврат "bk";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryFilter") Тогда
		Возврат "remove";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/Route") Тогда
		Возврат "mskr";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/CancelRoute") Тогда
		Возврат "crt";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/CommonV3") Тогда
		Возврат "ce";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ChequeV3")
		Или ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ChequeV4") Тогда
		Возврат "ck";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/CommonEnum") Тогда
		Возврат "unqualified_element";
		
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает адрес исходящего запроса для выгрузки документа в УТМ.
// 
// Параметры:
//  ВидДокумента - ПеречислениеСсылка.ВидыДокументовЕГАИС - Вид документа
//  ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаЕГАИС - Формат обмена
// 
// Возвращаемое значение:
//  Неопределено, Строка - Адрес запроса
Функция АдресЗапроса(ВидДокумента, ФорматОбмена) Экспорт
	
	Если ВидДокумента = ЧекККМ
		Или ВидДокумента = ЧекККМОтменаПередачи Тогда
		Если ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4 Тогда
			Возврат "/xml?type=ChequeV4";
		ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3 Тогда
			Возврат "/xml?type=ChequeV3";
		Иначе
			Возврат "/xml";
		КонецЕсли;
	КонецЕсли;
	
	РезультатПоиска = НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена);
	Если РезультатПоиска = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = РезультатПоиска.ТипЕГАИС;
	Если ЗначениеЗаполнено(РезультатПоиска.URLДокумента) Тогда
		Значение = РезультатПоиска.URLДокумента;
	КонецЕсли;
	
	Возврат "opt/in/" + Значение;
	
КонецФункции

// Возвращает пространство имен для документа ЕГАИС.
// 
// Параметры:
//  ВидДокумента - ПеречислениеСсылка.ВидыДокументовЕГАИС - Вид документа
//  ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаЕГАИС - Формат обмена
// 
// Возвращаемое значение:
//  Неопределено, Строка - Пространство имен
Функция ПространствоИмен(ВидДокумента, ФорматОбмена) Экспорт
	
	Если ВидДокумента = ЧекККМ
		Или ВидДокумента = ЧекККМОтменаПередачи Тогда
		Если ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4 Тогда
			Возврат "http://fsrar.ru/WEGAIS/ChequeV4";
		ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3 Тогда
			Возврат "http://fsrar.ru/WEGAIS/ChequeV3";
		Иначе
			Возврат "egaischeque.joint.2";
		КонецЕсли;
	КонецЕсли;
	
	РезультатПоиска = НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена);
	Если РезультатПоиска = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = РезультатПоиска.ТипЕГАИС;
	Если ЗначениеЗаполнено(РезультатПоиска.ПространствоИмен) Тогда
		Значение = РезультатПоиска.ПространствоИмен;
	КонецЕсли;
	
	Возврат "http://fsrar.ru/WEGAIS/" + Значение;
	
КонецФункции

// Возвращает пространство имен для документа ЕГАИС.
// 
// Параметры:
//  ВидДокумента - ПеречислениеСсылка.ВидыДокументовЕГАИС - Вид документа
//  ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаЕГАИС - Формат обмена
// 
// Возвращаемое значение:
//  Неопределено, Строка - Тип ЕГАИС
Функция ТипЕГАИС(ВидДокумента, ФорматОбмена) Экспорт
	
	Если ВидДокумента = ЧекККМ
		Или ВидДокумента = ЧекККМОтменаПередачи Тогда
		Если ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4 Тогда
			Возврат "ChequeV4";
		ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3 Тогда
			Возврат "ChequeV3";
		Иначе
			Возврат "Cheque";
		КонецЕсли;
	КонецЕсли;
	
	РезультатПоиска = НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена);
	Если РезультатПоиска = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = РезультатПоиска.ТипЕГАИС;
	
	Возврат Значение;
	
КонецФункции

// Возвращает вид документа и версию формата обмена по строковому типу ЕГАИС.
// 
// Параметры:
//  ТипЕГАИС - Строка - Тип ЕГАИС.
//  ТаблицаСоответствияДокументовТипамЕГАИС - ТаблицаЗначений -См. функцию ТаблицаСоответствияДокументовТипамЕГАИС().
// 
// Возвращаемое значение:
//  Структура - Данные документа по типу ЕГАИС:
// * ВидДокументаЕГАИС  - ПеречислениеСсылка.ВидыДокументовЕГАИС - вид документа ЕГАИС
// * ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаЕГАИС - версия формата обмена объекта
Функция ДанныеДокументаПоТипуЕГАИС(ТипЕГАИС, ТаблицаСоответствияДокументовТипамЕГАИС = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ВидДокументаЕГАИС", ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("ФорматОбмена", Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка());
	
	РезультатПоиска = Неопределено;
	
	Если ТаблицаСоответствияДокументовТипамЕГАИС = Неопределено Тогда
		ТаблицаСоответствия = ТаблицаСоответствияДокументовТипамЕГАИС();
	Иначе
		ТаблицаСоответствия = ТаблицаСоответствияДокументовТипамЕГАИС;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаСоответствия Цикл
		Если ВРег(СтрокаТЧ.ТипЕГАИС) = ВРег(ТипЕГАИС) Тогда
			РезультатПоиска = СтрокаТЧ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РезультатПоиска <> Неопределено Тогда
		ВозвращаемоеЗначение.ВидДокументаЕГАИС = РезультатПоиска.ВидДокументаЕГАИС;
		ВозвращаемоеЗначение.ФорматОбмена      = РезультатПоиска.ФорматОбмена;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредыдущаяВерсияФорматаОбмена(ФорматОбмена)
	
	Если ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4 Тогда
		Возврат Перечисления.ФорматыОбменаЕГАИС.V3;
	ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3 Тогда
		Возврат Перечисления.ФорматыОбменаЕГАИС.V2;
	ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2 Тогда
		Возврат Перечисления.ФорматыОбменаЕГАИС.V1;
	ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1 Тогда
		Возврат Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена)
	
	ТаблицаСоответствия = ТаблицаСоответствияДокументовТипамЕГАИС();
	
	ТекущийФорматОбмена = ФорматОбмена;
	
	Пока Истина Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидДокументаЕГАИС", ВидДокумента);
		ПараметрыОтбора.Вставить("ФорматОбмена",      ТекущийФорматОбмена);
		
		РезультатПоиска = ТаблицаСоответствия.НайтиСтроки(ПараметрыОтбора);
		
		Если РезультатПоиска.Количество() <> 0 Тогда
			Возврат РезультатПоиска[0];
		Иначе
			ТекущийФорматОбмена = ПредыдущаяВерсияФорматаОбмена(ТекущийФорматОбмена);
		КонецЕсли;
		
		Если ТекущийФорматОбмена = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Возвращает таблицу соответствия вида документа и версии формата строковому типу ЕГАИС.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -- Таблица с колонками::
// * ТипЕГАИС - Строка - Строковый тип ЕГАИС.
// * ВидДокументаЕГАИС - ПеречислениеСсылка.ВидыДокументовЕГАИС - Операция.
// * ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаЕГАИС - Формат обмена.
Функция ТаблицаСоответствияДокументовТипамЕГАИС() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТипЕГАИС",          Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("URLДокумента",      Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ПространствоИмен",  Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ВидДокументаЕГАИС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДокументовЕГАИС"));
	Таблица.Колонки.Добавить("ФорматОбмена",      Новый ОписаниеТипов("ПеречислениеСсылка.ФорматыОбменаЕГАИС"));
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТН;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	
	// Производные типы WayBillAct
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНОтказ;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНПодтверждение;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНРасхождения;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	// Производные типы WayBillAct
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v2";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТН;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	
	// Производные типы WayBillAct_v2
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v2";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНОтказ;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v2";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНПодтверждение;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v2";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНРасхождения;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	// Производные типы WayBillAct_v2
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v3";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТН;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	
	// Производные типы WayBillAct_v3
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v3";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНОтказ;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v3";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНПодтверждение;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v3";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНРасхождения;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	// Производные типы WayBillAct_v3
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v4";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТН;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v4";
	
	// Производные типы WayBillAct_v4
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v4";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНОтказ;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v4";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v4";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНПодтверждение;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v4";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBillAct_v4";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = АктТТНРасхождения;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v4";
	// Производные типы WayBillAct_v3
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActChargeOn";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = АктПостановкиНаБалансВРегистр1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActChargeOn_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктПостановкиНаБалансВРегистр1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActChargeOnShop_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктПостановкиНаБалансВРегистр2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActFixBarCode";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = АктПостановкиНаБалансВРегистр3;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActWriteOff";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = АктСписанияИзРегистра1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActWriteOff_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктСписанияИзРегистра1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActWriteOff_v3";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = АктСписанияИзРегистра1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActWriteOff_v4";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = АктСписанияИзРегистра1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActWriteOffShop_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = АктСписанияИзРегистра2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActUnFixBarCode";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = АктСписанияИзРегистра3;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "TransferFromShop";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ВозвратИзРегистра2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RequestRepealACO";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RequestRepealAWO";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросНаОтменуПроведенияАктаСписания;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RequestRepealWB";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросНаОтменуПроведенияТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ConfirmRepealWB";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = КвитанцияЗапросаНаОтменуПроведенияТТН;
	
	// Производные типы ConfirmRepealWB
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ConfirmRepealWB";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = КвитанцияЗапросаНаОтменуПроведенияТТНОтказ;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ConfirmRepealWB";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение;
	// Производные типы ConfirmRepealWB
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryAP";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросАлкогольнойПродукции;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryAP_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросАлкогольнойПродукции;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryClients";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросДанныхОрганизации;
	НоваяСтрока.URLДокумента      = "QueryPartner";
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryClients_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросДанныхОрганизации;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRests";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОстатковВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRests_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОстатковВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRests_v3";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОстатковВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRestsShop_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОстатковВРегистре2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryFormA";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросСправки1;
	НоваяСтрока.ПространствоИмен  = "QueryFormAB";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryFormF1";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросСправки1;
	НоваяСтрока.ПространствоИмен  = "QueryFormF1F2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryFormB";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросСправки2;
	НоваяСтрока.ПространствоИмен  = "QueryFormAB";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryFormF2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросСправки2;
	НоваяСтрока.ПространствоИмен  = "QueryFormF1F2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryResendDoc";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросТТН;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "InfoVersionTTN";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = ИнформацияОФорматеОбмена;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "Ticket";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Квитанция;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyAP";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросАлкогольнойПродукции;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyAP_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросАлкогольнойПродукции;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyClient";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросДанныхОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyClient_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросДанныхОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRests";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОстатковВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRests_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОстатковВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRests_v3";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОстатковВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRestsShop_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОстатковВРегистре2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRestsShop_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОстатковВРегистре2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "TransferToShop";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ПередачаВРегистр2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ConfirmTicket";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = КвитанцияАктаРасхождений;
	
	// Производные типы ConfirmTicket
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ConfirmTicket";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = КвитанцияАктаРасхожденийОтказ;
	НоваяСтрока.URLДокумента = "WayBillTicket";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ConfirmTicket";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = КвитанцияАктаРасхожденийПодтверждение;
	НоваяСтрока.URLДокумента = "WayBillTicket";
	// Производные типы ConfirmTicket
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "TTNInformBReg";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = УведомлениеОРегистрацииДвиженияТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "TTNInformF2Reg";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = УведомлениеОРегистрацииДвиженияТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActInventoryInformBReg";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ActInventoryInformF2Reg";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyFormA";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросСправки1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyForm1";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросСправки1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyFormB";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросСправки2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyForm2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросСправки2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBill";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ТТН;
	НоваяСтрока.ПространствоИмен  = "TTNSingle";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBill_v2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ТТН;
	НоваяСтрока.ПространствоИмен  = "TTNSingle_v2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBill_v3";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = ТТН;
	НоваяСтрока.ПространствоИмен  = "TTNSingle_v3";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "WayBill_v4";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ТТН;
	НоваяСтрока.ПространствоИмен  = "TTNSingle_v4";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryHistoryRestShop";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаДвиженияМеждуРегистрами;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyHistoryShop";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаДвиженияМеждуРегистрами;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRests_Mini";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаОстаткиВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRests_Mini_v3";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаОстаткиВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRests_Mini";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаОстаткиВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRests_Mini_v3";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаОстаткиВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRestsShop_Mini";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаОстаткиВРегистре2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRestsShop_Mini";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаОстаткиВРегистре2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryWriteOffCheque";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаОбработанныеЧеки;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyWriteOffCheque";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаОбработанныеЧеки;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryNATTN";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаНеобработанныеТТН;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyNoAnswerTTN";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаНеобработанныеТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryClientVersion";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаИнформацияОбОрганизации;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyClientVersion";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаИнформацияОбОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryFormBHistory";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаДвиженияПоСправке2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyHistFormB";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаДвиженияПоСправке2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryForm2History";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаДвиженияПоСправке2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyHistForm2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаДвиженияПоСправке2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryBarcode";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросАкцизныхМарок;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyBarcode";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросАкцизныхМарок;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryParentHistForm2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаИсторияСправок2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyParentHistForm2";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаИсторияСправок2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRestBCode";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросОтчетаОстаткиВРегистре3;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyRestBCode";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросОтчетаОстаткиВРегистре3;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "TTNHistoryF2Reg";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = ИсторияСправок2ПоТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryFilter";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ReplyFilter";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "Route";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ТранспортнаяНакладная;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "CancelRoute";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросНаОтменуПроведенияТранспортнойНакладной;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "ChequeV3";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ЧекККМ;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "InvoicePlannedImport_v1";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = УведомлениеОПланируемомИмпорте;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RequestRepealIPI";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросНаОтменуПроведенияУведомленияОПланируемомИмпорте;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RepImportedProduct_v6";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ОтчетОбИмпорте;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRejectRepImported";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросНаОтменуПроведенияОтчетаОбИмпорте;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RepInformF1Reg";
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RepProducedProduct_v6";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ОтчетОПроизводстве;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RepProducedProduct_v6";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ОтчетОПроизводствеПроизводство;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RepProducedProduct_v6";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ОтчетОПроизводствеПереработка;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "RepProducedProduct_v6";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ОтчетОПроизводствеСырья;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "QueryRejectRepProduced";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = ЗапросНаОтменуПроведенияОтчетаОПроизводстве;
	
	//АСИиУ - только загрузка квитанций
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "Asiiu";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = АСИиУ;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = "AsiiuTime";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = АСИиУ;
	
	Возврат Таблица;
	
КонецФункции

Функция АбстрактныеОперации() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(АктТТН);
	Результат.Добавить(КвитанцияЗапросаНаОтменуПроведенияТТН);
	Результат.Добавить(Квитанция);
	Результат.Добавить(КвитанцияАктаРасхождений);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли