&НаКлиенте
Перем ПропуститьВопросПередЗаписью; // Для отработки записи после вопроса

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ПрослеживаемостьТоваров=УправлениеСвойствами.ЗначениеСвойства(Объект.Организация,"Лико_ПрослеживаемостьТоваров");

	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаявкаНаРемонтРЦ") Тогда 
		Объект.ЗаявкаНаРемонтРЦ=Параметры.ЗаявкаНаРемонтРЦ;
	КонецЕсли;
	
	Если Параметры.Свойство("РабочийЦентр") Тогда 
		Объект.РабочийЦентр=Параметры.РабочийЦентр;
	КонецЕсли;
	

	
	УстановитьУсловноеОформление(); 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ПриЧтенииСозданииНаСервере();
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	СразуНаПринтер=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 	
	
	Если ПрослеживаемостьТоваров Тогда
		Элементы.ТоварыДанныеПоНаработке.Видимость=Истина;
	КонецЕсли;
	
	 УчетПравилПеремещенияТМЦ = Справочники.Лико_ПравилаПеремещенияТМЦ.СтартСистемы(Объект.Дата);

	
КонецПроцедуры



&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//УсловноеОформление.Элементы.Очистить();
	
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма); 
	//НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.Лико_ПередачаТоваров);
	
	
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов);
	
	
	ПересчитатьВесОбъемВСтрокахТЧ();
	//Элементы.ГруппаИнформация.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() 	
	Если Объект.ВозвратНаСклад Тогда
		Элементы.ГруппаНомерЗаказа.Видимость=Ложь;	
		Элементы.ВнутренняяПродажа.Видимость=Ложь;
	Иначе
		Элементы.ГруппаНомерЗаказа.Видимость=Истина;
		Элементы.ВнутренняяПродажа.Видимость=Истина;
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Продажа") 
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку") Тогда
			Элементы.ГруппаПартнер.Видимость=Истина; 
			Элементы.ГруппаПередачаВПроизводство.Видимость = Ложь;
			Элементы.ГруппаПеремещение.Видимость = Ложь;
			
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение") Тогда
			
			Элементы.ГруппаПартнер.Видимость=Ложь; 
			Элементы.ГруппаПередачаВПроизводство.Видимость = Ложь;
			Элементы.ГруппаПеремещение.Видимость = Истина;
		Иначе
			Элементы.ГруппаПартнер.Видимость=Ложь; 
			Элементы.ГруппаПередачаВПроизводство.Видимость = Истина; 
			Элементы.ГруппаПеремещение.Видимость = Ложь;
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
	Если Объект.ДанныеПоНаработке Тогда
		Элементы.ТоварыГруппаНаработки.Видимость=Истина;
		Для каждого Товар Из Объект.Товары Цикл  		
			лДанныеПоНаработке = Лико_Дополнительно.ПолучитьДанныеПоНаработке(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Серия,"ЯССМ_ОбъектНоменклатуры"), ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата-1)); 		
			Товар.НаработкаПредыдущихОпераций = лДанныеПоНаработке.ОбщаяНаработка;
			Товар.ПримечаниеПоПредыдущимНаработкам = лДанныеПоНаработке.Примечание;
			
		КонецЦикла;
		
		
		
	Иначе
		Элементы.ТоварыГруппаНаработки.Видимость=Ложь;
		
	КонецЕсли;
	
		Если ПрослеживаемостьТоваров  Тогда
			Элементы.ГруппаТоварыПрослеживаемостьТоваров.Видимость=Истина;
		Иначе
			Элементы.ГруппаТоварыПрослеживаемостьТоваров.Видимость=Истина;
			
		КонецЕсли;

	
КонецПроцедуры 



&НаСервере
Процедура ПересчитатьВесОбъемВСтрокахТЧ()
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", "");
	
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено); 
		
		Если ПрослеживаемостьТоваров Тогда 
			
			СтрокаТЧ.ПартияПроизводства=СформироватьИмяПартииСервер(СтрокаТЧ.Номенклатура,СтрокаТЧ.Серия,ПрослеживаемостьТоваров);
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Перем ТекущаяСтрока;
	Перем СтруктураДействий;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	Суффикс = "";
	
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу"      , ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	//+m.shenderov 10.07.2017 
	
	Характеристика	=Элементы.Товары.ТекущиеДанные.Характеристика;
	Нарезка			=ПолучитьНарезку(Характеристика);
	Серия			=Элементы.Товары.ТекущиеДанные.Серия;
	Если ЗначениеЗаполнено(Нарезка) Тогда
		Элементы.Товары.ТекущиеДанные.Упаковка=ПолучитьУпаковку(Нарезка);
		КоличествоУпаковокПриИзменении(Элемент);
		
		Если ЗначениеЗаполнено(Серия)и Нарезка<>Серия.ЯССМ_ОбъектНоменклатуры.Нарезка Тогда
			ОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
			ОбъектНоменклатуры.Нарезка=Нарезка;
			ОбъектНоменклатуры.ЕдиницаИзмеренияУУ=Элементы.Товары.ТекущиеДанные.Упаковка;
			ОбъектНоменклатуры.Записать();
			Серия.ПолучитьОбъект.Записать();			
		КонецЕсли;		
	КонецЕсли;	
	//-m.shenderov 10.07.2017	
	
КонецПроцедуры


//+m.shenderov 10.07.2017  
#Область Дополнительно
&НаСервереБезКонтекста
Функция ПолучитьНарезку (Характеристика)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,"ЯССМ_Нарезка")	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУпаковку(Нарезка)
	Возврат	Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка)
	
КонецФункции

&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);		
КонецФункции 

&НаКлиенте
Процедура ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры)
	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	КоличествоЭкземпляров=0;
	
	ТабДокумент=Лико_Дополнительно.ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры,,БыстраяПечать);
	//!ТабДокумент.ИмяПринтера = ИмяПринтера;
	
	//
	//ТабДокумент.АвтоМасштаб = Истина;
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.ПолеСлева = 1;
	//ТабДокумент.ПолеСправа = 0;
	//ТабДокумент.ПолеСнизу = 0;
	//ТабДокумент.ПолеСверху = 1;
	////
	//ТабДокумент.РазмерСтраницы="Custom";//нестандартный размер бумаги
	//ТабДокумент.ВысотаСтраницы=64;
	//ТабДокумент.ШиринаСтраницы=90; 		
	
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ТабДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если БыстраяПечать Тогда
		ТабДокумент.Напечатать();
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;  	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Суффикс = "";
	
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	Товар=Элементы.Товары.ТекущиеДанные;
	Попытка
	Товар.Количество=Товар.КоличествоУпаковок*Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Упаковка,"Числитель");
	
	Исключение
	 Товар.Количество=Товар.КоличествоУпаковок;

	КонецПопытки;
	

КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	
	
	
	ОткрытьПодборСерий("Товары");
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПодборСерий(ИмяТЧ, Текст = "", ТекущиеДанные = Неопределено)
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные) Тогда
		
		
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",ТекущиеДанные.Характеристика);
		Структура.Вставить("Склад",Объект.Склад);
		Структура.Вставить("ТолькоОстатки",Истина);
		
		
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПодборСерийЗавершение(РезультатФорма,ПараметрыФорма) Экспорт 
	
	Если ТипЗнч(РезультатФорма)=Тип("Массив") Тогда
		
		Для каждого Серия Из РезультатФорма  Цикл
			
			СтруктураНоменклатуры=ПолучитьСтруктуруСерии(Серия);
			
			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура",СтруктураНоменклатуры.Номенклатура);
			СтруктураОтбора.Вставить("Характеристика",СтруктураНоменклатуры.Характеристика);
			СтруктураОтбора.Вставить("Серия",ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
			
			СтрокиСПустымиСериями=Объект.Товары.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаСПустйСерией Из СтрокиСПустымиСериями Цикл				
				Объект.Товары.Удалить(Объект.Товары.Индекс(СтрокаСПустйСерией));				
			КонецЦикла;
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 				 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатуры);
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");      
				Действия 			= Новый Структура();
				ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( Действия,"");	
				Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НовыйТовар,Действия,КэшированныеЗначения);			
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер();
		
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер() //+Лико m.shenderov 25.10.2017
	
	//ЗаполнитьСлужебныеРеквизитыТЧТовары();
	
КонецПроцедуры  //-Лико m.shenderov 25.10.2017



&НаСервереБезКонтекста
Функция УчетПоСериям(Товар) //+Лико m.shenderov 25.10.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВидыНоменклатуры.Ссылка = Номенклатура.ВидНоменклатуры
	|ГДЕ
	|	Номенклатура.Ссылка = &Товар
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыНоменклатуры.ИспользоватьСерии";
	Запрос.УстановитьПараметр("Товар",Товар );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИспользоватьСерии;
	КонецЦикла; 
	
	Возврат Ложь;
	
	
КонецФункции  //-Лико m.shenderov 25.10.2017



&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(ИмяТЧ, Текст, ТекущиеДанные)
	// Вставить содержимое метода.
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий[ИмяТЧ],Текст, ТекущиеДанные)
		и Лико_ОбщегоНазначенияСервер.ЕстьОбъектНоменклатуры(ТекущиеДанные.Номенклатура,ТекущиеДанные.Характеристика) Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",ТекущиеДанные.Характеристика);
		Структура.Вставить("Склад",Объект.Склад);
		Структура.Вставить("ТолькоОстатки",Истина);
		
		
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;	 
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ОткрытьПодборСерийЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 28.09.2017
	
	Если РезультатФормы<>Неопределено Тогда
		Счет=0;
		Для каждого Результат Из РезультатФормы Цикл
			Счет=Счет+1;
			Если Счет=1 И  ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Серия) Тогда
				Счет=2;
			КонецЕсли;
			
			Если Счет>1 Тогда 	
				Отбор= Новый Структура;
				Отбор.Вставить("Серия",Результат.Серия);
				НайденныеСтроки=Объект.Товары.НайтиСтроки(Отбор); 
				Если  НайденныеСтроки.Количество()>0 Тогда
					Элементы.Товары.ТекущаяСтрока=Объект.Товары.Индекс(НайденныеСтроки[0]);
					Для каждого Стр Из НайденныеСтроки Цикл
						
					КонецЦикла;
				Иначе
					Элементы.Товары.СкопироватьСтроку();
				КонецЕсли;
				
			КонецЕсли; 			
			ТекСтрока				=Элементы.Товары.ТекущиеДанные;			
			ТекСтрока.Серия			=Результат.Серия;
			Данныесерии				=ПолучитьДанныеПоСерии(Результат.Серия);
			ТекСтрока.Упаковка		=ДанныеСерии.Упаковка;
			ТекСтрока.АдресХранения	=Результат.АдресХранения;
			ТекСтрока.КоличествоУпаковок=Результат.Количество; 	
			Действия 			= Новый Структура();
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( Действия,"");	
			Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекСтрока,Действия,КэшированныеЗначения);						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 28.09.2017



&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор, ИмяТЧ)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(Объект, ПараметрыУказанияСерий, ТекущиеДанныеИдентификатор, ЭтаФорма);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоСерии(Серия) //+Лико m.shenderov 28.09.2017
	
	//Серия=Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Структура = Новый Структура;
	Структура.Вставить("Количество",Серия.ЯССМ_ОбъектНоменклатуры.Количество);
	Структура.Вставить("Упаковка",Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);	
	Возврат Структура; 
	
	
КонецФункции  //-Лико m.shenderov 28.09.2017


&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СкладПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер () //+Лико m.shenderov 10.10.2017
	
	ПриЧтенииСозданииНаСервере();		
	ЗаполнитьСтатусыУказанияСерий();
КонецПроцедуры  //-Лико m.shenderov 10.10.2017

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерий() //+Лико m.shenderov 10.10.2017
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	
КонецПроцедуры  //-Лико m.shenderov 10.10.2017





&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии210126(Отказ)
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор) и Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ОчиститьСообщения(); 	
		//ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","Лико_ЗаявкаНаСклад");
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		Отказ=Истина;
	КонецЕсли; 
	
	Если ЗаполнениеСотрудникаВЗаявкеСервер() Тогда
		Объект.Сотрудник=Объект.АвторДокумента;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		//Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		//	Сообщить("Не выполнена авторизация!");
		//	Отказ=Истина;
		//КонецЕсли;
		Объект.АвторДокумента=ГлЛико_Оператор;
	КонецЕсли;
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	Если  Объект.Проведен Тогда
	Элементы.Комментарий2.Видимость=Истина;
	Комментарий=Объект.Комментарий;
	Элементы.Комментарий1.Видимость=Ложь;
	ТолькоПросмотр=Истина;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		Если Не ЗначениеЗаполнено(ГлЛико_Оператор) и Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ОчиститьСообщения(); 	
		//ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","Лико_ЗаявкаНаСклад");
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		Отказ=Истина;
	КонецЕсли; 
	
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		//Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		//	Сообщить("Не выполнена авторизация!");
		//	Отказ=Истина;
		//КонецЕсли;
		Объект.АвторДокумента=ГлЛико_Оператор;
		Если ЗаполнениеСотрудникаВЗаявкеСервер() Тогда
		Объект.Сотрудник=Объект.АвторДокумента;
	КонецЕсли;

	КонецЕсли;
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	Если  Объект.Проведен Тогда
	Элементы.Комментарий2.Видимость=Истина;
	Комментарий=Объект.Комментарий;
	Элементы.Комментарий1.Видимость=Ложь;
	ТолькоПросмотр=Истина;
	КонецЕсли;
	УстановитьВидимость();

КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	//Объект.Отправитель=Неопределено;
	//Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
	//	ПометитьНаУдалениеРаспоряжение(Объект.Распоряжение);	
	//	Объект.Распоряжение=Неопределено;	
	//КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	УстановитьУсловноеОформление();
	ПриЧтенииСозданииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
	УстановитьВидимость();
	
	Если (Объект.Проведен Или Объект.ПометкаУдаления) и Не НеПечататьзаявку Тогда
		ПечатьЗаявки();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьЗаявки() //+Лико m.shenderov 02.03.2018
	
	ВыполняемаяОбработка=НайтиПФ("Печатная форма документа ""Заявка на склад""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="Лико_ЗаявкаНаСкладСИМ";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
	
КонецПроцедуры //-Лико m.shenderov 02.03.2018


&НаСервереБезКонтекста
Функция НайтиПФ(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции




Процедура ПометитьНаУдалениеРаспоряжение(Ссылка) //+Лико m.shenderov 16.10.2017
	
	ОбъектСсылка=Ссылка.получитьОбъект();
	ОбъектСсылка.ПометкаУдаления=Истина;
	ОбъектСсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //-Лико m.shenderov 16.10.2017

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Паллета") Тогда
			//Это паллет
		ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			Объект.Сотрудник = Результат.Сотрудник;
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			Объект.НомерБланка=Результат.НомерБланка;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа); 			
			
			
			
		ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//Это ячейка
			//Элементы.Товары.ТекущиеДанные. = Результат.АдресаХранения;
			//
			//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
		Иначе
			ОбработатьШтрихкодыТиповой(ДанныеШтрихкода);
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкодыТиповой(ДанныеШтрихкодов)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул")); 	
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПересчитатьВесОбъем");
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( СтруктураДействийСДобавленнымиСтроками,"");
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	СтруктураДействийСИзмененнымиСтроками.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьВесОбъем");
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСИзмененнымиСтроками,"");
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = Новый Структура;
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ПересчитатьВесОбъем");
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий;
	СтруктураДействий.ТолькоТовары                           = Истина;
	
	
	СтруктураДействий.ДействияСНеизвестнымиШтрихкодами       = "НетДействий";
	СтруктураДействий.СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = СтруктураДействийСоСтрокамиИзУпаковочныхЛистов;
	
	
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
		
	КонецЕсли;
	
	Элементы.Товары.ТекущиеДанные.АдресХранения=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерии(Элементы.Товары.ТекущиеДанные.Серия,Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураДействий,КэшированныеЗначения);
	
	СтруктураДействийСТекущейСтрокой = Новый Структура;
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	//СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока);
	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействийСТекущейСтрокой, КэшированныеЗначения);
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	//+m.shenderov 11.07.2017
	ПечатьЭтикеток=Ложь ;	
	ОчиститьСообщения();  	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрано ни одного товара.'");
		
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	Для каждого Стр Из ВыделенныеСтроки Цикл
		Товар= Объект.Товары.НайтиПоИдентификатору(Стр);
		ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Серия,"ЯССМ_ОбъектНоменклатуры");
		
		Если ОбъектНоменклатуры=Неопределено Тогда
			ОбъектНоменклатуры=Лико_ОбщегоНазначенияСервер.ПолучитьОбъектНоменклатуры(Товар.Номенклатура);
		КонецЕсли;
		
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры); 
		ПечатьЭтикеток=Истина;
	КонецЦикла;	
	Если ПечатьЭтикеток Тогда
		Возврат;
	КонецЕсли;
	//-m.shenderov 11.07.2017
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю1(Команда)
	Объект.ЧленКомиссии1=ГлЛико_Оператор;
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю2(Команда)
	Объект.ЧленКомиссии2=ГлЛико_Оператор;
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю3(Команда)
	Объект.ЧленКомиссии3=ГлЛико_Оператор;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПодборФорм(Команда)
	Структура = Новый Структура;
	Структура.Вставить("РабочийЦентр",Объект.Отправитель);
	ОписаниеОповещения= Новый ОписаниеОповещения("ПодборФормЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_Формы.Форма.ФормаПодбора",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ПодборФормЗавершение(РезультатФормы,ПараметрыФормы) Экспорт  
	Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
		Для каждого Форма Из РезультатФормы.Массив Цикл
			Если Объект.Формы.НайтиСтроки(Новый Структура("Форма",Форма)).количество()=0 Тогда
				НоваяФорма=Объект.Формы.Добавить();
				НоваяФорма.Форма=Форма;
				НоваяФорма.Конверт=РезультатФормы.Соответствие[Форма];
			КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ДанныеПоНаработке(Команда)
	Объект.ДанныеПоНаработке = Не Объект.ДанныеПоНаработке;
	
	УстановитьВидимость();
	
КонецПроцедуры



&НаКлиенте
Процедура ПечатьСтикераДокумента1(Команда)
	ПечатьСтикераДокумента();
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСтикераДокумента(БыстраяПечать=Истина)  	
	ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСтикераДокумента(Объект.Ссылка);	
	
	Если ПечатьСразуНаПринтер() Тогда
		ТабДокумент.Напечатать(БыстраяПечать);
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция ПечатьСразуНаПринтер() //+Лико m.shenderov 19.10.2017
	Возврат	Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
КонецФункции  //-Лико m.shenderov 19.10.2017


&НаКлиенте
Процедура ПечатьСкладскойКарточки(Команда)
	
	Если Не Объект.Проведен Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Распечатать карточку складской операции можно только после проведения документа!", СтатусСообщения.Важное, Ложь);
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("ДатаВремя", Объект.Дата);
	Данные.Вставить("Номер", Объект.Номер);
	Данные.Вставить("ВидОперации", Объект.ВидОперации);
	Данные.Вставить("НомерЗаказа", Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента,"Номер"),7));
	Данные.Вставить("Сотрудник", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.Сотрудник)));
	Данные.Вставить("Получатель", Объект.АдресХранения);
	Данные.Вставить("АвторДокумента", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.АвторДокумента)));
	
	//Если Товары.Количество()>3 Тогда
	//	Если Вопрос("Будет распечатано "+Товары.Количество()+" карточек складских операций. Вы уверены, что хотите распечатать все эти карточки?", РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, "Внимание!")=КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	КоличествоКопий = 1;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		Данные.Вставить("КоличествоЕдиницаИзмерения", "" + СтрокаТовары.Количество + " " + СтрокаТовары.Упаковка);
		Данные.Вставить("ОбъектНоменклатуры", СтрокаТовары.Серия);
		Данные.Вставить("Дополнительное", "");
		
		// переопределим адрес хранения для ролика
		Данные.Вставить("Получатель", СтрокаТовары.АдресХранения);
		
		
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСкладскойОперации(Данные, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		Если СразуНаПринтер() Тогда
			ТабДокумент.Напечатать(СразуНаПринтер());
		Иначе
			ТабДокумент.Показать();
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если Объект.Формы.Количество()>0 Тогда
		
		ВремФормы = Объект.Формы.Выгрузить();
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ФормыПечатьСкладскойОперации(ВремФормы, Данные, Ложь, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		Если СразуНаПринтер() Тогда
			ТабДокумент.Напечатать(СразуНаПринтер());
		Иначе
			ТабДокумент.Показать();
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СразуНапринтер() //+Лико m.shenderov 22.10.2017
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	
КонецФункции  //-Лико m.shenderov 22.10.2017


&НаКлиенте
Процедура ЗаказКлиенткаПриИзменении(Элемент)
	Попытка
		Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента,"Номер"),7));
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеЗаказаКлиента(Форма,Объект,
	ИмяПоляВводаЗаказаКлиента = "ЗаказКлиента",
	ПутьКПолюОтбора = "Объект.ЗаказКлиента") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЗаказаКлиента].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Проведен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	НЗаказа=Прав(Объект.ЗаказКлиента.Номер,7);
	
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст","111" );
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Склад",Объект.Склад);	
	Структура.Вставить("Период",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	Структура.Вставить("ТолькоОстатки",Истина);
	//Если Объект.ВозвратНаСклад Тогда
	//Структура.Вставить("Помещение");	
	//КонецЕсли;
	
	
	Если Не Структура.Свойство("Помещение") Тогда
		Если Объект.ВозвратНаСклад Тогда
			Помещение=ПолучитьПомещение("ПомещениеПроизводство");
		Иначе
			Помещение=ПолучитьПомещение("ПомещениеСИМ");
		КонецЕсли;
		Структура.Вставить("Помещение",Помещение);
	КонецЕсли;
	
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПомещение(Помещение)	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство(Помещение,Неопределено);
КонецФункции  


&НаКлиенте
Процедура ПодборНоменклатурыЗавершение241220(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 25.10.2017
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		
		Для каждого Товар Из РезультатФормы  Цикл
			ТекущаяСтрока = Товар;
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
			
			// Если  ЗначениеЗаполнено(Товар.Серия) Тогда
			//    
			// СтруктураСерии= ПолучитьСтруктуруСерии(Товар.Серия);
			// 
			// 
			//КонецЕсли;
			
			
			СтруктураНоменклатуры = Новый Структура;
			СтруктураНоменклатуры.Вставить("Номенклатура");
			СтруктураНоменклатуры.Вставить("Характеристика");
			СтруктураНоменклатуры.Вставить("Серия");
			
			ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 			 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
				
				НовыйТовар.АдресХранения=Товар.Ячейка;
				
				
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");  
				
				НовыйТовар.Количество=НовыйТовар.КоличествоУпаковок*Товар.Упаковка.Числитель;
				
				
				
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ПослеЗаписиНаСервере();
		
		
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 25.10.2017
&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы, ПараметрыФормы)Экспорт 
	// Вставить содержимое метода.
	
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		
		Для каждого Товар Из РезультатФормы  Цикл
			ТекущаяСтрока = Товар;
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
			
			// Если  ЗначениеЗаполнено(Товар.Серия) Тогда
			//    
			// СтруктураСерии= ПолучитьСтруктуруСерии(Товар.Серия);
			// 
			// 
			//КонецЕсли;
			
			
			СтруктураНоменклатуры = Новый Структура;
			СтруктураНоменклатуры.Вставить("Номенклатура");
			СтруктураНоменклатуры.Вставить("Характеристика");
			СтруктураНоменклатуры.Вставить("Серия");
			
			ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 			 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
				
				НовыйТовар.АдресХранения=Товар.Ячейка;
				
				
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");  
				
				Если Не Товар.Уникальный   Тогда
					
					НовыйТовар.Количество=НовыйТовар.КоличествоУпаковок*Товар.Коэффициент;
				
				КонецЕсли;
				
				
			//	
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ПослеЗаписиНаСервере();
		
		
		
		
	КонецЕсли;
	
	
	

	
	
	
	//ПродолжитьВызов(РезультатФормы, ПараметрыФормы);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСерии(Серия) //+Лико m.shenderov 24.10.2017
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Неопределено);
	Структура.Вставить("Характеристика",Неопределено);
	Структура.Вставить("КоличествоУпаковок",Неопределено);
	Структура.Вставить("Серия",Неопределено);
	Структура.Вставить("Упаковка",Неопределено);
	Структура.Вставить("Количество",Неопределено); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|	СерииНоменклатуры.Ссылка КАК Серия,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Характеристика КАК Характеристика,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество КАК КоличествоУпаковок,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество * СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК Количество
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Ссылка = &Серия";
	Запрос.УстановитьПараметр("Серия",Серия );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.10.2017



&НаСервереБезКонтекста
Функция ПолучитьЗаказКлиентаПоНомеру(НомерЗаказа) //+Лико m.shenderov 30.11.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерБезПрефикса = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомерЗаказа );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
	
	
КонецФункции  //-Лико m.shenderov 30.11.2017


&НаСервереБезКонтекста
Функция СотрудникАвтоПодборНаСервере(Текст)
	
	СписокЗначений= Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Код ПОДОБНО &Код
	|	И Сотрудники.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Код","%"+Текст+"%" );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Ссылка);
		
	КонецЦикла; 
	Возврат СписокЗначений;	
КонецФункции


&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Попытка
		Код=Число(Текст);
		СтандартнаяОбработка=Ложь;
		ДанныеВыбора=СотрудникАвтоПодборНаСервере(Текст);
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьЗаявкуЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Отменить заявку?",РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры	 
//Вынести в отдельную процедуру
&НаКлиенте
Процедура ОтменитьЗаявкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ПометкаУдаления=Истина;
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));		
	КонецЕсли;
	


КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элементы.Товары.ТекущиеДанные;
	
		
	
    Если Поле.Имя="ТоварыПартияПроизводства" Тогда
		Структура=ЗаполнитьСтруктуруДляПартииПроизводстваСервер(ТД.Серия);
		
		Если ЗначениеЗаполнено(Структура) Тогда
			ОписаниеОповещения= Новый ОписаниеОповещения("ТоварыПартияПроизводстваЗавершение",ЭтаФорма);
			ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлементаПрослеживаемость",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;  
		Возврат
	КонецЕсли;

	
	Лико_СкладыКлиент.ПоказатьФормуОбъектаНоменклатуры(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка,"ТоварыСерияИмяКороткое");

КонецПроцедуры

&НаКлиенте
Процедура Комментарий2ПриИзменении(Элемент)
	НеПечататьзаявку=Истина;
	Объект.Комментарий=Комментарий;
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));	

КонецПроцедуры

&НаКлиенте
Процедура ВозвратНаСкладПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры



&НаСервереБезКонтекста
Функция ЗаполнениеСотрудникаВЗаявкеСервер() //+Лико m.shenderov 21.10.2018

	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ЗаполнениеСотрудникаВЗаявке",Ложь);
	
КонецФункции  //-Лико m.shenderov 21.10.2018


&НаКлиенте
Процедура ТоварыПартияПроизводстваЗавершение(Результат,Параметры)Экспорт  //+Лико m.shenderov 27.03.2023
	
	ТД=Элементы.Товары.ТекущиеДанные;
	
	ТД.ПартияПроизводства=СформироватьИмяПартииСервер(Тд.Номенклатура,Тд.Серия,ПрослеживаемостьТоваров);
	
КонецПроцедуры //-Лико m.shenderov 27.03.2023

&НаСервереБезКонтекста
Функция СформироватьИмяПартииСервер(Номенклатура,Серия,ПрослеживаемостьТоваров) //+Лико m.shenderov 27.03.2023
		Возврат  Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.СформироватьИмяПартии(Номенклатура,Серия,ПрослеживаемостьТоваров);	
КонецФункции  //-Лико m.shenderov 27.03.2023

&НаСервереБезКонтекста
Функция ЗаполнитьСтруктуруДляПартииПроизводстваСервер(Серия) //+Лико m.shenderov 27.03.2023
	
	Если ЗначениеЗаполнено(Серия) Тогда
		
		ОН=Серия.ЯССМ_ОбъектНоменклатуры;
		
		Если ОН.Уникальный И ОН.Номенклатура.Лико_КонтрольПартииПроизводстваТовара  Тогда 
			
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Он);
			
		 Возврат Структура;
		
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецФункции  //-Лико m.shenderov 27.03.2023


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.НеИспользоватьПравило Тогда
		Возврат;	
	КонецЕсли;
	
	
	Если  УчетПравилПеремещенияТМЦ Тогда
		
		Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение  
			И Не ПараметрыЗаписи.Свойство("ПроверкаПравилПеремещенияТМЦПередЗаписью") Тогда
			
		
		Ответ = ПроверитьФИФОЛИФО(Отказ,ПараметрыЗаписи.РежимЗаписи);
		
		Если ТипЗнч(Ответ)=Тип("Массив") И  Ответ.Количество()>0 Тогда
			
			Текст ="";
			Для каждого Комментарий Из Ответ Цикл
				Текст = Текст+?(ЗначениеЗаполнено(Текст),"|"+Комментарий,Комментарий);
				Сообщить(Комментарий);
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Текст) Тогда
				
				Текст=Текст+"
				| Продолжить?";
					
					Режим = РежимДиалогаВопрос.ДаНет;
					Оповещение = Новый ОписаниеОповещения("ПроверкаПравилПеремещенияТМЦПередЗаписью", ЭтотОбъект, Новый Структура("Отказ,ПроверкаПравилПеремещенияТМЦПередЗаписью",Отказ,Ложь));
					ПоказатьВопрос(Оповещение, Текст, Режим, 0); 
					Отказ=Истина;
					Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
		
	Иначе

	
	
	// <-- Начало Лико Яцун С. В. 14.10.2025 
	НарушинПринципФИФО = Новый Структура("Вопрос,Письмо","","");
	Если НЕ ПараметрыЗаписи.Свойство("ПровестиПослеПроверкиФИФО") Тогда
		НарушинПринципФИФО = ПроверитьФИФО(Отказ,ПараметрыЗаписи.РежимЗаписи);
	КонецЕсли;
	Если НарушинПринципФИФО.Вопрос <> "" Тогда
		Вопрос = НарушинПринципФИФО.Вопрос + Символы.ПС + Символы.ПС + "Записать заявку?";
		ТекстПисьма = НарушинПринципФИФО.Письмо;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросФИФО", ЭтотОбъект,Новый Структура("ПараметрыЗаписи,ТекстПисьма",ПараметрыЗаписи,ТекстПисьма)), 
		Вопрос,
		РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 14.10.2025 
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьФИФО(Отказ,РежимЗаписи) // <-- Начало Лико Яцун С. В. 14.10.2025

	ТзТоварыСтарые =   Объект.Ссылка.Товары.Выгрузить(,"Серия");
	ТзТоварыНовые  = Объект.Товары.Выгрузить(,"Серия");
	
	ТзТоварыСтарые.Свернуть("Серия");
	ТзТоварыНовые.Свернуть("Серия");
	
	ЕстьИзмененияТоваров = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТзТоварыСтарые,ТзТоварыНовые);

	Вопрос = "";
	Письмо = "";
	
	Если ЕстьИзмененияТоваров 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ Отказ 
		И Объект.Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
		ТЗ = Объект.Товары.Выгрузить(); 
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
		ТЗ.Колонки.Добавить("ДатаФормирования",Новый ОписаниеТипов("Дата", , ,КвалификаторыДаты));	
		Для каждого СтрТЗ Из ТЗ Цикл
			СтрТЗ.ДатаФормирования = СтрТЗ.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования;
		КонецЦикла;
		ТЗ.Сортировать("ДатаФормирования Убыв");
		МассивСерийЗаявки = ТЗ.ВыгрузитьКолонку("Серия");
		МассивПодобранныхСерий = Новый Массив;
		Для каждого Стр Из ТЗ Цикл
			Если Стр.АдресХранения.Лико_Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра
				И Стр.АдресХранения.Владелец.Лико_Площадка = Справочники.Лико_Площадки.Ликофлекс
				И НЕ Стр.АдресХранения.Лико_ПомещениеБрака
				И ЗначениеЗаполнено(Стр.Серия) 
				И (Стр.Номенклатура.ВидНоменклатуры.Наименование = "Краска" И Стр.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный ИЛИ Стр.Номенклатура.ЦеноваяГруппа.Лико_ВидТМЦ = Справочники.Лико_ВидыТМЦ.Чернила) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования КАК ДатаФормирования,
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки КАК НомерПоставки,
				|	ТоварыВЯчейкахОстатки.Серия КАК Серия
				|ПОМЕСТИТЬ ВТСерии
				|ИЗ
				|	РегистрНакопления.ТоварыВЯчейках.Остатки(
				|			&ДатаОстатков,
				|			Номенклатура = &Номенклатура
				|				И НАЧАЛОПЕРИОДА(Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ДатаФормированияТМЦ, ДЕНЬ)
				|				И НЕ Серия В (&МассивСерийЗаявки)
				|				И НЕ Серия В (&МассивПодобранныхСерий)
				|				И НЕ Ячейка.Лико_ПомещениеБрака
				|				И ВЫБОР
				|					КОГДА &УдаленныйСклад
				|							ИЛИ &ОтветХранение
				|						ТОГДА Ячейка.Помещение = &Помещение
				|					ИНАЧЕ Ячейка.Лико_ТипСклада = &ТипСклада
				|							И Ячейка.Лико_Организация = &Организация
				|							И Ячейка.Владелец = &Склад
				|							И НЕ Ячейка.Лико_ОтветственноеХранение
				|							И НЕ Ячейка.Лико_УдаленныйСклад
				|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования,
				|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки,
				|	ТоварыВЯчейкахОстатки.Серия
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДатаФормирования
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТСерии.ДатаФормирования КАК ДатаФормирования,
				|	ВТСерии.НомерПоставки КАК НомерПоставки,
				|	ВТСерии.Серия КАК Серия
				|ИЗ
				|	ВТСерии КАК ВТСерии
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ЗаявкаНаСклад.Товары КАК Лико_ЗаявкаНаСкладТовары
				|		ПО ВТСерии.Серия = Лико_ЗаявкаНаСкладТовары.Серия
				|			И (Лико_ЗаявкаНаСкладТовары.Ссылка <> &Ссылка)
				|			И (Лико_ЗаявкаНаСкладТовары.Ссылка.Проведен)
				|			И (Лико_ЗаявкаНаСкладТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусЗаявокНаСклад.ВОбработке)
				|				ИЛИ Лико_ЗаявкаНаСкладТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусЗаявокНаСклад.Подготовлен))
				|ГДЕ
				|	Лико_ЗаявкаНаСкладТовары.Серия ЕСТЬ NULL";
				
				Запрос.УстановитьПараметр("ДатаОстатков", ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
				Запрос.УстановитьПараметр("ДатаФормированияТМЦ", Стр.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования);
				Запрос.УстановитьПараметр("МассивСерийЗаявки", МассивСерийЗаявки);
				Запрос.УстановитьПараметр("МассивПодобранныхСерий", МассивПодобранныхСерий);
				Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
				Запрос.УстановитьПараметр("Помещение", Стр.АдресХранения.Помещение);
				Запрос.УстановитьПараметр("Организация", Стр.АдресХранения.Лико_Организация);
				Запрос.УстановитьПараметр("Склад", Стр.АдресХранения.Владелец);
				Запрос.УстановитьПараметр("ТипСклада", Стр.АдресХранения.Лико_ТипСклада);
				Запрос.УстановитьПараметр("УдаленныйСклад", Стр.АдресХранения.Лико_УдаленныйСклад);
				Запрос.УстановитьПараметр("ОтветХранение", Стр.АдресХранения.Лико_ОтветственноеХранение);
				Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					МассивПодобранныхСерий.Добавить(ВыборкаДетальныеЗаписи.Серия); 
					НомерПоставки = Стр.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки;
					ДатаФормирования = Стр.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования;
					ТекстВопроса = "Нарушен принцип ФИФО, для ТМЦ """ + Стр.Номенклатура.Наименование + """, #" + НомерПоставки + " от " + Формат(ДатаФормирования,"ДФ=dd.MM.yyyy") 
					+ " - есть более ранний - " + "#" + ВыборкаДетальныеЗаписи.НомерПоставки + " от " + Формат(ВыборкаДетальныеЗаписи.ДатаФормирования,"ДФ=dd.MM.yyyy");
					Вопрос = ?(Вопрос = "", ТекстВопроса,Вопрос + Символы.ПС + Символы.ПС + ТекстВопроса);
					ТекстПисьма = "Для ТМЦ """ + Стр.Номенклатура.НаименованиеПолное 
					+ ?(Найти(НРег(Стр.Номенклатура.НаименованиеПолное),НРег(Стр.Номенклатура.Артикул)) > 0,""," (" + Стр.Номенклатура.Артикул +")") 
					+ """, #" + НомерПоставки + " от " + Формат(ДатаФормирования,"ДФ=dd.MM.yyyy") 
					+ " - есть более ранний - " + "#" + ВыборкаДетальныеЗаписи.НомерПоставки + " от " + Формат(ВыборкаДетальныеЗаписи.ДатаФормирования,"ДФ=dd.MM.yyyy");
					Письмо = ?(Письмо = "", ТекстПисьма,Письмо + "<br>" + "<br>" + ТекстПисьма);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СтруктураВозврата = Новый Структура("Вопрос,Письмо",Вопрос,Письмо);
		Возврат СтруктураВозврата; 
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Вопрос,Письмо",Вопрос,Письмо);
	Возврат СтруктураВозврата;
	
КонецФункции  // <-- Конец Лико Яцун С. В. 14.10.2025

&НаКлиенте
Процедура ПослеОтветаНаВопросФИФО(РезультатВопроса, ДополнительныеПараметры) Экспорт // <-- Начало Лико Яцун С. В. 14.10.2025
    
	Результат = РезультатВопроса;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры.ПараметрыЗаписи.Вставить("ПровестиПослеПроверкиФИФО",Истина);
		ЭтаФорма.Записать(ДополнительныеПараметры.ПараметрыЗаписи);
		ТемаПисьма = "В заявке на склад " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип ФИФО";
		ТекстПисьма = "В заявке на склад " + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy") + " нарушен принцип ФИФО: " + "<br>" + "<br>" + ДополнительныеПараметры.ТекстПисьма;
		Адресат = "MBuyanov@okil-sato.ru;ALeshev@okil-sato.ru;OlegPak@okil.ru;OLyaskovskaya@okil-sato.ru";
		ОтправитьПисьмо(ТекстПисьма, ТемаПисьма, Адресат);
	КонецЕсли; 
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 14.10.2025    

&НаСервере
Процедура ОтправитьПисьмо(ТекстПисьма, Тема, Кому)
	Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, Тема, Кому);
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер,Объект.Контрагент );
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПартииУВыделенныхЭлементов(Команда)
	ОО= Новый ОписаниеОповещения("ЗаполнениеПартииУВыделенныхЭлементовЗавершение",ЭтаФорма);
	
	ОткрытьФорму("Обработка.Лико_Прослеживаемость.Форма.ФормаЭлементаПрослеживаемость",,,,,,ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнениеПартииУВыделенныхЭлементовЗавершение(Результат,Параметры) Экспорт //+Лико m.shenderov 10.04.2023
	
	Если ТипЗнч(Результат)=Тип("Структура") И ЗначениеЗаполнено(Результат) Тогда 
		
		Для каждого Индекс Из Элементы.Товары.ВыделенныеСтроки  Цикл 
			
			         
			ЗаполнитьПартиюСервер( Элементы.Товары.ДанныеСтроки(Индекс).Серия,Результат);
			
			
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 10.04.2023


&НаСервере
Процедура ЗаполнитьПартиюСервер(Серия,Данные) //+Лико m.shenderov 10.04.2023
	ЗаписыватьОбъекты=Ложь;
	ОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры;
	Если ОбъектНоменклатуры.Уникальный Тогда
		
		СпрОбъект=  ОбъектНоменклатуры.ПолучитьОбъект();
		
		ЗаполнитьЗначенияСвойств(СпрОбъект,Данные);
		СпрОбъект.Записать();
		
		ЗаписыватьОбъекты=Истина;
	КонецЕсли;
	
	Если ЗаписыватьОбъекты Тогда
		ПриЧтенииСозданииНаСервере();

	КонецЕсли;
	
КонецПроцедуры  //-Лико m.shenderov 10.04.2023

&НаСервере
Функция ПроверитьФИФОЛИФО(Отказ,РежимЗаписи) // <-- Начало Лико Яцун С. В. 16.10.2025
	
	Возврат Документы.Лико_ПередачаТоваров.ПроверитьФИФОЛИФО(Отказ,РежимЗаписи,Объект,УчетПравилПеремещенияТМЦ);
		
КонецФункции  // <-- Конец Лико Яцун С. В. 16.10.2025

&НаКлиенте
Процедура ПроверкаПравилПеремещенияТМЦПередЗаписью(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	НеВыполнятьПроверкуПередЗаписью=Истина;
	Структура = Новый Структура;
	Структура.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	Структура.Вставить("ПроверкаПравилПеремещенияТМЦПередЗаписью",Истина);
	Записать(Структура);
		
	
КонецПроцедуры




