
&Вместо("СформироватьСоответствиеЗасчитанныхЭтикетокПоПотреблениюСледующегоПроката")
Функция расш_СформироватьСоответствиеЗасчитанныхЭтикетокПоПотреблениюСледующегоПроката(ТекНомерПроката)

	СоответствиеБланковИЗасчЭт = Новый Соответствие; 
	Если ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
		// Смотрим ПМ материала, закрытого на РЦ вида Термоусадка и делим на Количество ручьев печати из заказа (т.к. на печатной машине нарезка широкая, а на склейку приходит узкая)
		НужноДелитьНаРучьи = Истина;
	ИначеЕсли ТипЗаказа = Перечисления.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка Тогда
		// Чистые метры - это метры, потребленные следующей машиной
		НужноДелитьНаРучьи = Ложь;
	Иначе
		Возврат СоответствиеБланковИЗасчЭт;
	КонецЕсли;
	
	ЗапросПМ = Новый Запрос;
	ЗапросПМ.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапа.НомерБланка КАК НомерБланка,
	|	Лико_БланкЭтапа.ЗаказПокупателя КАК ЗаказКлиента,
	|	Лико_БланкЭтапа.ЗаказПокупателя.РучьиПечати КАК РучьиПечати,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК КоличествоРасход,
	|	МАКСИМУМ(Лико_БланкЭтапа.РабочийЦентр.ВидРабочегоЦентра) КАК ВидРабочегоЦентра
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|		ПО Лико_БланкЭтапа.Ссылка = Лико_БланкЭтапаТовары.Ссылка
	|			И (Лико_БланкЭтапаТовары.Списать)
	|			И (ВЫБОР
	|				КОГДА &ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Термоусадка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|			КОНЕЦ)
	|			И (Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал)
	|ГДЕ
	|	Лико_БланкЭтапа.Проведен
	|	И НЕ Лико_БланкЭтапа.ПометкаУдаления
	|	И Лико_БланкЭтапа.ЗаказПокупателя = &ЗаказКлиента
	|	И Лико_БланкЭтапа.НомерПроката = &НомерПроката
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапа.ЗаказПокупателя,
	|	Лико_БланкЭтапа.ЗаказПокупателя.РучьиПечати,
	|	Лико_БланкЭтапа.НомерБланка";
	
	ЗапросПМ.УстановитьПараметр("ТипЗаказа", ТипЗаказа);
	ЗапросПМ.УстановитьПараметр("ЗаказКлиента", Ссылка);
	ЗапросПМ.УстановитьПараметр("НомерПроката", ТекНомерПроката + 1);
	
	ВыборкаПМ = ЗапросПМ.Выполнить().Выбрать();
	Если ВыборкаПМ.Количество() > 0 Тогда
		Пока ВыборкаПМ.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПМ.КоличествоРасход) Тогда
				ЗначениеСоответствия = Новый Структура;
				ЗначениеСоответствия.Вставить("ТипДанных", "ПогМетры");
				ЗначениеСоответствия.Вставить("Значение", ВыборкаПМ.КоличествоРасход / ?(НужноДелитьНаРучьи И ВыборкаПМ.РучьиПечати <> 0 И ВыборкаПМ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки, ВыборкаПМ.РучьиПечати, 1));
				СоответствиеБланковИЗасчЭт.Вставить(ВыборкаПМ.НомерБланка, ЗначениеСоответствия);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Возврат СоответствиеБланковИЗасчЭт;
	
КонецФункции
