


&НаСервере
Процедура Лико_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// <-- Начало Лико Яцун С. В. 26.02.2025 
	//Если   ИмяСправочникаХранилищаФайлов="НоменклатураПрисоединенныеФайлы" Тогда
	Если ИмяСправочникаХранилищаФайлов = "НоменклатураПрисоединенныеФайлы" ИЛИ ИмяСправочникаХранилищаФайлов = "ПартнерыПрисоединенныеФайлы" Тогда
	// <-- Конец Лико Яцун С. В. 26.02.2025
		//Добавляю наименование серии
		Элемент = Элементы.Добавить("Лико_ТипФайла", Тип("ПолеФормы"),Элементы.Список);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Список.Лико_ТипФайла";
		//Форма.Элементы.Переместить(Элемент, Элемент.Родитель, Форма.Элементы.Номер);
		Элементы.ФормаBRC.Видимость=Истина;
	КонецЕсли;
	
	// <-- Начало Лико Яцун С. В. 26.02.2025 
	Если ИмяСправочникаХранилищаФайлов = "ПартнерыПрисоединенныеФайлы" Тогда 
		Элементы.ФормаBRC.Заголовок = "Указать тип файла";	
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 26.02.2025
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_BRCПосле(Команда)
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
	    
	//ИзменитьЛикоТипФайла(Элементы.Список.ТекущиеДанные.Ссылка);	
	//Элементы.Список.Обновить();
	ОПисаниеОповещение= Новый ОписаниеОповещения("Лико_BRCЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_ТипыФайлов.ФормаВыбора",,,,,,ОПисаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЛикоТипФайла (Ссылка,ТипФайла) //+Лико m.shenderov 27.04.2020
СпрОбъект= Ссылка.ПолучитьОбъект();
		//СпрОбъект.Лико_ТипФайла=?(НЕ ЗначениеЗаполнено(Ссылка.Лико_ТипФайла),ПредопределенноеЗначение("Перечисление.Лико_ТипыФайлов.BRC"),
		//?(СпрОбъект.Лико_ТипФайла=ПредопределенноеЗначение("Перечисление.Лико_ТипыФайлов.BRC"),ПредопределенноеЗначение("Перечисление.Лико_ТипыФайлов.BRCБирка"),Неопределено));
		СпрОбъект.Лико_Тип=ТипФайла;
		СпрОбъект.Записать();
КонецПроцедуры  //-Лико m.shenderov 27.04.2020


&НаКлиенте
Процедура Лико_BRCЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 23.06.2020
	
	//Элементы.Список.ТекущиеДанные.Лико_ТипФайла=РезультатФормы;
	ИзменитьЛикоТипФайла (Элементы.Список.ТекущиеДанные.Ссылка,РезультатФормы);
	Элементы.Список.Обновить();

	
КонецПроцедуры //-Лико m.shenderov 23.06.2020

