
&Вместо("ДанныеДокументаДляПроведения")
Функция Лико_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;

	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		СформироватьСуммыДокументаВВалютахУчета(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		
		ТекстЗапросаТаблицаЗаказыПоставщикам(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		//ТекстЗапросаТаблицаЦеныНоменклатурыПоставщиков(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры); 
	//--> Маковеева А.Ю. 14.05.2018
	//взаиморасчеты двигаем только документом поставки
	//ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект); 
	//<-- Маковеева А.Ю. 14.05.2018
	
	ЗапланироватьПоступлениеТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

&Вместо("ПроцентПоступленияПоЗаказу")
Функция Лико_ПроцентПоступленияПоЗаказу(ЗаказПоставщику, ПриходныйДокументИсключения)

	Если ПриходныйДокументИсключения=Неопределено Тогда

		ПриходныйДокументИсключения=Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();

	КонецЕсли; 
	


	Результат= Новый Структура;
	Результат.Вставить("Процент",0);
	Результат.Вставить("ДатаПоступления",Неопределено);  
	
	Если ЗаказПоставщику.Проведен = Ложь Тогда
		Возврат Результат;
	КонецЕсли;


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОстаткиИОбороты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход
	|ПОМЕСТИТЬ ВтЗаказы
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКПоступлениюПоЗаказамПоставщику.ОстаткиИОбороты(, , , , ЗаказПоставщику = &ЗаказПоставщику) КАК Лико_ТоварыКПоступлениюПоЗаказамПоставщикуОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ТоварыКПоступлениюПоПредзаказамПоставщикуОстаткиИОбороты.ЗаказПоставщику,
	|	Лико_ТоварыКПоступлениюПоПредзаказамПоставщикуОстаткиИОбороты.КоличествоПриход,
	|	Лико_ТоварыКПоступлениюПоПредзаказамПоставщикуОстаткиИОбороты.КоличествоРасход
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.ОстаткиИОбороты(, , , , ЗаказПоставщику = &ЗаказПоставщику) КАК Лико_ТоварыКПоступлениюПоПредзаказамПоставщикуОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Лико_ТоварыКПоступлениюПоЗаказамПоставщику.Период) КАК Период,
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщику.ЗаказПоставщику КАК ЗаказПоставщику
	|ПОМЕСТИТЬ ВтМаксПриход
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКПоступлениюПоЗаказамПоставщику КАК Лико_ТоварыКПоступлениюПоЗаказамПоставщику
	|ГДЕ
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщику.ЗаказПоставщику = &ЗаказПоставщику
	|	И Лико_ТоварыКПоступлениюПоЗаказамПоставщику.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ТоварыКПоступлениюПоЗаказамПоставщику.ЗаказПоставщику
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.Период),
	|	Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.ЗаказПоставщику
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКПоступлениюПоПредзаказамПоставщику КАК Лико_ТоварыКПоступлениюПоПредзаказамПоставщику
	|ГДЕ
	|	Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.ЗаказПоставщику = &ЗаказПоставщику
	|	И Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ТоварыКПоступлениюПоПредзаказамПоставщику.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВтМаксПриход.Период) КАК Период,
	|	ВтМаксПриход.ЗаказПоставщику КАК ЗаказПоставщику
	|ПОМЕСТИТЬ ВтМаксПриходИтого
	|ИЗ
	|	ВтМаксПриход КАК ВтМаксПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтМаксПриход.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВтЗаказы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВтЗаказы.КоличествоРасход / ВтЗаказы.КоличествоПриход * 100 КАК ПроцентПоступления
	|ПОМЕСТИТЬ ВтЗаказыИтого
	|ИЗ
	|	ВтЗаказы КАК ВтЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтМаксПриходИтого.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВтЗаказыИтого.ПроцентПоступления КАК ПроцентПоступления,
	|	ВтМаксПриходИтого.Период КАК ДатаПоступления
	|ИЗ
	|	ВтЗаказыИтого КАК ВтЗаказыИтого
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтМаксПриходИтого КАК ВтМаксПриходИтого
	|		ПО ВтЗаказыИтого.ЗаказПоставщику = ВтМаксПриходИтого.ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику",ЗаказПоставщику );
	//Запрос.УстановитьПараметр("ПриходныйДокументИсключения",ПриходныйДокументИсключения );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		Результат.Процент=Выборка.ПроцентПоступления;
		Результат.ДатаПоступления=Выборка.ДатаПоступления;

	КонецЦикла; 


	Возврат Результат;


КонецФункции
