
&Вместо("ЗаполнитьДокументПоОтбору")
Процедура Лико_ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);

	Если ДанныеЗаполнения.Свойство("Товары") Тогда
		ЭтотОбъект.Товары.Загрузить(ДанныеЗаполнения.Товары);
	КонецЕсли;

	ЗакупкиСервер.ПроверитьВозможностьВводаНаОснованииПартнераПоставщикаКонкурента(Партнер);
	ПроверитьЗаполнитьПоступлениеОднойДатой();

	Если ДанныеЗаполнения.Свойство("НаправлениеДеятельности") 
		И ЗначениеЗаполнено(ДанныеЗаполнения.НаправлениеДеятельности) Тогда
		Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.НаправлениеДеятельности,"УчетЗатрат") Тогда
			НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(НаправлениеДеятельности, Соглашение, Договор);
		КонецЕсли;
	КонецЕсли;

	Если ДанныеЗаполнения.Свойство("Товары") Тогда //Заполнение из обработки "Обеспечение потребностей".

		Если ЗначениеЗаполнено(Соглашение) Тогда
			ЗаполнитьУсловияЗакупокПоСоглашению(Ложь);
		Иначе

			ХозяйственнаяОперация = Метаданные.Документы.ЗаказПоставщику.Реквизиты.ХозяйственнаяОперация.ЗначениеЗаполнения;

			ПараметрыЗаполнения = Документы.ЗаказПоставщику.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ЭтотОбъект);
			УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(НалогообложениеНДС, ПараметрыЗаполнения);

			ПараметрыЗаполнения = Документы.ЗаказПоставщику.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
			УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ЗакупкаПодДеятельность, ПараметрыЗаполнения);

		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("Склад") Тогда // чтобы соглашение не переопределяло склад.
			ЭтотОбъект.Склад = ДанныеЗаполнения.Склад;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Валюта) Тогда
			Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Валюта);
		КонецЕсли;

		ЗаполнитьЦеныПоВидамЦен(); //заполнение цен, согласно видам цен, заданным в таблице "Товары".
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);

	ИначеЕсли ЗначениеЗаполнено(Соглашение) Тогда

		Если Не ЗначениеЗаполнено(Договор) Тогда

			ХозяйственнаяОперацияДоговора = ?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо,
			Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика,
			ХозяйственнаяОперация);
			ХозяйственнаяОперацияДоговора = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(ХозяйственнаяОперацияДоговора);

			ДопПараметры = ЗакупкиСервер.ДополнительныеПараметрыОтбораДоговоров();
			ДопПараметры.ВалютаВзаиморасчетов = Валюта;
			Договор = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперацияДоговора, ДопПараметры);

		КонецЕсли;

		ПараметрыЗаполнения = Документы.ЗаказПоставщику.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ЭтотОбъект);
		УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(НалогообложениеНДС, ПараметрыЗаполнения);

		ПараметрыЗаполнения = Документы.ЗаказПоставщику.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
		УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ЗакупкаПодДеятельность, ПараметрыЗаполнения);

		ЗаполнитьЦеныПоСоглашению();
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);

	Иначе
		ЗаполнитьУсловияЗакупокПоУмолчанию();
	КонецЕсли; 
	
	//+ Лико m.shenderov 17/11/2019
	Если ДанныеЗаполнения.Свойство("лкСтрТовары") Тогда
		Для каждого Товар Из ДанныеЗаполнения.лкСтрТовары Цикл
			НовыйТовар=Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
			НовыйЗаказ=Лико_РезервПодЗаказКлиента.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЗаказ,Товар);
		КонецЦикла;
		Товары.Свернуть("Номенклатура,Характеристика","Количество,КоличествоУпаковок");
		Лико_РезервПодЗаказКлиента.Свернуть("ЗаказКлиента");
		Для каждого Товар Из Товары Цикл
			Нарезка=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Характеристика,"ЯССМ_Нарезка");		
		Если ЗначениеЗаполнено(Нарезка) Тогда  
			Товар.Лико_Намотка=2000;
			Товар.Лико_Втулка=ВтулкаСервер76();  			
			Ролик = (Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Нарезка,"Размер")/1000) *Товар.Лико_Намотка; 
			Товар.Лико_КолРоликов=Цел(Товар.Количество/Ролик)+?(Товар.Количество%Ролик=0,0,1);  			
			КоличествоПГ = 0;
			КоличествоКВ = (Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Нарезка,"Размер")/1000) *
			Товар.Лико_Намотка * 
			Товар.Лико_КолРоликов;
			Товар.КоличествоУпаковок = КоличествоКВ;
			Товар.Количество = КоличествоКВ;					
		КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	//- Лико m.shenderov 17/11/2019  
	//+ ---> Лико m.shenderov 26.06.2023
	Если  ДанныеЗаполнения.Свойство("ВнутренняяЗаявкаНаЗакупку") Тогда
		
		Контрагент=УправлениеСвойствами.ЗначениеСвойства(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
		Партнер=Контрагент.Партнер;
		НовыйТовар=Товары.Добавить();
		НовыйТовар.Номенклатура=Справочники.Лико_ПредопределенныеЗначения.НоменклатураДляВнутреннейЗаявкиНаЗакупку.ЗначениеПараметра;
		НовыйТовар.Количество=1;
		НовыйТовар.КоличествоУпаковок=1; 
		НовыйТовар.Цена=1;
			
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НовыйТовар, СтруктураДействий, Неопределено);

		
		
		Если Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
			
			 Лико_ВидКонтактаСПищевойПродукцией=Справочники.Лико_ВидыКонтактовСПищевойПродукцией.НетКонтакта;
			
		КонецЕсли;
		
		 Приоритет=Справочники.Приоритеты.ПолучитьВысшийПриоритет();

				
	КонецЕсли;
	
	//- <--- Лико m.shenderov 26.06.2023
	


	НоменклатураПартнеровСервер.ЗаполнитьНоменклатуруПартнераПоНоменклатуреПриИзмененииПартнера(Товары, Партнер);

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента")
		И ДокументОснование.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
		ЦенаВключаетНДС = ДокументОснование.ЦенаВключаетНДС;
		ЗаполнитьЦеныПоЗаказуПринципала();
	КонецЕсли;

КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура Лико_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если (ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи)
		И Не ЗакупкиСервер.ЭтоХозяйственнаяОперацияРаздельнойЗакупки(ХозяйственнаяОперация)
		И (Не ЗначениеЗаполнено(Соглашение)
		Или Не ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Соглашение, "ИспользуютсяДоговорыКонтрагентов")) Тогда

		МассивНепроверяемыхРеквизитов.Добавить("Договор");

	КонецЕсли;

	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);

	// Срок действия заказа должен быть не меньше даты документа
	Если Статус = Перечисления.СтатусыЗаказовПоставщикам.НеСогласован И
		ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда

		ТекстОшибки = НСтр("ru = 'Дата согласования должна быть не меньше даты документа %Дата%';
		|en = 'Date of approval cannot be before the document creation: %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата, "ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаСогласования",
		,
		Отказ);

	КонецЕсли;

	ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ЭтотОбъект, "Товары", "Отменено");

	Если Не ПоступлениеОднойДатой ИЛИ 
		ПоступлениеОднойДатой И 
		НЕ(Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден Или
		Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт) 
		ИЛИ ПоступлениеОднойДатой И ВсеСтрокиОтменены Тогда

		МассивНепроверяемыхРеквизитов.Добавить("ДатаОтгрузки");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПоступления");

	КонецЕсли;

	Если ДлительностьДоставки = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПоступления");
	КонецЕсли;   
	
	// <-- Начало Лико Яцун С. В. 03.10.2024 
	Если ПоступлениеОднойДатой  И НЕ (Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден ИЛИ Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПоступления");
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 03.10.2024

	// Желаемая дата поступления в шапке должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ЖелаемаяДатаПоступления) И ЖелаемаяДатаПоступления < НачалоДня(Дата) Тогда

		ТекстОшибки = НСтр("ru = 'Желаемая дата поступления должна быть не меньше даты документа %Дата%';
		|en = 'Requested delivery date cannot be before the document creation: %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ЖелаемаяДатаПоступления",
		,
		Отказ);

	КонецЕсли;

	// Дата поступления в шапке должна быть не меньше даты документа
	Если ПоступлениеОднойДатой 
		И ЗначениеЗаполнено(ДатаПоступления) 
		И ДатаПоступления < НачалоДня(Дата)
		И НЕ ВсеСтрокиОтменены
		И ДлительностьДоставки <> 0 Тогда

		ТекстОшибки = НСтр("ru = 'Дата поступления должна быть не меньше даты документа %Дата%';
		|en = 'Date of receipt cannot be before the document date: %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаПоступления",
		,
		Отказ);

	КонецЕсли;

	// Дата поступления в шапке должна быть не меньше даты документа
	Если ПоступлениеОднойДатой
		И ЗначениеЗаполнено(ДатаОтгрузки)
		И ДатаОтгрузки < НачалоДня(Дата)
		И НЕ ВсеСтрокиОтменены Тогда

		ТекстОшибки = НСтр("ru = 'Дата отгрузки должна быть не меньше даты документа %Дата%';
		|en = 'Shipment date cannot be less than document date%Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначения.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаОтгрузки",
		,
		Отказ);

	КонецЕсли;

	// <-- Начало Лико Яцун С. В. 03.10.2024 
	//Если ПоступлениеОднойДатой
	//	И ДатаПоступления < ДатаОтгрузки
	//	И НЕ ВсеСтрокиОтменены Тогда
	Если ПоступлениеОднойДатой 
		И ЗначениеЗаполнено(ДатаПоступления)
		И ДатаПоступления < ДатаОтгрузки
		И НЕ ВсеСтрокиОтменены Тогда
	// <-- Конец Лико Яцун С. В. 03.10.2024
		ТекстОшибки = НСтр("ru = 'Дата поступления должна быть не меньше даты отгрузки %Дата%';
		|en = 'Date of receipt must be later than shipment date %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(ДатаОтгрузки, "ДЛФ=DD"));

		ОбщегоНазначения.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаПоступления",
		,
		Отказ);

	КонецЕсли;

	НакладнаяЯвляетсяРаспоряжением = ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(ВариантПриемкиТоваров);

	ИспользуетсяНеотфактурованнаяПоставка = ПолучитьФункциональнуюОпцию("ИспользоватьНеотфактурованныеПоставки");
	ИспользуетсяНеотфактурованнаяПоставка = ИспользуетсяНеотфактурованнаяПоставка
	И ?(ЗначениеЗаполнено(Договор),
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВариантОформленияЗакупок") = Перечисления.ВариантыОформленияЗакупок.НеотфактурованныеПоставкиТоваров,
	Ложь);

	Если НакладнаяЯвляетсяРаспоряжением
		И ИспользуетсяНеотфактурованнаяПоставка Тогда

		ОперацииНеотфактурованнойПоставки = Новый Массив;
		ОперацииНеотфактурованнойПоставки.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
		ОперацииНеотфактурованнойПоставки.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);

		Если ОперацииНеотфактурованнойПоставки.Найти(ХозяйственнаяОперация) <> Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Использование варианта приемки ""по накладным"" не поддерживается для операций неотфактурованной поставки.
			|Рекомендуется использовать вариант приемки по договорам или по заказам.';
			|en = 'Cannot use ""By invoices"" receiving option for uninvoiced delivery operations.
			| It is recommended that you use ""By contracts"" or ""By orders"" receiving option instead.'");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , Отказ);
		КонецЕсли;

	КонецЕсли;

	МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаОтмены");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаПоступления");

	// Вспомогательные реквизиты для проверки учета НДС
	ПоФактИспользованию			= (ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПоФактическомуИспользованию);
	ИзДокумента					= Перечисления.ВариантыРаздельногоУчетаНДС.ИзДокумента;
	НаНаправленияДеятельности	= Перечисления.ВариантыРаспределенияРасходов.НаНаправленияДеятельности;
	//++ НЕ УТ
	НаПроизводственныеЗатраты	= Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты;
	//-- НЕ УТ
	ПартионныйУчетВключен		= РасчетСебестоимостиПовтИсп.ПартионныйУчетВключен(НачалоМесяца(Дата));
	ИспользоватьДоходыРасходы	= ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов");

	СоответствиеКодовСтрок = Новый Соответствие;

	ИспользоватьАгентскуюЗакупку = ПолучитьФункциональнуюОпцию("ИспользоватьОказаниеАгентскихУслугПриЗакупке");

	Для ТекИндекс = 0 По Товары.Количество()-1 Цикл

		СтрокаТовары = Товары[ТекИндекс]; // СтрокаТабличнойЧасти

		// Дата поступления в тч Товары обязательна к заполнению только для заказов в 
		// статусах Подтвержден, КПоступлению, Закрыт.
		Если Не ПоступлениеОднойДатой
			И (Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден
			Или Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт)
			И Не СтрокаТовары.Отменено
			И Не ЗначениеЗаполнено(СтрокаТовары.ДатаПоступления)
			И ДлительностьДоставки <> 0 Тогда

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заполнена колонка ""Дата поступления"" в строке %1';
			|en = 'The ""Date of receipt"" column in line %1 is not filled in'"),
			СтрокаТовары.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ДатаПоступления"),
			,
			Отказ);

		КонецЕсли;

		Если Не ПоступлениеОднойДатой
			И (Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден
			Или Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт)
			И Не СтрокаТовары.Отменено
			И Не ЗначениеЗаполнено(СтрокаТовары.ДатаОтгрузки) Тогда

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заполнена колонка ""Дата отгрузки"" в строке %1';
			|en = 'The ""Shipment date"" column in the %1 line is not filled in'"),
			СтрокаТовары.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ДатаОтгрузки"),
			,
			Отказ);

		КонецЕсли;

		// Дата поступления в тч Товары должна быть не меньше даты документа
		Если Не ПоступлениеОднойДатой 
			И ЗначениеЗаполнено(СтрокаТовары.ДатаПоступления) 
			И СтрокаТовары.ДатаПоступления < НачалоДня(Дата)
			И ДлительностьДоставки <> 0 Тогда

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Дата поступления должна быть не меньше даты документа %1 в строке %2';
			|en = 'Date of receipt cannot be earlier than the %1 document date in line %2'"),
			Формат(Дата,"ДЛФ=DD"), СтрокаТовары.НомерСтроки);

			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ДатаПоступления"),
			,
			Отказ);

		КонецЕсли;

		Если Не ПоступлениеОднойДатой 
			И ЗначениеЗаполнено(СтрокаТовары.ДатаПоступления) 
			И СтрокаТовары.ДатаПоступления < СтрокаТовары.ДатаОтгрузки Тогда

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Дата поступления должна быть не меньше даты отгрузки %1 в строке %2';
			|en = 'Date of receipt must be later than shipment date %1 in line %2'"),
			Формат(СтрокаТовары.ДатаОтгрузки,"ДЛФ=DD"), СтрокаТовары.НомерСтроки);

			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ДатаПоступления"),
			,
			Отказ);

		КонецЕсли;

		// Дата поступления в тч Товары должна быть не меньше даты документа
		Если Не ПоступлениеОднойДатой И ЗначениеЗаполнено(СтрокаТовары.ДатаОтгрузки) И СтрокаТовары.ДатаОтгрузки < НачалоДня(Дата) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Дата отгрузки должна быть не меньше даты документа %1 в строке %2';
			|en = 'Shipment date must be later than the %1 document dates in the %2 line'"),
			Формат(Дата,"ДЛФ=DD"), СтрокаТовары.НомерСтроки);

			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ДатаОтгрузки"),
			,
			Отказ);

		КонецЕсли;

		// Причина отмены обязательна для заполнения в строках без признака Отменено
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовПоставщикам")
			И СтрокаТовары.Отменено
			И Не ЗначениеЗаполнено(СтрокаТовары.ПричинаОтмены) Тогда

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Необходимо указать причину отмены в строке %1';
			|en = 'Specify a cancellation reason in line %1'"),
			СтрокаТовары.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ПричинаОтмены"),
			,
			Отказ);

		КонецЕсли;

		// Статья расходов не должна ссылаться на налогообложение в документе закупки,
		// если у организации включено налогообложение по факт. использованию.
		Если ПартионныйУчетВключен
			И ПоФактИспользованию
			И Не СтрокаТовары.Отменено
			И ЗначениеЗаполнено(СтрокаТовары.СтатьяРасходов) Тогда

			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			СтрокаТовары.СтатьяРасходов,
			"ВариантРаздельногоУчетаНДС, ВариантРаспределенияРасходовРегл");

			Если (Реквизиты.ВариантРаспределенияРасходовРегл = НаНаправленияДеятельности
				//++ НЕ УТ
				ИЛИ Реквизиты.ВариантРаспределенияРасходовРегл = НаПроизводственныеЗатраты
				//-- НЕ УТ
				)
				И Реквизиты.ВариантРаздельногоУчетаНДС = ИзДокумента Тогда

				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При использовании учета НДС по фактическому использованию, у статьи расходов должен быть выбран раздельный учет НДС по расходам: ""НДС распределяется по видам налогообложения пропорционально выручке"" в строке %1';
				|en = 'When using VAT accounting by actual usage, separate VAT accounting is to be selected for the expense item: ""VAT is allocated by taxation kinds in proportion to revenue"" in line %1'"),
				СтрокаТовары.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "СтатьяРасходов"),
				,
				Отказ);

			КонецЕсли;

		КонецЕсли;

		Если ИспользоватьАгентскуюЗакупку
			И ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда
			ТипНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Назначение, "ТипНазначения");
			Если ТипНазначения = Перечисления.ТипыНазначений.ПоставкаПодПринципала Тогда
				ПроверитьПараметрыЗаписиДляЗакупкиПодПринципала(СтрокаТовары.НомерСтроки,
				СтрокаТовары.Назначение, Отказ);
			КонецЕсли;
		КонецЕсли;

		ЗаказыСервер.ПроверитьДублиКодовСтрокВТаблице(ЭтотОбъект,
		СтрокаТовары.КодСтроки,
		СтрокаТовары.НомерСтроки,
		СоответствиеКодовСтрок,
		Отказ);

	КонецЦикла;

	МассивНепроверяемыхРеквизитов.Добавить("Товары.Подразделение");
	ТипыНоменклатуры = Новый Массив;
	ТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	ТекстОшибки = НСтр("ru = 'Не указан получатель услуг в строке %1 списка Товары';
	|en = 'Service recipient is not specified in line # %1 of the Item list'");
	СписокХозяйственныхОперацийИсключающихУслуги = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихУслуги();
	Если  СписокХозяйственныхОперацийИсключающихУслуги.НайтиПоЗначению(ХозяйственнаяОперация) = Неопределено Тогда
		ЗапасыСервер.ПроверитьЗаполнениеПодразделенияВТабличнойЧасти(ЭтотОбъект, ТипыНоменклатуры, ТекстОшибки, Отказ);
	КонецЕсли;

	ТипыНоменклатуры = Новый Массив;
	ТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	ТекстОшибки = НСтр("ru = 'Не указан получатель работ в строке %1 списка Товары';
	|en = 'Work recipient is not specified in line #%1 of the Item list'");
	СписокХозяйственныхОперацийИсключающихРаботы = НоменклатураСервер.СписокХозяйственныхОперацийИсключающихРаботы();
	Если СписокХозяйственныхОперацийИсключающихРаботы.НайтиПоЗначению(ХозяйственнаяОперация) = Неопределено Тогда
		ЗапасыСервер.ПроверитьЗаполнениеПодразделенияВТабличнойЧасти(ЭтотОбъект, ТипыНоменклатуры, ТекстОшибки, Отказ);
	КонецЕсли;

	ТипыНоменклатуры = Новый Массив;
	ТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	ТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ТекстОшибки = НСтр("ru = 'Не указан получатель товаров в строке %1 списка Товары';
	|en = 'Recipient of goods is not specified in line %1 of the Goods list'");
	ЗапасыСервер.ПроверитьЗаполнениеПодразделенияВТабличнойЧасти(ЭтотОбъект, ТипыНоменклатуры, ТекстОшибки, Отказ);

	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;

	Документы.ЗаказПоставщику.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
	МассивВсехРеквизитов,
	МассивРеквизитовОперации,
	МассивНепроверяемыхРеквизитов);

	ДоставкаТоваров.ПроверитьЗаполнениеРеквизитовДоставки(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);

	//+ Лико m.shenderov 11.05.2020
	BRC=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC");
	BRC=?(BRC=Неопределено,Ложь,BRC);
	Если BRC Тогда
		ПроверяемыеРеквизиты.Добавить("Лико_ВидКонтактаСПищевойПродукцией");	
	КонецЕсли;
	//- Лико m.shenderov 11.05.2020
	//+ ---> Лико m.shenderov 29.11.2023
	МассивНепроверяемыхРеквизитов.Добавить("Лико_ВалютаРасчета");
	//- <--- Лико m.shenderov 29.11.2023  
	
	//+ ---> Лико m.shenderov 28.02.2024
	ОрганизацияИксПак	=	Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра;
	КонтрагентИксПак	=	УправлениеСвойствами.ЗначениеСвойства(ОрганизацияИксПак,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
	ОрганизацияЛикофлекс =  Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра;

	
	Если (Организация=ОрганизацияИксПак 
		И Статус<>Перечисления.СтатусыЗаказовПоставщикам.Лико_Создан) 
		Или (ОрганизацияЛикофлекс = Организация И Статус = Перечисления.СтатусыЗаказовПоставщикам.НеСогласован)Тогда 
		
		ПроверяемыеРеквизиты.Добавить("ДлительностьДоставки"); 
		
	КонецЕсли; 
	//- <--- Лико m.shenderov 28.02.2024
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	ПроверитьИзменениеХозяйственнойОперации(Отказ);

	ЗакупкиСервер.ПроверитьКорректностьЗаполненияДокументаЗакупки(ЭтотОбъект, Отказ);

	ПараметрыВыбораСтатейИАналитик = Документы.ЗаказПоставщику.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);

	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполнениеДокументаПоНалогообложениюНДСЗакупки();
	ПараметрыПроверки.ИмяТабличнойЧасти = "Товары";
	ПараметрыПроверки.ИмяРеквизитаСтатьяРасходов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаРасходов = "АналитикаРасходов";
	УчетНДСУП.ПроверитьЗаполнениеДокументаЗакупкиПоНалогообложениюНДС(ЭтотОбъект, НалогообложениеНДС, ПараметрыПроверки, Отказ);

	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполненияДокументаПоВидуДеятельностиНДС();
	ПараметрыПроверки.ИмяТабличнойЧасти = "Товары";
	ПараметрыПроверки.ИмяРеквизитаСтатьяРасходов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаРасходов = "АналитикаРасходов";
	УчетНДСУП.ПроверитьЗаполнениеДокументаПоВидуДеятельностиНДС(ЭтотОбъект, ЗакупкаПодДеятельность, ПараметрыПроверки, Отказ);

	
	 //+ ---> Лико m.shenderov 18.11.2024
	 Если Партнер.Лико_ОформлятьПредзакзыПоставщикам Тогда
		 ПроверяемыеРеквизиты.Добавить("Лико_Основание");
	 КонецЕсли;    
	 //- <--- Лико m.shenderov 18.11.2024
                      
	
	
	
	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;

	//+ Лико m.shenderov 17.05.2020
	КоличествоСоглашенийСПоставшиком =0;
	Если ЗначениеЗаполнено(Партнер) Тогда
		КоличествоСоглашенийСПоставшиком = ЗакупкиВызовСервера.ПолучитьКоличествоСоглашенийСПоставщиком(Партнер); 
		КоличествоСоглашенийСПоставшиком=ЕстьСоглашения();  
	КонецЕсли;
	Если Не 
		ЗначениеЗаполнено(Соглашение) и КоличествоСоглашенийСПоставшиком > 0 Тогда
		ТекстОшибки = НСтр("ru='Не выбрано соглашение'");  			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"Соглашение",
		,
		Отказ);
	КонецЕсли;
	//- Лико m.shenderov 17.05.2020  

КонецПроцедуры
