
&Вместо("ЗаполнитьТабличныйДокументМБ7")
Процедура Лико_ЗаполнитьТабличныйДокументМБ7(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати) // --> Маковеева А.Ю. 03.07.2024
	
	ШаблонОшибкиПустойТЧ = НСтр("ru = 'В документе %1 отсутствуют товары. Печать МБ-7 не требуется';
								|en = 'No goods in the %1 document. MB-7 print is not required'");
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФормТМЦВЭксплуатации.ПФ_MXL_МБ7_ru");
	Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	ВыборкаДокументы = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаСтрокиПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВыборкаСтрокиПоДокументам.Сбросить();
		Если Не ВыборкаСтрокиПоДокументам.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументы.Ссылка)) Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибкиПустойТЧ,
					ВыборкаДокументы.Ссылка),
				ВыборкаДокументы.Ссылка);
			
			Продолжить;
			
		КонецЕсли;
		
		ВыборкаСтроки = ВыборкаСтрокиПоДокументам.Выбрать();
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументы);
		ОбластьШапка.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументы.Номер);
		
		ОбластьШапка.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(
			ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.ДатаДокумента));
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Пока ВыборкаСтроки.Следующий() Цикл
			
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаСтроки);
			Если ЗначениеЗаполнено(ВыборкаСтроки.ХарактеристикаНаименование) Тогда
				НоменклатураНаименование = СтрШаблон("%1 (%2)",ВыборкаСтроки.НоменклатураНаименование,ВыборкаСтроки.ХарактеристикаНаименование);
				ОбластьСтрокаТаблицы.Параметры.НоменклатураНаименование = НоменклатураНаименование;
			КонецЕсли;                   
			
			// --> Маковеева А.Ю. 03.07.2024
			ОбластьСтрокаТаблицы.Параметры.ТабельныйНомер = Лико_Дополнительно.ТабельныйНомерФизЛица(ВыборкаСтроки.Сотрудник, ВыборкаДокументы.Организация);
			// <-- Маковеева А.Ю. 03.07.2024
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			
		КонецЦикла;
		
		ОбластьПодписи.Параметры.Заполнить(ВыборкаДокументы);
		ОбластьПодписи.Параметры.МОЛФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДокументы.МОЛФИО);
		Сотрудник = СотрудникиФормы.СотрудникиФизическогоЛица(ВыборкаДокументы.РуководительПодразделения, ВыборкаДокументы.Организация);
		ТаблицаПоРабочимМестам = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, Сотрудник, "Должность", ВыборкаДокументы.ДатаДокумента);
		Если ТаблицаПоРабочимМестам.Количество() > 0 Тогда
			ОбластьПодписи.Параметры.ДолжностьРуководителяПодразделения = ТаблицаПоРабочимМестам[0].Должность;
		КонецЕсли;
		ОбластьПодписи.Параметры.РуководительПодразделения = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДокументы.РуководительПодразделения);
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры // <-- Маковеева А.Ю. 03.07.2024
