
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("Лико_ИзменениеПараметровВырубкиПечати") ИЛИ РольДоступна("ПолныеПрава") И ЭтаФорма.Элементы.Найти("ГруппаШтамп1") <> Неопределено Тогда 
		Команда = ЭтаФорма.Команды.Добавить("Лико_РедактироватьПараметрыШтампов");
		Команда.Заголовок = "Редактировать параметры штампов";
		Команда.Действие = "Лико_РедактироватьПараметрыШтампов";

		Элемент = ЭтаФорма.Элементы.Вставить("Лико_РедактироватьПараметрыШтампов", Тип("ДекорацияФормы"), ЭтаФорма.Элементы.ГруппаПараметрыШтампа,ЭтаФорма.Элементы.ГруппаШтамп1);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Гиперссылка = Истина;
		Элемент.Заголовок = "Редактировать параметры";
		Элемент.Шрифт = Новый Шрифт(,11);
		Элемент.ЦветТекста = WebЦвета.ТемноСерый;
		Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;  
		Элемент.УстановитьДействие("Нажатие", "Лико_РедактироватьПараметрыШтампов");
		//Элемент.ИмяКоманды = "Лико_РедактироватьПараметрыШтампов";
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда 
		Элементы.ВидВырубки.Видимость = Ложь;
	КонецЕсли;	
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Менеджер = Пользователи.ТекущийПользователь();
		Объект.Дата = ТекущаяДата();                                                                                                                
	КонецЕсли;	
	НомерВарианта = 1;
	//Элементы.Цвета.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерВарианта", НомерВарианта); 

	Для каждого стр из Объект.Товары Цикл
		Если ЗначениеЗаполнено(стр.цена) И ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
			ТекПроцентНДС = стр.СтавкаНДС.Ставка;
			стр.ЦенаБезНДС = стр.цена/(1+ТекПроцентНДС/100);
		КонецЕсли;	
	КонецЦикла;	
	
	ЗаполнитьЦенуБезНДС();
	
	ПоказатьКодМатериала();
	Для каждого стр из Объект.ВидыРабот Цикл
		Если ЗначениеЗаполнено(стр.материал) Тогда 
			стр.кодматериала = стр.материал.Код;
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.клей) Тогда 
			стр.кодКлея = стр.клей.Код;
		КонецЕсли;	
	КонецЦикла;
	
	Объект.ТипРасчета = 2;
	
	// --> Начало Лико Субботин 23.05.2023 	 
	СоответствиеВС = Новый Соответствие;
	Для каждого стр из Объект.Цвета Цикл

		
		стрРаботы = Объект.ВидыРабот.найтистроки(новый структура("НомерПроката", стр.НомерПроката)); 
		Если стрРаботы.Количество() > 0 Тогда
			стр.Рабочийцентр = стрРаботы[0].РабочийЦентр;
		КонецЕсли;
		ОтображатьВТЧРаботы = ЗначениеРеквизита(стр.ВидСекции, "ОтображатьВТЧРаботы") ;
		Если  ОтображатьВТЧРаботы <> Неопределено Тогда
			Если ОтображатьВТЧРаботы  Тогда 
				Если СоответствиеВС.Получить(стр.ВидСекции) = Неопределено Тогда 
					стр.НомерРаботы = 1;
					СоответствиеНомерПроката = Новый Соответствие; 
					СоответствиеНомерПроката.Вставить(стр.номерпроката, 1);
					СоответствиеВС.Вставить(стр.ВидСекции,СоответствиеНомерПроката);
				Иначе 
					Если СоответствиеВС[стр.ВидСекции].Получить(стр.НомерПроката)= Неопределено Тогда 
						стр.НомерРаботы = 1; 
						СоответствиеНомерПроката = Новый Соответствие;
						СоответствиеНомерПроката.Вставить(стр.номерпроката, 1);
						СоответствиеВС.Вставить(стр.ВидСекции,СоответствиеНомерПроката);
					Иначе
						стр.НомерРаботы = СоответствиеВС[стр.ВидСекции][стр.номерпроката] +1;
						СоответствиеВС[стр.ВидСекции][стр.номерпроката] = стр.НомерРаботы;       
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
		
	КонецЦикла; 
	
   // <-- Конец Лико Субботин 23.05.2023 
   
   ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
   
   ЦветаРаботы(Истина);
   
   Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда
	   Элементы.ВариантыДопусков.КнопкаВыпадающегоСписка = Истина;
	   Если НЕ ЗначениеЗаполнено(Элементы.ВариантыДопусков.СписокВыбора) Тогда
		   Элементы.ВариантыДопусков.СписокВыбора.Добавить(1,"1 : 0"); 
		   Элементы.ВариантыДопусков.СписокВыбора.Добавить(2,"0,5 : 0,5");
		   Элементы.ВариантыДопусков.СписокВыбора.Добавить(3,"0 : 1");  
	   КонецЕсли;
   КонецЕсли;
   
   Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда
	   Если Объект.ДопускМинус = 1 И Объект.ДопускПлюс = 0 Тогда
		   ВариантыДопусков = 1;		
	   ИначеЕсли Объект.ДопускМинус = 0.5 И Объект.ДопускПлюс = 0.5 Тогда
		   ВариантыДопусков = 2;		
	   ИначеЕсли Объект.ДопускМинус = 0 И Объект.ДопускПлюс = 1 Тогда
		   ВариантыДопусков = 3;		
	   КонецЕсли;
   КонецЕсли;
   УстановитьВидимостьЭлементов();
   ЗаполнитьТипЗаливка(); 
   ЗаполнитьВидОснастка();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПоказатьВариант();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда 
		ЗаполнитьНаименованиеНаСервере();
	КонецЕсли;
	Для каждого Стр Из Объект.Цвета Цикл
		Если Стр.НомерВарианта = 1 Тогда
			Если Стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Книжка") Тогда
				Объект.КнижныйМодуль = Истина;
			Иначе
				Объект.КнижныйМодуль = Ложь;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.РабочийЦентр) Тогда 
				Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Стр.РабочийЦентр,"ВидРабочегоЦентра") = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") Тогда  
					Объект.Цифровой = Истина;
				Иначе	
					Объект.Цифровой = Ложь;
				КонецЕсли;			
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла; 
	
	// <-- Начало Лико Яцун С. В. 18.03.2024
	НоменклатураDatamatrix = Ложь;
	Для Каждого Стр из Объект.Товары Цикл
		Если Найти(НРег(Строка(Стр.Номенклатура)),"datamatrix") <> 0 Тогда
			НоменклатураDatamatrix = Истина;	
		КонецЕсли;
	КонецЦикла; 
	Если НоменклатураDatamatrix Тогда
		Объект.Datamatrix = Истина;
	Иначе
		Объект.Datamatrix = Ложь;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 18.03.2024 
	// <-- Начало Лико Яцун С. В. 28.10.2024 
	Если Объект.ЧестныйЗнак И НЕ Объект.ЧЗ И Объект.ШиринаЭтикетки <= 25 И Объект.ДлинаЭтикетки <= 25 Тогда
		НайденныеСтроки = Объект.Цвета.НайтиСтроки(Новый Структура("ВидТМЦ",ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска")));
		Если НайденныеСтроки.Количество() = 1 Тогда
			Объект.ЧЗ = Истина; 	
		КонецЕсли;
	ИначеЕсли Объект.ЧЗ Тогда
		НайденныеСтроки = Объект.Цвета.НайтиСтроки(Новый Структура("ВидТМЦ",ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска")));
		Если НЕ Объект.ЧестныйЗнак ИЛИ Объект.ШиринаЭтикетки > 25 ИЛИ Объект.ДлинаЭтикетки > 25 ИЛИ НайденныеСтроки.Количество() <> 1 Тогда
			Объект.ЧЗ = Ложь; 	
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 28.10.2024
	
	РасчитатьТиражМетраж(Объект.ВидВырубки);
	ЗаписатьЦветаВРаботы();
	
КонецПроцедуры

 &НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЭтаФорма.Прочитать();
	
	ПоказатьКодМатериала();
	Для каждого стр из Объект.Товары Цикл
		Если ЗначениеЗаполнено(стр.цена) И ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
			ТекПроцентНДС =  ЗначениеРеквизита(стр.СтавкаНДС, "Ставка");

			стр.ЦенаБезНДС = стр.цена/(1+ТекПроцентНДС/100);
		КонецЕсли;	
	КонецЦикла;	
	ЗаполнитьЦенуБезНДС();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// --> Начало Лико Субботин 23.05.2023 	
	Для каждого стр из ТекущийОбъект.Цвета Цикл

		
		стрРаботы = Объект.ВидыРабот.найтистроки(новый структура("НомерПроката", стр.НомерПроката)); 
		Если стрРаботы.Количество() > 0 Тогда
			стр.Рабочийцентр = стрРаботы[0].РабочийЦентр;
		КонецЕсли;

		
	КонецЦикла; 
	
   // <-- Конец Лико Субботин 23.05.2023 КонецПроцедуры

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьТипЗаливка(); 
	ЗаполнитьВидОснастка();
	ДобавитьУсловноеОформлениеЦветаВидОснастка();
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ЗаписатьЦветаВРаботы()   
	
	Объект.ВидыРабот.Очистить();
	
	Для каждого стр Из объект.Цвета Цикл 
		ВидРабот =   ЗначениеРеквизита(стр.ВидСекции, "ВидРабот");
		Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское")  Тогда 
			Если стр.направлениепротяжки = ПредопределенноеЗначение("Перечисление.Лико_НаправленияПротяжки.Поперечное") Тогда 
				ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное");
			Иначе
				ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное");
			КонецЕсли;
		КонецЕсли;
		
		Отбор = Новый Структура("ВидРабот", ВидРабот); 
		Отбор.Вставить("НомерПроката", стр.НомерПроката);  
		Отбор.Вставить( "НомерРаботы", стр.НомерРаботы);
		Отбор.Вставить( "НомерВарианта", стр.НомерВарианта);
		
		строкиРабот = Объект.ВидыРабот.НайтиСтроки(Отбор);
		Если строкиРабот.Количество() = 0 Тогда    
			стрработа = Объект.ВидыРабот.Добавить();
			ЗаполнитьЗначенияСвойств(стрработа, стр);
			Если Не ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Печать") Тогда 
				стрработа.Клей = стр.типкраски;  
			КонецЕсли;
			стрработа.видработ = видработ;
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор")  Тогда 
				стрработа.дополнительно = стр.количестворучьевнумератора;
			Иначе
				стрработа.дополнительно = стр.подача;    
			Конецесли;
			//стрработа.подача = стр.подачафакт;                                 
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Инкджет") Тогда 
				стрработа.расходкраски = объект.расходкраски;       
			КонецЕсли;  
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда 
				стрработа.клей = ЗначениеРеквизита(объект.Праймер, "ЦеноваяГруппа");      
			КонецЕсли;  
		КонецЕсли;
	КонецЦикла;
	
	ПроставитьВидВырубкиНаСервере() ;
	
	//ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьЦенуБезНДС()
	Для каждого стр из Объект.Стоимость Цикл
		Если ЗначениеЗаполнено(стр.цена) И ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
			ТекПроцентНДС = стр.СтавкаНДС.Ставка;
			стр.ЦенаБезНДС = стр.цена/(1+ТекПроцентНДС/100);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	


&НаСервереБезКонтекста
Функция ЗначениеРеквизита(Объект,ИмяРеквизита)
	Если ЗначениеЗаполнено(Объект) Тогда 
 		Возврат Объект[ИмяРеквизита];
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура РассчитатьНаСервере(Спецификация, Отказ= Истина)
	Лико_Планирование.РассчитатьСебестоимость_НормативыСпецификации(Спецификация, Отказ);
	Прочитать();
	ЗаполнитьЦенуБезНДС();
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда
		Для каждого Стр Из Объект.Стоимость Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Вес) И ЗначениеЗаполнено(Стр.Количество) Тогда
				ПересчитатьКоличествоВесНаСервере(Стр.ПолучитьИдентификатор(),"СтоимостьКоличество");
			ИначеЕсли ЗначениеЗаполнено(Стр.Вес) И ЗначениеЗаполнено(Стр.Количество) И ЗначениеЗаполнено(Стр.Стоимость) Тогда
				Стр.Стоимость1Кг = Стр.Стоимость/стр.Вес
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьТиражНаСервере(ПогонныйМетраж, ЭтикетокНаЛисте,ШагПечати, Z)
	Тираж = Лико_Планирование.РассчитатьТираж(ПогонныйМетраж,ЭтикетокНаЛисте,Z, ШагПечати );
	Возврат Тираж;
КонецФункции	

&НаСервере
Процедура	ЗаполнитьНаименованиеНаСервере();
	Таб = Объект.Товары.Выгрузить();
	Таб.Свернуть("Номенклатура");
	Объект.Наименование = "";
	Для каждого стр из Таб Цикл
		 Объект.Наименование = Объект.Наименование+?(ЗначениеЗаполнено(Объект.Наименование), ", ", "")+СокрЛП(стр.Номенклатура.Наименование);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВариантПоЗаказуНаСервере(Док)
	
	Объект.Цвета.Очистить();
	Объект.ВидыРабот.Очистить();
	
	Для каждого стрЦвета Из Док.Цвета Цикл
		НоваяСтрЦвета =  Объект.Цвета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрЦвета, стрЦвета);
		НоваяСтрЦвета.КлючСтроки = Новый УникальныйИдентификатор;
		СтрокиФорм = Док.Формы.НайтиСтроки(Новый Структура("КлючСтроки", СтрЦвета.КлючСтроки)) ;
		Для Каждого стрФорм из СтрокиФорм Цикл
			новаястрформ = Объект.Формы.добавить();
			ЗаполнитьЗначенияСвойств(новаястрформ, стрформ);
			новаястрформ.КлючСтроки = НоваяСтрЦвета.ключстроки;
		КонецЦикла;
		
	КонецЦикла;
	Для каждого стрРаботы Из Док.ВидыРабот Цикл
		НоваяСтрРаботы = Объект.ВидыРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрРаботы, стрРаботы);
		НоваяСтрРаботы.КлючСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Объект, Док, "ШиринаЭтикетки,ДлинаЭтикетки,ЭтМЭР,Нарезка,ПлощадьКлише,ДопускМинус,ДопускПлюс,Раппорт,ШтампВырубной,
	|Ручьи,ЭтикетокНаЛисте,ШагПечати,Z,РучьиПечати,ЭтикетокНаЛистеПечати,ДлинаПечати,КоличествоЭтПоДлинеПечати,
	|КоличествоЛистовКнижки,КоличествоКликов,РучьиПечатиИндиго,ЭтикетокНаЛистеИндиго,ДлинаПечатиИндиго,
	|КоличествоЭтПоДлинеПечатиИндиго,КоличествоШтамповПоДлинеПечатиИндиго,ВидВырубки,РабочийЦентр,Книжка,КнижныйМодуль,Цифровой");
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
	ЗаполнитьТипЗаливка(); 
	ЗаполнитьВидОснастка();
	ДобавитьУсловноеОформлениеЦветаВидОснастка();
											
КонецПроцедуры

&НаСервере
Процедура ПоказатьКодМатериала()
	Если ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда 
		Если ТипЗнч(Объект.ОсновнойМатериал)=Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
			ЭтаФорма.НадписьКодМатериала = Объект.ОсновнойМатериал.Код;
		ИначеЕсли ТипЗнч(Объект.ОсновнойМатериал)=Тип("СправочникСсылка.Номенклатура") Тогда
			Если ЗначениеЗаполнено(Объект.ОсновнойМатериал.ЦеноваяГруппа) Тогда
				ЭтаФорма.НадписьКодМатериала =  Объект.Основнойматериал.ЦеноваяГруппа.Код;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЭтаФорма.НадписьКодМатериала = "";
	КонецЕсли;
	Для каждого стр из Объект.ВидыРабот Цикл
		Если ЗначениеЗаполнено(стр.Материал) Тогда 
			стр.кодматериала = стр.материал.Код;
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Клей) Тогда 
			стр.кодКлея = стр.клей.Код;
		КонецЕсли;	
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиПоКлючу(КлючСтроки, ИмяТЧ, ИмяКолонки="КлючСтроки")  
	МассивСтрок =Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяКолонки,  КлючСтроки));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект[ИмяТЧ].Удалить(ЭлементМассива);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьФормуНаСервере(Текст)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Формы.Ссылка  
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|ГДЕ
	|	Лико_Формы.Код = &Код";
	Запрос.УстановитьПараметр("Код",Текст);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.ссылка) Тогда
		Возврат Результат.ссылка;
	Иначе Возврат Справочники.Лико_Формы.ПустаяСсылка();
	КонецЕсли;

КонецФункции	

&НаСервере
Функция ПолучитьРЦПоНомеруНаСервере(ПорядковыйНомер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РабочиеЦентры.Ссылка, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РЦ
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ПорядковыйНомер = &ПорядковыйНомер";
	Запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.РЦ) Тогда
		Возврат Результат.РЦ
	Иначе
		Возврат Справочники.РабочиеЦентры.ПустаяСсылка();
	КонецЕсли;
КонецФункции



//Варианты
&НаСервере
Функция ПолучитьНомерПервойИПоследнейСтрокиВТЧСОтбором(НомерВарианта, Цвета)
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Лико_СпецификацииЦвета.НомерВарианта КАК НомерВарианта,
	 |	МИНИМУМ(Лико_СпецификацииЦвета.НомерСтроки) КАК НомерСтрокиПервая,
	 |	МАКСИМУМ(Лико_СпецификацииЦвета.НомерСтроки) КАК НомерСтрокиПоследняя
	 |ИЗ
	 |	Справочник.Лико_Спецификации.Цвета КАК Лико_СпецификацииЦвета
	 |ГДЕ
	 |	Лико_СпецификацииЦвета.НомерВарианта = &НомерВарианта
	 |	И Лико_СпецификацииЦвета.Ссылка = &Спецификация
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Лико_СпецификацииЦвета.НомерВарианта
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	НомерСтрокиПервая";
	 
	 Если Не Цвета Тогда 
		 Запрос.Текст = СтрЗаменить(Запрос.Текст, "Цвета", "ВидыРабот");
	 КонецЕсли;
	 
	 Запрос.УстановитьПараметр("НомерВарианта",НомерВарианта);
	 Запрос.УстановитьПараметр("Спецификация",Объект.Ссылка); 
	 Результат = Запрос.Выполнить().Выгрузить();
	 Если Результат.Количество()> 0 Тогда
		 НомераСтрок = Новый Соответствие;
		 НомераСтрок.Вставить("НомерПервойСтроки", Результат[0].НомерСтрокиПервая);
		 НомераСтрок.Вставить("НомерПоследнейСтроки", Результат[0].НомерСтрокиПоследняя);
		 
		 Возврат НомераСтрок
	 Иначе
		 Возврат Неопределено;
	 КонецЕсли;
КонецФункции

//Основной материал
&НаКлиенте
Процедура ОсновнойМатериалПриИзменении(Элемент)
	ПоказатьКодМатериала();
КонецПроцедуры


//Цвета
&НаКлиенте
Процедура ЦветаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;	
	Если НоваяСтрока Тогда 
		Элемент.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.номерпроката) Тогда
			Элемент.ТекущиеДанные.номерпроката =1; 
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.НомерРаботы) Тогда
			Элемент.ТекущиеДанные.НомерРаботы =1;
		КонецЕсли;
		Элемент.ТекущиеДанные.НомерВарианта = 1; 
	КонецЕсли;
	Если Копирование И ТекущиеДанные.ВидСекции <> ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда
		ТекущиеДанные.Форма = Неопределено;
	КонецЕсли;
	Если Копирование Тогда
		ДобавитьУсловноеОформлениеЦветаВидОснастка();
		ДобавитьУсловноеОформлениеЦветаВалФорма();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	УдалитьСтрокиПоКлючу(ТекущиеДанные.КлючСтроки, "Формы");  
	ЗаписатьЦветаВРаботы();   
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипКраскиПриИзменении(Элемент)
	
	текстр = Элементы.Цвета.ТекущиеДанные; 
	
	Если ЗначениеЗаполнено(текстр.типкраски) Тогда  

			
		Если ЗначениеРеквизита(текстр.ТипКраски, "Лико_ВидТМЦ") <> текстр.ВидТМЦ Тогда 
			Сообщить("Выбранный тип не соответствует указанному Виду ТМЦ"); 
			текстр.типкраски = Неопределено;   
			Возврат ;
		КонецЕсли;
		
		Если Не ПроверитьСоответствиеЦеновойГруппыВидуСекции(текстр.ТипКраски,текстр.ВидСекции, Объект.Площадка,текстр.ТипЦвета1) Тогда 
            Сообщить("Выбранный тип не соответствует Виду работ или типу цвета (для краски)"); 
			текстр.типкраски = Неопределено; 
			Возврат ;
		КонецЕсли;

			
		
		ВидПечати = ЗначениеРеквизита(текстр.ВидСекции, "ВидПечати");
		Если (ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Глубокая") ИЛИ ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Бессольвент")) И Объект.Площадка = ГлЛико_Площадки.ИксПак ТОгда
			текстр.Грамматура = ЗначениеРеквизита(текстр.типкраски, "КоэффициентКраскоПереноса");
            ЗаполнитьФормулуПантона(ТекСтр);	
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Если  ЗначениеРеквизита(текстр.Номенклатура, "ЦеноваяГруппа") <> текстр.ТипКраски Тогда 
		текстр.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПроверитьСоответствиеЦеновойГруппыВидуСекции(ЦГ, ВидСекции, Площадка, ТипЦвета);    
	Запрос = Новый  Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеновыеГруппыЛико_ВидыСекций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦеновыеГруппы.Лико_ВидыСекций КАК ЦеновыеГруппыЛико_ВидыСекций
	|ГДЕ
	|	ЦеновыеГруппыЛико_ВидыСекций.Ссылка = &ЦГ
	|	И ЦеновыеГруппыЛико_ВидыСекций.ВидСекции = &ВидСекции
	|	И ВЫБОР
	|			КОГДА ЦеновыеГруппыЛико_ВидыСекций.Площадка = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЦеновыеГруппыЛико_ВидыСекций.Площадка = &Площадка
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ЦеновыеГруппыЛико_ВидыСекций.Ссылка.Лико_ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
	|				ТОГДА ЦеновыеГруппыЛико_ВидыСекций.ТипЦвета = &ТипЦвета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";  
	Запрос.УстановитьПараметр("ЦГ", ЦГ);
	Запрос.УстановитьПараметр("ВидСекции", ВидСекции);
	Запрос.УстановитьПараметр("Площадка", Площадка.Организация);
	Запрос.УстановитьПараметр("ТипЦвета", ТипЦвета);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;   
	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьФормулуПантона(ТД) //+Лико m.shenderov 24.08.2021
	
	СтруктураПантона = ПолучитьСтруктуруПантонаСервер(Объект.Площадка,ТД.ТипКраски);	
	ТД.ФормулаПантона= СтруктураПантона.ФормулаПантона;
	ТД.Номенклатура  = СтруктураПантона.Номенклатура;
	
КонецПроцедуры //-Лико m.shenderov 24.08.2021

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПантонаСервер(Площадка,ЦеноваяГруппа) //+Лико m.shenderov 24.08.2021
	Структура = Новый Структура;
	Структура.Вставить("ФормулаПантона");
	Структура.Вставить("Номенклатура");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ФормулыПантонов.Ссылка КАК ФормулаПантона,
	|	Лико_ФормулыПантонов.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.Лико_ФормулыПантонов КАК Лико_ФормулыПантонов
	|ГДЕ
	|	Лико_ФормулыПантонов.Площадка = &Площадка
	|	И Лико_ФормулыПантонов.ЦеноваяГруппа = &ЦеноваяГруппа";
	Запрос.УстановитьПараметр("ЦеноваяГруппа",ЦеноваяГруппа );
	Запрос.УстановитьПараметр("Площадка",Площадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.08.2021


&НаКлиенте
Процедура ЦветаФормаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеФорм", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.Лико_Формы"));
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор форм'"));
	Массив= Новый Массив;
	НайденныеСтроки = Объект.Формы.НайтиСтроки(Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки));
	Для каждого стр из НайденныеСтроки Цикл
		Массив.Добавить(стр.Значение);
	КонецЦикла;	
	ПараметрыФормы.Вставить("Значения", Массив);
	ОткрытьФорму("ОбщаяФорма.РедактированиеСпискаЗначений", ПараметрыФормы , , , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФорм(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;	
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	УдалитьСтрокиПоКлючу(ТекущиеДанные.КлючСтроки, "Формы");
	Если Результат.Количество() > 0 Тогда
		ТекущиеДанные.Форма = результат[0];
		Для каждого элемент из результат Цикл
			стр = Объект.Формы.Добавить();
			стр.Значение =  Элемент;
			стр.КлючСтроки = ТекущиеДанные.КлючСтроки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаОчистка(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	УдалитьСтрокиПоКлючу(ТекущиеДанные.КлючСтроки, "Формы");
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено("Текст") Тогда 
		СпрФорма = ПолучитьФормуНаСервере(Текст);
		Если ЗначениеЗаполнено(СпрФорма) Тогда 
			УдалитьСтрокиПоКлючу(ТекущиеДанные.КлючСтроки, "Формы");
			стр = Объект.Формы.Добавить();
			стр.Значение = СпрФорма;
			стр.КлючСтроки = ТекущиеДанные.КлючСтроки;
			текущиеДанные.Форма = СпрФорма;
			ДобавитьУсловноеОформлениеЦветаВалФорма();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


//ВидыРабот
&НаКлиенте
Процедура ВидыРаботПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		Элемент.ТекущиеДанные.НомерВарианта = НомерВарианта;
		Элемент.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
		Элемент.ТекущиеДанные.номерпроката =1;
		//Элементы.ВидыРабот.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерВарианта", НомерВарианта); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Текстр = Элементы.ВидыРабот.ТекущиеДанные;
 	Текстр.КодМатериала = ЗначениеРеквизита(Текстр.Материал,"Код");
	Текстр.КодКлея = ЗначениеРеквизита(Текстр.Клей,"Код");
	
	ПроставитьВидВырубкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроставитьВидВырубкиНаСервере()  	// --> Начало Лико Митюшин МФМ 31.05.2021
	
	ПроставитьВидВырубки(Объект,,Истина);

КонецПроцедуры  	// <-- Конец Лико Митюшин МФМ 31.05.2021

&НаКлиенте
Процедура ВидыРаботПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.ВидыРабот.ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботМатериалПриИзменении(Элемент)
	Текстр = Элементы.ВидыРабот.ТекущиеДанные;
 	Текстр.КодМатериала = ЗначениеРеквизита(Текстр.Материал,"Код");
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботКлейПриИзменении(Элемент)
	Текстр = Элементы.ВидыРабот.ТекущиеДанные;
 	Текстр.КодКлея = ЗначениеРеквизита(Текстр.Клей,"Код");
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	Отказ = Истина;
	Если ЭтаФорма.Модифицированность Тогда
		Записать();
	КонецЕсли;

	РассчитатьНаСервере(Объект.Ссылка, Отказ);
	Если Отказ Тогда 
		Сообщить("Заказ не рассчитан!")
	Иначе
		//ПоказатьДоходностьРентабельность();
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботРабочийЦентрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ТекущиеДанные = Элементы.ВидыРабот.ТекущиеДанные;
	//ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеРабочихЦентров", ЭтотОбъект);
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры"));
	//ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор машин'"));
	//Массив= Новый Массив;
	//НайденныеСтроки = Объект.Машины.НайтиСтроки(Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки));
	//Для каждого стр из НайденныеСтроки Цикл
	//	Массив.Добавить(стр.Значение);
	//КонецЦикла;	
	//ПараметрыФормы.Вставить("Значения", Массив);
	//ОткрытьФорму("ОбщаяФорма.РедактированиеСпискаЗначений", ПараметрыФормы , , , , , ОписаниеОповещения);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСтоимостиНаСервере()
	
	Объект.Стоимость.Очистить();
	Объект.Нормативы.Очистить();

       	нстр = Объект.стоимость.Добавить();
		нстр.ключстроки = Новый УникальныйИдентификатор;
		нстр.НомерВарианта = 1;	
        нстр.РабочийЦентр =  Объект.РабочийЦентр;
        нстр.количество = Объект.Товары.Итог("Количество");
		нстр.Вес = Объект.Товары.Итог("Вес");
		ВыполнитьрасчетТиражМетраж(нстр,Объект.ВидВырубки);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыСтоимости(Команда)
	Если ЭтаФорма.Модифицированность Тогда		
		Сообщить("Необходимо записать спецификацию");
		Возврат;
	КонецЕсли;
	ЗаполнитьПараметрыСтоимостиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьЗаданнаяЦенаПриИзменении(Элемент)
	Стр = Элементы.Стоимость.ТекущиеДанные;
    Стр.Стоимость = Стр.Цена*Стр.Количество;
	Если ЗначениеЗаполнено(Стр.КвадратныйМетраж) Тогда 
		Стр.ЦенаКВМ = Стр.Стоимость/Стр.КвадратныйМетраж;
	КонецЕсли;
	Если ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
		УстановитьЦенуБезНДС(стр.ПолучитьИдентификатор(),"Стоимость" );
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьСтавкаНДСПриИзменении(Элемент)
	Стр = Элементы.Стоимость.ТекущиеДанные;
	Если ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
		УстановитьЦенуБезНДС(стр.ПолучитьИдентификатор(),"Стоимость" );
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура СтоимостьЦенаБезНДСПриИзменении(Элемент)
	стр = Элементы.Стоимость.ТекущиеДанные;
	Если ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
		УстановитьЦенуСНДС(стр.ПолучитьИдентификатор(), "Стоимость");
	КонецЕсли;
  	Стр.Стоимость = Стр.Цена*Стр.Количество;
	Если ЗначениеЗаполнено(Стр.КвадратныйМетраж) Тогда 
		Стр.ЦенаКВМ = Стр.Стоимость/Стр.КвадратныйМетраж;
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СтоимостьЦенаКвМПриИзменении(Элемент)
	Стр = Элементы.Стоимость.ТекущиеДанные;
    Стр.Стоимость = Стр.ЦенаКвМ*Стр.КвадратныйМетраж;
	Если ЗначениеЗаполнено(Стр.Количество) Тогда 
		Стр.Цена = Стр.Стоимость/Стр.Количество;
	КонецЕсли;
	Если ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
		УстановитьЦенуБезНДС(стр.ПолучитьИдентификатор(),"Стоимость" );
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтоимостьКоличествоПриИзменении(Элемент)
	
	Стр = Элементы.Стоимость.ТекущиеДанные;
	Стр.Стоимость = Стр.Цена*Стр.Количество;
	ИДСтр = Стр.ПолучитьИдентификатор();
	ТекВидВырубки = Объект.ВидВырубки;
	Имя = Элемент.Имя;
	ВыполнитьрасчетТиражМетраж(ИДСтр,ТекВидВырубки,Имя);
	
	ПересчитатьКоличествоВесНаСервере(ИДСтр,Имя);

КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПогонныйМетражПриИзменении(Элемент)
	Стр = Элементы.Стоимость.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Нарезка) Тогда 
		//стр.Количество = Лико_ТиражМетраж.РассчитатьТираж(Стр.ПогонныйМетраж, ПараметрыШтампа.Нарезка, Стр.ШтКВМ);
		стр.КвадратныйМетраж =стр.погонныйметраж*ЗначениеРеквизита(Объект.Нарезка, "Размер")/1000; 
	КонецЕсли;
	Стр.Стоимость = Стр.Цена*Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьКвадратныйМетражПриИзменении(Элемент)
	Стр = Элементы.Стоимость.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Нарезка) Тогда 
		стр.ПогонныйМетраж =стр.квадратныйметраж/ЗначениеРеквизита(Объект.Нарезка, "Размер")*1000; 
		//стр.Количество = Лико_ТиражМетраж.РассчитатьТираж(Стр.ПогонныйМетраж, ПараметрыШтампа.Нарезка, Стр.ШтКВМ);
		Стр.Стоимость = Стр.Цена*Стр.Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		КлючСтроки = Новый УникальныйИдентификатор;
		Элемент.ТекущиеДанные.КлючСтроки = КлючСтроки;
		Элементы.Нормативы.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки",КлючСтроки ); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.Стоимость.ТекущиеДанные;
	УдалитьСтрокиПоКлючу(ТекущиеДанные.КлючСтроки, "Нормативы")  
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПриАктивизацииСтроки(Элемент)
	стр = Элементы.Стоимость.ТекущиеДанные;
	Если стр<>Неопределено Тогда 
		КлючСтроки =стр.КлючСтроки;
		Элементы.Нормативы.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", КлючСтроки); 
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантПОЗаказуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВариантПОЗаказу(Команда)	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗаказаДляПовтора", ЭтотОбъект);
	ПоказатьВводЗначения(ОписаниеОповещения, Неопределено,"Выберите заказ" , Тип("ДокументСсылка.ЗаказКлиента"));
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗаказаДляПовтора(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		ДобавитьВариантПоЗаказуНаСервере(ВыбЗнач); 
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование(Команда)
	ЗаполнитьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоличествоКликовНаСервере()
	Объект.КоличествоКликов = Лико_Планирование.УстановитьЧислоКликов(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКликов(Команда)
	КоличествоКликовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПеремоткуНаСервере()
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	Иначе
		Объект.Перемотка.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаТовары.Ссылка.Партнер КАК Партнер,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Направление КАК Направление,
		|	ТаблицаТовары.МаксимальныйДиаметрРулона КАК МаксимальныйДиаметрРулона,
		|	ТаблицаТовары.ВнутреннийДиаметр КАК ВнутреннийДиаметр,
		|	ТаблицаТовары.ПродольнаяРезка КАК ПродольнаяРезка,
		|	ТаблицаТовары.ПоперечнаяРезка КАК ПоперечнаяРезка,
		|	ТаблицаТовары.Кромка КАК Кромка,
		|	ТаблицаТовары.ПодрезкаКромки КАК ПодрезкаКромки,
		|	ТаблицаТовары.Город КАК Город,
		|	Лико_Перемотка.Ссылка КАК Перемотка,
		|	ТаблицаТовары.КоличествоЭтикетокВРолике КАК КоличествоЭтикетокВРолике
		|ИЗ
		|	Справочник.Лико_Спецификации.Товары КАК ТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Перемотка КАК Лико_Перемотка
		|		ПО ТаблицаТовары.Ссылка.Партнер = Лико_Перемотка.Партнер
		|			И ТаблицаТовары.Номенклатура = Лико_Перемотка.Номенклатура
		|			И ТаблицаТовары.Направление = Лико_Перемотка.Направление
		|			И ТаблицаТовары.МаксимальныйДиаметрРулона = Лико_Перемотка.МаксимальныйДиаметрРулона
		|			И ТаблицаТовары.ВнутреннийДиаметр = Лико_Перемотка.ВнутреннийДиаметр
		|			И ТаблицаТовары.КоличествоЭтикетокВРолике = Лико_Перемотка.КоличествоЭтикетокВРолике
		|			И ТаблицаТовары.ПродольнаяРезка = Лико_Перемотка.ПродольнаяРезка
		|			И ТаблицаТовары.ПоперечнаяРезка = Лико_Перемотка.ПоперечнаяРезка
		|			И ТаблицаТовары.Кромка = Лико_Перемотка.Кромка
		|			И ТаблицаТовары.ПодрезкаКромки = Лико_Перемотка.ПодрезкаКромки
		|			И ТаблицаТовары.Город = Лико_Перемотка.Город
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Заказ";
		Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Перемотка) Тогда 
				СпрОбъект = Справочники.Лико_Перемотка.СоздатьЭлемент();
				СпрОбъект.Партнер 					= Выборка.Партнер;
				СпрОбъект.Номенклатура				= Выборка.Номенклатура;
				СпрОбъект.Направление				= Выборка.Направление;
				СпрОбъект.МаксимальныйДиаметрРулона	= Выборка.МаксимальныйДиаметрРулона;
				СпрОбъект.ВнутреннийДиаметр			= Выборка.ВнутреннийДиаметр;
				СпрОбъект.КоличествоЭтикетокВРолике = Выборка.КоличествоЭтикетокВРОлике;
				СпрОбъект.ПродольнаяРезка 			= Выборка.ПродольнаяРезка;
				СпрОбъект.ПоперечнаяРезка 			= Выборка.ПоперечнаяРезка;
				СпрОбъект.Кромка 					= Выборка.Кромка;
				СпрОбъект.ПодрезкаКромки 			= Выборка.ПодрезкаКромки;
				СпрОбъект.Город 					= Выборка.Город;
				СпрОбъект.Записать();
				спрПеремотка = СпрОбъект.Ссылка;
			Иначе
				СпрПеремотка = Выборка.Перемотка;
			КонецЕсли;
			//Отбор = Новый Структура("Наименование", спрПеремотка);
			//МассивСтрок = Объект.Перемотка.НайтиСтроки(Отбор);
			//Если МассивСтрок.количество()=0 Тогда 
				стр = Объект.Перемотка.Добавить();
				стр.наименование = спрперемотка;
			//КонецЕсли;
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПеремотку(Команда)
	ЗаполнитьПеремоткуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНамоткуНаСервере(Идентификатор);
	стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	ЗаполнитьЗначенияСвойств(стр, стр.перемотка, , "Номенклатура");
Конецпроцедуры

&НаКлиенте
Процедура ТоварыПеремоткаПриИзменении(Элемент)
	текстр = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.перемотка) ТОгда 
		ЗаполнитьНамоткуНаСервере(текстр.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПеремоткаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	стр = Элементы.ТОвары.ТекущиеДанные;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Партнер",Объект.Партнер);
	//Если ЗначениеЗаполнено(стр.Номенклатура) Тогда 
	//	ДопПараметры.Вставить("Номенклатура", стр.Номенклатура);
	//КонецЕсли;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПОслеВыбораНамотки", ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_Перемотка.Форма.ФормаВыбора", ДопПараметры, ЭтаФорма, ,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПОслеВыбораНамотки(Результат, Параметры) Экспорт
	Если Результат<>Неопределено Тогда 
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_Перемотка") ТОгда 
			текстр = Элементы.Товары.ТекущиеДанные;
			Если Текстр<>Неопределено Тогда 
				текстр.перемотка = результат;
				ЗаполнитьНамоткуНаСервере(текстр.ПолучитьИдентификатор());
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботОснасткаПриИзменении(Элемент)
	текстр = Элементы.ВидыРабот.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.Оснастка) Тогда 
		ДопПараметры =  текстр.Оснастка;
		Если ЗначениеЗаполнено(Текстр.ВидРабот) Тогда 
			Если текстр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Вырубка") Тогда 
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииПараметровШтампа", ЭтаФорма, ДопПараметры);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить параметры основного вырубного штампа?'"), Режим,0);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаполненииПараметровШтампа(Результат, ДопПараметры)  Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЗаполнитьПараметрыШтампа(ДопПараметры); 
		РасчитатьТиражМетраж(Объект.ВидВырубки); 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыШтампа(Оснастка)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Номенклатура,
	|	Лико_ПараметрыШтампа.ТипШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка,
	|	Лико_ПараметрыШтампа.ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи,
	|	Лико_ПараметрыШтампа.Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.Цена,
	|	Лико_ПараметрыШтампа.Артикул
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Оснастка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.ШтампВырубной = Оснастка;
		Объект.ЭтикетокНаЛисте = Выборка.ЭтикетокНаЛисте;
		Объект.Нарезка = Выборка.Нарезка;
		Объект.Ручьи = Выборка.Ручьи;
		Объект.Z = Выборка.Z;
		Объект.ДлинаЭтикетки = Выборка.ДлинаЭтикетки;
		Объект.ШиринаЭтикетки = Выборка.ШиринаЭтикетки;
		Объект.ШагПечати = Выборка.ШагПечати;
		// --> Начало Лико Митюшин МФМ 07.04.2021
		//Автоматическая замена ручьёв Печати при изменение параметров Штампа
		Объект.РучьиПечати = Выборка.Ручьи;
		// <-- Конец Лико Митюшин МФМ  07.04.2021
	КонецЦикла;	
	// --> Начало Лико Митюшин МФМ 31.03.2021
	ПроставитьВидВырубки(Объект,,Ложь);
	текВидВырубки = Объект.ВидВырубки;
	Лико_ТиражМетраж.ОчиститьНеИспользуемыПараметрыШтампа(Объект ,текВидВырубки);	
	
	Если текВидВырубки = 1 ИЛИ текВидВырубки = 2 ИЛИ текВидВырубки = 4 ИЛИ текВидВырубки = 7 ИЛИ текВидВырубки = 8 ИЛИ текВидВырубки = 10 Тогда  
		ТекКоэфДеления = ?(Лико_ТиражМетраж.ЭтоКомлект(Объект), 0.5, 1);
		Объект.ЭтикетокНаЛисте = Объект.ЭтикетокНаЛисте * ТекКоэфДеления;
	КонецЕсли;
		
	Объект.ДлинаПечати 				= Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, текВидВырубки);

	// <-- Конец Лико Митюшин МФМ 31.03.2021
	Если Лико_ТиражМетраж.ЭтоПечатьНаИндиго(Объект, текВидВырубки) Тогда
		Объект.РучьиПечатиИндиго 	= Объект.РучьиПечати;
		Если Не(текВидВырубки = 9 ИЛИ текВидВырубки = 12) Тогда 
			Объект.РучьиПечати 			= 0;
		КонецЕсли;
	КонецЕсли;
	
	Если текВидВырубки = 13 Тогда 
		Объект.РучьиПечати 			= 	Объект.Ручьи * Объект.КоличествоЛистовКнижки;
	КонецЕсли;
	
	Если Не (текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 10 ИЛИ текВидВырубки = 15) Тогда
		Объект.ЭтикетокНаЛистеПечати 	= Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, текВидВырубки);
	КонецЕсли;
	
	//Если текВидВырубки <> 13 Тогда
		Объект.ЭтМЭР = Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, текВидВырубки);
	//КонецЕсли;
	
	Если текВидВырубки = 3 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 12  ИЛИ текВидВырубки = 14 Тогда
		Объект.КоличествоЭтПоДлинеПечати = Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечатиФлексо(Объект);
	КонецЕсли;
	
	
	//Если текВидВырубки = 13 Тогда
	//	Объект.ЭтМЭР = Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, текВидВырубки);
	//КонецЕсли;
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		Объект.КоличествоЭтПоДлинеПечатиИндиго = Лико_ТиражМетраж.ПолучитьЭтикетокПоДлинеПечатиИндиго(Объект, текВидВырубки);
	КонецЕсли;	
	
	Если текВидВырубки = 10 Тогда  
		Объект.КоличествоШтамповПоДлинеПечатиИндиго = ?(Объект.ШагПечати = 0, 0, Цел(0.98 / Объект.ШагПечати));
	КонецЕсли;	
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 10 ИЛИ текВидВырубки = 12 Тогда 
		Объект.ДлинаПечатиИндиго =  Лико_ТиражМетраж.ПолучитьДлинуПечатиИндиго(Объект, текВидВырубки)
	КонецЕсли;
	
	Если Не (текВидВырубки = 1 ИЛИ текВидВырубки = 3 ИЛИ текВидВырубки = 4 ИЛИ текВидВырубки = 5
		ИЛИ текВидВырубки = 7 ИЛИ текВидВырубки = 8 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 13 ИЛИ текВидВырубки = 14 ИЛИ текВидВырубки = 15) Тогда
		Объект.ЭтикетокНаЛистеИндиго 	= Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(Объект, текВидВырубки);
	КонецЕсли;

	Объект.ПлощадьКлише = Лико_ТиражМетраж.ПолучитьПлощадьКлише(Объект, текВидВырубки); 
	
	ИзмененитьДоступностиПолейНаСервере(текВидВырубки);
		
КонецПроцедуры	

&НаСервере 
Процедура ПроставитьВидВырубки(Заказ,  СпецификацияСсылка = Неопределено, ПересчетПараметров)		// --> Начало Лико Митюшин МФМ 28.05.2021
	
	текВидВырубки = Лико_ТиражМетраж.ПолучитьВидВырубки(Заказ);
	Если Объект.ВидВырубки <> текВидВырубки Тогда
		Объект.ВидВырубки = текВидВырубки;
		ЗаполнитьПараметрыИРасчитатьМетражНаСервере(текВидВырубки, ПересчетПараметров);
		Сообщить("Изменен вид вырубки, проверьте параметры вырубки / печати", СтатусСообщения.Информация); 
		// <-- Начало Лико Яцун С. В. 08.12.2023
		Если РазрешеноМенятьПараметрыШтампа И Объект.ВидВырубки <> 0 Тогда
			РазрешеноМенятьПараметрыШтампа = Ложь;
			Элементы.Лико_РедактироватьПараметрыШтампов.ЦветТекста = WebЦвета.ТемноСерый;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 08.12.2023
	КонецЕсли; 
	
КонецПроцедуры 		// <-- Конец Лико Митюшин МФМ 28.05.2021 

&НаКлиенте
Процедура Лико_РедактироватьПараметрыШтампов()
	РазрешеноМенятьПараметрыШтампа = Не РазрешеноМенятьПараметрыШтампа;
	Если РазрешеноМенятьПараметрыШтампа Тогда  
		Объект.ВидВырубки = 0;
		Элементы.Лико_РедактироватьПараметрыШтампов.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		СпецификацияОбъект = Объект;
		ПроставитьВидВырубки(СпецификацияОбъект,,Ложь);
		Элементы.Лико_РедактироватьПараметрыШтампов.ЦветТекста = WebЦвета.ТемноСерый;
	КонецЕсли;
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыИРасчитатьМетражНаСервере(текВидВырубки, ПересчетПараметров, ВРежимеРедактированияПараметров = Ложь)
	ЗаполнитьПараметрыПечати(Объект, текВидВырубки,, ПересчетПараметров,НЕ ВРежимеРедактированияПараметров);
	//Лико_ТиражМетраж.РассчитатьМетражСВидомВырубки(Объект.Тираж*1000, Объект, текВидВырубки);
	
	РасчитатьТиражМетраж(текВидВырубки);
	
КонецПроцедуры   
	
&НаСервере
Процедура РасчитатьТиражМетраж(текВидВырубки)
	
	Для Каждого стр из Объект.Стоимость Цикл 
		ВыполнитьрасчетТиражМетраж(Стр,текВидВырубки);
	КонецЦикла;  
	
КонецПроцедуры
	
&НаСервере
Процедура ВыполнитьрасчетТиражМетраж(ТекСтр,текВидВырубки,ИмяТаблицы = "")

	Если ТипЗнч(ТекСтр) = Тип("Число") Тогда
		Если Найти(ИмяТаблицы, "Товары") > 0 Тогда
			Стр = Объект.Товары.НайтиПоИдентификатору(ТекСтр); 
		ИначеЕсли Найти(ИмяТаблицы, "Стоимость") > 0 Тогда
			Стр = Объект.Стоимость.НайтиПоИдентификатору(ТекСтр); 
		КонецЕсли;
	Иначе
		Стр = ТекСтр
	КонецЕсли;	
		
	стр.ПогонныйМетраж = Лико_ТиражМетраж.РассчитатьМетражСВидомВырубки(Стр.Количество*1000, Объект, текВидВырубки);
	Если ЗначениеЗаполнено(Объект.Нарезка) Тогда 
		стр.КвадратныйМетраж =стр.погонныйметраж*Объект.Нарезка.Размер/1000;
		ТекШтКВМ = Лико_ТиражМетраж.РассчитатьКВМ(Стр.ШТКВМ, Стр.КвадратныйМетраж, Стр.Количество);
		Если ТекШтКВМ <> Неопределено Тогда 
			Стр.ШтКВМ = ТекШтКВМ;
		КонецЕсли;
	КонецЕсли;
	//Только Омега с нумератором в режиме редактирования параметров (Вид вырубки = 0)
	ОбъекттекВидВырубки = Объект.ВидВырубки;
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И ОбъекттекВидВырубки = 0 И ОмегаСНумератором() Тогда
		//Предопределенные значения
		МассивЛико_Предопределенные = Лико_ТиражМетраж.ПолучитьМассивЛико_Предопределенные();
		Нарезка = Объект.Нарезка.Размер/1000;
		Если Объект.Товары[0].Номенклатура.ЕдиницаИзмерения = МассивЛико_Предопределенные[0] Тогда
			Количество = стр.Количество*1000;
			Если ВидРЦИндиго(Объект.РабочийЦентр) Тогда
				Если Объект.Ручьи = 0 ИЛИ Объект.ЭтикетокНаЛисте = 0  Тогда
					стр.ПогонныйМетраж = 0;
				ИначеЕсли Объект.РучьиПечатиИндиго = 0 Тогда
					стр.ПогонныйМетраж = Количество /Объект.ЭтикетокНаЛисте*Объект.ШагПечати;
				Иначе 
					стр.ПогонныйМетраж = Количество /(Объект.ЭтикетокНаЛисте*Объект.РучьиПечатиИндиго/Объект.Ручьи)*Объект.ШагПечати;
				КонецЕсли;	
			Иначе
				Если Объект.Ручьи = 0 ИЛИ Объект.ЭтикетокНаЛисте = 0  Тогда
					стр.ПогонныйМетраж = 0;
				ИначеЕсли Объект.РучьиПечати = 0 Тогда
					стр.ПогонныйМетраж = Количество / Объект.ЭтикетокНаЛисте*Объект.ШагПечати;
				Иначе 
					стр.ПогонныйМетраж = Количество /(Объект.ЭтикетокНаЛисте*Объект.РучьиПечати/Объект.Ручьи)*Объект.ШагПечати;
				КонецЕсли;
			КонецЕсли;
			стр.КвадратныйМетраж = стр.ПогонныйМетраж*Нарезка;
		ИначеЕсли Объект.Товары[0].Номенклатура.ЕдиницаИзмерения = МассивЛико_Предопределенные[1] Тогда
			стр.ПогонныйМетраж = стр.Количество;
			стр.КвадратныйМетраж  = стр.ПогонныйМетраж*Нарезка;
			Количество = стр.ПогонныйМетраж; 
		ИначеЕсли  Объект.Товары[0].Номенклатура.ЕдиницаИзмерения = МассивЛико_Предопределенные[2]  Тогда
			стр.КвадратныйМетраж  = стр.Количество;
			стр.ПогонныйМетраж = стр.Количество/Нарезка;
			Количество = стр.КвадратныйМетраж;
		КонецЕсли;
		ТекШтКВМ = Лико_ТиражМетраж.РассчитатьКВМ(Стр.ШТКВМ, Стр.КвадратныйМетраж, Стр.Количество);
		Если ТекШтКВМ <> Неопределено Тогда 
			Стр.ШтКВМ = ТекШтКВМ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция СоздатьНоменклатуруНаСервере (Текст, ТипЭтикетки)
	НоваяНоменклатура = Лико_Планирование.СоздатьНоменклатуруНаСервере (Текст, ТипЭтикетки, Объект.Регион, Объект.Партнер);	
	Возврат НоваяНоменклатура;		
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураСоздание(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Сообщить("Сначала необходимо записать заказ!");
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	индексстроки =  ТекущиеДанные.НомерСтроки - 1;
	Наименование = Элемент.ТекстРедактирования;
	//Ном = ПолучитьНоменклатуруПоНазванию(Наименование);
	//Если Не ЗначениеЗаполнено(Ном) тогда
	Если Не ЗначениеЗаполнено(Объект.ссылка) Тогда 
		Сообщить("Необходимо записать заказ") ;
		Возврат;
	КонецЕсли;
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.КЭ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.Кльр"));
	ДопПараметры = Новый Структура("ТекущиеДанные, Элемент, Текст", ТекущиеДанные, Элемент, Наименование); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораТипаЭтикетки", ЭтотОбъект, ДопПараметры);
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = "Выберите тип создаваемого товара (эт, контр или колье)";
	//Сообщение.Поле ="Объект.Товары["+ИндексСтроки+"]Номенклатура";
	//Сообщение.УстановитьДанные(ЭтотОбъект);
	//Сообщение.Сообщить();
	//ПоказатьВыборИзСписка(ОписаниеОповещения, Список );
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаВыбораТипаЭтикетки",,, Новый УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаЭтикетки(Знач ВыбранныйЭлемент, ДопПараметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		типЭтикетки = ВыбранныйЭлемент.Значение;
		Номенклатура = СоздатьНоменклатуруНаСервере(ДопПараметры.Текст, типэтикетки);
		ДопПараметры.ТекущиеДанные.Номенклатура = Номенклатура;
	КонецЕсли; 		

КонецПроцедуры

&НаСервере 
Процедура УстановитьЦенуБезНДС(Идентификатор, ИмяТЧ)
	стр = Объект[ИмяТЧ].НайтиПоИдентификатору(Идентификатор);
	ТекПроцентНДС = стр.СтавкаНДС.Ставка;
	стр.ЦенаБезНДС = стр.цена/(1+ТекПроцентНДС);
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦенуСНДС(Идентификатор, ИмяТЧ)
	стр = Объект[ИмяТЧ].НайтиПоИдентификатору(Идентификатор);
	ТекПроцентНДС = стр.СтавкаНДС.Ставка;
	стр.Цена = стр.ценаБезНДС*(1+ТекПроцентНДС/100);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	стр = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
		УстановитьЦенуБезНДС(стр.ПолучитьИдентификатор(), "Товары");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаБезНДСПриИзменении(Элемент)
	стр = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
		УстановитьЦенуСНДС(стр.ПолучитьИдентификатор(), "ТОвары");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.партнер) Тогда 
		ПартнерПриИзмененииНаСервере();
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииПартнераВНамотке", ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить Партнера в ТЧ перемотка?'"), Режим,0);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Партнер = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда 
		Выборка.Следующий();
		Объект.Контрагент = Выборка.Ссылка;
	Иначе Сообщить("Уточните контрагента");
	КонецЕсли;
	Если Не Объект.Соглашение.Типовое Тогда
		Объект.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаполненииПартнераВНамотке(Результат, ДопПараметры)  Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЗаполнитьПартнераВПеремотке();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПартнераВПеремотке()
	Для каждого стр из Объект.Перемотка Цикл
		Если ЗначениеЗаполнено(стр.Наименование) Тогда 
			ПеремоткаОбъект = стр.Наименование.ПолучитьОбъект();
			ПеремоткаОбъект.Партнер = Объект.Партнер;
			ПеремоткаОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//-->o.pukhova 16042020 
&НаКлиенте
Процедура ПереместитьНаКлиенте(ТЧДляСдвига,текСтрока,Вниз,Цвета)
	Если Вниз Тогда
		Сдвиг = 1
	Иначе
		Сдвиг = -1;
	КонецЕсли;
	
	НомерПервойИПоследнейСтроки = ПолучитьНомерПервойИПоследнейСтрокиВТЧСОтбором(текСтрока.НомерВарианта, Цвета);
	Если НомерПервойИПоследнейСтроки.Количество()>0 Тогда
		Если (Вниз И текСтрока.НомерСтроки < (НомерПервойИПоследнейСтроки.Получить("НомерПоследнейСтроки"))) ИЛИ (Не Вниз И текСтрока.НомерСтроки > (НомерПервойИПоследнейСтроки.Получить("НомерПервойСтроки")))Тогда 
        		ТЧДляСдвига.Сдвинуть(текСтрока.НомерСтроки-1,Сдвиг);
		КонецЕсли;
    КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура Переместить(Команда)
	Если Прав(Команда.Имя,5) = "Цвета" Тогда
		текСтрока = Элементы.Цвета.ТекущиеДанные;
		ТЧДляСдвига = Объект.Цвета;
		Цвета = Истина;
	Иначе
		текСтрока = Элементы.ВидыРабот.ТекущиеДанные;
		ТЧДляСдвига = Объект.ВидыРабот;
		Цвета = Ложь;
	КонецЕсли;
	
	Если Лев(Команда.Имя,4) = "Вниз" Тогда
		ПереместитьНаКлиенте(ТЧДляСдвига,текСтрока,Истина, Цвета)
	Иначе
		ПереместитьНаКлиенте(ТЧДляСдвига,текСтрока,Ложь,Цвета);
	КонецЕсли;
		
КонецПроцедуры
//<--o.pukhova 16042020

&НаКлиенте
Процедура ЦветаГрамматураНаРЦПриИзменении(Элемент)
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текстр.ГрамматураНаРЦ) Тогда 
		Текстр.Грамматура = ЗначениеРеквизита(Текстр.ГрамматураНаРЦ, "Грамматура");		
	Иначе 
		Текстр.Грамматура = 0 ;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦветаТрафаретнаяСеткаПриИзменении(Элемент)    // --> Начало Лико Митюшин МФМ 25.03.2021
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текстр.ТрафаретнаяСетка) Тогда 
		Текстр.Грамматура = ЗначениеРеквизита(Текстр.ТрафаретнаяСетка, "Грамматура");		
	Иначе 
		Текстр.Грамматура = 0;
	КонецЕсли;
КонецПроцедуры	// <-- Конец Лико Митюшин МФМ 25.03.2021

&НаКлиенте
Процедура ЦветаВалПриИзменении(Элемент)
	текстр = Элементы.Цвета.ТекущиеДанные;
	
	//Если  Не ПлощадкаИксПак()  Тогда 
	//	Если ЗначениеЗаполнено(текстр.Вал) Тогда
	//		Грамматура = ПолучитьГрамматуруВала(текстр.Вал).Грамматура;
	//		ПроцентЗаливки = ПолучитьГрамматуруВала(текстр.Вал).ПроцентЗаливки;
	//		Если ЗначениеЗаполнено(Грамматура) Тогда 
	//			текстр.грамматура = Грамматура;
	//			//ТекСтр.ВалФорма = текстр.Вал;
	//			ТекСтр.Форма = Неопределено;
	//		Иначе
	//			Сообщить("Необходимо заполнить значение параметра Грамматура вала в Штампере для " + ЗначениеРеквизита(текстр.Вал, "Артикул") + ЗначениеРеквизита(текстр.Вал,"Наименование"));
	//			текстр.Вал = Неопределено;
	//			//ТекСтр.ВалФорма = Неопределено;
	//			Возврат;
	//		КонецЕсли;
	//		
	//		Если ЗначениеЗаполнено(ПроцентЗаливки) Тогда
	//			текстр.ПроцентЗаливки = ПроцентЗаливки;
	//			//ТекСтр.ВалФорма = текстр.Вал;
	//			ТекСтр.Форма = Неопределено;
	//		Иначе
	//			Сообщить("Необходимо заполнить значение параметра ПроцентЗаливки в Штампере для " + ЗначениеРеквизита(текстр.Вал, "Артикул") + ЗначениеРеквизита(текстр.Вал,"Наименование"));
	//			текстр.Вал = Неопределено;
	//			//ТекСтр.ВалФорма = Неопределено;
	//		КонецЕсли;
	//	Иначе
	//		текстр.грамматура = 0;
	//		текстр.ПроцентЗаливки = 0;
	//		//ТекСтр.ВалФорма = Неопределено;
	//	КонецЕсли;
	//ИначеЕсли ЗначениеЗаполнено(текстр.Вал) Тогда
	//	//ТекСтр.ВалФорма = текстр.Вал;
	//	ТекСтр.Форма = Неопределено;
	//Иначе
	//	//ТекСтр.ВалФорма = Неопределено;
	//КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();

КонецПроцедуры

&НаСервере
Функция ПлощадкаИксПак()
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
		Возврат Истина;
	Иначе Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьПараметрыГлубокойПечати(Идентификатор)
		текстр = Объект.Цвета.НайтиПоИдентификатору(Идентификатор);
		
		ЦГ = текстр.ТипКраски;
		Если ЗначениеЗаполнено(ЦГ.КоэффициентКраскоПереноса) Тогда 
			текстр.грамматура = ЦГ.КоэффициентКраскоПереноса;
		КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьГрамматуруВала(Номенклатура)
	Грамматура = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.ГрамматураВала КАК ГрамматураВала,
	|	Лико_ПараметрыШтампа.ПроцентЗаливки КАК ПроцентЗаливки
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Если ЗначениеЗаполнено(Результат.ГрамматураВала) Тогда
			Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
				Грамматура =  Результат.ГрамматураВала ;
			Иначе
				Грамматура = Результат.ГрамматураВала*0.5;
			КонецЕсли;
			ПроцентЗаливки = Результат.ПроцентЗаливки;
		КонецЕсли;
	КонецЕсли;
	ПараметрыВала = Новый Структура("Грамматура,ПроцентЗаливки", Грамматура, ПроцентЗаливки);
	Возврат ПараметрыВала;
КонецФункции

&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	ИзменитьПриСменеВидаВырубки(); 
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
КонецПроцедуры

&НаСервере
Процедура ИзменитьПриСменеВидаВырубки(ПересчитыватьМетраж = Истина, ПересчитатьПоля = Ложь, ВРежимеРедактированияПараметров = Ложь)
	
	текБылиИзменения = Лико_ТиражМетраж.ИзменитьПриСменеВидаВырубки(Объект, ПересчитыватьМетраж, ПересчитатьПоля);
	// <-- Начало Лико Яцун С. В. 06.07.2023 
	Если текБылиИзменения И (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) Тогда
		ЗаполнитьПараметрыПечати(Объект, Объект.ВидВырубки,,,НЕ ВРежимеРедактированияПараметров);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 06.07.2023
	Если ПересчитыватьМетраж Тогда
		Если текБылиИзменения Тогда
			РасчитатьТиражМетраж(Объект.ВидВырубки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтикеткиИТиражМетражНаКлиенте(Заказ, текВидВырубки)
	Лико_ЭтикеткиИТиражМетражНаСервере(ТекВидВырубки);
	ПараметрыШтампаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШтампаПриИзменении()
	Если ЗначениеЗаполнено(Объект.Z) И 
		НЕ (ЗначениеЗаполнено(Объект.ШтампВырубной) И ЗначениеЗаполнено(Объект.ШагПечати)) Тогда
		текКоличествоЗубьев = ПолучитьКоличествоЗубьев(Объект.Z) * 3.175 / 1000;
		Если Объект.ШагПечати <> текКоличествоЗубьев Тогда
			текПараметрыОтбора = Новый Структура;
			текПараметрыОтбора.Вставить("ВидСекции", ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка"));	
			текНайденныеСтроки = Объект.Цвета.НайтиСтроки(текПараметрыОтбора);
			Если текНайденныеСтроки.Количество() = 0 Тогда
				Объект.ШагПечати =  текКоличествоЗубьев;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	РасчитатьТиражМетраж(Объект.ВидВырубки);
	ЗаполнитьПлощадьКлишеНаСервере(Объект.ВидВырубки);
	//ПоказатьДоходностьРентабельность();
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		ЗаполнитьПлощадьКлишеНаСервере(Объект.ВидВырубки);
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки,,,Ложь);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьНарезкуНасервере(Нарезка)
	Если ЗначениеЗаполнено(Нарезка) Тогда 
		Возврат нарезка.размер/1000 ;
	Иначе Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЗубьев(Элемент)
	Возврат Объект.Z.КоличествоЗубьев;
КонецФункции

&НаСервере
Процедура ЗаполнитьДлинаПечатиНаСервере() 
	
	текДлинаПечати = ПолучитьДлинуПечатиНаСервере();
	Если Не ЗначениеЗаполнено(текДлинаПечати) И Объект.Ссылка.ВидВырубки = Объект.ВидВырубки Тогда
		Возврат;
	КонецЕсли;
	Если текДлинаПечати <> Объект.ДлинаПечати Тогда
		Объект.ДлинаПечати = текДлинаПечати;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДлинуПечатиНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, Объект.ВидВырубки);
КонецФункции

&НаСервере
Процедура Лико_ЭтикеткиИТиражМетражНаСервере(ТекВидВырубки)
	ЗаполнитьПлощадьКлишеНаСервере(ТекВидВырубки);
	ЗаполнитьЭтикеткиПечати(ТекВидВырубки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадьКлишеНаСервере(текВидВырубки)
	текПлощадьКлише = Лико_ТиражМетраж.ПолучитьПлощадьКлише(Объект, текВидВырубки);
	Если Объект.ПлощадьКлише <> текПлощадьКлише Тогда 
		Объект.ПлощадьКлише = текПлощадьКлише;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьZ(Заказ, текВидВырубки)
	текZ = Лико_ТиражМетраж.ПолучитьZ(Заказ, текВидВырубки, Объект);
	Если Объект.Z <> текZ Тогда
		Объект.Z = текZ;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоЭтПоДлинеПечати(Заказ)
	текКоличествоЭтПоДлинеПечати = Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечатиФлексо(Заказ, Объект);
	Если Заказ.КоличествоЭтПоДлинеПечати <> текКоличествоЭтПоДлинеПечати Тогда 
		Заказ.КоличествоЭтПоДлинеПечати = текКоличествоЭтПоДлинеПечати;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтикеткиПечати(ТекВидВырубки)
	//текКоличествоЭтПоДлинеПечати = Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечатиФлексо(Заказ, Объект);
	//Если Заказ.КоличествоЭтПоДлинеПечати <> текКоличествоЭтПоДлинеПечати Тогда 
	//	Заказ.КоличествоЭтПоДлинеПечати = текКоличествоЭтПоДлинеПечати;	
	//КонецЕсли;
	// <-- Начало Лико Яцун С. В. 15.08.2024
	Если Не (ТекВидВырубки = 2 ИЛИ ТекВидВырубки = 6 ИЛИ ТекВидВырубки = 10 ИЛИ (ТекВидВырубки = 0 И ОмегаСНумератором())) Тогда 
		текЭтикетокНаЛистеПечати =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, ТекВидВырубки);
		Если текЭтикетокНаЛистеПечати <> Объект.ЭтикетокНаЛистеПечати Тогда
			Объект.ЭтикетокНаЛистеПечати 	= текЭтикетокНаЛистеПечати;
			текБылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не (ТекВидВырубки = 1 ИЛИ ТекВидВырубки = 3 ИЛИ ТекВидВырубки = 4 ИЛИ ТекВидВырубки = 5
 		ИЛИ ТекВидВырубки = 7 ИЛИ ТекВидВырубки = 8 ИЛИ ТекВидВырубки = 11 ИЛИ ТекВидВырубки = 13 ИЛИ ТекВидВырубки = 14 ИЛИ ТекВидВырубки = 15 ИЛИ ТекВидВырубки = 18 ИЛИ ТекВидВырубки = 19 
		ИЛИ (ТекВидВырубки = 0 И ОмегаСНумератором())) Тогда 
		текЭтикетокНаЛистеИндиго =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(Объект, ТекВидВырубки);
		Если текЭтикетокНаЛистеИндиго <> Объект.ЭтикетокНаЛистеИндиго Тогда
			Объект.ЭтикетокНаЛистеИндиго 	= текЭтикетокНаЛистеИндиго;
			текБылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
    ДобавитьУсловноеОформлениеЦветаВидОснастка();
    ДобавитьУсловноеОформлениеЦветаВалФорма();

КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеЦветаВидОснастка() // <-- Начало Лико Яцун С. В. 19.10.2023
	
	МассивУсловногоОформленияВидОснастка = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ЦветаВидОснастка" Тогда
			МассивУсловногоОформленияВидОснастка.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияВидОснастка Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Для каждого Стр Из Объект.Цвета Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Оснастка) Тогда
			Продолжить;	
		КонецЕсли;
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаВидОснастка");
		ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.КлючСтроки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Стр.КлючСтроки; 
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Оснастка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Оснастка.Артикул);
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 19.10.2023

&НаСервере
Процедура ДобавитьУсловноеОформлениеЦветаВалФорма() // <-- Начало Лико Яцун С. В. 19.10.2023
	
	МассивУсловногоОформленияВалФорма = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ЦветаВал" ИЛИ Строка(Элемент.Поля) = "ЦветаФорма" Тогда
			МассивУсловногоОформленияВалФорма.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияВалФорма Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Для каждого Стр Из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(Стр.Вал) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаВал");
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.КлючСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.КлючСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Вал");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Вал.Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Форма) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаФорма");
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.КлючСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.КлючСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Форма");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Форма.Код);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 19.10.2023

#Область Нумераторы

&НаКлиенте
Процедура ВидыРаботДополнительноПриИзменении(Элемент)

	ТекСтр = Элементы.ВидыРабот.ТекущиеДанные;   
	
	Если не ЗначениеЗаполнено(ТекСтр.ВидРабот) и не ЗначениеЗаполнено(ТекСтр.РабочийЦентр) Тогда		
		Сообщить("Необходимо сперва заполнить Вид работ и Рабочий центр");
		ТекСтр.Дополнительно = 0;
		Возврат;		
	КонецЕсли;
	
	Если ТекСтр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Нумератор") Тогда						
		Если  Не ЭтоЦифра(ТекСтр.РабочийЦентр)  Тогда  			
			Если не ЗначениеЗаполнено(ТекСтр.ТипНумератора) Тогда  	
				Сообщить( "Необходимо заполнить Тип Нумератора");
				ТекСтр.Дополнительно  = 0 ;
				Возврат
			КонецЕсли;
			
			МаксКолРучьев =  ПолучитьКоличествоРучьев(текстр.ТипНумератора, текстр.РабочийЦентр); 
			Если МаксКолРучьев = 0 Тогда  
				Сообщить(СтрШаблон("в спр ""Типы нумераторов"" для нумератора %1 не заполнено максимальное количество ручьев для рабочего цетнра %2",  
				текстр.ТипНумератора,  текстр.РабочийЦентр ));   
				ТекСтр.Дополнительно  = 0 ;
				Возврат
			КонецЕсли; 			
			Если  ТекСтр.Дополнительно > МаксКолРучьев	Тогда 
				ТекСтр.Дополнительно  = МаксКолРучьев;
				Сообщить(СтрШаблон("Максимум ручьев для РЦ %2 при нумераторе %3 - %1", МаксКолРучьев, текстр.РабочийЦентр, текстр.ТипНумератора ));			
			КонецЕсли; 				
		КонецЕсли;  				
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидыРаботТипНумератораПриИзменении(Элемент)
	
	ТекСтр = Элементы.ВидыРабот.ТекущиеДанные;
	ТекСтр.ТипКода = ПредопределенноеЗначение("Справочник.Лико_ТипыКодов.ПустаяСсылка");
	ТекСтр.Дополнительно = 0;

КонецПроцедуры


&НаКлиенте
Процедура ВидыРаботТипНумератораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтр = Элементы.ВидыРабот.ТекущиеДанные; 
	Если ЗначениеЗаполнено(текстр.РабочийЦентр) Тогда 
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьТипыНумератора(текстр.РабочийЦентр))  ;
	КонецЕсли
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьТипыНумератора(РабочийЦентр) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТРЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеЦентры.ВидРабочегоЦентра
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Ссылка = &РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ТипыНумераторовРабочиеЦентры.Ссылка КАК ТипНумератора
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ТипыНумераторов.РабочиеЦентры КАК Лико_ТипыНумераторовРабочиеЦентры
	|		ПО ВТРЦ.РабочийЦентр = Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр";
	
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);  
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипНумератора")    
		
КонецФункции   

 
&НаСервереБезКонтекста
Функция ПолучитьКоличествоРучьев(Нумератор, РабочийЦентр) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТРЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеЦентры.ВидРабочегоЦентра
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Ссылка = &РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ТипыНумераторовРабочиеЦентры.МаксимальноеКоличествоРучьев КАК МаксимальноеКоличествоРучьев,
	|	Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр.Родитель КАК РабочийЦентрРодитель
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ТипыНумераторов.РабочиеЦентры КАК Лико_ТипыНумераторовРабочиеЦентры
	|		ПО ВТРЦ.РабочийЦентр = Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр
	|ГДЕ
	|	Лико_ТипыНумераторовРабочиеЦентры.Ссылка = &Нумератор
	|	И Лико_ТипыНумераторовРабочиеЦентры.МаксимальноеКоличествоРучьев > 0
	|	И Лико_ТипыНумераторовРабочиеЦентры.Ссылка.ПометкаУдаления <> ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЦентрРодитель УБЫВ";
	
	Запрос.УстановитьПараметр("Нумератор", Нумератор);  
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);    
	
	Результат = Запрос.Выполнить();  
	

	
	Возврат ?(Результат.Пустой(), 0, Результат.Выгрузить()[0].МаксимальноеКоличествоРучьев) 
		
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьТипыКодов(ТипНумератора)
	Возврат ТипНумератора.РасходЧернил.ВыгрузитьКолонку("ТипКода");
КонецФункции

&НаКлиенте
Процедура ВидыРаботТипНумератораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекСтр = Элементы.ВидыРабот.ТекущиеДанные;  
	Клей = ПолучитьОсновныеЧернила(ВыбранноеЗначение) ;
	Если Клей <> 0 Тогда
		ТекСтр.Клей = Клей;   
	КонецЕсли; 

КонецПроцедуры 

Функция ПолучитьОсновныеЧернила(ВыбранноеЗначение) 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ТипыНумераторов.ОсновныеЧернила КАК ОсновныеЧернила
		|ИЗ
		|	Справочник.Лико_ТипыНумераторов КАК Лико_ТипыНумераторов
		|ГДЕ
		|	Лико_ТипыНумераторов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение);
	
	Результат = Запрос.Выполнить();
	
	Возврат ?(Результат.Пустой(), 0, Результат.Выгрузить()[0].ОсновныеЧернила) 
	
КонецФункции


Функция ЭтоЦифра(РабочийЦентр)
	
	ВидРЦентра = ЗначениеРеквизита(РабочийЦентр, "ВидРабочегоЦентра");
	
	Возврат ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") или ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet") 

КонецФункции

&НаКлиенте
Процедура ВидыРаботТипКодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ТекСтр = Элементы.ВидыРабот.ТекущиеДанные; 
	Если ЗначениеЗаполнено(текстр.ТипНумератора) Тогда 
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьТипыКодов(текстр.ТипНумератора))  ;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботКлейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
		

КонецПроцедуры  

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораЦГ(ВыбранноеЗначение, Доп) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда 
		Возврат	
	КонецЕсли;
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	ТекСтр.ТипКраски = ВыбранноеЗначение.Ссылка;  
	
КонецПроцедуры

  
#КонецОбласти

&НаСервере
Функция НайтиВПФ(Наименование)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование);
	Возврат ВПФ;

КонецФункции

 
&НаКлиенте
Процедура ЦветаВидСекцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьВидыРаботЦвета());
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьВидыРаботЦвета() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ВидыСекций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ВидыСекций КАК Лико_ВидыСекций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_ВидыСекций КАК Лико_ВидыСекций1
	|		ПО Лико_ВидыСекций.Ссылка = Лико_ВидыСекций1.Родитель
	|ГДЕ
	|	Лико_ВидыСекций.Ссылка <> ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|	И Лико_ВидыСекций1.Ссылка ЕСТЬ NULL";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")    
		
КонецФункции  

&НаКлиенте
Процедура ЦветаВидСекцииПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;	 
	//стр.ВидПечати = ПолучитьВидПечатиПеречисление(стр.ВидСекции); 
	
	Если стр.ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГлубокаяПечать") Тогда
		Элементы.ЦветаГрамматура.Доступность = Ложь;
	Иначе
		Элементы.ЦветаГрамматура.Доступность = Истина;		
	КонецЕсли;
	
	реквизитыТЧ = ПолучитьМассивРеквизитовТЧ();
	
	для Каждого текРек из реквизитыТЧ цикл
		
		Если текРек = "ВидСекции"  ИЛИ  текРек = "КлючСтроки" ИЛИ  текРек = "НомерПроката" ИЛИ  текРек = "НомерВарианта" ИЛИ  текРек = "РабочийЦентр" ИЛИ  текРек = "НомерРаботы" Тогда 
			Продолжить; 
		ИначеЕсли 
			ЗначениеРеквизита(стр.ВидСекции,"Печать") И текРек = "ВидТМЦ" ИЛИ текРек = "ТипЦвета1"  ИЛИ  текРек = "Название" Тогда 
			стр.ТипЗаливка = стр.ТипЦвета1;
			Продолжить				
		Иначе
			стр[текРек] = неопределено;
		КонецЕсли;
		Если текРек = "Оснастка" И ЗначениеРеквизита(стр.ВидСекции,"Оснастка") Тогда
			Стр.ВидОснастка = стр[текРек];
		КонецЕсли;
	КонецЦикла; 
	
	стр.ВидПечати = ПолучитьВидПечатиПеречисление(стр.ВидСекции);
	
	ВидТМЦ = ЗначениеРеквизита(стр.ВидСекции, "ВидТМЦ");
	Если ЗначениеЗаполнено(ВидТМЦ) Тогда
		Если стр.ВидТМЦ <> ВидТМЦ Тогда 
			стр.ВидТМЦ = ВидТМЦ;
			стр.ТипЦвета1 = Неопределено;
			стр.Название = Неопределено;
			стр.ТипЗаливка =Неопределено;
		КонецЕсли;	
	КонецЕсли; 

	ВидЗаливки = ПолучитьВидЗаливкиПоУмолчанию(стр.ВидСекции, стр.ВидТМЦ);
	Если ЗначениеЗаполнено(ВидЗаливки) Тогда 

		стр.ВидЗаливки = ВидЗаливки;
		стр.ТипЗаливка = ВидЗаливки;  
	КонецЕсли;
	
	Если ЗначениеРеквизита(стр.ВидСекции,"Оснастка") И (НЕ ЗначениеЗаполнено(стр.ВидОснастка) ИЛИ ТипЗнч(стр.ВидОснастка) <> Тип("СправочникСсылка.Номенклатура")) Тогда
		стр.ВидОснастка = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");	
	ИначеЕсли ЗначениеРеквизита(стр.ВидСекции,"ИспользоватьВидТМЦ") И ТипЗнч(стр.ВидОснастка) <> Тип("СправочникСсылка.Лико_ВидыТМЦ") 
		ИЛИ (НЕ ЗначениеРеквизита(стр.ВидСекции,"Оснастка") И НЕ ЗначениеРеквизита(стр.ВидСекции,"ИспользоватьВидТМЦ")) Тогда 
		стр.ВидОснастка = Неопределено;
	КонецЕсли;	
	
	ЗаписатьЦветаВРаботы();   

КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьВидЗаливкиПоУмолчанию(ВидСекции, ВидТМЦ) 
	
	
	СтрокаЗаливки = ВидСекции.ВидыЗаливки.найтиСтроки(новый структура("ВидТМЦ", ВидТМЦ));	
	Если СтрокаЗаливки.Количество() <> 0 Тогда 
		Возврат СтрокаЗаливки[0].ВидЗаливки 
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьВидПечатиПеречисление(ВидСекции) 
	
	ВидПечати = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ВидыСекций.ВидПечати.ВидПечати КАК ВидПечати
		|ИЗ
		|	Справочник.Лико_ВидыСекций КАК Лико_ВидыСекций
		|ГДЕ
		|	Лико_ВидыСекций.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидСекции);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Выборка.Следующий();  
		
	ВидПечати = Выборка.ВидПечати;
	 
	Возврат ВидПечати 

	
	
КонецФункции

&НаКлиенте
Процедура ЦветаВидСекцииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекстПоиска = ВРег(Текст);
	
	Пока СтрНайти(ТекстПоиска, "  ") > 0 Цикл
		ТекстПоиска = СтрЗаменить(ТекстПоиска, "  ", " ");
	КонецЦикла;
	
	ТекстПоиска = СокрЛП(ТекстПоиска);
	
	ДлинаТекста = СтрДлина(ТекстПоиска);
	Если ДлинаТекста = 0 Тогда
		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Шрифт = Новый Шрифт(,,Истина);
	Цвет = WebЦвета.Зеленый;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	МассивПодстрок = СтрРазделить(ТекстПоиска, " ");
	
	СП = Новый СписокЗначений;
	СП.ЗагрузитьЗначения(ПолучитьВидыРаботЦвета());	
	
	//Для Каждого Стр Из Элемент.СписокВыбора Цикл 
	Для Каждого Стр Из СП Цикл
		
		Строка = Стр.Значение;
		СтрокаВРег = ВРег(Строка);
		
		ВхожденияНайдены = Истина;
		
		Для Каждого Подстрока Из МассивПодстрок Цикл
			Если Найти(СтрокаВРег, Подстрока) = 0 Тогда
				ВхожденияНайдены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ВхожденияНайдены Тогда
			Продолжить
		КонецЕсли;
		
		ДлинаСтроки = СтрДлина(Строка);
		Массив = Новый Массив(ДлинаСтроки);
		
		Для Каждого Подстрока Из МассивПодстрок Цикл
			ДлинаПодстроки = СтрДлина(Подстрока);
			НачалоПоиска = 1;			
			Пока Истина Цикл
				ПозицияПодстроки = СтрНайти(СтрокаВРег, Подстрока, , НачалоПоиска);
				Если ПозицияПодстроки = 0 Тогда
					Прервать;
				КонецЕсли;
				
				НачалоПоиска = ПозицияПодстроки + ДлинаПодстроки;
				
				Для Сч = ПозицияПодстроки По НачалоПоиска - 1 Цикл
					Массив[Сч - 1] = Истина;
				КонецЦикла;				
				
				Если НачалоПоиска > ДлинаСтроки Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;			
		КонецЦикла;
		
		МассивСтрок = Новый Массив;		
		Для Сч = 0 По Массив.ВГраница() Цикл
			Символ = Сред(Строка, Сч + 1, 1);
			Если Массив[Сч] = Неопределено Тогда
				МассивСтрок.Добавить(Символ);
			Иначе
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символ, Шрифт, Цвет));
			КонецЕсли;
		КонецЦикла;
		
		ДанныеВыбора.Добавить(Строка, Новый ФорматированнаяСтрока(МассивСтрок));
		
		Если ДанныеВыбора.Количество() = 50 Тогда
			Прервать
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипЦвета1ПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные; 
	
	Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЛаминацияСамоклейкой") тогда 		
		стр.ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.ПустаяСсылка");  		
	Иначе 		
		стр.ВидТМЦ = ЗначениеРеквизита( стр.ТипЦвета1, "ВидТМЦ") ;     
	КонецЕсли;  
	
	Если стр.ТипЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.ПустаяСсылка") Тогда
		стр.ТипЗаливка = Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(стр.ВидТМЦ) И ТипЗнч(стр.ВидОснастка) = Тип("СправочникСсылка.Лико_ВидыТМЦ") Тогда
		стр.ВидОснастка = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.ПустаяСсылка");  		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзРабот(Команда)
	
	Для каждого стр из объект.ВидыРабот Цикл 
		
		Если стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Печать") Тогда  
			Продолжить				
		КонецЕсли;  
		
		Если стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Ламинация") Тогда  
			Если ЗначениеРеквизита(стр.РабочийЦентр, "ПорядковыйНомер") = 300 Тогда
				СтрокиЛаминация = объект.Цвета.НайтиСтроки(новый структура("НомерПроката, НомерВарианта", стр.НомерПроката, стр.НомерВарианта)); 
				Если СтрокиЛаминация.Количество() <> 0 Тогда
					СтрокаЛаминация = СтрокиЛаминация[0]; 
					СтрокаЛаминация.Нарезка = стр.нарезка;
					СтрокаЛаминация.материал = стр.материал; 
					СтрокаЛаминация.ПроцентЗаливки = стр.ПроцентЗаливки; 
					Если не ЗначениеЗаполнено( СтрокаЛаминация.ТипКраски) Тогда
						Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
							СтрокаЛаминация.ТипКраски	 = стр.клей; 
							СтрокаЛаминация.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
						Иначе
							СтрокаЛаминация.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
							СтрокаЛаминация.Номенклатура = стр.клей;
						КонецЕсли; 
					КонецЕсли;
				КонецЕсли;

			Иначе 
				СтрокиЛаминация = объект.Цвета.НайтиСтроки(новый структура("НомерПроката, НомерВарианта, ВидСекции", стр.НомерПроката, стр.НомерВарианта, ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЛаминацияФлексо")));
				Если СтрокиЛаминация.Количество() = 0 Тогда  
					НоваяСтрока = объект.Цвета.Добавить();
					НоваяСтрока.Нарезка 	   = стр.нарезка;
					НоваяСтрока.материал	   = стр.материал; 
					НоваяСтрока.ПроцентЗаливки = стр.ПроцентЗаливки; 
					НоваяСтрока.НомерВарианта  = стр.НомерВарианта; 

					Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
						НоваяСтрока.ТипКраски	 = стр.клей; 
						НоваяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
					Иначе
						НоваяСтрока.ТипКраски	 = стр.клей.ЦеноваяГруппа;
						НоваяСтрока.Номенклатура = стр.клей;
					КонецЕсли;	
				
                    НоваяСтрока.ТипКраски 	   = стр.Клей;    
					НоваяСтрока.ВидСекции	   = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЛаминацияФлексо");  
					НоваяСтрока.РабочийЦентр   = стр.РабочийЦентр;  
					НоваяСтрока.НомерПроката   = стр.НомерПроката;  
					НоваяСтрока.КлючСтроки 	   = новый УникальныйИдентификатор;
				Иначе
					СтрокаЛаминация = СтрокиЛаминация[0]; 
					СтрокаЛаминация.Нарезка = стр.нарезка;
					СтрокаЛаминация.материал = стр.материал; 
					СтрокаЛаминация.ПроцентЗаливки = стр.ПроцентЗаливки; 
					Если не ЗначениеЗаполнено( СтрокаЛаминация.ТипКраски) Тогда
						Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
							СтрокаЛаминация.ТипКраски	 = стр.клей; 
							СтрокаЛаминация.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
						Иначе
							СтрокаЛаминация.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
							СтрокаЛаминация.Номенклатура = стр.клей;
						КонецЕсли; 
					КонецЕсли;
					
				КонецЕсли;

	        КонецЕсли;
			
		ИначеЕсли стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное") или стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное") Тогда	
			
			НоваяСтрокаГТ = объект.Цвета.Добавить();
			НоваяСтрокаГТ.Нарезка 	   	 = стр.нарезка;
			НоваяСтрокаГТ.материал	   	 = стр.материал; 
			НоваяСтрокаГТ.ПроцентЗаливки = стр.ПроцентЗаливки;   
			НоваяСтрокаГТ.НомерВарианта  = стр.НомерВарианта; 

			Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
				НоваяСтрокаГТ.ТипКраски	 = стр.клей; 
				НоваяСтрокаГТ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
			Иначе
				НоваяСтрокаГТ.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа") ;
				НоваяСтрокаГТ.Номенклатура = стр.клей;
			КонецЕсли;  
			НоваяСтрокаГТ.РабочийЦентр   = стр.РабочийЦентр;  
			НоваяСтрокаГТ.НомерПроката   = стр.НомерПроката;  
			НоваяСтрокаГТ.КлючСтроки 	 = новый УникальныйИдентификатор;  
			НоваяСтрокаГТ.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское"); 
			Если стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное") Тогда		
				НоваяСтрокаГТ.НаправлениеПротяжки = ПредопределенноеЗначение("Перечисление.Лико_НаправленияПротяжки.Поперечное"); 			
			ИначеЕсли  стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное") Тогда	
				НоваяСтрокаГТ.НаправлениеПротяжки = ПредопределенноеЗначение("Перечисление.Лико_НаправленияПротяжки.Продольное");  			
			КонецЕсли;    
			
		Иначе
			ВидСекции = ЗначениеРеквизита(стр.ВидРабот, "Лико_ВидСекции");	
			СтрокиЦвета = объект.Цвета.НайтиСтроки(новый структура("НомерПроката, НомерВарианта, ВидСекции", стр.НомерПроката, стр.НомерВарианта, ВидСекции ));    
			Если СтрокиЦвета.Количество() = 0 Тогда  
				НоваяСтрока = объект.Цвета.Добавить();  
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
                НоваяСтрока.ВидСекции =  ВидСекции;
				
				Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
					НоваяСтрока.ТипКраски	 = стр.клей; 
					НоваяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
				Иначе
					НоваяСтрока.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
					НоваяСтрока.Номенклатура = стр.клей;
				КонецЕсли;	
				
				НоваяСтрока.ТипКраски 	   = стр.Клей;    

				Если ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда
					НоваяСтрока.КоличествоРучьевНумератора  = стр.Дополнительно; 	
				Иначе 
					НоваяСтрока.Подача = стр.Дополнительно; 	
				КонецЕсли;
				
				НоваяСтрока.КлючСтроки 	   = новый УникальныйИдентификатор;
			Иначе
				СтрокаЦвета = СтрокиЦвета[0]; 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);

				Если не ЗначениеЗаполнено(СтрокаЦвета.ТипКраски) Тогда
					Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
						СтрокаЦвета.ТипКраски	 = стр.клей; 
						СтрокаЦвета.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
					Иначе
						СтрокаЦвета.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
						СтрокаЦвета.Номенклатура = стр.клей;
					КонецЕсли; 
				КонецЕсли;   
				 
				Если ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда
					НоваяСтрока.КоличествоРучьевНумератора  = стр.Дополнительно; 	
				Иначе 
					НоваяСтрока.Подача = стр.Дополнительно; 	
				КонецЕсли;

				
			КонецЕсли;

			
		КонецЕсли;  

		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЦветаРаботы(Создание)
	
	Если Создание Тогда
		КнопкаСортировки = Элементы.Добавить("ВыдвинутьКолонкиРабот", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
		КнопкаСортировки.Заголовок = "Работы";
		КнопкаСортировки.ИмяКоманды = "ВыдвинутьКолонкиРабот";
		КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;  
		КнопкаСортировки.Картинка  	 = БиблиотекаКартинок.НастроитьСписок;  

	Иначе 
		Элем = Элементы.Найти("ВыдвинутьКолонкиРабот");
		Если Элем <> Неопределено Тогда 
			//Элементы.Удалить(Элем);
			//КнопкаСортировки = Элементы.Добавить("ВернутьСортировкуКолонок", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
			//КнопкаСортировки.Заголовок 	 = "Цвета";
			//КнопкаСортировки.ИмяКоманды  = "ВернутьСортировкуКолонок"; 
			//КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;
			//КнопкаСортировки.Картинка  	 = БиблиотекаКартинок.НастроитьСписок;  
			//
			//  Элементы.Переместить(Элементы.ЦветаНомерРаботы,   Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаНаправлениеПротяжки, Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаОснасткаАртикул,     Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаОснастка,            Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаПодача,              Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаЭтикетокВПодаче,     Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//
			//Элементы.Переместить(Элементы.ЦветаКодМатериала,  Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаМатериал,  	  Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаНарезка,  	  Элементы.Цвета, Элементы.ЦветаТипЦвета1); 
			//Элементы.Переместить(Элементы.ЦветаКоличествоРучьевМатериала,   Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаТипКраскиКод,  Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаТипКраски,  	  Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаВидЗаливки,	  Элементы.Цвета, Элементы.ЦветаТипЦвета1); 
			//Элементы.Переместить(Элементы.ЦветаПроцентЗаливки,Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаГрамматура,	  Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//Элементы.Переместить(Элементы.ЦветаНоменклатура,  Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			//  Элементы.Переместить(Элементы.ЦветаФорма,	 	  Элементы.Цвета, Элементы.ЦветаТипЦвета1);   
			//Элементы.Переместить(Элементы.ЦветаФормаКод,	  Элементы.Цвета, Элементы.ЦветаТипЦвета1); 
			//Элементы.Переместить(Элементы.ЦветаАнилокс,	 	  Элементы.Цвета, Элементы.ЦветаТипЦвета1);
			
			// <-- Начало Лико Яцун С. В. 20.08.2024 
			Элементы.Удалить(Элем);
			КнопкаСортировки = Элементы.Добавить("ВернутьСортировкуКолонок", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
			КнопкаСортировки.Заголовок 	 = "Цвета";
			КнопкаСортировки.ИмяКоманды  = "ВернутьСортировкуКолонок"; 
			КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;
			КнопкаСортировки.Картинка  	 = БиблиотекаКартинок.НастроитьСписок; 
			
			
			//Элементы.Переместить(Элементы.ЦветаНомерПроката,  			Элементы.Цвета, Элементы.ЦветаНомерСекции);   
			//Элементы.Переместить(Элементы.ЦветаРабочийЦентр, 			Элементы.Цвета, Элементы.ЦветаНомерСекции);    
			//Элементы.Переместить(Элементы.ЦветаВидСекции, 	  			Элементы.Цвета, Элементы.ЦветаНомерСекции);  
			Элементы.Переместить(Элементы.ЦветаЗаказНовойОснастки, 		Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаНаправлениеПротяжки,		Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
		//	Элементы.Переместить(Элементы.ЦветаВидОснастка, 			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаПодача, 					Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаЭтикетокВПодаче,     	Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаКодМатериала,  			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаМатериал,  	  			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			//Элементы.Переместить(Элементы.ЦветаЗаказМатериала,  	  	Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаНарезка,  	 			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевМатериала,  	 	Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
		
			Элементы.Переместить(Элементы.ВернутьСортировкуКолонок, Элементы.Цвета.КоманднаяПанель, Элементы.ЦветаНумератор);
			
			Элементы.Переместить(Элементы.ЦветаТипНумератора,  				Элементы.Цвета);   
			Элементы.Переместить(Элементы.ЦветаТипКода, 	   				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаГрамматураНаРЦ, 				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаТрафаретнаяСетка,			Элементы.Цвета);
		Иначе
			
			//Элем = Элементы.Найти("ВернутьСортировкуКолонок");
			//Элементы.Удалить(Элем);
			//КнопкаСортировки = Элементы.Добавить("ВыдвинутьКолонкиРабот", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
			//КнопкаСортировки.Заголовок 	 = "Работы";
			//КнопкаСортировки.ИмяКоманды  = "ВыдвинутьКолонкиРабот";    
			//КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;
			//КнопкаСортировки.Картинка 	 = БиблиотекаКартинок.НастроитьСписок; 
			//
			//Элементы.Переместить(Элементы.ЦветаГрамматура,	  Элементы.Цвета, Элементы.ЦветаЗапечатываемыйМатериал);
			//Элементы.Переместить(Элементы.ЦветаПроцентЗаливки,Элементы.Цвета, Элементы.ЦветаГрамматураНаРЦ);
			//Элементы.Переместить(Элементы.ЦветаНоменклатура,  Элементы.Цвета, Элементы.ЦветаПроцентЗаливки);
			//Элементы.Переместить(Элементы.ЦветаТипКраски,  	  Элементы.Цвета, Элементы.ЦветаНазвание);
			//Элементы.Переместить(Элементы.ЦветаТипКраскиКод,  Элементы.Цвета, Элементы.ЦветаТипКраски);
			//Элементы.Переместить(Элементы.ЦветаТипЗаливка,    Элементы.Цвета, Элементы.ЦветаТипКраскикод);
			//Элементы.Переместить(Элементы.ЦветаВидТМЦ,   	  Элементы.Цвета, Элементы.ЦветаТипЗаливка);  
			//
			//Элементы.Переместить(Элементы.ЦветаФормаКод,  	  Элементы.Цвета, Элементы.ЦветаПроцентЗаливкиКолористов);  
			//Элементы.Переместить(Элементы.ЦветаФорма,  		  Элементы.Цвета, Элементы.ЦветаФормаКод);  
			//
			//Элементы.Переместить(Элементы.ЦветаВидЗаливки,    Элементы.Цвета);
			//Элементы.Переместить(Элементы.ЦветаАнилокс, 	  Элементы.Цвета);   	
			//Элементы.Переместить(Элементы.ЦветаНарезка,  	  Элементы.Цвета); 
			//Элементы.Переместить(Элементы.ЦветаКодМатериала,  Элементы.Цвета); 
			//Элементы.Переместить(Элементы.ЦветаМатериал,  	  Элементы.Цвета); 
			//Элементы.Переместить(Элементы.ЦветаНаправлениеПротяжки,  Элементы.Цвета);
			//Элементы.Переместить(Элементы.ЦветаОснасткаАртикул,   	 Элементы.Цвета);
			//Элементы.Переместить(Элементы.ЦветаОснастка,       		 Элементы.Цвета);
			//Элементы.Переместить(Элементы.ЦветаПодача,         		 Элементы.Цвета);
			//Элементы.Переместить(Элементы.ЦветаЭтикетокВПодаче,   	 Элементы.Цвета);
			//  Элементы.Переместить(Элементы.ЦветаКоличествоРучьевМатериала,   Элементы.Цвета);


			//Элементы.Переместить(Элементы.ЦветаНомерРаботы,   Элементы.Цвета); 
			
			// <-- Начало Лико Яцун С. В. 20.08.2024
			Элем = Элементы.Найти("ВернутьСортировкуКолонок");
			Элементы.Удалить(Элем);
			КнопкаСортировки = Элементы.Добавить("ВыдвинутьКолонкиРабот", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
			КнопкаСортировки.Заголовок 	 = "Работы";
			КнопкаСортировки.ИмяКоманды  = "ВыдвинутьКолонкиРабот";    
			КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;
			КнопкаСортировки.Картинка 	 = БиблиотекаКартинок.НастроитьСписок;  
			
			Элементы.Переместить(Элементы.ЦветаКодМатериала,  			Элементы.Цвета, Элементы.ЦветаФормулаПантона);
			Элементы.Переместить(Элементы.ЦветаМатериал,  	  			Элементы.Цвета, Элементы.ЦветаФормулаПантона);
			Элементы.Переместить(Элементы.ЦветаНаправлениеПротяжки,	  Элементы.Цвета);
		//	Элементы.Переместить(Элементы.ЦветаВидОснастка, 			  Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаЗаказНовойОснастки, 		Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаПодача, 					Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаЭтикетокВПодаче,     	Элементы.Цвета);
			//Элементы.Переместить(Элементы.ЦветаЗаказМатериала,  	  	Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаНарезка,  	 			Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевМатериала,  	Элементы.Цвета);
						
			Элементы.Переместить(Элементы.ВыдвинутьКолонкиРабот, Элементы.Цвета.КоманднаяПанель, Элементы.ЦветаНумератор);
			
			Элементы.Переместить(Элементы.ЦветаТипНумератора,  				Элементы.Цвета);   
			Элементы.Переместить(Элементы.ЦветаТипКода, 	   				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаЗаказНовойОснастки, 			Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаГрамматураНаРЦ, 				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаТрафаретнаяСетка,			Элементы.Цвета);

		КонецЕсли;	
		
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ВыдвинутьКолонкиРабот(Команда)
	
	ЦветаРаботы(ложь);		
	
КонецПроцедуры  

&НаКлиенте
Процедура ВернутьСортировкуКолонок(Команда)
	
	ЦветаРаботы(ложь);
	
КонецПроцедуры


Процедура ЗаполнитьТипЗаливка() 
	
	Для каждого стр из Объект.Цвета Цикл
		Если стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Краска Тогда
			стр.ТипЗаливка = стр.Типцвета1;
		ИначеЕсли  стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Лак или стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Праймер или стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Клей или стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.БесцветнаяМасса  Тогда
			стр.ТипЗаливка = стр.ВидЗаливки;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(стр.Материал) Тогда 
			стр.КодМатериала = стр.Материал.Код;
		КонецЕсли;

	КонецЦикла;

	
КонецПроцедуры 

Процедура ЗаполнитьВидОснастка() 
	
	Для каждого стр из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(стр.Оснастка) Тогда
			стр.ВидОснастка = стр.Оснастка;
		ИначеЕсли ЗначениеЗаполнено(стр.ВидТМЦ) Тогда
			стр.ВидОснастка = стр.ВидТМЦ;
		ИначеЕсли Стр.ВидСекции.Оснастка Тогда
			стр.ВидОснастка = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;  
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
Процедура ЦветаТипЗаливкаПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;
	Если ТипЗнч(стр.ТипЗаливка) = Тип("ПеречислениеСсылка.Лико_ВидЗаливки") Тогда 
			
    	стр.ВидЗаливки = стр.ТипЗаливка;
	Иначе
		стр.ТипЦвета1 = стр.ТипЗаливка;  
		стр.ВидЗаливки = Неопределено;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипЗаливкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекСтр.ВидТМЦ) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		
		Если ТекСтр.ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска") Тогда   
			ДанныеВыбора.ЗагрузитьЗначения(ПолучитьТипыЦвета());	
		Иначе    
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.Сплошная"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.НеСплошная"));
		КонецЕсли;  
	Иначе
		Сообщить("заполните Вид ТМЦ");
	КонецЕсли;

КонецПроцедуры    

&НаСервереБезКонтекста  
Функция ПолучитьТипыЦвета() 
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ТипыЦвета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лико_ТипыЦвета КАК Лико_ТипыЦвета";
	

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") 		
	
	
КонецФункции

&НаКлиенте
Процедура ЦветаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Заголовок = "Ред." Тогда  
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРедактированияПараметровЦвета(Элемент);  
	КонецЕсли;

КонецПроцедуры

 &НаКлиенте
Процедура ОткрытьФормуРедактированияПараметровЦвета(Элемент)

	ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");	
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);

	ТекСтр = Элемент.ТекущиеДанные; 
	
	РеквизитыЦвета = ПолучитьМассивРеквизитовТЧ();
	
	СтруктураПраметрыСекции = Новый Структура;

	Для каждого рек из РеквизитыЦвета Цикл  
		СтруктураПраметрыСекции.Вставить(рек, ТекСтр[рек]); 	
	КонецЦикла;
	
	СтруктураПраметрыСекции.Вставить("ТипЦвета",	 	ТекСтр.ТипЦвета1); 

	СтруктураПраметрыСекции.Вставить("ТипПродукта", 	ЗначениеРеквизита(текстр.Номенклатура,"ЦеноваяГруппа"));   


 
	СтруктураРедактирования = Новый Структура;
	СтруктураРедактирования.Вставить("РежимВыбора", Истина);
	СтруктураРедактирования.Вставить("Секция", ТекСтр.ВидСекции); 
	СтруктураРедактирования.Вставить("ИмяСекции", ТекСтр.НомерСекции);
	СтруктураРедактирования.Вставить("ПараметрыСекцииЦвета", СтруктураПраметрыСекции);  
	СтруктураРедактирования.Вставить("РабочийЦентр", ТекСтр.РабочийЦентр); 
	СтруктураРедактирования.Вставить("Ссылка", Объект.Ссылка); 
	СтруктураРедактирования.Вставить("Площадка", Объект.Площадка); 



	допПараметры = Новый Структура;
	допПараметры.Вставить("КлючСтроки",  ТекСтр.КлючСтроки);
	допПараметры.Вставить("НомерПроката", ТекСтр.НомерПроката);

	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированиеПараметровЦвета", ЭтаФорма, допПараметры);

	ФормаРедактированияСтрока =  ЗначениеРеквизита(ТекСтр.ВидСекции, "ИмяФормыРедактированияПараметров");

	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.РедактированиеПараметровСекции" + ФормаРедактированияСтрока, СтруктураРедактирования, ЭтаФорма, , , , ОбработкаЗакрытия);


КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированиеПараметровЦвета(Результат, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		Возврат
	КонецЕсли;
	
	СтруктураПараметров = Результат;
	
	ТекСтр = Объект.Цвета.НайтиСтроки(новый Структура("КлючСтроки", ДопПараметры.КлючСтроки));
	
	Если ТекСтр.Количество() > 0 Тогда   		
		
		ЗаполнитьЗначенияСвойств(ТекСтр[0], СтруктураПараметров); 
		
		ВидРабот = ЗначениеРеквизита(ТекСтр[0].ВидСекции, "ВидРабот");
		Если НЕ (ЗначениеРеквизита(ТекСтр[0].ВидСекции,"ОтображатьВТЧЦвета") И НЕ ЗначениеРеквизита(ТекСтр[0].ВидСекции,"ОтображатьВТЧРаботы")) Тогда  
			ЗаписатьЦветаВРаботы();
			Если ТекСтр[0].ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка") Тогда 
				Если ЗначениеЗаполнено(текстр[0].Оснастка) Тогда 
					ДопПараметры =  текстр[0].Оснастка;
					Режим = РежимДиалогаВопрос.ДаНет;
					Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииПараметровШтампа", ЭтаФорма, ДопПараметры);
					ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить параметры основного вырубного штампа?'"), Режим,0);
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;    
	
КонецПроцедуры  

Функция ПолучитьМассивРеквизитовТЧ()
	
	реквизитыТЧ = новый массив;
	
	Для каждого ТекПараметр из Метаданные.Справочники.Лико_Спецификации.ТабличныеЧасти.Цвета.Реквизиты Цикл

		 реквизитыТЧ.Добавить(ТекПараметр.Имя);
		
	 КонецЦикла;		
	 
	 возврат реквизитыТЧ

 КонецФункции

&НаКлиенте
Процедура ЦветаРабочийЦентрПриИзменении(Элемент)
	
	текстр = Элементы.Цвета.ТекущиеДанные;	
	Для каждого стр из Объект.Цвета Цикл
		Если стр.номерпроката =текстр.номерпроката и  стр.рабочийЦентр <> текстр.рабочийЦентр Тогда 
			стр.рабочийЦентр = текстр.рабочийЦентр;
		КонецЕсли;
	КонецЦикла;
	
	ЗаписатьЦветаВРаботы() ;
	 
	Если текстр.НомерПроката = 1 Тогда 			
		Объект.РабочийЦентр = текстр.РабочийЦентр;			
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ЦветаОснасткаПриИзменении(Элемент)

	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.Оснастка) Тогда 
		ДопПараметры = текстр.Оснастка;
		Если ЗначениеЗаполнено(Текстр.ВидСекции) Тогда 
		ЭтоТиснение = ЗначениеРеквизита(текстр.ВидСекции, "Тиснение");
			Если текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка") Тогда 
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииПараметровШтампа", ЭтаФорма, ДопПараметры);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить параметры основного вырубного штампа?'"), Режим,0);
		ИначеЕсли ЭтоТиснение ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Конгрев") Тогда	
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Оснастка", текстр.Оснастка);
			ДопПараметры.Вставить("Идентификатор", текстр.ПолучитьИдентификатор() );
			ЗаполнитьПараметрыШтампаТиснения(ДопПараметры);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ТекСтр.ВидОснастка = ТекСтр.Оснастка;
	ДобавитьУсловноеОформлениеЦветаВидОснастка();
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки)
	 
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПараметрыШтампаТиснения(ДопПараметры)
	текстр = Объект.Цвета.НайтиПоИдентификатору(ДопПараметры.Идентификатор);
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Номенклатура КАК Номенклатура,
	|	Лико_ПараметрыШтампа.Нарезка КАК Нарезка,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.Подача = 0
	|			ТОГДА Лико_ПараметрыШтампа.ШагПечати
	|		ИНАЧЕ Лико_ПараметрыШтампа.Подача
	|	КОНЕЦ КАК Подача,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.ЭтикетокВПодаче = 0
	|			ТОГДА Лико_ПараметрыШтампа.ЭтикетокНаЛисте
	|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокВПодаче
	|	КОНЕЦ КАК ЭтикетокВПодаче
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", ДопПараметры.Оснастка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текстр.Нарезка = Выборка.Нарезка;
		текстр.Подача = Выборка.Подача;
		Если Лико_ТиражМетраж.ЭтоКомлект(Объект.Ссылка) Тогда 
			текстр.ЭтикетокВПодаче = Выборка.ЭтикетокВПодаче/2;
		Иначе
			текстр.ЭтикетокВПодаче = Выборка.ЭтикетокВПодаче;
		КонецЕсли;
	КонецЦикла;	 

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЭтМЭР()
	
	текЭтМЭР = ПолучитьЭтМЭРНаСервере();
	Если Объект.ЭтМЭР <> текЭтМЭР Тогда
		Объект.ЭтМЭР = текЭтМЭР;		
	КонецЕсли;

	текВидВырубки = Объект.ВидВырубки;
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		текКоличествоЭтПоДлинеПечатиИндиго = ПолучитьЭтикетокПоДлинеПечатиИндигоНаСервере(текВидВырубки);
		Если текКоличествоЭтПоДлинеПечатиИндиго <> Объект.КоличествоЭтПоДлинеПечатиИндиго Тогда 
			Объект.КоличествоЭтПоДлинеПечатиИндиго = текКоличествоЭтПоДлинеПечатиИндиго;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьЭтикетокПоДлинеПечатиИндигоНаСервере(текВидВырубки)
	Возврат Лико_ТиражМетраж.ПолучитьЭтикетокПоДлинеПечатиИндиго(Объект, текВидВырубки);
КонецФункции

&НаСервере
Функция ПолучитьЭтМЭРНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, Объект.ВидВырубки);
КонецФункции

&НаСервере
Функция ОмегаСНумератором()
	
	текНайденныеСтрокиНумератор = Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.Нумератор));
	Для Каждого ТекСтрока Из текНайденныеСтрокиНумератор Цикл
		Если ВидРЦОмега(ТекСтрока.РабочийЦентр) Тогда
        	Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидРЦОмега(РабочийЦентр)
	
	ВидРЦентра = ЗначениеРеквизита(РабочийЦентр, "ВидРабочегоЦентра");     	
	
	Возврат ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Omega") 
	
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором(иЭтМЭР = Неопределено) 
	
	Объект.ЭтМЭР = ?(ЗначениеЗаполнено(иЭтМЭР),иЭтМЭР,0.4826 / Цел(0.4826/(Объект.ШиринаЭтикетки / 1000 + 0.0027)));
	Если ЗначениеРеквизита(Объект.РабочийЦентр,"ВидРабочегоЦентра") = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") Тогда
		Объект.ЭтикетокНаЛистеИндиго = Объект.КоличествоЭтПоДлинеПечатиИндиго * Объект.РучьиПечатиИндиго;
		Объект.ДлинаПечатиИндиго = Объект.КоличествоЭтПоДлинеПечатиИндиго * Объект.ЭтМЭР
	ИначеЕсли Объект.Ручьи <> 0 Тогда
		Объект.ЭтикетокНаЛистеПечати = Объект.ЭтикетокНаЛисте * Объект.РучьиПечати/Объект.Ручьи;
	КонецЕсли;
	Объект.ШагПечати = Объект.ЭтикетокНаЛисте / Объект.Ручьи * Объект.ЭтМЭР;
	Объект.ПлощадьКлише = (Объект.ШагПечати*100 + 2)*(ЗначениеРеквизита(Объект.Нарезка,"Размер")/10 + 2);
	РасчитатьТиражМетраж(Объект.ВидВырубки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПечати(Заказ, текВидВырубки = Неопределено, СпецификацияСсылка = Неопределено, ПересчетПараметров = Ложь, ПересчитатьНарезку = Истина) Экспорт // --> Начало Лико Митюшин МФМ 18.05.2021

	Если текВидВырубки = 0 ИЛИ (РазрешеноМенятьПараметрыШтампа И ОмегаСНумератором()) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПересчетПараметров Тогда
		Лико_ТиражМетраж.ОчиститьНеИспользуемыПараметрыШтампа(Заказ, текВидВырубки)
	КонецЕсли;
	
	ДлинаСПрипуском = Неопределено;
	КоличествоПоДлинеРапорта = Неопределено;
	Если НЕ (текВидВырубки = 5 И ПересчетПараметров = Ложь ИЛИ текВидВырубки = 18 ИЛИ текВидВырубки = 19) Тогда
		Объект.ДлинаПечати 				= Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, Объект.ВидВырубки);
	КонецЕсли;
	Если текВидВырубки = 18 ИЛИ текВидВырубки = 19 Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДопускМинус) И НЕ ЗначениеЗаполнено(Объект.ДопускПлюс) Тогда
			ВариантыДопусков = Неопределено;		
		КонецЕсли;
		ЗаполнитьРаппорт();
		Если ПересчитатьНарезку Тогда
			Если текВидВырубки = 18 Тогда
				РасчетнаяНарезкаБезОкругления = (Объект.ДлинаЭтикетки/1000) * Объект.РучьиПечати + 0.02;
			ИначеЕсли текВидВырубки = 19 Тогда
				РасчетнаяНарезкаБезОкругления = (Объект.ШиринаЭтикетки/1000) * Объект.РучьиПечати + 0.025;
			КонецЕсли;
			РасчетнаяНарезка = ЗарплатаКадрыКлиентСервер.Округлить(Цел(РасчетнаяНарезкаБезОкругления*1000), 5,ПредопределенноеЗначение("Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону"));
			Объект.Нарезка = Справочники.ЯССМ_Нарезки.НайтиПоНаименованию(РасчетнаяНарезка + 5);
			ЗаполнитьРаппорт();
		КонецЕсли;
		Если текВидВырубки = 18 Тогда
			Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ШиринаЭтикетки/1000)); 
		ИначеЕсли текВидВырубки = 19 Тогда
			Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ДлинаЭтикетки/1000)); 
		КонецЕсли;
		Объект.ПлощадьКлише = Лико_ТиражМетраж.ПолучитьПлощадьКлише(Объект, текВидВырубки);
	КонецЕсли;
	Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере();
	
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 18.05.2021

&НаСервере
Процедура ЗаполнитьРаппорт()
	//Если Объект.РаппортМеняли Тогда
	//	Возврат;	
	//КонецЕсли;
	РаппортДлинаПечати = Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, Объект.ВидВырубки);
	Если РаппортДлинаПечати <> Неопределено Тогда
		Объект.Раппорт = РаппортДлинаПечати.Раппорт;
		Объект.ДлинаПечати = РаппортДлинаПечати.ДлинаПечати;
	Иначе
		Объект.Раппорт = Неопределено;
		Объект.ДлинаПечати = 0;
		Объект.КоличествоЭтПоДлинеПечати = 0;
		Объект.ЭтикетокНаЛистеПечати = 0;
		Объект.ПлощадьКлише = 0; 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭтикетокНаЛистеПечатиНаСервере(ВидВырубкиДляРасчета = Неопределено)
	Если ВидВырубкиДляРасчета = Неопределено Тогда
		Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, Объект.ВидВырубки);
	Иначе
		Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, ВидВырубкиДляРасчета);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ШиринаЭтикеткиПриИзменении(Элемент)
	
	Если Объект.ВидВырубки = 5 ИЛИ (Объект.ВидВырубки = 6 И Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка"))  Тогда
		Заказ = Объект;
		ЗаполнитьЭтМЭР();
		ЭтикеткиИТиражМетражНаКлиенте(Заказ, Объект.ВидВырубки);
		ЗаполнитьДлинаПечатиНаСервере();
	ИначеЕсли Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзмененитьДоступностиПолейНаСервере(текВидВырубки = 0) 
 	//Изменение доступности полей, если Добавлен в Массив значит Только просмотр.
	//МассивЭлементов = ЗаполнениеМассиваЭллементов(текВидВырубки);
	
	текЭлемент = Элементы.ЭтикетокНаЛистеПечати;
	Если Не ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда
		Если текВидВырубки = 5 Тогда
			текЭлемент.ОтображениеПредупрежденияПриРедактировании 	= ОтображениеПредупрежденияПриРедактировании.Отображать;
			текЭлемент.ПредупреждениеПриРедактировании				= "Изменение данного параметра может повлиять на расчеты!";
		Иначе 
			текЭлемент.ОтображениеПредупрежденияПриРедактировании 	= ОтображениеПредупрежденияПриРедактировании.НеОтображать;	
		КонецЕсли;
	ИначеЕсли текЭлемент.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать Тогда 
		текЭлемент.ОтображениеПредупрежденияПриРедактировании 	= ОтображениеПредупрежденияПриРедактировании.НеОтображать;	
	КонецЕсли;
	
	
	//ИзменитьДоступностьОбъектаДляВидаВырубки(МассивЭлементов);
	ВыделениеЦветомПараметровВырубкиВЗависимостиОтТехнологии(текВидВырубки);
	ИзменитьДоступностьОбъектаПоЦвету();
	СделатьПараметрыШтампаНадписьюЕслиТолькоПросмотр();
КонецПроцедуры 

&НаСервере
Процедура ВыделениеЦветомПараметровВырубкиВЗависимостиОтТехнологии(ВидВырубки)
	
	Синий 		= WebЦвета.ГолубойСоСтальнымОттенком;
	Желтый 		= WebЦвета.Лимонный;
	Зеленый 	= WebЦвета.СветлоЗеленый;
	Коричневый 	= WebЦвета.Золотистый;
	НейтральноЗеленый 	= WebЦвета.НейтральноЗеленый;	
	ЦветАвто 	= Новый Цвет();

	//Если нет Вырубного штампа, но есть вид работ вырубка – доступны все параметры печати/вырубки
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) ИЛИ РазрешеноМенятьПараметрыШтампа Тогда 
		текПараметрыОтбора = Новый Структура;
		текПараметрыОтбора.Вставить("ВидСекции", Справочники.Лико_ВидыСекций.Вырубка);	
		текНайденныеСтроки = Объект.Цвета.НайтиСтроки(текПараметрыОтбора);

		Если текНайденныеСтроки.Количество() <> 0 Тогда
			ВыделениеЦветомГруппаШтампа(Зеленый, Зеленый, Зеленый, Зеленый);
			ВыделениеЦветомГруппаПараметрыВырубки(Зеленый, Зеленый, Зеленый, Зеленый); 
			ВыделениеЦветомГруппаПараметрыПечати(Зеленый, Зеленый, Зеленый, Зеленый, Зеленый, Зеленый); 
			ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Зеленый, Зеленый, Зеленый, Зеленый);
			Если ВидВырубки = 18 ИЛИ ВидВырубки = 19 Тогда
				ВыделениеЦветомГруппаПараметрыПечатиОмет(Зеленый, Зеленый, Зеленый, Зеленый);
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ВидВырубки = 1 Тогда		   		
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(Синий, Зеленый, Коричневый, Коричневый, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 2 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый,  ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 3 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Желтый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 4 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, ЦветАвто, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Зеленый, Коричневый, Зеленый, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 5 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, Коричневый, Желтый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Желтый, Коричневый, Желтый, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 6 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, ?(Лико_ТиражМетраж.ЭтоТермоусадка(Объект), Коричневый, Зеленый), Желтый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Желтый, Коричневый, Коричневый, Зеленый, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 7 Тогда	
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Синий, Зеленый, Зеленый, Синий, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 8 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Зеленый, Зеленый, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 9 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Желтый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 10 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, ЦветАвто, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Зеленый, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Зеленый, ЦветАвто,  Зеленый);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 11 Тогда		
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Зеленый, Коричневый, Желтый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 12 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Зеленый, Коричневый, Желтый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 13 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(Синий, Коричневый, Коричневый, Коричневый, ЦветАвто, Желтый); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 14 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Зеленый, Коричневый, Желтый, Зеленый, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 15 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	// <-- Начало Лико Яцун С. В. 13.06.2023	
	//ИначеЕсли ВидВырубки = 16 Тогда
	//	ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
	//	ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Коричневый); 
	//	ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	//	ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый,  ЦветАвто);
	//	ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	//ИначеЕсли ВидВырубки = 17 Тогда
	//	ВыделениеЦветомГруппаШтампа(Синий, Синий, НейтральноЗеленый, Зеленый);
	//	ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Коричневый); 
	//	ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Зеленый, Зеленый, ЦветАвто, ЦветАвто, ЦветАвто); 
	//	ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	//	ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	// <-- Конец Лико Яцун С. В. 13.06.2023	
	ИначеЕсли ВидВырубки = 18 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, ЦветАвто, НейтральноЗеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Желтый, Коричневый, Коричневый, Коричневый, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(Коричневый, Коричневый, Коричневый, Желтый);
	ИначеЕсли ВидВырубки = 19 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, ЦветАвто, НейтральноЗеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Желтый, Коричневый, Коричневый, Коричневый, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(Коричневый, Коричневый, Коричневый, Желтый);
	КонецЕсли;		
	
	Если ВидВырубки = 6 Тогда 
		Элементы.ДлинаПечатиВидимостьИндиго.Видимость = Истина;
	ИначеЕсли Элементы.ДлинаПечатиВидимостьИндиго.Видимость Тогда
		Элементы.ДлинаПечатиВидимостьИндиго.Видимость = Ложь;	
	КонецЕсли;
	
	Если (ВидВырубки = 3 ИЛИ ВидВырубки = 8 ИЛИ ВидВырубки = 11 ИЛИ ВидВырубки = 12) И 
		Объект.Ручьи = Объект.ЭтикетокНаЛисте Тогда 
		Элементы.ШагПечати.ЦветФона = Зеленый;
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ВыделениеЦветомГруппаШтампа(пШиринаЭтикетки, пДлинаЭтикетки, пЭтМЭР, пНарезка)
	Элементы.ШиринаЭтикетки.ЦветФона	= пШиринаЭтикетки;
	Элементы.ДлинаЭтикетки.ЦветФона		= пДлинаЭтикетки;
	Элементы.ЭтМЭР.ЦветФона				= пЭтМЭР;
	Элементы.Нарезка.ЦветФона			= пНарезка;
КонецПроцедуры	

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыВырубки(пШтампВырубнойАртикул, пРучьи, пЭтикетокНаЛисте, пШагПечати)
	Элементы.ШтампВырубнойАртикул.ЦветФона	= пШтампВырубнойАртикул;
	Элементы.Ручьи.ЦветФона					= пРучьи;
	Элементы.ЭтикетокНаЛисте.ЦветФона		= пЭтикетокНаЛисте;
	Элементы.ШагПечати.ЦветФона				= пШагПечати;
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыПечати(пZ, пРучьиПечати, пЭтикетокНаЛистеПечати, пДлинаПечати, пКоличествоЭтПоДлинеПечати, пКоличествоЛистовКнижки)
	Элементы.Z.ЦветФона							= пZ;
	Элементы.РучьиПечати.ЦветФона				= пРучьиПечати;
	Элементы.ЭтикетокНаЛистеПечати.ЦветФона		= пЭтикетокНаЛистеПечати;
	Элементы.ДлинаПечати.ЦветФона				= пДлинаПечати;
	Элементы.КоличествоЭтПоДлинеПечати.ЦветФона	= пКоличествоЭтПоДлинеПечати;
	Элементы.КоличествоЛистовКнижки.ЦветФона	= пКоличествоЛистовКнижки;	
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыПечатиИндиго(пКоличествоКликов, пРучьиПечати, пЭтикетокНаЛисте, пДлинаПечати, пКоличествоЭтПоДлинеПечати, пКоличествоШтамповПоДлинеПечати)
	Элементы.КоличествоКликов.ЦветФона						= пКоличествоКликов;
	Элементы.РучьиПечатиИндиго.ЦветФона						= пРучьиПечати;
	Элементы.ЭтикетокНаЛистеИндиго.ЦветФона					= пЭтикетокНаЛисте;
	Элементы.ДлинаПечатиИндиго.ЦветФона						= пДлинаПечати;
	Элементы.КоличествоЭтПоДлинеПечатиИндиго.ЦветФона		= пКоличествоЭтПоДлинеПечати;
	Элементы.КоличествоШтамповПоДлинеПечатиИндиго.ЦветФона	= пКоличествоШтамповПоДлинеПечати;		
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыПечатиОмет(пРаппорт, пДопускМинус, пДопускПлюс, пВариантыДопусков) // <-- Начало Лико Яцун С. В. 05.07.2023
	Элементы.Раппорт.ЦветФона		= пРаппорт;
	Элементы.ДопускМинус.ЦветФона	= пДопускМинус;
	Элементы.ДопускПлюс.ЦветФона	= пДопускПлюс;
	Элементы.ВариантыДопусков.ЦветФона	= пВариантыДопусков;
КонецПроцедуры // <-- Конец Лико Яцун С. В. 05.07.2023

&НаСервере
Процедура ИзменитьДоступностьОбъектаПоЦвету()
	Если Объект.ВидВырубки = 0 Тогда
		Возврат;
	КонецЕсли;
	//Синий = WebЦвета.ГолубойСоСтальнымОттенком;
	Желтый = WebЦвета.Лимонный;
	Зеленый = WebЦвета.СветлоЗеленый;
	НейтральноЗеленый = WebЦвета.НейтральноЗеленый;
	//Коричневый = WebЦвета.Золотистый;
	ЦветАвто = Новый Цвет();
	
	Для Каждого элМассива Из МассивПараметровШтампа() Цикл
		Если элМассива.ЦветФона = Желтый ИЛИ элМассива.ЦветФона = Зеленый ИЛИ элМассива.ЦветФона = НейтральноЗеленый Тогда
			ЭлМассива.ТолькоПросмотр = Ложь;
		Иначе
			ЭлМассива.ТолькоПросмотр = Истина;
			// --> Начало Лико Митюшин МФМ 23.07.2021
			Если элМассива.ЦветФона = ЦветАвто Тогда
				Если элМассива = Элементы.ШтампВырубнойАртикул Тогда 
					Продолжить;
				КонецЕсли;
				ТекРеквизит = СтрЗаменить(элМассива.ПутьКДанным, "Объект.", "");
				Если ЗначениеЗаполнено(Объект[ТекРеквизит]) Тогда
					Если ТекРеквизит =  "ДлинаПечати" И Элементы.ДлинаПечатиВидимостьИндиго.Видимость Тогда 
						Продолжить;
					КонецЕсли;
					Если ТекРеквизит =  "Z" И Объект.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Weigang Тогда 
						Продолжить;
					КонецЕсли;
					Объект[ТекРеквизит] = Неопределено;
				КонецЕсли;
			КонецЕсли;
			// <-- Конец Лико Митюшин МФМ 23.07.2021
		КонецЕсли;
	КонецЦикла;
	
	//Если Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор ИЛИ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПовторСИзменением Тогда
	//	Элементы.ДлинаЭтикетки.ТолькоПросмотр = Истина;
	//	Элементы.ШиринаЭтикетки.ТолькоПросмотр = Истина;
	//КонецЕсли;
	
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыВырубки);
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыПечати);
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыПечатиИндиго);
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыПечатиОмет);

КонецПроцедуры

&НаСервере
Функция МассивПараметровШтампа()
	МассивЭлементовПараметровШтампа = Новый Массив;
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ШтампВырубнойАртикул);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДлинаЭтикетки);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ШиринаЭтикетки);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Нарезка);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Z);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Ручьи);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.РучьиПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛисте);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛистеПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ШагПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДлинаПечати);
	
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДлинаПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтМЭР);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоЭтПоДлинеПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоЭтПоДлинеПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоШтамповПоДлинеПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоЛистовКнижки);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.РучьиПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Раппорт);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДопускМинус);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДопускПлюс);
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда
		МассивЭлементовПараметровШтампа.Добавить(Элементы.ВариантыДопусков);
	КонецЕсли;	
	Возврат МассивЭлементовПараметровШтампа;	
	
КонецФункции

&НаСервере
Процедура ВидимостьГрупппараметровПечати(ЦветАвто, текГруппа)
	ЭтоВсеБелые = Истина;
	
	Для Каждого текЭлемент из текГруппа.ПодчиненныеЭлементы Цикл
		Если текЭлемент.ЦветФона <> ЦветАвто Тогда
			ЭтоВсеБелые = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если текГруппа.Видимость <> (Не ЭтоВсеБелые) Тогда
		текГруппа.Видимость = (Не ЭтоВсеБелые);
	КонецЕсли;
КонецПроцедуры	    

&НаСервере
Процедура СделатьПараметрыШтампаНадписьюЕслиТолькоПросмотр()

	Для Каждого ЭлМассива Из МассивПараметровШтампа() Цикл
		ТекШирина = ЭлМассива.Ширина; 
		ТекЦвет = ЭлМассива.ЦветФона;
		Если ЭлМассива.ТолькоПросмотр И НЕ РазрешеноМенятьПараметрыШтампа Тогда
			ЭлМассива.Вид = ВидПоляФормы.ПолеНадписи;
			ЭлМассива.Рамка 	= Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
			ЭлМассива.Ширина 	= ?(ЭлМассива = Элементы.Z, 13, ТекШирина);
			ЭлМассива.ЦветФона 	= ТекЦвет;
		Иначе
			Если ЭлМассива.Вид <> ВидПоляФормы.ПолеВвода Тогда
				ЭлМассива.Вид = ВидПоляФормы.ПолеВвода;
				Если РазрешеноМенятьПараметрыШтампа И ЭлМассива.ТолькоПросмотр Тогда 
					ЭлМассива.ТолькоПросмотр = Ложь;
				КонецЕсли;
				ЭлМассива.Ширина 	= ?(ЭлМассива = Элементы.Z, 9, ТекШирина);
				ЭлМассива.ЦветФона 	= ТекЦвет;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Текстр = Элементы.Цвета.ТекущиеДанные;	
	Если ЗначениеЗаполнено(Текстр.Материал) Тогда 
 		Текстр.КодМатериала = ЗначениеРеквизита(Текстр.Материал, "Код");
	КонецЕсли;
	
	СпецификацияОбъект = Объект;
	ПроверитьВырубнойШтамп();
	ПроставитьВидВырубки(СпецификацияОбъект,,Истина);
	ИзмененитьДоступностиПолейНаСервере(СпецификацияОбъект.ВидВырубки);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВырубнойШтамп()
	Если ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда 
		строки = Объект.Цвета.НайтиСтроки(Новый Структура("Оснастка", Объект.ШтампВырубной));
		Если строки.количество() = 0 Тогда 
			Объект.ШтампВырубной = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			//ОчиститьВсеПараметрыШтампа();		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаПослеУдаления(Элемент)
	
	СпецификацияОбъект = Объект;
	ПроверитьВырубнойШтамп();
	ПроставитьВидВырубки(СпецификацияОбъект,,Истина);
	ИзмененитьДоступностиПолейНаСервере(СпецификацияОбъект.ВидВырубки);

	ЗаписатьЦветаВРаботы();

КонецПроцедуры

&НаКлиенте
Процедура ДлинаЭтикеткиПриИзменении(Элемент)
	Если Объект.ВидВырубки = 5 ИЛИ (Объект.ВидВырубки = 6 И Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка")) Тогда
		ЗаполнитьЭтМЭР();
		Заказ = Объект;
		ЭтикеткиИТиражМетражНаКлиенте(Заказ, Объект.ВидВырубки);
		ЗаполнитьДлинаПечатиНаСервере();
	ИначеЕсли Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтМЭРПриИзменении(Элемент)
	текВидВырубки = Объект.ВидВырубки;
	Если текВидВырубки = 6 Тогда
		ЗаполнитьДлинуПечатиИндиго();		
	КонецЕсли;	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		текКоличествоЭтПоДлинеПечатиИндиго = ПолучитьЭтикетокПоДлинеПечатиИндигоНаСервере(текВидВырубки);
		Если текКоличествоЭтПоДлинеПечатиИндиго <> Объект.КоличествоЭтПоДлинеПечатиИндиго Тогда 
			Объект.КоличествоЭтПоДлинеПечатиИндиго = текКоличествоЭтПоДлинеПечатиИндиго;	
		КонецЕсли;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И текВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором(Объект.ЭтМЭР);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДопускМинусПриИзменении(Элемент)
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДопускПлюсПриИзменении(Элемент)
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантыДопусковПриИзменении(Элемент)
	
	Если ВариантыДопусков <> 0 Тогда 
		Если ВариантыДопусков = 1 Тогда
			Объект.ДопускМинус = 1;
			Объект.ДопускПлюс = 0;
		ИначеЕсли ВариантыДопусков = 2 Тогда
			Объект.ДопускМинус = 0.5;
			Объект.ДопускПлюс = 0.5;
		ИначеЕсли ВариантыДопусков = 3 Тогда
			Объект.ДопускМинус = 0;
			Объект.ДопускПлюс = 1;
		КонецЕсли;
	Иначе	
		Объект.ДопускМинус = 0;
		Объект.ДопускПлюс = 0;
	КонецЕсли;
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаппортПриИзменении(Элемент)
	
	текВидВырубки = ?(Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка"),19,18);
	
	Объект.ДлинаПечати = ЗначениеРеквизита(Объект.Раппорт, "ДлинаПечати") / 1000;
	Если текВидВырубки = 19 Тогда
		Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ДлинаЭтикетки/1000));
	ИначеЕсли текВидВырубки = 18 Тогда
		Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ШиринаЭтикетки/1000)); 
	КонецЕсли;

	ЗаполнитьПлощадьКлишеНаСервере(текВидВырубки);
	Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере(текВидВырубки);
	Объект.РаппортМеняли = Истина;

КонецПроцедуры

&НаКлиенте
Процедура РучьиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ZПриИзменении(Элемент)
	// --> Начало Лико Митюшин МФМ 19.05.2021
	Если Не ЗначениеЗаполнено(Объект.ВидВырубки) Тогда
		Объект.ВидВырубки = ПолучитьВидВырубкиНаСервере();	
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 19.05.2021

	Если Объект.ВидВырубки = 1 ИЛИ  Объект.ВидВырубки = 7 ИЛИ Объект.ВидВырубки = 13 Тогда
		ЗаполнитьДлинаПечатиНаКлиенте();
	ИначеЕсли Объект.ВидВырубки = 3 ИЛИ Объект.ВидВырубки = 9 Тогда 
		ЗаполнитьДлинаПечатиНаКлиенте();
	    ЗаполнитьЭтМЭР();
		ЗаполнитьЭтикетокНаЛистеПечатиФлексо();
		Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере();
	КонецЕсли;
	ПараметрыШтампаПриИзменении();
КонецПроцедуры

&НаСервере
Функция ПолучитьВидВырубкиНаСервере()		// --> Начало Лико Митюшин МФМ 25.03.2021
	
	Возврат Лико_ТиражМетраж.ПолучитьВидВырубки(Объект);
	
КонецФункции		// <-- Конец Лико Митюшин МФМ 25.03.2021

&НаКлиенте
Процедура ЗаполнитьДлинаПечатиНаКлиенте()
	текДлинаПечати = ПолучитьДлинуПечатиНаСервере();
	Если текДлинаПечати <> Объект.ДлинаПечати Тогда
		Объект.ДлинаПечати = текДлинаПечати;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтикетокНаЛистеПечатиФлексо()
	текКоличествоЭтПоДлинеПечати = ПолучитьЭтикетокНаЛистеПечатиФлексоНаСервере();
	Если Объект.КоличествоЭтПоДлинеПечати <> текКоличествоЭтПоДлинеПечати Тогда 
		Объект.КоличествоЭтПоДлинеПечати = текКоличествоЭтПоДлинеПечати;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭтикетокНаЛистеПечатиФлексоНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечатиФлексо(Объект);
КонецФункции

&НаКлиенте
Процедура РучьиПечатиПриИзменении(Элемент)
	
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	
	Заказ = Объект;
	ЭтикеткиИТиражМетражНаКлиенте(Заказ, Объект.ВидВырубки);

	Если Объект.ВидВырубки = 1 Тогда
		Объект.ЭтМЭР = ПолучитьЭтМЭРНаСервере();	
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ВидРЦИндиго(Объект.РабочийЦентр) И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтикетокНаЛистеПечатиПриИзменении(Элемент)
	Если Объект.ВидВырубки = 5 Тогда
		ПараметрыШтампаПриИзменении();
	КонецЕсли;
КонецПроцедуры    

&НаКлиенте
Процедура ДлинаПечатиПриИзменении(Элемент)
	текВидВырубки = Объект.ВидВырубки;
	Если текВидВырубки = 5 ИЛИ текВидВырубки = 4 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 12 Тогда
		Если текВидВырубки = 5 Тогда
			ЗаполнитьЭтМЭР();
			ЗаполнитьZ(Объект,текВидВырубки);
		ИначеЕсли текВидВырубки = 11 ИЛИ текВидВырубки = 12 ИЛИ текВидВырубки = 14 Тогда  
			ЗаполнитьZ(Объект,текВидВырубки);
			ЗаполнитьЭтикетокНаЛистеПечатиФлексо();
			ЗаполнитьЭтикеткиПечати(текВидВырубки);
		ИначеЕсли текВидВырубки = 4 Тогда
			ЗаполнитьZ(Объект,текВидВырубки);
		КонецЕсли;
		Заказ = Объект;
		ЭтикеткиИТиражМетражНаКлиенте(Заказ, Объект.ВидВырубки);
	КонецЕсли;
КонецПроцедуры     

&НаСервереБезКонтекста
Функция ВидРЦИндиго(РабочийЦентр)
	
	ВидРЦентра = ЗначениеРеквизита(РабочийЦентр, "ВидРабочегоЦентра");
	
	Возврат ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo")
	
КонецФункции

&НаКлиенте
Процедура КоличествоЭтПоДлинеПечатиПриИзменении(Элемент)
	ТекВидВырубки = Объект.ВидВырубки;
	Если ТекВидВырубки = 3 Тогда
		ЗаполнитьЭтикеткиПечати(ТекВидВырубки);	
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура КоличествоЛистовКнижкиПриИзменении(Элемент)
	Если Объект.ВидВырубки = 13 Тогда
		Объект.РучьиПечати = Объект.КоличествоЛистовКнижки * Объект.Ручьи;
		Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере();
		ЗаполнитьЭтМЭР();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭтПоДлинеПечатиИндигоПриИзменении(Элемент)
	ЗаполнитьЭтикетокНаЛистеИндиго();
	ЗаполнитьДлинуПечатиИндиго();
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором(Объект.ЭтМЭР);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтикетокНаЛистеИндиго()
	текьЭтикетокНаЛисте = ПолучитьЭтикетокНаЛистеИндигоНаСервере();
	Если текьЭтикетокНаЛисте <> Объект.ЭтикетокНаЛистеИндиго Тогда
		Объект.ЭтикетокНаЛистеИндиго = текьЭтикетокНаЛисте;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДлинуПечатиИндиго()
	текДлинаПечати = ПолучитьДлинуПечатиИндигоНаСервере();
	Если текДлинаПечати <> Объект.ДлинаПечатиИндиго Тогда
		Объект.ДлинаПечатиИндиго = текДлинаПечати;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДлинуПечатиИндигоНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьДлинуПечатиИндиго(Объект, Объект.ВидВырубки);	
КонецФункции

&НаСервере
Функция ПолучитьЭтикетокНаЛистеИндигоНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(Объект, Объект.ВидВырубки);	
КонецФункции

&НаКлиенте
Процедура ЦветаВидОснасткаПриИзменении(Элемент)

	стр = Элементы.Цвета.ТекущиеДанные;
	Если ТипЗнч(стр.ВидОснастка) = Тип("СправочникСсылка.Лико_ВидыТМЦ") И ЗначениеРеквизита(стр.ВидСекции,"ИспользоватьВидТМЦ") И ЗначениеЗаполнено(стр.ВидОснастка) Тогда 
    	стр.ВидТМЦ = стр.ВидОснастка;
		стр.Оснастка = Неопределено;
	
		реквизитыТЧ = ПолучитьМассивРеквизитовТЧ();
		//очистка строки
		для Каждого текРек из реквизитыТЧ цикл
			
			Если текРек = "РабочийЦентр" ИЛИ текРек = "Номерработы" ИЛИ текРек = "ВидПечати" ИЛИ  текРек = "ВидСекции" ИЛИ текРек = "ВидТМЦ" ИЛИ  текРек = "КлючСтроки" ИЛИ  текРек = "НомерПроката" ИЛИ  текРек = "НомерВарианта" Тогда 
				Продолжить;
			Иначе
				стр[текРек] = неопределено;
			КонецЕсли;
			//Если текРек = "Вал" ИЛИ текРек = "Форма" Тогда
			//	Стр.ВалФорма = стр[текРек];
			//КонецЕсли;
		КонецЦикла;
		
		ВидЗаливки = ПолучитьВидЗаливкиПоУмолчанию(стр.ВидСекции, стр.ВидТМЦ);
		
		стр.ВидЗаливки = ВидЗаливки;
		стр.ТипЗаливка = ВидЗаливки;
		
	ИначеЕсли ТипЗнч(стр.ВидОснастка) = Тип("СправочникСсылка.Номенклатура") И ЗначениеРеквизита(стр.ВидСекции,"Оснастка") И ЗначениеЗаполнено(стр.ВидОснастка) Тогда
		стр.Оснастка = стр.ВидОснастка;
		стр.ВидТМЦ = Неопределено;
		ДобавитьУсловноеОформлениеЦветаВидОснастка();
		ЗаписатьЦветаВРаботы();
		ЗаполнениеПараметровОснастки(); 
	Иначе
		стр.ВидОснастка = Неопределено;
		стр.Оснастка = Неопределено;  
		стр.ВидТМЦ = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПараметровОснастки()
	текстр = Элементы.Цвета.ТекущиеДанные;   
	Если ЗначениеЗаполнено(текстр.Оснастка) Тогда 
		//Если ЗначениеЗаполнено(Текстр.ВидРабот) Тогда 
		//	РезультатПроверки = ПоверитьСоответствиеОснасткиВидыРабот(текстр.Оснастка, Текстр.ВидРабот);
		//	Если Не РезультатПроверки Тогда 
		//		текстр.Оснастка =  ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		//Иначе		
		ЭтоТиснение = ЗначениеРеквизита(текстр.ВидСекции, "Тиснение");
		Если текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка") Тогда 
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииПараметровШтампа", ЭтаФорма, текстр.Оснастка);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить параметры основного вырубного штампа?'"), Режим,0);
		ИначеЕсли ЭтоТиснение ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Конгрев") Тогда	
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Оснастка", текстр.Оснастка);
			ДопПараметры.Вставить("Идентификатор", текстр.ПолучитьИдентификатор() );
			ЗаполнитьПараметрыШтампаТиснения(ДопПараметры);	
					
		КонецЕсли;

	Иначе
		ПроверитьВырубнойШтамп();
		РасчитатьТиражМетраж(Объект.ВидВырубки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦветаВидОснасткаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекСтр.ВидСекции) Тогда
		Если ЗначениеРеквизита(ТекСтр.ВидСекции,"Оснастка") Тогда   
			Обработка = НайтиВПФ("Обработка ""Штампер""");
			Если Обработка <> Неопределено Тогда 
				ПараметрыОткрытия = Новый Структура;
				ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
				ПараметрыОткрытия.Вставить("ВидРабот",ЗначениеРеквизита(текстр.ВидСекции, "ВидРабот"));
				Если ЗначениеЗаполнено(текстр.Рабочийцентр) Тогда 
					ПараметрыОткрытия.Вставить("РабочийЦентр", текстр.Рабочийцентр);
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.Площадка) Тогда 
					ПараметрыОткрытия.Вставить("Площадка", Объект.Площадка);
				КонецЕсли;
				Если ЗначениеЗаполнено(текстр.Оснастка) Тогда 
					ПараметрыОткрытия.Вставить("Оснастка",текстр.Оснастка );
				КонецЕсли;
				ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
				ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаУпр", ПараметрыОткрытия,Элементы.ЦветаОснастка ,,,, Новый ОписаниеОповещения("ВыборЗавершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;	
		ИначеЕсли ЗначениеРеквизита(ТекСтр.ВидСекции,"ИспользоватьВидТМЦ") Тогда    
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Лак")); 
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Клей"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Праймер"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.БесцветнаяМасса"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Чернила"));
		ИначеЕсли НЕ ЗначениеРеквизита(ТекСтр.ВидСекции,"Оснастка") И НЕ ЗначениеРеквизита(ТекСтр.ВидСекции,"ИспользоватьВидТМЦ") Тогда
			ТекСтр.ВидОснастка = Неопределено;
		КонецЕсли;  
	Иначе
		Сообщить("Заполните Вид работ");
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура ВыборЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	текстр = Элементы.Цвета.ТекущиеДанные;
    ВидРабот = ЗначениеРеквизита(текстр.ВидСекции, "ВидРабот");
	Если РезультатЗакрытия <> Неопределено Тогда
		текстр.оснастка = РезультатЗакрытия;
		текстр.ВидОснастка = РезультатЗакрытия;
		ЗаписатьЦветаВРаботы(); 
		Если текстр.ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка")
			ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское")
			ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеСНумератором")
			ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Конгрев") Тогда 
			ЗаполнениеПараметровОснастки();
		КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВидТМЦПриИзменении(Элемент)
	стр = Элементы.Цвета.ТекущиеДанные;  
	стр.ВидОснастка = стр.ВидТМЦ;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент) 
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ПересчитатьКоличествоВесНаСервере(ТекущаяСтрока.ПолучитьИдентификатор(),Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКоличествоВесНаСервере(Идентификатор,Имя) 
	
	Если Найти(Имя, "Товары") > 0 Тогда
		стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор); 
	ИначеЕсли Найти(Имя, "Стоимость") > 0 Тогда
		стр = Объект.Стоимость.НайтиПоИдентификатору(Идентификатор); 
	КонецЕсли;
	
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда
		Если Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Пакеты Тогда
			ШагПечати = Объект.ЭтМЭР;
			ШиринаН = Объект.ДлинаЭтикетки*2/1000 + Объект.ГлубинаДнаПакета*2/1000
		ИначеЕсли Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
			ШагПечати = Объект.ЭтМЭР;
			ШиринаН = Объект.ШиринаЭтикетки/1000;
		Иначе
			ШагПечати = Объект.ЭтМЭР;
			ШиринаН = Объект.ДлинаЭтикетки/1000;
		КонецЕсли;
		
		лРучьи = ?(ЗначениеЗаполнено(Объект.РучьиПечати),Объект.РучьиПечати,Объект.РучьиПечатиИндиго);
		
		Если ЗначениеЗаполнено(ШиринаН) И ЗначениеЗаполнено(ШагПечати) И ЗначениеЗаполнено(лРучьи) Тогда
			Если Имя = "ТоварыКоличество" ИЛИ Имя = "СтоимостьКоличество" Тогда
				Если ЗначениеЗаполнено(стр.Количество) Тогда
					МетражПМПоКоличеству = стр.Количество*1000*ШагПечати/лРучьи;
					МетражКвМПоКоличеству = МетражПМПоКоличеству*(ШиринаН)*лРучьи;
					стр.Вес = Окр(МетражКвМПоКоличеству*((((УдельныйВесПоЦеновымГруппамЗаказа() + УдельныйВесКраскиЗаказа())/1000)+ ВесЗиппера(ШагПечати))),3);
					//ШтукВОдномМетреКвадратном = ШагПечати * ШиринаН;
					//ВесОдногоИзделия = ((УдельныйВесПоЦеновымГруппамЗаказа() + УдельныйВесКраскиЗаказа())/1000) * ШтукВОдномМетреКвадратном;
					//стр.Вес = Окр(ВесОдногоИзделия * стр.Количество * 1000,3);
					Если Имя = "СтоимостьКоличество" И ЗначениеЗаполнено(Стр.Стоимость) И ЗначениеЗаполнено(стр.Вес) Тогда
						Стр.Стоимость1Кг = Стр.Стоимость/стр.Вес
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Имя = "ТоварыВес" ИЛИ Имя = "СтоимостьВес" Тогда
				Если ЗначениеЗаполнено(стр.Вес) Тогда
					МетражКвМПоВесу = МетражКвМПоУдельномуВесу(стр.Вес,ШагПечати);
					МетражПМПоВесу = МетражКвМПоВесу/((ШиринаН)*лРучьи);
					КоличествоПоВесу = Окр(МетражПМПоВесу/ШагПечати*лРучьи,3);
					стр.Количество = КоличествоПоВесу/1000;
					Если Имя = "СтоимостьКоличество" И ЗначениеЗаполнено(Стр.Стоимость) И ЗначениеЗаполнено(стр.Вес) Тогда
						Стр.Стоимость1Кг = Стр.Стоимость/стр.Вес
					КонецЕсли;
					//стр.КоличествоУпаковок = КоличествоПоВесу/1000;
				КонецЕсли;                                                      
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция УдельныйВесПоЦеновымГруппамЗаказа()
	УдельныйВесОсновногоМатериала = 0;
	УдельныйВесМатериалаВидовРабот = 0;
	УдельныйВес = 0;
	Если ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда
		Если ТипЗнч(Объект.ОсновнойМатериал) = ТИП("СправочникСсылка.ЦеновыеГруппы") Тогда
			ОсновнойМатериал = Объект.ОсновнойМатериал
		Иначе
			ОсновнойМатериал = Объект.ОсновнойМатериал.ЦеноваяГруппа;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОсновнойМатериал.Лико_УдельныйВес) Тогда
			УдельныйВесОсновногоМатериала = ОсновнойМатериал.Лико_УдельныйВес;
			УдельныйВесМатериалаВидовРабот = 0;
			Для каждого стр Из Объект.Цвета Цикл
				Если ЗначениеЗаполнено(стр.Материал) И стр.НомерВарианта = 1 Тогда
					МатериалВидовРабот = стр.Материал;
					Если ТипЗнч(МатериалВидовРабот) = ТИП("СправочникСсылка.ЦеновыеГруппы") И ЗначениеЗаполнено(МатериалВидовРабот.Лико_УдельныйВес) Тогда
						УдельныйВесМатериалаВидовРабот = УдельныйВесМатериалаВидовРабот + МатериалВидовРабот.Лико_УдельныйВес;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	УдельныйВес = УдельныйВесОсновногоМатериала + УдельныйВесМатериалаВидовРабот; 
	Возврат УдельныйВес;
КонецФункции

&НаСервере
Функция УдельныйВесКраскиЗаказа()
	
	УдельныйВесКраски = 0;
	Для каждого стрЦвета Из Объект.Цвета Цикл
		Если стрЦвета.НомерВарианта = 1 Тогда 
			Если ЗначениеЗаполнено(стрЦвета.Грамматура) Тогда
				Грамматура = стрЦвета.Грамматура
			Иначе
				Грамматура = 1;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стрЦвета.ПроцентЗаливки) Тогда
				ПроцентЗаливки = стрЦвета.ПроцентЗаливки/100;
			Иначе
				ПроцентЗаливки = 100/100;
			КонецЕсли;
			
			Если стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ГлубокаяПечать ИЛИ стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ГлубокаяЛаминация Тогда	
				Если ЗначениеЗаполнено(стрЦвета.ТипКраски.Лико_УдельныйВес) Тогда
					УдельныйВесКраски = УдельныйВесКраски + (стрЦвета.ТипКраски.Лико_УдельныйВес * ПроцентЗаливки);
				КонецЕсли;
				Продолжить;
			ИначеЕсли стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ФлексоПечать Тогда
				КоэффициентКраскопереносаФлексоКраскиДляВеса = РегистрыСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(ТекущаяДата(),Новый Структура("Площадка,Коэффициент",Объект.Площадка.Организация,Справочники.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаФлексоКраскиДляВеса));
				Если КоэффициентКраскопереносаФлексоКраскиДляВеса.Количество() > 0 Тогда
					КоэффициентКраскопереносаФлексоКраскиДляВеса = КоэффициентКраскопереносаФлексоКраскиДляВеса[0].Значение;
				Иначе
					Сообщить("Для организации " + Объект.Площадка.Организация + " не установлено значение ""Коэффициент краскопереноса флексо краски для веса""");
				КонецЕсли;
				УдельныйВесКраски = УдельныйВесКраски + (Грамматура * ПроцентЗаливки * КоэффициентКраскопереносаФлексоКраскиДляВеса);
				Продолжить;
			ИначеЕсли стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ОфсетнаяПечать ИЛИ стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.БессольвентнаяЛаминация Тогда	
				УдельныйВесКраски = УдельныйВесКраски + (Грамматура * ПроцентЗаливки);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат УдельныйВесКраски;
	
КонецФункции

&НаСервере
Функция ВесЗиппера(ШагПечати)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Лико_СпецификацииЦвета.Ссылка КАК Ссылка,
	               |	Лико_СпецификацииЦвета.ВидСекции КАК ВидРабот
	               |ИЗ
	               |	Справочник.Лико_Спецификации.Цвета КАК Лико_СпецификацииЦвета
	               |ГДЕ
	               |	Лико_СпецификацииЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.УстановкаЗиппера)
	               |	И Лико_СпецификацииЦвета.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	КоличествоЗип = Результат.Количество();
	Вес = КоличествоЗип*(4*Объект.Ручьи/1000)*ШагПечати;
	Возврат Вес;
КонецФункции

&НаСервере
Функция МетражКвМПоУдельномуВесу(стрВес,ШагПечати)
	УдельныйВес = УдельныйВесПоЦеновымГруппамЗаказа();
	УдельныйВесКраски = УдельныйВесКраскиЗаказа();
	МетражКвМ = 0;
	Если ЗначениеЗаполнено(стрВес) И УдельныйВес <> 0 Тогда
		МетражКвМ = стрВес/(((УдельныйВес + УдельныйВесКраски)/1000)+ ВесЗиппера(ШагПечати));
	КонецЕсли;
	
	Возврат МетражКвМ;
КонецФункции

&НаКлиенте
Процедура ТоварыВесПриИзменении(Элемент)
	ИдентификторСтроки = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	Имя = Элемент.Имя;
	ПересчитатьКоличествоВесНаСервере(ИдентификторСтроки,Имя);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда
		Элементы.СтоимостьВес.Видимость = Истина;
		Элементы.ТоварыВес.Видимость = Истина;
		Элементы.СтоимостьСтоимость1Кг.Видимость = Истина;
	Иначе
		Элементы.СтоимостьВес.Видимость = Ложь;
		Элементы.ТоварыВес.Видимость = Ложь;
		Элементы.СтоимостьСтоимость1Кг.Видимость = Ложь;
	КонецЕсли;    
	
	Если Объект.Площадка <> Справочники.Лико_Площадки.Урал Тогда
		Элементы.ДлинаЭтикетки.Заголовок = "Высота этикетки"
	Иначе
		Элементы.ДлинаЭтикетки.Заголовок = "Длина этикетки";
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьВесПриИзменении(Элемент)
	ТекСтр = Элементы.Стоимость.ТекущиеДанные;
	ИдентификторСтроки = Элементы.Стоимость.ТекущиеДанные.ПолучитьИдентификатор();
	Имя = Элемент.Имя;
	ПересчитатьКоличествоВесНаСервере(ИдентификторСтроки,Имя);
	
	ВыполнитьрасчетТиражМетраж(ИдентификторСтроки,Объект.ВидВырубки,Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипКраскиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	
	Если текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор")  Тогда 
		ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");
		
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
			
		СтандартнаяОбработка = ложь;
		
		текПараметрыВыбора = Новый Структура;		
		текПараметрыВыбора.Вставить("ВидТМЦ", ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Чернила"));	
		текПараметрыВыбора.Вставить("Площадка", Объект.Площадка);	
		текПараметрыВыбора.Вставить("ВидСекции", ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор"));
		текПараметрыВыбора.Вставить("ЭлементИмя", "ТипПродукта"); 
		текПараметрыВыбора.Вставить("ТипНумератора", ТекСтр.ТипНумератора); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораЦГ", ЭтаФорма);                      	
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаВыбораЦГ", текПараметрыВыбора, ЭтаФорма,,,,ОбработкаВыбора);
		
		
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаНазваниеПриИзменении(Элемент)
	стр = Элементы.Цвета.ТекущиеДанные;

	//Если ЗначениеЗаполнено(стр.ФормулаПантона) Тогда 
	//	стр.ФормулаПантона =  ПустаяСсылка("Лико_ФормулыПантонов");
	//КонецЕсли;
	//ОчиститьНоменклатураФормулаПантона(стр) ;
	стр.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	стр.ФормулаПантона = ПредопределенноеЗначение("Справочник.Лико_ФормулыПантонов.ПустаяСсылка"); 
	
КонецПроцедуры


&НаКлиенте
Процедура ЦветаНазваниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	текстр = Элементы.Цвета.ТекущиеДанные;
	
	Если Текстр.типЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Pmc") Тогда 
		Если Текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			//ПараметрыФормы.Вставить("ВидПечати", текстр.видпечати);  
			ПараметрыФормы.Вставить("ВидСекции", текстр.ВидСекции);

			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПантона", ЭтаФорма);
			ОткрытьФорму("Справочник.Лико_Пантоны.Форма.ФормаВыбора", ПараметрыФормы , , , , , ОписаниеОповещения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПантона(Результат, Параметры) Экспорт  
	
	Если Результат <> Неопределено Тогда 
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_Пантоны") ТОгда 
			текстр = Элементы.Цвета.ТекущиеДанные;
			Если Текстр<>Неопределено Тогда 
				текстр.название = Результат;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦветаГрамматураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.ВидСекции) Тогда
		Если текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ТрафаретнаяПечать") Тогда 
			СтандартнаяОбработка = Ложь;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораГр", ЭтаФорма);
			ОткрытьФорму("Справочник.Лико_ТрафаретныеСетки.ФормаВыбора", ,ЭтаФорма , , , , ОписаниеОповещения);
		ИначеЕсли ЗначениеРеквизита(текстр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЦифровойМодуль") Тогда
			СтандартнаяОбработка = Ложь;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораГр", ЭтаФорма);
			ОткрытьФорму("Справочник.Лико_ГрамматураНаРЦ.ФормаВыбора", ,ЭтаФорма , , , , ОписаниеОповещения);
		КонецЕсли;
	Иначе
		Сообщить("Заполните Вид работ");
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораГр(Результат, Параметры) Экспорт  
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если Результат <> Неопределено И текстр <> Неопределено Тогда 
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_ТрафаретныеСетки") ТОгда 
			текстр.ТрафаретнаяСетка = Результат;
			текстр.Грамматура = ЗначениеРеквизита(Результат,"Грамматура");
			Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
		ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_ГрамматураНаРЦ") Тогда
			текстр.ГрамматураНаРЦ = Результат;
			текстр.Грамматура = ЗначениеРеквизита(Результат,"Грамматура");
			Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
		КонецЕсли;
	Иначе
		Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаНовыйВалПриИзменении(Элемент)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;   
	Если ТекСтр.НовыйВал Тогда
		ТекСтр.Вал = Неопределено;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Форма) Тогда
		Если ЗначениеРеквизита(ТекущиеДанные.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") Тогда
			Грамматура = ЗначениеРеквизита(ТекущиеДанные.Форма,"Грамматура");
			ПроцентЗаливки = ЗначениеРеквизита(ТекущиеДанные.Форма,"ПроцентЗаливки");
			Если ЗначениеЗаполнено(Грамматура) Тогда
				ТекущиеДанные.Грамматура = Грамматура * 0.5;
			Иначе
				
			КонецЕсли;
			Если ЗначениеЗаполнено(ПроцентЗаливки) Тогда
				ТекущиеДанные.ПроцентЗаливки = ПроцентЗаливки;
			Иначе
				
			КонецЕсли;
			ВалСвязанныйСФормой = ПолучитьВалСвязанныйСФормой(ТекущиеДанные.Форма); 
			Если ЗначениеЗаполнено(ВалСвязанныйСФормой) И ТипЗнч(ВалСвязанныйСФормой) = Тип("СправочникСсылка.Номенклатура") Тогда
				ТекущиеДанные.Вал = ВалСвязанныйСФормой;
				Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
			ИначеЕсли ЗначениеЗаполнено(ВалСвязанныйСФормой) И ТипЗнч(ВалСвязанныйСФормой) = Тип("Массив") Тогда
				ПараметыФормы = Новый Структура("Заголовок,ФормаОтбор","Выберие Вал",ТекущиеДанные.Форма);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВала", ЭтаФорма);
				ОткрытьФорму("РегистрСведений.Лико_ВалыФормы.Форма.ФормаВыбораВала",ПараметыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалСвязанныйСФормой(ФормаСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лико_ВалыФормыСрезПоследних.Период КАК ДатаПрихода,
	//|	Лико_ВалыФормыСрезПоследних.Вал.Артикул КАК ВалАртикул,
	//|	Лико_ВалыФормыСрезПоследних.Вал КАК Вал
	//|ИЗ
	//|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(, Форма = &Форма) КАК Лико_ВалыФормыСрезПоследних";
	"ВЫБРАТЬ
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВалыПерегравировкаВсе
	|ИЗ
	|	РегистрНакопления.Лико_ЗаявкиНаГравировкуВалов.Остатки КАК Лико_ЗаявкиНаГравировкуВаловОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.Помещение.Лико_ПомещениеБрака) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ЗаявкиНаГравировкуВаловОстатки.Вал = ТоварыВЯчейкахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(3999, 12, 31) КАК ДатаПрихода,
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.Вал.Артикул КАК ВалАртикул,
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВалыПерегравировка
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.Помещение.Лико_ПомещениеБрака) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗаявкиНаГравировкуВалов.Остатки(, Форма = &Форма) КАК Лико_ЗаявкиНаГравировкуВаловОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = Лико_ЗаявкиНаГравировкуВаловОстатки.Вал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ВалыФормыСрезПоследних.Период КАК ДатаПрихода,
	|	Лико_ВалыФормыСрезПоследних.Вал.Артикул КАК ВалАртикул,
	|	Лико_ВалыФормыСрезПоследних.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВалы
	|ИЗ
	|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(, Форма = &Форма) КАК Лико_ВалыФормыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								ВТВалыПерегравировка.Вал КАК Вал
	|							ИЗ
	|								ВТВалыПерегравировка КАК ВТВалыПерегравировка)
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								ВТВалыПерегравировкаВсе.Вал КАК Вал
	|							ИЗ
	|								ВТВалыПерегравировкаВсе КАК ВТВалыПерегравировкаВсе)) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ВалыФормыСрезПоследних.Вал = ТоварыВЯчейкахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВалы.ДатаПрихода КАК ДатаПрихода,
	|	ВТВалы.ВалАртикул КАК ВалАртикул,
	|	ВТВалы.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВсеВалы
	|ИЗ
	|	ВТВалы КАК ВТВалы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТВалыПерегравировка.ДатаПрихода,
	|	ВТВалыПерегравировка.ВалАртикул,
	|	ВТВалыПерегравировка.Вал
	|ИЗ
	|	ВТВалыПерегравировка КАК ВТВалыПерегравировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТВсеВалы.ДатаПрихода КАК ДатаПрихода,
	|	ВТВсеВалы.ВалАртикул КАК ВалАртикул,
	|	ВТВсеВалы.Вал КАК Вал
	|ИЗ
	|	ВТВсеВалы КАК ВТВсеВалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПрихода";
	
	Запрос.УстановитьПараметр("Форма", ФормаСсылка);
	
	ТЗВалы = Запрос.Выполнить().Выгрузить();
	
	МассивВалы = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗВалы);
	Если МассивВалы.Количество() = 1 Тогда
		Возврат МассивВалы[0].Вал;
	ИначеЕсли МассивВалы.Количество() > 1 Тогда
		Возврат МассивВалы;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
					
КонецФункции

&НаКлиенте
Процедура ПослеВыбораВала(Результат, Параметры) Экспорт  
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если Результат <> Неопределено И текстр <> Неопределено Тогда 
		текстр.Вал = Результат;
		Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
	Иначе
		Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
    
    ПараметрыОткрытия = Новый Структура("Ключ,Заказ", ТекСтр.Форма,Объект.Ссылка);
    
    Обработчик = Новый ОписаниеОповещения("ФормаЗавершениеОткрытия", ЭтотОбъект);
    
    ОткрытьФорму("Справочник.Лико_Формы.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, , , , Обработчик,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ФормаЗавершениеОткрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	
	Если ТекСтр.Грамматура <> ЗначениеРеквизита(ТекСтр.Форма,"Грамматура") ИЛИ ТекСтр.ПроцентЗаливки <> ЗначениеРеквизита(ТекСтр.Форма,"ПроцентЗаливки") Тогда
		
		ТекСтр.Грамматура = ЗначениеРеквизита(ТекСтр.Форма,"Грамматура") * 0.5;
		ТекСтр.ПроцентЗаливки = ЗначениеРеквизита(ТекСтр.Форма,"ПроцентЗаливки");
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаМатериалПриИзменении(Элемент)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
 	ТекСтр.КодМатериала = ЗначениеРеквизита(ТекСтр.Материал,"Код"); 
		
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормулаПантонаПриИзменении(Элемент)
	
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда
		
		текстр = Элементы.Цвета.ТекущиеДанные;
		Если ЗначениеЗаполнено(текстр.формулапантона) Тогда 
			ЦГ = ЗначениеРеквизита(текстр.ФормулаПантона,"ЦеноваяГруппа");
			Номенклатура =  ЗначениеРеквизита(текстр.ФормулаПантона,"Номенклатура");
			//Если ЗначениеЗаполнено(ЦГ) Тогда  
			текстр.ТипКраски = ЦГ;
			//КонецЕсли;   
			//Если ЗначениеЗаполнено(Номенклатура) Тогда  
			текстр.Номенклатура = Номенклатура;
			//КонецЕсли;   
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаПриИзменении(Элемент)
	
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда	
		текстр = Элементы.Цвета.ТекущиеДанные;
		Если ЗначениеЗаполнено(текстр.формулапантона) Тогда 
			ЦГ = ЗначениеРеквизита(текстр.ФормулаПантона,"ЦеноваяГруппа");
			Номенклатура =  ЗначениеРеквизита(текстр.ФормулаПантона,"Номенклатура");
			//Если ЗначениеЗаполнено(ЦГ) Тогда  
				текстр.ТипКраски = ЦГ;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Номенклатура) Тогда  
				текстр.Номенклатура = Номенклатура;
			//КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЦветаНоменклатураПриИзменении(Элемент)
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.номенклатура) Тогда
		//20230531 Проверяем соответствие реквизитов  
		ЦеноваяГруппа =  ЗначениеРеквизита(текстр.Номенклатура,"ЦеноваяГруппа");
		Если ЗначениеРеквизита(ЦеноваяГруппа, "Лико_ВидТМЦ") <> текстр.ВидТМЦ Тогда 
			Сообщить("Выбранная номенклатура не соответствует указанному Виду ТМЦ"); 
			текстр.номенклатура = Неопределено;  
			Возврат;
		КонецЕсли;	
		//20190715 - меняем не "Тип краски", а "Тип краски факт"  
		//20230317 - убираем тип краски Факт из конфигурации, меняем Тип краски
		текстр.типкраски = ЦеноваяГруппа; 
		//20181213 - Оля Артамонова и В. Ли просили сделать так
		//текстр.Название = ЗначениеРеквизита(текстр.ТипКраски, "Наименование");
		Если Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда
			текстр.Название = ЗначениеРеквизита(текстр.Номенклатура, "Артикул");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипНумератораПриИзменении(Элемент)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	ТекСтр.ТипКода = ПредопределенноеЗначение("Справочник.Лико_ТипыКодов.ПустаяСсылка");
	ТекСтр.КоличествоРучьевНумератора = 0;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипНумератораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(текстр.РабочийЦентр) Тогда 
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьТипыНумератора(текстр.РабочийЦентр))  ;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипНумератораОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
		
	ТекСтр = Элементы.Цвета.ТекущиеДанные;  
	Номенклатура = ПолучитьОсновныеЧернила(ВыбранноеЗначение) ;
	Если Номенклатура <> 0 Тогда
		ТекСтр.Номенклатура = Номенклатура;   
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипКодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(текстр.ТипНумератора) Тогда 
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьТипыКодов(текстр.ТипНумератора))  ;   
	Иначе
		Сообщить("Необходимо сначала заполнить Тип нумератора в этой строке");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаКоличествоРучьевНумератораПриИзменении(Элемент)
		
	ТекСтр = Элементы.Цвета.ТекущиеДанные;   
	
	Если не ЗначениеЗаполнено(ТекСтр.ВидСекции) и не ЗначениеЗаполнено(ТекСтр.РабочийЦентр) Тогда		
		Сообщить("Необходимо сперва заполнить Вид работ и Рабочий центр");
		ТекСтр.КоличествоРучьевНумератора = 0;
		Возврат		
	КонецЕсли;
	
	Если ТекСтр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда
						
		Если  Не ЭтоЦифра(ТекСтр.РабочийЦентр)  Тогда  
			Если не ЗначениеЗаполнено(ТекСтр.ТипНумератора) Тогда  
	
				Сообщить( "Необходимо заполнить Тип нумератора");
				ТекСтр.КоличествоРучьевНумератора  = 0 ;

				Возврат
			КонецЕсли;

			МаксКолРучьев =  ПолучитьКоличествоРучьев(текстр.ТипНумератора, текстр.РабочийЦентр); 
			Если МаксКолРучьев = 0 Тогда  
				Сообщить(СтрШаблон("в спр ""Типы нумераторов"" для нумератора %1 не заполнено максимальное количество ручьев для рабочего цетнра %2",  
				текстр.ТипНумератора,  текстр.РабочийЦентр ));   
				ТекСтр.КоличествоРучьевНумератора  = 0 ;
				Возврат
			КонецЕсли; 
			
			Если  ТекСтр.КоличествоРучьевНумератора > МаксКолРучьев	Тогда 
				ТекСтр.КоличествоРучьевНумератора  = МаксКолРучьев;
				Сообщить(СтрШаблон("Максимум ручьев для РЦ %2 при нумераторе %3 - %1", МаксКолРучьев, текстр.РабочийЦентр, текстр.ТипНумератора ));			
			КонецЕсли; 				
		КонецЕсли;  
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЦМИК(Команда)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда
		
		ТекСтр.ТипЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.C"); 
		ТекСтр.ТипЗаливка = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.C");
		ВидСекции = ТекСтр.ВидСекции;
		НомерПроката = ТекСтр.НомерПроката;
		ВидПечати = ТекСтр.ВидПечати;
		ВидТМЦ = ТекСтр.ВидТМЦ; 
		ТекСтрРабочийЦентр = ТекСтр.РабочийЦентр;
		
		
		МассивЦМИК = новый Массив;
		МассивЦМИК.Добавить(ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.M")); 
		МассивЦМИК.Добавить(ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Y"));
		МассивЦМИК.Добавить(ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.K"));
		
		
		Для сч = 0 По МассивЦМИК.ВГраница() Цикл
			
			Нстр = Объект.Цвета.Добавить();
			Нстр.НомерВарианта = 1;
			Нстр.НомерПроката = НомерПроката;
			КлючСтроки = Новый УникальныйИдентификатор;
			Нстр.КлючСтроки = КлючСтроки;
			Нстр.ВидСекции = ВидСекции;
			Нстр.ВидПечати = ВидПечати;
			Нстр.ВидТМЦ     = ВидТМЦ;
			Нстр.РабочийЦентр = ТекСтрРабочийЦентр;
			Нстр.ВидОснастка = ВидТМЦ;

			Нстр.ТипЦвета1 = МассивЦМИК[сч];
			Нстр.ТипЗаливка = МассивЦМИК[сч]; 
			
			
		КонецЦикла;
	Иначе
		Сообщить("Укажите первую строку и заполните в ней Вид работ!");
	КонецЕсли;
	


КонецПроцедуры     

&НаКлиенте
Процедура Нумератор(Команда)
	
	ПереместитьКолонкиДляНумератора();
				
КонецПроцедуры 


Процедура ПереместитьКолонкиДляНумератора()
	
	Если Элементы.Найти("ВыдвинутьКолонкиРабот") = Неопределено Тогда
		Элементы.Переместить(Элементы.ЦветаТипНумератора,  Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);   
		Элементы.Переместить(Элементы.ЦветаТипКода, 	   Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки); 
		Элементы.Переместить(Элементы.ЦветаТипКраскиКод,   Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);  
		Элементы.Переместить(Элементы.ЦветаТипКраски, 	   Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);   
		
		Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки); 
		Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);
	Иначе
		Элементы.Переместить(Элементы.ЦветаТипНумератора,  Элементы.Цвета, Элементы.ЦветаВидОснастка);   
		Элементы.Переместить(Элементы.ЦветаТипКода, 	   Элементы.Цвета, Элементы.ЦветаВидОснастка); 
		Элементы.Переместить(Элементы.ЦветаТипКраскиКод,   Элементы.Цвета, Элементы.ЦветаВидОснастка);  
		Элементы.Переместить(Элементы.ЦветаТипКраски, 	   Элементы.Цвета, Элементы.ЦветаВидОснастка);   
		
		Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета, Элементы.ЦветаВидОснастка); 
		Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета, Элементы.ЦветаВидОснастка);
	КонецЕсли;
	
КонецПроцедуры 

