
&Вместо("СформироватьДанныеЗаполненияПоЛико_БланкЭтапа")
Процедура Лико_СформироватьДанныеЗаполненияПоЛико_БланкЭтапа(ДанныеСформированы)
	
		
	Если ДанныеСформированы  
		Или  ТипЗнч(Основание) <> Тип("ДокументОбъект.Лико_БланкЭтапа") Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	Лико_БланкЭтапаТовары.Упаковка КАК Упаковка,
	|	Лико_БланкЭтапаТовары.ВозвратКоличество КАК КоличествоСим,
	|	Лико_БланкЭтапаТовары.ВозвратКоличествоУУ КАК Количество,
	|	Лико_БланкЭтапаТовары.СкладОтправитель КАК СкладОтправитель,
	|	Лико_БланкЭтапаТовары.СкладПолучатель КАК СкладПолучатель,
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	Лико_БланкЭтапаТовары.ВозвратКоличествоУУ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВтСерии
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.СкладОтправитель <> Лико_БланкЭтапаТовары.СкладПолучатель
	|	И Лико_БланкЭтапаТовары.ВозвратКоличествоУУ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_БланкЭтапаВыпуск.Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Характеристика,
	|	Лико_БланкЭтапаВыпуск.Упаковка,
	|	Лико_БланкЭтапаВыпуск.Количество,
	|	Лико_БланкЭтапаВыпуск.КоличествоУУ,
	|	Лико_БланкЭтапаВыпуск.СкладОтправитель,
	|	Лико_БланкЭтапаВыпуск.СкладПолучатель,
	|	Лико_БланкЭтапаВыпуск.Серия,
	|	Лико_БланкЭтапаВыпуск.КоличествоУУ
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаВыпуск.СкладОтправитель <> Лико_БланкЭтапаВыпуск.СкладПолучатель
	|	И НЕ Лико_БланкЭтапаВыпуск.ПоАктуРазборки
	|	И НЕ Лико_БланкЭтапаВыпуск.Ссылка.ПоАктуРазборки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСерии.Номенклатура КАК Номенклатура,
	|	ВтСерии.Характеристика КАК Характеристика,
	|	ВтСерии.Упаковка КАК Упаковка,
	|	СУММА(ВтСерии.Количество) КАК Количество,
	|	ВтСерии.СкладОтправитель КАК СкладОтправитель,
	|	ВтСерии.СкладПолучатель КАК СкладПолучатель,
	|	ВтСерии.Серия КАК Серия,
	|	ЯССМ_ОбъектыНоменклатуры.Уникальный КАК Уникальный,
	|	СУММА(ВтСерии.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВтОбъектНоменклатуры
	|ИЗ
	|	ВтСерии КАК ВтСерии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|		ПО (ЯССМ_ОбъектыНоменклатуры.Серия = ВтСерии.Серия)
	|ГДЕ
	|	ВтСерии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтСерии.Упаковка,
	|	ВтСерии.СкладОтправитель,
	|	ВтСерии.Номенклатура,
	|	ВтСерии.Характеристика,
	|	ВтСерии.СкладПолучатель,
	|	ЯССМ_ОбъектыНоменклатуры.Уникальный,
	|	ВтСерии.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВтОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВтОбъектНоменклатуры.Характеристика КАК Характеристика,
	|	ВтОбъектНоменклатуры.СкладОтправитель КАК СкладОтправитель,
	|	ВтОбъектНоменклатуры.СкладПолучатель КАК СкладПолучатель,
	|	ВтОбъектНоменклатуры.Серия КАК Серия,
	|	ВтОбъектНоменклатуры.Уникальный КАК Уникальный,
	|	Лико_СерииНоменклатурыДопСрезПоследних.Организация КАК Организация,
	|	Лико_СерииНоменклатурыДопСрезПоследних.ВидЗапаса КАК ВидЗапаса,
	|	Лико_СерииНоменклатурыДопСрезПоследних.ВидЗапаса КАК Лико_ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ВтОбъектНоменклатуры.Количество < ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА ВтОбъектНоменклатуры.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ВтОбъектНоменклатуры.Количество < ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА ВтОбъектНоменклатуры.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВтИтог
	|ИЗ
	|	ВтОбъектНоменклатуры КАК ВтОбъектНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СерииНоменклатурыДоп.СрезПоследних(
	|				&Дата,
	|				Серия В
	|					(ВЫБРАТЬ
	|						МАКСИМУМ(ОН.Серия)
	|					ИЗ
	|						ВтОбъектНоменклатуры КАК ОН
	|					СГРУППИРОВАТЬ ПО
	|						ОН.Серия)) КАК Лико_СерииНоменклатурыДопСрезПоследних
	|		ПО ВтОбъектНоменклатуры.Серия = Лико_СерииНоменклатурыДопСрезПоследних.Серия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Дата,
	|				(Номенклатура, Характеристика, Назначение, Склад, Серия) В
	|					(ВЫБРАТЬ
	|						ВтОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|						ВтОбъектНоменклатуры.Характеристика КАК Характеристика,
	|						ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка) КАК Назначение,
	|						ВтОбъектНоменклатуры.СкладОтправитель КАК СкладОтправитель,
	|						ВтОбъектНоменклатуры.Серия КАК Серия
	|					ИЗ
	|						ВтОбъектНоменклатуры КАК ВтОбъектНоменклатуры
	|					СГРУППИРОВАТЬ ПО
	|						ВтОбъектНоменклатуры.Серия,
	|						ВтОбъектНоменклатуры.СкладОтправитель,
	|						ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка),
	|						ВтОбъектНоменклатуры.Характеристика,
	|						ВтОбъектНоменклатуры.Номенклатура)) КАК ТоварыНаСкладахОстатки
	|		ПО ВтОбъектНоменклатуры.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВтОбъектНоменклатуры.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И ВтОбъектНоменклатуры.Серия = ТоварыНаСкладахОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВтИтог.Номенклатура КАК Номенклатура,
	|	ВтИтог.Характеристика КАК Характеристика,
	|	ВтИтог.СкладОтправитель КАК СкладОтправитель,
	|	ВтИтог.СкладПолучатель КАК СкладПолучатель,
	|	ВтИтог.Серия КАК Серия,
	|	ВтИтог.Уникальный КАК Уникальный,
	|	ВтИтог.Организация КАК Организация,
	|	ВтИтог.ВидЗапаса КАК ВидЗапаса,
	|	ВтИтог.Лико_ВидЗапасов КАК Лико_ВидЗапасов,
	|	ВтИтог.Количество КАК Количество,
	|	ВтИтог.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.Номенклатура КАК Номенклатура,
	|	ВтИтог.Характеристика КАК Характеристика,
	|	ВтИтог.Лико_ВидЗапасов КАК Лико_ВидЗапасов,
	|	ВтИтог.Организация КАК Организация,
	|	СУММА(ВтИтог.Количество) КАК Количество,
	|	СУММА(ВтИтог.КоличествоУпаковок) КАК КоличествоУпаковок
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтИтог.Номенклатура,
	|	ВтИтог.Характеристика,
	|	ВтИтог.Организация,
	|	ВтИтог.Лико_ВидЗапасов";
	
	Запрос.УстановитьПараметр("Ссылка",Основание.Ссылка ); 
	//Запрос.УстановитьПараметр("Дата",Основание.Дата );
	Запрос.УстановитьПараметр("Дата", Новый Граница(Основание.Ссылка.МоментВремени(), ВидГраницы.Включая));

	
	МассивПакетов = Запрос.ВыполнитьПакет();
	
	ТзСерии =МассивПакетов[3].Выгрузить();	
	ТзТовары =МассивПакетов[4].Выгрузить();	
	
	Если ТзСерии.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	
	ДанныеЗаполнения.Дата = Основание.Дата;
	ДанныеЗаполнения.Организация = Основание.Организация;
	ДанныеЗаполнения.Подразделение = Основание.Подразделение;
	ДанныеЗаполнения.СкладОтправитель = ТзСерии[0].СкладОтправитель;
	ДанныеЗаполнения.СкладПолучатель = ТзСерии[0].СкладПолучатель;
	ДанныеЗаполнения.Товары =  ТзТовары; 
	ДанныеЗаполнения.Серии =  ТзСерии;

	
	
	ДанныеСформированы = Истина;
	
КонецПроцедуры 
