#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формирует массив видов рабочего времени, обозначающих время, затраченное за целый день.
Функция ЦелодневныеВидыРабочегоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЦелодневноеНеотработанное);
	
	Возврат ВидыВремени;
	
КонецФункции

// Формирует массив видов рабочего времени, обозначающих время, затраченное за неполную рабочую смену
// (внутрисменные отклонения или работу неполный рабочий день).
Функция НецелодневныеВидыРабочегоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеНеотработанное);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);
	
	Возврат ВидыВремени;
	
КонецФункции

// Формирует массив видов рабочего времени, обозначающих отработанное время.
Функция ВидыОтработанногоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеСверхНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы);
	
	Возврат ВидыВремени;
	
КонецФункции

// Возвращает способ учета времени, используемый в документах отклонений, в зависимости от параметра "Внутрисменное".
Функция ВидВремениДокументовОтклонений(ПризнакЧасовоеОтклонение) Экспорт
	Возврат ?(ПризнакЧасовоеОтклонение, ЧасовоеНеотработанное, ЦелодневноеНеотработанное);
КонецФункции

// Возвращает все способы учета времени, используемые в документах отклонений.
Функция ВидыВремениДокументовОтклонений() Экспорт
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(ВидВремениДокументовОтклонений(Ложь));
	ВидыВремени.Добавить(ВидВремениДокументовОтклонений(Истина));
	Возврат ВидыВремени;
КонецФункции

#КонецОбласти

#КонецЕсли