
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		// регистр Лико_ОкончаниеСмены 
		Движение = Движения.Лико_ОкончаниеСмены.Добавить();
		Движение.Период = Дата;
		Движение.ФизЛицо = ТекСтрокаСписокСотрудников.ФизЛицо;
		Движение.Смена = Смена;
		Движение.ТабельныйНомер = ТекСтрокаСписокСотрудников.ТабельныйНомер;
		Движение.КоличествоТиражей = ТекСтрокаСписокСотрудников.КоличествоТиражей;
		Движение.КоличествоРоликов = ТекСтрокаСписокСотрудников.КоличествоРоликов;
		Движение.КоличествоМест = ТекСтрокаСписокСотрудников.КоличествоМест;
		Движение.КоличествоКвМетров = ТекСтрокаСписокСотрудников.КоличествоКвМетров;
		Движение.КоличествоРоликовВКоробке = ТекСтрокаСписокСотрудников.КоличествоРоликовВКоробке;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
