
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Структура = Новый Структура;
	Структура.Вставить("ЦветСтеллажа",ЦветСтеллажа);
	
	ТекущийОбъект.ДопНастройки = Новый ХранилищеЗначения(Структура, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопНастройки=Объект.Ссылка.ДопНастройки.Получить();  
	
	Если   ТипЗнч(ДопНастройки)=Тип("Структура") Тогда
		
		ДопНастройки.Свойство("ЦветСтеллажа");		   
		ЦветСтеллажа= ДопНастройки.ЦветСтеллажа;
		
		
	КонецЕсли;
	
	
КонецПроцедуры
