
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Структура = Новый Структура;
	Структура.Вставить("ЦветСтеллажа",ЦветСтеллажа);
	
	ТекущийОбъект.ДопНастройки = Новый ХранилищеЗначения(Структура, Новый СжатиеДанных(9));
	КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопНастройки=Объект.Ссылка.ДопНастройки.Получить();  
	
	Если   ТипЗнч(ДопНастройки)=Тип("Структура") Тогда
		
		ДопНастройки.Свойство("ЦветСтеллажа");		   
		ЦветСтеллажа= ДопНастройки.ЦветСтеллажа;
		
		
	КонецЕсли; 
	
	ЗаполнитьРазмерыЭтажа();
	
	
КонецПроцедуры

&НаСервере
Функция РассчитатьВысотуЭтажа(Этаж)
	
		Если Этаж>1 Тогда
		НайденныеСтроки =Объект.Этажи.НайтиСтроки(Новый Структура("НомерСтроки",Этаж-1));
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Возврат НайденнаяСтрока.Типоразмер.Высота+НайденнаяСтрока.ВысотаОтПола+НайденнаяСтрока.Зазор+НайденнаяСтрока.ВысотаБалки;
			
		КонецЦикла;
	Иначе 
		Возврат 0;	
	КонецЕсли;	
	
	
КонецФункции  

&НаКлиенте
Процедура ЭтажиПриИзменении(Элемент)
	
	
	
	

КонецПроцедуры

Процедура ЗаполнитьРазмерыЭтажа() //+--->Лико m.shenderov 10.07.2026
	
	Для каждого Этаж Из Объект.Этажи Цикл 
		
		ЗаполнитьЗначенияСвойств(Этаж,Этаж.Типоразмер);
		
	КонецЦикла;
	
КонецПроцедуры //-<---Лико m.shenderov 10.07.2026

Процедура РасситатьТипоразмерыЭтажа() //+--->Лико m.shenderov 10.07.2026
	
	Для каждого Этаж Из Объект.Этажи Цикл 
		
		Этаж.Типоразмер=Справочники.Лико_ТипоразмерыСкладскихСекций.НайтиСоздатьТипоразмер(Этаж.Высота,Этаж.Ширина,Этаж.Глубина,Этаж.Вес);
		
		Этаж.ВысотаОтПола= РассчитатьВысотуЭтажа(Этаж.НомерСтроки) ;
	КонецЦикла;
	
КонецПроцедуры //-<---Лико m.shenderov 10.07.2026

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьРазмерыЭтажа() ;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьРазмерыЭтажа() ;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
РасситатьТипоразмерыЭтажа();

КонецПроцедуры


