#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция Код(Значение) Экспорт
	
	Если Значение = Прием Тогда
		Возврат 1;
	ИначеЕсли Значение = Перевод Тогда
		Возврат 2;
	ИначеЕсли Значение = Переименование Тогда
		Возврат 3;
	ИначеЕсли Значение = УстановлениеВторойПрофессии Тогда
		Возврат 4;
	ИначеЕсли Значение = Увольнение Тогда
		Возврат 5;
	ИначеЕсли Значение = ЗапретЗаниматьДолжность Тогда
		Возврат 6;
	ИначеЕсли Значение = Приостановление Тогда
		Возврат 7;
	ИначеЕсли Значение = Возобновление Тогда
		Возврат 8;
	ИначеЕсли Значение = НачалоДоговораГПХ Тогда
		Возврат 9;
	ИначеЕсли Значение = ОкончаниеДоговораГПХ Тогда
		Возврат 10;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли