
Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = Направление.Наименование+ ?(ЗначениеЗаполнено(ВнутреннийДиаметр), ", "+ ВнутреннийДиаметр, " ,") + ?(ЗначениеЗаполнено(МаксимальныйДиаметрРулона), ", "+ МаксимальныйДиаметрРулона, " ,")+
		?(ЗначениеЗаполнено(КоличествоЭтикетокВРолике), ", "+ КоличествоЭтикетокВРолике, ", ")+?(ПродольнаяРезка=Истина, ", прод.", ", ")+ 
        ?(ПоперечнаяРезка=Истина, ", попереч.", ", ") + ?(ЗначениеЗаполнено(Кромка), ", "+ Кромка, ", ");

	Конецесли;

КонецПроцедуры
