
&НаСервере
Процедура Лико_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЕСли РольДоступна("Лико_УстановкаТоварныхОграничений") Тогда
		ТолькоПросмотр=Ложь;
	КонецЕсли;
	 	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
			Если Параметры.Свойство("ЗначенияЗаполнения") Тогда	
				Если  Параметры.ЗначенияЗаполнения.Свойство("ЭтоДействующийПараметр") Тогда
					Запись.ЭтоДействующийПараметр=Параметры.ЗначенияЗаполнения.ЭтоДействующийПараметр;
				КонецЕсли;
				Если  Параметры.ЗначенияЗаполнения.Свойство("ОбеспечениеЗаказовПриПоддержанииЗапаса") Тогда					
					Запись.ОбеспечениеЗаказовПриПоддержанииЗапаса=Параметры.ЗначенияЗаполнения.ОбеспечениеЗаказовПриПоддержанииЗапаса;
				КонецЕсли;
				Если  Параметры.ЗначенияЗаполнения.Свойство("МетодОбеспеченияПотребностей") Тогда					
					Запись.МетодОбеспеченияПотребностей=Параметры.ЗначенияЗаполнения.МетодОбеспеченияПотребностей;
				КонецЕсли;
				

			КонецЕсли;			
	КонецЕсли;	

		
КонецПроцедуры
