
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтатусЗакрытИспользуется() Экспорт
	
	Возврат  ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления")
		Или ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты");
	
КонецФункции 

#КонецОбласти

#КонецЕсли


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	//+ Лико m.shenderov 01.06.2018
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Лико_Создан); 
	//- Лико m.shenderov 01.06.2018
	
	// <-- Начало Лико Яцун С. В. 23.10.2024 
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Лико_Отменен); 
	// <-- Конец Лико Яцун С. В. 23.10.2024
	
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.НеСогласован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Согласован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	
	Если ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолногоПоступления")
		ИЛИ ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыПоставщикамБезПолнойОплаты") Тогда
		
		ДанныеВыбора.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
