
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьКоличествоИСтоимостьНЧКосвенных();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоИСтоимостьНЧКосвенных()
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда 
		НЧЗаПериод = (Объект.ДатаОкончания- Объект.ДатаНачала)/3600;	
		ВсегоМашин = Объект.НормочасыКосвенных.Итог("КоэффициентУчетаВремени");
		Если ЗначениеЗаполнено(НЧЗаПериод) И ЗначениеЗаполнено(ВсегоМашин) Тогда 
			СтоимостьНЧПриПолнойЗагрузке = Объект.КосвенныеЗатраты.Итог("Сумма")/(НЧЗаПериод*ВсегоМашин);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаСервере
Процедура ЗаполнитьЗатратыНаСервере()
	
	Объект.Затраты.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ПОМЕСТИТЬ ВТИсключений
	|ИЗ
	|	Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка
	|ИЗ
	|	Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьБезНДСРасход + СебестоимостьТоваровОбороты.ДопРасходыБезНДСРасход) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов > 0
	|				ТОГДА СебестоимостьТоваровОбороты.КоличествоРасход / СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|			ИНАЧЕ СебестоимостьТоваровОбороты.КоличествоРасход
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ ВТСклад
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Площадка
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа.Лико_РасчетКакОсновнойКраски
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВТИсключений.ЦеноваяГруппа КАК ЦеноваяГруппа
	|						ИЗ
	|							ВТИсключений КАК ВТИсключений)
	|				И АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.ГП)) КАК СебестоимостьТоваровОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|		ПО СебестоимостьТоваровОбороты.Регистратор = Лико_ПередачаТоваров.Распоряжение
	|			И (Лико_ПередачаТоваров.БракМатериала = ИСТИНА)
	|ГДЕ
	|	(СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров)
	|	И ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|				ТОГДА СебестоимостьТоваровОбороты.Регистратор.СкладПолучатель.ЦеховаяКладовая
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Лико_ПередачаТоваров.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров
	|				ТОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура <> СебестоимостьТоваровОбороты.Регистратор.Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСклад.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВТСклад.Стоимость КАК Стоимость,
	|	ВТСклад.Количество КАК Количество,
	|	ВТСклад.Стоимость / ВТСклад.Количество КАК ЦенаФакт
	|ПОМЕСТИТЬ ВТФакт
	|ИЗ
	|	ВТСклад КАК ВТСклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТФакт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВТФакт.Стоимость КАК Стоимость,
	|	ВТФакт.Количество КАК Количество,
	|	ВТФакт.ЦенаФакт КАК ЦенаФакт,
	|	СУММА(ЕСТЬNULL(Лико_ЗатратыПоЗаказуОбороты.КоличествоПланОборот, 0)) КАК КоличествоПлан
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТФакт КАК ВТФакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				,
	|				РабочийЦентр.Лико_Площадка.Организация = &Площадка
	|					И НЕ ДавальческоеСырье) КАК Лико_ЗатратыПоЗаказуОбороты
	|		ПО (ВТФакт.ЦеноваяГруппа = Лико_ЗатратыПоЗаказуОбороты.Затрата
	|				ИЛИ ВТФакт.ЦеноваяГруппа = Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТФакт.ЦенаФакт,
	|	ВТФакт.Стоимость,
	|	ВТФакт.Количество,
	|	ВТФакт.ЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.ЦеноваяГруппа.Код КАК КодЦг,
	|	ВТРасчет.ЦеноваяГруппа КАК Затрата,
	|	ВТРасчет.Стоимость КАК Стоимость,
	|	ВТРасчет.Количество КАК Количество,
	|	ЕСТЬNULL(ВТРасчет.КоличествоПлан, 0) КАК КоличествоПлан,
	|	ВТРасчет.ЦенаФакт КАК ЦенаФакт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТРасчет.КоличествоПлан, 0) > 0
	|			ТОГДА ВТРасчет.Стоимость / ВТРасчет.КоличествоПлан
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаТабашФакт
	|ИЗ
	|	ВТРасчет КАК ВТРасчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодЦг"    ;     
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Площадка", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = Объект.Затраты.добавить();
		заполнитьзначенияСвойств(стр, выборка);
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗатраты(Команда)
	ЗаполнитьЗатратыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставныезатратыНаСервере()
	Объект.СоставныеЗатраты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка КАК ЦГ,
		|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа КАК ЦГБазы
		|ПОМЕСТИТЬ ВТЦГИБазы
		|ИЗ
		|	Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа,
		|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЦГИБазы.ЦГБазы КАК ЦГБазы
		|ПОМЕСТИТЬ ВТБазы
		|ИЗ
		|	ВТЦГИБазы КАК ВТЦГИБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЦГИБазы.ЦГБазы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТЦГИБазы.ЦГ
		|ИЗ
		|	ВТЦГИБазы КАК ВТЦГИБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЦГИБазы.ЦГ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЦГИБазы.ЦГБазы КАК ЦГБазы
		|ПОМЕСТИТЬ ВТБазыОбщие
		|ИЗ
		|	ВТЦГИБазы КАК ВТЦГИБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЦГИБазы.ЦГБазы
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТЦГИБазы.ЦГ) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	СУММА(СебестоимостьТоваровОбороты.СтоимостьБезНДСРасход + СебестоимостьТоваровОбороты.ДопРасходыБезНДСРасход) КАК Стоимость,
		|	СУММА(ВЫБОР
		|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов > 0
		|				ТОГДА СебестоимостьТоваровОбороты.КоличествоРасход / СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
		|			ИНАЧЕ СебестоимостьТоваровОбороты.КоличествоРасход
		|		КОНЕЦ) КАК Количество
		|ПОМЕСТИТЬ ВТСклад
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Площадка
		|				И АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа В
		|					(ВЫБРАТЬ
		|						ВТБазы.ЦГБазы КАК ЦеноваяГруппа
		|					ИЗ
		|						ВТБазы КАК ВТБазы)) КАК СебестоимостьТоваровОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
		|		ПО (ВЫБОР
		|				КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
		|					ТОГДА СебестоимостьТоваровОбороты.Регистратор = Лико_ПередачаТоваров.Распоряжение
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|			И (Лико_ПередачаТоваров.БракМатериала = ИСТИНА)
		|ГДЕ
		|	(СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
		|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
		|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров)
		|	И СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория = &Склад
		|	И ВЫБОР
		|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|				ТОГДА СебестоимостьТоваровОбороты.Регистратор.СкладПолучатель.ЦеховаяКладовая
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И Лико_ПередачаТоваров.Ссылка ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров
		|				ТОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура <> СебестоимостьТоваровОбороты.Регистратор.Номенклатура
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСклад.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	СУММА(Лико_ЗатратыПоЗаказуОбороты.КоличествоПланОборот) КАК КоличествоПлан,
		|	ВТСклад.Стоимость КАК Стоимость,
		|	ВТСклад.Количество КАК Количество
		|ПОМЕСТИТЬ ВТпланБазы
		|ИЗ
		|	ВТСклад КАК ВТСклад
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				,
		|				РабочийЦентр.Лико_Площадка.Организация = &Площадка
		|					И НЕ ДавальческоеСырье) КАК Лико_ЗатратыПоЗаказуОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
		|			ПО Лико_ЗатратыПоЗаказуОбороты.Затрата = ЦеновыеГруппыБазаРасчетаЦены.Ссылка
		|		ПО ВТСклад.ЦеноваяГруппа = Лико_ЗатратыПоЗаказуОбороты.Затрата
		|ГДЕ
		|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСклад.ЦеноваяГруппа,
		|	ВТСклад.Стоимость,
		|	ВТСклад.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТпланБазы.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВТпланБазы.КоличествоПлан КАК КоличествоПлан,
		|	ВЫБОР
		|		КОГДА ВТпланБазы.Количество > 0
		|			ТОГДА ВТпланБазы.Стоимость / ВТпланБазы.Количество * ВТпланБазы.КоличествоПлан
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьРасчет,
		|	ВЫБОР
		|		КОГДА ВТпланБазы.Количество > 0
		|			ТОГДА ВТпланБазы.Стоимость / ВТпланБазы.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаТабашФакт
		|ПОМЕСТИТЬ ВТСтоимостьБазы
		|ИЗ
		|	ВТпланБазы КАК ВТпланБазы
		|ГДЕ
		|	ВТпланБазы.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСклад.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВТСклад.Количество - ЕСТЬNULL(ВТСтоимостьБазы.КоличествоПлан, 0) КАК Количество,
		|	ВТСклад.Стоимость - ЕСТЬNULL(ВТСтоимостьБазы.СтоимостьРасчет, 0) КАК Стоимость
		|ПОМЕСТИТЬ ВТФакт
		|ИЗ
		|	ВТСклад КАК ВТСклад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьБазы КАК ВТСтоимостьБазы
		|		ПО ВТСклад.ЦеноваяГруппа = ВТСтоимостьБазы.ЦеноваяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ЗатратыПоЗаказуОбороты.Затрата КАК Затрата,
		|	СУММА(Лико_ЗатратыПоЗаказуОбороты.КоличествоПланОборот) КАК Количество
		|ПОМЕСТИТЬ ВТОбщие
		|ИЗ
		|	РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			Затрата В
		|					(ВЫБРАТЬ
		|						ВТЦГИБазы.ЦГ КАК ЦГ
		|					ИЗ
		|						ВТЦГИБазы КАК ВТЦГИБазы
		|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБазыОбщие КАК ВТБазыОбщие
		|							ПО
		|								ВТЦГИБазы.ЦГБазы = ВТБазыОбщие.ЦГБазы
		|					СГРУППИРОВАТЬ ПО
		|						ВТЦГИБазы.ЦГ)
		|				И РабочийЦентр.Лико_Площадка.Организация = &Площадка
		|				И НЕ ДавальческоеСырье) КАК Лико_ЗатратыПоЗаказуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ЗатратыПоЗаказуОбороты.Затрата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТБазыОбщие.ЦГБазы КАК ЦГБазы,
		|	СУММА(ВТОбщие.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТКоличествоЗатратДляОбщих
		|ИЗ
		|	ВТБазыОбщие КАК ВТБазыОбщие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦГИБазы КАК ВТЦГИБазы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбщие КАК ВТОбщие
		|			ПО ВТЦГИБазы.ЦГ = ВТОбщие.Затрата
		|		ПО ВТБазыОбщие.ЦГБазы = ВТЦГИБазы.ЦГБазы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТБазыОбщие.ЦГБазы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЦГИБазы.ЦГ КАК ЦГ,
		|	СУММА(ВЫБОР
		|			КОГДА ВТКоличествоЗатратДляОбщих.Количество > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ВТОбщие.Количество > 0
		|							ТОГДА ВТФакт.Стоимость * ВТОбщие.Количество / ВТКоличествоЗатратДляОбщих.Количество
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ВТФакт.Стоимость
		|		КОНЕЦ) КАК Стоимость
		|ПОМЕСТИТЬ ВТ_СоставныеЦГ
		|ИЗ
		|	ВТЦГИБазы КАК ВТЦГИБазы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФакт КАК ВТФакт
		|		ПО ВТЦГИБазы.ЦГБазы = ВТФакт.ЦеноваяГруппа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоЗатратДляОбщих КАК ВТКоличествоЗатратДляОбщих
		|		ПО ВТЦГИБазы.ЦГБазы = ВТКоличествоЗатратДляОбщих.ЦГБазы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбщие КАК ВТОбщие
		|		ПО ВТЦГИБазы.ЦГ = ВТОбщие.Затрата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЦГИБазы.ЦГ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставныеЦГ.ЦГ КАК ЦеноваяГруппа,
		|	СУММА(Лико_ЗатратыПоЗаказуОбороты.КоличествоПланОборот) КАК КоличествоПлан,
		|	ВТ_СоставныеЦГ.Стоимость КАК Стоимость
		|ПОМЕСТИТЬ ВТРасчет
		|ИЗ
		|	ВТ_СоставныеЦГ КАК ВТ_СоставныеЦГ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				,
		|				РабочийЦентр.Лико_Площадка.Организация = &Площадка
		|					И НЕ ДавальческоеСырье) КАК Лико_ЗатратыПоЗаказуОбороты
		|		ПО ВТ_СоставныеЦГ.ЦГ = Лико_ЗатратыПоЗаказуОбороты.Затрата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СоставныеЦГ.ЦГ,
		|	ВТ_СоставныеЦГ.Стоимость
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРасчет.ЦеноваяГруппа.Код КАК КодЦг,
		|	ВТРасчет.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВТРасчет.КоличествоПлан КАК КоличествоПлан,
		|	ВТРасчет.Стоимость КАК Сумма,
		|	ВТРасчет.Стоимость / ВТРасчет.КоличествоПлан КАК ЦенаТабашФакт
		|ИЗ
		|	ВТРасчет КАК ВТРасчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТСтоимостьБазы.ЦеноваяГруппа.Код,
		|	ВТСтоимостьБазы.ЦеноваяГруппа,
		|	ВТСтоимостьБазы.КоличествоПлан,
		|	ВТСтоимостьБазы.СтоимостьРасчет,
		|	ВТСтоимостьБазы.ЦенаТабашФакт
		|ИЗ
		|	ВТСтоимостьБазы КАК ВТСтоимостьБазы
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодЦг" ;

	
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Площадка", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = Объект.СоставныеЗатраты.добавить();
		заполнитьзначенияСвойств(стр, выборка);
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставныезатраты(Команда)
	ЗаполнитьСоставныезатратыНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьЦеныЗатратНаСервере()
	Площадка = Объект.Организация;
	Евро = Справочники.Валюты.НайтиПоКоду("978");
	ТипЦен = Перечисления.Лико_ТипЦен.ТабашФакт;
	Для каждого стр Из Объект.Затраты Цикл
		Если стр.учитыватьрасход Тогда 
			Запись = РегистрыСведений.Лико_ЦеныГруппНоменклатуры.СоздатьМенеджерЗаписи();
			Запись.Площадка = Площадка;
			Запись.Валюта = Евро;
			Запись.ТипЦен = ТипЦен;
			Запись.Период = Объект.ДатаНачала;
			Если ТипЗнч(Запись.ЦеноваяГруппа) = Тип("СправочникСсылка.Номенклатура") Тогда 
				Запись.ЕдиницаИзмерения = стр.затрата.ЕдиницаДляОтчетов;
			ИначеЕсли ТипЗнч(Запись.ЦеноваяГруппа) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда 
				Запись.ЕдиницаИзмерения = стр.затрата.ОсновнаяНоменклатура.ЕдиницаДляОтчетов;				
			КонецЕсли;			
			Запись.ЦеноваяГруппа = стр.затрата;
			Запись.Цена = стр.ЦенаТабашФакт;
			Запись.Записать(); 
		КонецЕсли;
	КонецЦикла;
	
	Для каждого стр Из Объект.СоставныеЗатраты Цикл
		Запись = РегистрыСведений.Лико_ЦеныГруппНоменклатуры.СоздатьМенеджерЗаписи();
		Запись.Площадка = Площадка;
		Запись.Валюта = Евро;
		Запись.ТипЦен = ТипЦен;
		Запись.Период = Объект.ДатаНачала;	
		Запись.ЦеноваяГруппа = стр.ЦеноваяГруппа;
		Запись.Цена = стр.ЦенаТабашФакт;
		Запись.Записать(); 
	КонецЦикла;  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	МАКСИМУМ(Лико_КорректировкаЗатратСоставныеЗатраты.ЦенаТабашФакт) КАК ЦенаТабашФакт
	|ИЗ
	|	Документ.Лико_КорректировкаЗатрат.СоставныеЗатраты КАК Лико_КорректировкаЗатратСоставныеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
	|		ПО Лико_КорректировкаЗатратСоставныеЗатраты.ЦеноваяГруппа = ЦеновыеГруппыБазаРасчетаЦены.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу КАК Лико_ЗатратыПоЗаказу
	|		ПО (Лико_КорректировкаЗатратСоставныеЗатраты.Ссылка.Организация = Лико_ЗатратыПоЗаказу.ЗаказКлиента.Площадка)
	|			И (Лико_КорректировкаЗатратСоставныеЗатраты.ЦеноваяГруппа = Лико_ЗатратыПоЗаказу.Затрата
	|				ИЛИ Лико_КорректировкаЗатратСоставныеЗатраты.ЦеноваяГруппа = Лико_ЗатратыПоЗаказу.Затрата.ЦеноваяГруппа)
	|			И (Лико_ЗатратыПоЗаказу.Период МЕЖДУ Лико_КорректировкаЗатратСоставныеЗатраты.Ссылка.ДатаНачала И Лико_КорректировкаЗатратСоставныеЗатраты.Ссылка.ДатаОкончания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа"

КонецПроцедуры
	

&НаКлиенте
Процедура УстановитьЦеныЗатрат(Команда)
	УстановитьЦеныЗатратНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыУчитыватьРасходПриИзменении(Элемент)
	ПриИзмененииДанныхСтрокиЗатрат();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхСтрокиЗатрат()
	текстр = Элементы.Затраты.ТекущиеДанные;
	Если текстр.учитыватьрасход Тогда 
		текстр.стоимостьраспределено = текстр.КоличествоПлан*текстр.ЦенаТабашФакт;
	Иначе
		текстр.СтоимостьРаспределено = 0;
	КонецЕсли;
	текстр.остаток = текстр.Стоимость - текстр.СтоимостьРаспределено;
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыКоличествоПланПриИзменении(Элемент)
	ПриИзмененииДанныхСтрокиЗатрат();
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыЦенаТабашФактПриИзменении(Элемент)
	ПриИзмененииДанныхСтрокиЗатрат();
КонецПроцедуры


&НаСервере
Процедура  УстановитьСнятьФлажкиУчетаРасходаЗатрат(УчитыватьРасход)
	Для каждого стр ИЗ Объект.Затраты Цикл
		стр.УчитыватьРасход = УчитыватьРасход;
		Если УчитыватьРасход Тогда 
			стр.стоимостьраспределено = стр.КоличествоПлан*стр.ЦенаТабашФакт;
		Иначе 	
			стр.стоимостьраспределено = 0;
		КонецЕсли;
		стр.остаток = стр.Стоимость - стр.СтоимостьРаспределено;
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	УстановитьСнятьФлажкиУчетаРасходаЗатрат(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьСнятьФлажкиУчетаРасходаЗатрат(Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормочасыНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНормочасы(Команда)
	ЗаполнитьНормочасыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАмортизациюНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАмортизацию(Команда)
	ЗаполнитьАмортизациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗППрямаяНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗППрямая(Команда)
	ЗаполнитьЗППрямаяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АмортизацияСуммаПриИзменении(Элемент)
	текстр = Элементы.Амортизация.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.КоличествоНормочасов) Тогда 
		текстр.СтоимостьНЧ = текстр.Сумма/текстр.КоличествоНормочасов;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВалы(Команда)
	ЗаполнитьВалыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапчастиНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчасти(Команда)
	ЗаполнитьЗапчастиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормочасыКосвенныхНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНормочасыКосвенных(Команда)
	ЗаполнитьНормочасыКосвенныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКосвенныеНаСервере()
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКосвенные(Команда)
	ЗаполнитьКосвенныеНаСервере();
КонецПроцедуры


