#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция КодЗначения(ВидСправкиОРожденииРебенка) Экспорт
	Если ВидСправкиОРожденииРебенка = Форма24 Тогда
		Возврат "24";
	ИначеЕсли ВидСправкиОРожденииРебенка = Форма25 Тогда
		Возврат "25";
	ИначеЕсли ВидСправкиОРожденииРебенка = Форма26 Тогда
		Возврат "26";
	ИначеЕсли ВидСправкиОРожденииРебенка = Форма1 Тогда
		Возврат "48";
	ИначеЕсли ВидСправкиОРожденииРебенка = Форма2 Тогда
		Возврат "49";
	ИначеЕсли ВидСправкиОРожденииРебенка = Форма3 Тогда
		Возврат "50";
	ИначеЕсли ВидСправкиОРожденииРебенка = Форма4 Тогда
		Возврат "51";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ЗначениеПоКоду(Код) Экспорт
	Если Код = "24" Тогда
		Возврат Форма24;
	ИначеЕсли Код = "25" Тогда
		Возврат Форма25;
	ИначеЕсли Код = "26" Тогда
		Возврат Форма26;
	ИначеЕсли Код = "48" Тогда
		Возврат Форма1;
	ИначеЕсли Код = "49" Тогда
		Возврат Форма2;
	ИначеЕсли Код = "50" Тогда
		Возврат Форма3;
	ИначеЕсли Код = "51" Тогда
		Возврат Форма4;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли