#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СтатусыРасходаНовойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	Возврат Результат;
	
КонецФункции

Функция СтатусыРезервированияИсходнойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Черновик);
	Результат.Добавить(ОформлениеСДИЗКПередаче);
	Результат.Добавить(ОформлениеСДИЗОбрабатывается);
	Результат.Добавить(ОформлениеСДИЗОшибкаПередачи);
	Результат.Добавить(ФормированиеПартииКПередаче);
	Результат.Добавить(ФормированиеПартииОбрабатывается);
	Результат.Добавить(ФормированиеПартииОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРезервированияВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(ОформлениеСДИЗКПередаче);
	Результат.Добавить(ОформлениеСДИЗОбрабатывается);
	Результат.Добавить(ОформлениеСДИЗОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаИсходнойПартииБезВыделенияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаИсходнойПартииСВыделениемПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	Результат.Добавить(ОформлениеСДИЗАннулировано);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаАннулированияОформленияСДИЗ() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОформлениеСДИЗПриКорректировкеАннулировано);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаАннулированияСписанияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартияАннулирована);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыРасходаВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартииСформированы);
	Результат.Добавить(ОформлениеСДИЗКПередаче);
	Результат.Добавить(ОформлениеСДИЗОбрабатывается);
	Результат.Добавить(ОформлениеСДИЗОшибкаПередачи);
	Результат.Добавить(СДИЗОформлен);
	Результат.Добавить(АннулированиеОформленияСДИЗКПередаче);
	Результат.Добавить(АннулированиеОформленияСДИЗОбрабатывается);
	Результат.Добавить(АннулированиеОформленияСДИЗОшибкаПередачи);
	Результат.Добавить(ОформлениеСДИЗАннулировано);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаАннулированияОтказаОтПогашенияСДИЗ() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОтказПогашенияСДИЗАннулирован);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаОтказаПогашенияСДИЗ() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОтказПогашенияСДИЗОформлен);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусыПриходаАннулированияВыделеннойПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартияАннулирована);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
