
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление() 
	
	// Оформление серым цветом устаревших видов прочих доходов и расходов.
	Список.УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.Использование = Истина;
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборУО.ПравоеЗначение = Перечисления.ВидыПрочихДоходовИРасходов.УстаревшиеВидыПрочихДоходовИРасходов();
	
КонецПроцедуры

#КонецОбласти