#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаВладелец = Параметры.СсылкаВладелец;
	Если  ТипЗнч(СсылкаВладелец)=Тип("СправочникСсылка.СкладскиеЯчейки") Тогда
		Секция = СсылкаВладелец.Лико_Секция; 
		Элементы.Секция.Видимость=Истина;
		Элементы.СсылкаВладелец.Заголовок="Адрес";
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//+Лико m.shenderov 20.05.2026
	// При открытии формы устанавливаем заголовок по переданной ссылке
	Если ЗначениеЗаполнено(СсылкаВладелец) Тогда
		Заголовок = Строка(СсылкаВладелец);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
