
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства;
	КонецЕсли;	
КонецПроцедуры


Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
	Если Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ЗаполнениеСотрудникаВЗаявке",Ложь) Тогда
		Сотрудник=АвторДокумента;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ВвостановитьЗначениеВидНастроечногоМатериалаУОбъектовНоменклатуры();
	
КонецПроцедуры

Процедура ВвостановитьЗначениеВидНастроечногоМатериалаУОбъектовНоменклатуры()
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	МАКСИМУМ(Лико_ИсторияВидаНастроечногоМатериала.Период) КАК Период
	|ПОМЕСТИТЬ ВтПериод
	|ИЗ
	|	РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|ГДЕ
	|	Лико_ИсторияВидаНастроечногоМатериала.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПериод.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_ИсторияВидаНастроечногоМатериала.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтПослЗнач
	|ИЗ
	|	ВтПериод КАК ВтПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|		ПО ВтПериод.ОбъектНоменклатуры = Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|			И ВтПериод.Период = Лико_ИсторияВидаНастроечногоМатериала.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВтПослЗнач.ВидНастроечногоМатериала, ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.Пустаяссылка)) КАК ВидНастроечногоМатериала,
	|	Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.Лико_УстановкаВидаНастроечногоМатериала.Товары КАК Лико_УстановкаВидаНастроечногоМатериалаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПослЗнач КАК ВтПослЗнач
	|		ПО Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры = ВтПослЗнач.ОбъектНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект=Выборка.ОбъектНоменклатуры.ПолучитьОбъект();
		СпрОбъект.ВидНастроечногоМатериала=Выборка.ВидНастроечногоМатериала;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСтатус() //+Лико m.shenderov 05.11.2018
	Передача=НайтиПередачу();
	
	
	Если Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Отменен Тогда
		
		
		Если ЗначениеЗаполнено(Передача) ТОгда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя отменить заявку т.к. она уже обработана складом!";
			Сообщение.Сообщить();	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Передача) Тогда
		Если Передача.Проведен и  НЕ ДополнительныеСвойства.Свойство("УдалениеДОкументаПоЗаявке") Тогда
			Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Выдан;	
		Иначе
			Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Подготовлен;
		КонецЕсли;
	Иначе
		Статус=Перечисления.Лико_СтатусЗаявокНаСклад.ВОбработке;
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 05.11.2018


Функция НайтиПередачу() //+Лико m.shenderov 05.11.2018
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|ГДЕ
	|	Лико_ПередачаТоваров.ЗаявкаНаСклад = &Ссылка
	|	И Не Лико_ПередачаТоваров.ПометкаУдаления
	|	И Лико_ПередачаТоваров.ЗаявкаНаСклад <> ЗНАЧЕНИЕ(Документ.Лико_ЗаявкаНаСклад.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
		
	КонецЦикла; 
	
	
	
КонецФункции //-Лико m.shenderov 05.11.2018 

Процедура ОбработкаПроведения(Отказ, Режим)
	УстановитьПривилегированныйРежим(Истина);
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр Лико_ИсторияВидаНастроечногоМатериала
	Движения.Лико_ИсторияВидаНастроечногоМатериала.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Лико_ИсторияВидаНастроечногоМатериала.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектНоменклатуры = ТекСтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры;
		Движение.ВидНастроечногоМатериала = ?(ЗначениеЗаполнено(ТекСтрокаТовары.ВидНастроечногоМатериала),ТекСтрокаТовары.ВидНастроечногоМатериала,ВидНастроечногоМатериала);
		
		
		
	КонецЦикла;
	Если Не Отказ Тогда
		Для Каждого ТекСтрокаТовары Из Товары Цикл 	
			
			СпрОбъект=ТекСтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
			СпрОбъект.ВидНастроечногоМатериала=?(ЗначениеЗаполнено(ТекСтрокаТовары.ВидНастроечногоМатериала),ТекСтрокаТовары.ВидНастроечногоМатериала,ВидНастроечногоМатериала);

			СпрОбъект.Записать();
			
			
			
		КонецЦикла;
		
	КонецЕсли; 
	
	
	УстановитьПривилегированныйРежим(Истина);	
	Движения.Лико_БракСерий.Записывать = Истина;
	
	Для каждого Материал Из Товары  Цикл 
		
		Движение 						=	Движения.Лико_БракСерий.Добавить();
		Движение.Серия					=	Материал.Серия;
		Движение.ОбъектНоменклатуры		=	Материал.Серия.ЯССМ_ОбъектНоменклатуры;
		Движение.Дефект					=	Дефект;
		Движение.Документ				=	Ссылка;
		Движение.ОписаниеДефекта		= 	ОписаниеДефекта;  
	

		
		
	КонецЦикла; 	

	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура УстановитьЗначениеВидНастроечногоМатериалаУОбъектовНоменклатуры()
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	МАКСИМУМ(Лико_ИсторияВидаНастроечногоМатериала.Период) КАК Период
	|ПОМЕСТИТЬ ВтПериод
	|ИЗ
	|	РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПериод.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_ИсторияВидаНастроечногоМатериала.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтПослЗнач
	|ИЗ
	|	ВтПериод КАК ВтПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|		ПО ВтПериод.ОбъектНоменклатуры = Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|			И ВтПериод.Период = Лико_ИсторияВидаНастроечногоМатериала.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВтПослЗнач.ВидНастроечногоМатериала, ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.Пустаяссылка)) КАК ВидНастроечногоМатериала,
	|	Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.Лико_УстановкаВидаНастроечногоМатериала.Товары КАК Лико_УстановкаВидаНастроечногоМатериалаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПослЗнач КАК ВтПослЗнач
	|		ПО Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры = ВтПослЗнач.ОбъектНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект=Выборка.ОбъектНоменклатуры.ПолучитьОбъект();
		СпрОбъект.ВидНастроечногоМатериала=Выборка.ВидНастроечногоМатериала;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
		
	Если Дефект=Справочники.Лико_ДефектыМатериалов.НайтиПоНаименованию("Другое") Тогда
		ПроверяемыеРеквизиты.Добавить("ОписаниеДефекта");
	КонецЕсли; 
	
	МассивНепроверяемыхРеквизитов = Новый Массив;  
	МассивНепроверяемыхРеквизитов.Добавить("ВидНастроечногоМатериала");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры



