
// Процедура проверяет откуда вызывается код (с клиента или с сервера). Если на клиенте - то выводит сообщение, в противном случае ничего не делает. 
// Статус сообщения в управляемом приложении игнорируется, оставил для совместимости со старым кодом
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения.
//  СтатусСообщения - Строка - статус сообщения, который передается в функцию Сообщить.
//
Процедура СообщитьДляКлиента(ТекстСообщения, СтатусСообщения="") Экспорт
	
	//Если Лико_Дополнительно.ВызовСТСД() Тогда
	//	//Откроем специальную форму для показа сообщений на ТСД. В новых платформах, когда заработает метод УстановитьРежимОсновногоОкна, можно будет привязываться еще к режиму окна
	//	#Если Клиент Тогда
	//		ОткрытьФорму("ОбщаяФорма.Лико_ФормаСообщенияДляТСД", Новый Структура("Текст", ТекстСообщения));
	//	#Иначе
	//		//По идее, сообщения с сервера тоже нужно обрабатывать через форму ТСД, но форму можно открыть только на клиенте, и чтобы передать сообщения с сервера на клиента придется городить
	//		//лютые костыли, которые будут грузить систему. Пока подождем платформу 8.9.11, там обещают реализовать передачу данных с сервера на клиента https://wonderland.v8.1c.ru/blog/peredacha-informatsii-s-servera/
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = СокрЛП(ТекстСообщения);
	//		Сообщение.Сообщить();
	//	#КонецЕсли
	//Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СокрЛП(ТекстСообщения);
		Сообщение.Сообщить();
	//КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция КонкретнаяРольДоступна(Знач ИмяРоли, Пользователь = Неопределено) Экспорт // --> Начало Лико Ефимов ЕВВ 18.07.2017 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Роля = Метаданные.Роли.Найти(ИмяРоли);
	Если Роля = Неопределено Тогда
		Сообщить("Роль: " + ИмяРоли + " не найдена!!! + (0c25c1ed-5fb2-4b3c-8e06-d1afa990822a)");
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступаПользователи.Ссылка.Профиль
		|ПОМЕСТИТЬ ВТ_Первый
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь
		|
		|СГРУППИРОВАТЬ ПО
		|	ГруппыДоступаПользователи.Ссылка.Профиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрофилиГруппДоступаРоли.Роль
		|ИЗ
		|	ВТ_Первый КАК ВТ_Первый
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ПО ВТ_Первый.Профиль = ПрофилиГруппДоступаРоли.Ссылка
		|ГДЕ
		|	ПрофилиГруппДоступаРоли.Роль.ПолноеИмя = &ПолноеИмя
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрофилиГруппДоступаРоли.Роль";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПолноеИмя", "Роль." + СокрЛП(ИмяРоли));

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Возврат Выборка.Следующий();
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 18.07.2017 

Процедура ПочиститьМассивОтДублей(Массив) Экспорт // --> Начало Лико Ефимов ЕВВ 13.09.2017
	
	НовыйМассив = Новый Массив;
	Для каждого Элемент из Массив Цикл
		Если НовыйМассив.Найти(Элемент) = Неопределено Тогда
			НовыйМассив.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Массив = НовыйМассив;
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 13.09.2017

Функция ЧислоЗнаковПослеЗапятой(Число) Экспорт // --> Начало Лико Ефимов ЕВВ 10.12.2019 
	
	ДробнаяЧасть = Цел(Число) - Число;
	Если ДробнаяЧасть = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ДробнаяЧасть = ?(ДробнаяЧасть < 0, -ДробнаяЧасть, ДробнаяЧасть);
	
	Возврат СтрДлина(Строка(ДробнаяЧасть)) - 2;
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 10.12.2019 

Функция ПолучитьНаименованиеЧестногоЗнака(Объект) Экспорт
	Возврат Объект.Gtin + ?(ЗначениеЗаполнено(Объект.ДатаЭмиссии), ", " + Формат(Объект.ДатаЭмиссии, "ДФ=dd.MM.yy"), "");
КонецФункции
