#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ОстаткиПоАдресамСекции(Секция,Паллет=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Паллет) Тогда
		
	КонецЕсли;
	
		
	Соответствие = Новый Соответствие;
		
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПаллетыВСекцияхОстатки.Секция КАК Секция,
	|	Лико_ПаллетыВСекцияхОстатки.Паллет КАК Паллет,
	|	Лико_ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
	|	Лико_ПаллетыВСекцияхОстатки.КоличествоОстаток КАК Количество,
	|	Лико_ПаллетыВСекцияхОстатки.ЗаблокированОстаток КАК Заблокирован,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер КАК Типоразмер,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Высота КАК Высота,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Глубина КАК Глубина,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Вес КАК Вес,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Ширина КАК Ширина
	|ИЗ
	|	РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(, Секция = &Секция) КАК Лико_ПаллетыВСекцияхОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПаллет.СрезПоследних КАК Лико_ПараметрыПаллетСрезПоследних
	|		ПО Лико_ПаллетыВСекцияхОстатки.Паллет = Лико_ПараметрыПаллетСрезПоследних.Паллет
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФильтрПоПаллету
	|				ТОГДА Лико_ПаллетыВСекцияхОстатки.Паллет <> &Паллет
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Секция",Секция );
	Запрос.УстановитьПараметр("ФильтрПоПаллету",ЗначениеЗаполнено(Паллет) ); 
	Запрос.УстановитьПараметр("Паллет",Паллет);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

		
	Пока Выборка.Следующий() Цикл 
		
				
		Структура = Новый Структура;
		Структура.Вставить("Секция");
		Структура.Вставить("Паллет");
		Структура.Вставить("Количество");
		Структура.Вставить("Заблокирован");
		Структура.Вставить("Типоразмер");
		Структура.Вставить("Высота");
		Структура.Вставить("Ширина");
		Структура.Вставить("Глубина");
		Структура.Вставить("Вес");
		
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		
		Соответствие.Вставить(Выборка.Адрес,Структура);

		
	КонецЦикла; 
	
	
	 Возврат Соответствие;
	
		
КонецФункции  

Функция ПолучитьАдрес(Паллет) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
	|	Лико_ПаллетыВСекцияхОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(, Паллет = &Паллет) КАК Лико_ПаллетыВСекцияхОстатки";
	Запрос.УстановитьПараметр("Паллет",Паллет);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.Адрес;
	
	КонецЦикла; 
	
	
	
	
	
	Возврат Результат;
	
	
КонецФункции  


Функция ПаллетыНаПолу(Склад) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер КАК Типоразмер,
	|	Лико_ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
	|	СУММА(Лико_ПаллетыВСекцияхОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПаллет.СрезПоследних КАК Лико_ПараметрыПаллетСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ПаллетыВСекциях.Остатки КАК Лико_ПаллетыВСекцияхОстатки
	|		ПО (Лико_ПаллетыВСекцияхОстатки.Паллет = Лико_ПараметрыПаллетСрезПоследних.Паллет)
	|ГДЕ
	|	Лико_ПаллетыВСекцияхОстатки.Секция = ЗНАЧЕНИЕ(Справочник.Лико_СкладскиеСекции.Пустаяссылка)
	|	И Лико_ПаллетыВСекцияхОстатки.Адрес.Владелец = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер,
	|	Лико_ПаллетыВСекцияхОстатки.Адрес
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	Запрос.УстановитьПараметр("Склад",Склад);
	Возврат  Запрос.Выполнить().Выгрузить();
	
	
		
КонецФункции //-Лико m.shenderov 23.06.2026 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли