
//&Вместо("ИнициализироватьВтТаблицаКомплекты")
//Процедура Лико_ИнициализироватьВтТаблицаКомплекты(Запрос)

//	Если Запрос.Параметры.Свойство("ВтТаблицаКомплектыИнициализирована") Тогда
//		Возврат;
//	КонецЕсли;

//	ИнициализироватьКлючиАналитикиНоменклатуры(Запрос);

//	ЗапросВтТаблицаКомплекты = Новый Запрос;
//	ЗапросВтТаблицаКомплекты.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
//	ЗапросВтТаблицаКомплекты.УстановитьПараметр("Ссылка",                  Запрос.Параметры.Ссылка);
//	ЗапросВтТаблицаКомплекты.УстановитьПараметр("Период",                  Запрос.Параметры.Период);
//	ЗапросВтТаблицаКомплекты.УстановитьПараметр("ХозяйственнаяОперация",   Запрос.Параметры.ХозяйственнаяОперация);
//	ЗапросВтТаблицаКомплекты.УстановитьПараметр("УказанОсновнойКомпонент", Запрос.Параметры.УказанОсновнойКомпонент);
//	ЗапросВтТаблицаКомплекты.УстановитьПараметр("Организация", Запрос.Параметры.Организация);

//	СформироватьВтТаблицаАналитикУчетаПартий(ЗапросВтТаблицаКомплекты);

//	ЗапросВтТаблицаКомплекты.Текст = 
//	"ВЫБРАТЬ
//	|	&Ссылка КАК Ссылка,
//	|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
//	|	""Товары"" КАК ИмяТабличнойЧасти,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Серия КАК Серия,
//	|	СУММА(Товары.ДоляСтоимости) КАК ДоляСтоимости,
//	|	СУММА(Товары.Количество) КАК Количество,
//	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
//	|ПОМЕСТИТЬ ВтТоварыДокумента
//	|ИЗ
//	|	Документ.СборкаТоваров.Товары КАК Товары
//	|ГДЕ
//	|	Товары.Ссылка = &Ссылка
//	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Назначение,
//	|	Товары.Серия,
//	|	Товары.АналитикаУчетаНоменклатуры
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	&Ссылка,
//	|	0,
//	|	""Шапка"",
//	|	Шапка.Номенклатура,
//	|	Шапка.Характеристика,
//	|	Шапка.Назначение,
//	|	Шапка.Серия,
//	|	1,
//	|	Шапка.Количество,
//	|	Шапка.АналитикаУчетаНоменклатуры
//	|ИЗ
//	|	Документ.СборкаТоваров КАК Шапка
//	|ГДЕ
//	|	Шапка.Ссылка = &Ссылка
//	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
//	|	ТоварыДокумента.Номенклатура КАК Номенклатура,
//	|	ТоварыДокумента.Характеристика КАК Характеристика,
//	|	ТоварыДокумента.Назначение КАК Назначение,
//	|	ТоварыДокумента.Серия КАК Серия,
//	|	ТаблицаВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
//	|	ТаблицаВидыЗапасов.НомерГТД КАК НомерГТД,
//	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|	ТаблицаВидыЗапасов.Количество КАК Количество,
//	|	ТаблицаВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
//	|	ТоварыДокумента.ДоляСтоимости * ТаблицаВидыЗапасов.Количество / ТоварыДокумента.Количество КАК ДоляСтоимости,
//	|	ТоварыДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
//	|ПОМЕСТИТЬ ВтТаблицаКомплекты
//	|ИЗ
//	|	ВтТоварыДокумента КАК ТоварыДокумента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
//	|		ПО ТоварыДокумента.НомерСтроки = ТаблицаАналитикУчетаПартий.НомерСтроки
//	|			И ТоварыДокумента.ИмяТабличнойЧасти = ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров.ВидыЗапасовОприходование КАК ТаблицаВидыЗапасов
//	|		ПО ТоварыДокумента.Ссылка = ТаблицаВидыЗапасов.Ссылка
//	|			И (
//	|				(ТоварыДокумента.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
//	|					И ТаблицаВидыЗапасов.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров))
//	|				ИЛИ
//	|				(ТоварыДокумента.НомерСтроки = 0
//	|					И ТаблицаВидыЗапасов.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров))
//	|			)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВтТоварыДокумента";

//	ЗапросВтТаблицаКомплекты.Выполнить();

//	Запрос.УстановитьПараметр("ВтТаблицаКомплектыИнициализирована", Истина);

//КонецПроцедуры
