
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИндексПеречисления = ПолучитьИндексПоВидуПодписи(Параметры.ВидПодписи);
	Если ИндексПеречисления = 0 Тогда
		ИндексПеречисления = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
    ВидПодписи = ПолучитьВидПодписиПоИндексу(ИндексПеречисления);
	ОповеститьОВыборе(ВидПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВидПодписиПоИндексу(Индекс)

	Если Индекс = 1 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.ПростаяПодпись");
		
	ИначеЕсли Индекс = 2 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УНЭПГосключ");
		
	ИначеЕсли Индекс = 3 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПГосключ");
		
	ИначеЕсли Индекс = 4 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПРутокен");
		
	КонецЕсли;

	Возврат ВидПодписи;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИндексПоВидуПодписи(ВидПодписи)

	Индекс = 0;
	
	Если ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.ПростаяПодпись") Тогда
		Индекс = 1;
		
	ИначеЕсли ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УНЭПГосключ") Тогда
		Индекс = 2;
		
	ИначеЕсли ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПГосключ") Тогда
		Индекс = 3;
		
	ИначеЕсли ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПРутокен") Тогда
		Индекс = 4;
		
	КонецЕсли;

	Возврат Индекс;
	
КонецФункции

#КонецОбласти