
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Отказ)
	
	
	
	Если ЗначениеЗаполнено(Родитель.Организация) Тогда
		
		Организация = Родитель.Организация;
		
	КонецЕсли;
	
	
	Если ЭтоГруппа=Истина Тогда
		
		Наименование=СтрШаблон("%1 (%2)",ВидНоменклатуры.Наименование, Организация);
	Иначе
		
		Если Приоритет=0 Или Родитель<>Ссылка.Родитель Тогда
			Приоритет=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ПолучитьПриоритетМакс(ВидНоменклатуры, Организация)+1;
		КонецЕсли;
		
		Если Не СложнаяНастройка Тогда
			
			Описание="";
			ЕстьДанные=Ложь;
			Для каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда	
					ЕстьДанные=Истина;
					Описание=Описание+" " +ДопРеквизит.Свойство.Наименование+ ?(ДопРеквизит.Исключить," <> "," = ")+Строка(ДопРеквизит.Значение)+";";	
				КонецЕсли;	
			КонецЦикла;
			Если ЕстьДанные Тогда
				Описание=Лев(Описание,СтрДлина(Описание)-1);
			КонецЕсли;
		КонецЕсли;
		Наименование=СтрШаблон("%4 - %1 %2 (%3)",Строка(ВидНоменклатуры),Описание, Организация, Код);
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	Если Не ТипСписания=Перечисления.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КатегорияЭксплуатации"); 
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Не ЭтоГруппа Тогда 
		
		Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.СохранитьНастройкуПравил(ВидНоменклатуры,Организация);

КонецЕсли;


КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Приоритет = 0;
	НастройкиОбъектаКопирования = ОбъектКопирования.ОтборНастройки.Получить();
	ОтборНастройки =  Новый ХранилищеЗначения(НастройкиОбъектаКопирования, Новый СжатиеДанных(9)); 
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиПроведения

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПередЗаписьюУдалить(Отказ)
	Описание="";
	ЕстьДанные=Ложь;
	Для каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
		Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда	
			ЕстьДанные=Истина;
			Описание=Описание+" " +ДопРеквизит.Свойство.Наименование+ ?(ДопРеквизит.Исключить," <> "," = ")+Строка(ДопРеквизит.Значение)+";";	
		КонецЕсли;	
	КонецЦикла;
	Если ЕстьДанные Тогда
		Описание=Лев(Описание,СтрДлина(Описание)-1);
	КонецЕсли;
	Наименование=Строка(ВидНоменклатуры)+" "+Описание;
КонецПроцедуры

#КонецОбласти

 #Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли


