
//&НаСервере
//Процедура Лико_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
//	УстановитьПривилегированныйРежим(Истина);

//	Список.ТекстЗапроса = 
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ТИПЗНАЧЕНИЯ(ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование) = ТИП(Документ.ЗаказДавальца)
//	|				ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
//	|			ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
//	|		КОНЕЦ КАК Документ.ЗаказКлиента) КАК ЗаказКлиента,
//	|	МАКСИМУМ(ПооперационноеРасписание2_2.РабочийЦентр) КАК РабочийЦентр,
//	|	МАКСИМУМ(ПооперационноеРасписание2_2.Начало) КАК ДатаНачалаПечати
//	|ПОМЕСТИТЬ ВТ_ЗаказыВПлане
//	|ИЗ
//	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
//	|ГДЕ
//	|	ПооперационноеРасписание2_2.Выполнено = 0
//	|	И ПооперационноеРасписание2_2.Этап.НомерПроката = 1
//	|	И ПооперационноеРасписание2_2.Этап.ВидЭтапа = ЗНАЧЕНИЕ(Справочник.Лико_ВидыЭтаповПроизводства.Прокат)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА ТИПЗНАЧЕНИЯ(ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование) = ТИП(Документ.ЗаказДавальца)
//	|				ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
//	|			ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
//	|		КОНЕЦ КАК Документ.ЗаказКлиента)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВЫБОР
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 1
//	|			ТОГДА ""1""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 2
//	|			ТОГДА ""2""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 3
//	|			ТОГДА ""3""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 4
//	|			ТОГДА ""4""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 5
//	|			ТОГДА ""5""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 6
//	|			ТОГДА ""6""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 7
//	|			ТОГДА ""7""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 8
//	|			ТОГДА ""8""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 9
//	|			ТОГДА ""9""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 10
//	|			ТОГДА ""10""
//	|		КОГДА Лико_Цветоделение.НомерСтроки = 11
//	|			ТОГДА ""11""
//	|	КОНЕЦ КАК НомеСтрокиСтрока,
//	|	Лико_Цветоделение.Заказ КАК Заказ,
//	|	Лико_Цветоделение.НомерСтроки КАК НомерСтроки,
//	|	Лико_Цветоделение.Идентификатор КАК Идентификатор
//	|ПОМЕСТИТЬ втНомерСтроки
//	|ИЗ
//	|	РегистрСведений.Лико_Цветоделение КАК Лико_Цветоделение
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	РегистрСведенийЛико_Цветоделение.ДатаЗаявки КАК ДатаЗаявки,
//	|	РегистрСведенийЛико_Цветоделение.Идентификатор КАК НомерЗаявки,
//	|	ВТ_ЗаказыВПлане.ДатаНачалаПечати КАК ДатаНачалаПечати,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.Партнер КАК Заказчик,
//	|	РегистрСведенийЛико_Цветоделение.Заказ КАК Заказ,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.НомерБезПрефикса КАК НомерЗаказа,
//	|	ВЫБОР
//	|		КОГДА РегистрСведенийЛико_Цветоделение.ДатаЦветоделения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|			ТОГДА РегистрСведенийЛико_Цветоделение.Заказ.Версия
//	|		ИНАЧЕ РегистрСведенийЛико_Цветоделение.Версия
//	|	КОНЕЦ КАК Версия,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.РабочийЦентр КАК РабочийЦентр,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.ВидЗаказа КАК ВидЗаказа,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.ТипЗаказа КАК ТипЗаказа,
//	|	РегистрСведенийЛико_Цветоделение.Переделка КАК Переделка,
//	|	РегистрСведенийЛико_Цветоделение.Цветоделитель КАК Цветоделитель,
//	|	РегистрСведенийЛико_Цветоделение.ДатаЦветоделения КАК ДатаЦветоделения,
//	|	РегистрСведенийЛико_Цветоделение.Корректор1 КАК Корректор1,
//	|	РегистрСведенийЛико_Цветоделение.ДатаКорректировки1 КАК ДатаКорректировки1,
//	|	РегистрСведенийЛико_Цветоделение.Корректор2 КАК Корректор2,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.Менеджер КАК Менеджер,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.Площадка КАК Площадка,
//	|	Лико_ЭтапыЗаказаСрезПоследних.Этап КАК Этап,
//	|	ВЫБОР
//	|		КОГДА РегистрСведенийЛико_Цветоделение.Заказ.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.indigo)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК Цифровой,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.СрочноеЦветоделение КАК Срочный,
//	|	РегистрСведенийЛико_Цветоделение.Заказ.НомерБезПрефикса + "" - "" + втНомерСтроки.НомеСтрокиСтрока КАК Номер
//	|ИЗ
//	|	РегистрСведений.Лико_Цветоделение КАК РегистрСведенийЛико_Цветоделение
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЭтапыЗаказа.СрезПоследних(, Площадка = Заказ.Площадка) КАК Лико_ЭтапыЗаказаСрезПоследних
//	|		ПО РегистрСведенийЛико_Цветоделение.Заказ = Лико_ЭтапыЗаказаСрезПоследних.Заказ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ втНомерСтроки КАК втНомерСтроки
//	|		ПО РегистрСведенийЛико_Цветоделение.Заказ = втНомерСтроки.Заказ
//	|			И РегистрСведенийЛико_Цветоделение.НомерСтроки = втНомерСтроки.НомерСтроки
//	|			И РегистрСведенийЛико_Цветоделение.Идентификатор = втНомерСтроки.Идентификатор
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыВПлане КАК ВТ_ЗаказыВПлане
//	|		ПО РегистрСведенийЛико_Цветоделение.Заказ = ВТ_ЗаказыВПлане.ЗаказКлиента";

//	Если Параметры.Свойство("Заказ") Тогда
//		Заказ = Параметры.Заказ;
//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Заказ", Заказ, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Заказ));	
//	КонецЕсли; 
//	

//КонецПроцедуры
