
&НаКлиенте
Процедура Лико_ЗаполнитьКонтрагентаПосле(Команда) 
	Контрагент=ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	ОписаниеОповещение=Новый ОписаниеОповещения("ЗаполнениеКонтрагентаЗавершение",ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещение,Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеКонтрагентаЗавершение(Результат,ДопПараметры) Экспорт//+Лико m.shenderov 20.04.2018
	Если Результат<>Неопределено Тогда
		Для каждого СторкаЗапаса Из Элементы.Запасы.ВыделенныеСтроки Цикл
			Запас=Объект.Запасы.НайтиПоИдентификатору(СторкаЗапаса);
			Запас.ИсточникОбеспечения=Результат;
			
		КонецЦикла;
	КонецЕсли;
	
	Лико_РасчитатьЗаказы();	
КонецПроцедуры //-Лико m.shenderov 20.04.2018


&НаСервере
Процедура Лико_СформированныеЗаказыОтметкаПриИзмененииПослеНаСервере()
	Для каждого Заказ Из ТаблицаДокументы Цикл
		Заказ.Отметка=Ложь;
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Лико_СформированныеЗаказыОтметкаПриИзмененииПосле(Элемент)
	Лико_СформированныеЗаказыОтметкаПриИзмененииПослеНаСервере();
	Элементы.СформированныеЗаказы.ТекущиеДанные.Отметка=Истина;
КонецПроцедуры


&НаСервере
Процедура Лико_Лико_СвернутьЗаказыПослеНаСервере()
	ЗаказПриемник=Неопределено;
	Для каждого Заказ Из ТаблицаДокументы Цикл
		Если  Заказ.Отметка=Истина Тогда
			
			ЗаказПриемник=Заказ.Документ;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ЗаказПриемник) ТОгда
		Возврат;
	КонецЕсли;
	
	ДокОбъект=ЗаказПриемник.ПолучитьОбъект();
	//ДокОбъект=Документы.ЗаказПоставщику.СоздатьДокумент();
	Для каждого Заказ Из ТаблицаДокументы Цикл
		
		Если Заказ.Отметка=Ложь Тогда
			Для каждого Товар Из Заказ.Документ.Товары Цикл
				
				Структура = Новый Структура;
				Структура.Вставить("Номенклатура",Товар.Номенклатура);
				Структура.Вставить("Характеристика",Товар.Характеристика);
				НайтиСтроки=ДокОбъект.Товары.НайтиСтроки(Структура);
				Если НайтиСтроки.Количество()>0 Тогда
					
					Строка=НайтиСтроки[0];
					Строка.Количество=Строка.Количество+Товар.Количество;
				Иначе
					Строка= ДокОбъект.Товары.Добавить();
					Строка.Номенклатура=Товар.Номенклатура;
					Строка.Характеристика=Товар.Характеристика; 
					Строка.Количество=Товар.Количество;
					Строка.КоличествоУпаковок=Товар.КоличествоУпаковок;
              		Строка.Цена=Товар.Цена; 
					ЗаполнитьЗначенияСвойств(Строка,Товар);
				КонецЕсли;	
				СтруктураПересчетаСуммы = ДанныеПересчетаСуммыНДСВСтрокеТЧ(ЗаказПриемник);		
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
				//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());  		
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);
				
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	ДокОбъект.Записать();	
	Структура = Новый Структура;
	Структура.Вставить("Отметка",Ложь);
	НайтиСтроки=ТаблицаДокументы.НайтиСтроки(Структура);
	Для каждого НайденаяСтрока Из НайтиСтроки Цикл
		
		ТаблицаДокументы.Удалить(ТаблицаДокументы.Индекс(НайденаяСтрока));
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_Лико_СвернутьЗаказыПосле(Команда)
	Лико_Лико_СвернутьЗаказыПослеНаСервере();
КонецПроцедуры

&НаСервере
Функция ДанныеПересчетаСуммыНДСВСтрокеТЧ(Объект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураПересчетаСуммы.Вставить("НДСпоСтавкам4и2",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "НДСпоСтавкам4и2"));
	
	Возврат СтруктураПересчетаСуммы;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
	"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки");
	
КонецФункции

