#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция НовыйДокумент(Дата,Организация, ЦеноваяГруппа,Валюта, Цена,Наценка=0, Ответсвенный=Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Ответсвенный = Неопределено Тогда
		Ответсвенный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Объект =  СоздатьДокумент();
	Объект.Организация = Организация;
	Объект.Дата = Дата;
	Объект.Валюта = Валюта;
	Объект.Ответсвенный = Ответсвенный;
	Объект.Наценка = Наценка;
	НоваяЦГ =Объект.ЦеновыеГруппы.Добавить();
	
	НоваяЦГ.ЦеноваяГруппа = ЦеноваяГруппа;
	НоваяЦГ.Цена = Цена;
	
	Объект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Объект.Ссылка; 
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли