#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	////	Движения.Лико_СтоимостьЦеновыхГрупп.Записывать = Истина;
	////Для Каждого ТекСтрокаЦеновыеГруппы Из ЦеновыеГруппы Цикл
	////	Движение 				= Движения.Лико_СтоимостьЦеновыхГрупп.Добавить();
	////	Движение.Период 		= Дата;
	////	Движение.Организация 	= Организация;
	////	Движение.ЦеноваяГруппа 	= ТекСтрокаЦеновыеГруппы.ЦеноваяГруппа;
	////	Движение.Валюта 		= ?(ЗначениеЗаполнено(ТекСтрокаЦеновыеГруппы.Валюта),ТекСтрокаЦеновыеГруппы.Валюта, Валюта);
	////	Движение.Цена 			= ТекСтрокаЦеновыеГруппы.Цена;
	////	Движение.Количество 	= ТекСтрокаЦеновыеГруппы.Количество;
	////КонецЦикла;
	
	
		
	РегистрыСведений.Лико_СтоимостьЦеновыхГрупп.ЗаписатьСтоимтостьЦеновыхГрупп(Организация,Ссылка);
	
	
		
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		
		Для каждого Цг Из ЦеновыеГруппы Цикл
			
			Если Не ЗначениеЗаполнено(Цг.Валюта) Тогда
				
				Цг.Валюта = Валюта;
				
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
 


