#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список выбора статуса документа
//
// Параметры:
//  ДанныеВыбора - СписокЗначений - заполняемый список значений.
//  УстановленныйСтатус - ПеречислениеСсылка.СтатусыЭтаповПроизводства2_2 - текущий статус документа
Процедура ЗаполнитьСписокВыбора(ДанныеВыбора, УстановленныйСтатус) Экспорт
	
	ДанныеВыбора.Очистить();
	
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Формируется);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Начат);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);
	
	Если ДанныеВыбора.НайтиПоЗначению(УстановленныйСтатус) = Неопределено Тогда
		
		ДанныеВыбора.Добавить(УстановленныйСтатус, УстановленныйСтатус);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

