

&НаКлиенте
Процедура НастройкиФормыНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Тип=Элементы.НастройкиФормы.ТекущиеДанные.Тип;
	Массив = Новый Массив;
	
	Если Тип="Команда" Тогда
		Массив.Добавить("Добавить");
		Массив.Добавить("КВыдаче");
		Массив.Добавить("Списание");
		Массив.Добавить("Выдать");
		Массив.Добавить("Приемка");
		Массив.Добавить("Снятие");
	Иначе
		ЗаполнитОперации(Массив); 		
	КонецЕсли;
	Элемент.СписокВыбора.ЗагрузитьЗначения(Массив);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитОперации(Массив)
	
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Работы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Работы КАК Лико_Работы";
	Массив=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиФормыКомандаОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Тип=Элементы.НастройкиФормы.ТекущиеДанные.Тип;
	Массив = Новый Массив;
	
	Если Тип<>"Команда" Тогда
		Массив.Добавить("КВыдаче");
		Массив.Добавить("Списание");
		Массив.Добавить("Выдать");
		Массив.Добавить("Приемка");
		Массив.Добавить("Снятие");
	КонецЕсли;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(Массив);	
КонецПроцедуры


&НаКлиенте
Процедура ТипСеткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка=Ложь;
	ДанныеВыбора=ПолучитьСписок();

КонецПроцедуры
//Элементы.НастройкиФормы.ОтборСтрок


&НаСервере
Функция ПолучитьСписок() //+Лико m.shenderov 29.04.2019  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеновыеГруппы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
	|ГДЕ
	|	ЦеновыеГруппы.Наименование ПОДОБНО ""%Сетка%""";
	
	Массив= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокЗначений = Новый СписокЗначений;
	Для каждого М Из Массив Цикл
		СписокЗначений.Добавить(М);
	КонецЦикла;
	Возврат СписокЗначений;
КонецФункции  //-Лико m.shenderov 29.04.2019
