Процедура ЗарегестрироватьСообщение(ОбъектРассылки,ТипСообщения) Экспорт  //+Лико m.shenderov 18.10.2023
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.Лико_РегистрацияРассылкиСообщений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРассылки.Установить(ОбъектРассылки);  
	НаборЗаписей.Отбор.ТипСообщения.Установить(ТипСообщения);
	
	
	ЗаказПоставщику=ПолучитьзаказПоставщику(ОбъектРассылки);
	
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат; 
	КонецЕсли;
	
	
	ДокОбъект=ЗаказПоставщику.ПолучитьОбъект();
	
	ДокОбъект.ОбменДанными.Загрузка=Истина;
	ДокОбъект.Лико_ЕстьОплата=Истина;
	ДокОбъект.Записать();
	
	// <-- Начало Лико Яцун С. В. 23.10.2024 
	Если ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован Тогда
		ВыделенныеСтроки = Новый Массив;
		ВыделенныеСтроки.Добавить(ЗаказПоставщику);
		ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(ВыделенныеСтроки, "Подтвержден");		
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 23.10.2024
	
	Запись=НаборЗаписей.Добавить();
	Запись.ОбъектРассылки=ОбъектРассылки;
	Запись.ТипСообщения=ТипСообщения;
	Запись.Дата=ТекущаяДата();
	НаборЗаписей.Записать(Истина);
		 
КонецПроцедуры //-Лико m.shenderov 18.10.2023

Процедура УдалитьРегистрациюСообщения(ОбъектРассылки,ТипСообщения) Экспорт  //+Лико m.shenderov 18.10.2023
		 УстановитьПривилегированныйРежим(Истина);
		 НаборЗаписей = РегистрыСведений.Лико_РегистрацияРассылкиСообщений.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.ОбъектРассылки.Установить(ОбъектРассылки);  
		 НаборЗаписей.Отбор.ТипСообщения.Установить(ТипСообщения);
		 НаборЗаписей.Записать();
		 
		 		 
КонецПроцедуры //-Лико m.shenderov 18.10.2023

	 
Функция ПолучитьзаказПоставщику(ОбъектРассылки) //+Лико m.shenderov 23.10.2023
		 Если   ЗначениеЗаполнено(ОбъектРассылки.Лико_ЗаказПоставщику) Тогда
			 Возврат ОбъектРассылки.Лико_ЗаказПоставщику;
		 КонецЕсли;
		 
		 Для каждого Платеж Из ОбъектРассылки.РасшифровкаПлатежа Цикл
			 Если ЗначениеЗаполнено(Платеж.Лико_ЗаказПоставщику) Тогда
				 Возврат Платеж.Лико_ЗаказПоставщику; 
			 КонецЕсли;
			 
		 КонецЦикла;
КонецФункции //-Лико m.shenderov 23.10.2023 
	 