
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние <> Перечисления.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Подтверждено Тогда
		ДатаУтверждения = Неопределено;
	ИначеЕсли Состояние = Перечисления.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Подтверждено И НЕ ЗначениеЗаполнено(ДатаУтверждения) Тогда
		ДатаУтверждения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДатаУтверждения = Неопределено;
	Состояние = Неопределено;
	Автор = Неопределено;
КонецПроцедуры
