#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеВидаУведомления(ВидУведомления) Экспорт

	Если ВидУведомления = Перечисления.ВидыУведомленийОбИзмененииРасчетаПособия.ПроцессЗакрыт Тогда
		Описание = НСтр("ru = 'Изменены параметры назначения пособия. Данный процесс закрыт, СФР направит новые входящие запросы " +
			"с другими номерами процессов соответствующим страхователям'");
	ИначеЕсли ВидУведомления = Перечисления.ВидыУведомленийОбИзмененииРасчетаПособия.ПолученОтветДругогоСтрахователя Тогда
		Описание = НСтр("ru = 'По данному страховому случаю получено 101 сообщение (ответ на запрос СФР для расчета пособия) от другого страхователя';
						|en = 'For this insurance case, 101 messages (response to the Social Insurance Fund of Russia request for benefit calculation) are received from another insurant'");
	Иначе
		Описание = "";
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#КонецЕсли