
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВариантОткрытия", ВариантОткрытия);
	Если ВариантОткрытия = "ЗаявкаНаТранспортировку" Тогда
		Город = Истина;
		Намотка = Истина;
		КодЭтикеткиЗаказчика = Истина;
		ЧестныйЗнак = Истина;
		НомерПоставки = Истина;
		Элементы.Цена.Видимость = Ложь;
		Элементы.Втулка.Видимость = Ложь;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если ВариантОткрытия = "ЗаявкаНаТранспортировку" Тогда
		СтрокаКлючевыхПараметров = "";
		Если Город Тогда
			СтрокаКлючевыхПараметров = СтрокаКлючевыхПараметров + ",Город";
		КонецЕсли;
		Если КодЭтикеткиЗаказчика Тогда
			СтрокаКлючевыхПараметров = СтрокаКлючевыхПараметров + ",КодЭтикеткиЗаказчика";
		КонецЕсли;
		Если ЧестныйЗнак Тогда
			СтрокаКлючевыхПараметров = СтрокаКлючевыхПараметров + ",ЧестныйЗнак";
		КонецЕсли;
		Если Намотка Тогда
			СтрокаКлючевыхПараметров = СтрокаКлючевыхПараметров + ",Намотка";
		КонецЕсли;
		Если НомерПоставки Тогда
			СтрокаКлючевыхПараметров = СтрокаКлючевыхПараметров + ",НомерПоставки";
		КонецЕсли;
		ЭтаФорма.Закрыть(СтрокаКлючевыхПараметров);
	Иначе
		СтруктураВозврата = Новый Структура("Цена,КодЭтикеткиЗаказчика,ЧестныйЗнак,Город,Намотка,НомерПоставки,Втулка", Цена, КодЭтикеткиЗаказчика, ЧестныйЗнак, Город, Намотка, НомерПоставки, Втулка);
		ЭтаФорма.Закрыть(СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры
