
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТипМетаданных") Тогда
		Если Параметры.ТипМетаданных="Документы" Тогда 		
			ЭтаФорма.Заголовок="Подбор документа";
			Для каждого Документ Из Метаданные.Документы  Цикл
				НоваяСтрока=СписокМетаданных.Добавить();
				НоваяСтрока.Имя=Документ.Имя;
				НоваяСтрока.Синоним=Документ.Синоним;				
			КонецЦикла;
		КонецЕсли;		
	КОнецЕсли;
	Если Параметры.Свойство("ВыборПоФлажку") Тогда
		ВыборПоФлажку=Параметры.ВыборПоФлажку;
		Элементы.СписокМетаданныхВыбор.Видимость=Истина;
		Если Параметры.Свойство("Документы") Тогда
			Для каждого Док Из Параметры.Документы Цикл
				Структура = Новый Структура;
				
				НайденыеСтроки=СписокМетаданных.НайтиСтроки(Новый Структура("Имя",Док));
				Для каждого Стр Из НайденыеСтроки Цикл
					Стр.Выбор=Истина;				 	
				КонецЦикла;			 	
			КонецЦикла;
		КонецЕсли;
	Иначе
		Элементы.СписокМетаданныхВыбор.Видимость=Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.РежимВыбора) Тогда
		//Элементы.Объект.ТекущаяСтрока = Параметры.ТекущаяСтрока;
		Элементы.СписокМетаданных.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не  ВыборПоФлажку Тогда
		Структура = Новый Структура("Имя,Синоним",СписокМетаданных.Получить(ВыбраннаяСтрока).Имя,СписокМетаданных.Получить(ВыбраннаяСтрока).Синоним);
		Закрыть(Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(СписокМетаданных.НайтиСтроки(Новый Структура("Выбор",Истина)));
КонецПроцедуры
