
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтруктураЗаполнения") Тогда
		 ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.СтруктураЗаполнения);
		 ЕСли Параметры.СтруктураЗаполнения.Свойство("ЕстьНарезка") Тогда
			ЕстьНарезка=Параметры.СтруктураЗаполнения.ЕстьНарезка;
			Элементы.Нарезка.Видимость=ЕстьНарезка;;
		 КонецЕсли;
		 
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРезервирование(Команда)
	Если Не ЗначениеЗаполнено(Нарезка) и ЕстьНарезка Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Нарезка!""'"), ,
		"Нарезка");
		

		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Количество",Количество);
	Структура.Вставить("Нарезка",Нарезка);
	Структура.Вставить("ОжидаетсяПриход",ОжидаетсяПриход);
	Структура.Вставить("ОжидаетсяПереработка",ОжидаетсяПереработка);
	Закрыть(Структура);

КонецПроцедуры
