#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ПлощадкаПоОрганизации(Организация) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Справочники.Лико_Площадки.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(Лико_Площадки.Ссылка) КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Площадки КАК Лико_Площадки
	|ГДЕ
	|	Лико_Площадки.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.Ссылка;
		
	КонецЦикла; 
	
	
	Возврат Результат;
	
КонецФункции 

Функция КонтрольНаличияФотоРулонногоМатериала(Площадка, ДатаДокумента, МассивСерий) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	ДатаКонтроля =Площадка.ДатаНачалаКонтроляНаличияФотоБиркиРулонногоМатериала;
	Если Не Площадка.КонтрольНаличияФотоБиркиРулонногоМатериала
		Или (ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля>=ДатаДокумента) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка,
	|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия
	|ПОМЕСТИТЬ ВтОбъектыНоменклатуры
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Серия В(&МассивСерий)
	|	И ЯССМ_ОбъектыНоменклатуры.Рулонный
	|	И ЯССМ_ОбъектыНоменклатуры.Уникальный
	|	И ВЫБОР
	|			КОГДА &КонтрольДаты
	|				ТОГДА ЯССМ_ОбъектыНоменклатуры.ДатаФормирования >= &ДатаКонтроля
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЯССМ_ОбъектыНоменклатуры.ЗакрытиеБланка = ЗНАЧЕНИЕ(Документ.Лико_БланкЭтапа.Пустаяссылка)
	|	И ЯССМ_ОбъектыНоменклатуры.ПриходныйОрдер <> ЗНАЧЕНИЕ(Документ.ПриходныйОрдерНаТовары.Пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыНоменклатуры.Серия КАК Серия
	|ИЗ
	|	ВтОбъектыНоменклатуры КАК ВтОбъектыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы КАК ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы
	|		ПО ВтОбъектыНоменклатуры.Ссылка.Ссылка = ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы.ВладелецФайла
	|			И (ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("МассивСерий",МассивСерий );
	Запрос.УстановитьПараметр("КонтрольДаты",ЗначениеЗаполнено(ДатаКонтроля)); 
	Запрос.УстановитьПараметр("ДатаКонтроля",ДатаКонтроля);

	Результат =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");
	
	
	 Возврат Результат;
	
КонецФункции 

Процедура КорректироватьПодразделениеПроизводствоПоПлощадке(ДокументОбъект) Экспорт	
	
	КорректироватьПодразделениеПроизводствоПоПлощадкеВнутреннееПотреблениеТоваров(ДокументОбъект);
	
КонецПроцедуры 


Процедура КорректироватьПодразделениеПроизводствоПоПлощадкеВнутреннееПотреблениеТоваров(ДокументОбъект)
	
	Если ТипЗнч(ДокументОбъект)<> Тип("ДокументОбъект.ВнутреннееПотребление") Тогда
		Возврат;
	КонецЕсли;

	
	ПодразделениеПроизводство = Справочники.Лико_ПредопределенныеЗначения.ПодразделениеПроизводство.ЗначениеПараметра;

	Площадка       = ДокументОбъект.Склад.Лико_Площадка;
	Подразделение  = Площадка.ПодразделениеПроизводство;
	
	
	Если  ПодразделениеПроизводство =  ДокументОбъект.Подразделение 
		И  ДокументОбъект.Подразделение <> Подразделение Тогда
		
		ДокументОбъект.Подразделение = Подразделение;
		  
	КонецЕсли;  	
	
 	
	Для каждого Товар Из ДокументОбъект.Товары Цикл 
		
		
		Если ПодразделениеПроизводство = Товар.АналитикаРасходов
			И  Товар.АналитикаРасходов<> Подразделение Тогда
			
			 Товар.АналитикаРасходов = Подразделение;
			 
		 КонецЕсли;
		 
	КонецЦикла;


	
	
	    	

КонецПроцедуры



#КонецОбласти

#КонецЕсли