
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	СписокИстрияФормы.Параметры.УстановитьЗначениеПараметра("Форма",Объект.Ссылка);
	
	Если Параметры.Свойство("Заказ") Тогда
		ЗаказОткрытия = Параметры.Заказ;
	КонецЕсли;   
	
	// --> Начало Лико Ефимов ЕВВ 16.06.2025
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Код.ТолькоПросмотр = Истина; 
		Элементы.Сплошная.ТолькоПросмотр = Истина;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 16.06.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ИзменитьПараметрВЗаказах(Объект.Ссылка,Объект.Грамматура,Объект.ПроцентЗаливки,ЗаказОткрытия);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПараметрВЗаказах(Форма,Грамматура,ПроцентЗаливки,ЗаказОткрытия)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаЦвета.Ссылка КАК Заказ,
	|	ЗаказКлиентаЦвета.КлючСтроки КАК КлючСтроки,
	|	ЗаказКлиентаЦвета.Ссылка.НомерБезПрефикса КАК НомерБезПрефикса
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Форма = &Форма
	|	И (ЗаказКлиентаЦвета.Грамматура <> &Грамматура
	|			ИЛИ ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки)";
	ЗапросЗаказы.УстановитьПараметр("Форма", Форма);
	Если ЗначениеЗаполнено(Грамматура) И ЗначениеЗаполнено(ПроцентЗаливки) Тогда
		ЗапросЗаказы.УстановитьПараметр("Грамматура", Число(Формат(Грамматура * 0.5,"ЧЦ=4; ЧДЦ=1")));
		ЗапросЗаказы.УстановитьПараметр("ПроцентЗаливки", Число(Формат(ПроцентЗаливки,"ЧЦ=3; ЧДЦ=0")));
	ИначеЕсли ЗначениеЗаполнено(Грамматура) Тогда
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "И (ЗаказКлиентаЦвета.Грамматура <> &Грамматура","И ЗаказКлиентаЦвета.Грамматура <> &Грамматура");
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "ИЛИ ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки)","");
		ЗапросЗаказы.УстановитьПараметр("Грамматура", Число(Формат(Грамматура * 0.5,"ЧЦ=4; ЧДЦ=1")));
	ИначеЕсли ЗначениеЗаполнено(ПроцентЗаливки) Тогда
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "И (ЗаказКлиентаЦвета.Грамматура <> &Грамматура","");
		ЗапросЗаказы.Текст = СтрЗаменить(ЗапросЗаказы.Текст, "ИЛИ ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки)","И ЗаказКлиентаЦвета.ПроцентЗаливки <> &ПроцентЗаливки");
		ЗапросЗаказы.УстановитьПараметр("ПроцентЗаливки", Число(Формат(ПроцентЗаливки,"ЧЦ=3; ЧДЦ=0")));
	Иначе
		Возврат;
	КонецЕсли;
	Выборка = ЗапросЗаказы.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Заказ = ЗаказОткрытия Тогда
			Продолжить;	
		КонецЕсли;
		ЗаказОбъект = Выборка.Заказ.ПолучитьОбъект();
		Стр = ЗаказОбъект.Цвета.Найти(Выборка.КлючСтроки, "КлючСтроки");
		Если ЗначениеЗаполнено(ПроцентЗаливки) Тогда
			Стр.ПроцентЗаливки = ПроцентЗаливки;
		КонецЕсли;
		Если ЗначениеЗаполнено(Грамматура) Тогда
			Стр.Грамматура = Грамматура * 0.5;
		КонецЕсли;
		ЗаказОбъект.ОбменДанными.Загрузка = Истина;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Записан заказ "+ Выборка.НомерБезПрефикса); 
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


