
&Вместо("УстановитьЦеныВЗаказахКлиента")
Процедура Лико_УстановитьЦеныВЗаказахКлиента()

	Если ВидДокумента = Перечисления.Лико_ВидыДокументаЛико_АктВыполненныхРабот.АктВыполненныхРабот Тогда

		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Регистратор.ЗаказПокупателя КАК Заказ,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВтРаботы
		|ИЗ
		|	Документ.Лико_ВыполненныеРаботыМеждуОрганизациями.Работы КАК Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы
		|ГДЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.Цена КАК Цена,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.СтавкаНДС КАК СтавкаНДС,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.ЦеноваяГруппа КАК ЦеноваяГруппа
		|ПОМЕСТИТЬ ВтЦены
		|ИЗ
		|	Документ.Лико_ВыполненныеРаботыМеждуОрганизациями.Цены КАК Лико_ВыполненныеРаботыМеждуОрганизациямиЦены
		|ГДЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВтРаботы.Заказ КАК Заказ,
		|	ВтРаботы.Номенклатура КАК Номенклатура,
		|	ВтРаботы.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВтЦены.СтавкаНДС КАК СтавкаНДС,
		|	ВтЦены.Цена КАК Цена
		|ПОМЕСТИТЬ ВтЗаказЦены
		|ИЗ
		|	ВтРаботы КАК ВтРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЦены КАК ВтЦены
		|		ПО ВтРаботы.ЦеноваяГруппа = ВтЦены.ЦеноваяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтЗаказЦены.Заказ КАК Заказ,
		|	ВтЗаказЦены.Номенклатура КАК Номенклатура,
		|	ВтЗаказЦены.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВтЗаказЦены.СтавкаНДС КАК СтавкаНДС,
		|	ВтЗаказЦены.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Цена КАК ЦенаЗаказа,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДСЗаказа
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЗаказЦены КАК ВтЗаказЦены
		|		ПО ЗаказКлиентаТовары.Ссылка = ВтЗаказЦены.Заказ
		|			И ЗаказКлиентаТовары.Номенклатура = ВтЗаказЦены.Номенклатура
		|ГДЕ
		|	(ВтЗаказЦены.Цена <> ЗаказКлиентаТовары.Цена
		|			ИЛИ ВтЗаказЦены.СтавкаНДС <> ЗаказКлиентаТовары.СтавкаНДС)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура)
		|ПО
		|	Заказ";
		Запрос.УстановитьПараметр("Ссылка",Ссылка );
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаЗаказ.Следующий() Цикл


			ЗаказОбъект = ВыборкаЗаказ.Заказ.ПолучитьОбъект();
			//ЗаказОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
			Выборка = ВыборкаЗаказ.Выбрать();
			Пока Выборка.Следующий() цикл
				НайтиСтрокиТоваров = ЗаказОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
				Для каждого Товар Из НайтиСтрокиТоваров Цикл 
					
					Товар.СтавкаНДС = Выборка.СтавкаНДС;
					Товар.Цена = Выборка.Цена; 
					//ПараметрыРасчетаПересчитатьДанные(Дата, ЗаказОбъект.Площадка,Товар); 
					
					СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЗаказОбъект);
					
					СтруктураДействий = Новый Структура;
					СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСумму");
					//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
					//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
					//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
					
					ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);
					
					//ТекПроцентНДС = Товар.СтавкаНДС.Ставка;
					//Товар.ЦенаБезНДС = Товар.цена/(1+ТекПроцентНДС/100);
					
										
				КонецЦикла
			КонецЦикла;


			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказОбъект.Записать();


		КонецЦикла;
	КонецЕсли;


КонецПроцедуры
