
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписейЗатраты = РегистрыНакопления.Лико_ЗатратыПоЗаказу.СоздатьНаборЗаписей();
	НаборЗаписейЗатраты.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейЗатраты.Записать();
	
	НаборЗаписейЗатратыДляОтгрузки = РегистрыНакопления.Лико_ЗатратыПоЗаказуДляОтгрузки.СоздатьНаборЗаписей();
	НаборЗаписейЗатратыДляОтгрузки.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейЗатратыДляОтгрузки.Записать();
	
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.Заказ КАК ЗаказКлиента,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.РабочийЦентр КАК РабочийЦентр,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.Затрата КАК Затрата,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.НомерПроката КАК НомерПроката,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.ВидРабот КАК ВидРабот,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.НомерРаботы КАК НомерРаботы,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.Количество КАК Количество,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.Сумма КАК Сумма,
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.КоличествоПМ КАК КоличествоПМ
	|ИЗ
	|	Документ.Лико_ВводОстатковЗатратДляОтгрузки.Затраты КАК ВводОстатковЗатратДляОтгрузкиЗатраты
	|ГДЕ
	|	ВводОстатковЗатратДляОтгрузкиЗатраты.Ссылка = &ссылка";
	Запрос.УстановитьПараметр("Ссылка", ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись =НаборЗаписейЗатраты.Добавить();
		Запись.Регистратор = Ссылка;
		Запись.Период = Дата;
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		ЗаписьОстатки =НаборЗаписейЗатратыДляОтгрузки.Добавить();
		ЗаписьОстатки.Регистратор = Ссылка;
		ЗаписьОстатки.Период = Дата;
		ЗаписьОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(ЗаписьОстатки, Выборка);
		
			
	КонецЦикла;
	НаборЗаписейЗатраты.Записать();
  	НаборЗаписейЗатратыДляОтгрузки.Записать();
		
КонецПроцедуры
