#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеЧислом(Значение) Экспорт
	Если Значение = ОтстранениеОтРаботы Тогда
		Возврат 1;
	ИначеЕсли Значение = ОтпускБезСохраненияОплаты Тогда
		Возврат 2;
	ИначеЕсли Значение = УчебныйОтпуск Тогда
		Возврат 3;
	ИначеЕсли Значение = Отпуск Тогда
		Возврат 4;
	ИначеЕсли Значение = Работа Тогда
		Возврат 4;
	ИначеЕсли Значение = Иное Тогда
		Возврат 4;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ЭтоОтпуск(Значение) Экспорт
	Возврат Значение = Отпуск Или Значение = ОтпускБезСохраненияОплаты Или Значение = УчебныйОтпуск;
КонецФункции

#КонецОбласти

#КонецЕсли