
&Вместо("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Возврат;
	УстановитьПривилегированныйРежим(Истина);
	//ВвостановитьЗначениеВидНастроечногоМатериалаУОбъектовНоменклатуры();

КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Лико_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		МассивНепроверяемыхРеквизитов = Новый Массив;  
	МассивНепроверяемыхРеквизитов.Добавить("ВидНастроечногоМатериала");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры
