//**********************************
//**********************************
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	//--> Маковеева А.Ю.
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	//<-- Маковеева А.Ю.
	
КонецПроцедуры

// Функция ПолучитьСкладНезавершеннгоПроизводства
//
/// Описание: НужноИзменить
//
// Параметры: 
// Организация 		   - Строка          	    - (обязательный).  Пример: 
//
// Возвращаемое значение:
// Склад  
//
Функция ПолучитьСкладНезавершеннгоПроизводства(Организация) Экспорт //+Лико m.shenderov 25.09.2017
	ДопСвойстваОбъекта= УправлениеСвойствами.ПолучитьЗначенияСвойств(Организация);
	Для каждого ДопСвойство Из ДопСвойстваОбъекта Цикл
		Если ДопСвойство.Свойство.Заголовок="Склад незавершенного производства" Тогда
			Возврат ДопСвойство.Значение;
		КонецЕсли; 			
	КонецЦикла; 	
	
	Возврат Неопределено;
КонецФункции //ПолучитьСкладНезавершеннгоПроизводства -Лико m.shenderov 25.09.2017



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных; 
	
КонецФункции
    


Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект)
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Дата КАК Период,
	|	Документ.Склад КАК Склад,
	|	Документ.Распоряжение КАК Распоряжение,
	|	Документ.СкладскаяОперация КАК СкладскаяОперация,
	|	Документ.ЗонаПриемки КАК ЗонаПриемки,
	|	Документ.Помещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА Документ.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ВозвратНепринятыхТоваров)
	|				ИЛИ Документ.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ВозвратНепринятыхТоваровУстарел)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозвратНепринятыхТоваров,
	|	Документ.ЗакрыватьГрафикПоступления КАК ЗакрыватьГрафикПоступления,
	|	Документ.Подразделение КАК Отправитель,
	|	Документ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Документ.РабочийЦентр КАК РабочийЦентр,
	|	Документ.РабочийЦентр.ЛикоЯчейка КАК Ячейка,
	|	Документ.Подразделение КАК Подразделение,
	|	Документ.ЗаказПокупателя КАК ЗаказКлиента,
	|	МИНИМУМ(Документ.НомерПроката) КАК НомерПроката,
	|	Документ.Сотрудник КАК Сотрудник,
	|	Документ.Организация КАК Организация
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Документ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	//|		ПО Документ.ЗаказПокупателя = Лико_ПараметрыПроизводстваЗаказа.Заказ
	//|			И Документ.РабочийЦентр = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр
	|ГДЕ
	|	Документ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Документ.Дата,
	|	Документ.Склад,
	|	Документ.Распоряжение,
	|	Документ.СкладскаяОперация,
	|	Документ.ЗонаПриемки,
	|	Документ.Помещение,
	|	ВЫБОР
	|		КОГДА Документ.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ВозвратНепринятыхТоваров)
	|				ИЛИ Документ.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ВозвратНепринятыхТоваровУстарел)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Документ.ЗакрыватьГрафикПоступления,
	|	Документ.Подразделение,
	|	Документ.ХозяйственнаяОперация,
	|	Документ.РабочийЦентр,
	|	Документ.РабочийЦентр.ЛикоЯчейка,
	|	Документ.ЗаказПокупателя,
	|	Документ.Сотрудник,
	|	Документ.Организация,
	|	Документ.Подразделение";  
	
	Обработки.ПеремещениеТоваровДоп.КорректировкаЗапросаРегистраТоварыВЯчейках(ДокументСсылка.Организация, ДокументСсылка.Дата, Запрос.Текст); 

	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	Если ЗначениеЗаполнено(ДокументСсылка.РаспоряжениеНаОтгрузку) Тогда
		Распоряжение= ДокументСсылка.РаспоряжениеНаОтгрузку;
		Запрос.УстановитьПараметр("СписаниеНаРасходы",                               Истина);
		
	Иначе
		Распоряжение= ДокументСсылка.Распоряжение;
		Запрос.УстановитьПараметр("СписаниеНаРасходы",                               Ложь);
		
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",                              Реквизиты.Период);
	Запрос.УстановитьПараметр("ЗонаПриемки",                         Реквизиты.ЗонаПриемки);
 	Запрос.УстановитьПараметр("ЯчейкаРЦ",                        	 Реквизиты.Ячейка);
	Запрос.УстановитьПараметр("CLICKS_INDIGO",                       Справочники.Лико_ПредопределенныеЗначения.CLICKS_INDIGO.ЗначениеПараметра);
	Запрос.УстановитьПараметр("Незавершенка",  						 Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);

	// --> Начало Лико Ефимов ЕВВ 15.12.2021
	Если ЗначениеЗаполнено(ДокументСсылка.ДатаПроведенияПоОбязательнымРегистрам) Тогда
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 15.12.2021
	
	Запрос.УстановитьПараметр("Склад",                               Реквизиты.Склад);
	Запрос.УстановитьПараметр("ПериодДляТиповыхДокументов",          ?(ЗначениеЗаполнено(ДокументСсылка.ДатаДляТиповыхДокументов),ДокументСсылка.ДатаДляТиповыхДокументов,Реквизиты.Период));
	
	//Запрос.УстановитьПараметр("Распоряжение",                        Реквизиты.Распоряжение);
	Запрос.УстановитьПараметр("Распоряжение",                        Распоряжение);
	
	Запрос.УстановитьПараметр("Помещение",                           Реквизиты.Помещение);
	Запрос.УстановитьПараметр("СкладскаяОперация",                   Перечисления.СкладскиеОперации.ПередачаВПроизводствоПриемка);
	Запрос.УстановитьПараметр("Отправитель",                         Реквизиты.Склад);
	Запрос.УстановитьПараметр("Получатель",                          Реквизиты.Склад);
	Запрос.УстановитьПараметр("ВозвратНепринятыхТоваров",            Реквизиты.ВозвратНепринятыхТоваров);
	Запрос.УстановитьПараметр("ЗакрыватьГрафикПоступления",          Истина);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",               Перечисления.ХозяйственныеОперации.ВыпускПродукции);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку",              	 Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	Запрос.УстановитьПараметр("СкладскаяОперацияПриемкаПродукции",   Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства);
	Запрос.УстановитьПараметр("Подразделение",            			 Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("СкладскаяОперацияОтгрузкаНаВнутренниеНужды", Перечисления.СкладскиеОперации.ОтгрузкаНаВнутренниеНужды);
	Запрос.УстановитьПараметр("ЗаказКлиента",						 Реквизиты.ЗаказКлиента);
	Запрос.УстановитьПараметр("ВидОперацииПриход",					 Перечисления.Лико_ВидОперацииЗакрытияБланка.Выпуск);
	Запрос.УстановитьПараметр("ВидОперацииРасход",					 Перечисления.Лико_ВидОперацииЗакрытияБланка.Расход);
	Запрос.УстановитьПараметр("НомерПроката",						 Реквизиты.НомерПроката);
	Запрос.УстановитьПараметр("Сотрудник",                       	 Реквизиты.Сотрудник);
	Запрос.УстановитьПараметр("РабочийЦентр",                        Реквизиты.РабочийЦентр);
	//Запрос.УстановитьПараметр("ЕстьРаспоряжениеНаОтгрузку",          ЗначениеЗаполнено(ДокументСсылка.Распоряжение));
	Запрос.УстановитьПараметр("ЕстьРаспоряжениеНаОтгрузку",          ЗначениеЗаполнено(Распоряжение));
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперацияДляСборки",      Перечисления.ХозяйственныеОперации.РазборкаТоваров);
	Запрос.УстановитьПараметр("ХозяйственнаяОперацияДляПоступления", Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);
	Запрос.УстановитьПараметр("НачалоМесяца", 						 НачалоМесяца(Реквизиты.Период));
	Запрос.УстановитьПараметр("КонецМесяца",  						 КонецМесяца(Реквизиты.Период));
	Запрос.УстановитьПараметр("ЗаказКлиента",                        ДокументСсылка.ЗаказПокупателя);
	Запрос.УстановитьПараметр("СтатьяЗатратШтамп",                   Справочники.Лико_СтатьиЗатрат.Штампы);
	Запрос.УстановитьПараметр("ДатаПроведенияПоЗатратам",           Справочники.Лико_ПредопределенныеЗначения.ДатаПроведенияПоЗатратам.ЗначениеПараметра);
	Запрос.УстановитьПараметр("ВидЗаказаТестМатериала",           	Перечисления.Лико_ВидыЗаказов.ТестированиеМатериалов);
	//СкладОснастки= УправлениеСвойствами.ЗначениеСвойства(ДокументСсылка.Организация,"Лико_СкладОснастки");
	СкладОснастки= ДокументСсылка.Склад.Лико_Площадка.СкладОснастки;
	
	Запрос.УстановитьПараметр("СкладОснастки",           			СкладОснастки);	
	Запрос.УстановитьПараметр("НеСписыватьОснастку",           			СкладОснастки<> Реквизиты.Склад);	
	
	//Начало изменений Иванова А.В. 201904.11 
	//Параметры для определения цен по площадке
	Запрос.УстановитьПараметр("Площадка",          					Реквизиты.Организация);
	Запрос.УстановитьПараметр("ПлощадкаЛикофлекс",           		Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);		
	//Конец изменений Иванова А.В. 201904.11 
	_УчетНЗП=УправлениеСвойствами.ЗначениеСвойства(ДокументСсылка.Организация,"Лико_УчетНаСкладеНЗПвБУ");
	Запрос.УстановитьПараметр("УчетНЗП",           					?(ЗначениеЗаполнено(_УчетНЗП),_УчетНЗП,Ложь));	
	Если ЗначениеЗаполнено(ДокументСсылка.ХозяйственнаяОперация) Тогда
		Запрос.УстановитьПараметр("ХозяйственнаяОперацияДляСборки",      ДокументСсылка.ХозяйственнаяОперация);
	Иначе
		Запрос.УстановитьПараметр("ХозяйственнаяОперацияДляСборки",      Перечисления.ХозяйственныеОперации.РазборкаТоваров);
	КонецЕсли;
	
	
	Если ДокументСсылка.СвязатьСЭтапом Тогда
		Запрос.УстановитьПараметр("ЭтапПроизводства",  	   ДокументСсылка.Распоряжение);
	Иначе 
		Запрос.УстановитьПараметр("ЭтапПроизводства",  	   Документы.ЭтапПроизводства2_2.ПустаяСсылка());
	КонецЕсли;
	Если  ТипЗнч( Реквизиты.Распоряжение)=Тип("ДокументСсылка.СборкаТоваров") ТОгда
		Если НЕ Реквизиты.Распоряжение.Проведен Тогда
			Запрос.УстановитьПараметр("ПоАктуРазборки",       Истина);
		Иначе
			Запрос.УстановитьПараметр("ПоАктуРазборки",       Ложь);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ЭтоСборка",       Истина);
	Иначе
		Запрос.УстановитьПараметр("ЭтоСборка",       Ложь);
		Запрос.УстановитьПараметр("ПоАктуРазборки",       Ложь);
		
	КонецЕсли;
	Если ДокументСсылка.ПоАктуРазборки Тогда
		Запрос.УстановитьПараметр("ПоАктуРазборки", Истина); 
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("МомВрем", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	
	
	Если  ДокументСсылка.РабочийЦентр=Справочники.РабочиеЦентры.НайтиПоНаименованию("Перемотка") Тогда
		ЭтоПеремотка=Истина;
	Иначе
		ЭтоПеремотка=Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ЭтоПеремотка", ЭтоПеремотка);
	
	
	// Если в соглашении указаны особые правила учета товаров к поступлению.
	Если Реквизиты.ЗакрыватьГрафикПоступления Тогда
		Если ТипЗнч(Реквизиты.Распоряжение) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
			Запрос.УстановитьПараметр("РаспоряжениеДляГрафика", Справочники.СоглашенияСПоставщиками.ПолучитьДокументРегистрации(Реквизиты.Распоряжение));
		Иначе
			Запрос.УстановитьПараметр("РаспоряжениеДляГрафика", Реквизиты.Распоряжение);
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("РаспоряжениеДляГрафика",  Реквизиты.Распоряжение);
	КонецЕсли;
	//Распределение краски через колористическую	
	ЦеховаяКладоваяКраски=УправлениеСвойствами.ЗначениеСвойства(ДокументСсылка.Организация,"Лико_Колористическая");
	СписаниеКраскиЧерезЦеховуюКладовую=ЗначениеЗаполнено(ЦеховаяКладоваяКраски)
	и Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаСписаниеКраскиЧерезЦеховуюКладовую.ЗначениеПараметра<ДокументСсылка.Дата
	и Не ЗначениеЗаполнено(ДокументСсылка.ХозяйственнаяОперация);
	Если СписаниеКраскиЧерезЦеховуюКладовую	Тогда
		РаспоряжениеНаКраску=СоздатьПолучитьРаспоряжениеНаКраску(ДокументСсылка);
	Иначе
		РаспоряжениеНаКраску=Документы.ЗаказМатериаловВПроизводство.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("СписаниеКраскиЧерезЦеховуюКладовую",СписаниеКраскиЧерезЦеховуюКладовую);
	Запрос.УстановитьПараметр("ЦеховаяКладоваяКраски",ЦеховаяКладоваяКраски);
	Запрос.УстановитьПараметр("СписаниеКраскиЧерезЦеховуюКладовую",СписаниеКраскиЧерезЦеховуюКладовую);
	Запрос.УстановитьПараметр("РаспоряжениеНаКраску",РаспоряжениеНаКраску);
	Запрос.УстановитьПараметр("ВидНоменклатурыКраска",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);
	Запрос.УстановитьПараметр("ТзСписаниеОснастки",СформироватьТзСписаниеОснастки(ДокументСсылка));
	
	
	
КонецПроцедуры



Функция ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКПоступлению";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА &ЭтоСборка
	|			ТОГДА &Склад
	|		ИНАЧЕ &Подразделение
	|	КОНЕЦ КАК Отправитель,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	&Распоряжение КАК ДокументПоступления,
	|	ТаблицаТовары.Количество КАК КОформлениюОрдеров,
	|	0 КАК КОформлениюПоступленийПоОрдерам,
	|	0 КАК Принимается,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА &ЭтоСборка
	|			ТОГДА &ХозяйственнаяОперацияДляСборки
	|		ИНАЧЕ &ХозяйственнаяОперацияДляПоступления
	|	КОНЕЦ КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0
	|	И &ЕстьРаспоряжениеНаОтгрузку
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Склад,
	|	ВЫБОР
	|		КОГДА &ЭтоСборка
	|			ТОГДА &Склад
	|		ИНАЧЕ &Подразделение
	|	КОНЕЦ,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	&Распоряжение,
	|	0,
	|	ТаблицаТовары.Количество,
	|	0,
	|	ТаблицаТовары.Назначение,
	|	ВЫБОР
	|		КОГДА &ЭтоСборка
	|			ТОГДА &ХозяйственнаяОперацияДляСборки
	|		ИНАЧЕ &ХозяйственнаяОперацияДляПоступления
	|	КОНЕЦ
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0
	|	И &ЕстьРаспоряжениеНаОтгрузку";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыНаСкладах";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаРасход", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРасход(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	// С учетом остатокв по товарам на складе
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&Помещение КАК Помещение,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК ВНаличии,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ТаблицаТовары.Тип КАК Тип
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Период,
	|	&Склад,
	|	&Помещение,
	|	ТаблицаРасход.Номенклатура,
	|	ТаблицаРасход.Характеристика,
	|	ТаблицаРасход.Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаРасход.СтатусУказанияСерий В (4, 6, 8, 10, 14)
	|			ТОГДА ТаблицаРасход.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаРасход.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаРасход.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ,
	|	NULL
	|ИЗ
	|	ВтТаблицаРасход КАК ТаблицаРасход
	|ГДЕ
	|	ТаблицаРасход.Количество <> 0
	|	И Не ТаблицаРасход.НеСписыватьОснастку
	|	И ТаблицаРасход.МожноСписать";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры,ДокументСсылка)
	
	ИмяРегистра = "ТоварыВЯчейках";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаВыпуск.Ссылка.РежимЗакрытия = ЗНАЧЕНИЕ(Перечисление.Лико_РежимЗакрытияЗаказа.ПереместитьНасклад)
	|			ТОГДА &ЗонаПриемки
	|		ИНАЧЕ Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр.ЛикоЯчейка
	|	КОНЕЦ КАК Ячейка,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Лико_БланкЭтапаВыпуск.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Характеристика КАК Характеристика,
	|	Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	Лико_БланкЭтапаВыпуск.Количество КАК ВНаличии,
	|	Лико_БланкЭтапаВыпуск.Серия КАК Серия,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка) КАК Назначение
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаВыпуск.Количество <> 0
	|	И Лико_БланкЭтапаВыпуск.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Ссылка.МатериалНаМашине
	|			ТОГДА ВЫБОР
	|					КОГДА Лико_БланкЭтапаТовары.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|						ТОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.Лико_НаМашине
	|					ИНАЧЕ Лико_БланкЭтапаТовары.РабочийЦентр.Лико_НаМашине
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_БланкЭтапаТовары.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|					ТОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ЛикоЯчейка
	|				ИНАЧЕ Лико_БланкЭтапаТовары.РабочийЦентр.ЛикоЯчейка
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения,
	|	Лико_БланкЭтапаТовары.КоличествоРасход + Лико_БланкЭтапаТовары.ВозвратКоличество,
	|	Лико_БланкЭтапаТовары.Серия,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка)
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.КоличествоРасход > 0
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Номенклатура <> &CLICKS_INDIGO
	|	И Лико_БланкЭтапаТовары.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Ссылка.МатериалНаМашине
	|			ТОГДА ВЫБОР
	|					КОГДА Лико_БланкЭтапаТовары.Ссылка.РежимЗакрытия = ЗНАЧЕНИЕ(Перечисление.Лико_РежимЗакрытияЗаказа.ПереместитьНасклад)
	|							И НЕ Лико_БланкЭтапаТовары.Ссылка.ОставитьНаРабочемЦентреСырье
	|						ТОГДА &ЗонаПриемки
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.INDIGO)
	|									И Лико_БланкЭтапаТовары.Ссылка.Дата >= ДАТАВРЕМЯ(2019, 10, 18)
	|								ТОГДА Лико_БланкЭтапаТовары.РабочийЦентр.Лико_НаМашине
	|							ИНАЧЕ Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.Лико_НаМашине
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_БланкЭтапаТовары.Ссылка.РежимЗакрытия = ЗНАЧЕНИЕ(Перечисление.Лико_РежимЗакрытияЗаказа.ПереместитьНасклад)
	|						И НЕ Лико_БланкЭтапаТовары.Ссылка.ОставитьНаРабочемЦентреСырье
	|					ТОГДА &ЗонаПриемки
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.INDIGO)
	|								И Лико_БланкЭтапаТовары.Ссылка.Дата >= ДАТАВРЕМЯ(2019, 10, 18)
	|							ТОГДА Лико_БланкЭтапаТовары.РабочийЦентр.ЛикоЯчейка
	|						ИНАЧЕ Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ЛикоЯчейка
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения,
	|	Лико_БланкЭтапаТовары.ВозвратКоличество,
	|	Лико_БланкЭтапаТовары.Серия,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка)
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.ВозвратКоличество > 0
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Номенклатура <> &CLICKS_INDIGO
	|	И Лико_БланкЭтапаТовары.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаВыпуск.АдресХранения = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|			ТОГДА &ЗонаПриемки
	|		ИНАЧЕ Лико_БланкЭтапаВыпуск.АдресХранения
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_БланкЭтапаВыпуск.Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Характеристика,
	|	Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения,
	|	Лико_БланкЭтапаВыпуск.Количество,
	|	Лико_БланкЭтапаВыпуск.Серия,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка)
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаВыпуск.Количество <> 0
	|	И Лико_БланкЭтапаВыпуск.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.АдресХранения = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|			ТОГДА &ЗонаПриемки
	|		ИНАЧЕ Лико_БланкЭтапаТовары.АдресХранения
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения,
	|	Лико_БланкЭтапаТовары.КоличествоРасход,
	|	Лико_БланкЭтапаТовары.Серия,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка)
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.КоличествоРасход > 0
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Номенклатура <> &CLICKS_INDIGO
	|	И Лико_БланкЭтапаТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаВыпуск.Ссылка.РежимЗакрытия = ЗНАЧЕНИЕ(Перечисление.Лико_РежимЗакрытияЗаказа.ПереместитьНасклад)
	|			ТОГДА &ЗонаПриемки
	|		ИНАЧЕ Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр.ЛикоЯчейка
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Лико_БланкЭтапаВыпуск.Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Характеристика,
	|	Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения,
	|	Лико_БланкЭтапаВыпуск.Количество,
	|	Лико_БланкЭтапаВыпуск.Серия,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка)
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаВыпуск.Количество <> 0
	|	И Лико_БланкЭтапаВыпуск.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(перечисление.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка)
	|	И (Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр.Лико_СписыватьВыпускНезавершеннойПродукции
	|			ИЛИ Лико_БланкЭтапаВыпуск.Ссылка.СписыватьВыпускНезавершеннойПродукции)
	|	И Лико_БланкЭтапаВыпуск.Номенклатура.ВидНоменклатуры = &Незавершенка
	|	И Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ТипЗаказа <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)";
	
	
	Обработки.ПеремещениеТоваровДоп.КорректировкаЗапросаРегистраТоварыВЯчейках(ДокументСсылка.Организация, ДокументСсылка.Дата,ТекстЗапроса); 
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияСерийТоваров";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаРасход", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРасход(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	// С учетом остатокв по товарам на складе
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.Количество КАК Количество,
	|	&Склад КАК Получатель,
	|	&Помещение КАК ПомещениеПолучателя,
	|	&Подразделение КАК Отправитель,
	|	&СкладскаяОперацияПриемкаПродукции КАК СкладскаяОперация,
	|	&Ссылка КАК Документ,
	|	&Период КАК Период,
	|	ИСТИНА КАК ЭтоСкладскоеДвижение,
	|	NULL КАК ПомещениеОтправителя
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоварыРасход.Номенклатура,
	|	ТаблицаТоварыРасход.Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТоварыРасход.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТоварыРасход.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаТоварыРасход.Серия,
	|	ТаблицаТоварыРасход.Количество,
	|	&Подразделение,
	|	NULL,
	|	&Склад,
	|	&СкладскаяОперацияОтгрузкаНаВнутренниеНужды,
	|	&Ссылка,
	|	&Период,
	|	ИСТИНА,
	|	&Помещение
	|ИЗ
	|	ВтТаблицаРасход КАК ТаблицаТоварыРасход
	|ГДЕ
	|	ТаблицаТоварыРасход.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И НЕ ТаблицаТоварыРасход.НеСписыватьОснастку
	|	И ТаблицаТоварыРасход.МожноСписать";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТоварыКОформлениюПоступления(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКОформлениюПоступления";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&Отправитель КАК Отправитель,
	|	&Распоряжение КАК ДокументПоступления,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК КОформлению,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерий = 14
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Количество <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ОбеспечениеЗаказов";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	&Склад КАК Склад,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Количество
	|	КОНЕЦ КАК НаличиеПодЗаказ
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	И ТаблицаТовары.Количество <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвижениеСерииТоваров(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвижениеСерииТоваров";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	&РаспоряжениеДляГрафика КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПланируемоеПоступление,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПланируемоеПоступлениеПодЗаказ,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПланируемоеПоступлениеСНеподтвержденными,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА -ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПланируемоеПоступлениеПодЗаказСНеподтвержденными
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	&ЗакрыватьГрафикПоступления
	|	И ТаблицаТовары.Количество <> 0
	|	И &ЕстьРаспоряжениеНаОтгрузку";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "СвободныеОстатки";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК ВНаличии,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВРезервеПодЗаказ
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКОтгрузке";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	&ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ВЫБОР
	|		КОГДА &ЭтоСборка
	|			ТОГДА &Склад
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &СписаниеКраскиЧерезЦеховуюКладовую
	|						И Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКраска
	|					ТОГДА &ЦеховаяКладоваяКраски
	|				ИНАЧЕ &Подразделение
	|			КОНЕЦ
	|	КОНЕЦ КАК Получатель,
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка) КАК Серия,
	|	Лико_БланкЭтапаТовары.Количество КАК КОтгрузке,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка) КАК Назначение,
	|	&Распоряжение КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА &СписаниеКраскиЧерезЦеховуюКладовую
	|				И Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКраска
	|			ТОГДА &РаспоряжениеНаКраску
	|		ИНАЧЕ &Распоряжение
	|	КОНЕЦ КАК ДокументОтгрузки
	|ИЗ
	|	ВтТаблицаРасход КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Количество > 0
	|	И Не Лико_БланкЭтапаТовары.НеСписыватьОснастку
	|	И Лико_БланкЭтапаТовары.МожноСписать
	|	И &ЕстьРаспоряжениеНаОтгрузку";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции



Функция ТекстЗапросаТаблицаДвиженияЛико_ЗакрытиеБланка(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Лико_ЗакрытиеБланка";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаРасход", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРасход(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	&ЗаказКлиента КАК ЗаказКлиента,
	|	&Ссылка КАК Распоряжение,
	|	&НомерПроката КАК НомерПроката,
	|	&ВидОперацииПриход КАК ВидОперации,
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДВижения,
	|	СУММА(ТаблицаТовары.Количество) КАК КоличествоЭтап,
	|	СУММА(ТаблицаТовары.Количество) КАК КоличествоДвижение,
	|	&ЭтапПроизводства КАК ЭтапПроизводства,
	|	ЛОЖЬ КАК Оснастка
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	(&НомерПроката <> 0
	|			ИЛИ &ЭтоПеремотка)
	|	И НЕ &ЭтоСборка
	|	И НЕ &СписаниеНаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоварыРасход.Номенклатура,
	|	ТаблицаТоварыРасход.Характеристика,
	|	&ЗаказКлиента,
	|	&Ссылка,
	|	&НомерПроката,
	|	&ВидОперацииРасход,
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	СУММА(ТаблицаТоварыРасход.Количество),
	|	СУММА(ТаблицаТоварыРасход.Количество),
	|	&ЭтапПроизводства,
	|	ТаблицаТоварыРасход.ДопРасход
	|ИЗ
	|	ВтТаблицаРасход КАК ТаблицаТоварыРасход
	|ГДЕ
	|	(&НомерПроката <> 0
	|			ИЛИ &ЭтоПеремотка)
	|	И НЕ &ЭтоСборка
	|	И ТаблицаТоварыРасход.МожноСписать
	|	И НЕ &СписаниеНаРасходы
	|	И ВЫБОР
	|			КОГДА &СписаниеКраскиЧерезЦеховуюКладовую
	|				ТОГДА ТаблицаТоварыРасход.Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыКраска
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоварыРасход.Номенклатура,
	|	ТаблицаТоварыРасход.Характеристика,
	|	ТаблицаТоварыРасход.ДопРасход";
	
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияЛикоПартииКликов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ЛикоПартииКликов";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДВижения,
	|	Лико_БланкЭтапаТовары.Ссылка КАК Партия,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК Количество
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Номенклатура = &CLICKS_INDIGO
	|	И Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияЛико_ТоварыКРаспределению(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ТоварыКРаспределению";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	&ЗаказКлиента КАК ЗаказКлиента,
	|	&РабочийЦентр КАК РабочийЦентр,
	|	&Сотрудник КАК Сотрудник,
	|	Лико_БланкЭтапаТовары.КоличествоРасход КАК Количество,
	|	Лико_БланкЭтапаТовары.КоличествоРасходУУ КАК КоличествоУУ,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка КАК НомерБланка,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката КАК НомерПроката
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

//Начало изменений Иванова Анна 20181023   

Функция ТекстЗапросаТаблицаДвиженияЛико_ЗатратыПоЗаказуДляОтгрузки(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Лико_ЗатратыПоЗаказуДляОтгрузки";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаРасход", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРасход(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(&ПериодДляТиповыхДокументов) КАК Период,
	|	МАКСИМУМ(&ЗаказКлиента) КАК ЗаказКлиента,
	|	МАКСИМУМ(&РабочийЦентр) КАК РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Затрата,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|				ИЛИ Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ПорядковыйНомер = 142
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы)
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката КАК НомерПроката,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ПорядковыйНомер = 142
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|		ИНАЧЕ Лико_БланкЭтапаТовары.ВидРабот
	|	КОНЕЦ КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ПорядковыйНомер = 142
	|			ТОГДА 1
	|		ИНАЧЕ Лико_БланкЭтапаТовары.НомерРаботы
	|	КОНЕЦ КАК НомерРаботы,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасходУУ) КАК Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК КоличествоПМ,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал = ИСТИНА
	|	И ВЫБОР
	|			КОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ПорядковыйНомер <> 142
	|				ТОГДА НЕ Лико_БланкЭтапаТовары.Номенклатура.Наименование ПОДОБНО ""%Незавершенное%""
	|						И Лико_БланкЭтапаТовары.ВидРабот <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|			ИНАЧЕ Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя.ЗаказОсновногоМатериала = Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя
	|		КОНЕЦ
	|	И Лико_БланкЭтапаТовары.КоличествоРасходУУ > 0
	|	И (Лико_БланкЭтапаТовары.Ссылка.ОстаткиПоЗатратам
	|			ИЛИ Лико_БланкЭтапаТовары.Ссылка.Дата > &ДатаПроведенияПоЗатратам)
	|	И (Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя ЕСТЬ NULL
	|			ИЛИ Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя <> Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ПорядковыйНомер = 142
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|		ИНАЧЕ Лико_БланкЭтапаТовары.ВидРабот
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ПорядковыйНомер = 142
	|			ТОГДА 1
	|		ИНАЧЕ Лико_БланкЭтапаТовары.НомерРаботы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|				ИЛИ Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ПорядковыйНомер = 142
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодДляТиповыхДокументов,
	|	&ЗаказКлиента,
	|	&РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Клики),
	|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката,
	|	NULL,
	|	1,
	|	Лико_БланкЭтапаТовары.КоличествоРасходУУ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И Лико_БланкЭтапаТовары.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.CLICKS)
	|	И Лико_БланкЭтапаТовары.КоличествоРасходУУ > 0
	|	И (Лико_БланкЭтапаТовары.Ссылка.ОстаткиПоЗатратам
	|			ИЛИ Лико_БланкЭтапаТовары.Ссылка.Дата > &ДатаПроведенияПоЗатратам)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодДляТиповыхДокументов,
	|	&ЗаказКлиента,
	|	&РабочийЦентр,
	|	ТаблицаРасход.Номенклатура,
	|	ВЫБОР
	|		КОГДА НоменклатураДополнительныеРеквизиты.Значение = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОснастки.Вал)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КлишеГлубокие)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Штампы)
	|	КОНЕЦ,
	|	ТаблицаРасход.Ссылка.НомерПроката,
	|	ТаблицаРасход.ВидРабот,
	|	0,
	|	СУММА(ТаблицаРасход.Количество),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	NULL,
	|	NULL
	|ИЗ
	|	ВтТаблицаРасход КАК ТаблицаРасход
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ТаблицаРасход.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""ОснасткаВид"")
	|ГДЕ
	|	ТаблицаРасход.Ссылка = &Ссылка
	|	И ТаблицаРасход.Ссылка.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И ТаблицаРасход.ВидРабот <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|	И ТаблицаРасход.ДопРасход
	|	И ТаблицаРасход.МожноСписать
	|	И (ТаблицаРасход.Ссылка.ОстаткиПоЗатратам
	|			ИЛИ ТаблицаРасход.Ссылка.Дата > &ДатаПроведенияПоЗатратам)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасход.ВидРабот,
	|	ТаблицаРасход.Номенклатура,
	|	ТаблицаРасход.Ссылка.НомерПроката,
	|	ВЫБОР
	|		КОГДА НоменклатураДополнительныеРеквизиты.Значение = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОснастки.Вал)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.КлишеГлубокие)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Штампы)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодДляТиповыхДокументов,
	|	&ЗаказКлиента,
	|	&РабочийЦентр,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.Номенклатура,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.СтатьяЗатрат,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.Ссылка.НомерПроката,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.ВидРабот,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.НомерРаботы,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.Лико_БланкЭтапа.РаспределяемыеМатериалы КАК Лико_БланкЭтапаРаспределяемыеМатериалы
	|ГДЕ
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаРаспределяемыеМатериалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (Лико_БланкЭтапаРаспределяемыеМатериалы.Ссылка.ОстаткиПоЗатратам
	|			ИЛИ Лико_БланкЭтапаРаспределяемыеМатериалы.Ссылка.Дата > &ДатаПроведенияПоЗатратам)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.ВидРабот,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.Номенклатура,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.Ссылка.НомерПроката,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.НомерРаботы,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.СтатьяЗатрат,
	|	Лико_БланкЭтапаРаспределяемыеМатериалы.Количество";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;	
КонецФункции

//Конец изменений Иванова Анна 20181023  

//Начало изменений Иванова Анна 20191030
Функция ТекстЗапросаТаблицаДвиженияЛико_ПромежуточныйВыпуск(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Лико_ПромежуточныйВыпуск";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ПериодДляТиповыхДокументов КАК Период,
	|	МАКСИМУМ(&ЗаказКлиента) КАК ЗаказКлиента,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасходУУ) КАК МетражКВМ,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК МетражПМ
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал = ИСТИНА
	|	И Лико_БланкЭтапаТовары.КоличествоРасходУУ > 0
	|	И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя = Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодДляТиповыхДокументов,
	|	МАКСИМУМ(&ЗаказКлиента),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Лико_БланкЭтапаВыпуск.Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры,
	|	СУММА(Лико_БланкЭтапаВыпуск.КоличествоУУ),
	|	СУММА(Лико_БланкЭтапаВыпуск.Количество)
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И Лико_БланкЭтапаВыпуск.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал = ИСТИНА
	|	И Лико_БланкЭтапаВыпуск.КоличествоУУ > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаВыпуск.Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
//Конец изменений Иванова Анна 20191030


Функция ТекстЗапросаТаблицаДвиженияЛико_СписаниеНаЗаказ(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_СписаниеНаЗаказ";
	
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаРасход", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаРасход(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Лико_СписаниеНаЗаказОстатки.Номенклатура КАК Номенклатура,
	|	Лико_СписаниеНаЗаказОстатки.Характеристика КАК Характеристика,
	|	Лико_СписаниеНаЗаказОстатки.Серия КАК Серия,
	|	Лико_СписаниеНаЗаказОстатки.ВидРабот КАК ВидРабот,
	|	Лико_СписаниеНаЗаказОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Лико_СписаниеНаЗаказ.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК Лико_СписаниеНаЗаказОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_СписаниеНаЗаказОстатки.Номенклатура,
	|	Лико_СписаниеНаЗаказОстатки.ВидРабот,
	|	Лико_СписаниеНаЗаказОстатки.Серия,
	|	Лико_СписаниеНаЗаказОстатки.Характеристика,
	|	Лико_СписаниеНаЗаказОстатки.КоличествоОстаток";
	
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)	
	ИмяРегистра = "ВтТаблицаТовары"; 	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаВыпуск.Ссылка КАК Ссылка,
	|	Лико_БланкЭтапаВыпуск.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	Лико_БланкЭтапаВыпуск.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаВыпуск.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|			ТОГДА 0
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК СтатусУказанияСерий,
	|	Лико_БланкЭтапаВыпуск.КоличествоУУ КАК Количество,
	|	3 КАК Тип
	|ПОМЕСТИТЬ ВтТаблицаТовары
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Количество > 0
	|	И НЕ Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры.ПоАктуРазборки
	|	И НЕ &ПоАктуРазборки
	|	И ВЫБОР
	|			КОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЗаказов.Полуфабрикат)
	|				ТОГДА ВЫБОР
	|						КОГДА Лико_БланкЭтапаВыпуск.Ссылка.Распоряжение.НомерСледующегоЭтапа = 0
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_БланкЭтапаВыпуск.Номенклатура.ВидНоменклатуры <> &Незавершенка
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ
	|	И Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;	
КонецФункции

Функция ТекстЗапросаВтТаблицаРасход(Запрос, ТекстыЗапроса)
	ИмяРегистра = "ВтТаблицаРасход";
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтСписаниеОснастки", ТекстыЗапроса) Тогда
		ТекстЗапросаВтСписаниеОснастки(Запрос, ТекстыЗапроса);
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Ссылка КАК Ссылка,
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|			ТОГДА 0
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК СтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА Лико_БланкЭтапаТовары.КоличествоРасходУУ > ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)
	|			ТОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)
	|		ИНАЧЕ Лико_БланкЭтапаТовары.КоличествоРасходУУ
	|	КОНЕЦ КАК Количество,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК КоличествоБУ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДавальческоеСырье.ЭтоДавальческоеСырье, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) <= 0
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	КОНЕЦ КАК МожноСписать,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	ЛОЖЬ КАК ДопРасход,
	|	ЛОЖЬ КАК НеСписыватьОснастку
	|ПОМЕСТИТЬ ВтТаблицаРасход
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Склад = &Склад
	|					И (Номенклатура, Характеристика, Серия) В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|							Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|							Лико_БланкЭтапаТовары.Серия КАК Серия
	|						ИЗ
	|							Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|						ГДЕ
	|							Лико_БланкЭтапаТовары.Списать
	|							И Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|							И Лико_БланкЭтапаТовары.КоличествоУУ >= 0
	|							И Лико_БланкЭтапаТовары.Номенклатура <> &CLICKS_INDIGO)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_БланкЭтапаТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И Лико_БланкЭтапаТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И Лико_БланкЭтапаТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|			Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|			ИСТИНА КАК ЭтоДавальческоеСырье
	|		ИЗ
	|			Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеСырьяОтДавальца.Товары КАК ПоступлениеСырьяОтДавальцаТовары
	|				ПО Лико_БланкЭтапаТовары.Номенклатура = ПоступлениеСырьяОтДавальцаТовары.Номенклатура
	|					И Лико_БланкЭтапаТовары.Характеристика = ПоступлениеСырьяОтДавальцаТовары.Характеристика
	|					И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя = ПоступлениеСырьяОтДавальцаТовары.Ссылка.Лико_Документ.ЗаказКлиента
	|		ГДЕ
	|			Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|			И Лико_БланкЭтапаТовары.Списать) КАК ДавальческоеСырье
	|		ПО Лико_БланкЭтапаТовары.Номенклатура = ДавальческоеСырье.Номенклатура
	|			И Лико_БланкЭтапаТовары.Характеристика = ДавальческоеСырье.Характеристика
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.КоличествоРасходУУ > 0
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Номенклатура <> &CLICKS_INDIGO
	|	И НЕ &ПоАктуРазборки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Ссылка,
	|	Лико_СписаниеНаЗаказОстатки.Номенклатура,
	|	Лико_СписаниеНаЗаказОстатки.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	Лико_СписаниеНаЗаказОстатки.Серия,
	|	ВЫБОР
	|		КОГДА Лико_СписаниеНаЗаказОстатки.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|			ТОГДА 0
	|		ИНАЧЕ 8
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - Лико_СписаниеНаЗаказОстатки.КоличествоОстаток < 0
	|			ТОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)
	|		ИНАЧЕ Лико_СписаниеНаЗаказОстатки.КоличествоОстаток
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - Лико_СписаниеНаЗаказОстатки.КоличествоОстаток < 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) > 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Лико_СписаниеНаЗаказОстатки.ВидРабот,
	|	ИСТИНА,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.Лико_СписаниеНаЗаказ.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК Лико_СписаниеНаЗаказОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&КонецМесяца,
	|				Склад = &Склад
	|					И (Номенклатура, Характеристика, Серия) В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Лико_СписаниеНаЗаказОстатки.Номенклатура КАК Номенклатура,
	|							Лико_СписаниеНаЗаказОстатки.Характеристика КАК Характеристика,
	|							Лико_СписаниеНаЗаказОстатки.Серия КАК Серия
	|						ИЗ
	|							РегистрНакопления.Лико_СписаниеНаЗаказ.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК Лико_СписаниеНаЗаказОстатки)) КАК ТоварыНаСкладахОстатки
	|		ПО Лико_СписаниеНаЗаказОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И Лико_СписаниеНаЗаказОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И Лико_СписаниеНаЗаказОстатки.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(&Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)
	|	И ГОД(&Период) < 2020
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтСписаниеОснастки.Ссылка,
	|	ВтСписаниеОснастки.Номенклатура,
	|	ВтСписаниеОснастки.Характеристика,
	|	ВтСписаниеОснастки.Назначение,
	|	ВтСписаниеОснастки.Серия,
	|	ВтСписаниеОснастки.СтатусУказанияСерий,
	|	ВтСписаниеОснастки.Количество,
	|	ВтСписаниеОснастки.КоличествоБУ,
	|	ВтСписаниеОснастки.МожноСписать,
	|	ВтСписаниеОснастки.ВидРабот,
	|	ИСТИНА,
	|	&НеСписыватьОснастку
	|ИЗ
	|	ВтСписаниеОснастки КАК ВтСписаниеОснастки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(&Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)
	|	И ГОД(&Период) >= 2020";
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;



КонецФункции


Функция ТекстЗапросаВтСписаниеОснастки(Запрос, ТекстыЗапроса)
	ИмяРегистра = "ВтСписаниеОснастки";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Ссылка КАК Ссылка,
	|	втСписаниеОснастки.Номенклатура КАК Номенклатура,
	|	втСписаниеОснастки.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	втСписаниеОснастки.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА втСписаниеОснастки.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	|			ТОГДА 0
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК СтатусУказанияСерий,
	|	втСписаниеОснастки.Количество КАК Количество,
	|	втСписаниеОснастки.Количество КАК КоличествоБУ,
	|	ВЫБОР
	|		КОГДА втСписаниеОснастки.Количество > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МожноСписать,
	|	втСписаниеОснастки.ВидРабот КАК ВидРабот,
	|	ИСТИНА КАК ДопРасход
	|ПОМЕСТИТЬ ВтСписаниеОснастки
	|ИЗ
	|	&ТзСписаниеОснастки КАК втСписаниеОснастки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(&Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)";
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
	
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияЛико_РаскройМатериаловПланФакт(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_РаскройМатериаловПланФакт";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Лико_БланкЭтапаТовары.Ссылка.ЗаказНаРаскрой КАК Заказ,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК Количество
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказНаРаскрой <> ЗНАЧЕНИЕ(Документ.Лико_ЗаказНаРаскрой.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Ссылка.ЗаказНаРаскрой";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции



#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Задание складскому работнику
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявкаНаПеремещение";
	КомандаПечати.Представление = НСтр("ru = 'Заявка на перемещение'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.СразуНаПринтер = Истина;	
	
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗакрытиеБланкаЗаказа") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗакрытиеБланкаЗаказа",
		НСтр("ru = 'Закрытие бланка заказа'"),
		ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗакрытиеБланкаЗаказа";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапа.Ссылка КАК Ссылка,
	|	Лико_БланкЭтапа.Дата КАК Дата,
	|	Лико_БланкЭтапа.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(Лико_БланкЭтапа.Склад) КАК СкладПредставление
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|ГДЕ
	|	Лико_БланкЭтапа.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.НомерСтроки КАК НомерСтроки,
	|	0 КАК Метка,
	|	Лико_БланкЭтапаТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	Лико_БланкЭтапаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|	Лико_БланкЭтапаТовары.Серия.Наименование КАК СерияПредставление,
	|	Лико_БланкЭтапаТовары.Номенклатура.Код КАК Код,
	|	Лико_БланкЭтапаТовары.Номенклатура.Артикул КАК Артикул,
	|	Лико_БланкЭтапаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Метка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	//Нужно напечатать номер и дату накладной, но к накладным может не быть доступа
	УстановитьПривилегированныйРежим(Истина);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаПоДокументам      = Результаты[0].Выбрать();
	ВыборкаПоТабличнымЧастям = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс, Представление");
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Лико_передачаТоваров.ПФ_MXL_ЗаявкаНаПеремещение");
	
	ОбластьЗаголовок 		  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСкладИсполнитель   = Макет.ПолучитьОбласть("СкладИсполнитель");
	
	ОбластьШапкаТаблицыНачало 	= Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
	ОбластьСтрокаТаблицыНачало 	= Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
	ОбластьПодвалТаблицыНачало 	= Макет.ПолучитьОбласть("ПодвалТаблицы|НачалоСтроки");
	
	ОбластьШапкаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьСтрокаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
	ОбластьПодвалТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
	
	ОбластьШапкаТаблицыКолонкаКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов; 
	
	Если НЕ ВыводитьКоды Тогда
		ОбластьКолонкаТоваров = Макет.Область("КолонкаТоваров");
		
		ОбластьКолонкаТоваров.ШиринаКолонки = ОбластьКолонкаТоваров.ШиринаКолонки  + Макет.Область("КолонкаКодов").ШиринаКолонки;
	КонецЕсли;	
	
	ОбластьШапкаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаТоваров");
	ОбластьСтрокаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаТоваров");
	ОбластьПодвалТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаТоваров");
	
	ОбластьШапкаТаблицыКонец 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	ОбластьСтрокаТаблицыКонец 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КонецСтроки");
	ОбластьПодвалТаблицыКонец 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КонецСтроки");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если НЕ ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаПоСтрокамТЧ = ВыборкаПоТабличнымЧастям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ВыводитьОснование = Ложь;
		
		//Если ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор Тогда
		
		ТекстЗаголовка		 = НСтр("ru='Заявка на перемещение'");
		//ТекстЗоны			 = НСтр("ru='Зона отгрузки:'");
		//ЗонаПредставление	 = ВыборкаПоДокументам.ЗонаОтгрузкиПредставление;
		//РабочийУчасток		 = ВыборкаПоДокументам.РабочийУчастокПредставление;
		//ВыводитьРаспоряжение = Истина;
		//ВыводитьОснование    = ТипЗнч(ВыборкаПоДокументам.Распоряжение) = Тип("ДокументСсылка.РасходныйОрдерНаТовары");
		ВыводитьПодзаголовок = Ложь;
		
		//ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение Тогда
		//	
		//	ТекстЗаголовка = НСтр("ru='Задание на размещение товара'");
		//	ТекстЗоны = НСтр("ru='Зона приемки:'");
		//	ЗонаПредставление = ВыборкаПоДокументам.ЗонаПриемкиПредставление;
		//	РабочийУчасток		= ВыборкаПоДокументам.РабочийУчастокПредставление;
		//	ВыводитьРаспоряжение = Ложь;
		//	ВыводитьПодзаголовок = Ложь;
		//	
		//ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение Тогда
		//	
		//	ТекстЗаголовка = НСтр("ru='Задание на перемещение товара'");
		//	ТекстЗоны = "";
		//	ЗонаПредставление = "";
		//	РабочийУчасток	= "";
		//	ВыводитьРаспоряжение = Ложь;
		//	ВыводитьПодзаголовок = Истина;
		//				
		//КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаПоДокументам);
		
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, ТекстЗаголовка);
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ВыборкаПоДокументам.Ссылка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		//ОбластьСкладИсполнитель.Параметры.ИсполнительПредставление	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.Исполнитель, ВыборкаПоДокументам.Дата);
		//ОбластьСкладИсполнитель.Параметры.СкладПредставление		= СкладыСервер.ПолучитьПредставлениеСклада(ВыборкаПоДокументам.СкладПредставление,ВыборкаПоДокументам.ПомещениеПредставление);
		//ОбластьСкладИсполнитель.Параметры.ТекстЗоны 				= ТекстЗоны;
		//ОбластьСкладИсполнитель.Параметры.ЗонаПредставление 		= ЗонаПредставление;
		
		//Если ЗначениеЗаполнено(РабочийУчасток) Тогда
		//	ОбластьСкладИсполнитель.Параметры.ТекстРабочегоУчастка = НСтр("ru = 'Рабочий участок:'");
		//	ОбластьСкладИсполнитель.Параметры.РабочийУчастокПредставление = РабочийУчасток;			
		//Иначе
		//	ОбластьСкладИсполнитель.Параметры.ТекстРабочегоУчастка = "";
		//	ОбластьСкладИсполнитель.Параметры.РабочийУчастокПредставление = "";			
		//КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСкладИсполнитель);
		
		//Если ВыводитьОснование Тогда
		//	
		//	Счетчик = 0;
		//	ПредставлениеОснований = "";
		//	ПервоеРаспоряжение = Истина;
		//	РеквизитыДокумента = Новый Структура("Дата, Номер, Префикс, Представление");
		//	
		//	Пока ВыборкаПоРаспоряжениям.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка)) Цикл
		//		
		//		РеквизитыДокумента.Дата          = ВыборкаПоРаспоряжениям.ОснованиеДата;
		//		РеквизитыДокумента.Номер         = ВыборкаПоРаспоряжениям.ОснованиеНомер;
		//		РеквизитыДокумента.Префикс       = "";
		//		РеквизитыДокумента.Представление = ВыборкаПоРаспоряжениям.ОснованиеПредставление;
		//		
		//	ПредставлениеОснования = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
		//		
		//		Если Не ПервоеРаспоряжение Тогда
		//			ПредставлениеОснований = ПредставлениеОснований + ", ";		
		//		КонецЕсли;
		//		
		//		ПервоеРаспоряжение = Ложь;
		//		
		//		ПредставлениеОснований = ПредставлениеОснований + ПредставлениеОснования;
		//		
		//		Счетчик = Счетчик + 1;
		//		
		//	КонецЦикла;
		//	
		//	ОснованияЗаголовок = "";
		//	Если Счетчик > 1 Тогда 
		//		ОснованияЗаголовок = НСтр("ru = 'Основания:'");
		//	Иначе
		//		ОснованияЗаголовок = НСтр("ru = 'Основание:'");
		//	КонецЕсли;
		//	
		//	ОбластьОснование.Параметры.ОснованияПредставление = ПредставлениеОснований;
		//	ОбластьОснование.Параметры.ОснованияЗаголовок = ОснованияЗаголовок;
		//	
		//	ТабличныйДокумент.Вывести(ОбластьОснование);
		//	
		//КонецЕсли;
		//
		//Если ВыводитьРаспоряжение Тогда
		//	РеквизитыДокумента.Дата          = ВыборкаПоДокументам.РаспоряжениеДата;
		//	РеквизитыДокумента.Номер         = ВыборкаПоДокументам.РаспоряжениеНомер;
		//	РеквизитыДокумента.Префикс       = "";
		//	РеквизитыДокумента.Представление = ВыборкаПоДокументам.РаспоряжениеПредставление;
		//	
		//	ОбластьРаспоряжение.Параметры.РаспоряжениеПредставление	= ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
		//	ТабличныйДокумент.Вывести(ОбластьРаспоряжение);
		//КонецЕсли;
		//
		//Если ВыборкаПоДокументам.ОтгрузкаПоЗаданиюНаПеревозку Тогда
		//	РеквизитыДокумента.Дата          = ВыборкаПоДокументам.ЗаданиеНаПеревозкуДата;
		//	РеквизитыДокумента.Номер         = ВыборкаПоДокументам.ЗаданиеНаПеревозкуНомер;
		//	РеквизитыДокумента.Префикс       = "";
		//	РеквизитыДокумента.Представление = ВыборкаПоДокументам.ЗаданиеНаПеревозкуПредставление;
		//	                                    
		//	ОбластьЗаданиеНаПеревозку.Параметры.ЗаданиеНаПеревозкуПредставление	= ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
		//	ОбластьЗаданиеНаПеревозку.Параметры.ПорядокДоставки = ВыборкаПоДокументам.ПорядокДоставки;
		//	ТабличныйДокумент.Вывести(ОбластьЗаданиеНаПеревозку);
		//КонецЕсли;
		
		Метка = Неопределено;
		
		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
			
			Если Метка <> ВыборкаПоСтрокамТЧ.Метка Тогда
				Если ВыводитьПодзаголовок Тогда
					
					Если ВыборкаПоСтрокамТЧ.Метка = 0 Тогда
						ТекстПозаголовка = НСтр("ru='Товары к отбору'");
					Иначе
						ТекстПозаголовка = НСтр("ru='Товары к размещению'");
					КонецЕсли;
					
					Если Метка <> Неопределено Тогда
						ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
						Если ВыводитьКоды Тогда
							ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
						КонецЕсли;
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);
					КонецЕсли;
					
					//ОбластьПодзаголовок.Параметры.ТекстПозаголовка = ТекстПозаголовка;
					//ТабличныйДокумент.Вывести(ОбластьПодзаголовок);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыНачало);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаКодов);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаТоваров);
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКонец);
			КонецЕсли;
			
			ОбластьСтрокаТаблицыНачало.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыНачало);
			
			Если ВыводитьКоды Тогда
				ОбластьСтрокаТаблицыКолонкаКодов.Параметры.Артикул = ВыборкаПоСтрокамТЧ[КолонкаКодов];
				ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаКодов);
			КонецЕсли;
			
			ОбластьСтрокаТаблицыКолонкаТоваров.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоСтрокамТЧ.НоменклатураПредставление,
			ВыборкаПоСтрокамТЧ.ХарактеристикаПредставление,
			, // Упаковка
			ВыборкаПоСтрокамТЧ.СерияПредставление);
			
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаТоваров);
			
			ОбластьСтрокаТаблицыКонец.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКонец);	
			
			Метка = ВыборкаПоСтрокамТЧ.Метка;
			
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;	
КонецФункции


#КонецОбласти

#Область Прочее


Процедура ЗаполнениеЗакрытияБланкаВОбъектеНоменклатуры(ЗакрытиеБланка) Экспорт 
	//ЗакрытиеБланка=Документы.Лико_БланкЭтапа.СоздатьДокумент();
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Выпуск Из ЗакрытиеБланка.Выпуск Цикл
		ОбъектНоменклатуры= Выпуск.Серия.ЯССМ_ОбъектНоменклатуры;
		Если ЗакрытиеБланка.Проведен и ОбъектНоменклатуры.ЗакрытиеБланка<>ЗакрытиеБланка Тогда
			ОбъектНоменклатурыОбъект=ОбъектНоменклатуры.ПолучитьОбъект();
			ОбъектНоменклатурыОбъект.ЗакрытиеБланка=ЗакрытиеБланка;
			ОбъектНоменклатурыОбъект.НомерЗаказаКлиента=ЗакрытиеБланка.ЗаказПокупателя.НомерБезПрефикса;
			ОбъектНоменклатурыОбъект.НомерБланка=ЗакрытиеБланка.НомерБланка;
			ОбъектНоменклатурыОбъект.Ответственный=ЗакрытиеБланка.Сотрудник.ФизическоеЛицо;


			Если ЗначениеЗаполнено(ЗакрытиеБланка.ЗаказНаРаскрой) И Не ЗначениеЗаполнено(ЗакрытиеБланка.ЗаказПокупателя) Тогда
				ОбъектНоменклатурыОбъект.НомерЗаказаКлиента=Число(Прав(ЗакрытиеБланка.ЗаказНаРаскрой.Номер,6));
				Если ЗначениеЗаполнено(ЗакрытиеБланка.ЗаказНаРаскрой.ЗаказКлиента) Тогда
					ОбъектНоменклатурыОбъект.НомерЗаказаКлиента=ЗакрытиеБланка.ЗаказНаРаскрой.ЗаказКиента.НомерБезПрефикса;	
				КонецЕсли;
				
			КонецЕсли;


			ОбъектНоменклатурыОбъект.Записать();

		КонецЕсли;



	КонецЦикла;


КонецПроцедуры


Функция СоздатьОбъектыНоменклатуры(ЗаказКлиента,НомерБланка,Нарезка,Втулка,АвторДокумента,КоличествоРоликов=1,СерийныйНомер="", ПараметрыДляРоликовПослеПеремотки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НомерЗаказа=ЗаказКлиента.НомерБезПрефикса;
	//ЗаказКлиента=Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказа,"ЗаказКлиента");
	МенеджерЗаказа=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ЗаказКлиента,"Менеджер");
	МассивСозданныхОбъектов = Новый Массив; 		
	// Ищем номенклатуру
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияСвойствОбъектов.Объект КАК Характеристика
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствЗаказ.Объект КАК ХарактеристкиСЗаказом
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствЗаказ
	|		ГДЕ
	|			ЗначенияСвойствЗаказ.Свойство В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
	|					ИЗ
	|						ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
	|					ГДЕ
	|						СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоЗаказ)
	|			И ЗначенияСвойствЗаказ.Значение = &NЗаказ) КАК ВложенныйЗапрос
	|		ПО ЗначенияСвойствОбъектов.Объект = ВложенныйЗапрос.ХарактеристкиСЗаказом
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
	|			ИЗ
	|				ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
	|			ГДЕ
	|				СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоХарактеристика)
	|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА
	|	И ЗначенияСвойствОбъектов.Объект.Владелец.ВидНоменклатуры = &Полуфабрикат
	|	И ЗначенияСвойствОбъектов.Объект.Владелец.Наименование ПОДОБНО &Название";
	
	Запрос.Текст ="ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ
	|	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Заказ",ЗаказКлиента);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НоменклатураНезавершенка = Неопределено;
	ХарактеристикаНезавершенка = Неопределено;
	
	//=--------- создаем незавершенку -----
	РодительНезавершенкаНоменклатура = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
	РодительНезавершенка = Справочники.Лико_ПредопределенныеЗначения.ГруппаОбъектовНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		
		ХарактеристикаНезавершенка = ВыборкаЗапроса.Характеристика;
		НоменклатураНезавершенка = ХарактеристикаНезавершенка.Владелец;
	Иначе 	//запрос пуст!
		
		Если ЗначениеЗаполнено(МенеджерЗаказа) Тогда
			ФИО = МенеджерЗаказа.Наименование;
			Фамилия		= ВыделитьСлово(ФИО);
			Имя			= ВыделитьСлово(ФИО);
			Отчество	= ВыделитьСлово(ФИО);
			ФИОСтрока = Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
		Иначе
			ФИОСтрока = "";
		КонецЕсли;
		//---------=
		
		Номенклатура1С = Справочники.Номенклатура.СоздатьЭлемент();
		Номенклатура1С.УстановитьНовыйКод("n");
		Номенклатура1С.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура1С);
		
		Номенклатура1С.Наименование = "Незавершенное производство по заказу №" + Формат(НомерЗаказа, "ЧГ=0") + " (" + ФИОСтрока + ")";
		Номенклатура1С.НаименованиеПолное = Номенклатура1С.Наименование;
		
		Если Не РодительНезавершенкаНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Номенклатура1С.Родитель = РодительНезавершенкаНоменклатура;			
			
		Иначе
			
		КонецЕсли;
		Номенклатура1С.Записать();
		
		НоменклатураНезавершенка = Номенклатура1С.Ссылка;
		
		ХарактеристикаНезавершенкаОбъект=Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		ХарактеристикаНезавершенкаОбъект.Владелец=НоменклатураНезавершенка;
		ХарактеристикаНезавершенкаОбъект.Лико_ЗаказНоменклатуры=ЗаказКлиента;
		ХарактеристикаНезавершенкаОбъект.Записать();
		ХарактеристикаНезавершенка=ХарактеристикаНезавершенкаОбъект.Ссылка;
	КонецЕсли;
	
	Если НоменклатураНезавершенка<>Неопределено И ХарактеристикаНезавершенка<>Неопределено Тогда
		//=--------- Создание объектов номенклатуры -----
		Для Счетчик=1 По КоличествоРоликов Цикл
			
			
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Номенклатура"			,НоменклатураНезавершенка);
			СтруктураПараметров.Вставить("Родитель"				,РодительНезавершенка);
			СтруктураПараметров.Вставить("Характеристика"		,ХарактеристикаНезавершенка);
			СтруктураПараметров.Вставить("Нарезка"				,Нарезка);
			СтруктураПараметров.Вставить("Втулка"				,Втулка);
			СтруктураПараметров.Вставить("Количество"			,0);
			СтруктураПараметров.Вставить("Упаковка"				,?(ЗначениеЗаполнено(Нарезка), Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка), Неопределено)); // --> Начало Лико Ефимов ЕВВ 25.08.2025 дописал условие по заполненности нарезки
			СтруктураПараметров.Вставить("Уникальный"			,Истина);
			СтруктураПараметров.Вставить("НомерЗаказаКлиента"	,НомерЗаказа);
			СтруктураПараметров.Вставить("НомерБланка"			,НомерБланка);
			СтруктураПараметров.Вставить("СерийныйНомер"		,СерийныйНомер);
			СтруктураПараметров.Вставить("Комментарий"			,"");
			СтруктураПараметров.Вставить("Ответственный"			,АвторДокумента);
			СтруктураПараметров.Вставить("Рулонный"				,Истина);
			// --> Начало Лико Ефимов ЕВВ 15.12.2021
			СтруктураПараметров.Вставить("ЗаказКлиента"			,ЗаказКлиента);
			// <-- Конец Лико Ефимов ЕВВ 15.12.2021
			// --> Начало Лико Ефимов ЕВВ 25.07.2025
			Если ПараметрыДляРоликовПослеПеремотки <> Неопределено Тогда
				СтруктураПараметров.Вставить("КоличествоВРоликеПослеПеремотки", ПараметрыДляРоликовПослеПеремотки.КоличествоВРоликеПослеПеремотки);
				СтруктураПараметров.Вставить("СтатусРоликаПослеПеремотки", ПараметрыДляРоликовПослеПеремотки.СтатусРоликаПослеПеремотки);
				СтруктураПараметров.Вставить("СоставРоликаПослеПеремотки", ПараметрыДляРоликовПослеПеремотки.СоставРоликаПослеПеремотки); 
				СтруктураПараметров.Вставить("НомерСтрокиЗаказаВРоликеПослеПеремотки", ПараметрыДляРоликовПослеПеремотки.НомерСтрокиЗаказаВРоликеПослеПеремотки); 
				СтруктураПараметров.Вставить("РабочийЦентрВыпускаВРоликеПослеПеремотки", ПараметрыДляРоликовПослеПеремотки.РабочийЦентрВыпускаВРоликеПослеПеремотки); 
				СтруктураПараметров.Вставить("СтруктураРастарки", ПараметрыДляРоликовПослеПеремотки.СтруктураРастарки); 
			КонецЕсли;
			// <-- Конец Лико Ефимов ЕВВ 25.07.2025
			НовыйЭлемент=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров);	
			
			МассивСозданныхОбъектов.Добавить(НовыйЭлемент.Ссылка);
		КонецЦикла;
		
	Иначе
		Сообщить("Не удалось создать незавершенку!");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	КоличествоРоликов = 1;
	
	Возврат МассивСозданныхОбъектов;
	
КонецФункции //СоздатьОбъектыНоменклатуры 

/// Функция выделяет первое слово в предложении
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция СоздатьПолучитьРаспоряжениеНаКраску(ДокументСсылка);
	Если ДокументСсылка.ВидОперации<>Перечисления.Лико_ВидыОперацийЗакрытияБланка.ЗакрытиеБланка Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЗаказМатериаловВПроизводство=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказМатериаловВПроизводство.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказМатериаловВПроизводство КАК ЗаказМатериаловВПроизводство
	|ГДЕ
	|	ЗаказМатериаловВПроизводство.Лико_Документ = &Лико_Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказМатериаловВПроизводство.Дата";
	Запрос.УстановитьПараметр("Лико_Документ",ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказМатериаловВПроизводство=Выборка.Ссылка;
	КонецЦикла;
	Колористическая=УправлениеСвойствами.ЗначениеСвойства(ДокументСсылка.Организация,"Лико_Колористическая");
	Если ЗаказМатериаловВПроизводство=Неопределено И 
		ЗначениеЗаполнено(Колористическая) Тогда
		НовоеРаспоряжение							=	Документы.ЗаказМатериаловВПроизводство.СоздатьДокумент();	
		НовоеРаспоряжение.Дата						=	ДокументСсылка.Дата;
		НовоеРаспоряжение.Организация				=	ДокументСсылка.Организация;
		НовоеРаспоряжение.Подразделение				=	ДокументСсылка.Подразделение;
		НовоеРаспоряжение.ЦеховаяКладовая			=	Колористическая;
		НовоеРаспоряжение.Склад						=	ДокументСсылка.Склад;
		НовоеРаспоряжение.ДатаОтгрузки				=	ДокументСсылка.Дата;
		НовоеРаспоряжение.УправлениеПроизводством2_2=	Истина;
		НовоеРаспоряжение.Статус					=	Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению;
		НовоеРаспоряжение.ХозяйственнаяОперация		=	Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую; 	
		НовоеРаспоряжение.Комментарий				=	"Создан в проведении документа: "+ Выборка.Ссылка; 
		НовоеРаспоряжение.Лико_Документ				=	ДокументСсылка;
		НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Запись);
		ЗаказМатериаловВПроизводство=НовоеРаспоряжение.Ссылка; 	
	КонецЕсли; 	
	Возврат ЗаказМатериаловВПроизводство;	
КонецФункции //-Лико m.shenderov 30.05.2019 


Функция СформироватьТзСписаниеОснастки(ЗакрытеБланкаСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Лико_Документ = &Лико_Документ";
	Запрос.УстановитьПараметр("Лико_Документ",ЗакрытеБланкаСсылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса .Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.ТоварыНаСкладах.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);		
		НаборЗаписей.Записать();

	КонецЦикла; 


	ТЗ = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Тз.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Тз.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	Тз.Колонки.Добавить("ВидРабот",Новый ОписаниеТипов("СправочникСсылка.ВидыРаботСотрудников"));

	Тз.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	Если ЗакрытеБланкаСсылка.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
		Возврат ТЗ;
	КонецЕсли;
	Запрос = Новый Запрос;

	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаЦвета.Оснастка КАК Номенклатура,
	|	1 КАК Количество,
	|	ЗаказКлиентаЦвета.ВидСекции.ВидРабот КАК ВидРабот
	|ПОМЕСТИТЬ Оснастка
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ЗаказКлиентаЦвета.Ссылка = &Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаЦвета.Вал,
	|	1,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Ссылка = &Заказ
	|	И ЗаказКлиентаЦвета.Вал <> ЗНАЧЕНИЕ(справочник.Номенклатура.Пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Осн.Номенклатура КАК Номенклатура,
	|	Осн.Количество КАК Количество,
	|	Лико_ЗакрытиеБланка.Регистратор КАК Регистратор,
	|	Осн.ВидРабот КАК ВидРабот
	|ПОМЕСТИТЬ Оснастка2
	|ИЗ
	|	Оснастка КАК Осн
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗакрытиеБланка КАК Лико_ЗакрытиеБланка
	|		ПО Осн.Номенклатура = Лико_ЗакрытиеБланка.Номенклатура
	|			И (Лико_ЗакрытиеБланка.Регистратор <> &Регистратор)
	|			И (Лико_ЗакрытиеБланка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОперацииЗакрытияБланка.Расход))
	|			И (ВЫБОР
	|				КОГДА Лико_ЗакрытиеБланка.Регистратор ССЫЛКА Документ.Лико_БланкЭтапа
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ЗакрытиеБланка.Регистратор.Лико_Документ <> &Регистратор
	|			КОНЕЦ)
	|			И (Лико_ЗакрытиеБланка.Период МЕЖДУ &Дата1 И &Дата2)
	|ГДЕ
	|	Лико_ЗакрытиеБланка.Регистратор ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Ном.Ссылка) КАК Номенклатура,
	|	Оснастка2.Количество КАК Количество,
	|	Оснастка2.ВидРабот КАК ВидРабот
	|ПОМЕСТИТЬ КонтрМатрица
	|ИЗ
	|	Оснастка2 КАК Оснастка2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО Оснастка2.Номенклатура.Артикул = Ном.Артикул
	|			И Оснастка2.Номенклатура.Ссылка <> Ном.Ссылка
	|ГДЕ
	|	Ном.Наименование ПОДОБНО ""%контрматрица%""
	|
	|СГРУППИРОВАТЬ ПО
	|	Оснастка2.Количество,
	|	Оснастка2.ВидРабот
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(Ном.Ссылка),
	|	Оснастка2.Количество,
	|	Оснастка2.ВидРабот
	|ИЗ
	|	Оснастка2 КАК Оснастка2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО Оснастка2.Номенклатура.Артикул = Ном.Артикул
	|			И Оснастка2.Номенклатура.Ссылка <> Ном.Ссылка
	|ГДЕ
	|	Ном.Наименование ПОДОБНО ""%кондуктор%""
	|
	|СГРУППИРОВАТЬ ПО
	|	Оснастка2.Количество,
	|	Оснастка2.ВидРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Оснастка2.Номенклатура КАК Номенклатура,
	|	Оснастка2.Количество КАК Остаток,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
	|	Оснастка2.ВидРабот КАК ВидРабот
	|ИЗ
	|	Оснастка2 КАК Оснастка2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Период,
	|				Номенклатура В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Оснастка.Номенклатура КАК Номенклатура
	|						ИЗ
	|							Оснастка КАК Оснастка)
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО Оснастка2.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрМатрица.Номенклатура,
	|	КонтрМатрица.Количество,
	|	ТоварыНаСкладахОстатки.Серия,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток,
	|	КонтрМатрица.ВидРабот
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Период,
	|			Номенклатура В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Оснастка.Номенклатура КАК Номенклатура
	|					ИЗ
	|						КонтрМатрица КАК Оснастка)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрМатрица КАК КонтрМатрица
	|		ПО (КонтрМатрица.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Оснастка2.Номенклатура,
	|	Оснастка2.Количество,
	|	ТоварыНаСкладах.Серия,
	|	ТоварыНаСкладах.ВНаличии,
	|	Оснастка2.ВидРабот
	|ИЗ
	|	Оснастка2 КАК Оснастка2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|		ПО Оснастка2.Номенклатура = ТоварыНаСкладах.Номенклатура
	|			И (ТоварыНаСкладах.Регистратор = &регистратор)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрМатрица.Номенклатура,
	|	КонтрМатрица.Количество,
	|	ТоварыНаСкладах.Серия,
	|	ТоварыНаСкладах.ВНаличии,
	|	КонтрМатрица.ВидРабот
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрМатрица КАК КонтрМатрица
	|		ПО (КонтрМатрица.Номенклатура = ТоварыНаСкладах.Номенклатура)
	|			И (ТоварыНаСкладах.Регистратор = &регистратор)
	|ИТОГИ
	|	МАКСИМУМ(Остаток),
	|	СУММА(Количество)
	|ПО
	|	Номенклатура";

	Запрос.УстановитьПараметр("Период",КонецМесяца(ЗакрытеБланкаСсылка.Дата));
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(ЗакрытеБланкаСсылка.Дата));
	Запрос.УстановитьПараметр("Дата2",ЗакрытеБланкаСсылка.Дата);

	Запрос.УстановитьПараметр("Регистратор",ЗакрытеБланкаСсылка);
	Запрос.УстановитьПараметр("Заказ",ЗакрытеБланкаСсылка.ЗаказПокупателя);
	//СкладОснастки= УправлениеСвойствами.ЗначениеСвойства(ЗакрытеБланкаСсылка.Организация,"Лико_СкладОснастки");
	СкладОснастки= ЗакрытеБланкаСсылка.Склад.Лико_Площадка.СкладОснастки;
	Запрос.УстановитьПараметр("Склад",СкладОснастки);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество<=0 Тогда
			Продолжить;
		КонецЕсли;

		////Осталось=Выборка.Остаток;
		Осталось=Выборка.Количество;

		ДеталиВыборки = Выборка.Выбрать();
		Пока ДеталиВыборки.Следующий() Цикл
			//Списать=Мин(Осталось,ДеталиВыборки.Количество);

			Списать                         =ДеталиВыборки.Количество;


			НоваяСтрокаТз					=Тз.Добавить();
			НоваяСтрокаТз.Номенклатура		=ДеталиВыборки.Номенклатура;
			//НоваяСтрокаТз.Характеристика	=ДеталиВыборки.Характеристика;
			НоваяСтрокаТз.Серия				=ДеталиВыборки.Серия;
			НоваяСтрокаТз.Количество		=ДеталиВыборки.Количество;
			НоваяСтрокаТз.ВидРабот			=ДеталиВыборки.ВидРабот;

			Осталось=Осталось-Списать;
			Если Осталось=0 Тогда
				Прервать;
			КонецЕсли;


		КонецЦикла; 

	КонецЦикла; 

	Возврат ТЗ;	



КонецФункции

	
Функция ПолучитьНоменклатуруНезавершеннойПродукцииПоЗаказу(ЗаказКлиента) Экспорт 

	НомерЗаказа=ЗаказКлиента.НомерБезПрефикса;
	//ЗаказКлиента=Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказа,"ЗаказКлиента");
	МенеджерЗаказа=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ЗаказКлиента,"Менеджер");


	Запрос = Новый Запрос;

	Запрос.Текст ="ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ
	|	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры = &ВидНоменклатуры";

	Запрос.УстановитьПараметр("Заказ",ЗаказКлиента);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);

	РезультатЗапроса = Запрос.Выполнить();

	НоменклатураНезавершенка = Неопределено;
	ХарактеристикаНезавершенка = Неопределено;

	//=--------- создаем незавершенку -----
	РодительНезавершенкаНоменклатура = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
	РодительНезавершенка = Справочники.Лико_ПредопределенныеЗначения.ГруппаОбъектовНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;

	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();

		ХарактеристикаНезавершенка = ВыборкаЗапроса.Характеристика;
		НоменклатураНезавершенка = ХарактеристикаНезавершенка.Владелец;
		Возврат НоменклатураНезавершенка 
	Иначе 	//запрос пуст!

		Если ЗначениеЗаполнено(МенеджерЗаказа) Тогда
			ФИО = МенеджерЗаказа.Наименование;
			Фамилия		= ВыделитьСлово(ФИО);
			Имя			= ВыделитьСлово(ФИО);
			Отчество	= ВыделитьСлово(ФИО);
			ФИОСтрока = Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
		Иначе
			ФИОСтрока = "";
		КонецЕсли;
		//---------=

		Номенклатура1С = Справочники.Номенклатура.СоздатьЭлемент();
		Номенклатура1С.УстановитьНовыйКод("n");
		Номенклатура1С.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура1С);

		Номенклатура1С.Наименование = "Незавершенное производство по заказу №" + Формат(НомерЗаказа, "ЧГ=0") + " (" + ФИОСтрока + ")";
		
		НоменклатураПоНаименованию= Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура1С.Наименование,Истина);
		
		Если ЗначениеЗаполнено(НоменклатураПоНаименованию) Тогда
			 Возврат НоменклатураПоНаименованию;
		КонецЕсли;
		
		
		Номенклатура1С.НаименованиеПолное = Номенклатура1С.Наименование;

		Если Не РодительНезавершенкаНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Номенклатура1С.Родитель = РодительНезавершенкаНоменклатура;			

		Иначе

		КонецЕсли;
		Номенклатура1С.Записать();  

		Возврат Номенклатура1С;
	КонецЕсли;	


КонецФункции
	
 
Процедура ОтразитьТолькоТоварыВЯчейках(ДокОбъект) Экспорт // --> Начало Лико Ефимов ЕВВ 20.05.2022

	Для Каждого НаборЗаписей Из ДокОбъект.Движения Цикл
		НаборЗаписей.Записывать = Истина;
	КонецЦикла;

	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокОбъект.Ссылка);
	ТекстыЗапроса = Новый СписокЗначений;
	Запрос.Текст = ТекстЗапросаТаблицаТоварыВЯчейках(Новый Запрос, ТекстыЗапроса, "ТоварыВЯчейках",ДокОбъект.Ссылка);
	ТаблицаТоварыВЯчейках = Запрос.Выполнить().Выгрузить();
	Если ТаблицаТоварыВЯчейках.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДокОбъект.Движения.ТоварыВЯчейках.Загрузить(ТаблицаТоварыВЯчейках);

КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 20.05.2022


 Функция УчетПоВидуСекцииУстановлен(Дата) Экспорт  //+Лико m.shenderov 11.10.2023
	
	 
	 ДатаПереходаНаВидыСекций=Справочники.Лико_ПредопределенныеЗначения.ДатаПереходаНаВидыСекций.ЗначениеПараметра;
	
	Если ЗначениеЗаполнено(ДатаПереходаНаВидыСекций) И  ТипЗнч(ДатаПереходаНаВидыСекций)=Тип("Дата") И
		ДатаПереходаНаВидыСекций<Дата Тогда 
		Возврат Истина;
	КонецЕсли;

	   Возврат Ложь;
КонецФункции  //-Лико m.shenderov 11.10.2023


Функция СоздатьСерии(ЗакрытиеБланка, СтрокаЗаказа) Экспорт 
	
	СтруктураДанных = СтруктуруДанныхДляКоробки(ЗакрытиеБланка, СтрокаЗаказа); 
	ТаблицаТовары =СтруктураДанных.Товары;
	//если это печать комплекта, тогда в таблице будет несколько записей 
	ТаблицаТовары.Свернуть("Номенклатура,Характеристика", "КоличествоРоликов,КоличествоВУпаковке");
	РоликиСтрокой = СформироватьСтрокуРоликов(СтруктураДанных.Товары);
	
	ТаблицаСерий = Новый ТаблицаЗначений;
	ТаблицаСерий.Колонки.Добавить("ИнформацияОСерии");
	
	Для сч = 1 по СтруктураДанных.КоличествоНаПечать Цикл
		Серия = СоздатьСериюИлиСерииКомплекта(ТаблицаТовары, РоликиСтрокой, СтруктураДанных);
		Если Серия = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		СтрокаСерий = ТаблицаСерий.Добавить();
		СтрокаСерий.ИнформацияОСерии = Серия;
	КонецЦикла;
	
	Возврат ТаблицаСерий;
	
КонецФункции

Функция СтруктуруДанныхДляКоробки(ЗакрытиеБланка,СтрокаЗаказа)  
	
		
	ТЗПеремотанныеРолики = ЗакрытиеБланка.Товары.Выгрузить();
	ТЗПеремотанныеРолики.Колонки.Добавить("КоличествоРоликов");
	МассивРоликовВКоробке = Новый Массив;
	Для каждого Строка из ТЗПеремотанныеРолики Цикл
		Строка.КоличествоРоликов = 1;
		Если Строка.Отметка Тогда
			Ролик = Строка.Серия.ЯССМ_ОбъектНоменклатуры;
			РоликПослеПеремоткиОбъект = Ролик.ПолучитьОбъект();
			РоликПослеПеремоткиОбъект.СтатусРоликаПослеПеремотки = 2;
			РоликПослеПеремоткиОбъект.Записать();
			МассивРоликовВКоробке.Добавить(Строка.Ролик);
		КонецЕсли;
	КонецЦикла;
	ТЗПеремотанныеРолики.Свернуть("Отметка,КоличествоШт", "КоличествоРоликов");
	Товары =Новый ТаблицаЗначений;
	Для каждого Строка из ТЗПеремотанныеРолики Цикл 
		Если НЕ Строка.Отметка Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаЗаказа.Характеристика;
		НоваяСтрока.КоличествоРоликов = Строка.КоличествоРоликов;
		НоваяСтрока.КоличествоВРолике = Строка.КоличествоШт;
		НоваяСтрока.КоличествоВУпаковке = НоваяСтрока.КоличествоРоликов * НоваяСтрока.КоличествоВРолике;
	КонецЦикла;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Заказ", ЗакрытиеБланка.ЗаказПокупателя);
	СтруктураДанных.Вставить("НомерЗаказа", ЗакрытиеБланка.ЗаказКлиента.НомерБезПрефикса);
	СтруктураДанных.Вставить("Товары", Товары);
	СтруктураДанных.Вставить("КоличествоНаПечать", 1);
	СтруктураДанных.Вставить("Город", СтрокаЗаказа.Город);
	СтруктураДанных.Вставить("Втулка", СтрокаЗаказа.ВнутреннийДиаметр);
	СтруктураДанных.Вставить("Намотка", СтрокаЗаказа.Направление);
	СтруктураДанных.Вставить("NКонтракта", СтрокаЗаказа.NКонтракта);
	СтруктураДанных.Вставить("ВремяПечати", ТекущаяДата());
	СтруктураДанных.Вставить("КодЭтикеткиЗаказчика", СтрокаЗаказа.КодЭтикеткиЗаказчика);
	Этикетка = Лико_Дополнительно.ПолучитьНаименованиеКомплекта(СтруктураДанных, Ложь);
	СтруктураДанных.Вставить("Этикетка", Этикетка);
	ВесКоробки = Лико_Дополнительно.РассчитатьВесКоробки(СтрокаЗаказа.Номенклатура, Товары.Итог("КоличествоВУпаковке"),, ЗакрытиеБланка.ЗаказПокупателя);
	СтруктураДанных.Вставить("ВесКоробки", ВесКоробки);
	СтруктураДанных.Вставить("ВесНетто", 0);
	СтруктураДанных.Вставить("ДлинаРоликов", 0);
	СтруктураДанных.Вставить("ВнутренняяНамотка", Ложь);
	СтруктураДанных.Вставить("НовыеЭтикетки", Истина);
	СтруктураДанных.Вставить("НеОтображатьМатериал", Ложь);
	СтруктураДанных.Вставить("НеОтображатьПолучателя", Ложь);
	СтруктураДанных.Вставить("НеОтображатьТУ", Ложь);
	СтруктураДанных.Вставить("Оператор", ЗакрытиеБланка.Сотрудник);
	СтруктураДанных.Вставить("РабочееМесто", ПараметрыСеанса.Лико_РабочееМесто);
	СтруктураДанных.Вставить("НастройкаПечати", Ложь);
	СтруктураДанных.Вставить("ЧестныйЗнак", СтрокаЗаказа.КодЭтикеткиЗаказчика);
	СтруктураДанных.Вставить("СтруктураРастарки", Неопределено);
	СтруктураДанных.Вставить("МассивРоликовВКоробке", МассивРоликовВКоробке);
	
	Возврат СтруктураДанных;

КонецФункции

Функция СформироватьСтрокуРоликов(Таблица)
	
	СтрокаРоликов = "";
	Для сч = 1 по Таблица.Количество() Цикл
		Если сч > 3 Тогда
			Прервать;
		КонецЕсли;
		ТекущаяСтрока = Таблица[Сч-1];
		СтрокаРоликов = ?(ЗначениеЗаполнено(СтрокаРоликов), СтрокаРоликов + "; ", "")
						+ ?(ТекущаяСтрока.КоличествоРоликов = 0, "", ТекущаяСтрока.КоличествоРоликов)
						+ " * "
						+ ?(ТекущаяСтрока.КоличествоВРолике = 0, "", ТекущаяСтрока.КоличествоВРолике * 1000);
	КонецЦикла;
	
	Возврат СтрокаРоликов;
					
КонецФункции

Функция СоздатьСериюИлиСерииКомплекта(ТаблицаТовары, РоликиСтрокой, СтруктураДанных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТаблицаТовары.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НомерКоробки = Лико_Дополнительно.ПолучитьНомерКоробкиДляНовойСерии(ТаблицаТовары.ВыгрузитьКолонку("Характеристика"));
	
	СтруктураДанныхДляПечати = Новый Структура;
	КоличествоЭтикетокВКоробке = ТаблицаТовары.Количество();
	ЭтоКомплект = КоличествоЭтикетокВКоробке > 1;
	КоличествоКоробокОсталось = 1;
	сч = 0;
	СозданныеСерии = Новый Массив;
	СерияВладелецКомплекта = Неопределено;
	СоответствиеНоменклатурыИКодовЭтикетокЗаказчика = Новый Соответствие;
	Для каждого СтрокаТЧ из ТаблицаТовары Цикл
		сч = сч + 1;
		//Создаем новую серию
		НовыйОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		НовыйОбъект.ВидНоменклатуры = СтрокаТЧ.Номенклатура.ВидНоменклатуры;
		//НовыйОбъект.Номер = Формат(Число(Справочники.СерииНоменклатуры.ВычислитьМаксимальныйНомерСерии(СтрокаТЧ.Номенклатура.ВидНоменклатуры) + 1), "ЧЦ=8; ЧВН=; ЧГ=");
		НовыйОбъект.Номер = СтрокаТЧ.Характеристика; // пусть будет наименование характеристики
		НовыйОбъект.Лико_ХарактеристикаВладелец = СтрокаТЧ.Характеристика;
		НовыйОбъект.Лико_НомерКоробки = НомерКоробки;
		НовыйОбъект.Лико_Город = СтруктураДанных.Город;
		НовыйОбъект.Лико_КоличествоВУпаковке = ?(СтрокаТЧ.КоличествоВУпаковке = 0, 1, СтрокаТЧ.КоличествоВУпаковке);
		НовыйОбъект.Лико_Втулка = СтруктураДанных.Втулка;
		НовыйОбъект.Лико_НаправлениеНамотки = СтруктураДанных.Намотка;
		НовыйОбъект.Лико_ДатаУпаковки = СтруктураДанных.ВремяПечати;
		Если ЗначениеЗаполнено(СтруктураДанных.ВесКоробки) Тогда
			НовыйОбъект.Лико_ВесКоробки = СтруктураДанных.ВесКоробки / ТаблицаТовары.Количество();
		Иначе
			НовыйОбъект.Лико_ВесКоробки = Лико_Дополнительно.РассчитатьВесКоробки(СтрокаТЧ.Характеристика.Владелец, СтрокаТЧ.КоличествоВУпаковке, ТаблицаТовары.Количество(), СтрокаТЧ.Характеристика.Лико_ЗаказНоменклатуры);
		КонецЕсли;
		НовыйОбъект.Лико_ВесНетто = СтруктураДанных.ВесНетто;
		НовыйОбъект.Лико_ДлинаРоликов = СтруктураДанных.ДлинаРоликов;
		НовыйОбъект.Лико_Упаковщик = СтруктураДанных.Оператор;
		НовыйОбъект.Лико_НомерПоставки = СтруктураДанных.NКонтракта;
		НовыйОбъект.Лико_КоличествоРоликов = СтрокаТЧ.КоличествоРоликов;
		НовыйОбъект.Лико_РоликиСтрокой = РоликиСтрокой;
		НовыйОбъект.Лико_КодЭтикеткиЗаказчика = СтруктураДанных.КодЭтикеткиЗаказчика;
		НовыйОбъект.Лико_ЧестныйЗнак = СтруктураДанных.ЧестныйЗнак;
		// --> Начало Лико Ефимов ЕВВ 11.08.2020
		Если ЗначениеЗаполнено(СтруктураДанных.СтруктураРастарки) Тогда
			НовыйОбъект.Лико_РаспоряжениеНаРастарку = СтруктураДанных.СтруктураРастарки.Документ;
			НовыйОбъект.Лико_НомерЦепочкиВРаспоряженииНаРастарку = Число(СтруктураДанных.СтруктураРастарки.НомерЦепочки);
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 11.08.2020
		Если сч = КоличествоЭтикетокВКоробке Тогда
			НовыйОбъект.Лико_КоличествоКоробок = КоличествоКоробокОсталось;
		Иначе
			НовыйОбъект.Лико_КоличествоКоробок = 1 / КоличествоЭтикетокВКоробке;
		КонецЕсли;
		КоличествоКоробокОсталось = КоличествоКоробокОсталось - НовыйОбъект.Лико_КоличествоКоробок;
		
		Если ЭтоКомплект И СерияВладелецКомплекта <> Неопределено Тогда
			НовыйОбъект.Лико_ВладелецКомплекта = СерияВладелецКомплекта;
			////Наименование у серий комплекта будет одинаковое (изменил агоритм - теперь наименование соответствует характеристике и номенклатуре)
			//НовыйОбъект.Наименование = СерияВладелецКомплекта.Наименование;
			////Чтобы не перезаписалось наименование, поставим признак ОбменДанными
			//НовыйОбъект.ОбменДанными.Загрузка = Истина;
		КонецЕсли; 
		
		Если СтруктураДанных.Свойство("МассивРоликовВКоробке") Тогда
			Для каждого ТекОбъектНоменклатуры из СтруктураДанных.МассивРоликовВКоробке Цикл
				НоваяСтрока = НовыйОбъект.Лико_Содержимое.Добавить();
				НоваяСтрока.ОбъектНоменклатуры = ТекОбъектНоменклатуры;
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			НовыйОбъект.Записать();
			Если СерияВладелецКомплекта = Неопределено Тогда
				СерияВладелецКомплекта = НовыйОбъект.Ссылка;
			КонецЕсли;
			Если ЭтоКомплект И НЕ ЗначениеЗаполнено(НовыйОбъект.Лико_ВладелецКомплекта) Тогда
				НовыйОбъект.Лико_ВладелецКомплекта = СерияВладелецКомплекта;
				////Наименование у серий комплекта будет одинаковое (изменил агоритм - теперь наименование соответствует характеристике и номенклатуре)
				//НовыйОбъект.Наименование = СерияВладелецКомплекта.Наименование;
				////Чтобы не перезаписалось наименование, поставим признак ОбменДанными
				//НовыйОбъект.ОбменДанными.Загрузка = Истина;
				НовыйОбъект.Записать();
			КонецЕсли;
			//Создадим штрихкод. Причем он генерируется только для первой серии, а для остальных серий присваивается такой же, как у первой. (изменил алгоритм - теперь создается один штрихкод)
			Если СерияВладелецКомплекта = НовыйОбъект.Ссылка Тогда
				// Теперь штрихкод создается только для владельца комплекта
				Штрихкод = СоздатьШтрихкодСерии(НовыйОбъект.Ссылка, СтруктураДанных);
				Если Штрихкод = Неопределено Тогда
					Возврат Неопределено;
				КонецЕсли;
			КонецЕсли;
			СозданныеСерии.Добавить(НовыйОбъект.Ссылка);
		Исключение
			Сообщить("Не удалось создать серию номенклатуры """ + СтрокаТЧ.Характеристика.Владелец + """ для характеристики """ + СтрокаТЧ.Характеристика + """. " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		// Получим код этикетки заказчика из заказа
		//КодЭтикеткиЗаказчика = СоответствиеНоменклатурыИКодовЭтикетокЗаказчика.Получить(СтрокаТЧ.Номенклатура);
		//Если КодЭтикеткиЗаказчика = Неопределено Тогда
		//	НайденныеСтроки = СтрокаТЧ.Характеристика.Лико_ЗаказНоменклатуры.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура));
		//	Если НайденныеСтроки.Количество() > 0 Тогда
		//		КодЭтикеткиЗаказчика = НайденныеСтроки[0].КодЭтикеткиЗаказчика;
		//	КонецЕсли;
		//	СоответствиеНоменклатурыИКодовЭтикетокЗаказчика.Вставить(СтрокаТЧ.Номенклатура, КодЭтикеткиЗаказчика);
		//КонецЕсли;
		
		// Запишем вес и код этикетки заказчика в номенклатуру
		//ВесЗаТысШт = Окр(НовыйОбъект.Лико_ВесКоробки / НовыйОбъект.Лико_КоличествоВУпаковке, 3);
		//Если СтрокаТЧ.Номенклатура.ВесЧислитель <> ВесЗаТысШт Тогда
		////Если СтрокаТЧ.Номенклатура.ВесЧислитель <> ВесЗаТысШт ИЛИ
		////	(КодЭтикеткиЗаказчика <> Неопределено И КодЭтикеткиЗаказчика <> СтрокаТЧ.Номенклатура.Лико_КодЭтикеткиЗаказчика) Тогда
		//	НоменклатураОбъект = СтрокаТЧ.Номенклатура.ПолучитьОбъект();
		//	НоменклатураОбъект.ВесЕдиницаИзмерения = Справочники.Лико_ПредопределенныеЗначения.ЕИКг.ЗначениеПараметра;
		//	НоменклатураОбъект.ВесЗнаменатель = 1;
		//	НоменклатураОбъект.ВесИспользовать = Истина;
		//	НоменклатураОбъект.ВесМожноУказыватьВДокументах = Ложь;
		//	НоменклатураОбъект.ВесЧислитель = ВесЗаТысШт;
		//	//НоменклатураОбъект.Лико_КодЭтикеткиЗаказчика = КодЭтикеткиЗаказчика;
		//	Попытка
		//		НоменклатураОбъект.Записать();
		//	Исключение
		//		Сообщить("Не удалось записать вес в номенклатуру """ + СтрокаТЧ.Номенклатура + """: " + ОписаниеОшибки());
		//	КонецПопытки;
		//КонецЕсли;			
	КонецЦикла;
	
	Возврат ЗаполнитьИнформациюОСерии(СерияВладелецКомплекта);
	
КонецФункции

Функция СоздатьШтрихкодСерии(Серия,СтруктураДанных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		МенеджерЗаписиШтрихкода = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписиШтрихкода.Номенклатура = Серия.Лико_ХарактеристикаВладелец.Владелец;
		МенеджерЗаписиШтрихкода.Характеристика = Серия.Лико_ХарактеристикаВладелец;
		МенеджерЗаписиШтрихкода.Лико_Серия = Серия;
		МенеджерЗаписиШтрихкода.Штрихкод = ПодготовкаШтрихКода(Серия.Ссылка, Серия.Лико_НомерКоробки, СтруктураДанных.НомерЗаказа, МенеджерЗаписиШтрихкода.Номенклатура);
		МенеджерЗаписиШтрихкода.Записать();
	Исключение
		Сообщить("Не удалсь создать штрихкод для серии """ + Серия.Ссылка + """");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат МенеджерЗаписиШтрихкода.Штрихкод;
	
КонецФункции

Функция ЗаполнитьИнформациюОСерии(Серия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК Ссылка,
		|	СерииНоменклатуры.Наименование КАК Наименование,
		|	СерииНоменклатуры.Лико_НомерКоробки КАК НомерКоробки,
		|	СерииНоменклатуры.Лико_Город КАК Город,
		|	СУММА(ЕСТЬNULL(СерииНоменклатурыКомплекта.Лико_КоличествоВУпаковке, СерииНоменклатуры.Лико_КоличествоВУпаковке)) КАК КоличествоВУпаковке,
		|	СерииНоменклатуры.Лико_Втулка КАК Втулка,
		|	СерииНоменклатуры.Лико_НаправлениеНамотки КАК НаправлениеНамотки,
		|	СерииНоменклатуры.Лико_ДатаУпаковки КАК ДатаУпаковки,
		|	СУММА(ЕСТЬNULL(СерииНоменклатурыКомплекта.Лико_ВесКоробки, СерииНоменклатуры.Лико_ВесКоробки)) КАК ВесКоробки,
		|	СУММА(ЕСТЬNULL(СерииНоменклатурыКомплекта.Лико_ВесНетто, СерииНоменклатуры.Лико_ВесНетто)) КАК ВесНетто,
		|	СерииНоменклатуры.Лико_ДлинаРоликов КАК ДлинаРоликов,
		|	СерииНоменклатуры.Лико_Упаковщик КАК Упаковщик,
		|	СерииНоменклатуры.Лико_ВладелецКомплекта КАК ВладелецКомплекта,
		|	СерииНоменклатуры.Лико_КоличествоРоликов КАК КоличествоРоликов,
		|	СерииНоменклатуры.Лико_РоликиСтрокой КАК РоликиСтрокой,
		|	СерииНоменклатуры.Лико_НомерПоставки КАК НомерПоставки,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец.ЕдиницаИзмерения.Наименование КАК НаименованиеЕИ,
		|	СерииНоменклатуры.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.ОсновнойМатериал КАК Основа,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.СрокГодности КАК СрокГодности,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец КАК Характеристика,
		|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК БУЛЕВО)) КАК СтикерВыводитьТипЭтикеткиВПолеКод,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.ТипЗаказа КАК ТипЗаказа,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Организация.Наименование КАК НаименованиеПродавца,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.ДатаВыпуска КАК ДатаВыпуска,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак.Gtin КАК ЧестныйЗнакGtin,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак.ДатаЭмиссии КАК ЧестныйЗнакДатаЭмиссии,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка.Организация КАК ПлощадкаОрганизация
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО СерииНоменклатуры.Ссылка = ШтрихкодыНоменклатуры.Лико_Серия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатурыКомплекта
		|		ПО СерииНоменклатуры.Ссылка = СерииНоменклатурыКомплекта.Лико_ВладелецКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
		|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""СтикерВыводитьТипЭтикеткиВПолеКод"")
		|ГДЕ
		|	СерииНоменклатуры.Ссылка = &Серия
		|
		|СГРУППИРОВАТЬ ПО
		|	СерииНоменклатуры.Ссылка,
		|	СерииНоменклатуры.Наименование,
		|	СерииНоменклатуры.Лико_НомерКоробки,
		|	СерииНоменклатуры.Лико_Город,
		|	СерииНоменклатуры.Лико_Втулка,
		|	СерииНоменклатуры.Лико_НаправлениеНамотки,
		|	СерииНоменклатуры.Лико_ДатаУпаковки,
		|	СерииНоменклатуры.Лико_Упаковщик,
		|	СерииНоменклатуры.Лико_КоличествоРоликов,
		|	СерииНоменклатуры.Лико_ВладелецКомплекта,
		|	СерииНоменклатуры.Лико_РоликиСтрокой,
		|	СерииНоменклатуры.Лико_ДлинаРоликов,
		|	СерииНоменклатуры.Лико_НомерПоставки,
		|	ШтрихкодыНоменклатуры.Штрихкод,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец.ЕдиницаИзмерения.Наименование,
		|	СерииНоменклатуры.Лико_КодЭтикеткиЗаказчика,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.ОсновнойМатериал,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.СрокГодности,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец,
		|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура),
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.ТипЗаказа,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Организация.Наименование,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.ДатаВыпуска,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак.Gtin,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак.ДатаЭмиссии,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка.Организация";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Результат = РезультатЗапроса.Выгрузить();
		Строка = Результат[0];
		Если Строка.СтикерВыводитьТипЭтикеткиВПолеКод Тогда
			Строка.КодЭтикеткиЗаказчика = "" + ?(ЗначениеЗаполнено(Строка.КодЭтикеткиЗаказчика), Строка.КодЭтикеткиЗаказчика + " ", "") + Строка.ТипЗаказа;
		КонецЕсли;
		ИнформацияОСерии = Новый Структура;
		Для каждого Колонка из Результат.Колонки Цикл
			ИнформацияОСерии.Вставить(Колонка.Имя, Строка[Колонка.Имя]);	
		КонецЦикла;
		ИнформацияОСерии.Наименование = ПолучитьНаименованиеСерии(Строка.Ссылка);
		//ИнформацияОСерии.КодЭтикеткиЗаказчика = ПолучитьКодЭтикеткиЗаказчика(Строка.Характеристика);
		ИнформацияОСерии.Вставить("Объем", Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ИнформацияОСерии.Номенклатура, "Стикер_Объем", 0));
		
		Если НЕ ЗначениеЗаполнено(ИнформацияОСерии.ДатаВыпуска) Тогда
			ЗаказОбъект = ИнформацияОСерии.Заказ.ПолучитьОбъект();
			ЗаказОбъект.ДатаВыпуска = ИнформацияОСерии.ДатаУпаковки;
			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказОбъект.Записать();
			ИнформацияОСерии.ДатаВыпуска = ЗаказОбъект.ДатаВыпуска;
		КонецЕсли;
		
		Возврат ИнформацияОСерии;
	КонецЕсли;	
	
КонецФункции

Функция ПодготовкаШтрихКода(Серия, НомерКоробки, НомерЗаказа, Номенклатура) Экспорт
	
	////КодТМ = Число(Серия.Номер);
	//МаксИД = НомерКоробки;
	//
	////ИдУпаковки = Число(НомерЗаказа) + КодТМ + МаксИД; 
	//ИдУпаковки = Число(НомерЗаказа) + МаксИД; 
	//
	//ШтрхКодУпаковки = "3005" + Формат(ИдУпаковки, "ЧЦ=8;ЧВН=;ЧГ=") + формат(МаксИД, "ЧЦ=7;ЧВН=;ЧГ=");
	//
	//ШтрихкодСуществует = Истина;
	//
	//Пока  ШтрихкодСуществует Цикл
	//	ШтрихкодСуществует = ПроверитьНаличиеШтрихкода(ШтрхКодУпаковки);
	//	
	//	Если ШтрихкодСуществует Тогда
	//		ИдУпаковки = ИдУпаковки + 1;
	//		ШтрхКодУпаковки = "3005" + Формат(ИдУпаковки, "ЧЦ=8;ЧВН=;ЧГ=") + формат(МаксИД, "ЧЦ=7;ЧВН=;ЧГ="); 
	//		Если Не Число(Формат(ИдУпаковки, "ЧЦ=8;ЧВН=;ЧГ=")) = ИдУпаковки Тогда
	//			Сообщить("Stack overflow...");
	//			Прервать;	
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Возврат Лико_Дополнительно.ВычислитьКонтрольнуюСумму(ШтрхКодУпаковки);
	
	ШтрхКодУпаковки = НомерЗаказа + Прав(Номенклатура.Код,7) + Формат(НомерКоробки,"ЧЦ=4; ЧВН=; ЧГ=0");
	
	ШтрихкодСуществует = ПроверитьНаличиеШтрихкода(ШтрхКодУпаковки);
	
	Если ШтрихкодСуществует Тогда
		Сообщить("Ошибка. Созданный штрихкод (" + ШтрихкодСуществует + ") уже существует. Обратитесь к программистам");
		Возврат Неопределено;
	Иначе
		Возврат ШтрхКодУпаковки;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНаименованиеСерии(Серия)
	
	// Чтобы не плодить код по формированию наименования, будем использовать функцию ПолучитьНаименованиеКомплекта
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура");
	Товары.Колонки.Добавить("Характеристика");
	Если ЗначениеЗаполнено(Серия.Лико_ВладелецКомплекта) Тогда
		МассивСерий = Лико_Дополнительно.НайтиСерииПоВладельцуКомплекта(Серия.Лико_ВладелецКомплекта);
		Для каждого СерияКомплекта из МассивСерий Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Характеристика = СерияКомплекта.Лико_ХарактеристикаВладелец;
			НоваяСтрока.Номенклатура = НоваяСтрока.Характеристика.Владелец;
		КонецЦикла;
	Иначе		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Характеристика = Серия.Лико_ХарактеристикаВладелец;
		НоваяСтрока.Номенклатура = НоваяСтрока.Характеристика.Владелец;
	КонецЕсли;
	Структура = Новый Структура("Товары,Город,КодЭтикеткиЗаказчика", Товары, Серия.Лико_Город, Серия.Лико_КодЭтикеткиЗаказчика);
	Возврат Лико_Дополнительно.ПолучитьНаименованиеКомплекта(Структура, Ложь);
	
КонецФункции

Функция ПроверитьНаличиеШтрихкода(ШтрхКодУпаковки)
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Штрихкоды.Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", ШтрхКодУпаковки);
	
	Возврат (Запрос.Выполнить().Выбрать().Количество() > 0);
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	//++ НЕ УТКА
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	ПриходныйОрдерНаТовары.Распоряжение ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|	И ПриходныйОрдерНаТовары.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаПоПрочемуОприходованию)";
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	//-- НЕ УТКА
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Документ.ПриходныйОрдерНаТовары";
	//++ НЕ УТКА
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта, МенеджерВременныхТаблиц);
	
	Если Не Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если Не Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОбъектыДляОбработки.Ссылка                   КАК Ссылка,
	|	ОбъектыДляОбработки.Ссылка.ВерсияДанных      КАК ВерсияДанных,
	|	(ОбъектыДляОбработки.Ссылка.Распоряжение ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|		И ОбъектыДляОбработки.Ссылка.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаПоПрочемуОприходованию))
	|												 КАК ТребуетсяИзменениеСкладскойОперации
	|ИЗ
	|	ВТОбъектыДляОбработки КАК ОбъектыДляОбработки";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТОбъектыДляОбработки", Результат.ИмяВременнойТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ДокументОбъект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(Выборка.Ссылка, Выборка.ВерсияДанных, Параметры.Очередь);
			Если ДокументОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ОбъектИзменен = Ложь;
			Если Выборка.ТребуетсяИзменениеСкладскойОперации Тогда
				ДокументОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства;
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, , , РежимЗаписиДокумента.Запись);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(Выборка.Ссылка);
		КонецПопытки;
	КонецЦикла;
	
	//-- НЕ УТКА
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//************************************
//************************************

#КонецЕсли  


    
//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
  //МеханизмыДокумента.Добавить("ЗакрытиеБланков"); 
  МеханизмыДокумента.Добавить("АдресныйСклад");
  МеханизмыДокумента.Добавить("Лико_Склад");

КонецПроцедуры

 Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ТоварыВЯчейках);
	КонецЕсли;
	Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ТоварыВЯчейках);
	Возврат Параметры;
КонецФункции

 Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ТоварыВЯчейках");
КонецПроцедуры 

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
				
		Если ЗначениеЗаполнено(Документ.ДатаПроведенияПоОбязательнымРегистрам) Тогда
			ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры, Документ.Ссылка);
		Иначе	
			// <-- Конец Лико Ефимов ЕВВ 09.12.2021
			ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
			//ТекстЗапросаТаблицаТоварыКОформлениюПоступления(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаДвижениеСерииТоваров(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаСвободныеОстатки(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры, Документ.Ссылка);
			ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаДвиженияЛико_ЗакрытиеБланка(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаДвиженияЛикоПартииКликов(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаДвиженияЛико_ТоварыКРаспределению(Запрос, ТекстыЗапроса, Регистры);
			//--> Иванова Анна 20181023
			ТекстЗапросаТаблицаДвиженияЛико_ЗатратыПоЗаказуДляОтгрузки(Запрос, ТекстыЗапроса, Регистры);
			//<-- Иванова Анна 20181023
			//--> Иванова Анна 20191030
			ТекстЗапросаТаблицаДвиженияЛико_ПромежуточныйВыпуск(Запрос, ТекстыЗапроса, Регистры);
			//<-- Иванова Анна 20191030
			ТекстЗапросаТаблицаДвиженияЛико_СписаниеНаЗаказ(Запрос, ТекстыЗапроса, Регистры);
			ТекстЗапросаТаблицаДвиженияЛико_РаскройМатериаловПланФакт(Запрос, ТекстыЗапроса, Регистры);
		КонецЕсли;
		
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие - соответствие имен таблиц изменения регистров и текстов запросов.
//	
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции
//- <--- Лико2.5 m.shenderov 30.03.2022 
