#Область Переменные 

Перем КлючиСтруктуры;

Перем ОтключитьЧастьПроверок; 

#КонецОбласти

#Область ОбрабочикСобытий


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ОбработатьТабличнуюЧастьТовары();
	ЗаполнитьСклады(Отказ, РежимЗаписи);
	
	
	ТипРаспоряжения=Неопределено; 		
	ОпределитьТипРаспоряжения(ТипРаспоряжения,Отказ);	
	ДополнительныеСвойства.Вставить("ТипРаспоряжения",ТипРаспоряжения);
	
	Если ТипРаспоряжения="ЭтапПроизводства" Тогда
		ПроверкаРезерваМатериалов(Отказ,РежимЗаписи);
	КонецЕсли;
	
	
	
	ПроверкаИЗаполнениеДокумента(Отказ,РежимЗаписи,РежимПроведения);
	
	
	
	ВыполнитьСборкуРазборку(Отказ,РежимЗаписи,РежимПроведения); 	
	ВыпускГотовойПродукции();

	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда 		
		ЗаполнитьТаблицуРаспределениеМатериалов();
	КонецЕсли;

	BRCНаследованиеОбъектовНоменклатуры();
	
	//+ ---> Лико2.5 m.shenderov 30.03.2022
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	//- <--- Лико2.5 m.shenderov 30.03.2022
	
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);

	Если Не Отказ Тогда
	КонецЕсли;

	// --> Начало Лико Ефимов ЕВВ 20.05.2022
	Если ЗначениеЗаполнено(ДатаПроведенияПоОбязательнымРегистрам) Тогда
		Документы.Лико_БланкЭтапа.ОтразитьТолькоТоварыВЯчейках(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 20.05.2022

	Движения.Лико_СписаниеНаЗаказ.Очистить();	
	Движения.Лико_СписаниеНаЗаказ.Записать();	
	Движения.ТоварыКОтгрузке.Очистить();
	Движения.ТоварыКОтгрузке.Записать();
	Движения.ТоварыНаСкладах.Очистить();
	Движения.ТоварыНаСкладах.Записать();

	УдалениеДокуметовПеремещенияВКолористическую(Отказ);   

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);


	//Начало изменений Иванова А.В. 20200728
	Лико_Планирование.ЗаполнениеЗатратЗаказаПоБланку(ЭтотОбъект.Ссылка, Отказ);
	//Конец изменений Иванова А.В. 20200728

	// --> Начало Лико Ефимов ЕВВ 07.01.2018
	ОбработатьПланРЦ();
	// <-- Конец Лико Ефимов ЕВВ 07.01.2018

	//+ Лико m.shenderov 16.01.2018
	ОбработатьЭтапЗаказа();
	СнятиеСРезерва();//2.5 Необходимо переделать документ подготовка заказов
	//- Лико m.shenderov 16.01.2018


	Если ВидОперации<>Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда	
		Если ТипЗнч(Распоряжение)=Тип("ДокументСсылка.СборкаТоваров") Тогда
			////ОбработатьРаспоряжение(РежимЗаписиДокумента.Проведение,Отказ);
		КонецЕсли	
	КонецЕсли;

	// --> Начало Лико Иванова Анна  03.11.2020 - для Икс-Пака в заказе по бланку ничего не меняем
	Если Организация <> Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда 
		Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьЗатратыВЗаказеКлиента") Тогда
			Лико_Планирование.ЗаполнениеЗатратИзЗакрытиеБланка(ЭтотОбъект.Ссылка, Отказ);
		КонецЕсли;
	КонецЕсли;	
	// <-- Конец Лико Иванова Анна  03.11.2020



	//+ Лико m.shenderov 29.09.2018
	Массив = Новый Массив();
	Для каждого Товар Из Товары Цикл
		Если Товар.Списать Тогда
			Массив.Добавить(Товар.Серия);
		КонецЕсли;  	

	КонецЦикла;
	ПроверитьКоличествоОбъектаНоменклатуры(Массив);
	//- Лико m.shenderov 29.09.2018

	Если Не ДополнительныеСвойства.Свойство("НеВосстанавливатьЭтапы") Тогда

		Лико_ОбщегоНазначенияСервер.ВосстановитьЭтапыАсинхронно(Ссылка);
	КонецЕсли;
	ПроверитьДатуФормированияОбъектаНоменклатуры();	
	Документы.Лико_БланкЭтапа.ЗаполнениеЗакрытияБланкаВОбъектеНоменклатуры(Ссылка);

	УчетТехОтхода();
	
	 //СформироватьПродажуМатериаловМеждуОрганизациями();
	 
	//+ o.pukhova 20.08.2020
	Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра И НомерПроката = 1 Тогда 
		
		ЗакрытиеЗаявокДизайнерам(); 
		
	КонецЕсли;
	//- o.pukhova 20.08.2020
	ЗакрытиеЗаказаНаРаскрой();

	Если ДополнительныеСвойства.ТипРаспоряжения="СборкаТоваров" Тогда	

		ЗарезервироватьМатериталСборки();

		ЗаполнитьПаритииПроизводства();

	КонецЕсли;

РегистрыСведений.Лико_СерииНоменклатурыДоп.Записать(ЭтотОбъект); 
Обработки.ПеремещениеТоваровДоп.СформироватьДокумент(ЭтотОбъект);

Если ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда	
	РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СформироватьЗаписи(ЭтотОбъект, Отказ);
КонецЕсли;
//РегистрыСведений.Лико_ВыпускГППоБланку.Записать(ЭтотОбъект);
//РегистрыНакопления.Лико_ВыпускГППоБланкуОбороты.Проведение(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;  
	//Если РабочийЦентр.ВидРабочегоЦентра<>Справочники.ВидыРабочихЦентров.Indigo Тогда			
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоКликов");
	//КонецЕсли;
	Если РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.ГравировальныйУчасток Тогда

	ИначеЕсли ЗаказПокупателя.ВидЗаказа<>Перечисления.Лико_ВидыЗаказов.Пробник Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
	Иначе
		Если РабочийЦентр.ВидРабочегоЦентра<>Справочники.ВидыРабочихЦентров.Indigo Тогда
			Если РабочийЦентр.ВидРабочегоЦентра<>Справочники.ВидыРабочихЦентров.Omega Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
				МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
			КонецЕсли;


		КонецЕсли;


	КонецЕсли;

	ТипРаспоряжения=Неопределено;

	ОпределитьТипРаспоряжения(ТипРаспоряжения,Отказ);
	Если  ТипРаспоряжения="СборкаТоваров"  Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказПокупателя");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка"); 		
	КонецЕсли;


	Если  ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказПокупателя");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБланка"); 	
		МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
		МассивНепроверяемыхРеквизитов.Добавить("РабочийЦентр"); 	
	КонецЕсли;

	Если  ВидОперации<>Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
		МассивНепроверяемыхРеквизитов.Добавить("Выпуск"); 		
	КонецЕсли;

	Если не РабочийЦентр.Лико_ВводитьУдарыПриЗакрытииЗаказа Тогда 		
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоУдаров"); 
	КонецЕсли;
	МассивНепроверяемыхРеквизитов.Добавить("Сотрудник2");


	Если РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.ГравировальныйУчасток И Выпуск.Количество()>0 Тогда 
		Если Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаУчетаТрудозатратПоПерегравировки.ЗначениеПараметра<Дата Тогда			
		ПроверяемыеРеквизиты.Добавить("Трудозатраты");
	КонецЕсли;
	
КонецЕсли;

Если РольДоступна("Лико_КонтрольИзмененияЗакрытияБланка") И  Не РольДоступна("ПолныеПрава") И ЗначениеЗаполнено(Ссылка) Тогда 
	ПроверяемыеРеквизиты.Добавить("ПодписьДокументаСотрудником");
КонецЕсли;

	

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);



КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Распоряжение=Неопределено;
	ВидОперации=Неопределено;
	СписыватьВыпускНезавершеннойПродукции=Неопределено;
	ОставитьНаРабочемЦентреСырье=Неопределено;
	РаспоряжениеНаОтгрузку=Неопределено;
	// --> Начало Лико Ефимов ЕВВ 15.12.2021
	ДатаПроведенияПоОбязательнымРегистрам = Неопределено;
	// <-- Конец Лико Ефимов ЕВВ 15.12.2021
	МатериалНаМашине=Ложь;
	МестоВалидации = Неопределено; // --> Начало Лико Ефимов ЕВВ 09.07.2024	
	СерияУпаковки = Неопределено;
	СтатусВыпуска = Неопределено;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	УдалениеДокуметовПеремещенияВКолористическую(Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("СборкаТоваров","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПеремещениеТоваров","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("Лико_ПередачаТоваров","Лико_Документ",Ссылка,Отказ);



	//НачатьТранзакцию();
	//Пометим на удаление связанные типовые документы
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Отказ Тогда
		//ЗафиксироватьТранзакцию();	
	КонецЕсли;

	//+ Лико m.shenderov 29.09.2018
	Массив = Новый Массив();
	Для каждого Товар Из Товары Цикл
		Если Товар.Списать Тогда
			Массив.Добавить(Товар.Серия);
		КонецЕсли;  	

	КонецЦикла;
	ПроверитьКоличествоОбъектаНоменклатуры(Массив);
	//- Лико m.shenderov 29.09.2018

	//- Иванова Анна 20181023
	Лико_Планирование.ОчиститьДанныеПоБланку(Ссылка, Отказ);
	//- Иванова Анна 20181023

	Если Не ДополнительныеСвойства.Свойство("НеВосстанавливатьЭтапы") Тогда

		Лико_ОбщегоНазначенияСервер.ВосстановитьЭтапыАсинхронно(Ссылка);

	КонецЕсли;

	// --> Начало Лико Ефимов ЕВВ 28.08.2020
	//Если НЕ Отказ Тогда
	//	// Удалим запись из Лико_ЭтапыЗаказа
	//	МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
	//	МенеджерЗаписи.Период = Ссылка.Дата;
	//	МенеджерЗаписи.Заказ = Ссылка.ЗаказПокупателя;
	//	МенеджерЗаписи.Площадка = МенеджерЗаписи.Заказ.Площадка;
	//	МенеджерЗаписи.Прочитать();
	//	Если МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.ОкончаниеПечати Тогда
	//		Попытка
	//			МенеджерЗаписи.Удалить();	
	//		Исключение
	//			Сообщить("Не удалось удалить запись из регистра ""лк Этапы заказа"", пожалуйста, передайте информацию программистам: " + ОписаниеОшибки());
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 28.08.2020

КонецПроцедуры


#КонецОбласти

#Область СозаниеРедактированиеДокументов

Процедура УдалениеДокуметовПеремещенияВКолористическую(Отказ)
	
	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Лико_Документ",Ссылка);
	СтруктураПараметров.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую);	
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдалениеРасш("ДвижениеПродукцииИМатериалов",СтруктураПараметров,Отказ);	
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ЗаказМатериаловВПроизводство","Лико_Документ",Ссылка,Отказ);
	
КонецПроцедуры

Процедура СоздатьРедактироватьЭтап(Отказ)
	Если Отказ Тогда
		Возврат; 
	КонецЕсли;
	НовыйДокОбъект = Документы.ЭтапПроизводства2_2.СоздатьДокумент(); 
	
	
	РаспоряжениеЗаказ    	= Лико_Дополнительно.НайтиЗаказНаПроизводствоПоЗаказуКлиента(ЗаказПокупателя);
	Если РаспоряжениеЗаказ 	= Неопределено Тогда
		Отказ 				= Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не найден заказ на производство для заказа клиента """ + ЗаказПокупателя + """! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		Возврат ;
	КонецЕсли;
	
	ВыпускающийЭтап = Документы.ЭтапПроизводства2_2.ПустаяСсылка();
	Потребность     = Неопределено;
	
	ДанныеОснования = Документы.ЭтапПроизводства2_2.ДанныеЗаполненияДляМодификацииЦепочки(ВыпускающийЭтап, РаспоряжениеЗаказ, Потребность);
	НомерЭтапаВПартииЗапуска = ДанныеОснования.ЗначенияЗаполнения.НомерЭтапаВПартииЗапуска;
	
	ЗначенияЗаполнения = Новый Структура(ДанныеОснования.ОбщиеРеквизиты);
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, ДанныеОснования.ЗначенияЗаполнения);
	ЗначенияЗаполнения.Вставить("НомерЭтапа", 1);
	ЗначенияЗаполнения.Вставить("НомерСледующегоЭтапа", 0);
	ЗначенияЗаполнения.Вставить("НаименованиеЭтапа", "Печать");
	ЗначенияЗаполнения.Вставить("Подразделение",     Подразделение);
	ЗначенияЗаполнения.Вставить("СсылкаНового", Документы.ЭтапПроизводства2_2.ПолучитьСсылку());
	ЗначенияЗаполнения.Вставить("НомерПартииЗапуска", ДанныеОснования.ЗначенияЗаполнения.НомерПартииЗапуска);
	ЗначенияЗаполнения.Вставить("НомерЭтапаВПартииЗапуска", НомерЭтапаВПартииЗапуска);
	ЗначенияЗаполнения.Вставить("ВыпускающийЭтап", Документы.ЭтапПроизводства2_2.ПолучитьСсылку());
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ДанныеЗаполнения.Вставить("СпособЗаполнения", "ЗаполнитьПоДаннымПользователя");
	
	
	
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	НовыйДокОбъект.Дата 						=Дата;
	НовыйДокОбъект.Лико_РабочийЦентр			=РабочийЦентр;
	НовыйДокОбъект.Статус 						=Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
	НовыйДокОбъект.Выполнено 					=НовыйДокОбъект.Запланировано;
	НовыйДокОбъект.ФактическоеНачалоЭтапа 		=НовыйДокОбъект.Дата;
	НовыйДокОбъект.ФактическоеОкончаниеЭтапа 	=НовыйДокОбъект.Дата;
	НовыйДокОбъект.ДатаПроизводства 			=НовыйДокОбъект.Дата;
	НовыйДокОбъект.ПроизводствоОднойДатой 		=Ложь;
	НовыйДокОбъект.МаршрутнаяКарта 				=Справочники.Лико_ПредопределенныеЗначения.МаршрутнаяКартаУпаковка.ЗначениеПараметра;
	НовыйДокОбъект.КоэффициентМаршрутнойКарты 	= 1;
	НовыйДокОбъект.ЖелаемаяДатаОбеспечения		= НовыйДокОбъект.Дата;
	НовыйДокОбъект.НомерПроката					= НомерПроката;
	
	
	
	
	Если ЗначениеЗаполнено(Распоряжение) Тогда
		ДокОбъект = Распоряжение.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ДокОбъект, НовыйДокОбъект,,"Ссылка,Номер"); 
	Иначе
		ДокОбъект = НовыйДокОбъект; 
	КонецЕсли; 
	
	
	
	
	
	
	
	//ОтборВТаблице = Новый Структура;
	//ОтборВТаблице.Вставить("Лико_Документ",Ссылка);
	//СтрокиВыпуска=ДокОбъект.ВыходныеИзделия.НайтиСтроки(ОтборВТаблице);
	//СтрокиРасхода=ДокОбъект.РасходМатериаловИРабот.НайтиСтроки(ОтборВТаблице);
	//СтрокиОбеспечения=ДокОбъект.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(ОтборВТаблице);
	//Для каждого Стр Из СтрокиВыпуска Цикл
	//	ДокОбъект.ВыходныеИзделия.Удалить(ДокОбъект.ВыходныеИзделия.Индекс(Стр));   
	//КонецЦикла;
	//Для каждого Стр Из СтрокиРасхода Цикл
	//	ДокОбъект.РасходМатериаловИРабот.Удалить(ДокОбъект.РасходМатериаловИРабот.Индекс(Стр));   
	//КонецЦикла;
	//Для каждого Стр Из СтрокиОбеспечения Цикл
	//	ДокОбъект.ОбеспечениеМатериаламиИРаботами.Удалить(ДокОбъект.ОбеспечениеМатериаламиИРаботами.Индекс(Стр));   
	//КонецЦикла;
	//
	//Для каждого ВыборкаДетальныеЗаписи  Из Выпуск Цикл  		
	//	Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда
	//		Продолжить;
	//	КонецЕсли; 		
	//	НоваяСтрока = ДокОбъект.ВыходныеИзделия.Добавить();	
	//	НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
	//	НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
	//	НоваяСтрока.КоличествоУпаковок = ВыборкаДетальныеЗаписи.Количество;
	//	НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоУУ;
	//	НоваяСтрока.Упаковка=Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(ВыборкаДетальныеЗаписи.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка);
	//	НоваяСтрока.Получатель 						=Склад;
	//	НоваяСтрока.Получатель 						=Склад;
	//	НоваяСтрока.Лико_Документ    				=Ссылка;
	//	НоваяСтрока.НомерБланка						=НомерБланка;
	//	//НоваяСтрока.СтатусУказанияСерий				=8;
	//	//НоваяСтрока.СтатусУказанияСерийПолучатель	=8;
	//	//НоваяСтрока.СтатусУказанияСерийОтправитель	=8; 		
	//	НоваяСтрока.Произведено 					= Истина;
	//	НоваяСтрока.ДатаПроизводства 				= ДокОбъект.Дата;
	//	НоваяСтрока.ДоляСтоимости 					= 1;
	//	МаксимальныйКодСтрокиИзделия 				= НоваяСтрока.НомерСтроки;		
	//	//НоваяСтрока									= ДокОбъект.ВыходныеИзделияСерии.Добавить();		
	//	//НоваяСтрока.Номенклатура 					= ВыборкаДетальныеЗаписи.Номенклатура;
	//	//НоваяСтрока.Характеристика 					= ВыборкаДетальныеЗаписи.Характеристика;
	//	//НоваяСтрока.Количество 						= ВыборкаДетальныеЗаписи.КоличествоУУ;
	//	//НоваяСтрока.ДатаПроизводства 				= ДокОбъект.Дата;
	//	//НоваяСтрока.Получатель						= Склад;	
	//	//НоваяСтрока.Серия							= ВыборкаДетальныеЗаписи.Серия;		
	//КонецЦикла; 
	//
	//
	//Для каждого ВыборкаДетальныеЗаписи  Из Товары Цикл		
	//	Если ВыборкаДетальныеЗаписи.Списать Тогда
	//		Если  ВыборкаДетальныеЗаписи.Количество>0 Тогда
	//			НоваяСтрока 					= ДокОбъект.РасходМатериаловИРабот.Добавить();	
	//			НоваяСтрока.Номенклатура 		= ВыборкаДетальныеЗаписи.Номенклатура;
	//			НоваяСтрока.Характеристика 		= ВыборкаДетальныеЗаписи.Характеристика;
	//			НоваяСтрока.КоличествоУпаковок 	= ВыборкаДетальныеЗаписи.Количество-ВыборкаДетальныеЗаписи.ВозвратКоличество;
	//			НоваяСтрока.Количество 			= ВыборкаДетальныеЗаписи.КоличествоУУ-ВыборкаДетальныеЗаписи.ВозвратКоличествоУУ;
	//			НоваяСтрока.РабочийЦентр 		= РабочийЦентр;
	//			НоваяСтрока.Упаковка 			= Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(ВыборкаДетальныеЗаписи.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка);
	//			НоваяСтрока.ДатаРасхода 		= ДокОбъект.Дата;
	//			НоваяСтрока.Лико_Документ   	= Ссылка;
	//			НоваяСтрока.НомерБланка						=НомерБланка;
	//			
	//			НоваяСтрока.СтатьяКалькуляции	= Справочники.Лико_ПредопределенныеЗначения.СтатьяКалькуляцииПечати.ЗначениеПараметра;
	//			
	//			НоваяСтрока 					= ДокОбъект.ОбеспечениеМатериаламиИРаботами.Добавить();	
	//			НоваяСтрока.Номенклатура 		= ВыборкаДетальныеЗаписи.Номенклатура;
	//			НоваяСтрока.Характеристика 		= ВыборкаДетальныеЗаписи.Характеристика;
	//			НоваяСтрока.КоличествоУпаковок 	= ВыборкаДетальныеЗаписи.Количество-ВыборкаДетальныеЗаписи.ВозвратКоличество;
	//			НоваяСтрока.Количество 			= ВыборкаДетальныеЗаписи.КоличествоУУ-ВыборкаДетальныеЗаписи.ВозвратКоличествоУУ;				
	//			НоваяСтрока.Лико_Документ   	= Ссылка; 
	//			
	//			
	//			НоваяСтрока.Упаковка 			= Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(ВыборкаДетальныеЗаписи.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка);
	//			НоваяСтрока.ДатаОтгрузки		= ДокОбъект.Дата;
	//			//НоваяСтрока.Серия 				= ВыборкаДетальныеЗаписи.Серия;
	//			//НоваяСтрока.СтатусУказанияСерий				=8;
	//			//НоваяСтрока.СтатусУказанияСерийОтправитель	=8;
	//			//НоваяСтрока.СтатусУказанияСерийПолучатель	=8;
	//			НоваяСтрока.СтатьяКалькуляции				=Справочники.Лико_ПредопределенныеЗначения.СтатьяКалькуляцииПечати.ЗначениеПараметра;
	//			НоваяСтрока.Склад							=Склад;
	//			НоваяСтрока.ВариантОбеспечения				=Перечисления.ВариантыОбеспечения.Отгрузить;
	//		КонецЕсли; 			
	//	КонецЕсли;	
	//КонецЦикла; 	
	//
	Попытка
		ДокОбъект.Записать();  
	Исключение
		Отказ=Истина;
		//ОписаниеОшибки()
	КонецПопытки;
	
	
	Распоряжение=ДокОбъект.Ссылка;
	
КонецПроцедуры

Процедура СоздатьРедактироватьВыпускПродукции(Отказ)
	Возврат;
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	ОбъектыОснований = Новый Массив;
	ОбъектыОснований.Добавить(Распоряжение); 	
	
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
	ОбъектыОснований, Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);	
	
	НовыйДокОбъект = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент(); 	
	НовыйДокОбъект.Заполнить(ПараметрыОткрытия.Основание);
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Статус = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаВыпуск.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Серия КАК Серия,
	|	Лико_БланкЭтапаВыпуск.Характеристика КАК Характеристика,
	|	Лико_БланкЭтапаВыпуск.КоличествоУУ КАК Количество,
	|	Лико_БланкЭтапаВыпуск.Количество КАК КоличествоУпаковок,
	|	Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	Лико_БланкЭтапаВыпуск.Ссылка.Распоряжение КАК Распоряжение,
	|	Лико_БланкЭтапаВыпуск.НомерСтроки КАК КодСтроки
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	НовыйДокОбъект.Товары.Загрузить( Запрос.Выполнить().Выгрузить());	
	
	Если ЗначениеЗаполнено(ДокументВыпуска)  Тогда
		ДокументВыпускаОбъект = ДокументВыпуска.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ДокументВыпускаОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из ДокументВыпускаОбъект.Метаданные().ТабличныеЧасти Цикл
			ДокументВыпускаОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = ДокументВыпускаОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(); 		
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
	КонецПопытки; 	
	Если Отказ Тогда
		Возврат ;
	КонецЕсли;
	ДокументВыпуска= НовыйДокОбъект.Ссылка;  	
КОнецПроцедуры

Процедура СоздатьРедактироватьПередачуМатериалов(Отказ)
	Возврат;
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	ОбъектыОснований = Новый Массив;
	ОбъектыОснований.Добавить(Распоряжение); 	
	
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
	ОбъектыОснований, Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство);	
	
	НовыйДокОбъект = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент(); 	
	НовыйДокОбъект.Заполнить(ПараметрыОткрытия.Основание);
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Статус = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	Лико_БланкЭтапаТовары.КоличествоУУ - Лико_БланкЭтапаТовары.ВозвратКоличествоУУ КАК Количество,
	|	Лико_БланкЭтапаТовары.Количество - Лико_БланкЭтапаТовары.ВозвратКоличество КАК КоличествоУпаковок,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	Лико_БланкЭтапаТовары.Ссылка.Распоряжение КАК Распоряжение,
	|	Лико_БланкЭтапаТовары.НомерСтроки КАК КодСтроки
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	НовыйДокОбъект.Товары.Загрузить( Запрос.Выполнить().Выгрузить());	
	
	Если ЗначениеЗаполнено(ДокументПередачиВПроизводство)  Тогда
		ДокументПередачиОбъект = ДокументПередачиВПроизводство.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ДокументПередачиОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из ДокументПередачиОбъект.Метаданные().ТабличныеЧасти Цикл
			ДокументПередачиОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = ДокументПередачиОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(); 		
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
	КонецПопытки; 	
	Если Отказ Тогда
		Возврат ;
	КонецЕсли;
	ДокументПередачиВПроизводство= НовыйДокОбъект.Ссылка;  	
КОнецПроцедуры

Функция СоздатьВозвратИзПроизводства(НовыйЭтапСсылка, УжеСозданныйДокумент)
	НовыйДокОбъект=Неопределено;
	
	Отказ = Ложь;
	ОбъектыОснований = Новый Массив;
	ОбъектыОснований.Добавить(НовыйЭтапСсылка);
	
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
	ОбъектыОснований,
	ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства"));
	
	НовыйДокОбъект = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	
	НовыйДокОбъект.Заполнить(ПараметрыОткрытия.Основание);
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Статус = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	НовыйДокОбъект.Организация=НовыйЭтапСсылка.Организация;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.Документ.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	//Добавляем серии в документ
	НовыйДокОбъект.Серии.Очистить();
	Для каждого СтрокаСерии Из Товары Цикл
		Если СтрокаСерии.Списать И СтрокаСерии.ВозвратКоличество>0 Тогда
			НоваяСерия=НовыйДокОбъект.Серии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСерия,СтрокаСерии);
		КонецЕсли;
		
		Для каждого НовыйТовар Из НовыйДокОбъект.Товары Цикл
			НовыйТовар.СтатусУказанияСерий=8;
			НовыйТовар.СтатусУказанияСерийОтправитель=8;
			НовыйТовар.СтатусУказанияСерийПолучатель=8;	
			
		КонецЦикла;
		
		
		
	КонецЦикла;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьПриходныйОрдер(НовыйЭтапСсылка, Приемка, УжеСозданныйДокумент)
	
	Отказ = Ложь;
	Основание = Новый Структура;
	Основание.Вставить("Распоряжение",НовыйЭтапСсылка.Ссылка);
	Основание.Вставить("Отправитель",НовыйЭтапСсылка.Подразделение);
	Основание.Вставить("ЗакрыватьГрафикПоступления",Истина);
	Основание.Вставить("Склад", ЯчейкаПолучатель.Владелец);
	Основание.Вставить("Помещение", Справочники.СкладскиеПомещения.ПустаяСсылка());
	Основание.Вставить("ЗонаПриемки", Приемка);
	Основание.Вставить("ДатаВходящегоДокумента", НовыйЭтапСсылка.Дата);
	Основание.Вставить("НомерВходящегоДокумента", НовыйЭтапСсылка.Номер);
	Основание.Вставить("ДатаПоступления", НовыйЭтапСсылка.Дата);
	
	НовыйДокОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	НовыйДокОбъект.Заполнить(Основание);
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
	НовыйДокОбъект.Товары.Очистить();
	Для каждого ВыборкаСерии Из Товары Цикл
		
		Если ВыборкаСерии.Количество = 0 Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("У серии " + ВыборкаСерии.Серия + " не заполнен реквизит ""Количество в упаковке""! Данная серия пропущена.");
			Продолжить;
		КонецЕсли;
		Если ВыборкаСерии.Списать и ВыборкаСерии.ВозвратКоличество>0 Тогда
			НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = ВыборкаСерии.Номенклатура;
			НоваяСтрока.Характеристика = ВыборкаСерии.Характеристика;
			НоваяСтрока.Упаковка =Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(ВыборкаСерии.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка) ;
			НоваяСтрока.КоличествоУпаковок = ВыборкаСерии.ВозвратКоличество;
			НоваяСтрока.Количество = ВыборкаСерии.ВозвратКоличествоУУ;
			НоваяСтрока.СтатусУказанияСерий = 8;
			НоваяСтрока.Серия = ВыборкаСерии.Серия;
		КонецЕсли;
		
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.Документ.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Функция СоздатьРазмещениеТоваров(НовыйДокументПриходныйОрдерСсылка, УжеСозданныйДокумент)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	
	НовыйДокОбъект.Заполнить(НовыйДокументПриходныйОрдерСсылка);
	НовыйДокОбъект.Дата = Дата;
	
	//Система автоматом распределила товар по ячейкам, а нам нужно весть товар положить в ЯчейкаПолучатель
	Для каждого СтрокаТЧ из НовыйДокОбъект.ТоварыРазмещение Цикл
		СтрокаТЧ.Ячейка = ЯчейкаПолучатель;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.Документ.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		//чтобы отработали проверки при проведении отбора, его сперва нужно провести в статусе "В работе" или "Подготовлено", а уже потом в статусе "Выполнено без ошибок"
		//(если провести сразу в статусе "Выполнено без ошибок", то проверок не будет и документ без проблем проведется)
		Если НЕ ОтключитьЧастьПроверок Тогда
			// С такими проверками невозможно перепровести документ задним числом (если коробки после этого имеют другие движения), закомментим пока
			//НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//меняем статус и проводим еще раз
		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;	
	
КонецФункции

#Область Распределение_Краски


Процедура СоздатьЗаказМатериаловПроизводствоПоТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ) Экспорт
	Если ЗначениеЗаполнено(ХозяйственнаяОперация) ТОгда
		Возврат;
	КонецЕсли;
	
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТоварыКОтгрузке;
	
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	лЗаказМатериаловВПроизводство=Неопределено;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Если ТипЗнч(СтрокаТаблицы.ДокументОтгрузки)=Тип("ДокументСсылка.ЗаказМатериаловВПроизводство") Тогда
			лЗаказМатериаловВПроизводство=СтрокаТаблицы.ДокументОтгрузки;
			Прервать;
		КонецЕсли;
		
		
	КонецЦикла;
	Если лЗаказМатериаловВПроизводство=Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ДокументОтгрузки",лЗаказМатериаловВПроизводство);
	НайденыеТовары=Таблица.НайтиСтроки(СтруктураОтбора);
	
	
	
	НовоеРаспоряжение					=лЗаказМатериаловВПроизводство.ПолучитьОбъект();
	НовоеРаспоряжение.Дата				=Дата;
	Если ЗначениеЗаполнено(ДатаДляТиповыхДокументов) Тогда
		  НовоеРаспоряжение.Дата				=ДатаДляТиповыхДокументов;		
	КонецЕсли;
	НовоеРаспоряжение.ПометкаУдаления	=Ложь;				
	НовоеРаспоряжение.Товары.Очистить();
	
	Для каждого Товар Из НайденыеТовары Цикл
		НовыйТовар							=НовоеРаспоряжение.Товары.Добавить();
		НовыйТовар.Номенклатура				=Товар.Номенклатура;
		НовыйТовар.Характеристика			=Товар.Характеристика;
		НовыйТовар.Количество				=Товар.КОтгрузке;
		НовыйТовар.КоличествоУпаковок		=Товар.КОтгрузке;				
		НовыйТовар.ВариантОбеспечения		=Перечисления.ВариантыОбеспечения.Отгрузить;
		НовыйТовар.НачалоОтгрузки			=Дата;
		НовыйТовар.ОкончаниеПоступления		=Дата; 
	КонецЦикла;
	
	Ошибка=Неопределено;
	Попытка 				
		НовоеРаспоряжение.ПометкаУдаления=Ложь;
		НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 	
	Исключение
		Отказ=Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
	КонецПопытки;	
	
	Если Не Отказ Тогда
		СоздатьДокументДвижениеМатериалов(лЗаказМатериаловВПроизводство,Отказ);	
	КонецЕсли;
	
КонецПроцедуры 

Процедура СоздатьДокументДвижениеМатериалов(ЗаказМатериаловВПроизводство,Отказ)		
	
	
	НовыйДокОбъект 					= Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	НовыйДокОбъект.Дата 			= Дата;		
	Если ЗначениеЗаполнено(ДатаДляТиповыхДокументов) Тогда
		  НовыйДокОбъект.Дата				=ДатаДляТиповыхДокументов;		
	КонецЕсли;

	Массив 							= Новый Массив();
	Массив.Добавить(ЗаказМатериаловВПроизводство);		
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
	Массив, ЗаказМатериаловВПроизводство.ХозяйственнаяОперация);
	
	
	ДанныеЗаполнения = ПараметрыОткрытия.Основание;
	ДанныеЗаполнения.Вставить("Товары", ЗаказМатериаловВПроизводство.Товары.Выгрузить());
	НовыйДокОбъект.Заполнить(ДанныеЗаполнения);
	НовыйДокОбъект.Лико_Документ=Ссылка;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Статус=Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	ПередачаМатериаловВКладовую=НайтиДокументПередачиМатериаловВКладовую(ЗаказМатериаловВПроизводство);
	Если  ЗначениеЗаполнено(ПередачаМатериаловВКладовую)  Тогда
		УжеСозданныйДокументОбъект = ПередачаМатериаловВКладовую.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки()); 			
		ВызватьИсключение;
	КонецПопытки;		
КонецПроцедуры

Функция НайтиДокументПередачиМатериаловВКладовую(ЗаказМатериаловВПроизводство) //+Лико m.shenderov 30.05.2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеПродукцииИМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Лико_Документ = &Лико_Документ
	|	И ДвижениеПродукцииИМатериалов.Распоряжение = &Распоряжение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДвижениеПродукцииИМатериалов.Дата";
	Запрос.УстановитьПараметр("Лико_Документ",Ссылка);
	Запрос.УстановитьПараметр("Распоряжение",ЗаказМатериаловВПроизводство);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка; 	
	КонецЦикла;	
	
КонецФункции //-Лико m.shenderov 30.05.2019 

#КонецОбласти



#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	Если Не ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении") Тогда
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			//Массив.Добавить(Движения.ТоварыКОтгрузке);
			//Движения.ТоварыКОтгрузке.ДополнительныеСвойства.Вставить("ЗапретитьКонтрольДвиженияТоварыКОтгрузкеИзменениеСводно", Истина);
			//Массив.Добавить(Движения.ТоварыНаСкладах);
			//Массив.Добавить(Движения.ТоварыКОтбору);  		
			Массив.Добавить(Движения.ТоварыВЯчейках);
			
			
			
		КонецЕсли;
	КонецЕсли;
	
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

Процедура ПроверитьОрдерныйСклад(Отказ)
	
	Если Не СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Склад, Дата) Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='На складе ""%Склад%"" на %Дата% не используется ордерная схема при поступлении.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Склад%",Склад);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Дата%",Формат(Дата, "ДЛФ=D"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСписокЗависимыхЗаказовПоставщикам()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ЗаказПоставщику КАК ЗаказПоставщику
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПоставщику.Ссылка КАК ЗаказПоставщику
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|	ГДЕ
	|		ЗаказПоставщику.Ссылка В(&МассивЗаказов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказПоставщику.Ссылка
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|	ГДЕ
	|		ЗаказПоставщику.Ссылка В
	|				(ВЫБРАТЬ
	|					Ордер.Распоряжение
	|				ИЗ
	|					Документ.ПриходныйОрдерНаТовары КАК Ордер
	|				ГДЕ
	|					Ордер.Ссылка = &Ссылка)) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("МассивЗаказов", ЭтотОбъект.Распоряжение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Запрос.Выполнить();
	
	МассивЗависимыхЗаказов = Результат.Выгрузить().ВыгрузитьКолонку("ЗаказПоставщику");
	ЭтотОбъект.ДополнительныеСвойства.Вставить("МассивЗависимыхЗаказовПоставщикам", Новый ФиксированныйМассив(МассивЗависимыхЗаказов));
	
КонецПроцедуры

//+ o.pukhova 20.08.2020
Процедура ЗакрытиеЗаявокДизайнерам()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	 |	Лико_ЗаявкаНаДизайн.ЗаказКлиента КАК ЗаказКлиента,
	 |	Лико_ЗаявкаНаДизайн.СтатусЗаявки КАК СтатусЗаявки,
	 |	Лико_ЗаявкаНаДизайн.Ссылка КАК ЗаявкаНаДизайн
	 |ИЗ
	 |	Документ.Лико_ЗаявкаНаДизайн КАК Лико_ЗаявкаНаДизайн
	 |ГДЕ
	 |	Лико_ЗаявкаНаДизайн.ЗаказКлиента = &ЗаказКлиента
	 |	И Лико_ЗаявкаНаДизайн.СтатусЗаявки <> &Закрыт";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказПокупателя);
	Запрос.УстановитьПараметр("Закрыт", Перечисления.Лико_СтатусыЗаявкиНаДизайн.Закрыта); 
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() <> 0 Тогда
		Для Каждого Заявка Из Результат Цикл
			
			ОбъектЗаявкиНаДизайн = Заявка.ЗаявкаНаДизайн.ПолучитьОбъект();
			ОбъектЗаявкиНаДизайн.СтатусЗаявки = Перечисления.Лико_СтатусыЗаявкиНаДизайн.Закрыта;
			ОбъектЗаявкиНаДизайн.Записать();
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
//- o.pukhova 20.08.2020

Функция НайтиЭтап260521()
	Результат= Неопределено;	
	Запрос = Новый Запрос;
	Если СвязатьСЭтапом Тогда
		Возврат Распоряжение;
	КонецЕсли;
	ДокументОснование=ЗаказПокупателя;
	//Если ЗаказПокупателя.ДавальческоеСырье Тогда
	Если  Лико_ОбщегоНазначенияСервер.ЭтоЗаказНаПереработку(ЗаказПокупателя) Тогда 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказДавальца.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказДавальца КАК ЗаказДавальца
		|ГДЕ
		|	ЗаказДавальца.Проведен
		|	И ЗаказДавальца.Лико_ЗаказКлиента = &Лико_ЗаказКлиента";
		Запрос.УстановитьПараметр("Лико_ЗаказКлиента",ЗаказПокупателя);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОснование=Выборка.Ссылка;
		КонецЦикла; 
	КонецЕсли;	



	Если НомерПроката<>0 Тогда	
		Если РабочийЦентр.Лико_Площадка<>ЗаказПокупателя.Площадка Тогда
			Возврат  Лико_Дополнительно.НайтиИлиСоздатьОбщийВыпускающийЭтапНаМесяц(Организация,Дата,Подразделение);
		КонецЕсли;



		НуженВыпускающийЭтап=ФиксироватьВыпуск и Выпуск.НайтиСтроки(Новый Структура("ПромежуточныйВыпуск",Истина)).Количество()=0;  		
		Если ЗаказПокупателя.ТипЗаказа=Перечисления.Лико_ТипыЗаказов.Полуфабрикат И
			Выпуск.Количество()>0 и
			ЗаказПокупателя.Товары.Количество()>0 И
			ЗаказПокупателя.Товары[0].Номенклатура=Выпуск[0].Номенклатура Тогда
			НуженВыпускающийЭтап=Истина;			
		КонецЕсли;


		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|ГДЕ
		|	ЭтапПроизводства2_2.Распоряжение.ДокументОснование = &ДокументОснование
		|	И ВЫБОР                                   
		|			КОГДА &НуженВыпускающийЭтап
		|				ТОГДА ЭтапПроизводства2_2.НомерСледующегоЭтапа = 0
		|			ИНАЧЕ ЭтапПроизводства2_2.НомерПроката = &НомерПроката
		|		КОНЕЦ
		|	И ЭтапПроизводства2_2.Проведен
		|	И ЭтапПроизводства2_2.Организация = &Организация
		|	И НЕ ЭтапПроизводства2_2.ПометкаУдаления";
		Запрос.УстановитьПараметр("НомерПроката",НомерПроката);
		Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
		Запрос.УстановитьПараметр("Организация",РабочийЦентр.Лико_Площадка.Организация);
		Запрос.УстановитьПараметр("НуженВыпускающийЭтап",НуженВыпускающийЭтап);


		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.ссылка;
		КонецЦикла; 
	Иначе
		Если РабочийЦентр= Справочники.РабочиеЦентры.НайтиПоНаименованию("Перемотка") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
			|ГДЕ
			|	ЭтапПроизводства2_2.Распоряжение.ДокументОснование = &ДокументОснование
			|	И ЭтапПроизводства2_2.ВидЭтапа = &ВидЭтапа
			|	И ЭтапПроизводства2_2.Проведен
			|	И ЭтапПроизводства2_2.Организация = &Организация";
			Запрос.УстановитьПараметр("ВидЭтапа",Справочники.Лико_ВидыЭтаповПроизводства.Перемотка );
			Запрос.УстановитьПараметр("ДокументОснование",ЗаказПокупателя);
			Запрос.УстановитьПараметр("Организация",РабочийЦентр.Лико_Площадка.Организация);

			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.ссылка;
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;



	Возврат Результат;	
КонецФункции

Функция НайтиЭтап()
	Результат= Неопределено;	
	Запрос = Новый Запрос;
	Если СвязатьСЭтапом Тогда
		Возврат Распоряжение;
	КонецЕсли;
	ДокументОснование=ЗаказПокупателя;
	//Если ЗаказПокупателя.ДавальческоеСырье Тогда
	Если  Лико_ОбщегоНазначенияСервер.ЭтоЗаказНаПереработку(ЗаказПокупателя) Тогда 

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказДавальца.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказДавальца КАК ЗаказДавальца
		|ГДЕ
		|	ЗаказДавальца.Проведен
		|	И ЗаказДавальца.Лико_ЗаказКлиента = &Лико_ЗаказКлиента";
		Запрос.УстановитьПараметр("Лико_ЗаказКлиента",ЗаказПокупателя);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОснование=Выборка.Ссылка;
		КонецЦикла; 
	КонецЕсли;	



	Если НомерПроката<>0 Тогда	
		Если РабочийЦентр.Лико_Площадка<>ЗаказПокупателя.Площадка Тогда
			//Возврат  Лико_Дополнительно.НайтиИлиСоздатьОбщийВыпускающийЭтапНаМесяц(Организация,Дата,Подразделение);
			//Возврат Неопределено;
		КонецЕсли;



		НуженВыпускающийЭтап=ФиксироватьВыпуск и Выпуск.НайтиСтроки(Новый Структура("ПромежуточныйВыпуск",Истина)).Количество()=0;  		
		Если ЗаказПокупателя.ТипЗаказа=Перечисления.Лико_ТипыЗаказов.Полуфабрикат И
			Выпуск.Количество()>0 и
			ЗаказПокупателя.Товары.Количество()>0 И
			ЗаказПокупателя.Товары[0].Номенклатура=Выпуск[0].Номенклатура Тогда
			НуженВыпускающийЭтап=Истина;			
		КонецЕсли;


		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|ГДЕ
		|	ЭтапПроизводства2_2.Распоряжение.ДокументОснование = &ДокументОснование
		|	И ВЫБОР                                   
		|			КОГДА &НуженВыпускающийЭтап
		|				ТОГДА ЭтапПроизводства2_2.НомерСледующегоЭтапа = 0
		|			ИНАЧЕ ЭтапПроизводства2_2.НомерПроката = &НомерПроката
		|		КОНЕЦ
		|	И ЭтапПроизводства2_2.Проведен
		//|	И ЭтапПроизводства2_2.Организация = &Организация
		|	И НЕ ЭтапПроизводства2_2.ПометкаУдаления";
		Запрос.УстановитьПараметр("НомерПроката",НомерПроката);
		Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
		//Запрос.УстановитьПараметр("Организация",РабочийЦентр.Лико_Площадка);
		Запрос.УстановитьПараметр("НуженВыпускающийЭтап",НуженВыпускающийЭтап);


		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.ссылка;
		КонецЦикла; 
	Иначе
		Если РабочийЦентр= Справочники.РабочиеЦентры.НайтиПоНаименованию("Перемотка") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
			|ГДЕ
			|	ЭтапПроизводства2_2.Распоряжение.ДокументОснование = &ДокументОснование
			|	И ЭтапПроизводства2_2.ВидЭтапа = &ВидЭтапа
			|	И ЭтапПроизводства2_2.Проведен
			|	И ЭтапПроизводства2_2.Организация = &Организация";
			Запрос.УстановитьПараметр("ВидЭтапа",Справочники.Лико_ВидыЭтаповПроизводства.Перемотка );
			Запрос.УстановитьПараметр("ДокументОснование",ЗаказПокупателя);
			Запрос.УстановитьПараметр("Организация",РабочийЦентр.Лико_Площадка.Организация);

			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.ссылка;
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;



	Возврат Результат;	
КонецФункции

  

Процедура ОпределитьТипРаспоряжения(ТипРаспоряжения, Отказ)
	
	ТипРаспоряжения="ЭтапПроизводства";
	ЕстьРаспоряжениеЭтап   =Ложь;
	ЕстьРаспоряжениеСборка =Ложь;
	//Если РабочийЦентр.Наименование="Резак Kampf" Или РабочийЦентр.Наименование="Резак Kampf2"   Тогда
	//		ТипРаспоряжения="СборкаТоваров";
	//Возврат;		
	//КонецЕсли;
	
	Для каждого СтрокаВыпуска Из Выпуск Цикл
		
		Если СтрокаВыпуска.Номенклатура.ВидНоменклатуры<>
			Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра
			Тогда
			ТипРаспоряжения="СборкаТоваров";
		Иначе
			Если ТипРаспоряжения="СборкаТоваров" Тогда
				Отказ=Истина;
				ТипРаспоряжения=Неопределено;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр(
				"ru = 'Нельзя в одном документе оформлять выпуск незавершенной продукции и материала!'"), ,
				"Объект.Выпуск");
				
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ЗаказПокупателя.ТипЗаказа=Перечисления.Лико_ТипыЗаказов.Полуфабрикат И  Не РабочийЦентр.Лико_Резак Тогда
		//Если РабочийЦентр.ПорядковыйНомер=20 Или РабочийЦентр.ПорядковыйНомер=300 Или РабочийЦентр.ПорядковыйНомер=21  Тогда
		//	Если 	ТипРаспоряжения="СборкаТоваров" Тогда
		//		
		//	КонецЕсли;
		Если Не СвязатьСЭтапом Тогда
			ФиксироватьВыпуск=Истина; 
		КонецЕсли;
		ТипРаспоряжения="ЭтапПроизводства";
	КонецЕсли;
	
	Если ЗаказПокупателя.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.ТестированиеМатериалов Тогда
		ТипРаспоряжения="СписаниеНаРасходы"
	КонецЕсли;
	
	
	Если РабочийЦентр.Лико_Резак и
		Не (ЗначениеЗаполнено(Распоряжение) И ТипЗнч(Распоряжение)=Тип("ДокументСсылка.ЭтапПроизводства2_2"))  Тогда
		ТипРаспоряжения="СборкаТоваров"
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда
		ТипРаспоряжения="СборкаТоваров"
	КонецЕсли;
	
	Если РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Перемотка ТОгда
		Если Товары.Количество()>0 Тогда 
			ЭтоСборка=Ложь;			
			Для каждого Товар Из Товары Цикл 		
				Если 	Товар.Списать Тогда
					Структура = Новый Структура;
					Структура.Вставить("Номенклатура",Товар.Номенклатура);
					
					Если Выпуск.НайтиСтроки(Структура).Количество()>0 Тогда 
						
						ЭтоСборка=Истина;
						Прервать;
					КонецЕсли;   	
				КонецЕсли;
				
			КонецЦикла;	
			
			Если ЭтоСборка Тогда
				ТипРаспоряжения="СборкаТоваров"
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) 
		И ЗначениеЗаполнено(НомерПроката) 
		И Выпуск.Количество()=0 Тогда
		
		ТипРаспоряжения="ЭтапПроизводства";
		
	КонецЕсли;   
	
	
	
КонецПроцедуры


// Процедура формирования движений по регистру "Лико_ЗакрытиеБланка".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура ОтразитьЛико_ЗакрытиеБланка(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ЗакрытиеБланка;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЛико_ЗакрытиеБланка = Движения.Лико_ЗакрытиеБланка;
	ДвиженияЛико_ЗакрытиеБланка.Записывать = Истина;
	ДвиженияЛико_ЗакрытиеБланка.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура формирования движений по регистру "Лико_ПартииКликов".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура ОтразитьЛико_ПартииКликов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ПартииКликов;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЛико_ЛикоПартииКликов = Движения.ЛикоПартииКликов;
	ДвиженияЛико_ЛикоПартииКликов.Записывать = Истина;
	ДвиженияЛико_ЛикоПартииКликов.Загрузить(Таблица);
	
КонецПроцедуры




// Процедура формирования движений по регистру "Лико_ТоварыКРаспределению".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура ОтразитьЛико_Лико_ТоварыКРаспределению(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ТоварыКРаспределению;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения_Лико_ТоварыКРаспределению = Движения.Лико_ТоварыКРаспределению;
	Движения_Лико_ТоварыКРаспределению.Записывать = Истина;
	Движения_Лико_ТоварыКРаспределению.Загрузить(Таблица);
	
КонецПроцедуры






//Процедура формирования движений по регистру "Лико_СписаниеНаЗаказ".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура Отразить_Лико_СписаниеНаЗаказ(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_СписаниеНаЗаказ;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения_Лико_СписаниеНаЗаказ = Движения.Лико_СписаниеНаЗаказ;
	Движения_Лико_СписаниеНаЗаказ.Записывать = Истина;
	Движения_Лико_СписаниеНаЗаказ.Загрузить(Таблица);
	
КонецПроцедуры



// Процедура формирования движений по регистру "Лико_ЗатратыПоЗаказу".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура ОтразитьЛико_Лико_ТоварыЗатратыПоЗаказу(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Возврат;
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ЗатратыПоЗаказу;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения_Лико_ЗатратыПоЗаказу = Движения.Лико_ЗатратыПОЗаказу;
	Движения_Лико_ЗатратыПоЗаказу.Записывать = Истина;
	Движения_Лико_ЗатратыПоЗаказу.Загрузить(Таблица);
	
КонецПроцедуры


//Процедура по формированию движений по расчетным затратам лаков/красок

Процедура ЗаполнитьРасчетныеЗатратыПоЛакамКраскам()
	
	Движения.Лико_ЗатратыПоЗаказу.Записывать = Истина;
	Движения.Лико_ЗатратыПоЗаказу.Записать();
	Движения.Лико_ТоварыКРаспределению.Записать();
	
	//НаборЗаписей = РегистрыНакопления.Лико_ЗатратыПоЗаказу.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	//НаборЗаписей.Прочитать();
	
	//	НаборЗаписей.Записать();
	
	//Заполняем краски лаки
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Лико_ЗатратыПоЗаказу.Период КАК Период,
	|	Лико_ЗатратыПоЗаказу.Регистратор КАК Регистратор,
	|	Лико_ЗатратыПоЗаказу.ЗаказКлиента КАК ЗаказКлиента,
	|	МАКСИМУМ(Лико_ЗатратыПоЗаказу.РабочийЦентр) КАК РабочийЦентр,
	|	МИНИМУМ(Лико_ЗатратыПоЗаказу.НомерПроката) КАК НомерПроката,
	|	СУММА(Лико_ЗатратыПоЗаказу.Количество) КАК Количество,
	|	СУММА(Лико_ЗатратыПоЗаказу.КоличествоПМ) КАК КоличествоПМ
	|ИЗ
	|	РегистрНакопления.Лико_ЗатратыПоЗаказу КАК Лико_ЗатратыПоЗаказу
	|ГДЕ
	|	Лико_ЗатратыПоЗаказу.Регистратор = &Ссылка
	|	И Лико_ЗатратыПоЗаказу.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗатратыПоЗаказу.Период,
	|	Лико_ЗатратыПоЗаказу.Регистратор,
	|	Лико_ЗатратыПоЗаказу.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ТоварыКРаспределению.Период,
	|	Лико_ТоварыКРаспределению.Регистратор,
	|	Лико_ТоварыКРаспределению.ЗаказКлиента,
	|	Лико_ТоварыКРаспределению.РабочийЦентр,
	|	Лико_ТоварыКРаспределению.НомерПроката,
	|	СУММА(Лико_ТоварыКРаспределению.КоличествоУУ),
	|	СУММА(Лико_ТоварыКРаспределению.Количество)
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКРаспределению КАК Лико_ТоварыКРаспределению
	|ГДЕ
	|	Лико_ТоварыКРаспределению.Регистратор = &ссылка
	|	И Лико_ТоварыКРаспределению.Номенклатура.ВидНоменклатуры В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				Лико_ПредопределенныеЗначения.ЗначениеПараметра КАК ЗначениеПараметра
	|			ИЗ
	|				Справочник.Лико_ПредопределенныеЗначения КАК Лико_ПредопределенныеЗначения
	|			ГДЕ
	|				Лико_ПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция))
	|	И НЕ Лико_ТоварыКРаспределению.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка ЕСТЬ NULL
	|	И НЕ Лико_ТоварыКРаспределению.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка = ЗНАЧЕНИЕ(Документ.Лико_БланкЭтапа.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ТоварыКРаспределению.Период,
	|	Лико_ТоварыКРаспределению.Регистратор,
	|	Лико_ТоварыКРаспределению.ЗаказКлиента,
	|	Лико_ТоварыКРаспределению.РабочийЦентр,
	|	Лико_ТоварыКРаспределению.НомерПроката";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.выполнить().Выбрать();
	Пока Выборка.Следующий()  Цикл
		РабочийЦентр = Выборка.рабочийЦентр;
		ТЗ = Лико_Планирование.ПолучитьСтоимостьКраскиЛаков(Выборка.ЗаказКлиента,"Документ.ЗаказКлиента", Выборка.Количество, Выборка.КоличествоПМ, 1, НачалоМесяца(Выборка.Период), Выборка.НомерПроката, Истина);
		Для каждого стр ИЗ ТЗ Цикл
			Запись = Движения.Лико_ЗатратыПоЗаказу.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, стр, "Затрата, СтатьяЗатрат, НомерПроката, Грамматура, ПроцентЗаливки");
			Запись.КоличествоПлан = стр.Количество;
			Запись.СуммаПлан = стр.сумма;
			ЗаполнитьЗначенияСвойств(Запись, Выборка, "Регистратор, ЗаказКлиента, Период,РабочийЦентр");
		КонецЦикла;
	КонецЦикла;
	
	//Стоимость клея для ТУ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ТоварыКРаспределениюОбороты.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ТоварыКРаспределениюОбороты.ЗаказКлиента.Ручьи КАК Ручьи,
	|	СУММА(Лико_ТоварыКРаспределениюОбороты.КоличествоОборот) КАК КоличествоПМ,
	|	Лико_ТоварыКРаспределениюОбороты.Регистратор КАК Регистратор,
	|	Лико_ТоварыКРаспределениюОбороты.Период КАК Период,
	|	Лико_ТоварыКРаспределениюОбороты.РабочийЦентр КАК РабочийЦентр
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКРаспределению.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал = ИСТИНА
	|				И РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.СклейкаТермоусадки)) КАК Лико_ТоварыКРаспределениюОбороты
	|ГДЕ
	|	Лико_ТоварыКРаспределениюОбороты.Регистратор = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ТоварыКРаспределениюОбороты.ЗаказКлиента,
	|	Лико_ТоварыКРаспределениюОбороты.ЗаказКлиента.Ручьи,
	|	Лико_ТоварыКРаспределениюОбороты.Регистратор,
	|	Лико_ТоварыКРаспределениюОбороты.Период,
	|	Лико_ТоварыКРаспределениюОбороты.РабочийЦентр";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.выполнить().Выбрать();
	Пока Выборка.Следующий()  Цикл
		ВыборкаКлеяТУ = Лико_Планирование.ПолучитьСтоимостьКлеяТУ(Выборка.ЗаказКлиента,1, Выборка.КоличествоПМ, Дата, Выборка.Ручьи  );
		Запись = Движения.Лико_ЗатратыПоЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаКлеяТУ, "Затрата, СтатьяЗатрат, НомерПроката");
		Запись.КоличествоПлан = ВыборкаКлеяТУ.Количество;
		Запись.СуммаПлан = ВыборкаКлеяТУ.сумма;
		ЗаполнитьЗначенияСвойств(Запись, Выборка, "Регистратор, ЗаказКлиента, Период,РабочийЦентр");
	КонецЦикла;
	
	
	
	//Стоимость Клея
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗатратыПоЗаказу.Период КАК Период,
	|	Лико_ЗатратыПоЗаказу.Регистратор КАК Регистратор,
	|	Лико_ЗатратыПоЗаказу.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ЗатратыПоЗаказу.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ЗатратыПоЗаказу.НомерПроката КАК НомерПроката,
	|	Лико_ЗатратыПоЗаказу.ВидРабот КАК ВидРабот,
	|	Лико_ЗатратыПоЗаказу.НомерРаботы КАК НомерРаботы,
	|	СУММА(Лико_ЗатратыПоЗаказу.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.КлейФакт <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.КлейФакт <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.КлейФакт <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗаказКлиентаВидыРабот.КлейФакт
	|		ИНАЧЕ ЗаказКлиентаВидыРабот.Клей
	|	КОНЕЦ КАК Клей,
	|	СУММА(ЗаказКлиентаВидыРабот.ПроцентЗаливки) КАК ПроцентЗаливки,
	|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение) КАК КоэффициентПереноса
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.Лико_ЗатратыПоЗаказу КАК Лико_ЗатратыПоЗаказу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|		ПО Лико_ЗатратыПоЗаказу.ЗаказКлиента = ЗаказКлиентаВидыРабот.Ссылка
	|			И Лико_ЗатратыПоЗаказу.ВидРабот = ЗаказКлиентаВидыРабот.ВидРабот
	|			И Лико_ЗатратыПоЗаказу.НомерРаботы = ЗаказКлиентаВидыРабот.НомерРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_КоэффициентыКраскоПереноса.ВидыРабот КАК Лико_КоэффициентыКраскоПереносаВидыРабот
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
	|			ПО Лико_КоэффициентыКраскоПереносаВидыРабот.Ссылка = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
	|			ПО Лико_КоэффициентыКраскоПереносаВидыРабот.Ссылка = Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Коэффициент
	|		ПО Лико_ЗатратыПоЗаказу.ВидРабот = Лико_КоэффициентыКраскоПереносаВидыРабот.ВидРабот
	|ГДЕ
	|	Лико_ЗатратыПоЗаказу.Регистратор = &Ссылка
	|	И Лико_ЗатратыПоЗаказу.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы)
	|	И (ЗаказКлиентаВидыРабот.Клей <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.Клей <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.Клей <> НЕОПРЕДЕЛЕНО
	|			ИЛИ ЗаказКлиентаВидыРабот.КлейФакт <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.КлейФакт <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.КлейФакт <> НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗатратыПоЗаказу.Период,
	|	Лико_ЗатратыПоЗаказу.Регистратор,
	|	Лико_ЗатратыПоЗаказу.ЗаказКлиента,
	|	Лико_ЗатратыПоЗаказу.РабочийЦентр,
	|	Лико_ЗатратыПоЗаказу.НомерПроката,
	|	Лико_ЗатратыПоЗаказу.ВидРабот,
	|	Лико_ЗатратыПоЗаказу.НомерРаботы,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.КлейФакт <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.КлейФакт <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				И ЗаказКлиентаВидыРабот.КлейФакт <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗаказКлиентаВидыРабот.КлейФакт
	|		ИНАЧЕ ЗаказКлиентаВидыРабот.Клей
	|	КОНЕЦ,
	|	ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Период КАК Период,
	|	ВТ.Регистратор КАК Регистратор,
	|	ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ.НомерПроката КАК НомерПроката,
	|	ВТ.РабочийЦентр КАК РабочийЦентр,
	|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Клей) КАК СтатьяЗатрат,
	|	ВТ.ВидРабот КАК ВидРабот,
	|	ВТ.НомерРаботы КАК НомерРаботы,
	|	ВТ.Клей КАК Затрата,
	|	ВТ.Количество * ВЫБОР
	|		КОГДА ВТ.ПроцентЗаливки = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ.ПроцентЗаливки / 100
	|	КОНЕЦ * ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение), ВТ.КоэффициентПереноса) / 1000 КАК КоличествоПлан,
	|	ВТ.Количество * ВЫБОР
	|		КОГДА ВТ.ПроцентЗаливки = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ.ПроцентЗаливки / 100
	|	КОНЕЦ * ЕСТЬNULL(ЕСТЬNULL(Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение, Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Значение), ВТ.КоэффициентПереноса) / 1000 * ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена) КАК СуммаПлан,
	|	ВТ.ПроцентЗаливки КАК ПроцентЗаливки
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ВТ.Клей ССЫЛКА Справочник.ЦеновыеГруппы
	|					ТОГДА ВТ.Клей = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|				КОГДА ВТ.Клей ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ВТ.Клей.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				&Дата,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО (ВЫБОР
	|				КОГДА ВТ.Клей ССЫЛКА Справочник.ЦеновыеГруппы
	|					ТОГДА ВТ.Клей = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|				КОГДА ВТ.Клей ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ВТ.Клей.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ВТ.Клей ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ВТ.Клей.ЦеноваяГруппа = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент
	|				ИНАЧЕ ВТ.Клей = Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Коэффициент
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(&Дата, Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних1
	|		ПО (ВЫБОР
	|				КОГДА ВТ.Клей ССЫЛКА Справочник.Номенклатура
	|					ТОГДА ВТ.Клей.ЦеноваяГруппа = Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Коэффициент
	|				ИНАЧЕ ВТ.Клей = Лико_ЗначенияКоэффициентовПереносаСрезПоследних1.Коэффициент
	|			КОНЕЦ)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Ссылка.Дата));
	Запрос.УстановитьПараметр("Площадка",Организация );
	Запрос.УстановитьПараметр("ПлощадкаЛикофлекс",Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Движения.Лико_ЗатратыПоЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;	
	
КонецПроцедуры


// Процедура формирования движений по регистру "Лико_ЗатратыПоЗаказу".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура Отразить_Лико_ЗатратыПоЗаказуДляОтгрузки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ЗатратыПоЗаказуДляОтгрузки;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения_Лико_ЗатратыПоЗаказу = Движения.Лико_ЗатратыПоЗаказуДляОтгрузки;
	Движения_Лико_ЗатратыПоЗаказу.Записывать = Истина;
	Движения_Лико_ЗатратыПоЗаказу.Загрузить(Таблица);
	
	Движения_Лико_ЗатратыПоЗаказуДляВыпуска = Движения.Лико_ЗатратыПоЗаказуДляВыпуска;
	Движения_Лико_ЗатратыПоЗаказуДляВыпуска.Записывать = Истина;
	Движения_Лико_ЗатратыПоЗаказуДляВыпуска.Загрузить(Таблица);


КонецПроцедуры

//Начало Иванова 20191030
// Процедура формирования движений по регистру "Лико_ПромежуточныйВыпуск".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства для записи движений 
//	Движения - КоллекцияДвижений - движения по которым двигается документ
//	Отказ - Булево - признак отказа от проведения документа
//
Процедура Отразить_Лико_ПромежуточныйВыпуск(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ПромежуточныйВыпуск;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения_Лико_ПромежуточныйВыпуск = Движения.Лико_ПромежуточныйВыпуск;
	Движения_Лико_ПромежуточныйВыпуск.Записывать = Истина;
	Движения_Лико_ПромежуточныйВыпуск.Загрузить(Таблица);
	
	
		
	
	
КонецПроцедуры
//Конец Иванова 20191030


Процедура ПроверитьНаличиеРаспоряжения();  //+Лико m.shenderov 15.12.2017
	Если НЕ ЗначениеЗаполнено(Распоряжение) или ТипЗнч(Распоряжение)<> Тип("ДокументСсылка.СборкаТоваров") Тогда
		Распоряжение=Документы.СборкаТоваров.ПолучитьСсылку();
	КонецЕсли;
КонецПроцедуры //-Лико m.shenderov 15.12.2017 


Процедура ОбработатьРаспоряжение (РежимЗаписи,Отказ) 
	
	СтруктураДанных=СтруктураДанныхДляЗаполненияРаспоряжения();	
	
	
	СтруктураДанных.Комментарий="Создан в проведении документа: "+ Ссылка; 
	СоздатьРедактироватьРаспоряжениеДляСкладскихОпераций(Распоряжение,СтруктураДанных,РежимЗаписи,Отказ);
	
	
	
КонецПроцедуры 



Функция СтруктураДанныхДляЗаполненияРаспоряжения() 
	Структура = Новый Структура; 	
	
	Структура.Вставить("Распоряжение",Распоряжение);
	Структура.Вставить("Дата",Дата);
	Структура.Вставить("Организация",Организация);
	Структура.Вставить("Подразделение",Подразделение);
	//Структура.Вставить("Проведен",Ложь);
	Структура.Вставить("ПометкаУдаления",Ложь);  	
	Структура.Вставить("Товары",Выпуск.Выгрузить());
	Структура.Вставить("Ответственный",АвторДокумента);
	Структура.Вставить("Комментарий"); 
	Структура.Вставить("Склад",Склад);
	КоличествоУУ=0;
	Для каждого Товар Из Товары Цикл
		КоличествоУУ=КоличествоУУ+Товар.КоличествоУУ ;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасходУУ) КАК КоличествоУУ
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура.Вставить("Номенклатура",Выборка.Номенклатура); 
		Структура.Вставить("Характеристика",Выборка.Характеристика); 
		Структура.Вставить("Количество",Выборка.КоличествоУУ);
		Структура.Вставить("КоличествоУпаковок",Выборка.КоличествоУУ);
		
		
	КонецЦикла; 
	
	
	
	//Структура.Вставить("Номенклатура",Товары[0].Номенклатура); 
	//Структура.Вставить("Характеристика",Товары[0].Характеристика); 
	//Структура.Вставить("Количество",КоличествоУУ);
	//Структура.Вставить("КоличествоУпаковок",КоличествоУУ); 
	
	Структура.Вставить("Статус",Перечисления.СтатусыСборокТоваров.СобраноРазобрано); 
	Структура.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.РазборкаТоваров); 
	Структура.Вставить("СборкаПодДеятельность",Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС); 
	
	Возврат Структура; 			
КонецФункции 


Процедура СоздатьРедактироватьРаспоряжениеДляСкладскихОпераций(Распоряжение,ДанныеЗаполнения,РежимЗаписи,Отказ) 
	
	
	СоздатьРедактироватьСборкаТоваров(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);
	
	
	
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			РаспоряжениеОбъект=Распоряжение.ПолучитьОбъект();
			Попытка
				
				РаспоряжениеОбъект.ПометкаУдаления=ДанныеЗаполнения.ПометкаУдаления; 
				РаспоряжениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина); 
				РаспоряжениеОбъект.Записать(РежимЗаписи);
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры 


Процедура СоздатьРедактироватьСборкаТоваров(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Или ДополнительныеСвойства.БылПроведен Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
		НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
		Если НовоеРаспоряжение=Неопределено Тогда
			НовоеРаспоряжение=Документы.СборкаТоваров.СоздатьДокумент();	
			НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 
		КонецЕсли;  				
	Иначе
		НовоеРаспоряжение=Документы.СборкаТоваров.СоздатьДокумент();	
		НовоеРаспоряжение.УстановитьСсылкуНового(ДанныеЗаполнения.Распоряжение); 				
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
	НовоеРаспоряжение.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	НовоеРаспоряжение.СборкаПодДеятельность=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	
	НовоеРаспоряжение.Товары.Очистить(); 	
	Для каждого Товар Из ДанныеЗаполнения.Товары Цикл
		НовыйТовар					=НовоеРаспоряжение.Товары.Добавить();
		НовыйТовар.Номенклатура		=Товар.Номенклатура;
		НовыйТовар.Характеристика	=Товар.Характеристика;
		НовыйТовар.Количество		=Товар.КоличествоУУ;
		НовыйТовар.КоличествоУпаковок=Товар.КоличествоУУ;
		НовыйТовар.ДоляСтоимости=НовыйТовар.Количество*1000;
	КонецЦикла;
	НаборЗаписей = РегистрыСведений.Лико_ОшибкиЗакрытияБланков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗакрытиеБланка.Установить(Ссылка);
	
	НоваяЗапись=НаборЗаписей.Добавить();
	НоваяЗапись.ЗакрытиеБланка=Ссылка;
	НаборЗаписей.Записать();
	
	НовоеРаспоряжение.Записать(); 
	
	Ошибка=Неопределено;
	Попытка 				
		//НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 
		
		
		
	Исключение
		
		Ошибка=ОписаниеОшибки();
	КонецПопытки;
	
	
	//Если Ошибка<>Неопределено Тогда
	//Попытка
	//	
	//		НаборЗаписей = РегистрыСведений.Лико_ОшибкиЗакрытияБланков.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ЗакрытиеБланка.Установить(Ссылка);
	//	НаборЗаписей.Отбор.Документ.Установить(Распоряжение);
	//	НоваяЗапись					=НаборЗаписей.Добавить();
	//	НоваяЗапись.ЗакрытиеБланка	=Ссылка;
	//	НоваяЗапись.Документ		=Распоряжение;
	//	НоваяЗапись.Период			=Дата;
	//	НоваяЗапись.Комментарий		=Ошибка;
	//	
	//	НаборЗаписей.Записать(Истина);
	//	
	//	Исключение
	//   Сообщить(ОписаниеОшибки());
	//КонецПопытки;	
	
	//КонецЕсли;
	//
	
	
	Распоряжение=НовоеРаспоряжение.Ссылка;
	
	
	
КонецПроцедуры 

Процедура ОбработатьПланРЦ() // --> Начало Лико Ефимов ЕВВ 07.01.2018 
	
	Если НЕ (ЗначениеЗаполнено(ЗаказПокупателя) И ЗначениеЗаполнено(РабочийЦентр)) Тогда
		Возврат;
	КонецЕсли;
	
	ПризнакРЦУбиратьИзПлана = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, РабочийЦентр, "ПриПроведенииЗакрытияЗаказаУбиратьИзПлана_a6e004e89332494bb2ce8bb196d1bdd4");
	ПризнакРЦУбиратьИзПлана = ?(ПризнакРЦУбиратьИзПлана = Неопределено, Ложь, ПризнакРЦУбиратьИзПлана);
	Если ПризнакРЦУбиратьИзПлана Тогда
		УстановилиПривелигерованныйРежим = Ложь;
		Если НЕ ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Истина);
			УстановилиПривелигерованныйРежим = Истина;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПооперационноеРасписание2_2.Этап КАК Этап,
		|	ПооперационноеРасписание2_2.Операция КАК Операция,
		|	ПооперационноеРасписание2_2.ИдентификаторОперации КАК ИдентификаторОперации,
		|	ПооперационноеРасписание2_2.НомерПартии КАК НомерПартии,
		|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
		|	ПооперационноеРасписание2_2.МодельРасписания КАК МодельРасписания,
		|	ПооперационноеРасписание2_2.МодельПланирования КАК МодельПланирования,
		|	ПооперационноеРасписание2_2.ЭтоУдалениеОперации КАК ЭтоУдалениеОперации,
		|	ПооперационноеРасписание2_2.Начало КАК Начало,
		|	ПооперационноеРасписание2_2.Окончание КАК Окончание,
		|	ПооперационноеРасписание2_2.ТактПараллельнойЗагрузки КАК ТактПараллельнойЗагрузки
		|ИЗ
		|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
		|ГДЕ
		|	(ВЫРАЗИТЬ(ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование КАК Документ.ЗаказКлиента)) = &ЗаказКлиента
		|	И ВЫБОР
		|			КОГДА &ВидРЦ = НЕОПРЕДЕЛЕНО
		|				ТОГДА ПооперационноеРасписание2_2.РабочийЦентр = &РабочийЦентр
		|			ИНАЧЕ ПооперационноеРасписание2_2.РабочийЦентр.ВидРабочегоЦентра = &ВидРЦ
		|		КОНЕЦ
		|	И ПооперационноеРасписание2_2.Выполнено = 0
		|	И НЕ ПооперационноеРасписание2_2.ЭтоУдалениеОперации";
		
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказПокупателя);
		Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);
		Запрос.УстановитьПараметр("ВидРЦ", Неопределено);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			// Попробуем найти по виду рабочего центра
			Запрос.УстановитьПараметр("ВидРЦ", РабочийЦентр.ВидРабочегоЦентра);
			РезультатЗапроса = Запрос.Выполнить();
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Лико_Дополнительно.ОтметитьВыполнениеЭтапаПлана(ВыборкаДетальныеЗаписи, Ссылка);
		КонецЦикла;
		Если УстановилиПривелигерованныйРежим И ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 07.01.2018 

Процедура ОбработатьЭтапЗаказа()
УстановитьПривилегированныйРежим(Истина);
Если РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Indigo  
	Или Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра Тогда		
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Или ЗаказПокупателя.Состояние=Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда
		
	Иначе
		 Подготовка=Документы.Лико_ПодготовкаМатериалов.ПолучитьДокумент(ЗаказПокупателя,НомерПроката);
		 Если ТипЗнч(Подготовка)=Тип("ДокументСсылка.Лико_ПодготовкаМатериалов") И Подготовка.НеСниматьРезервПослеЗакрытияБланка Тогда
			Возврат; 
		 КонецЕсли;
		ЗаказОбъект = ЗаказПокупателя.ПолучитьОбъект();
		ЗаказОбъект.Состояние = Перечисления. Лико_СостоянияЗаказов .Выполнен;
		Попытка
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись); 
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;	
КонецЕсли;
 


УстановитьПривилегированныйРежим(Ложь);


КонецПроцедуры




//Процедура перекидывает заказ на следующий этап
Процедура ПеренестиЗаказ()	Экспорт
	Площадка 				= ЗаказПокупателя.Площадка;
	Ответственный		 	= АвторДокумента;
	Запись 					= РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
	Запись.Период 			= Дата;
	Запись.Заказ 			=ЗаказПокупателя;
	Запись.Этап 			= Справочники.Лико_ЭтапыВыполненияЗаказа.ОкончаниеПечати;
	Запись.Площадка 		=  ЗаказПокупателя.Площадка;
	Если ЗначениеЗаполнено(НомерБланка) Тогда 
		Запись.НомерБланка = НомерБланка;
	Иначе	
		Запись.НомерБланка = 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(РабочийЦентр) Тогда 
		Запись.РабочийЦентр = РабочийЦентр;
	КонецЕсли;
	
	Запись.Ответственный = Сотрудник.ФизическоеЛицо;
	Если ЗначениеЗаполнено("Количество") Тогда 
		Запись.Количество = Выпуск.Итог("Количество");
	КонецЕсли;
	
	Запись.Записать();	
КонецПроцедуры

Процедура СнятиеСРезерва() //+Лико m.shenderov 16.01.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.Проведен
	|	И НЕ Лико_ПодготовкаМатериалов.ПометкаУдаления
	|	И Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказПокупателя );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект= Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("НеПроверятьЗаполнениеПолейНастройкаПечать",Истина);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	КонецЦикла; 
	
КонецПроцедуры //-Лико m.shenderov 16.01.2018


Функция ПроверитьВозможностьПроведенияДокумента(Документ, Объекты, РежимЗаписи, РежимПроведения, Расшифровка="") Экспорт
	
	Успех = Истина;
	
	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение и РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат Успех;
	КонецЕсли;
	
	Если РежимПроведения=РежимПроведенияДокумента.Оперативный Тогда
		Возврат Успех;
	КонецЕсли;
	
	ПроверкаДатыЗапретаРедактированияДокументов(Документ, Объекты, РежимЗаписи, РежимПроведения, Успех, Расшифровка);
	
	ПроверкаБолееПозднихПроведенныхДокументов(Документ, Объекты, РежимЗаписи, РежимПроведения, Успех, Расшифровка);
	
	//ПроверкаУникальностиЗакрытияЗаказа(Документ, Объекты, РежимЗаписи, РежимПроведения, Успех, Расшифровка);
	
	Возврат Успех;
	
КонецФункции //ПроверитьВозможностьПроведенияДокумента Экспорт



Процедура ПроверкаБолееПозднихПроведенныхДокументов(Документ, Объекты, РежимЗаписи, РежимПроведения, Успех, Расшифровка)
	
	ЗапросДокументов = Новый Запрос;
	
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЯССМ_ТоварыНаСкладахПоЯчейкамОбороты.Регистратор КАК Документ,
	|	ЯССМ_ТоварыНаСкладахПоЯчейкамОбороты.Регистратор.МоментВремени КАК РегистраторМоментВремени
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(&ДатаДокумента, , Регистратор, Серия В (&Объекты)) КАК ЯССМ_ТоварыНаСкладахПоЯчейкамОбороты
	|ГДЕ
	|	ЯССМ_ТоварыНаСкладахПоЯчейкамОбороты.Регистратор <> &ЭтотДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЯССМ_ТоварыНаСкладахПоЯчейкамОбороты.Регистратор,
	|	ЯССМ_ТоварыНаСкладахПоЯчейкамОбороты.Регистратор.МоментВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЯССМ_ТоварыНаСкладахПоЯчейкамОбороты.Регистратор.МоментВремени";
	
	ЗапросДокументов.УстановитьПараметр("ДатаДокумента", Документ.МоментВремени());
	ЗапросДокументов.УстановитьПараметр("ЭтотДокументСсылка", Документ.Ссылка);
	ЗапросДокументов.УстановитьПараметр("Объекты", Объекты);
	
	РезультатЗапросаДокументов = ЗапросДокументов.Выполнить();
	Если Не РезультатЗапросаДокументов.Пустой() Тогда
		
		ВыборкаЗапросаДокументов = РезультатЗапросаДокументов.Выбрать();
		Пока ВыборкаЗапросаДокументов.Следующий() Цикл
			
			Расшифровка = Расшифровка + Символы.ПС + "Вначале должен быть отменен документ : "+ВыборкаЗапросаДокументов.Документ+" !";
			Успех = Ложь;
			
		КонецЦикла;	//выборка запроса Документов
		
	КонецЕсли;
	
КонецПроцедуры //ПроверкаДатыЗапретаРедактированияДокументов


Процедура ПроверкаДатыЗапретаРедактированияДокументов(Документ, Объекты, РежимЗаписи, РежимПроведения, Успех, Расшифровка)
	
	//ДатаЗапрета = Константы.ЯССМ_ДатаЗапретаРедактированияДокументов.Получить();
	ДатаЗапрета=ТекущаяДата()-60*60*24;
	
	Если ЗначениеЗаполнено(ДатаЗапрета) И ДатаЗапрета>НачалоДня(Документ.Дата) Тогда
		
		Расшифровка = Расшифровка + Символы.ПС + "Дата запрета редактирования документов установлена на : "+Формат(ДатаЗапрета, "ДФ=dd.MM.yyyy")+"!";
		Успех = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры //ПроверкаДатыЗапретаРедактированияДокументов


Процедура ВыпускГотовойПродукции() //+Лико m.shenderov 31.08.2018
	ГруппаФинансовогоУчетаГП=ПолучитьГруппуФинансовогоУчетаДляГП(РабочийЦентр.Лико_Площадка.Организация);
	ГруппаФинансовогоУчета=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра.ГруппаФинансовогоУчета;
	Если Не ЗначениеЗаполнено(ГруппаФинансовогоУчетаГП) И ГотоваяПродукция Тогда
		Возврат; 
	КонецЕсли;
	
	
	Для каждого Продукция Из Выпуск Цикл
		
		Если Продукция.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
			
			ЕСли ГотоваяПродукция И  Продукция.Номенклатура.ГруппаФинансовогоУчета<>ГруппаФинансовогоУчетаГП Тогда
				СправочникОбъект=  Продукция.Номенклатура.ПолучитьОбъект();
				СправочникОбъект.ГруппаФинансовогоУчета= ГруппаФинансовогоУчетаГП;
				СправочникОбъект.Наименование=СтрЗаменить(СправочникОбъект.Наименование,"Незавершенное производство","Полуфабрикат");
				СправочникОбъект.НаименованиеПолное=СтрЗаменить(СправочникОбъект.Наименование,"Незавершенное производство","Полуфабрикат");
				
				СправочникОбъект.Записать();					
			КонецЕсли;
			
			ЕСли Не ГотоваяПродукция И  Продукция.Номенклатура.ГруппаФинансовогоУчета<>ГруппаФинансовогоУчета И Не БылВыпускГотовойПродукции(Продукция.Номенклатура) Тогда
				
				СправочникОбъект=  Продукция.Номенклатура.ПолучитьОбъект();   				
				СправочникОбъект.ГруппаФинансовогоУчета= ГруппаФинансовогоУчета;
				СправочникОбъект.Наименование=СтрЗаменить(СправочникОбъект.Наименование,"Полуфабрикат","Незавершенное производство");
				СправочникОбъект.НаименованиеПолное=СтрЗаменить(СправочникОбъект.Наименование,"Полуфабрикат","Незавершенное производство");
				
				СправочникОбъект.Записать();					
			КонецЕсли;
			
			
		КонецЕсли;
		
		
	КонецЦикла;	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 31.08.2018


Функция ПолучитьГруппуФинансовогоУчетаДляГП(Организация) //+Лико m.shenderov 31.08.2018
	УстановитьПривилегированныйРежим(Истина);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СхемыУчетаНоменклатурыМеждуОрганизациями.ГруппаФинансовогоУчетаНОменклатуры КАК ГруппаФинансовогоУчетаНОменклатуры
	|ИЗ
	|	РегистрСведений.Лико_СхемыУчетаНоменклатурыМеждуОрганизациями КАК Лико_СхемыУчетаНоменклатурыМеждуОрганизациями
	|ГДЕ
	|	Лико_СхемыУчетаНоменклатурыМеждуОрганизациями.Исполнитель = &Организация";
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.ГруппаФинансовогоУчетаНОменклатуры;
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);		
	
КонецФункции  //-Лико m.shenderov 31.08.2018


Функция БылВыпускГотовойПродукции(Номенклатура) //+Лико m.shenderov 29.09.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаВыпуск.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Номенклатура = &Номенклатура
	|	И Лико_БланкЭтапаВыпуск.Ссылка.ГотоваяПродукция
	|	И Лико_БланкЭтапаВыпуск.Ссылка.Проведен
	|	И НЕ Лико_БланкЭтапаВыпуск.Ссылка.ПометкаУдаления
	|	И Лико_БланкЭтапаВыпуск.Ссылка.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой(); 
	
КонецФункции //-Лико m.shenderov 29.09.2018 

Процедура ПроверитьКоличествоОбъектаНоменклатуры(Массив)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК Ссылка,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия В (&Массив)) КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток <> ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Количество
	|	И (ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Рулонный
	|			ИЛИ ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКраска)
	|	И ТоварыВЯчейкахОстатки.ВНаличииОстаток > 0";
	Запрос.УстановитьПараметр("Массив",Массив);
	Запрос.УстановитьПараметр("ВидНоменклатурыКраска",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект=Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.Количество=Выборка.Остаток;
		СпрОбъект.Записать();
	КонецЦикла; 
	
КонецПроцедуры


Процедура ПроверитьДатуФормированияОбъектаНоменклатуры() //+Лико m.shenderov 15.11.2018
	Если 	ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров Или ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		
		УстановитьДатуФормированияНоменклатуры();
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 15.11.2018


&НаСервере
Процедура УстановитьДатуФормированияНоменклатуры()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
	|ГДЕ
	|	Лико_БланкЭтапа.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Ссылка КАК Ссылка,
	|	МИНИМУМ(Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования) КАК Дата
	|ИЗ
	|	Вт КАК Вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|		ПО Вт.Ссылка = Лико_БланкЭтапаТовары.Ссылка
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Списать
	|	И Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	
	Запрос.УстановитьПараметр("ВидНоменклатуры",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Для каждого СтрВыпуск Из Выборка.Ссылка.Выпуск  Цикл
			
			ОбъектНоменклатуры=СтрВыпуск.Серия.ЯССМ_ОбъектНоменклатуры;
			Если  ОбъектНоменклатуры.ДатаФормирования<>Выборка.Дата Тогда
				СправочникОбъект= ОбъектНоменклатуры.ПолучитьОбъект();
				СправочникОбъект.ДатаФормирования=Выборка.Дата;
				СправочникОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЦикла; 
	
КонецПроцедуры




Функция ПолучитьТзВидовРабот() //+Лико m.shenderov 20.11.2018
	
КонецФункции //-Лико m.shenderov 20.11.2018 

Процедура ЗаполнитьТаблицуРаспределениеМатериалов() //+Лико m.shenderov 02.12.2018
	
	Для каждого Товар Из РаспределяемыеМатериалы Цикл
		
		Если Не ЗначениеЗаполнено(Товар.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		Товар.ВидРабот=Товар.Правило.БазаРаспределения;
		Товар.СтатьяЗатрат=Товар.Правило.СтатьяЗатрат;
		//Товар.Коэффициент=Товар.Правило.БазаРаспределенияКоэффициент;
		Товар.Коэффициент=ПолучитьКоэффициент(Товар.Номенклатура.ЦеноваяГруппа,РабочийЦентр.Лико_Площадка.Организация);

		Структура = Новый Структура;
		Структура.Вставить("Списать",Истина);
		Структура.Вставить("ВидРабот",Товар.ВидРабот);
		НайденныеСтроки=Товары.НайтиСтроки(Структура);
		Товар.База=0;
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Товар.НомерРаботы=НайденнаяСтрока.НомерРаботы;
			Товар.База=Товар.База+НайденнаяСтрока.КоличествоРасходУУ;			
		КонецЦикла;
		Товар.Количество=Товар.база*Товар.Коэффициент;
	КонецЦикла;
	
КонецПроцедуры //-Лико m.shenderov 02.12.2018

Функция ПолучитьКоэффициент251019(ЦГ,Площадка) //+Лико m.shenderov 18.09.2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
	|			&Дата,
	|			Коэффициент = &ЦГ
	|				И Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних";
	Запрос.УстановитьПараметр("ЦГ",ЦГ );
     Запрос.УстановитьПараметр("Площадка",Площадка );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		 Возврат Выборка.Значение/1000;
	
	КонецЦикла; 
	
		
КонецФункции //-Лико m.shenderov 18.09.2019 

Функция ПолучитьКоэффициент(ЦГ, Площадка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
	|			&Дата,
	|			Коэффициент = &ЦГ
	|				И Площадка = &Площадка) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних";
	Запрос.УстановитьПараметр("ЦГ",ЦГ );
	Запрос.УстановитьПараметр("Площадка",Площадка );
	Запрос.УстановитьПараметр("Дата",Дата );
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение/1000;
		
	КонецЦикла; 
	
КонецФункции



Процедура УчетТехОтхода() //+Лико m.shenderov 19.02.2019
	
	//Если НЕ РабочийЦентр.Лико_ВестиУчетТехОтхода Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	//|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	//|	Лико_БланкЭтапаТовары.КоличествоРасход КАК КоличествоРасход,
	//|	Лико_БланкЭтапаТовары.КоличествоРасходУУ КАК КоличествоРасходУУ
	//|ИЗ
	//|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	//|ГДЕ
	//|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	//|	И Лико_БланкЭтапаТовары.Списать
	//|ИТОГИ
	//|	СУММА(КоличествоРасход),
	//|	СУММА(КоличествоРасходУУ)
	//|ПО
	//|	Номенклатура";
	//Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока Выборка.Следующий() Цикл
	//	
	//	Для каждого СтрокаВыпуска Из Выпуск Цикл
	//		
	//		
	//		
	//		
	//	КонецЦикла;
	//	
	//	
	//
	//КонецЦикла; 
	//
	//
	//
	//ТзРасход=Товары.Выгрузить();
	//ТзРасход=Товары.Выгрузить();
	
	//
	//ТзРасход.Свернуть("Номенклатура,Характеристика","Количество_Расход,Количество_РасходУУ");
	//ТзРасход.Свернуть("Номенклатура,Характеристика,Списать","Количество_Расход,Количество_РасходУУ");
	//ТзРАсход.Свернуть
	//
	//
	
	
КонецПроцедуры //-Лико m.shenderov 19.02.2019


Процедура УдалитьРаспоряжениеСборка(Отказ) //+Лико m.shenderov 28.03.2019
	Если НЕ Отказ Тогда
		Если ЗначениеЗаполнено(Распоряжение) И ТипЗнч(Распоряжение)=Тип("ДокументСсылка.СборкаТоваров") Тогда
			РаспоряжениеОбъект=Распоряжение.ПолучитьОбъект();
			Попытка
				
				РаспоряжениеОбъект.ПометкаУдаления=Истина;
				РаспоряжениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина); 
				РаспоряжениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Отказ=Истина;
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры //-Лико m.shenderov 28.03.2019

Процедура УдалитьРаспоряжениеСписаниеНаРасходы(Отказ) //+Лико m.shenderov 28.03.2019
	ЕСли Не Отказ Тогда 	
		Если ЗначениеЗаполнено(РаспоряжениеНаОтгрузку)  Тогда
			РаспоряжениеОбъект=РаспоряжениеНаОтгрузку.ПолучитьОбъект();
			
			Попытка 			
				РаспоряжениеОбъект.ПометкаУдаления=Истина;
				РаспоряжениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина); 
				РаспоряжениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Отказ=Истина;
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры //-Лико m.shenderov 28.03.2019


Функция ВидыРаботПоУмолчанию() //+Лико m.shenderov 10/02/2020
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(РабочиеЦентрыВидыРабот.ВидРабот) КАК ВидРабот,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Справочник.РабочиеЦентры.ВидыРабот КАК РабочиеЦентрыВидыРабот
	|ГДЕ
	|	РабочиеЦентрыВидыРабот.Ссылка = &РабочийЦентр
	|	И РабочиеЦентрыВидыРабот.ВидРабот.Лико_Материал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.ВидРабот КАК Работа,
	|	Вт.Количество КАК Количество
	|ИЗ
	|	Вт КАК Вт
	|ГДЕ
	|	Вт.Количество = 1";
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	       Возврат Выборка.Работа;
	КонецЦикла; 
	
	
	
КонецФункции //-Лико m.shenderov 10/02/2020 


Процедура ПроверкаРЦИксПак(Отказ)

	Если Организация<>Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра 
		Или Не ЗначениеЗаполнено(РабочийЦентр) ТОгда
		Возврат;
	КонецЕсли; 
	
	Если РабочийЦентр.Лико_СнятьОграниченияВЗакрытииБланка Тогда
		Возврат;
	КонецЕсли;
	

	лРабочийЦентр=РабочийЦентр;


	Если РабочийЦентр.Лико_Резак Тогда		

		Для каждого Работа Из ЗаказПокупателя.Цвета Цикл

			Если Работа.РабочийЦентр.Лико_Резак Тогда
				лРабочийЦентр=Работа.РабочийЦентр;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;


	Если лРабочийЦентр.Лико_Резак Тогда
		Структура = Новый Структура;
		Структура.Вставить("РабочийЦентр",лРабочийЦентр);
		НайденныеСтроки=ЗаказПокупателя.Цвета.НайтиСтроки(Структура);
		Если        НайденныеСтроки.Количество()=0 Тогда
			НомерПроката=0;
			Возврат;  	
		КонецЕсли;	
	КонецЕсли;

	Структура = Новый Структура;
	Структура.Вставить("РабочийЦентр",лРабочийЦентр);
	Структура.Вставить("НомерПроката",НомерПроката);
	НайденныеСтроки=ЗаказПокупателя.Цвета.НайтиСтроки(Структура);
	Если        НайденныеСтроки.Количество()=0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Рабочий центр и номер проката не соответсвуют заказу!";
		Сообщение.Поле = "РабочийЦентр"; //имя
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		Отказ=Истина;


	КонецЕсли;



КонецПроцедуры


Процедура ПроверитьЗаполнениеПолейДляСборки(Отказ) //+Лико m.shenderov 15.03.2021
	
	
	НайденныеСтроки=Товары.НайтиСтроки(Новый Структура("Списать",Истина ));
	
	Если НайденныеСтроки.Количество()>0 И НайденныеСтроки[0].КоличествоРасход>0 Тогда		
	Иначе
		Сообщение               = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не указан расходный материал";
		Сообщение.Поле 			= "Товары"; //имя реквизита 
		Сообщение.КлючДанных 	= Ссылка;
		Сообщение.Сообщить();
		Отказ                   = Истина;
		//Возврат;
	КонецЕсли;		

	Если Выпуск.Количество()>0 И Выпуск[0].Количество>0 Тогда
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не указан выпуск продукции";
		Сообщение.Поле 			= "Выпуск"; //имя реквизита 
		Сообщение.КлючДанных 	= Ссылка;
		Сообщение.Сообщить();
		Отказ                   =Истина;
		//Возврат;
	КонецЕсли;

		
КонецПроцедуры //-Лико m.shenderov 15.03.2021

Процедура ПроверитьРезерв(Отказ) //+Лико m.shenderov 15.03.2021
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Партнер",Новый ОписаниеТипов("СправочникСсылка.Партнеры")); 
	
	Для каждого Товар Из Товары Цикл		
		
		Если Товар.Списать Тогда 
			
			НоаяСтрТз=ТЗ.Добавить();
			НоаяСтрТз.Партнер=Товар.Серия.ЯССМ_ОбъектНоменклатуры.Партнер;
			
		КонецЕсли;			
		
	КонецЦикла;
	
	ТЗ.Свернуть("Партнер");
	
	Если ТЗ.Количество()>1 Тогда
		
		Отказ=Истина;
		
		Сообщение               = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Нельзя испольозовать материалы с разным резервом!";
		Сообщение.Поле 			= "Товары"; //имя реквизита 
		Сообщение.КлючДанных 	= Ссылка;
		Сообщение.Сообщить();
		Отказ                   = Истина;

		
		
	КонецЕсли;
	
	
	
	
	НайденныеСтроки=Товары.НайтиСтроки(Новый Структура("Списать",Истина ));
	
	
	
	
	Если НайденныеСтроки.Количество()>0 И НайденныеСтроки[0].КоличествоРасход>0 Тогда		
	Иначе
		Сообщение               = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не указан расходный материал";
		Сообщение.Поле 			= "Товары"; //имя реквизита 
		Сообщение.КлючДанных 	= Ссылка;
		Сообщение.Сообщить();
		Отказ                   = Истина;
		//Возврат;
	КонецЕсли;		

	Если Выпуск.Количество()>0 И Выпуск[0].Количество>0 Тогда
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не указан выпуск продукции";
		Сообщение.Поле 			= "Выпуск"; //имя реквизита 
		Сообщение.КлючДанных 	= Ссылка;
		Сообщение.Сообщить();
		Отказ                   =Истина;
		//Возврат;
	КонецЕсли;

		
КонецПроцедуры //-Лико m.shenderov 15.03.2021
 

Процедура ПроверкаИЗаполнениеДокумента(Отказ, РежимЗаписи, РежимПроведения)
	// --> Начало Лико Ефимов ЕВВ 18.10.2019
	Если (ЭтоСлужебныйДокументДляТачпадов ИЛИ Ссылка.ЭтоСлужебныйДокументДляТачпадов)
		И НЕ (ДополнительныеСвойства.Свойство("ЗаписьСТачпада") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Отказ = Истина;
		Сообщить("" + Ссылка + ": это служебный документ для тачпадов, изменение запрещено");
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 18.10.2019

	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		УстановкаЦеныНаВыпускГравировальногоУчастка(Отказ);  
		КонтрольВыполненияПоНесколькимОсонваниям(Отказ);
		ПроверкаРЦИксПак(Отказ);

		// --> Начало Лико Субботин 14.04.2022
		ЭтоИкспак  = Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра;
		ЭтоТермоусадка = РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.СклейкаТермоусадки ;
		Если  ЭтоТермоусадка и ЭтоИкспак Тогда

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказКлиентаВидыРабот.Клей КАК Клей
			|ПОМЕСТИТЬ ВТКлей
			|ИЗ
			|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
			|ГДЕ
			|	ЗаказКлиентаВидыРабот.Ссылка = &Ссылка
			|	И ЗаказКлиентаВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Термоусадка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Лико_ФормулыПантоновСостав.Номенклатура КАК Ссылка
			|ИЗ
			|	Справочник.Лико_ФормулыПантонов.Состав КАК Лико_ФормулыПантоновСостав,
			|	ВТКлей КАК ВТКлей
			|ГДЕ
			|	Лико_ФормулыПантоновСостав.Ссылка.Номенклатура = ВТКлей.Клей
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТКлей.Клей
			|ИЗ
			|	ВТКлей КАК ВТКлей";

			Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателя);
			ДопустимыеЗначения = новый массив;

			ДопустимыеЗначения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ссылка");


		КонецЕсли;
		// <-- Конец Лико Субботин 14.04.2022


		Для каждого стр из Товары Цикл
			//Если стр.номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал И стрНайти(стр.номенклатура, "Незавершенное производство") =0 Тогда
			Если Организация = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда  					

				Если  ЗначениеЗаполнено(стр.видработ) и Не ЗначениеЗаполнено(Стр.НомерРаботы) Тогда 
					Стр.НомерРаботы=1;
				КонецЕсли;
				// --> Начало Лико Субботин 14.04.2022
				Если ЭтоТермоусадка и Не стр.Списать Тогда
					Если стр.Номенклатура.ВидНоменклатуры = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра Тогда
						Если  ДопустимыеЗначения.Найти(стр.Номенклатура) = Неопределено  Тогда
							Сообщить("В документе выбран клей (компонент клея) для термоусадки, отличающийся от данных заказа. Номер строки " + стр.НомерСтроки);
							Отказ = Истина;
							Возврат;
						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
				// <-- Конец Лико Субботин 14.04.2022
			КонецЕсли;

			Если Стр.Номенклатура = Справочники.Лико_ПредопределенныеЗначения.CLICKS_INDIGO.ЗначениеПараметра Тогда
				стр.ВидРабот=Неопределено;
				стр.НомерРаботы=Неопределено;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	ПоАктуРазборки=Ложь;	

	//+Проверка ЯССМ Склада
	//#Если Клиент Тогда
	Если Не Лико_ОбщегоНазначенияСервер.АдминистраторСклада() Тогда
		Расшифровка = "";			

		//МассивОбъектов = Товары.ВыгрузитьКолонку("Серия");
		МассивОбъектов=Новый Массив;

		Для каждого Товар Из Товары Цикл
			Если Товар.Списать Тогда
				МассивОбъектов.Добавить(Товар.Серия);
			КонецЕсли;

		КонецЦикла;
		Для каждого ВыпускПоз Из Выпуск Цикл
			МассивОбъектов.Добавить(ВыпускПоз.Серия);
		КонецЦикла;			
		МожноПровестиДокумент = Лико_ОбщегоНазначенияСервер.ПроверитьВозможностьПроведенияДокумента(ЭтотОбъект, МассивОбъектов, РежимЗаписи, РежимПроведения, Расшифровка);
		Если Не МожноПровестиДокумент Тогда

			СообщениеПользователю = "Невозможно провести документ на это время! Пояснение: " + Расшифровка;
			Сообщить(СообщениеПользователю);			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//#КонецЕсли
	//-Проверка ЯССМ Склада


	//+ Лико m.shenderov 19.08.2018
	//  Промежуточный выпуск для заказов давальца.
	//  Промежуточным выпуском является  номенклатура которая находится в табличной части "Выпуск" документа "Лико_БланЭтапа"
	//  и которой нет  в табличной части "Товары" документа "Заказ клиента". 

	//Если   ЗаказПокупателя.ДавальческоеСырье Тогда
	Если  ЗаказПокупателя.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Полуфабрикат Тогда 
		//Лико_ОбщегоНазначенияСервер.ЭтоЗаказНаПереработку(ЗаказПокупателя) Тогда 
		Для каждого Номен Из  Выпуск  Цикл 				
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",Номен.Номенклатура);
			ПромежуточныйВыпуск=ЗаказПокупателя.Товары.НайтиСтроки(Структура).Количество()=0;
			Номен.ПромежуточныйВыпуск=ПромежуточныйВыпуск;				
		КонецЦикла;
	Иначе
		Для каждого Номен Из  Выпуск  Цикл 				
			Номен.ПромежуточныйВыпуск=Ложь;
		КонецЦикла;


	КонецЕсли;
	//+Проверка на отрицательный расход.
	Нпор=0;
	ОшибкаДанных=Ложь;
	Для каждого ТОвар Из Товары Цикл		
		Если Товар.КоличествоРасход<0 И Товар.Списать Тогда		
			НомерСтроки=Нпор;			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Возврат больше исходного значения!";
			Сообщение.Поле = "Товары["+Нпор+"].ВозвратКоличество"; //имя реквизита 
			Сообщение.КлючДанных = Ссылка;
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
			ОтменаРедактирования=Истина;
			Отказ=Истина;			
		КонецЕсли;
		Нпор=Нпор+1;			
	КонецЦикла;
	//-Проверка на отрицательный расход.



	//- Лико m.shenderov 19.08.2018





	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);	

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи); 
	ДополнительныеСвойства.Вставить("БылПроведен", Проведен); 	

	Если ЭтоНовый() Тогда

		СсылкаНового = ЭтотОбъект.ПолучитьСсылкуНового();

		Если НЕ ЗначениеЗаполнено(СсылкаНового) Тогда

			СсылкаНового = Документы.Лико_БланкЭтапа.ПолучитьСсылку();

		КонецЕсли;
		ЭтотОбъект.УстановитьСсылкуНового(СсылкаНового);
		ДополнительныеСвойства.Вставить("Ссылка", СсылкаНового); 
	Иначе 		
		ДополнительныеСвойства.Вставить("Ссылка", Ссылка); 

	КонецЕсли;



	Если ВидОперации<>Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда 		
		Распоряжение=НайтиЭтап();

		//Если НомерПроката=0 Тогда
		//	НомерПроката=Лико_ОбщегоНазначенияСервер.ПолучитьНомерПроката(ЗаказПокупателя,РабочийЦентр);
		//КонецЕсли; 		
		Если Не ЗначениеЗаполнено(ЗаказПокупателя) И ЗначениеЗаполнено(НомерЗаказа) Тогда
			ЗаказПокупателя=Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказа,"ЗаказКлиента");
		КонецЕсли;		
		//Если РабочийЦентр.ПорядковыйНомер<>20 Тогда	
		ТипРаспоряжения=Неопределено; 		
		ОпределитьТипРаспоряжения(ТипРаспоряжения,Отказ);
		Если НомерПроката=0 И ТипРаспоряжения<>"СборкаТоваров" Тогда
			////НомерПроката=Лико_ОбщегоНазначенияСервер.ПолучитьНомерПроката(ЗаказПокупателя,РабочийЦентр);
		КонецЕсли; 	


		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		Если ТипРаспоряжения="ЭтапПроизводства" Тогда
			УдалитьРаспоряжениеСборка(Отказ);
			УдалитьРаспоряжениеСписаниеНаРасходы(Отказ);

			РаспоряжениеНаОтгрузку=Неопределено;
			Отбор = Новый Структура("Списать", Истина);
			СтрокиКСписанию = Товары.НайтиСтроки(Отбор);

			//+ Лико A.Ivanova 23.10.2018  
			
			УчетПоВидуСекции=Документы.Лико_БланкЭтапа.УчетПоВидуСекцииУстановлен(Дата);

			Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
				Для каждого стр из СтрокиКСписанию Цикл
					//Если стр.номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал И стрНайти(стр.номенклатура, "Незавершенное производство") =0 Тогда
					Если стр.номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал И 
						НЕ Стр.номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда 

						Если Не УчетПоВидуСекции И Не ЗначениеЗаполнено(стр.видработ) Тогда 
								////Если Не ЗначениеЗаполнено(стр.ВидСекции) Тогда 

							стр.ВидРабот=ВидыРаботПоУмолчанию();
							стр.НомерРаботы=?(ЗначениеЗаполнено(стр.ВидРабот),1,стр.НомерРаботы);

							
							Если Не ЗначениеЗаполнено(стр.видработ) Тогда   
								Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В строке № " + стр.номерстроки+ " не указан вид работ
								|Необходимо его заполнить!!!""");
								Отказ = Истина;
							КонецЕсли; 						
						КонецЕсли; 
						
						Если УчетПоВидуСекции И Не ЗначениеЗаполнено(стр.ВидСекции) Тогда 
								////Если Не ЗначениеЗаполнено(стр.ВидСекции) Тогда 

							стр.ВидРабот=ВидыРаботПоУмолчанию();
							стр.НомерРаботы=?(ЗначениеЗаполнено(стр.ВидСекции),1,стр.НомерРаботы);

							
							Если Не ЗначениеЗаполнено(стр.ВидСекции) Тогда   
								Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В строке № " + стр.номерстроки+ " не указан вид работ
								|Необходимо его заполнить!!!""");
								Отказ = Истина;
							КонецЕсли; 						
						КонецЕсли;

						
						
						Если Не ЗначениеЗаполнено(стр.НомерРаботы) Тогда   
							Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("В строке № " + стр.номерстроки+ " не указан номер работы
							|Необходимо его заполнить!!!""");
							Отказ = Истина;
						КонецЕсли;

					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//- Лико A.Ivanova 23.10.2018


			Если Не ЗначениеЗаполнено(НомерПроката) И РежимЗаписи=РежимЗаписиДокумента.Проведение И  РабочийЦентр.ВидРабочегоЦентра<>Справочники.ВидыРабочихЦентров.Перемотка Тогда
				Отказ = Истина;
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Указанная машина не соответствует данным заказа.
				|Необходимо исправить номер заказа или поменять машину. Или обратитесь в отдел ""ОПП!""");   		
				Возврат;
			КонецЕсли;
			//Распоряжение=НайтиЭтап();

		ИначеЕсли  ТипРаспоряжения="СборкаТоваров" Тогда 

			ПроверитьРезерв(Отказ);			
			ПроверитьЗаполнениеПолейДляСборки(Отказ); 


			ПроставитьВидНастроечногоМатериала();
			//ПроверитьНаличиеРаспоряжения();
			Если ТипЗнч(Распоряжение)<>Тип("ДокументСсылка.СборкаТоваров") Тогда
				Распоряжение=Неопределено;
			КонецЕсли;

			УдалитьРаспоряжениеСписаниеНаРасходы(Отказ);
			РаспоряжениеНаОтгрузку=Неопределено;
			ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров;
			Если РабочийЦентр.Лико_СнятьОграниченияВЗакрытииБланка Тогда
					ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров;
			КонецЕсли;
			
			ПодготовитьСборку(Отказ, РежимЗаписи); 
		ИначеЕсли  ТипРаспоряжения="СписаниеНаРасходы" Тогда			
			УдалитьРаспоряжениеСборка(Отказ);
			ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
			ПодготовитьСписание(Отказ, РежимЗаписи);			
		КонецЕсли;

		Если Не Отказ Тогда			
			Если РежимЗаписи=РежимЗаписиДокумента.Проведение Или РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда 				
				Для Каждого СтрокаТовары Из Товары Цикл
					Если Не СтрокаТовары.Списать Тогда
						Продолжить;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(СтрокаТовары.Серия) Тогда
						Продолжить;
					КонецЕсли;

					// если возвращаем частичный товар
					Если СтрокаТовары.ВозвратКоличество<>0 И СтрокаТовары.Количество-СтрокаТовары.ВозвратКоличество<>0 Тогда
						Количество=?(РежимЗаписи=РежимЗаписиДокумента.Проведение, СтрокаТовары.ВозвратКоличество, СтрокаТовары.Количество);

						Расшифровка="";
						Успех=Истина;
						Если НЕ ЗначениеЗаполнено(ДатаПроведенияПоОбязательнымРегистрам) Тогда // --> Начало Лико Ефимов ЕВВ 15.12.2021
							Лико_ОбщегоНазначенияСервер.ПроверкаБолееПозднихПроведенныхДокументов(Ссылка, СтрокаТовары.Серия, РежимЗаписи, РежимПроведения, Успех, Расшифровка);
						КонецЕсли; // <-- Конец Лико Ефимов ЕВВ 15.12.2021

						Если Успех Тогда
							Лико_ОбщегоНазначенияСервер.ИзменитьКоличествоВОбъектеНоменклатуры(СтрокаТовары.Серия,Количество); 	
						КонецЕсли; 						
					ИначеЕсли РабочийЦентр.Лико_ИспользоватьАлгоритмПоФакту Тогда
						ИсправляемыйОбъектНоменклатуры=СтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры; 
						Количество=?(РежимЗаписи=РежимЗаписиДокумента.Проведение,
						ИсправляемыйОбъектНоменклатуры.Количество-СтрокаТовары.Количество, ИсправляемыйОбъектНоменклатуры.Количество+СтрокаТовары.Количество);

						Расшифровка="";
						Успех=Ложь;
						Лико_ОбщегоНазначенияСервер.ПроверкаБолееПозднихПроведенныхДокументов(Ссылка, СтрокаТовары.Серия, РежимЗаписи, РежимПроведения, Успех, Расшифровка);

						Если Успех Тогда
							Лико_ОбщегоНазначенияСервер.ИзменитьКоличествоВОбъектеНоменклатуры(СтрокаТовары.Серия,Количество); 
						КонецЕсли; 						
					КонецЕсли;
				КонецЦикла;				
				Для Каждого СтрокаПродукция Из Выпуск Цикл
					Если Не ЗначениеЗаполнено(СтрокаПродукция.Серия) Тогда
						Продолжить;
					КонецЕсли;

					// выпускаемая продукция
					Если СтрокаПродукция.Количество<>СтрокаПродукция.Серия.ЯССМ_ОбъектНоменклатуры.Количество Тогда
						Количество = СтрокаПродукция.Количество;
						Лико_ОбщегоНазначенияСервер.ИзменитьКоличествоВОбъектеНоменклатуры(СтрокаПродукция.Серия,Количество);						
					КонецЕсли;
				КонецЦикла;

			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
	//+ ---> Лико m.shenderov 07.07.2023
      УстановитьПризнакНоменклатурыМатериалВыпущенныйНаРЦ();
	//- <--- Лико m.shenderov 07.07.2023
	


КонецПроцедуры

 
Процедура ВыполнитьСборкуРазборку(Отказ,РежимЗаписи,РежимПроведения) //+Лико m.shenderov 15.03.2021

Если ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда
		ПроверитьЗаполнениеПолейДляСборки(Отказ);
		ПроставитьВидНастроечногоМатериала();
		УдалитьРаспоряжениеСписаниеНаРасходы(Отказ);
		РаспоряжениеНаОтгрузку=Неопределено;  
		ПодготовитьСборку(Отказ, РежимЗаписи); 		
	КонецЕсли;

		
КонецПроцедуры //-Лико m.shenderov 15.03.2021


Процедура ЗакрытиеЗаказаНаРаскрой() //+Лико m.shenderov 14.06.2022

	//Если  ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда
	//	
	//	ДокОбъект		=ЗаказНаРаскрой.ПолучитьОбъект();
	//	ДокОбъект.Статус=Перечисления.Лико_СтатусыЗаказовБЭ.Выполнен;
	//	
	//	ДокОбъект.Записать();
	//	НаборЗаписей = РегистрыСведений.Лико_ПланРаботБЭ.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Заказ.Установить(ЗаказНаРаскрой);
	//	НаборЗаписей.Записать();
	//	
	//КонецЕсли;
	
	
		
КонецПроцедуры //-Лико m.shenderov 14.06.2022

Процедура ЗарезервироватьМатериталСборкиБезРегионов() //+Лико m.shenderov 09.01.2023

   УстановитьПривилегированныйРежим(Истина);
	
	Движения.Лико_РезервСерий.Записывать = Истина;

	
	Партнер = ПолучитьПартнераДляРезерва();
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		
		МассивОбъектовНоменклатуры = Новый Массив();
		
	Для каждого Товар Из Выпуск Цикл
		
		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный И Не СнятьСРезерваЗаказНаРаскрой(Товар.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка) Тогда
			
			 Движение 						=	Движения.Лико_РезервСерий.Добавить();
             Движение.Период				=	Дата;
			 Движение.Серия					=	Товар.Серия;
			 Движение.Партнер				=	Партнер;
			 Движение.Резерв				=   Партнер;
			 Движение.ОбъектНоменклатуры	=	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			 
			МассивОбъектовНоменклатуры.Добавить( Движение.ОбъектНоменклатуры);			 
			
			
		КонецЕсли;
		
		
	КонецЦикла; 
	Движения.Лико_РезервСерий.Записать();
		
	Справочники.ЯССМ_ОбъектыНоменклатуры.УстановитьПартнера(МассивОбъектовНоменклатуры);
		
   КонецЕсли;
 КонецПроцедуры //-Лико m.shenderov 09.01.2023


Процедура ЗарезервироватьМатериталСборки() //+Лико m.shenderov 09.01.2023
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		ЗарезервироватьМатериталСборкиБезРегионов();
		
		Возврат;
		
	КонецЕсли;
	
	
   УстановитьПривилегированныйРежим(Истина);
	
	Движения.Лико_РезервСерий.Записывать = Истина;

	
	//Партнер = ПолучитьПартнераДляРезерва();
	
	Резерв = ПолучитьОбъектДляРезерва();
	

	
	Если ЗначениеЗаполнено(Резерв) Тогда
		
		МассивОбъектовНоменклатуры = Новый Массив();
		
	Для каждого Товар Из Выпуск Цикл
		
		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный И Не СнятьСРезерваЗаказНаРаскрой(Товар.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка) Тогда
			
			 Движение 						=	Движения.Лико_РезервСерий.Добавить();
             Движение.Период				=	Дата;
			 Движение.Серия					=	Товар.Серия;
			 Движение.Резерв				=	Резерв;
			 Движение.Партнер				=	Резерв;
			 Движение.ОбъектНоменклатуры	=	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			 
			МассивОбъектовНоменклатуры.Добавить( Движение.ОбъектНоменклатуры);			 
			
			
		КонецЕсли;
		
		
	КонецЦикла; 
	Движения.Лико_РезервСерий.Записать();
		
	Справочники.ЯССМ_ОбъектыНоменклатуры.УстановитьРезерв(МассивОбъектовНоменклатуры);
		
   КонецЕсли;
 КонецПроцедуры //-Лико m.shenderov 09.01.2023

Функция ПолучитьПартнераДляРезерва() //+Лико m.shenderov 09.01.2023
	   
	   Для каждого Товар Из Товары Цикл
		   
		   
		   Если Товар.Списать Тогда
			   
			   Возврат Товар.Серия.ЯССМ_ОбъектНоменклатуры.Партнер;  
			   
		   КонецЕсли;
		   
		   
	   КонецЦикла;
	   
	   
   КонецФункции //-Лико m.shenderov 09.01.2023 

Функция ПолучитьОбъектДляРезерва() //+Лико m.shenderov 09.01.2023
	   
	   Для каждого Товар Из Товары Цикл
		   
		   
		   Если Товар.Списать Тогда
			   
			   Возврат Товар.Серия.ЯССМ_ОбъектНоменклатуры.Резерв;  
			   
		   КонецЕсли;
		   
		   
	   КонецЦикла;
	   
	   
   КонецФункции //-Лико m.shenderov 09.01.2023 
   
Процедура ПроверкаРезерваМатериаловБезРегионов(Отказ, РежимЗаписи)
	
	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение  Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтроки=0;
	
	Партнер=ЗаказПокупателя.Партнер;
	
	Для каждого Товар Из Товары Цикл 
		
		Если Товар.Списать Тогда
			
			ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			ОбъектНоменклатуры_Партнер=ОбъектНоменклатуры.Партнер;
			
			Если ЗначениеЗаполнено(ОбъектНоменклатуры_Партнер) И ОбъектНоменклатуры_Партнер<> Партнер Тогда
				Отказ=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Материал: №%3 (%1) - %2 - #%4, зарезервирован под заказы клиента: ""%5""!",
				Товар.Номенклатура.Код,
				Товар.Номенклатура,
				НомерСтроки+1,
				Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
				ОбъектНоменклатуры_Партнер);
				Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЕсли;
	

		НомерСтроки=НомерСтроки+1;

	КонецЦикла;



КонецПроцедуры
   
   
Процедура ПроверкаРезерваМатериалов(Отказ, РежимЗаписи)
	
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		ПроверкаРезерваМатериаловБезРегионов(Отказ, РежимЗаписи);
		
		Возврат;
		
	КонецЕсли;

	
	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение  Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтроки=0;
	
	Партнер=ЗаказПокупателя.Партнер;
	БизнесРегион = ЗаказПокупателя.Регион;
	Для каждого Товар Из Товары Цикл 
		
		Если Товар.Списать Тогда
			
			ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			ОбъектНоменклатуры_Партнер=ОбъектНоменклатуры.Партнер; 
			ОбъектНоменклатуры_Резерв=ОбъектНоменклатуры.Резерв;

			
			Если ЗначениеЗаполнено(ОбъектНоменклатуры_Резерв) И ОбъектНоменклатуры_Резерв<> Партнер И ОбъектНоменклатуры_Резерв <> БизнесРегион Тогда
				Отказ=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Материал: №%3 (%1) - %2 - #%4, зарезервирован под заказы: ""%5""!",
				Товар.Номенклатура.Код,
				Товар.Номенклатура,
				НомерСтроки+1,
				Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
				ОбъектНоменклатуры_Резерв);
				Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЕсли;
	

		НомерСтроки=НомерСтроки+1;

	КонецЦикла;



КонецПроцедуры

Функция СнятьСРезерваЗаказНаРаскрой(Нарезка) //+Лико m.shenderov 19.01.2023
	
	Если Не ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если  ЗаказНаРаскрой.Раскрой.НайтиСтроки( Новый Структура("Нарезка,СнятьРезерв",Нарезка,Истина)).Количество()>0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	
	Возврат Ложь; 
	
КонецФункции //-Лико m.shenderov 19.01.2023 

Процедура ЗаполнитьПаритииПроизводства() //+Лико m.shenderov 22.03.2023
    УстановитьПривилегированныйРежим(Истина);
		ТзПартий 	= 	Новый ТаблицаЗначений;
		ТзПартий.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		МассивСерий		=	Новый Массив();  

	Для каждого Товар  Из Товары.НайтиСтроки( Новый Структура("Списать",Истина)) Цикл
		
				
		ОН				=	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
		
		Если ОН.Уникальный Тогда 
			
			Если ОН.ЕстьПартияПроизводства Тогда				
				НоваяПартия=ТзПартий.Добавить();
				НоваяПартия.Серия=Товар.Серия;
			Иначе
				МассивСерий.Добавить(Товар.Серия);
			КонецЕсли; 	
			
		КонецЕсли;		
	КонецЦикла;
	
	Если МассивСерий.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_ПартииПроизводства.Партия КАК Партия
		|ИЗ
		|	РегистрСведений.Лико_ПартииПроизводства КАК Лико_ПартииПроизводства
		|ГДЕ
		|	Лико_ПартииПроизводства.Серия В(&МассивСерий)";
		Запрос.УстановитьПараметр("МассивСерий",МассивСерий );
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
				НоваяПартия=ТзПартий.Добавить();
				НоваяПартия.Серия=Выборка.Партия;

					
			КонецЦикла;
			
			
		
		КонецЕсли; 
	ТзПартий.Свернуть("Серия");
	МассивПартий=ТзПартий.ВыгрузитьКолонку("Серия");
	
	Движения.Лико_ПартииПроизводства.Записывать=Истина;
	
	Для каждого СтрВыпуска Из Выпуск Цикл 
		
		Для каждого Партия Из МассивПартий Цикл 
			
			Движение=Движения.Лико_ПартииПроизводства.Добавить();
			
			Движение.Партия						=	Партия;
			Движение.Серия						=	СтрВыпуска.Серия;
			Движение.ПартияОбъектНоменклатуры	=	Партия.ЯССМ_ОбъектНоменклатуры;
			Движение.СерияОбъектНоменклатуры	=	СтрВыпуска.Серия.ЯССМ_ОбъектНоменклатуры;			
			
		КонецЦикла;		
	КонецЦикла;
	
		
КонецПроцедуры //-Лико m.shenderov 22.03.2023


Процедура ОбработатьТабличнуюЧастьТовары() //+Лико m.shenderov 23.06.2023
	
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Списать",Истина));
	
	Для каждого НСтрока Из НайденныеСтроки Цикл
		Если НСтрока.ВозвратКоличество>0 И НСтрока.КоличествоРасход<=0 Тогда
			 НСтрока.Списать=Ложь;
		 КонецЕсли;
		 
	КонецЦикла;
	
	 НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Списать",Ложь));  
	 
		Для каждого НСтрока Из НайденныеСтроки Цикл
			
			Товары.Удалить(НСтрока);
			
	 	
	 КонецЦикла;

		
КонецПроцедуры //-Лико m.shenderov 23.06.2023


Процедура УстановитьПризнакНоменклатурыМатериалВыпущенныйНаРЦ() //+Лико m.shenderov 07.07.2023
	УстановитьПривилегированныйРежим(Истина);
	Массив = Новый Массив(); 
	Массив.Добавить(Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",300));
	
	Если Массив.Найти(РабочийЦентр)<>Неопределено Тогда
		
		Для каждого Товар Из Выпуск Цикл
			
			Если Товар.Номенклатура.Лико_МатериалВыпущенныйНаРЦ<>РабочийЦентр Тогда
				
				СпрОбъект=Товар.Номенклатура.ПолучитьОбъект(); 
				СпрОбъект.ОбменДанными.Загрузка=Истина;
				
				СпрОбъект.Лико_МатериалВыпущенныйНаРЦ=РабочийЦентр;
				СпрОбъект.Записать(); 				
			КонецЕсли; 	
			
		КонецЦикла;
		
	КонецЕсли;		
КонецПроцедуры //-Лико m.shenderov 07.07.2023


Процедура ЗаполнитьСклады(Отказ, РежимЗаписи)

	Если Отказ 
		Или  РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда

		Возврат; 

	КонецЕсли;     




	МассивАдресов = Новый Массив(); 

	РцЯчейка = РабочийЦентр.ЛикоЯчейка;
	Обработки.ПеремещениеТоваровДоп.КорректировкаЯчейкиРабочегоЦентра(Организация, Дата,РцЯчейка); 

	МассивАдресов.Добавить(РцЯчейка); 
	МассивАдресов.Добавить(ЗонаПриемки);


	Для каждого Товар Из  Товары Цикл 

		Товар.СкладОтправитель = Неопределено;
		Товар.СкладПолучатель = Неопределено;


		Если Товар.Списать  Тогда

			Если ЗначениеЗаполнено(Товар.АдресХранения) И МассивАдресов.Найти(Товар.АдресХранения)=Неопределено Тогда
				МассивАдресов.Добавить(Товар.АдресХранения); 
			КонецЕсли;

			Если ЗначениеЗаполнено(Товар.РабочийЦентр) Тогда 

				Ячейка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Товар.РабочийЦентр,"ЛикоЯчейка");
				Обработки.ПеремещениеТоваровДоп.КорректировкаЯчейкиРабочегоЦентра(Организация, Дата,Ячейка);

				Если ЗначениеЗаполнено(Ячейка)
					И МассивАдресов.Найти(Ячейка)=Неопределено Тогда 

					МассивАдресов.Добавить(Ячейка);

				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка,
	|	СкладскиеЯчейки.Владелец КАК Владелец,
	|	СкладскиеЯчейки.Помещение КАК Помещение
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Ссылка В(&МассивАдресов)";
	Запрос.УстановитьПараметр("МассивАдресов",МассивАдресов );
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СооАдресов = Новый Соответствие;

	Пока Выборка.Следующий() Цикл

		СооАдресов.Вставить(Выборка.Ссылка,Выборка.Владелец);

	КонецЦикла; 

	ЕстьМатериалСписания = Ложь;

	МассивСкладов = Новый Массив();

	Для каждого Товар Из  Товары Цикл

		Если Товар.Списать  Тогда 

			ЕстьМатериалСписания = Истина;

			лСклад = Неопределено;

			//Ячейка = РабочийЦентр.ЛикоЯчейка;
			// Обработки.ПеремещениеТоваровДоп.КорректировкаЯчейкиРабочегоЦентра(Организация, Дата,Ячейка);

			Если ЗначениеЗаполнено(РцЯчейка) Тогда

				лСклад = СооАдресов[РцЯчейка]; 

			КонецЕсли;



			Если ЗначениеЗаполнено(Товар.РабочийЦентр) Тогда
				Ячейка = Товар.РабочийЦентр.ЛикоЯчейка;
				Обработки.ПеремещениеТоваровДоп.КорректировкаЯчейкиРабочегоЦентра(Организация, Дата,Ячейка);

				лСклад = СооАдресов[Ячейка]; 

			КонецЕсли; 

			Если ЗначениеЗаполнено(Товар.АдресХранения) Тогда

				лСклад = СооАдресов[Товар.АдресХранения]; 

			КонецЕсли;


			Если ЗначениеЗаполнено(лСклад)
				И МассивСкладов.Найти(лСклад) = Неопределено Тогда

				МассивСкладов.Добавить(лСклад); 

			КонецЕсли;



			Если  Товар.ВозвратКоличество>0 Тогда

				Если ЗначениеЗаполнено(РцЯчейка) Тогда

					Товар.СкладОтправитель = СооАдресов[РцЯчейка]; 

				КонецЕсли;

				Если ЗначениеЗаполнено(Товар.РабочийЦентр) Тогда

					Ячейка = Товар.РабочийЦентр.ЛикоЯчейка;
					Обработки.ПеремещениеТоваровДоп.КорректировкаЯчейкиРабочегоЦентра(Организация, Дата,Ячейка);

					Товар.СкладОтправитель = СооАдресов[Ячейка]; 

				КонецЕсли; 

				Если ЗначениеЗаполнено(Товар.АдресХранения) Тогда

					Товар.СкладОтправитель = СооАдресов[Товар.АдресХранения]; 

				КонецЕсли;
				Если РежимЗакрытия = Перечисления.Лико_РежимЗакрытияЗаказа.ПереместитьНаСклад 
					 И Не ОставитьНаРабочемЦентреСырье  Тогда


					Товар.СкладПолучатель = СооАдресов[ЗонаПриемки];
				Иначе

					Товар.СкладПолучатель = Товар.СкладОтправитель;

				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

	КонецЦикла; 


	Структура = Новый Структура; 		
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура); 
	Склад = Структура.Склад;
	Помещение = Структура.Помещение;
	Если МассивСкладов.Количество()>1 Тогда
		Отказ = Истина;
		Сообщить("Нельзя использовать материалы в одном документе, хранящиеся на разных складах.");
	ИначеЕсли МассивСкладов.Количество()=0 Тогда

		Если ЕстьМатериалСписания Тогда
			Сообщить("Склад не опрделен.");
		КонецЕсли; 

	Иначе
		Если Склад <> МассивСкладов[0] Тогда
			Склад = МассивСкладов[0];
			Помещение = Неопределено;

		КонецЕсли;

	КонецЕсли;

	СкладОтправитель = Неопределено;
	СкладПолучатель = Неопределено;

	Если ЗначениеЗаполнено(РцЯчейка) Тогда

		СкладОтправитель = СооАдресов[РцЯчейка]; 
		СкладПолучатель = СооАдресов[РцЯчейка]; 			 
	КонецЕсли;

	Если РежимЗакрытия = Перечисления.Лико_РежимЗакрытияЗаказа.ПереместитьНаСклад Тогда
		СкладПолучатель = СооАдресов[ЗонаПриемки]; 
	КонецЕсли;



	Для каждого СтрВыпуск Из Выпуск  Цикл

		СтрВыпуск.СкладОтправитель = СкладОтправитель;
		СтрВыпуск.СкладПолучатель = СкладПолучатель; 

	КонецЦикла;
	
	//Это только выпуск без расхода метериала!->
	Если МассивСкладов.Количество()=0 И  СкладПолучатель<>Склад Тогда
		
		Склад =СкладПолучатель;
		Помещение = Неопределено;
		
	КонецЕсли;
	//Это только выпуск без расхода метериала!<-

		


КонецПроцедуры


Процедура СформироватьПродажуМатериаловМеждуОрганизациями()
	
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЭтапПроизводства2_2")  Тогда
		
		
		лОрганизация = Распоряжение.Организация;
		
		
		
	КонецЕсли;
	Тз = ТаблицаСерииДругойОрганизации(лОрганизация);
	лКонтрагент = УправлениеСвойствами.ЗначениеСвойства(лОрганизация,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2");
	
	ВыполнитьПродажуМатериалов(Тз, лКонтрагент);
	
 КонецПроцедуры 
 
 
  Функция ТаблицаСерииДругойОрганизации(лОрганизация) //+Лико m.shenderov 11.09.2024
	  
	  Запрос = Новый Запрос;
	  Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	  |	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	  |	Лико_БланкЭтапаТовары.Серия КАК Серия,
	  |	Лико_БланкЭтапаТовары.Упаковка КАК Упаковка,
	  |	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр.ЛикоЯчейка КАК АдресХранения,
	  |	Лико_БланкЭтапаТовары.КоличествоРасход КАК КоличествоУпаковок,
	  |	Лико_БланкЭтапаТовары.КоличествоРасходУУ КАК Количество
	  |ПОМЕСТИТЬ ВтСерии
	  |ИЗ
	  |	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	  |ГДЕ
	  |	Лико_БланкЭтапаТовары.Списать
	  |	И Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	Лико_СерииНоменклатурыДопСрезПоследних.Организация КАК Организация,
	  |	ВтСерии.Номенклатура КАК Номенклатура,
	  |	ВтСерии.Характеристика КАК Характеристика,
	  |	ВтСерии.Серия КАК Серия,
	  |	ВтСерии.Упаковка КАК Упаковка,
	  |	ВтСерии.АдресХранения КАК АдресХранения,
	  |	ВтСерии.КоличествоУпаковок КАК КоличествоУпаковок,
	  |	ВтСерии.Количество КАК Количество
	  |ИЗ
	  |	РегистрСведений.Лико_СерииНоменклатурыДоп.СрезПоследних(
	  |			&Период,
	  |			Серия В
	  |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	  |					ВтСерии.Серия КАК Серия
	  |				ИЗ
	  |					ВтСерии КАК ВтСерии)) КАК Лико_СерииНоменклатурыДопСрезПоследних
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСерии КАК ВтСерии
	  |		ПО Лико_СерииНоменклатурыДопСрезПоследних.Серия = ВтСерии.Серия
	  |ГДЕ
	  |	Лико_СерииНоменклатурыДопСрезПоследних.Организация <> &Организация
	  |	И Лико_СерииНоменклатурыДопСрезПоследних.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)";
	  Запрос.УстановитьПараметр("Период",Дата );
	  Запрос.УстановитьПараметр("Организация",лОрганизация );
	  
	  Возврат Запрос.Выполнить().Выгрузить();
	  
	  
	  
  КонецФункции //-Лико m.shenderov 11.09.2024 
  
  Процедура ВыполнитьПродажуМатериалов(Тз, лКонтрагент)  
	  
	  ПроверитьОрганизациюСерий(Тз); 
	  
	  	ИмяНакладной                               ="ПередачаСырьяПереработчику";
	ДокументСсылка                          =Лико_ОбщегоНазначенияСервер.НайтиДокумент(ИмяНакладной,"Лико_Документ",Ссылка);

	  
	  ДокОбъект = Документы.Лико_ПередачаТоваров.СоздатьДокумент();
	  СтруктураДокумента = Новый Структура;
	  ДокОбъект.Заполнить(СтруктураДокумента);
	  ДокОбъект.АвторДокумента=АвторДокумента;
	  
	  ДокОбъект.Сотрудник = ДокОбъект.АвторДокумента;
	  ДокОбъект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа;
	  ДокОбъект.БезПеремещения = Истина;
	  
	  ДокОбъект.Товары.Загрузить(Тз.Выгрузить());
	  ДокОбъект.ЦеныНоменклатуры.Загрузить(ПолучитьЦеныПоНоменклатуре(Тз));
	  ДокОбъект.ЦенаВключаетНДС = Истина;
	  ДокОбъект.ОтражатьВБухгалтерскомУчете = Истина;
	  ДокОбъект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	  
	  
	  Попытка
		  ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	  Исключение
		  Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + ДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки()); 
	  КонецПопытки;   
	  
  КонецПроцедуры
  
  Процедура  ПроверитьОрганизациюСерий(знач Тз);
	  
	  Тз.Свернуть("Организация");
	  Если Тз.Количество()>1 Тогда
		  ВызватьИсключение("Нельзя оформить продажу по разным организациям!"); 
	  КонецЕсли;
	  
  КонецПроцедуры 
  
  Функция ПолучитьЦеныПоНоменклатуре(Тз) //+Лико m.shenderov 11.09.2024
	  
	  Запрос = Новый Запрос;
	  Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	ТЗ.Номенклатура КАК Номенклатура,
	  |	СУММА(ТЗ.Количество) КАК Количество
	  |ПОМЕСТИТЬ ВтНоменклатура
	  |ИЗ
	  |	&ТЗ КАК ТЗ
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ТЗ.Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВтНоменклатура.Номенклатура КАК Номенклатура,
	  |	ВтНоменклатура.Количество КАК Количество,
	  |	1 КАК Цена,
	  |	ВтНоменклатура.Количество КАК Сумма
	  |ИЗ
	  |	ВтНоменклатура КАК ВтНоменклатура";
	  Запрос.УстановитьПараметр("ТЗ",Тз );
	  Возврат Запрос.Выполнить().Выгрузить();;
	  
	  
	  
	  
  КонецФункции //-Лико m.shenderov 11.09.2024 
  
  
  
#КонецОбласти

#Область СборкаВерсия1


Процедура ОбработатьРаспоряжениеВерсия1 (РежимЗаписи,Отказ,ТзНовая=Неопределено) 
	//УстановитьПривилегированныйРежим(Истина); 	
	//СтруктураДанных=СтруктураДанныхДляЗаполненияРаспоряженияВерсия1();
	//
	//СтруктураДанных.Комментарий="Создан в проведении документа: "+ Ссылка; 
	//СоздатьРедактироватьРаспоряжениеДляСкладскихОперацийВерсия1(Распоряжение,СтруктураДанных,РежимЗаписи,Отказ);
	//УстановитьПривилегированныйРежим(Ложь);	
	
	УстановитьПривилегированныйРежим(Истина); 	
	СтруктураДанных=СтруктураДанныхДляЗаполненияРаспоряженияВерсия1(ТзНовая);
	
	СтруктураДанных.Комментарий="Создан в проведении документа: "+ Ссылка; 
	СоздатьРедактироватьРаспоряжениеДляСкладскихОперацийВерсия1(Распоряжение,СтруктураДанных,РежимЗаписи,Отказ);
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры 



Процедура ОбработатьРаспоряжениеВерсия2 (РежимЗаписи,Отказ) 
	УстановитьПривилегированныйРежим(Истина); 	
	СтруктураДанных=СтруктураДанныхДляЗаполненияРаспоряженияВерсия2();
	
	СтруктураДанных.Комментарий="Создан в проведении документа: "+ Ссылка; 
	СоздатьРедактироватьРаспоряжениеДляСкладскихОперацийВерсия2(СтруктураДанных,РежимЗаписи,Отказ);
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры 


Функция СтруктураДанныхДляЗаполненияРаспоряженияВерсия1(ТзНовая)

	Структура = Новый Структура; 	

	Структура.Вставить("Распоряжение"    ,Распоряжение);
	Структура.Вставить("Дата"            ,Дата);
	Структура.Вставить("Организация"     ,Организация);
	Структура.Вставить("Подразделение"   ,Подразделение);
	Структура.Вставить("ПометкаУдаления" ,Ложь);  	

	Структура.Вставить("Ответственный"   ,АвторДокумента);
	Структура.Вставить("Комментарий"); 
	Структура.Вставить("Склад"           ,Склад);
	КоличествоУУ=0;
	Для каждого Товар Из Товары Цикл
		КоличествоУУ=КоличествоУУ+Товар.КоличествоУУ ;
	КонецЦикла;
	Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда	

		ЕСли ЗначениеЗаполнено(ТзНовая) Тогда 
			Тз=ТзНовая;
			Если Тз.Колонки.Найти("КоличествоУУ")=Неопределено Тогда
				Тз.Колонки.Добавить("КоличествоУУ",Новый ОписаниеТипов("Число",
				Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
				Для каждого СтрТз Из Тз Цикл
					СтрТз.КоличествоУУ=СтрТз.КоличествоРасходУУ;
				КонецЦикла;	  
			КонецЕсли;	
		Иначе
			Тз=Выпуск.Выгрузить();
			Тз.Свернуть("Номенклатура,Характеристика","КоличествоУУ");
		КонецЕсли;
		
		
		лВыпуск = Выпуск.Выгрузить();
		лВыпуск.Свернуть("Номенклатура,Характеристика","КоличествоУУ");
		
		Структура.Вставить("Номенклатура"       ,лВыпуск[0].Номенклатура); 
		Структура.Вставить("Характеристика"     ,лВыпуск[0].Характеристика); 
		Структура.Вставить("Количество"         ,лВыпуск[0].КоличествоУУ);
		Структура.Вставить("КоличествоУпаковок" ,лВыпуск[0].КоличествоУУ);
		
		


		ЕСли ЗначениеЗаполнено(ТзНовая) Тогда 
			Структура.Вставить("Товары",ТзНовая); 
		Иначе	
			Структура.Вставить("Товары",Товары.Выгрузить());
		КонецЕсли;
	Иначе
		ЕСли ЗначениеЗаполнено(ТзНовая) Тогда 
			Тз=ТзНовая;
		Иначе
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Списать",Истина);
			МассивСтрок=Товары.НайтиСтроки(СтруктураПоиска);

			Тз         =Товары.Выгрузить(МассивСтрок);
		КонецЕсли;

		Тз.Свернуть("Номенклатура,Характеристика","КоличествоРасходУУ");

		Для каждого СтрокаТЗ  Из Тз Цикл
			Структура.Вставить("Номенклатура",СтрокаТЗ.Номенклатура); 
			Структура.Вставить("Характеристика",СтрокаТЗ.Характеристика); 
			Структура.Вставить("Количество",СтрокаТЗ.КоличествоРасходУУ);
			Структура.Вставить("КоличествоУпаковок",СтрокаТЗ.КоличествоРасходУУ); 		
		КонецЦикла;
		//Структура.Вставить("Номенклатура",Тз[0].Номенклатура); 
		//Структура.Вставить("Характеристика",Тз[0].Характеристика); 
		//Структура.Вставить("Количество",Тз[0].КоличествоРасходУУ);
		//Структура.Вставить("КоличествоУпаковок",Тз[0].КоличествоРасходУУ); 		
		Структура.Вставить("Товары",Выпуск.Выгрузить());
	КонецЕсли;



	Структура.Вставить("Статус",Перечисления.СтатусыСборокТоваров.СобраноРазобрано); 
	Структура.Вставить("ХозяйственнаяОперация",ХозяйственнаяОперация); 
	Структура.Вставить("СборкаПодДеятельность",Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС); 

	Возврат Структура; 		
КонецФункции


Функция СтруктураДанныхДляЗаполненияРаспоряженияВерсия2() 
	Структура = Новый Структура; 	
	
	Структура.Вставить("Распоряжение"			,Распоряжение);
	Структура.Вставить("Дата"					,Дата);
	Структура.Вставить("Организация"			,Организация);
	Структура.Вставить("Подразделение"			,Подразделение);	
	Структура.Вставить("ПометкаУдаления"		,Ложь);  	
	
	Структура.Вставить("Ответственный"			,АвторДокумента	);
	Структура.Вставить("Комментарий"); 
	Структура.Вставить("Склад"					,Склад);
	КоличествоУУ=0;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Списать",Истина);
	МассивСтрок=Товары.НайтиСтроки(СтруктураПоиска);
	Тз=Товары.Выгрузить(МассивСтрок);
	Тз.Свернуть("Номенклатура,Характеристика","КоличествоРасходУУ");
	
	Для каждого СтрокаТЗ  Из Тз Цикл
		Структура.Вставить("Номенклатура",СтрокаТЗ.Номенклатура); 
		Структура.Вставить("Характеристика",СтрокаТЗ.Характеристика); 
		Структура.Вставить("Количество",СтрокаТЗ.КоличествоРасходУУ);
		Структура.Вставить("КоличествоУпаковок",СтрокаТЗ.КоличествоРасходУУ); 		
	КонецЦикла;
	//Структура.Вставить("Номенклатура",Тз[0].Номенклатура); 
	//Структура.Вставить("Характеристика",Тз[0].Характеристика); 
	//Структура.Вставить("Количество",Тз[0].КоличествоРасходУУ);
	//Структура.Вставить("КоличествоУпаковок",Тз[0].КоличествоРасходУУ);
	
	
	
	
	Структура.Вставить("Товары",Тз);
	
	
	
	
	Структура.Вставить("Статус",Перечисления.СтатусыСборокТоваров.СобраноРазобрано); 
	Структура.Вставить("ХозяйственнаяОперация",ХозяйственнаяОперация); 
	Структура.Вставить("СборкаПодДеятельность",Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС); 
	
	Возврат Структура; 		
КонецФункции 



Процедура СоздатьРедактироватьРаспоряжениеДляСкладскихОперацийВерсия1(Распоряжение,ДанныеЗаполнения,РежимЗаписи,Отказ) 
	
	
	СоздатьРедактироватьСборкаТоваровВерсия1(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ);
	
	
	
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
			РаспоряжениеОбъект=Распоряжение.ПолучитьОбъект();
			Попытка
				
				РаспоряжениеОбъект.ПометкаУдаления=Истина;
				РаспоряжениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина); 
				РаспоряжениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Отказ=Истина;
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры 



Процедура СоздатьРедактироватьРаспоряжениеДляСкладскихОперацийВерсия2(ДанныеЗаполнения,РежимЗаписи,Отказ) 
	
	
	СоздатьРедактироватьСписаниеНаРасходы(ДанныеЗаполнения, РежимЗаписи,Отказ);
	
	
	
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗначениеЗаполнено(РаспоряжениеНаОтгрузку) Тогда
			РаспоряжениеОбъект=РаспоряжениеНаОтгрузку.ПолучитьОбъект();
			Попытка
				
				РаспоряжениеОбъект.ПометкаУдаления=Истина;
				РаспоряжениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении",Истина); 
				РаспоряжениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Отказ=Истина;
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры 



Процедура СоздатьРедактироватьСборкаТоваровВерсия1(Распоряжение, ДанныеЗаполнения, РежимЗаписи,Отказ) 
	
	УстановитьПривилегированныйРежим(Истина);
	//Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Или ДополнительныеСвойства.БылПроведен Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	
	РаспоряжениеНаОтгрузку=Неопределено;
	
	ИмяНакладной		="СборкаТоваров";
	ДокументСсылка		=Лико_ОбщегоНазначенияСервер.НайтиДокумент(ИмяНакладной,"Лико_Документ",Ссылка);	
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Распоряжение) Тогда
		НовоеРаспоряжение=Распоряжение.ПолучитьОбъект();
		Если НовоеРаспоряжение=Неопределено Тогда
			//НовоеРаспоряжение=Документы.СборкаТоваров.СоздатьДокумент();	
			НовоеРаспоряжение=ДокументСсылка;
		КонецЕсли;  				
	Иначе                   
		
		НовоеРаспоряжение=Неопределено;	
		
	КонецЕсли;
	
	Если НовоеРаспоряжение=Неопределено Тогда
		Если   ЗначениеЗаполнено(ДокументСсылка) Тогда
			НовоеРаспоряжение=ДокументСсылка.ПолучитьОбъект();
		Иначе
			НовоеРаспоряжение=Документы.СборкаТоваров.СоздатьДокумент();	
		КонецЕсли; 		
	КонецЕсли;
	
	
	
	
	
	ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
	НовоеРаспоряжение.ВариантПриемкиТоваров=Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	НовоеРаспоряжение.СборкаПодДеятельность=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	
	НовоеРаспоряжение.Товары.Очистить(); 	
	Для каждого Товар Из ДанныеЗаполнения.Товары Цикл
		НовыйТовар					=НовоеРаспоряжение.Товары.Добавить();
		НовыйТовар.Номенклатура		=Товар.Номенклатура;
		НовыйТовар.Характеристика	=Товар.Характеристика;
		Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
			НовыйТовар.Количество		=Товар.КоличествоУУ;
			НовыйТовар.КоличествоУпаковок=Товар.КоличествоУУ;
		Иначе
			НовыйТовар.Количество		 =Товар.КоличествоРасходУУ;
			НовыйТовар.КоличествоУпаковок=Товар.КоличествоРасходУУ;			
		КонецЕсли;
		
		НовыйТовар.ДоляСтоимости=НовыйТовар.Количество*1000;
	КонецЦикла;
	
	Ошибка=Неопределено;
	ОрганизацияСерии=Неопределено;
	Если РабочийЦентр.Лико_ДавальческаяСхема Или ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда
		
		Для каждого Товар Из Товары Цикл
			
			
			Если Товар.Списать Тогда
				ОрганизацияСерии=ОпрделитьОрганизацию(Товар.Серия.ЯССМ_ОбъектНоменклатуры,Дата);
				Прервать;
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОрганизацияСерии) ТОгда
		НовоеРаспоряжение.Организация=ОрганизацияСерии;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда
		НовоеРаспоряжение.Организация=ЗаказНаРаскрой.Организация;
	КонецЕсли;
	НовоеРаспоряжение.Лико_Документ=ДополнительныеСвойства.Ссылка;
	Если ЗначениеЗаполнено(ДатаДляТиповыхДокументов) Тогда
		НовоеРаспоряжение.Дата=ДатаДляТиповыхДокументов; 		
	КонецЕсли;
	


Попытка 				
	НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 	
Исключение
	Отказ=Истина;
	Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
КонецПопытки;	
Распоряжение=НовоеРаспоряжение.Ссылка;	
УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры 


Процедура СоздатьРедактироватьСписаниеНаРасходы(ДанныеЗаполнения, РежимЗаписи, Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	
	Если Не РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	
	Распоряжение=Неопределено;
	ИмяНакладной		="ВнутреннееПотребление";
	ДокументСсылка		=Лико_ОбщегоНазначенияСервер.НайтиДокумент(ИмяНакладной,"Лико_Документ",Ссылка);	
	
	
	Если ЗначениеЗаполнено(РаспоряжениеНаОтгрузку) и ТипЗнч(РаспоряжениеНаОтгрузку)=Тип("ДокументСсылка.ВнутреннееПотребление") Тогда
		НовоеРаспоряжение=РаспоряжениеНаОтгрузку.ПолучитьОбъект();
		Если НовоеРаспоряжение=Неопределено Тогда
			НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
		КонецЕсли;  				
	Иначе
		//НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
		НовоеРаспоряжение=Неопределено;
	КонецЕсли;
	
	
	Если НовоеРаспоряжение=Неопределено Тогда
		Если   ЗначениеЗаполнено(ДокументСсылка) Тогда
			НовоеРаспоряжение=ДокументСсылка.ПолучитьОбъект();
		Иначе
			НовоеРаспоряжение=Документы.ВнутреннееПотребление.СоздатьДокумент();	
		КонецЕсли; 		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовоеРаспоряжение,ДанныеЗаполнения);
	
	НовоеРаспоряжение.Товары.Загрузить(ДанныеЗаполнения.Товары); 	
	НовоеРаспоряжение.Лико_Документ=ДополнительныеСвойства.Ссылка;
	
	НовоеРаспоряжение.Товары.Очистить();
	
	Для каждого СтрТовар Из ДанныеЗаполнения.Товары Цикл
		Товар= НовоеРаспоряжение.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Товар,СтрТовар);
		Товар.КоличествоУпаковок=СтрТовар.КоличествоРасходУУ;
		Товар.Количество=СтрТовар.КоличествоРасходУУ;
		Если ЗначениеЗаполнено(Товар.Номенклатура.Лико_СтатьяРасходов) Тогда
			Товар.СтатьяРасходов=Товар.Номенклатура.Лико_СтатьяРасходов;
		Иначе
			Товар.СтатьяРасходов=Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Товар.Номенклатура);
			Если Не ЗначениеЗаполнено(Товар.СтатьяРасходов) Тогда
				Товар.СтатьяРасходов=Справочники.Лико_ПредопределенныеЗначения.СтатьяСписанияМатериаловНеопределена.ЗначениеПараметра;  
			КонецЕсли; 				
		КонецЕсли;
		Товар.СтатьяРасходов=ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("1602 тестирование материалов") ;
		Товар.АналитикаРасходов=Справочники.Лико_ПредопределенныеЗначения.АналитикаРасходовСписанияМатериалов.ЗначениеПараметра;
		
	КонецЦикла;
	
	
	
	
	
	Попытка 				
		НовоеРаспоряжение.Записать(РежимЗаписиДокумента.Проведение); 	
	Исключение
		Отказ=Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + Ссылка + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
	КонецПопытки;	
	РаспоряжениеНаОтгрузку=НовоеРаспоряжение.Ссылка;	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


Процедура ПодготовитьСборку150321(Отказ, Знач РежимЗаписи)

//Перем Выборка, Запрос, РезультатЗапроса, ТзВыпуск, ТзТовары, Товар;
//Если ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда	
//	Для каждого Товар Из Товары Цикл
//		Товар.Списать=Истина; 		
//	КонецЦикла;
//КонецЕсли;
//ТзТоварыСв=Товары.Выгрузить();
//ТзВыпуск=Выпуск.Выгрузить();
//ТзТоварыСв.Свернуть("Номенклатура,Характеристика,Списать");
//ТзВыпуск.Свернуть("Номенклатура,Характеристика");
//Структура = Новый Структура;
//Структура.Вставить("Списать",Истина); 	
//ТзТовары=ТзТоварыСв.НайтиСтроки(Структура);
//
//
//Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда	
//	Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров и ТзТовары.Количество()>1  Тогда
//		Отказ=Истина;
//		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя разобрать(раскроить) больше 1 номенклатуры в документе! Сделайте разныим документами. ");
//		
//	ИначеЕсли ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров и ТзВыпуск.Количество()>1  Тогда
//		Отказ=Истина;
//		
//		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Ссылка+"Нельзя собрать больше 1 номенклатуры в документе! Сделайте разныим документами. ");       
//		
//	КонецЕсли;
//	
//	////Временно блкируем
//	
//	////Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров и ТзТовары.Количество()=0  Тогда
//	////	Отказ=Истина;
//	////	Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя разобрать(раскроить) 0 номенклатуры в документе!  ");
//	////	
//	////ИначеЕсли ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров и ТзВыпуск.Количество()=0  Тогда
//	////	Отказ=Истина;
//	////	
//	////	Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Ссылка+"Нельзя собрать 0 номенклатуры в документе!");       
//	////	
//	////КонецЕсли;
//	
//	
//КонецЕсли;	
//
//Если Не Отказ Тогда
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//"ВЫБРАТЬ
//|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
//|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
//|	Лико_БланкЭтапаТовары.КоличествоРасход КАК КоличествоРасход,
//|	Лико_БланкЭтапаТовары.Серия КАК Серия,
//|	Лико_БланкЭтапаТовары.КоличествоРасходУУ КАК КоличествоРасходУУ
//|ПОМЕСТИТЬ ВтСерии
//|ИЗ
//|	&Товары КАК Лико_БланкЭтапаТовары
//|ГДЕ
//|	Лико_БланкЭтапаТовары.Списать
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ВтСерии.Номенклатура КАК Номенклатура,
//|	ВтСерии.Характеристика КАК Характеристика,
//|	ВтСерии.КоличествоРасход КАК КоличествоРасход,
//|	ВтСерии.Серия КАК Серия,
//|	ВтСерии.КоличествоРасходУУ КАК КоличествоРасходУУ,
//|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВтСерии.КоличествоРасходУУ КАК Остаток
//|ИЗ
//|	ВтСерии КАК ВтСерии
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
//|				&МомВрем,
//|				Серия В
//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//|						ВтСерии.Серия КАК Серия
//|					ИЗ
//|						ВтСерии КАК ВтСерии)) КАК ТоварыНаСкладахОстатки
//|		ПО ВтСерии.Серия = ТоварыНаСкладахОстатки.Серия
//|ГДЕ
//|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВтСерии.КоличествоРасходУУ > 0";
//	Запрос.УстановитьПараметр("Товары",Товары.Выгрузить() );
//	Если ЗначениеЗаполнено(Ссылка) Тогда
//		Запрос.УстановитьПараметр("МомВрем", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
//	Иначе
//		Запрос.УстановитьПараметр("МомВрем", ТекущаяДата());
//		
//	КонецЕсли;
//	
//	РезультатЗапроса = Запрос.Выполнить(); 
//	ПоАктуРазборки=Ложь;
//	Выборка = РезультатЗапроса.Выбрать();
//	Если Выборка.Количество()=0 Тогда
//		ПоАктуРазборки=Истина;
//	Иначе
//		Пока Выборка.Следующий() Цикл
//			Если Выборка.Остаток<0 Тогда
//				ПоАктуРазборки=Истина;
//				Прервать;
//			КонецЕсли;			
//		КонецЦикла; 
//	КонецЕсли;		
//	Если Не ПоАктуРазборки Тогда
//		
//		
//		ОбработатьРаспоряжениеВерсия1(РежимЗаписи,Отказ); 
//	Иначе
//		
//		ОбработатьРаспоряжениеВерсия1(РежимЗаписиДокумента.ОтменаПроведения,Отказ); 			
//	КонецЕсли;  	
//	
//КонецЕсли;

Перем Выборка, Запрос, РезультатЗапроса, ТзВыпуск, ТзТовары, Товар;
Если ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда	
	Для каждого Товар Из Товары Цикл
		Товар.Списать=Истина; 		
	КонецЦикла;
КонецЕсли;
ТзТоварыСв=Товары.Выгрузить();
ТзВыпуск=Выпуск.Выгрузить();
ТзТоварыСв.Свернуть("Номенклатура,Характеристика,Списать");
ТзВыпуск.Свернуть("Номенклатура,Характеристика");
Структура = Новый Структура;
Структура.Вставить("Списать",Истина); 	
ТзТовары=ТзТоварыСв.НайтиСтроки(Структура);


Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда	
	Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров и ТзТовары.Количество()>1  Тогда
		Отказ=Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя разобрать(раскроить) больше 1 номенклатуры в документе! Сделайте разныим документами. ");
		
	ИначеЕсли ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров и ТзВыпуск.Количество()>1  Тогда
		Отказ=Истина;
		
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Ссылка+"Нельзя собрать больше 1 номенклатуры в документе! Сделайте разныим документами. ");       
		
	КонецЕсли;
	
	////Временно блкируем
	
	////Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров и ТзТовары.Количество()=0  Тогда
	////	Отказ=Истина;
	////	Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя разобрать(раскроить) 0 номенклатуры в документе!  ");
	////	
	////ИначеЕсли ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров и ТзВыпуск.Количество()=0  Тогда
	////	Отказ=Истина;
	////	
	////	Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Ссылка+"Нельзя собрать 0 номенклатуры в документе!");       
	////	
	////КонецЕсли;
	
	
КонецЕсли;	

Если Не Отказ Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	Лико_БланкЭтапаТовары.КоличествоРасход КАК КоличествоРасход,
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	Лико_БланкЭтапаТовары.КоличествоРасходУУ КАК КоличествоРасходУУ
	|ПОМЕСТИТЬ ВтСерии
	|ИЗ
	|	&Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Списать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСерии.Номенклатура КАК Номенклатура,
	|	ВтСерии.Характеристика КАК Характеристика,
	|	ВтСерии.КоличествоРасход КАК КоличествоРасход,
	|	ВтСерии.Серия КАК Серия,
	|	ВтСерии.КоличествоРасходУУ КАК КоличествоРасходУУ,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВтСерии.КоличествоРасходУУ КАК Остаток
	|ИЗ
	|	ВтСерии КАК ВтСерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МомВрем,
	|				Серия В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВтСерии.Серия КАК Серия
	|					ИЗ
	|						ВтСерии КАК ВтСерии)) КАК ТоварыНаСкладахОстатки
	|		ПО ВтСерии.Серия = ТоварыНаСкладахОстатки.Серия
	|ГДЕ
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВтСерии.КоличествоРасходУУ >= 0";
	Запрос.УстановитьПараметр("Товары",Товары.Выгрузить() );
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.УстановитьПараметр("МомВрем", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Иначе
		Запрос.УстановитьПараметр("МомВрем", ТекущаяДата());
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ПоАктуРазборки=Ложь;
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество()=0 Тогда
		ПоАктуРазборки=Истина;
		//Иначе
		//	Пока Выборка.Следующий() Цикл
		//		Если Выборка.Остаток<0 Тогда
		//			ПоАктуРазборки=Истина;
		//			Прервать;
		//		КонецЕсли;			
		//	КонецЦикла; 
	КонецЕсли;		
	Если Не ПоАктуРазборки Тогда
		
		
		ОбработатьРаспоряжениеВерсия1(РежимЗаписи,Отказ,Запрос.Выполнить().Выгрузить()); 
	Иначе
		
		ОбработатьРаспоряжениеВерсия1(РежимЗаписиДокумента.ОтменаПроведения,Отказ); 			
	КонецЕсли;  	
	
КонецЕсли;


КонецПроцедуры

Процедура ПодготовитьСборку(Отказ, Знач РежимЗаписи)
	Если ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда	
		Для каждого Товар Из Товары Цикл
			Товар.Списать=Истина; 		
		КонецЦикла;
	КонецЕсли;
	ТзТоварыСв=Товары.Выгрузить();
	ТзВыпуск=Выпуск.Выгрузить();
	ТзТоварыСв.Свернуть("Номенклатура,Характеристика,Списать");
	ТзВыпуск.Свернуть("Номенклатура,Характеристика");
	Структура = Новый Структура;
	Структура.Вставить("Списать",Истина); 	
	ТзТовары=ТзТоварыСв.НайтиСтроки(Структура);
	
	ТзСерииСписания=Товары.Выгрузить();
	ТзСерииСписания.Свернуть("Номенклатура,Характеристика,Серия,Списать"); 
	Структура = Новый Структура;
	Структура.Вставить("Списать",Истина); 	
	ТзСерииСв=ТзСерииСписания.НайтиСтроки(Структура);
	ЭтоРастаркаКраски=ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров 
			И ТзТовары.Количество()>0 
			И ТзТовары[0].Номенклатура.ВидНоменклатуры = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра;


	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		//И Не РабочийЦентр.Лико_СнятьОграниченияВЗакрытииБланка Тогда	
		Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров и ТзТовары.Количество()>1  Тогда
			Отказ=Истина;
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя разобрать(раскроить) больше 1 номенклатуры в документе! Сделайте разныим документами. ");

		ИначеЕсли ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров и Выпуск.Количество()>1  Тогда
			Отказ=Истина;
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя собрать больше 1 номенклатуры(упаковки) в документе! Сделайте разныим документами. "); 
		КонецЕсли;
		
		Если ЭтоРастаркаКраски И  ТзСерииСв.Количество()>1 Тогда
			
			Отказ=Истина;
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя растарить больше 1 упаковки в документе! Сделайте разныим документами. ");

			
		КонецЕсли;
		
		

		////Временно блкируем

		////Если ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.РазборкаТоваров и ТзТовары.Количество()=0  Тогда
		////	Отказ=Истина;
		////	Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Строка(Ссылка)+"Нельзя разобрать(раскроить) 0 номенклатуры в документе!  ");
		////	
		////ИначеЕсли ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.СборкаТоваров и ТзВыпуск.Количество()=0  Тогда
		////	Отказ=Истина;
		////	
		////	Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(Ссылка+"Нельзя собрать 0 номенклатуры в документе!");       
		////	
		////КонецЕсли;


	КонецЕсли;	

	Если Не Отказ Тогда 
		Если ЭтоРастаркаКраски  Тогда 
			
			ДатаФормирования= ТзСерииСв[0].Серия.Яссм_ОбъектНоменклатуры.ДатаФормирования;
			
			Для Каждого СтрВыруск Из Выпуск Цикл 
				
				ОбъектНоменклатуры=СтрВыруск.Серия.ЯССМ_ОбъектНоменклатуры;
				
				Если ОбъектНоменклатуры.ДатаФормирования<>ДатаФормирования Тогда
					
					СпрОбъект = ОбъектНоменклатуры.ПолучитьОбъект();
					СпрОбъект.ДатаФормирования = ДатаФормирования;
					СпрОбъект.ОбменДанными.Загрузка=Истина;
					СпрОбъект.Записать();  
					
				КонецЕсли;				
				
			КонецЦикла;
			
		КонецЕсли;
		
		

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
		|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
		|	Лико_БланкЭтапаТовары.КоличествоРасход КАК КоличествоРасход,
		|	Лико_БланкЭтапаТовары.Серия КАК Серия,
		|	Лико_БланкЭтапаТовары.КоличествоРасходУУ КАК КоличествоРасходУУ
		|ПОМЕСТИТЬ ВтСерии
		|ИЗ
		|	&Товары КАК Лико_БланкЭтапаТовары
		|ГДЕ
		|	Лико_БланкЭтапаТовары.Списать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСерии.Номенклатура КАК Номенклатура,
		|	ВтСерии.Характеристика КАК Характеристика,
		|	ВтСерии.КоличествоРасход КАК КоличествоРасход,
		|	ВтСерии.Серия КАК Серия,
		|	ВтСерии.КоличествоРасходУУ КАК КоличествоРасходУУ2,
		|	Выбор Когда ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)<= ВтСерии.КоличествоРасходУУ 
	    | Тогда ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) Иначе  ВтСерии.КоличествоРасходУУ Конец  КАК КоличествоРасходУУ
		|ИЗ
		|	ВтСерии КАК ВтСерии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&МомВрем,
		|				Серия В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВтСерии.Серия КАК Серия
		|					ИЗ
		|						ВтСерии КАК ВтСерии)) КАК ТоварыНаСкладахОстатки
		|		ПО ВтСерии.Серия = ТоварыНаСкладахОстатки.Серия
		|ГДЕ
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)>0";
		//|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВтСерии.КоличествоРасходУУ>=0";
		Запрос.УстановитьПараметр("Товары",Товары.Выгрузить());
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Запрос.УстановитьПараметр("МомВрем", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
		Иначе
			Запрос.УстановитьПараметр("МомВрем", ТекущаяДата());

		КонецЕсли;

		РезультатЗапроса = Запрос.Выполнить(); 
		ПоАктуРазборки=Ложь;
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество()=0 Тогда
			ПоАктуРазборки=Истина;
			//Иначе
			//	Пока Выборка.Следующий() Цикл
			//		Если Выборка.Остаток<0 Тогда
			//			ПоАктуРазборки=Истина;
			//			Прервать;
			//		КонецЕсли;			
			//	КонецЦикла; 
		КонецЕсли;		
		Если Не ПоАктуРазборки Тогда


			ОбработатьРаспоряжениеВерсия1(РежимЗаписи,Отказ,Запрос.Выполнить().Выгрузить()); 
		Иначе

			ОбработатьРаспоряжениеВерсия1(РежимЗаписиДокумента.ОтменаПроведения,Отказ); 			
		КонецЕсли;  	

	КонецЕсли;


КонецПроцедуры

Процедура ПодготовитьСписание(Отказ, Знач РежимЗаписи)
ОбработатьРаспоряжениеВерсия2(РежимЗаписи,Отказ);
КонецПроцедуры

фУНКЦИЯ ОпрделитьОрганизацию(ОбъектНоменклатуры,Дата) //+Лико m.shenderov 01.10.2018
Если  ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда
	Возврат ЗаказНаРаскрой.Организация;
КонецЕсли;

лОрганизация=Неопределено;
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ ПЕРВЫЕ 1
|	ТоварыВЯчейках.Регистратор КАК Регистратор
|ИЗ
|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
|ГДЕ
|	ТоварыВЯчейках.Период < &Дата
|	И ТоварыВЯчейках.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
|	И (ТоварыВЯчейках.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
|			ИЛИ ТоварыВЯчейках.Регистратор ССЫЛКА Документ.Лико_БланкЭтапа)
|	И ТоварыВЯчейках.Серия.ЯССМ_ОбъектНоменклатуры = &ОбъектНоменклатуры
|
|УПОРЯДОЧИТЬ ПО
|	ТоварыВЯчейках.Период УБЫВ";
Запрос.УстановитьПараметр("Дата",Дата);
Запрос.УстановитьПараметр("ОбъектНоменклатуры",ОбъектНоменклатуры);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
	лОрганизация= Выборка.Регистратор.Распоряжение.Организация;
КонецЦикла; 
Если ЗначениеЗаполнено(ЗаказНаРаскрой) Тогда
	лОрганизация=ЗаказНаРаскрой.Организация;
КонецЕсли;

Возврат лОрганизация;
кОНЕЦФУНКЦИИ //-Лико m.shenderov 01.10.2018

Процедура ПроставитьВидНастроечногоМатериала(); //+Лико m.shenderov 16.04.2019
ТипНастроечногоМатериала=Неопределено;
Для каждого Товар Из Товары Цикл
	
	Если Товар.Списать Тогда
		ВидНастроечногоМатериала=Товар.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала;
		Прервать;
	КонецЕсли;
	
	
КонецЦикла;
ЕСли ЗначениеЗаполнено(ВидНастроечногоМатериала) ТОгда
	Для каждого СтрВыпуск Из Выпуск Цикл
		
		Если СтрВыпуск.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала<>ВидНастроечногоМатериала Тогда
			СпрОбъект= СтрВыпуск.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
			СпрОбъект.ВидНастроечногоМатериала=ВидНастроечногоМатериала;
			СпрОбъект.Записать();
			
		КонецЕсли;
		
		
	КонецЦикла;
КонецЕсли;


КонецПроцедуры //-Лико m.shenderov 16.04.2019


Процедура BRCНаследованиеОбъектовНоменклатуры011220()
	
		//+BRC наследование	
	Если УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC") и Выпуск.Количество()>0 Тогда 		
		BRCОбъектНоменклатуры=Неопределено;
		УпотребитьДо=Неопределено;
		Для каждого Товар Из ТОвары Цикл
			Если Товар.Списать ТОгда
				ОбъектУпотребитьДо=Товар.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо;
				Если  ЗначениеЗаполнено(ОбъектУпотребитьДо) Тогда  					
					Если УпотребитьДо=Неопределено ИЛИ	ОбъектУпотребитьДо<УпотребитьДо Тогда
						BRCОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
						УпотребитьДо=ОбъектУпотребитьДо;
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЗаказПокупателя) и Выпуск.НайтиСтроки(Новый Структура("Номенклатура",BRCОбъектНоменклатуры.Номенклатура)).Количество()=0 Тогда
			ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу=Неопределено;	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
			|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо КАК СерияЯССМ_ОбъектНоменклатурыУпотребитьДо
			|ИЗ
			|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
			|ГДЕ
			|	Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя = &ЗаказПокупателя
			|	И Лико_БланкЭтапаТовары.Ссылка.Проведен
			|	И Лико_БланкЭтапаТовары.Списать
			|	И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо <> ДАТАВРЕМЯ(1, 1, 1)
			|
			|УПОРЯДОЧИТЬ ПО
			|	СерияЯССМ_ОбъектНоменклатурыУпотребитьДо";
			Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу=Выборка.ОбъектНоменклатуры;				
				Если BRCОбъектНоменклатуры=Неопределено Или ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу.УпотребитьДо<BRCОбъектНоменклатуры.УпотребитьДо Тогда					
					BRCОбъектНоменклатуры= ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу;
				КонецЕсли; 				
			КонецЦикла; 			
		КонецЕсли;		
		Если ЗначениеЗаполнено(BRCОбъектНоменклатуры) Тогда
			
			Для каждого СтрВыпуск Из Выпуск Цикл
				ТекОбъектНоменклатуры=СтрВыпуск.Серия.ЯССМ_ОбъектНоменклатуры;				
				Если СтрВыпуск.Номенклатура=BRCОбъектНоменклатуры.Номенклатура Тогда					
					Если  
						BRCОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией<> ТекОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией Или  
						BRCОбъектНоменклатуры.УпотребитьДо<> ТекОбъектНоменклатуры.УпотребитьДо Или 
						BRCОбъектНоменклатуры.ДатаПроизводства<> ТекОбъектНоменклатуры.ДатаПроизводства Или 
						BRCОбъектНоменклатуры.НомерПартииИзготовления<> ТекОбъектНоменклатуры.НомерПартииИзготовления Тогда
						ОбъектОбъектНоменклатуры									=ТекОбъектНоменклатуры.ПолучитьОбъект();
						ОбъектОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией		= BRCОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией; 
						ОбъектОбъектНоменклатуры.УпотребитьДо						= BRCОбъектНоменклатуры.УпотребитьДо; 
						ОбъектОбъектНоменклатуры.ДатаПроизводства					= BRCОбъектНоменклатуры.ДатаПроизводства; 
						ОбъектОбъектНоменклатуры.НомерПартииИзготовления			= BRCОбъектНоменклатуры.НомерПартииИзготовления;
						ОбъектОбъектНоменклатуры.Записать();
						
					КонецЕсли;	
					
				Иначе
					
					Если  
						
						BRCОбъектНоменклатуры.УпотребитьДо<> ТекОбъектНоменклатуры.УпотребитьДо Или 
						BRCОбъектНоменклатуры.ДатаПроизводства<> Дата Или 
						BRCОбъектНоменклатуры.НомерПартииИзготовления<> ЗаказПокупателя.НомерБезПрефикса Тогда
						ОбъектОбъектНоменклатуры									=ТекОбъектНоменклатуры.ПолучитьОбъект();
						
						ОбъектОбъектНоменклатуры.УпотребитьДо						= BRCОбъектНоменклатуры.УпотребитьДо; 
						ОбъектОбъектНоменклатуры.ДатаПроизводства					= Дата; 
						ОбъектОбъектНоменклатуры.НомерПартииИзготовления			= ЗаказПокупателя.НомерБезПрефикса;
						ОбъектОбъектНоменклатуры.Записать();
						
					КонецЕсли;	  					
				КонецЕсли;				
			КонецЦикла;			
		КонецЕсли;		
	КонецЕсли;
	//-BRC наследование	
	

	
КонецПроцедуры


Процедура BRCНаследованиеОбъектовНоменклатуры()
	Попытка
		
		BRC=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC");
		Если ЗначениеЗаполнено(BRC) и Выпуск.Количество()>0 Тогда 
		Иначе
			Возврат;	
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЭтоСборка				=Ложь;
		BRCОбъектНоменклатуры	=Справочники.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка();
		ОпределитьТипДокументаЗакрытияБланка(BRCОбъектНоменклатуры,ЭтоСборка);
		Если  ЭтоСборка Тогда
			ЗаполнитьОбъектыНоменклатурыСборки(BRCОбъектНоменклатуры);
		Иначе
			ЗаполнитьОбъектыНоменклатурыВыпуска(BRCОбъектНоменклатуры)
		КонецЕсли; 		
	Исключение
		
	КонецПопытки;
	
	
//	Попытка
//	
//	BRC=УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC");
//	//+BRC наследование	
//	Если ЗначениеЗаполнено(BRC) и Выпуск.Количество()>0 Тогда 		
//		BRCОбъектНоменклатуры=Справочники.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка();
//		УпотребитьДо=Неопределено;
//		Для каждого Товар Из ТОвары Цикл
//			Если Товар.Списать ТОгда
//				ОбъектУпотребитьДо=Товар.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо;
//				Если  ЗначениеЗаполнено(ОбъектУпотребитьДо) Тогда  					
//					Если УпотребитьДо=Неопределено ИЛИ	ОбъектУпотребитьДо<УпотребитьДо Тогда
//						BRCОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
//						УпотребитьДо=ОбъектУпотребитьДо;
//					КонецЕсли;					
//				КонецЕсли;				
//			КонецЕсли;			
//		КонецЦикла;
//		
//		Если ЗначениеЗаполнено(ЗаказПокупателя) и Выпуск.НайтиСтроки(Новый Структура("Номенклатура",BRCОбъектНоменклатуры.Номенклатура)).Количество()=0 Тогда
//			ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу=Неопределено;	
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//			"ВЫБРАТЬ ПЕРВЫЕ 1
//			|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
//			|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо КАК СерияЯССМ_ОбъектНоменклатурыУпотребитьДо
//			|ИЗ
//			|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
//			|ГДЕ
//			|	Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя = &ЗаказПокупателя
//			|	И Лико_БланкЭтапаТовары.Ссылка.Проведен
//			|	И Лико_БланкЭтапаТовары.Списать
//			|	И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо <> ДАТАВРЕМЯ(1, 1, 1)
//			|
//			|УПОРЯДОЧИТЬ ПО
//			|	СерияЯССМ_ОбъектНоменклатурыУпотребитьДо";
//			Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
//			РезультатЗапроса = Запрос.Выполнить();
//			Выборка = РезультатЗапроса.Выбрать();
//			Пока Выборка.Следующий() Цикл
//				ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу=Выборка.ОбъектНоменклатуры;				
//				Если BRCОбъектНоменклатуры=Неопределено Или ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу.УпотребитьДо<BRCОбъектНоменклатуры.УпотребитьДо Тогда					
//					BRCОбъектНоменклатуры= ОбъектНоменклатурыСМинДатойУпотребленияПоЗаказу;
//				КонецЕсли; 				
//			КонецЦикла; 			
//		КонецЕсли;		
//		Если ЗначениеЗаполнено(BRCОбъектНоменклатуры) Тогда
//			
//			Для каждого СтрВыпуск Из Выпуск Цикл
//				ТекОбъектНоменклатуры=СтрВыпуск.Серия.ЯССМ_ОбъектНоменклатуры;				
//				Если СтрВыпуск.Номенклатура=BRCОбъектНоменклатуры.Номенклатура Тогда					
//					Если  
//						BRCОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией<> ТекОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией Или  
//						BRCОбъектНоменклатуры.УпотребитьДо<> ТекОбъектНоменклатуры.УпотребитьДо Или 
//						BRCОбъектНоменклатуры.ДатаПроизводства<> ТекОбъектНоменклатуры.ДатаПроизводства Или 
//						BRCОбъектНоменклатуры.НомерПартииИзготовления<> ТекОбъектНоменклатуры.НомерПартииИзготовления Тогда
//						ОбъектОбъектНоменклатуры									=ТекОбъектНоменклатуры.ПолучитьОбъект();
//						ОбъектОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией		= BRCОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией; 
//						ОбъектОбъектНоменклатуры.УпотребитьДо						= BRCОбъектНоменклатуры.УпотребитьДо; 
//						ОбъектОбъектНоменклатуры.ДатаПроизводства					= BRCОбъектНоменклатуры.ДатаПроизводства; 
//						ОбъектОбъектНоменклатуры.НомерПартииИзготовления			= BRCОбъектНоменклатуры.НомерПартииИзготовления;
//						ОбъектОбъектНоменклатуры.Записать();
//						
//					КонецЕсли;	
//					
//				Иначе
//					
//					Если  
//						
//						BRCОбъектНоменклатуры.УпотребитьДо<> ТекОбъектНоменклатуры.УпотребитьДо Или 
//						BRCОбъектНоменклатуры.ДатаПроизводства<> Дата Или 
//						BRCОбъектНоменклатуры.НомерПартииИзготовления<> ЗаказПокупателя.НомерБезПрефикса Тогда
//						ОбъектОбъектНоменклатуры									=ТекОбъектНоменклатуры.ПолучитьОбъект();
//						
//						ОбъектОбъектНоменклатуры.УпотребитьДо						= BRCОбъектНоменклатуры.УпотребитьДо; 
//						ОбъектОбъектНоменклатуры.ДатаПроизводства					= Дата; 
//						ОбъектОбъектНоменклатуры.НомерПартииИзготовления			= ЗаказПокупателя.НомерБезПрефикса;
//						ОбъектОбъектНоменклатуры.Записать();
//						
//					КонецЕсли;	  					
//				КонецЕсли;				
//			КонецЦикла;			
//		КонецЕсли;		
//		
//	КонецЕсли;
//Исключение
//	
//КонецПопытки;

//-BRC наследование	



КонецПроцедуры



Процедура ОпределитьТипДокументаЗакрытияБланка(BRCОбъектНоменклатуры,ЭтоСборка)
	НоменклатураКоличествоРасход=0;
	
	Для каждого Товар Из Товары Цикл
		Если Товар.Списать Тогда
			Если  BRCОбъектНоменклатуры.Номенклатура<>Товар.Номенклатура Тогда
				НоменклатураКоличествоРасход=НоменклатураКоличествоРасход+1;				
			КонецЕсли;
			Если Не ЗначениеЗаполнено( BRCОбъектНоменклатуры) Тогда
				BRCОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			Иначе
				УпотребитьДо=Товар.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо;
				Если  ЗначениеЗаполнено(УпотребитьДо) и BRCОбъектНоменклатуры.УпотребитьДо>УпотребитьДо Тогда
					BRCОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;
				КонецЕсли;				   
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	ТзВыпуск=Выпуск.Выгрузить();
	ТзВыпуск.Свернуть("Номенклатура");
	Если НоменклатураКоличествоРасход=1  и 
		ТзВыпуск.Количество()=1 и 
		BRCОбъектНоменклатуры.Номенклатура=ТзВыпуск[0].Номенклатура Тогда
		ЭтоСборка=Истина;
	Иначе
		ЭтоСборка=Ложь;
	КонецЕсли;
	
	Если ВидОперации=Перечисления.Лико_ВидыОперацийЗакрытияБланка.СборкаРазборка Тогда
		ЭтоСборка=Истина; 
	КонецЕсли;
	
	
	
КонецПроцедуры


Процедура ЗаполнитьОбъектыНоменклатурыСборки(BRCОбъектНоменклатуры)
		     	Для каждого СтрВыпуск Из Выпуск Цикл
				ТекОбъектНоменклатуры=СтрВыпуск.Серия.ЯССМ_ОбъектНоменклатуры;				
								
					Если  
						BRCОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией<> ТекОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией Или  
						BRCОбъектНоменклатуры.УпотребитьДо<> ТекОбъектНоменклатуры.УпотребитьДо Или 
						BRCОбъектНоменклатуры.ДатаПроизводства<> ТекОбъектНоменклатуры.ДатаПроизводства Или 
						BRCОбъектНоменклатуры.НомерПартииИзготовления<> ТекОбъектНоменклатуры.НомерПартииИзготовления Тогда
						ОбъектОбъектНоменклатуры									=ТекОбъектНоменклатуры.ПолучитьОбъект();
						ОбъектОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией		= BRCОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией; 
						ОбъектОбъектНоменклатуры.УпотребитьДо						= BRCОбъектНоменклатуры.УпотребитьДо; 
						ОбъектОбъектНоменклатуры.ДатаПроизводства					= BRCОбъектНоменклатуры.ДатаПроизводства; 
						ОбъектОбъектНоменклатуры.НомерПартииИзготовления			= BRCОбъектНоменклатуры.НомерПартииИзготовления;
						ОбъектОбъектНоменклатуры.Записать();
						
					КонецЕсли;					
			КонецЦикла;			

КонецПроцедуры


Процедура ЗаполнитьОбъектыНоменклатурыВыпуска(BRCОбъектНоменклатуры)
	Если  НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат;
	КонецЕсли;
	УпотребитьДо=ПолучитьСрокГодностиИзЗакрытийБланка();
	Если ЗначениеЗаполнено(УпотребитьДо) И BRCОбъектНоменклатуры.УпотребитьДо>УпотребитьДо Тогда
	Иначе
		УпотребитьДо=BRCОбъектНоменклатуры.УпотребитьДо;
	КонецЕсли;
	
	Для каждого СтрВыпуск Из Выпуск Цикл
		ТекОбъектНоменклатуры=СтрВыпуск.Серия.ЯССМ_ОбъектНоменклатуры;				
		
		Если  
			BRCОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией<> ЗаказПокупателя.ВидКонтактаСПищевойПродукцией Или  
			BRCОбъектНоменклатуры.УпотребитьДо<> УпотребитьДо Или 
			BRCОбъектНоменклатуры.ДатаПроизводства<> Дата Или 
			BRCОбъектНоменклатуры.НомерПартииИзготовления<> ЗаказПокупателя.НомерБезПрефикса Тогда
			ОбъектОбъектНоменклатуры									=ТекОбъектНоменклатуры.ПолучитьОбъект();
			ОбъектОбъектНоменклатуры.УпотребитьДо						= ?(ЗначениеЗаполнено(BRCОбъектНоменклатуры.УпотребитьДо),BRCОбъектНоменклатуры.УпотребитьДо,Дата+(60*60*24*182)); 
			ОбъектОбъектНоменклатуры.ДатаПроизводства					= Дата; 
			ОбъектОбъектНоменклатуры.НомерПартииИзготовления			= ЗаказПокупателя.НомерБезПрефикса;
			ОбъектОбъектНоменклатуры.Записать(); 				
			
		КонецЕсли;					
	КонецЦикла;			
	
КонецПроцедуры


Функция ПолучитьСрокГодностиИзЗакрытийБланка()
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо) КАК УпотребитьДо
		|ИЗ
		|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
		|ГДЕ
		|	Лико_БланкЭтапаТовары.Ссылка.Проведен
		|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя = &ЗаказПокупателя
		|	И Лико_БланкЭтапаТовары.Ссылка.НомерПроката = &НомерПроката
		|	И Лико_БланкЭтапаТовары.Ссылка.НомерБланка = &НомерБланка
		|	И Лико_БланкЭтапаТовары.Списать
		|	И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо <> ДАТАВРЕМЯ(1, 1, 1)";
		Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя );
		Запрос.УстановитьПараметр("НомерПроката",НомерПроката );
		Запрос.УстановитьПараметр("НомерБланка",НомерБланка );

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
		     Возврат Выборка.УпотребитьДо;
		КонецЦикла; 
		
		
КонецФункции






#КонецОбласти

#Область ГравировальныйУчасток

Процедура УстановкаЦеныНаВыпускГравировальногоУчастка(Отказ) //+Лико m.shenderov 11.02.2021
	
	Если Отказ Или  РабочийЦентр.ВидРабочегоЦентра<>Справочники.ВидыРабочихЦентров.ГравировальныйУчасток Тогда
		Возврат;
	КонецЕсли; 			
	Если Не ПроверитьДатуНачалаУстановкиЦеныНаВыпускГравировальногоУчастка()  Тогда 
		Возврат;
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Истина);
	ТзПараметрыШтампа=ПолучитьПараметрыШтампа();	
	ПроверитьЗапролнениеПолейГравировальныйУчасток(ТзПараметрыШтампа,Отказ);
	УстановитьЦенуШтампаГравировальныйУчасток(ТзПараметрыШтампа,Отказ);
		
		
КонецПроцедуры //-Лико m.shenderov 11.02.2021

Процедура КонтрольВыполненияПоНесколькимОсонваниям(Отказ) //+Лико m.shenderov 05.02.2024
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) 
		И ЗначениеЗаполнено(ЗаказНаРаскрой) 
		И ЗаказНаРаскрой.ВидРабот=Справочники.ВидыРаботСотрудников.Активация Тогда 
		
		Текст=СтрШаблон("Нельзя выполнить работу по двум документам! Выберите один документ в качестве основания: %1 ; %2",ЗаказПокупателя,ЗаказНаРаскрой);
		
		ОбщегоНазначения.СообщитьПользователю(Текст,,"Объект.ЗаказПокупателя",, Отказ);
		ОбщегоНазначения.СообщитьПользователю(Текст,,"Объект.ЗаказНаРаскрой",, Отказ);
		
		
	КонецЕсли; 
	
КонецПроцедуры //-Лико m.shenderov 05.02.2024





Процедура УстановитьЦенуШтампаГравировальныйУчасток (ТзПараметрыШтампа,Отказ) //+Лико m.shenderov 14.02.2021
	
	 	Если Отказ=Истина Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЦенДляГУ=ПолучитьСтруктуруЦенДляГравировальногоУчастка();
	ПлощадьМатериала=0;
	
	Для каждого Товар Из Товары Цикл
		Если Товар.Списать Тогда
			ПлощадьМатериала=ПлощадьМатериала+Товар.КоличествоРасходУУ;
		КонецЕсли; 		
	КонецЦикла;	
	
	
	
	 
	 Для каждого СтрВыпуск  Из ТзПараметрыШтампа  Цикл
		 
		 НаборЗаписей = РегистрыСведений.Лико_ПараметрыШтампа.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.Номенклатура.Установить(СтрВыпуск.Номенклатура);
		 НаборЗаписей.Прочитать();
		 Для каждого Запись Из  НаборЗаписей Цикл
			 Если  УправлениеСвойствами.ЗначениеСвойства(СтрВыпуск.Номенклатура,"ОстасткаВидШтампа")<>Справочники.Лико_ВидШтампа.КонгревКонтрМатрица ТОгда
				 
				 
				 Запись.Цена=ПлощадьМатериала * 1.15*СтруктураЦенДляГУ.ЦенаЛатуни+
				 Трудозатраты*СтруктураЦенДляГУ.ЦенаНЧ+
				 ПлощадьМатериала*СтруктураЦенДляГУ.ЦенаРасходных;  						
			 Иначе
				 Запись.Цена=СтруктураЦенДляГУ.ЦенаКонтрМатрица;
			 КонецЕсли;
		 КонецЦикла;
		 НаборЗаписей.Записать(Истина);	
	 КонецЦикла; 
	 
	 
	               

		

		
КонецПроцедуры //-Лико m.shenderov 14.02.2021

Процедура ПроверитьЗапролнениеПолейГравировальныйУчасток15032021(ТзПараметрыШтампа,Отказ)

		НайденныеСтроки=Товары.НайтиСтроки(Новый Структура("Списать",Истина ));
		Если НайденныеСтроки.Количество()>0 И НайденныеСтроки[0].КоличествоРасход>0 Тогда
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Не указан расходный материал";
			Сообщение.Поле 			= "Товары"; //имя реквизита 
			Сообщение.КлючДанных 	= Ссылка;
			Сообщение.Сообщить();
			Отказ=Истина;
			//Возврат;
		КонецЕсли;		
		
		Если Выпуск.Количество()>0 И Выпуск[0].Количество>0 Тогда
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Не указан выпуск продукции";
			Сообщение.Поле 			= "Выпуск"; //имя реквизита 
			Сообщение.КлючДанных 	= Ссылка;
			Сообщение.Сообщить();
			Отказ=Истина;
			//Возврат;
		КонецЕсли;
		
			
		
		Для каждого СтрВыпуска Из Выпуск  Цикл
			
			Если Не ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(СтрВыпуска.Номенклатура,"ОстасткаВидШтампа")) Тогда
				
				Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Не заполнен реквизит у номенклатуры выпуска: ""ОстасткаВидШтампа"" ";
			Сообщение.Поле 			= "Выпуск"; //имя реквизита 
			Сообщение.КлючДанных 	= Ссылка;
			Сообщение.Сообщить();
			Отказ=Истина;  			
		КонецЕсли;
		
		Если ТзПараметрыШтампа.Найти(СтрВыпуска.Номенклатура)=Неопределено Тогда
			
				Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Нет даннных в регистре: ""лк Параметры щтампа""  ";
			Сообщение.Поле 			= "Выпуск"; //имя реквизита 
			Сообщение.КлючДанных 	= Ссылка;
			Сообщение.Сообщить();
			Отказ=Истина; 
			
			
		КонецЕсли;
		
		
		
		
		
			
			
		КонецЦикла;


КонецПроцедуры // ()

Процедура ПроверитьЗапролнениеПолейГравировальныйУчасток(ТзПараметрыШтампа, Отказ)

	НайденныеСтроки=Товары.НайтиСтроки(Новый Структура("Списать",Истина ));
	Если НайденныеСтроки.Количество()>0 И НайденныеСтроки[0].КоличествоРасход>0 Тогда
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не указан расходный материал";
		Сообщение.Поле 			= "Товары"; //имя реквизита 
		Сообщение.КлючДанных 	= Ссылка;
		Сообщение.Сообщить();
		Отказ=Истина;
		//Возврат;
	КонецЕсли;		

	Если Выпуск.Количество()>0 И Выпуск[0].Количество>0 Тогда
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не указан выпуск продукции";
		Сообщение.Поле 			= "Выпуск"; //имя реквизита 
		Сообщение.КлючДанных 	= Ссылка;
		Сообщение.Сообщить();
		Отказ=Истина;
		//Возврат;
	КонецЕсли;



	Для каждого СтрВыпуска Из Выпуск  Цикл

		Если Не ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(СтрВыпуска.Номенклатура,"ОстасткаВидШтампа")) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Не заполнен реквизит у номенклатуры выпуска: ""ОстасткаВидШтампа"" ";
			Сообщение.Поле 			= "Выпуск"; //имя реквизита 
			Сообщение.КлючДанных 	= Ссылка;
			Сообщение.Сообщить();
			Отказ=Истина;  			
		КонецЕсли;

		Если ТзПараметрыШтампа.Найти(СтрВыпуска.Номенклатура)=Неопределено Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Нет даннных в регистре: ""лк Параметры штампа""  ";
			Сообщение.Поле 			= "Выпуск"; //имя реквизита 
			Сообщение.КлючДанных 	= Ссылка;
			Сообщение.Сообщить();
			Отказ=Истина;
		КонецЕсли;







	КонецЦикла;


КонецПроцедуры

Функция ПолучитьПараметрыШтампа() //+Лико m.shenderov 14.02.2021
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПараметрыШтампа.Номенклатура КАК Номенклатура,
		|	Лико_ПараметрыШтампа.ВидРабот КАК ВидРабот,
		|	Лико_ПараметрыШтампа.D3 КАК D3,
		|	НоменклатураДополнительныеРеквизиты.Значение КАК ОстасткаВидШтампа
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Лико_ПараметрыШтампа.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""ОстасткаВидШтампа"")
		|ГДЕ
		|	Лико_ПараметрыШтампа.Номенклатура В(&Номенклатура)
		|	И Лико_ПараметрыШтампа.ВидРабот <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Номенклатура",Выпуск.ВыгрузитьКолонку("Номенклатура"));
		Возврат Запрос.Выполнить().Выгрузить();
		
	
КонецФункции //-Лико m.shenderov 14.02.2021 

Функция ПроверитьДатуНачалаУстановкиЦеныНаВыпускГравировальногоУчастка() //+Лико m.shenderov 14.02.2021

	Если Дата>Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаУстановкиЦеныНаВыпускГравировальногоУчастка.ЗначениеПараметра Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
		
КонецФункции //-Лико m.shenderov 14.02.2021

Функция ПолучитьСтруктуруЦенДляГравировальногоУчастка() //+Лико m.shenderov 10.08.2021
	УстановитьПривилегированныйРежим(Истина);
	Структура = Новый Структура;
	Структура.Вставить("ЦенаЛатуни",0);
	Структура.Вставить("ЦенаРасходных",0);
	Структура.Вставить("ЦенаНЧ",0);
	Структура.Вставить("ЦенаКонтрматрица",0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦенаЛатуни.Цена КАК ЦенаЛатуни,
	|	ЦенаНЧ.Цена КАК ЦенаНЧ,
	|	ЦенаКонтрматрица.Цена КАК ЦенаКонтрматрица,
	|	ЦенаРасходных.Цена КАК ЦенаРасходных
	|ИЗ
	|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&КонецПериода, ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Латунь)) КАК ЦенаЛатуни,
	|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&КонецПериода, ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.Контрматрица)) КАК ЦенаКонтрматрица,
	|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&КонецПериода, ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.РасходныеМатериалыГравировальногоУчастка)) КАК ЦенаРасходных,
	|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(&КонецПериода, ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.НЧГравировальногоУчастка)) КАК ЦенаНЧ";
	Запрос.УстановитьПараметр("КонецПериода",Дата );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	     ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	
	
	Возврат Структура;
	
КонецФункции //-Лико m.shenderov 10.08.2021 

//+ ---> Лико m.shenderov 30.03.2022 

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
КонецПроцедуры  
//- <--- Лико m.shenderov 30.03.2022
   #КонецОбласти





