
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_Псевдонимы.Номер КАК Номер
		|ИЗ
		|	Справочник.Лико_Псевдонимы КАК Лико_Псевдонимы
		|ГДЕ
		|	Лико_Псевдонимы.ГруппаМатериала = &ГруппаМатериала
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
		
		Запрос.УстановитьПараметр("ГруппаМатериала", ГруппаМатериала);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Номер = ВыборкаДетальныеЗаписи.Номер + 1;
		Иначе
			Номер = 1	
		КонецЕсли;
		Наименование = ГруппаМатериала.Наименование + " " + Строка(Номер);
	КонецЕсли;
	
КонецПроцедуры
