
&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
Объект.ДополнительныеРеквизиты.Очистить();
Для каждого ДопРеквизит Из Объект.ВидНоменклатуры.НаборСвойств.ДополнительныеРеквизиты Цикл
	
	НовыйРеквизит= Объект.ДополнительныеРеквизиты.Добавить();
	НовыйРеквизит.Свойство=ДопРеквизит.Свойство;
	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры




&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию)
	
	
		СхемаКомпоновкиДанных = Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.ПолучитьМакет("ОтборПоУсловию");
		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПоусловию.Инициализировать(ИсточникНастроек);
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекНастройки = ТекОбъект.ОтборНастройки.Получить();
	Если ТекНастройки = Неопределено Тогда
		
		ОтборПоусловию.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПоусловию.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПоусловию.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	//УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "Склад" , Объект.Склад);
	//УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "Помещение", Объект.Помещение);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
	Объект.ВидНоменклатуры=Объект.Родитель.ВидНоменклатуры;
	КонецЕсли;
	ИнициализироватьКомпоновкуДанных(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 29.12.2018
	Если Объект.СложнаяНастройка Тогда
		Элементы.Простая.Видимость=Ложь;
		Элементы.Сложная.Видимость=Истина;
	Иначе
		Элементы.Простая.Видимость=Истина;
		Элементы.Сложная.Видимость=Ложь;

	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 29.12.2018


&НаКлиенте
Процедура СложнаяНастройкаПриИзменении(Элемент)
	УстановитьВидимость();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		УстановитьВидимость();

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


Если ТекущийОбъект.СложнаяНастройка Тогда
	 ТекущийОбъект.Описание=Строка(ОтборПоусловию.Настройки.Отбор);
	 ТекущийОбъект.ОтборНастройки = Новый ХранилищеЗначения(ОтборПоусловию.Настройки, Новый СжатиеДанных(9));
 Иначе
	 ТекущийОбъект.ОтборНастройки = Неопределено;

КонецЕсли;

КонецПроцедуры

