
&НаКлиенте
Процедура Лико_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	ПроставитьНазначениеОбеспеченияСервер();
КонецПроцедуры


&НаСервере
Процедура ПроставитьНазначениеОбеспеченияСервер()
	//+ ---> Лико m.shenderov 05.06.2023		
	Для каждого  Товар Из Объект.ОбеспечениеМатериаламиИРаботами  Цикл
		
		Если ЗначениеЗаполнено(Товар.Лико_Документ) И Не ЗначениеЗаполнено(Товар.НазначениеОбеспечения) Тогда
			Товар.НазначениеОбеспечения=Объект.Назначение;
		КонецЕсли;	
	КонецЦикла;
	//- <--- Лико m.shenderov 05.06.2023


КонецПроцедуры
