Процедура ПодключениеМобильныхУстройств(Форма) Экспорт //+Лико m.shenderov 30.03.2021
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Возврат;
	КонецЕсли;

	Попытка
		
		ПослеВыполненияПодключения        = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", Форма,, "ВыполнитьПриОшибке", Форма);
		ОбработкаСообщенийСервера         = Новый ОписаниеОповещения("ОбработкаСообщенийСервера", Форма);		
		ИдентификаторТекущегоПользователя = СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения;
		
		КлючОбсуждения                    = "ERP_mobile";  		
		
		Лико_СерверВзаимодействияСервер.СоздатьОбсуждение(КлючОбсуждения, ИдентификаторТекущегоПользователя);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(ПослеВыполненияПодключения, КлючОбсуждения, ОбработкаСообщенийСервера);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	
	
КонецПроцедуры //-Лико m.shenderov 30.03.2021


Процедура ОтключениеМобильныхУстройств(Форма)Экспорт //+Лико m.shenderov 30.03.2021
Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Возврат;
	КонецЕсли;

	
	КлючОбсуждения = "ERP_mobile"+"_"+Лико_СерверВзаимодействияСервер.РабочееМестоИмя();  		
	ОбработкаСообщенийСервера = Новый ОписаниеОповещения("ОбработкаСообщенийСервера",Форма);
	СистемаВзаимодействия.НачатьОтключениеОбработчикаНовыхСообщений(,КлючОбсуждения, ОбработкаСообщенийСервера);
	

		
КонецПроцедуры //-Лико m.shenderov 30.03.2021

