&НаСервере
Функция ПолучитьНовыйКлючСтроки(ИмяТЧ,  ИмяКолонки = "КлючСтроки") 
    //Обязательно должен быть ключ строки с номером 1!
	МаксКлюч = 0;
	ТЗ =Объект[ИмяТЧ].Выгрузить();
	Если ТЗ.Количество() > 1 Тогда
		// Если в табл. части уже присутствуют строки, то новое «свободное» значение ключа
		// рассчитывается от максимального существующего значения или равно 1, если такого ключа нет
		Если ТЗ.Найти(1, ИмяКолонки)=Неопределено Тогда 
			Возврат 1;
		Иначе
			СписокКлючей = Новый СписокЗначений;
			СписокКлючей.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку(ИмяКолонки));
			СписокКлючей.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
			МаксКлюч = СписокКлючей[0].Значение + 1;
		КонецЕсли;	
	Иначе 
		Возврат 1;	
	КонецЕсли;

	Возврат МаксКлюч;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ТаблицыДляРасчетаНормативовВариантыРасчета.ВариантРасчета КАК ВариантРасчета
	|ИЗ
	|	Справочник.Лико_ТаблицыДляРасчетаНормативов.ВариантыРасчета КАК Лико_ТаблицыДляРасчетаНормативовВариантыРасчета
	|ГДЕ
	|	Лико_ТаблицыДляРасчетаНормативовВариантыРасчета.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВариантРасчета";
	Запрос.УстановитьПараметр("Ссылка", Объект.ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл 
		ДобавитьКнопку(выборка.ВариантРасчета);
	КонецЦикла;
	ОтборПоВариантуРасчета(1);	

КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопку(ВариантРасчета)	
	ИмяКоманды = "ВР"+формат(ВариантРасчета,"ЧГ=0");
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие = "КнопкаВариантРасчетаНажатие";
	НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.КоманднаяПанельВариантовРасчета);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	НовыйЭлемент.Заголовок = ИмяКоманды; 

КонецПроцедуры

&НаСервере
Процедура УдалитьКнопкуНаСервере(ИмяКнопки)	
	Элементы.Удалить(Элементы[ИмяКнопки]);
КонецПроцедуры

&НаСервере
Процедура ОтборПоВариантуРасчета(ВариантРасчета)
	Отбор = Новый ФиксированнаяСтруктура("ВариантРасчета", ВариантРасчета);	
	Элементы.ТаблицаПоказателей.ОтборСтрок = Отбор;	
	Элементы.ТаблицаЦветов.ОтборСтрок = Отбор;	
	Для каждого Стр Из Объект.ВариантыРасчета Цикл
		ИмяКнопки = "ВР"+формат(Стр.ВариантРасчета,"ЧГ=0");
		Если Стр.ВариантРасчета = ВариантРасчета Тогда 
			Элементы[ИмяКнопки].Пометка = Истина;
		Иначе
			//Элементы.КоманднаяПанельВариантовРасчета.Кнопки[ИмяКнопки].Пометка = ЛОжь;
			Элементы[ИмяКнопки].Пометка = Ложь;

		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура СкопироватьВариантНаСервере(ИмяКоманды, НомерВарианта, ТекВариантРасчета, НомерКопии, КопируемыйВариантРасчета);
	Если ИмяКоманды  = "СкопироватьВариантПоказатели" Тогда    	
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.Показатель,
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.ЗначениеПоказателя,
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.Показатель2,
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.ЗначениеПоказателя2
		|ИЗ
		|	Справочник.Лико_ТаблицыДляРасчетаНормативов.ТаблицаПоказателей КАК Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей
		|ГДЕ
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.Ссылка = &ссылка
		|	И Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.НомерВарианта = &номеркопии
		|	И Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.ВариантРасчета = &КопируемыйВариантРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаПоказателей.НомерСтроки" ;
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("НомерКопии", НомерКопии);
		Запрос.УстановитьПараметр("КопируемыйВариантРасчета", КопируемыйВариантРасчета);

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			стр =  Объект.ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(стр, выборка);
			стр.НомерВарианта = НомерВарианта;
			стр.ВариантРасчета = ТекВариантРасчета;
		КонецЦикла;
	ИначеЕсли ИмяКоманды  = "СкопироватьВариантЦвета" Тогда 	
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.КоличествоЦветов,
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.ЗначениеПоказателя
		|ИЗ
		|	Справочник.Лико_ТаблицыДляРасчетаНормативов.ТаблицаЦветов КАК Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов
		|ГДЕ
		|	Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.Ссылка = &ссылка
		|	И Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.НомерВарианта = &номеркопии
		|	И Лико_ТаблицыДляРасчетаНормативовТаблицаЦветов.ВариантРасчета = &КопируемыйВариантРасчета" ;
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("НомерКопии", НомерКопии);
		Запрос.УстановитьПараметр("КопируемыйВариантРасчета", КопируемыйВариантРасчета);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			стр =  Объект.ТаблицаЦветов.Добавить();
			стр.КоличествоЦветов = Выборка.КоличествоЦветов;
			стр.ЗначениеПоказателя = Выборка.ЗначениеПоказателя;
			стр.НомерВарианта = НомерВарианта;
			стр.ВариантРасчета = ТекВариантРасчета;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЦентрыПриАктивизацииСтроки(Элемент)
	Если  Объект.РабочиеЦентры.Количество()>0 Тогда 
		НомерВарианта = Элементы.РабочиеЦентры.ТекущиеДанные.НомерВарианта;
		ВариантРасчета = Элементы.ТаблицаПоказателей.ОтборСтрок.ВариантРасчета;
		Отбор = Новый ФиксированнаяСтруктура("НомерВарианта, ВариантРасчета", НомерВарианта, ВариантРасчета);
		Элементы.ТаблицаПоказателей.ОтборСтрок = Отбор;	
		Элементы.ТаблицаЦветов.ОтборСтрок = Отбор;			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЦентрыПередУдалением(Элемент, Отказ)
	НомерВарианта = Элементы.РабочиеЦентры.ТекущиеДанные.НомерВарианта;
	Отбор= Новый Структура("НомерВарианта", НомерВарианта);
	МассивРЦПоВарианту = Объект.РабочиеЦентры.НайтиСтроки(Отбор);
	Если  МассивРЦПоВарианту.Количество()<2 Тогда 

		МассивСтрок = Объект.ТаблицаПоказателей.НайтиСтроки(Отбор);
		Для каждого  ЭлементМассива из МассивСтрок Цикл
			Объект.ТаблицаПоказателей.Удалить( ЭлементМассива);
		КонецЦикла;
		
		МассивСтрок = Объект.ТаблицаЦветов.НайтиСтроки(Отбор);
		Для каждого  ЭлементМассива из МассивСтрок Цикл
			Объект.ТаблицаЦветов.Удалить( ЭлементМассива);
		КонецЦикла;
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариантРасчета(Команда)
	стр = Объект.ВариантыРасчета.Добавить();
	стр.ВариантРасчета = ПолучитьНовыйКлючСтроки("ВариантыРасчета",  "ВариантРасчета");
	ДобавитьКнопку(стр.ВариантРасчета);

КонецПроцедуры

&НаКлиенте
Процедура КнопкаВариантРасчетаНажатие(Элемент)
	ВариантРасчета = Число(Прав(Элемент.Имя,1));

	ОтборПоВариантуРасчета(ВариантРасчета)
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВариантРасчета(Команда)
	ТекВариантРасчета = Элементы.ТаблицаПоказателей.ОтборСтрок.ВариантРасчета;
	Если ТекВариантРасчета = 1 Тогда 
		Сообщить("Нельзя удалять первый вариант!");
		Возврат;
	КонецЕсли;	
	
	
	МассивСтрок = Объект.ТаблицаПоказателей.НайтиСтроки(Новый Структура("ВариантРасчета",  ТекВариантРасчета ));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект.ТаблицаПоказателей.Удалить(ЭлементМассива);
	КонецЦикла;	
	МассивСтрок = Объект.ТаблицаЦветов.НайтиСтроки(Новый Структура("ВариантРасчета",  ТекВариантРасчета ));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект.ТаблицаЦветов.Удалить(ЭлементМассива);
	КонецЦикла;	
	МассивСтрок = Объект.ВариантыРасчета.НайтиСтроки(Новый Структура("ВариантРасчета",  ТекВариантРасчета ));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект.ВариантыРасчета.Удалить(ЭлементМассива);
	КонецЦикла;	
	ИмяКнопки =  "ВР"+формат(текВариантРасчета,"ЧГ=0");

	//Элементы.Удалить(Элементы[ИмяКнопки]);
	УдалитьКнопкуНаСервере(ИмяКнопки);	
	
	ОтборПоВариантуРасчета(1);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПоказателейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ТаблицаПоказателей.ТекущиеДанные.НомерВарианта = Элементы.ТаблицаПоказателей.ОтборСтрок.НомерВарианта;
		Элементы.ТаблицаПоказателей.ТекущиеДанные.ВариантРасчета =  Элементы.ТаблицаПоказателей.ОтборСтрок.ВариантРасчета;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ТаблицаЦветов.ТекущиеДанные.НомерВарианта = Элементы.ТаблицаПоказателей.ОтборСтрок.НомерВарианта;
		Элементы.ТаблицаЦветов.ТекущиеДанные.ВариантРасчета =  Элементы.ТаблицаПоказателей.ОтборСтрок.ВариантРасчета;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВариант(Команда)
	Если  ЭтаФорма.Модифицированность Тогда
		Ответ  = Вопрос("Перед копированием необходимо записать элемент." , РежимДиалогаВопрос.ОКОтмена);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ЭтаФорма.Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекВариантРасчета = Элементы.ТаблицаПоказателей.ОтборСтрок.ВариантРасчета;
	
	НомерВарианта = Элементы.РабочиеЦентры.ТекущиеДанные.НомерВарианта;
	Если Не ЗначениеЗаполнено(НомерВарианта) Тогда
		Сообщить("Укажите номер варианта, который нужно заполнить!!!");
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерВарианта", НомерВарианта);
	Отбор.Вставить("ВариантРасчета", ТекВариантРасчета);
	Если Команда.Имя  = "СкопироватьВариантПоказатели" Тогда  
		МассивСтрок = Объект.ТаблицаПоказателей.НайтиСтроки(Отбор);
		Для каждого  ЭлементМассива из МассивСтрок Цикл
			Объект.ТаблицаПоказателей.Удалить( ЭлементМассива);
		КонецЦикла;

	Иначе 
		МассивСтрок = Объект.ТаблицаЦветов.НайтиСтроки(Отбор);
		Для каждого  ЭлементМассива из МассивСтрок Цикл
			Объект.ТаблицаЦветов.Удалить( ЭлементМассива);
		КонецЦикла;

	КонецЕсли;
		
	//Определяем вариант расчета, который будем копировать
	КопируемыйВариантРасчета = 1;
	Если Не ВвестиЧисло(КопируемыйВариантРасчета, "Введите номер варианта расчета", 10, 0) Тогда
		Возврат;
	КонецЕсли;

	НомерКопии = 1;
	Если ВвестиЧисло(НомерКопии, "Введите номер копируемого варианта", 10, 0) Тогда
		СкопироватьВариантНаСервере(Команда.Имя, НомерВарианта, ТекВариантРасчета, НомерКопии, КопируемыйВариантРасчета);
	КонецЕсли;	

КонецПроцедуры



