
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСтавкуНДСПоУмолчанию();
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоУмолчанию()
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт Тогда
		СтавкаНДСПоУмолчанию = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.БезНДС);
	ИначеЕсли ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()) >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияСтавкиНДС20.ЗначениеПараметра Тогда
		СтавкаНДСПоУмолчанию = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
	Иначе
		СтавкаНДСПоУмолчанию = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС18);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
		Объект.ТипДокумента = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.РеализацияИПоступление;
	КонецЕсли;

	Интеркампани = Объект.ТипДокумента = Перечисления.Лико_ТипПередачиТоваровМеждуОрганизациями.Интеркампани;
	//Элементы.ОрганизацияПродавец.Видимость = Интеркампани;
	//Элементы.ОрганизацияПокупатель.Видимость = Интеркампани;
	Элементы.КонтрагентПродавец.Видимость = НЕ Интеркампани;
	Элементы.КонтрагентПокупатель.Видимость = НЕ Интеркампани;
	Элементы.СкладПриобретения.Видимость = НЕ Интеркампани;
	Элементы.ДоговорПродажи.Видимость = НЕ Интеркампани;
	Элементы.ДоговорПокупки.Видимость = НЕ Интеркампани;
	Элементы.ДоговорМеждуОрганизациями.Видимость = Интеркампани;
	Элементы.СкладПродажи.Заголовок = ?(Интеркампани, "Склад", "Склад продажи");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПродавецПокупательПриИзменении(Элемент)
	
	Если Элемент.Имя = "ОрганизацияПродавец" Тогда
		Объект.КонтрагентПродавец = ПолучитьКонтрагентаОрганизации(Объект.ОрганизацияПродавец);
	ИначеЕсли Элемент.Имя = "ОрганизацияПокупатель" Тогда
		Объект.КонтрагентПокупатель = ПолучитьКонтрагентаОрганизации(Объект.ОрганизацияПокупатель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаОрганизации(Организация)
	
	ПустойКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат ПустойКонтрагент;
	Иначе
		Возврат Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Организация, "КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2", ПустойКонтрагент);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПересчитатьСтрокуТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуТЧ(ТекущаяСтрока, ИзСуммы = Ложь)
	
	Если ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Сумма = 0;
		ТекущаяСтрока.СуммаНДС = 0;
		ТекущаяСтрока.СуммаСНДС = 0;
		Возврат;
	КонецЕсли;
	
	Если ИзСуммы Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
	Иначе
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	КонецЕсли;
		
	ТекущаяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		ТекущаяСтрока.Сумма,
		ТекущаяСтрока.СтавкаНДС,
		Объект.ЦенаВключаетНДС,
		Объект.НалогообложениеНДС);
		
	ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма + ?(Объект.ЦенаВключаетНДС, 0, ТекущаяСтрока.СуммаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда
		ТекущаяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтрокуТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ПересчитатьСтрокуТЧ(Элементы.Товары.ТекущиеДанные, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	
	ПересчитатьВсеСтрокиТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНДСПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоУмолчанию();
	
	ПересчитатьВсеСтрокиТЧ(СтавкаНДСПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВсеСтрокиТЧ(СтавкаНДС = Неопределено)
	
	Для каждого Строка из Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтавкаНДС) Тогда
			Строка.СтавкаНДС = СтавкаНДС;
		КонецЕсли;
		ПересчитатьСтрокуТЧ(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтрокуТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры
