#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс 

Процедура Проведение(ДокументОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументОбъект.Движения.Лико_ТоварыКПоступлениюПоЗаказамПоставщику.Записывать = Истина;
	Движения = Неопределено;
	ПолучитьДвиженияПоДокументу(ДокументОбъект.Ссылка, Движения); 
	
	ПроверкаНаОшибки(Движения, ДокументОбъект);
	
	ДокументОбъект.Движения.Лико_ТоварыКПоступлениюПоЗаказамПоставщику.Загрузить(Движения);
	
КонецПроцедуры 


Процедура СформироватьДвижения(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыНакопления.Лико_ТоварыКПоступлениюПоЗаказамПоставщику.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Движения = Новый ТаблицаЗначений;
	ПолучитьДвиженияПоДокументу(ДокументСсылка, Движения);
	
	ПроверкаНаОшибки(Движения, ДокументСсылка);

	
	НаборЗаписей.Загрузить(Движения);
	
	НаборЗаписей.Записать(Истина); 	
	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Процедура ПолучитьДвиженияПоДокументу(Ссылка, Движения)
	
	ПолучитьДвиженияПоДокументуЗаказПоставщику(Ссылка, Движения);
	ПолучитьДвиженияПоДокументуПриходныйОрдер(Ссылка, Движения);
	ПолучитьДвиженияПоДокументПриобретениеТоваровИУслуг(Ссылка, Движения);
	
КонецПроцедуры 


Процедура ПолучитьДвиженияПоДокументуЗаказПоставщику(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Приход) КАК ВидДвижения,
	|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|	И ЗаказПоставщикуТовары.Ссылка.Лико_Предзаказ = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Ссылка.Дата,
	|	ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 

Процедура ПолучитьДвиженияПоДокументуПриходныйОрдер(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Расход) КАК ВидДвижения,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК ЗаказПоставщику,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	|	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ПриходныйОрдерНаТоварыТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|	И НЕ ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение.Лико_Предзаказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура,
	|	ПриходныйОрдерНаТоварыТовары.Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура.ЕдиницаИзмерения,
	|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 

Процедура ПолучитьДвиженияПоДокументПриобретениеТоваровИУслуг(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Расход) КАК ВидДвижения,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество,
	|	ПриобретениеТоваровУслугТовары.ЗаказПоставщику КАК ЗаказПоставщику
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
	|	И ПриобретениеТоваровУслугТовары.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И НЕ ПриобретениеТоваровУслугТовары.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ПриобретениеТоваровУслугТовары.Ссылка.Дата,
	|	ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения,
	|	ПриобретениеТоваровУслугТовары.ЗаказПоставщику";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 




Процедура ПроверкаНаОшибки(Движения, Документ)
	
	Если Движения = Неопределено Тогда
		
		ВызватьИсключение(СтрШаблон("Документ: %1 не может отражать движения по регистру:""лк Товары к поступлению по заказам поставщику""!",Документ)) ;
		
	КонецЕсли;
	
 КонецПроцедуры
 
 

#КонецОбласти

#КонецЕсли