
//&Вместо("ЗаполнитьТаблицуТоварыДополнительнымиПолями")
//Процедура Лико_ЗаполнитьТаблицуТоварыДополнительнымиПолями()
//	Для каждого Товар Из Объект.Товары Цикл
//		Если ЗначениеЗаполнено(Товар.Спецификация) Тогда 
//			ПараметрыШтампа=ПолучитьПараметрыШтампа(Товар.Спецификация, Товар.НомерВарианта);	
//			
//			Товар.ШтампВырубной			=ПараметрыШтампа.ШтампВырубной;
//			Товар.ЭтикетокНаЛисте		=ПараметрыШтампа.ЭтикетокНаЛисте;
//			Товар.АртикулШтампа			=?(ЗначениеЗаполнено(ПараметрыШтампа.ШтампВырубной),ПараметрыШтампа.ШтампВырубной.Артикул,Неопределено);
//			Товар.ОсновнойМатериал		=Товар.Спецификация.ОсновнойМатериал;
//			Товар.ШиринаРулона			=ПараметрыШтампа.Нарезка;
//			Товар.Ручьи					=ПараметрыШтампа.Ручьи;
//			Товар.Z						=ПараметрыШтампа.Z;
//			Если НЕ ЗначениеЗаполнено(Товар.НомерВарианта) Тогда
//				Товар.НомерВарианта = ПараметрыШтампа.НомерВарианта;
//			КонецЕсли;
//			
//		Иначе
//			Товар.ШтампВырубной			=Объект.ЗаказКлиента.ШтампВырубной;
//			Товар.ЭтикетокНаЛисте		=Объект.ЗаказКлиента.ЭтикетокНаЛисте;
//			Товар.АртикулШтампа			=Объект.ЗаказКлиента.ШтампВырубной.Артикул;
//			Товар.ОсновнойМатериал		=Объект.ЗаказКлиента.ОсновнойМатериал;
//			Товар.ШиринаРулона			=Объект.ЗаказКлиента.Нарезка;
//			Товар.Ручьи					=Объект.ЗаказКлиента.Ручьи;
//			Товар.Z						=Объект.ЗаказКлиента.Z;
//		КонецЕсли;
//		
//		
//	КонецЦикла;

//КонецПроцедуры

//&НаСервереБезКонтекста
//&Вместо("ПолучитьПараметрыШтампа")
//Функция Лико_ПолучитьПараметрыШтампа(Спецификация)
//	Структура = Новый Структура;
//	Структура.Вставить("ШтампВырубной");
//	Структура.Вставить("ЭтикетокНаЛисте");
//	Структура.Вставить("Нарезка");
//	Структура.Вставить("Ручьи");
//	Структура.Вставить("Z");
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	Лико_СпецификацииПараметрыШтампа.ШтампВырубной КАК ШтампВырубной,
//	|	Лико_СпецификацииПараметрыШтампа.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
//	|	Лико_СпецификацииПараметрыШтампа.Нарезка КАК Нарезка,
//	|	Лико_СпецификацииПараметрыШтампа.Ручьи КАК Ручьи,
//	|	Лико_СпецификацииПараметрыШтампа.Z КАК Z
//	|ИЗ
//	|	Справочник.Лико_Спецификации.ПараметрыШтампа КАК Лико_СпецификацииПараметрыШтампа
//	|ГДЕ
//	|	Лико_СпецификацииПараметрыШтампа.НомерВарианта = 1 И
//	|	Лико_СпецификацииПараметрыШтампа.Ссылка = &Спецификация";
//	Запрос.УстановитьПараметр("Спецификация",Спецификация );
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		
//		ЗаполнитьЗначенияСвойств(Структура,Выборка);
//	КонецЦикла; 
//	
//	Возврат Структура;
//	

//КонецФункции
