#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция Установлен(Организация, ЦеноваяГруппа, Знач Период = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Период = ?(Период=Неопределено,Дата(3999, 12, 31, 23, 59, 59),Период);
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_АвтоРасчетЦенЦГСрезПоследних.АвтоРасчет КАК АвтоРасчет
	|ИЗ
	|	РегистрСведений.Лико_АвтоРасчетЦенЦГ.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И ЦеноваяГруппа = &ЦеноваяГруппа) КАК Лико_АвтоРасчетЦенЦГСрезПоследних";
	Запрос.УстановитьПараметр("Дата",Период );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("ЦеноваяГруппа",ЦеноваяГруппа );
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.АвтоРасчет;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции 

Процедура Установить(ЦеноваяГруппа, Знач Период=Неопределено,АвтоРасчет = Истина) Экспорт  
	
	
	Для каждого Организация Из ОрганизацииАвтоРасчета() Цикл
		
		Период = ?(Период=Неопределено,ТекущаяДата(),Период);

		
		Если АвтоРасчет = Установлен(Организация, ЦеноваяГруппа, Период) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = РегистрыСведений.Лико_АвтоРасчетЦенЦГ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.ЦеноваяГруппа.Установить(ЦеноваяГруппа);
		НаборЗаписей.Отбор.Период.Установить(Период); 
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.ЦеноваяГруппа = ЦеноваяГруппа;
		НоваяЗапись.Период = Период;
		НоваяЗапись.АвтоРасчет = АвтоРасчет;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОрганизацииАвтоРасчета()  Экспорт ;
Массив = Новый Массив();
Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);

Возврат Массив;

КонецФункции 

  Функция ХозяйственныеОперации() Экспорт 
	  Массив = Новый Массив();
	  Массив.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	  Массив.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	  
	  
	  Возврат Массив;
	  
  КонецФункции   




#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли