
&НаКлиенте
&Вместо("ПослеОтветаНаВопросОбИзмененииСтавкиНДС")
Процедура Лико_ПослеОтветаНаВопросОбИзмененииСтавкиНДС(РезультатВопроса, ДополнительныеПараметры)

	Результат = РезультатВопроса;

	Если Результат = КодВозвратаДиалога.Да Тогда
		Для каждого Стр из Объект.Товары Цикл
			Если ЗначениеРеквизита(Стр.СтавкаНДС, "Ставка") <> 0 Тогда
				Стр.СтавкаНДС = ПолучитьСтавкуНДС(22);
				Стр.Цена = (Стр.Цена/1.20)*1.22;
				Если Объект.ЦенаДляДокументовВключаетНДС Тогда
					Стр.ЦенаДляДокументов = (Стр.ЦенаДляДокументов/1.20)*1.22;	
				КонецЕсли;
				СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, КэшированныеЗначения);
			КонецЕсли;
		КонецЦикла;
		Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС") + Объект.СтоимостьОснастки;
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		ПоказатьДоходностьРентабельность();
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Записать(Новый Структура("ЗаписьПослеОтветаНаВопросОбИзмененииНДС",Истина));
		КонецЕсли;
	Иначе
		Для каждого Стр из Объект.Товары Цикл
			Если ЗначениеРеквизита(Стр.СтавкаНДС, "Ставка") <> 0 Тогда
				Стр.СтавкаНДС = ПолучитьСтавкуНДС(22);
				УстановитьЦенуБезНДС(Стр.ПолучитьИдентификатор());
				СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, КэшированныеЗначения);
			КонецЕсли;
		КонецЦикла;
		Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС") + Объект.СтоимостьОснастки;
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		ПоказатьДоходностьРентабельность();
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Записать(Новый Структура("ЗаписьПослеОтветаНаВопросОбИзмененииНДС",Истина));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
