
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Партнер") Тогда
		Партнер=Параметры.Партнер;
	Иначе
		Отказ=Истина;
	КонецЕсли;
	Если Параметры.Свойство("Склад") Тогда
		Склад=Параметры.Склад;
	Иначе
		Отказ=Истина;
	КонецЕсли;

	Если Параметры.Свойство("НоменклатураДокумента") Тогда
		ТоварыДокумента.Очистить();
		МассивНоменклатуры=Параметры.НоменклатураДокумента;
		Для каждого ТоварНоменклатура Из МассивНоменклатуры Цикл
			НовыйТоварДокумента=ТоварыДокумента.Добавить();
			НовыйТоварДокумента.Номенклатура=ТоварНоменклатура.Номенклатура;
			НовыйТоварДокумента.Характеристика=ТоварНоменклатура.Характеристика;			
		КонецЦикла;		
	КонецЕсли;
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура=Параметры.Номенклатура;
	КонецЕсли;
	Если Параметры.Свойство("Характеристика") Тогда
		Характеристика=Параметры.Характеристика;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		Элементы.ГруппаНоменклатура.Видимость=Истина;
		Элементы.ГруппаФильтр.Видимость=Ложь;
		Элементы.ТоварыВыбрать.Видимость=Ложь;
		
	Иначе
		Элементы.ГруппаФильтр.Видимость=Истина;
		Элементы.ГруппаНоменклатура.Видимость=Ложь;
		Элементы.ТоварыВыбрать.Видимость=Истина;
		
	КонецЕсли;
	
	ЗаполнитьТаблицуТоваров();	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуТоваров() //+Лико m.shenderov 24.01.2018
	Если БезХарактеристики Тогда
		//Элементы.ТоварыХарактеристика.Видимость=Ложь;
		Элементы.ДобавитьВДокумент.Видимость=Ложь;
		//Элементы.ТоварыВыбрать.Видимость=Ложь;
		
		Если ПоНоменклатуреДокумента Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВтНоменклатураДокумента
			|ИЗ
			|	&ТЗ КАК Лико_ТоварыКПоступлениюОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер КАК ПриходныйОрдер,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Отправитель КАК Партнер,
			|	Лико_ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка) КАК Характеристика,
			|	Лико_ТоварыКПоступлениюОстатки.КоличествоОстаток КАК Количество,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Дата КАК Дата
			|ИЗ
			|	РегистрНакопления.Лико_ТоварыКПоступлению.Остатки(
			|			,
			|			ПриходныйОрдер.Отправитель = &Партнер И ПриходныйОрдер.Склад=&Склад
			|				И Номенклатура В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВтНоменклатураДокумента.Номенклатура КАК Номенклатура
			|					ИЗ
			|						ВтНоменклатураДокумента КАК ВтНоменклатураДокумента)
			|				И ВЫБОР
			|					КОГДА &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Номенклатура = &Номенклатура
			|				КОНЕЦ) КАК Лико_ТоварыКПоступлениюОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			Запрос.УстановитьПараметр("ТЗ",ТоварыДокумента.Выгрузить());
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
			Запрос.УстановитьПараметр("Характеристика",Характеристика);
			
			Запрос.УстановитьПараметр("Партнер",Партнер);
			
			Товары.Загрузить(Запрос.Выполнить().Выгрузить()); 		
		Иначе
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер КАК ПриходныйОрдер,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Отправитель КАК Партнер,
			|	Лико_ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка) КАК Характеристика,
			|	Лико_ТоварыКПоступлениюОстатки.КоличествоОстаток КАК Количество,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Дата КАК Дата
			|ИЗ
			|	РегистрНакопления.Лико_ТоварыКПоступлению.Остатки(
			|			,
			|			ПриходныйОрдер.Отправитель = &Партнер и  ПриходныйОрдер.Склад = &Склад
			|				И ВЫБОР
			|					КОГДА &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Номенклатура = &Номенклатура
			|				КОНЕЦ) КАК Лико_ТоварыКПоступлениюОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			Запрос.УстановитьПараметр("Партнер",Партнер);
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
			Запрос.УстановитьПараметр("Характеристика",Характеристика);
			Запрос.УстановитьПараметр("Склад",Склад);

			
			Товары.Загрузить(Запрос.Выполнить().Выгрузить()); 	
		КонецЕсли;
		
		
	Иначе
		//Элементы.ТоварыХарактеристика.Видимость=Истина;
        Элементы.ДобавитьВДокумент.Видимость=Истина;
		//Элементы.ТоварыВыбрать.Видимость=Истина;
		Если ПоНоменклатуреДокумента Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
			|	Лико_ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика
			|ПОМЕСТИТЬ ВтНоменклатураДокумента
			|ИЗ
			|	&ТЗ КАК Лико_ТоварыКПоступлениюОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер КАК ПриходныйОрдер,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Отправитель КАК Партнер,
			|	Лико_ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
			|	Лико_ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
			|	Лико_ТоварыКПоступлениюОстатки.КоличествоОстаток КАК Количество,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Дата КАК Дата
			|ИЗ
			|	РегистрНакопления.Лико_ТоварыКПоступлению.Остатки(
			|			,
			|			ПриходныйОрдер.Отправитель = &Партнер и ПриходныйОрдер.Склад = &Склад
			|				И (Номенклатура, Характеристика) В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ВтНоменклатураДокумента.Номенклатура КАК Номенклатура,
			|						ВтНоменклатураДокумента.Характеристика КАК Характеристика
			|					ИЗ
			|						ВтНоменклатураДокумента КАК ВтНоменклатураДокумента)
			|				И ВЫБОР
			|					КОГДА &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Номенклатура = &Номенклатура
			|				КОНЕЦ
			|				И ВЫБОР
			|					КОГДА &Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Характеристика = &Характеристика
			|				КОНЕЦ) КАК Лико_ТоварыКПоступлениюОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			Запрос.УстановитьПараметр("ТЗ",ТоварыДокумента.Выгрузить());
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
			Запрос.УстановитьПараметр("Характеристика",Характеристика);
			
			Запрос.УстановитьПараметр("Партнер",Партнер);
			Запрос.УстановитьПараметр("Склад",Склад);

			
			Товары.Загрузить(Запрос.Выполнить().Выгрузить()); 		
		Иначе
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер КАК ПриходныйОрдер,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Отправитель КАК Партнер,
			|	Лико_ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
			|	Лико_ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
			|	Лико_ТоварыКПоступлениюОстатки.КоличествоОстаток КАК Количество,
			|	Лико_ТоварыКПоступлениюОстатки.ПриходныйОрдер.Дата КАК Дата
			|ИЗ
			|	РегистрНакопления.Лико_ТоварыКПоступлению.Остатки(
			|			,
			|			ПриходныйОрдер.Отправитель = &Партнер  И ПриходныйОрдер.Склад = &Склад
			|				И ВЫБОР
			|					КОГДА &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Номенклатура = &Номенклатура
			|				КОНЕЦ
			|				И ВЫБОР
			|					КОГДА &Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ Характеристика = &Характеристика
			|				КОНЕЦ) КАК Лико_ТоварыКПоступлениюОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			Запрос.УстановитьПараметр("Партнер",Партнер);
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
			Запрос.УстановитьПараметр("Характеристика",Характеристика);
			Запрос.УстановитьПараметр("Склад",Склад);

			
			Товары.Загрузить(Запрос.Выполнить().Выгрузить()); 		
			
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 24.01.2018

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ПриходныйОрдер=Неопределено;
		Товар=Элементы.Товары.ТекущиеДанные;
		Если Товар<>Неопределено Тогда
			ПриходныйОрдер=Товар.ПриходныйОрдер;
		КонецЕсли;
		Закрыть(ПриходныйОрдер);
	Иначе
		Массив= Новый Массив;
		Для каждого Товар Из Товары Цикл
			Если Товар.Выбрать Тогда
				Структура = Новый Структура;
				Структура.Вставить("Номенклатура",		Товар.Номенклатура);
				Структура.Вставить("Характеристика",	Товар.Характеристика);
				Структура.Вставить("Количество",		Товар.Количество);
				Структура.Вставить("ПриходныйОрдер",		Товар.ПриходныйОрдер);
				Массив.Добавить(Структура);  
				
				
			КонецЕсли;
			
			
			
			
			
		КонецЦикла;
		
		Закрыть(Массив);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНоменклатураДокументаПриИзменении(Элемент)
	ЗаполнитьТаблицуТоваров();
КонецПроцедуры

&НаКлиенте
Процедура БезХарактеристикиПриИзменении(Элемент)
	ЗаполнитьТаблицуТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВыделенные(Команда)
	Для каждого Товар Из Элементы.Товары.ВыделенныеСтроки Цикл
		Товары.НайтиПоИдентификатору(Товар).Выбрать=Не Товары.НайтиПоИдентификатору(Товар).Выбрать;
		
	КонецЦикла;
КонецПроцедуры


