
#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных; 
	
КонецФункции
 
Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВыполненныеРаботы.Дата КАК Период,
	|	Лико_ВыполненныеРаботы.Номер КАК Номер,
	|	Лико_ВыполненныеРаботы.Организация КАК Организация,
	|	Лико_ВыполненныеРаботы.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	Документ.Лико_ВыполненныеРаботы КАК Лико_ВыполненныеРаботы
	|ГДЕ
	|	Лико_ВыполненныеРаботы.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	
	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);
	Запрос.УстановитьПараметр("ЗаказКлиента", 				Реквизиты.ЗаказКлиента);
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Ссылка",    					ДокументСсылка);

	
	
	
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаЛико_ВыполненныеРаботы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ВыполненныеРаботы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.Организация КАК Организация,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.Сотрудник КАК Сотрудник,
	|	Лико_ВыполненныеРаботыРаботы.Работа КАК Работа,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	1 КАК Количество
	|ИЗ
	|	Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
	|ГДЕ
	|	Лико_ВыполненныеРаботыРаботы.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


//Начало изменений 


Функция ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказу(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ЗатратыПоЗаказу";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТПрокатыТрафарета.Период КАК Период,
	|	ВТПрокатыТрафарета.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТПрокатыТрафарета.РабочийЦентр КАК РабочийЦентр,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ТрафаретныеЗасветки)) КАК СтатьяЗатрат,
	|	ВТПрокатыТрафарета.Затрата КАК Затрата,
	|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1) КАК НомерПроката,
	|	ВТПрокатыТрафарета.Количество КАК Количество,
	|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100) КАК НомерПрокатаРаботы,
	|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0) КАК СуммаПлан,
	|	ВТПрокатыТрафарета.Количество КАК КоличествоПлан,
	|	СУММА(0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.Период КАК Период,
	|		ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|		ВТ.РабочийЦентр КАК РабочийЦентр,
	|		ВТ.Затрата КАК Затрата,
	|		ВТ.Количество КАК Количество,
	|		ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(&Период) КАК Период,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр КАК РабочийЦентр,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки КАК Затрата,
	|			СУММА(1) КАК Количество
	|		ИЗ
	|			Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ЗасветкаStork КАК Лико_ОтчетФормногоУчасткаЗасветкаStork
	|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаЗасветкаStork.Заказ
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ТрафСетки КАК Лико_ОтчетФормногоУчасткаТрафСетки
	|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаТрафСетки.Заказ
	|		ГДЕ
	|			Лико_ВыполненныеРаботыРаботы.Ссылка = &Ссылка
	|			И Лико_ВыполненныеРаботыРаботы.Работа = ЗНАЧЕНИЕ(Справочник.Лико_Работы.Засветка)
	|			И Лико_ОтчетФормногоУчасткаЗасветкаStork.Ссылка ЕСТЬ NULL
	|			И Лико_ОтчетФормногоУчасткаТрафСетки.Ссылка ЕСТЬ NULL
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки) КАК ВТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|			ПО ВТ.ЗаказКлиента = ЗаказКлиентаЦвета.Ссылка
	|				И (ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ.Период,
	|		ВТ.ЗаказКлиента,
	|		ВТ.РабочийЦентр,
	|		ВТ.Количество,
	|		ЗаказКлиентаЦвета.НомерПроката,
	|		ВТ.Затрата) КАК ВТПрокатыТрафарета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|		ПО ВТПрокатыТрафарета.ЗаказКлиента = ЗаказКлиентаВидыРабот.Ссылка
	|			И ВТПрокатыТрафарета.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
	|			И ВТПрокатыТрафарета.РабочийЦентр.ВидРабочегоЦентра = ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(, ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|			И ВТПрокатыТрафарета.ЗаказКлиента.Площадка = Лико_ЦеныГруппНоменклатурыСрезПоследних.Площадка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
	|					И Площадка.Наименование = "" Ликофлекс"") КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПрокатыТрафарета.Период,
	|	ВТПрокатыТрафарета.ЗаказКлиента,
	|	ВТПрокатыТрафарета.РабочийЦентр,
	|	ВТПрокатыТрафарета.Количество,
	|	ВТПрокатыТрафарета.Затрата,
	|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1),
	|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100),
	|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0),
	|	ВТПрокатыТрафарета.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПрокатаРаботы" ;
	;
	
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции




Функция ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказуДляОтгрузки(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ЗатратыПоЗаказуДляОтгрузки";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТПрокатыТрафарета.Период КАК Период,
		|	ВТПрокатыТрафарета.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТПрокатыТрафарета.РабочийЦентр КАК РабочийЦентр,
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ТрафаретныеЗасветки)) КАК СтатьяЗатрат,
		|	ВТПрокатыТрафарета.Затрата КАК Затрата,
		|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1) КАК НомерПроката,
		|	ВТПрокатыТрафарета.Количество КАК Количество,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100) КАК НомерПрокатаРаботы,
		|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ.Период КАК Период,
		|		ВТ.ЗаказКлиента КАК ЗаказКлиента,
		|		ВТ.РабочийЦентр КАК РабочийЦентр,
		|		ВТ.Затрата КАК Затрата,
		|		ВТ.Количество КАК Количество,
		|		ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката
		|	ИЗ
		|		(ВЫБРАТЬ
		|			МАКСИМУМ(&Период) КАК Период,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр КАК РабочийЦентр,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки КАК Затрата,
		|			СУММА(1) КАК Количество
		|		ИЗ
		|			Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ЗасветкаStork КАК Лико_ОтчетФормногоУчасткаЗасветкаStork
		|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаЗасветкаStork.Заказ
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ТрафСетки КАК Лико_ОтчетФормногоУчасткаТрафСетки
		|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаТрафСетки.Заказ
		|		ГДЕ
		|			Лико_ВыполненныеРаботыРаботы.Ссылка = &Ссылка
		|			И Лико_ВыполненныеРаботыРаботы.Работа = ЗНАЧЕНИЕ(Справочник.Лико_Работы.Засветка)
		|			И Лико_ОтчетФормногоУчасткаЗасветкаStork.Ссылка ЕСТЬ NULL
		|			И Лико_ОтчетФормногоУчасткаТрафСетки.Ссылка ЕСТЬ NULL
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки) КАК ВТ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|			ПО ВТ.ЗаказКлиента = ЗаказКлиентаЦвета.Ссылка
		|				И (ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ.Период,
		|		ВТ.ЗаказКлиента,
		|		ВТ.РабочийЦентр,
		|		ВТ.Количество,
		|		ЗаказКлиентаЦвета.НомерПроката,
		|		ВТ.Затрата) КАК ВТПрокатыТрафарета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|		ПО ВТПрокатыТрафарета.ЗаказКлиента = ЗаказКлиентаВидыРабот.Ссылка
		|			И ВТПрокатыТрафарета.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
		|			И ВТПрокатыТрафарета.РабочийЦентр.ВидРабочегоЦентра = ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(, ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
		|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
		|			И ВТПрокатыТрафарета.ЗаказКлиента.Площадка = Лико_ЦеныГруппНоменклатурыСрезПоследних.Площадка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				,
		|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
		|					И Площадка.Наименование = "" Ликофлекс"") КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
		|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПрокатыТрафарета.Период,
		|	ВТПрокатыТрафарета.ЗаказКлиента,
		|	ВТПрокатыТрафарета.РабочийЦентр,
		|	ВТПрокатыТрафарета.Количество,
		|	ВТПрокатыТрафарета.Затрата,
		|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1),
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100),
		|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПрокатаРаботы";

	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции



#КонецОбласти

#Область Отчеты

/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Задание складскому работнику
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПечатьДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	////КомандаПечати.СразуНаПринтер = Истина;	
	//
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	"ПечатьДокумента",
		//	НСтр("ru = 'ПечатьДокумента'"),
		//	ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
КонецФункции
#КонецОбласти



#Область Прочее

#КонецОбласти 


//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
    МеханизмыДокумента.Добавить("Лико_Склад");
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаЛико_ВыполненныеРаботы(Запрос, ТекстыЗапроса, Регистры); 
	ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказу(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказуДляОтгрузки(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции
 
//- <--- Лико2.5 m.shenderov 30.03.2022 

 