
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПроверитьДату();
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	//+ ---> Лико2.5 m.shenderov 30.03.2022
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи,    РежимПроведения);
	//- <--- Лико2.5 m.shenderov 30.03.2022

	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//+ ---> Лико2.5 m.shenderov 22.04.2022
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);  
	//- <--- Лико2.5 m.shenderov 22.04.2022
	
	//Отложеннный пересчет по заказу  
	Если Движения.Лико_ЗатратыПоЗаказу.Количество()>0 И ЗначениеЗаполнено(ЗаказКлиента.РезультатЗаказа) Тогда 
		НоваяЗапись =РегистрыСведений.Лико_ПересчетДокументов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Заказ = ЗаказКлиента;
		НоваяЗапись.ДокументДвижения = ссылка;
		НоваяЗапись.Себестоимость = Истина;
		НоваяЗапись.Выручка = Ложь;
		НоваяЗапись.Записать();
    КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);

	
КонецПроцедуры

Процедура СтруктураПараметровЗаписиОбъекта() 	
	
	Если Не ДополнительныеСвойства.Свойство("ЕстьВопросыПередЗаписью") ТОгда
		ДополнительныеСвойства.Вставить("ЕстьВопросыПередЗаписью", Ложь);
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("НовыйОбъект") ТОгда
		ДополнительныеСвойства.Вставить("НовыйОбъект", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ПринудительноЗакрытьФорму") ТОгда
		ДополнительныеСвойства.Вставить("ПринудительноЗакрытьФорму", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("РежимЗаписи") ТОгда
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);		
	КонецЕсли; 	
	Если Не ДополнительныеСвойства.Свойство("РежимПроведения") ТОгда
		ДополнительныеСвойства.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный); 	
	КонецЕсли;
	
Конецпроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	
	
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;

	Структура = Новый Структура;
	Структура.Вставить("Работа",Справочники.Лико_Работы.Засветка);
	НайденныеСтроки=Работы.НайтиСтроки(Структура);
	Если  НайденныеСтроки.Количество()>0 Тогда
		ПроверяемыеРеквизиты.Добавить("РабочийЦентр");
	Иначе
		
	
	МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента"); 
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;  	
	Дата          = ТекущаяДатаСеанса();
	АвторДокумента=ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
КонецПроцедуры

#КонецОбласти

#Область Прочее
Процедура СформироватьСписокРегистровДляКонтроля()
	
	
	
	Массив = Новый Массив;
	
	Если Не ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении") Тогда
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
	
	
КонецПроцедуры

Процедура ПроверитьДату() //+Лико m.shenderov 16.05.2019

	Если Дата=НайтиДату() Тогда
		Дата=Дата+1;
		ПроверитьДату();
	КонецЕсли;
	
		
КонецПроцедуры //-Лико m.shenderov 16.05.2019

Функция НайтиДату() //+Лико m.shenderov 16.05.2019
	ВозвратДата=Дата('00010101');
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ВыполненныеРаботыРаботы.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
		|ГДЕ
		|	Лико_ВыполненныеРаботыРаботы.Ссылка.Дата = &Дата
		|	И Лико_ВыполненныеРаботыРаботы.Работа = &Работа
		|	И Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = &ЗаказКлиента
		|	И Лико_ВыполненныеРаботыРаботы.Ссылка <> &Ссылка
		|	И Лико_ВыполненныеРаботыРаботы.Ссылка.ОбъектНоменклатуры = &ОбъектНоменклатуры";
		Запрос.УстановитьПараметр("Дата",Дата);
		Запрос.УстановитьПараметр("Работа",Работы[0].Работа);
		Запрос.УстановитьПараметр("ОбъектНоменклатуры",ОбъектНоменклатуры);
		Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
 		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
		    ВозвратДата=Выборка.Дата;
		КонецЦикла; 
	Возврат ВозвратДата;	
КонецФункции //-Лико m.shenderov 16.05.2019 


#КонецОбласти

#Область ДвижениеяДокумента
Процедура ОтразитьЛико_ВыполненныеРаботы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица_Лико_ВыполненныеРаботы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ВыполненныеРаботы;
	
	Если Отказ ИЛИ Таблица_Лико_ВыполненныеРаботы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Лико_ВыполненныеРаботы = Движения.Лико_ВыполненныеРаботы;
	Лико_ВыполненныеРаботы.Записывать = Истина;
	Лико_ВыполненныеРаботы.Загрузить(Таблица_Лико_ВыполненныеРаботы);
	
КонецПроцедуры

Процедура ОтразитьЛико_ЗатратыПоЗаказу(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица_Лико_ЗатратыПоЗаказу = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ЗатратыПоЗаказу;
	
	Если Отказ ИЛИ Таблица_Лико_ЗатратыПоЗаказу.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Лико_ЗатратыПоЗаказу = Движения.Лико_ЗатратыПоЗаказу;
	Лико_ЗатратыПоЗаказу.Записывать = Истина;
	Лико_ЗатратыПоЗаказу.Загрузить(Таблица_Лико_ЗатратыПоЗаказу); 
	
		
КонецПроцедуры


Процедура ОтразитьЛико_ЗатратыПоЗаказуДляОтгрузки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_ЗатратыПоЗаказуДляОтгрузки;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Лико_ЗатратыПоЗаказуДляОтгрузки = Движения.Лико_ЗатратыПоЗаказуДляОтгрузки;
	Лико_ЗатратыПоЗаказуДляОтгрузки.Записывать = Истина;
	Лико_ЗатратыПоЗаказуДляОтгрузки.Загрузить(Таблица);
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ) 
	
	//+ ---> Лико2.5 m.shenderov 22.04.2022
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	//- <--- Лико2.5 m.shenderov 22.04.2022
	
КонецПроцедуры



#КонецОбласти
