
// Процедура нажатия на "НадписьОтборПоТПФ".
//
&НаКлиенте
Процедура НадписьОтборПоТПФНажатие(Элемент, СтандартнаяОбработка)
	Ф = ПолучитьФорму("Справочник.СА_ТипыПечатныхФорм.Форма.ВыборТПФ");
	Ф.Выбранные = ТипыПечатныхФорм;
	Ф.Заполнить();
	Если Ф.ОткрытьМодально() = "Применить" Тогда
		ТипыПечатныхФорм = Ф.Выбранные;
		ВсеТипыПечатныхФорм = Ф.ВыбраныВсеТипыПечатныхФорм;
		Элементы.Список.Обновить();
		ОбновитьНадписьОтборПоТПФ();
		ОбновитьСписок();
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСписок();
	ОбновитьНадписьОтборПоТПФ();
КонецПроцедуры

// Процедура устанавливает НадписьОтборПоТПФ.Заголовок
//
&НаКлиенте
Процедура ОбновитьНадписьОтборПоТПФ()
	Если ТипыПечатныхФорм.Количество()=0 Тогда
		НадписьОтборПоТПФ = "Все типы печатных форм";
	ИначеЕсли (ВсеТипыПечатныхФорм И ТипыПечатныхФорм.Количество()>0) Тогда
		НадписьОтборПоТПФ = "Все типы печатных форм (отобранные документы выделены)";
	Иначе
		НадписьОтборПоТПФ = "Установлен отбор по типам печатных форм (отобранные документы выделены)";
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "ПриЗагрузкеДанныхИзНастроекНаСервере" формы
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ВсеТипыПечатныхФорм = ВсеЛиТипыПечатныхФормВыбраны();
	ОбновитьСписок();
КонецПроцедуры

// Процедура обновляет список документов журнала
//
&НаСервере
Процедура ОбновитьСписок()
	Элемент = Список.Параметры.Элементы.Найти("ТипыПечатныхФорм");
	Если (ВсеТипыПечатныхФорм Или ТипыПечатныхФорм.Количество() = 0) Тогда
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "СА_СканОбразы.ТипПечатнойФормы В(&ТипыПечатныхФорм)", "Истина");
		Если Не Элемент = Неопределено Тогда 
			Элемент.Использование = Ложь;
		КонецЕсли;
	Иначе
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Истина", "СА_СканОбразы.ТипПечатнойФормы В(&ТипыПечатныхФорм)");
       	Элемент = Список.Параметры.Элементы.Найти("ТипыПечатныхФорм");
		Элемент.Использование = Истина;
		Элемент.Значение = ТипыПечатныхФорм;
	КонецЕсли;
КонецПроцедуры

// Функция проверяет все ли типы печатных форм выбраны
//
// Возвращаемое значение:
//  Признак успешности операции
//
&НаСервере
Функция ВсеЛиТипыПечатныхФормВыбраны()
	тзВсеТПФ = Справочники.СА_ТипыПечатныхФорм.ПолучитьВсеТипыПечатныхФорм();
	Все = Истина;
	Для каждого СтрТПФ Из тзВсеТПФ Цикл
		Если ТипыПечатныхФорм.НайтиПоЗначению(СтрТПФ.ТипПечатнойФормы)=Неопределено Тогда
			Все = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Все;
КонецФункции

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
   Если ЗначениеЗаполнено(Параметры.РежимВыбора) Тогда
        Элементы.Список.ТекущаяСтрока = Параметры.ТекущаяСтрока;
        Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
    КонецЕсли;	
КонецПроцедуры
