#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ИСТИНА, если вид дохода иностранной организации не облагается налогом в РФ, ЛОЖЬ - в ином случае. 
//
// Параметры:
//   ВидДохода - ПеречислениеСсылка.ВидыДоходовИностранныхОрганизаций.
//
// Возвращаемое значение:
//   Булево - признак облагаемости налогом.
Функция ЭтоНеОблагаемыйНалогомВидДохода(ВидДохода) Экспорт
	
	// В соответствии с контрольными соотношениями от ФНС необлагаемые коды доходов:
	// КД 10, 14, 15, 16, 17, 19, 20, 22, 25, 27, 30, 34 - 38, 40, 33.
	
	Результат = (ВидДохода = ДоходыТовары)                     // 33
		ИЛИ (ВидДохода = ДоходыГосЦБ)                          // 10
		ИЛИ (ВидДохода = ДоходыОтРеализацииАкцийРФНеБолее50)   // 14
		ИЛИ (ВидДохода = ДоходыРеализацияЦенныхБумаг)          // 15
		ИЛИ (ВидДохода = ДоходыСрочныеФинИнструменты)          // 16
		ИЛИ (ВидДохода = ДоходыВалютныеОпераций)               // 17
		ИЛИ (ВидДохода = ДоходыРеализацияНедвижимостиНеРФ)     // 19
		ИЛИ (ВидДохода = ДоходыРеализацияИмущества)            // 20
		ИЛИ (ВидДохода = ДоходыАрендаИмуществаНеРФ)            // 22
		ИЛИ (ВидДохода = ДоходыТЭО)                            // 25
		ИЛИ (ВидДохода = ПроцентыДепоПремий)                   // 27
		ИЛИ (ВидДохода = ДоходыПИФНеБолее50)                   // 30
		ИЛИ (ВидДохода = ДоходыИноеИмуществоНеОблагаемые)      // 34
		ИЛИ (ВидДохода = ДоходыИмущественныеПраваНеОблагаемые) // 35
		ИЛИ (ВидДохода = ДоходыУслугиНеОблагаемые)             // 36
		ИЛИ (ВидДохода = ДоходыОблигацииНеОблагаемые)          // 37
		ИЛИ (ВидДохода = ДоходыВПределахВкладаАкционера)       // 38
		ИЛИ (ВидДохода = ИныеДоходыНеОблагаемые);              // 40
	
	Возврат Результат;
	
КонецФункции

// Код вида дохода.
// 
// Параметры:
//  ВидДохода - ПеречислениеСсылка.ВидыДоходовИностранныхОрганизаций.
// 
// Возвращаемое значение:
//  Строка - Код вида дохода
Функция КодВидаДохода(ВидДохода) Экспорт

	КодВидаДохода = Лев(ВидДохода, 2);
	
	Возврат КодВидаДохода;
	
КонецФункции

#КонецОбласти

#КонецЕсли