
&НаСервере
&Вместо("Утверждение")
Процедура Лико_Утверждение()

	Если ЗначениеЗаполнено(Объект.ДатаУтверждения) Тогда 
		//Проверяем, есть ли кнопка утверждения и убираем ее
		Элем = Элементы.Найти("Утвердить");
		Если Элем <> Неопределено Тогда 
			Элементы.Удалить(Элем);
		КонецЕсли;	

		ОтменитьУтверждение=Элементы.Добавить("ОтменитьУтверждение", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
		ОтменитьУтверждение.Заголовок="Утвердил: "+  Объект.Утвердил.Наименование+ " "+Строка(Объект.ДатаУтверждения);
		ОтменитьУтверждение.ИмяКоманды="ОтменитьУтверждение";
		ОтменитьУтверждение.Отображение = ОтображениеКнопки.КартинкаИТекст;
		ОтменитьУтверждение.Картинка = БиблиотекаКартинок.ОтметитьОперациюВыполненной;



	Иначе
		Элем = Элементы.Найти("ОтменитьУтверждение");
		Если Элем <> Неопределено Тогда 
			Элементы.Удалить(Элем);
		КонецЕсли;	
		Утвердить=Элементы.Добавить("Утвердить", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
		Утвердить.Заголовок="Утвердить";
		Утвердить.ИмяКоманды="Утвердить";
		Утвердить.Картинка = БиблиотекаКартинок.Успешно;
	КонецЕсли;	




КонецПроцедуры
