
&После("ОбработкаПроверкиЗаполнения")
Процедура Лико_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		МассивНепроверяемыхРеквизитов = Новый Массив;

	Структура = Новый Структура;
	Структура.Вставить("Работа",Справочники.Лико_Работы.Засветка);
	НайденныеСтроки=Работы.НайтиСтроки(Структура);
	Если  НайденныеСтроки.Количество()>0 Тогда
		ПроверяемыеРеквизиты.Добавить("РабочийЦентр");
	Иначе
		
	
	МассивНепроверяемыхРеквизитов.Добавить("ЗаказКлиента"); 
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);	
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура Лико_ОбработкаУдаленияПроведения(Отказ)



	Если Отказ Тогда
		Возврат;
	КонецЕсли;


  ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);





КонецПроцедуры
