
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры





#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства
#КонецОбласти


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства
#КонецОбласти

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура МакетШКОбъектаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещение=Новый ОписаниеОповещения("МакетШКОбъектаНоменклатурыНачалоВыбораЗавершение",ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОповещение,СписокМакетов("Справочники","ЯССМ_ОбъектыНоменклатуры"),Элементы.МакетШКОбъектаНоменклатуры,);		
	
	
КонецПроцедуры

&НаКлиенте
Процедура МакетШКОбъектаНоменклатурыНачалоВыбораЗавершение(РезультатФормы,ПараметрыФормы) Экспорт
	Объект.МакетШКОбъектаНоменклатуры=РезультатФормы;
КонецПроцедуры


&НаКлиенте
Процедура МакетШКОбъектаНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Функция СписокМакетов(ОбъектМД,Имя)
	
	Список = Новый СписокЗначений;	
	Для каждого Макет Из Метаданные[ОбъектМД].ЯССМ_ОбъектыНоменклатуры.Макеты Цикл
		Список.Добавить(Макет.Имя); 	
	КонецЦикла;
	Возврат Список;	
КонецФункции

&НаКлиенте
Процедура МакетШКОбъектаНоменклатурыОткрытие(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.МакетШКОбъектаНоменклатуры) Тогда
		СтандартнаяОбработка=Ложь;
		ОткрытьМакетПечатнойФормыДляПросмотра();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьМакетПечатнойФормыДляПросмотра()
	
	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяОбъектаМетаданныхМакета","Справочник.ЯССМ_ОбъектыНоменклатуры."+Объект.МакетШКОбъектаНоменклатуры);
	ПараметрыОткрытия.Вставить("ТипМакета", "MXL");
	//ПараметрыОткрытия.Вставить("ТолькоОткрытие", Истина);
	
	Если ПараметрыОткрытия.ТипМакета = "MXL" Тогда
		ПараметрыОткрытия.Вставить("ИмяДокумента", Объект.МакетШКОбъектаНоменклатуры);
		ПараметрыОткрытия.Вставить("Редактирование", Истина);
		ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.РедактированиеМакета", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСвойство(Команда)
	Подсказка="Ввидите имя свойства";
	ОписаниеОповещение= Новый ОписаниеОповещения("ПолучитьСвойствоЗавершение",ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещение,"",Подсказка);
	
КонецПроцедуры
&НаКлиенте
Процедура ПолучитьСвойствоЗавершение(РезультатФормы,ПараметрыФормы) Экспорт
	Если  ЗначениеЗаполнено(РезультатФормы) Тогда
		ЗначениеСвойства=ПолучитьСвойствоСервер(РезультатФормы,Объект.Пользователь,Объект.ИмяКомпьютера);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Строка(ЗначениеСвойства);
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСвойствоСервер(Свойство,Пользователь,ИмяКомпьютера)
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство(Свойство,,Пользователь,ИмяКомпьютера);	
КонецФункции

&НаКлиенте
Процедура СкопироватьСвойства(Команда)
	Подсказка="Выберете рабочее место";
	ОписаниеОповещение= Новый ОписаниеОповещения("СкопироватьСвойстваЗавершение",ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещение,ПредопределенноеЗначение("Справочник.Лико_РабочиеМеста.ПустаяСсылка"),Подсказка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСвойстваЗавершение(РезультатФормы,ПараметрыФормы) Экспорт
	Если  РезультатФормы<>Неопределено  Тогда
		Если ЗначениеЗаполнено( РезультатФормы) Тогда
			СкопироватьСвойстваСервер (РезультатФормы);
			СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СкопироватьСвойстваСервер (Ссылка)
	ЗаполнитьЗначенияСвойств(Объект,Ссылка,,"Код,Наименование,Пользователь,ИмяКомпьютера,ДополнительныеРеквизиты");
	Объект.ДополнительныеРеквизиты.Очистить();
	Для каждого ДР Из Ссылка.ДополнительныеРеквизиты Цикл
		НовыйДР=Объект.ДополнительныеРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйДР,ДР);		
	КонецЦикла; 		
КонецПроцедуры


