#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РегламентированныйУчетВНА")
		И НЕ Параметры.РегламентированныйУчетВНА Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений();
		
		Для Каждого ОписаниеЗначения Из Метаданные.Перечисления.СостоянияОС.ЗначенияПеречисления Цикл
			Значение = Перечисления.СостоянияОС[ОписаниеЗначения.Имя];
			Если Значение <> Перечисления.СостоянияОС.ПринятоКЗабалансовомуУчету Тогда
				ДанныеВыбора.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли