
&Вместо("ПолучитьДанныеДляПечатнойФормыМХ1")
Функция Лико_ПолучитьДанныеДляПечатнойФормыМХ1(ПараметрыПечати, МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыПередачи.Ссылка                     КАК Ссылка,
	|	ЕСТЬNULL(ДокументПередачи.ИсправляемыйДокумент.Номер, ДокументПередачи.Номер) КАК Номер,
	|	ЕСТЬNULL(ДокументПередачи.ИсправляемыйДокумент.Дата, ДокументПередачи.Дата)   КАК Дата,
	|	ЕСТЬNULL(ДокументПередачи.ИсправляемыйДокумент.Дата, ДокументПередачи.Дата)   КАК ДатаДокумента,
	|	ДокументПередачи.Дата                     КАК ДатаПолученияСебестоимости,
	|	ДокументПередачи.Контрагент               КАК Поклажедержатель,
	|	ДокументПередачи.Организация              КАК Организация,
	|	ТоварыПередачи.Склад                      КАК Склад,
	|	ДокументПередачи.Договор.Дата             КАК ДоговорДата,
	|	ДокументПередачи.Договор.Номер            КАК ДоговорНомер,
	|	ДокументПередачи.Валюта                   КАК Валюта,
	|	ДокументПередачи.Отпустил                 КАК Сдал,
	|	ДокументПередачи.ОтпустилДолжность        КАК СдалДолжность,
	|	ДокументПередачи.КоэффициентПересчетаРегл КАК КоэффициентПересчета
	|ПОМЕСТИТЬ ВтШапка
	|ИЗ
	|	Документ.ПередачаТоваровХранителю.Товары КАК ТоварыПередачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ДокументПередачи
	|		ПО ТоварыПередачи.Ссылка = ДокументПередачи.Ссылка
	|ГДЕ
	|	ДокументПередачи.Ссылка В(&МассивДокументов)
	|	И ДокументПередачи.Проведен
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтШапка.Ссылка                     КАК Ссылка,
	|	ВтШапка.Номер                      КАК Номер,
	|	ВтШапка.Дата                       КАК Дата,
	|	ВтШапка.Дата                       КАК ДатаДокумента,
	|	ВтШапка.ДатаПолученияСебестоимости КАК ДатаПолученияСебестоимости,
	|	ВтШапка.Организация                КАК Организация,
	|	ВтШапка.ДоговорДата                КАК ДоговорДата,
	|	ВтШапка.ДоговорНомер               КАК ДоговорНомер
	|ИЗ
	|	ВтШапка КАК ВтШапка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 2
	|ВЫБРАТЬ
	|	ВтШапка.Ссылка           КАК Ссылка,
	|	ВтШапка.Поклажедержатель КАК Поклажедержатель,
	|	ВтШапка.Склад            КАК Склад,
	|	ЛОЖЬ                     КАК ПредварительныйРасчет,
	|	НЕОПРЕДЕЛЕНО             КАК ИсточникИнформацииОЦенахДляПечати,
	|	""""                     КАК ПредставлениеСклада,
	|	""""                     КАК ПредставлениеПодразделения,
	|	""""                     КАК ОсобыеОтметки,
	|	""""                     КАК УсловияХранения,
	|	ВтШапка.Сдал             КАК Сдал,
	|	ВтШапка.СдалДолжность    КАК СдалДолжность
	|ИЗ
	|	ВтШапка КАК ВтШапка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 3
	|ВЫБРАТЬ
	|	Товары.Ссылка       КАК Ссылка,
	|	Товары.Склад        КАК Склад,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА Товары.Номенклатура.Артикул
	|		ИНАЧЕ Товары.Номенклатура.Код
	|	КОНЕЦ               КАК НоменклатураКод,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.НаименованиеПолное КАК ПредставлениеНоменклатуры,
	|	Товары.Характеристика.НаименованиеПолное КАК ПредставлениеХарактеристики,
	|	&ТекстЗапросаКодЕдиницыИзмерения          КАК ЕдиницаИзмеренияКод,
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ЕдиницаИзмеренияНаименование,
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ВидУпаковки,
	|	Товары.КоличествоУпаковок КАК Количество,
	|	ВЫБОР
	|		КОГДА ВтШапка.Валюта = ВтШапка.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА Товары.Цена
	|		ИНАЧЕ Товары.Цена * ВтШапка.КоэффициентПересчета
	|	КОНЕЦ                     КАК Цена,
	|	ВЫБОР
	|		КОГДА ВтШапка.Валюта = ВтШапка.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ВЫРАЗИТЬ(Товары.Сумма  КАК ЧИСЛО(31, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(Товары.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) * Товары.Количество КАК ЧИСЛО(31, 2)) * ВтШапка.КоэффициентПересчета
	|	КОНЕЦ                     КАК Сумма
	|ИЗ
	|	Документ.ПередачаТоваровХранителю.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтШапка КАК ВтШапка
	|		ПО Товары.Ссылка = ВтШапка.Ссылка
	|			И Товары.Склад = ВтШапка.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Склад,
	|	НомерСтроки,
	|	Номенклатура,
	|	ПредставлениеХарактеристики,
	|	ВидУпаковки
	|
	|ИТОГИ ПО
	|	Ссылка,
	|	Склад
	|;";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКодЕдиницыИзмерения",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Код",
	"Товары.Упаковка",
	"Товары.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаНаименованиеЕдиницыИзмерения",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Наименование",
	"Товары.Упаковка",
	"Товары.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"Товары.Упаковка",
	"Товары.Номенклатура"));

	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;

	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;

	Запрос.УстановитьПараметр("КолонкаКодов",     КолонкаКодов);
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);

	УстановитьПривилегированныйРежим(Истина);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);

//	РезультатПоШапке          = МассивРезультатов[1];
//	РезультатПоСкладам        = МассивРезультатов[2];
//	РезультатПоТабличнойЧасти = МассивРезультатов[3];

//	СтруктураДанныхДляПечати = Новый Структура("РезультатПоШапке, РезультатПоСкладам, РезультатПоТабличнойЧасти",
//	РезультатПоШапке, РезультатПоСкладам, РезультатПоТабличнойЧасти);

СтруктураДанныхДляПечати = Новый Структура;
СтруктураДанныхДляПечати.Вставить("РезультатПоШапке",          МассивРезультатов[1]);
СтруктураДанныхДляПечати.Вставить("РезультатПоСкладам",        МассивРезультатов[2]);
СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", МассивРезультатов[3]);
СтруктураДанныхДляПечати.Вставить("РезультатПоОшибкам",        Неопределено);


	Возврат СтруктураДанныхДляПечати;

КонецФункции

