
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если Команда.Имя = "ПодменюПечатьОбычное_АктБрака" И ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		НеобходимыеРеквизиты = Лико_Дополнительно.ПолучитьЗначенияРеквизитовСсылки(Элементы.Список.ТекущаяСтрока, "СотрудникПринявшийРешение,Дефект,ОписаниеДефекта");
		Структура = Новый Структура;
		Структура.Вставить("СсылкаНаОбъект",Элементы.Список.ТекущаяСтрока);
		//Структура.Вставить("ПредседательКомисии",Объект.ЧленКомиссии1) ;
		//Структура.Вставить("ГлавныйТехнолог", НеобходимыеРеквизиты.СотрудникПринявшийРешение);
		//Структура.Вставить("НачальникОтделаЗакупок",Объект.ЧленКомиссии3) ;
		//Структура.Вставить("ОписаниеНедостатков", "" + НеобходимыеРеквизиты.Дефект + ?(ЗначениеЗаполнено(НеобходимыеРеквизиты.ОписаниеДефекта), " (" + НеобходимыеРеквизиты.ОписаниеДефекта + ")", ""));
		ОткрытьФорму("Обработка.ЯССМ_АктБрака.Форма.ОтчетУпр",Структура,,,,,,);
		Возврат;
	КонецЕсли;
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
