#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ШтрихКод(ТипоРазмерСсылка) Экспорт 
	
	Перем ШК;
	
	ВидИнформации = "02";
	
	КодСправочника = Формат(ТипоРазмерСсылка.Код, "ЧЦ=10; ЧВН=; ЧГ=");	
	ШК = "8" + ВидИнформации + КодСправочника;


	КонтольныйСимвол = 0;
	Для Ц = 1 по СтрДлина(ШК) Цикл
		Попытка
			КонтольныйСимвол = КонтольныйСимвол + Число(Сред(ШК, Ц, 1));
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	КонтольныйСимвол = Прав(СокрЛП(КонтольныйСимвол),1);
	
	ШК = ШК + КонтольныйСимвол;
	
	Возврат ШК;

	
	
КонецФункции

Функция ШтрихКодСтрокой(ТипоРазмерСсылка) Экспорт
	
	Перем ШК;
	ВидИнформации = 2;
	
	
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	
	ФКод = Формат(ТипоРазмерСсылка.Код, "ЧЦ=10; ЧН=0000000000; ЧВН=; ЧГ=0"); // 7 символов код объекта номенклатуры
	
	Разделитель = " ";
	
	ШК = "8"+ ФВидИнформации
	+ ФКод;
	
	ШКСтрокой = "6"+ ФВидИнформации + Разделитель
	+ ФКод;
	
	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШК = ШК + КонтольныйСимвол;
	ШКСтрокой = ШКСтрокой + Разделитель + КонтольныйСимвол;
	
	Возврат ШК;
КонецФункции //ПолучитьКороткийШтрихКод Экспорт



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли