
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		ЗаказКлиента = ДанныеЗаполнения.Ссылка;
		Ответственный = Пользователи.ТекущийПользователь();
		Организация = ДанныеЗаполнения.Площадка.Организация;
		Площадка = ДанныеЗаполнения.Площадка;
		Для Каждого ТекСтрокаЦвета Из ДанныеЗаполнения.Цвета Цикл
			Если ТекСтрокаЦвета.Цветоделение И ТекСтрокаЦвета.ВидСекции.Родитель = Справочники.Лико_ВидыСекций.Глубокая Тогда
				НоваяСтрока = Валы.Добавить();
				НоваяСтрока.Вал = ТекСтрокаЦвета.Вал;
				НоваяСтрока.Форма = ТекСтрокаЦвета.Форма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
					
	// регистр Лико_ЗаявкиНаГравировкуВалов Приход
	Движения.Лико_ЗаявкиНаГравировкуВалов.Записывать = Истина;
	Для Каждого ТекСтрокаВалы Из Валы Цикл
		Движение = Движения.Лико_ЗаявкиНаГравировкуВалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Вал = ТекСтрокаВалы.Вал;
		Движение.Форма = ТекСтрокаВалы.Форма;
		Движение.Количество = 1;
	КонецЦикла;

КонецПроцедуры
