
//&НаСервере
//&Вместо("ЗаполнитьДЗ")
//Процедура Лико_ЗаполнитьДЗ()




//	КоличествоНепрочитанныхИнструкций=Лико_ОбщегоНазначенияСервер.ПроверкаНепрочитанныхИнструкциий(Оператор,РабочийЦентр);	
//	Если КоличествоНепрочитанныхИнструкций>0 Тогда
//		ЕстьНепрочитанныеИнструкции=Истина;
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ТС_Инструкции.Ссылка КАК СправочникСсылка,
//		|	ТС_Инструкции.Родитель КАК Родитель,
//		|	ТС_Инструкции.Наименование КАК Наименование,
//		|	ТС_Инструкции.ИмяФайла КАК ИмяФайла,
//		|	ТС_Инструкции.ПутьКФайлу КАК ПутьКФайлу,
//		|	ТС_Инструкции.ШтрихКод КАК ШтрихКод,
//		|	ВЫБОР
//		|		КОГДА НЕ ТС_Инструкции.ЭтоГруппа
//		|			ТОГДА 2
//		|		ИНАЧЕ 1
//		|	КОНЕЦ КАК Пробел,
//		|	НЕ ТС_Инструкции.ЭтоГруппа КАК Инструкция,
//		|	ВЫБОР
//		|		КОГДА ТС_Инструкции.Тип = ЗНАЧЕНИЕ(Перечисление.ТС_ТипыИнструкцийИТестов.Инструкция)
//		|			ТОГДА ""Непрочитанная инструкция!!!""
//		|		ИНАЧЕ ""Не пройден тест!!!""
//		|	КОНЕЦ КАК Комментарий
//		|ИЗ
//		|	Справочник.ТС_Инструкции КАК ТС_Инструкции
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТС_ЖурналОзнакомленияСИнструкциями.СрезПоследних КАК ТС_ЖурналОзнакомленияСИнструкциямиСрезПоследних
//		|		ПО ТС_Инструкции.Ссылка = ТС_ЖурналОзнакомленияСИнструкциямиСрезПоследних.Инструкция
//		|			И (ТС_ЖурналОзнакомленияСИнструкциямиСрезПоследних.Оператор = &Оператор)
//		|			И ТС_Инструкции.КонтрольДатыОзнакомления <= ТС_ЖурналОзнакомленияСИнструкциямиСрезПоследних.Период
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС_Инструкции.РабочиеЦентры КАК ТС_ИнструкцииРАбочиеЦентры
//		|		ПО (ТС_ИнструкцииРАбочиеЦентры.Ссылка = ТС_Инструкции.Ссылка)
//		|ГДЕ
//		|	ТС_ЖурналОзнакомленияСИнструкциямиСрезПоследних.Период ЕСТЬ NULL
//		|	И ТС_Инструкции.КонтрольДатыОзнакомления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//		|	И (ТС_ИнструкцииРАбочиеЦентры.РабочийЦентр ЕСТЬ NULL
//		|			ИЛИ ТС_ИнструкцииРАбочиеЦентры.РабочийЦентр = &РабочийЦентр)
//		|	И ТС_Инструкции.КонтрольДатыОзнакомления < &ТекущаяДата
//		|	И НЕ ТС_Инструкции.Выключить";
//		Запрос.УстановитьПараметр("Оператор",Оператор );
//		Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр );
//		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата() );


//		РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//		КоличествоСтрок=Запрос.Выполнить().Выбрать().Количество();
//		ЗначениеВРеквизитФормы(РезультатЗапроса, "ДЗ");

//		Возврат;

//	КонецЕсли;



//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТС_ИнструкцииРабочиеЦентры.Ссылка КАК Ссылка
//	|ПОМЕСТИТЬ ВтИнструкции
//	|ИЗ
//	|	Справочник.ТС_Инструкции.РабочиеЦентры КАК ТС_ИнструкцииРабочиеЦентры
//	|ГДЕ
//	|	ТС_ИнструкцииРабочиеЦентры.РабочийЦентр = &РабочийЦентр
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СправочникТС_Инструкции.Ссылка КАК СправочникСсылка,
//	|	СправочникТС_Инструкции.Родитель КАК Родитель,
//	|	СправочникТС_Инструкции.Наименование КАК Наименование,
//	|	СправочникТС_Инструкции.ИмяФайла КАК ИмяФайла,
//	|	СправочникТС_Инструкции.ПутьКФайлу КАК ПутьКФайлу,
//	|	"""" КАК Комментарий,
//	|	СправочникТС_Инструкции.ШтрихКод КАК ШтрихКод,
//	|	ВЫБОР
//	|		КОГДА НЕ СправочникТС_Инструкции.ЭтоГруппа
//	|			ТОГДА 2
//	|		ИНАЧЕ 1
//	|	КОНЕЦ КАК Пробел,
//	|	НЕ СправочникТС_Инструкции.ЭтоГруппа КАК Инструкция
//	|ИЗ
//	|	Справочник.ТС_Инструкции КАК СправочникТС_Инструкции
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИнструкции КАК ВтИнструкции
//	|		ПО СправочникТС_Инструкции.Ссылка = ВтИнструкции.Ссылка
//	|ГДЕ
//	|	(СправочникТС_Инструкции.ЭтоГруппа
//	|			ИЛИ ВЫБОР
//	|				КОГДА НЕ ВтИнструкции.Ссылка ЕСТЬ NULL
//	|					ТОГДА ИСТИНА
//	|				ИНАЧЕ ЛОЖЬ
//	|			КОНЕЦ)
//	|	И НЕ ЕСТЬNULL(СправочникТС_Инструкции.Выключить, ЛОЖЬ)
//	|	И НЕ СправочникТС_Инструкции.ПометкаУдаления
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	СправочникТС_Инструкции.Ссылка ИЕРАРХИЯ
//	|АВТОУПОРЯДОЧИВАНИЕ";
//	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр );
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//	КоличествоСтрок=Запрос.Выполнить().Выбрать().Количество();
//	ЗначениеВРеквизитФормы(РезультатЗапроса, "ДЗ");



//КонецПроцедуры
