#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЭтоАбстрактнаяОперация(ВидОперации) Экспорт
	
	Если АбстрактныеОперации().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЭтоОперацияРаботыСКлассификаторами(ВидОперации) Экспорт

	Если ОперацииРаботыСКлассификаторами().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ЭтоОперацияЗагрузкиДокументов(ВидОперации) Экспорт

	Если ВидОперации = НакладнаяЗагрузкаДокументов
		Или ВидОперации = НакладнаяЗагрузкаДокументовРасчетСтатуса
		Или ВидОперации = НакладнаяЗагрузкаСтатусов
		Или ВидОперации = НакладнаяЗагрузкаСтатусовРасчетСтатуса Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЭтоЗапросСписка(Операция) Экспорт
	
	Возврат Операция = НакладнаяЗагрузкаСтатусов;
	
КонецФункции

Функция ОперацияЯвляетсяОснованием(ВидОперации) Экспорт
	
	Если ОперацииОснования().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция АбстрактныеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(АктИнвентаризацииРасчетСтатуса);
	МассивОпераций.Добавить(АктПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросОстатковПартийРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяВозвратРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеВозвратаРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяГрузУтерянРасчетСтатуса);
	МассивОпераций.Добавить(ПроизводственнаяОперацияРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаДокументовРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусовРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеАннулированиеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеПриемаНаДосмотрРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортОтказРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииОснования() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(АктИнвентаризацииРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяВозвратРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеВозвратаРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяПодтверждениеУтериГрузаПриВозвратеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяГрузУтерянРасчетСтатуса);
	МассивОпераций.Добавить(АктПримененияРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатуса);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(ПроизводственнаяОперацияРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросОстатковПартийРасчетСтатуса);
	МассивОпераций.Добавить(ПланПримененияРасчетСтатуса);
	
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеПриемаНаДосмотрРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортПодтверждениеРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЭкспортОтказРасчетСтатуса);
	
	МассивОпераций.Добавить(НакладнаяПодтверждениеАннулированиеРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРасчетСтатуса() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ПланПримененияРасчетСтатусовПоДокументу);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусовРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаСтатусов);
	МассивОпераций.Добавить(НакладнаяЗагрузкаДокументовРасчетСтатуса);
	МассивОпераций.Добавить(НакладнаяЗагрузкаДокументов);
	МассивОпераций.Добавить(ИмпортПродукцииРасчетСтатусовПоДокументу);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРаботыСКлассификаторами() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ПАТСозданиеКлассификатора);
	МассивОпераций.Добавить(ПАТИзменениеКлассификатора);
	МассивОпераций.Добавить(ПАТСменаСтатусаИзЧерновикаВОтменено);
	МассивОпераций.Добавить(ПАТСменаСтатусаИзЧерновикВАктуально);
	
	МассивОпераций.Добавить(ОрганизацияЗапросКлассификатора);
	МассивОпераций.Добавить(ПАТЗапросКлассификатора);
	МассивОпераций.Добавить(МестоПримененияЗапросКлассификатора);
	МассивОпераций.Добавить(МестоХраненияЗапросКлассификатора);
	МассивОпераций.Добавить(ПартияЗапросКлассификатора);
	МассивОпераций.Добавить(ИмпортируемаяПартияЗапросКлассификатора);
	
	МассивОпераций.Добавить(ОрганизацияСозданиеКлассификатора);
	МассивОпераций.Добавить(ОрганизацияИзменениеКлассификатора);
	МассивОпераций.Добавить(ОрганизацияСменаСтатусаИзЧерновикаВОтменено);
	МассивОпераций.Добавить(ОрганизацияСменаСтатусаИзЧерновикаВАктуально);
	
	МассивОпераций.Добавить(МестоХраненияСозданиеКлассификатора);
	МассивОпераций.Добавить(МестоПримененияСозданиеКлассификатора);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция БазовыеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	Возврат МассивОпераций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
