
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	Если Объект.Номенклатура<>Неопределено Тогда
		Код=Объект.Номенклатура.Код;
	КонецЕсли;
	
	Если Объект.НоменклатураВыпуск<>Неопределено Тогда
		КодВыпуск=Объект.НоменклатураВыпуск.Код;
	КонецЕсли;
	
	СразуНаПринтер=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СразуНаПринтер");
	ПечатьЗаказНаРаскрой=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьЗаказаНаРаскрой");
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	// Подсистема WebSocket
	ПоказыватьQRCode=Ложь;
	WebSocketСервер.Инициализация(ЭтаФорма,ПоказыватьQRCode);
	// Подсистема WebSocket
	//
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	
	РедактированиеОрганизации();
	
    ЗаполнитьСтатистикуСервер();
	
	Если Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		Элементы.Резерв.Видимость=Истина;
		Элементы.Партнер.Видимость = Ложь;
	Иначе
		Элементы.Резерв.Видимость = Ложь;
		Элементы.Партнер.Видимость = Истина;

				
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);  	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры



#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда,Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда	
	
	Код=Объект.Номенклатура.Код;
КонецЕсли;

Если ЗначениеЗаполнено(Объект.НоменклатураВыпуск) Тогда	
	КодВыпуск=Объект.НоменклатураВыпуск.Код;
КонецЕсли;
ЗаполнитьСтатистикуСервер();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Объект.Проведен  И ПечатьЗаказНаРаскрой ТОгда
		//СразуНаПринтер=Истина;
		
		ВыполняемаяОбработка=НайтиПФ("Печатная форма документа ""Заказ на раскрой"" (бланк раскроя)");
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ОбъектыНазначения=Новый Массив;
		ОбъектыНазначения.Добавить(Объект.Ссылка);
		//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
		ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
		ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
		ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
		ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ЗаказНаРаскройБланкРаскроя";
		ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
		
		
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



&НаСервереБезКонтекста
Функция НайтиПФ(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции

&НаКлиенте
Процедура ЭтапПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ЗагузитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК МетражПоЗаказу,
	|	Лико_БланкЭтапаТовары.Характеристика.ЯССМ_Нарезка КАК Нарезка,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник КАК Печатник,
	|	Лико_БланкЭтапаТовары.Ссылка.Дата КАК ДатаПечати,
	|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр КАК РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка КАК НомерБланка
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка.ЗаказНаРаскрой = &ЗаказНаРаскрой
	|	И Лико_БланкЭтапаТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Характеристика.ЯССМ_Нарезка,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник,
	|	Лико_БланкЭтапаТовары.Ссылка.Дата,
	|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка";
	Запрос.УстановитьПараметр("ЗаказНаРаскрой",Объект.Ссылка );
	Объект.ДанныеПоРаскрою.Загрузить( Запрос.Выполнить().Выгрузить());
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Загузить(Команда)
	
	ОписаниеОповещения= Новый ОписаниеОповещения("ЗагузитьЗавершение",ЭтаФорма);
	Режим = РежимДиалогаВопрос.ДаНет; 
	ПоказатьВопрос(ОписаниеОповещения,"Таблица будет очищена!. Продолжить?",Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагузитьЗавершение (РезультатФормы,ПараметрыФормы) Экспорт//+Лико m.shenderov 25.05.2018
	Если РезультатФормы = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗагузитьНаСервере();	
КонецПроцедуры //-Лико m.shenderov 25.05.2018

&НаКлиенте
Процедура НоменклатураВыпускПриИзменении(Элемент)
		НоменклатураПриИзмененииНаСервере();

КонецПроцедуры




#КонецОбласти


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 27.10.2018
	Если Объект.ВидРабот=ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Активация") ТОгда
		Элементы.НоменклатураВыпуск.Видимость=Истина;
	Иначе
		Элементы.НоменклатураВыпуск.Видимость=Ложь;
	КонецЕсли;
	

	
КонецПроцедуры //-Лико m.shenderov 27.10.2018

&НаКлиенте
Процедура ВидРаботПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");

	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	

КонецПроцедуры



&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда 			
			
			Сообщить(Результат.Ошибка); 				
	Иначе
					
		Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			
			Объект.Ответственный = Результат.Сотрудник;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 			
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			
			
			Если Не ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда  				
				Сообщить("Штрих код не найден! "+ Результат.ШК);
				Возврат;	
			КонецЕсли;			
			ОбработатьШКНоменклатуры(Результат);					
		Иначе
			//ОбработатьШтрихкодыТиповой(ДанныеШтрихкода);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьШКНоменклатуры(Результат);
	
ОбъектНоменклатуры			=Результат.ОбъектНоменклатуры;
//ОбъектНоменклатуры			=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьЭлемент();
Объект.Номенклатура			=ОбъектНоменклатуры.Номенклатура;
Объект.Нарезка				=ОбъектНоменклатуры.Нарезка;
Объект.КоличествоУпаковок	=ОбъектНоменклатуры.Количество; 

Если Объект.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
	Если Не ЗначениеЗаполнено(Объект.ВидРабот) Тогда
    	Объект.ВидРабот     =Справочники.ВидыРаботСотрудников.РаскройМатериала;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
    	Объект.РабочийЦентр     =Справочники.РабочиеЦентры.НайтиПоНаименованию("Перемотка",Истина);
	КонецЕсли;
КонецЕсли;
	
		
КонецПроцедуры //-Лико m.shenderov 14.01.2018

// Подсистема WebSocket
&НаКлиенте
Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);	
КонецПроцедуры  

&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;   
КонецПроцедуры 

// Подсистема WebSocket

&НаСервере
Процедура РедактированиеОрганизации() //+Лико m.shenderov 28.11.2022

	Если РольДоступна("ПолныеПрава") Или РольДоступна("Лико_ИзменениеОрганизацииВЗаказеНаРаскрой") Тогда
		
		Элементы.Организация.Вид=ВидПоляФормы.ПолеВвода;
		
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры  //-Лико m.shenderov 28.11.2022

&НаКлиенте
Процедура РаскройДлиннаРоликаПриИзменении(Элемент)
	ДлинаРолика=Элементы.Раскрой.ТекущиеДанные.ДлинаРолика;
КонецПроцедуры

&НаКлиенте
Процедура РаскройПриИзменении(Элемент)
	ТД=Элементы.Раскрой.ТекущиеДанные;
	Если ТД<>Неопределено И Не ЗначениеЗаполнено(ТД.ДлинаРолика) Тогда
		
		Элементы.Раскрой.ТекущиеДанные.ДлинаРолика=ДлинаРолика;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаказКлиентаПриИзмененииНаСервере() //+Лико m.shenderov 18.07.2022
   Структура=Документы.Лико_ЗаказНаРаскрой.ПолучитьДанныеЗаказуКлиента(Объект.ЗаказКлиента);
   
   Если ЗначениеЗаполнено(Структура) Тогда
	   ЗаполнитьЗначенияСвойств(Объект,Структура);
   КонецЕсли;
   

	
КонецПроцедуры  //-Лико m.shenderov 18.07.2022

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ЗаказКлиентаПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатистикуСервер() //+Лико m.shenderov 02.10.2023
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТопНарезокПоИспользованию.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		 Номенклатура= ?(ТипЗнч(Объект.Номенклатура)=Тип("СправочникСсылка.Номенклатура"),Объект.Номенклатура,Объект.Номенклатура.ОсновнаяНоменклатура);
		 
		 ТопНарезокПоИспользованию.Загрузить(
		 Документы.Лико_ЗаказНаРаскрой.ПолучитьСтатистикуПоНарезке(Объект.Организация,Номенклатура).Выгрузить());
		
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 02.10.2023


