
&Вместо("СоздатьЗаказНаполуфабрикат")
Функция Лико_СоздатьЗаказНаполуфабрикат(Организация, Площадка, ЗаказКлиента, Партнер, Регион, Номенклатура, Количество, НаправитьВРаботу=Ложь,СозданВПроизводстве=Ложь)
	УстановитьПривилегированныйРежим(Истина);
	Если СтрНайти(НРег(Номенклатура.Наименование),"контрматрица") Тогда		

		Этап   = Справочники.Лико_ЭтапыВыполненияЗаказа.ГотовКГравировке;
		Статус = Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ГотовКГравировке;

	Иначе 		

		Этап   = Справочники.Лико_ЭтапыВыполненияЗаказа.ВключенВПлан;
		Статус = Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан;

	КонецЕсли;


	Ссылка=Неопределено;
	НачатьТранзакцию();

	НовыйЗаказ              							=  Документы.ЗаказКлиента.СоздатьДокумент();
	НовыйЗаказ.ИнициализироватьНачальныеПараметры(Неопределено);

	НовыйЗаказ.ТипЗаказа    								= Перечисления.Лико_ТипыЗаказов.Полуфабрикат;
	НовыйЗаказ.Партнер      								= ?(ЗначениеЗаполнено(ЗаказКлиента),ЗаказКлиента.Партнер,Партнер);
	НовыйЗаказ.Контрагент   								= ЗаказКлиента.Контрагент;
	//НовыйЗаказ.СтатусЗаказаНаПроизводствоОснасткиОснастки	= Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан;
	НовыйЗаказ.СтатусЗаказаНаПроизводствоОснасткиОснастки	= Статус;
	// <-- Начало Лико Яцун С. В. 21.10.2025 
	НовыйЗаказ.Менеджер   									= ЗаказКлиента.Менеджер;
	// <-- Конец Лико Яцун С. В. 21.10.2025

	НовыйЗаказ.Организация  							 	= Организация;
	НовыйЗаказ.ВидЗаказа    							 	= Перечисления.Лико_ВидыЗаказов.Оснастка;
	НовыйЗаказ.Склад										= ПараметрыСеанса.Лико_РабочееМесто.СкладСИМ;
	НовыйЗаказ.Регион       								= Регион;
	НовыйЗаказ.Площадка     								= Площадка;
	НовыйЗаказ.Валюта       								= ЗаказКлиента.Валюта;
	
	НовыйЗаказ.Этикетки     								= ЗаказКлиента.Этикетки;
	РЦ														= ПолучитьРабочийЦентрГравировальныйУчасток(Площадка);
	НовыйЗаказ.ВалютаДляДокументов 							= ЗаказКлиента.ВалютаДляДокументов;
	НовыйЗаказ.Дата         								= ТекущаяДата(); 	
	ТЧТовары                								= НовыйЗаказ.Товары;
	НоваяСтрокаПФ           								= ТЧТовары.Добавить();
	НоваяСтрокаПФ.Номенклатура 								= Номенклатура;
	НоваяСтрокаПФ.КоличествоУпаковок 						= Количество;
	НоваяСтрокаПФ.Количество        						= Количество;
	НоваяСтрокаПФ.Заказ 									= ЗаказКлиента;
	НовыйВидРабот											= НовыйЗаказ.ВидыРабот.Добавить();
	НовыйВидРабот.РабочийЦентр								= РЦ;
	НовыйВидРабот.ВидРабот									= Справочники.ВидыРаботСотрудников.Гравировка;
	НовыйВидРабот.НомерПроката								= 1;
	НовыйЗаказ.Подразделение								= НовыйВидРабот.РабочийЦентр.ВидРабочегоЦентра.Подразделение;
	Если Не ЗначениеЗаполнено(НовыйЗаказ.Валюта) Тогда
	 НовыйЗаказ.Валюта										= Константы.ВалютаУправленческогоУчета.Получить();	
	 НовыйЗаказ.ВалютаДляДокументов 						= НовыйЗаказ.Валюта;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		НовыйЗаказ.Организация  							 	= Площадка;	
	КонецЕсли;
	
	НовыйЗаказ.Записать();

	Лико_ОбщегоНазначенияСервер.ЗаписатьРСЛико_ЭтапыЗаказа(
	НовыйЗаказ.Ссылка,
	Площадка,
	Этап,
	НовыйЗаказ.Дата,
	Новый Структура("Ответственный,Количество",Пользователи.ТекущийПользователь(),1)	
	);
	Ссылка=НовыйЗаказ.Ссылка;	
	//Если НаправитьВРаботу Тогда
	НаправитьВРаботу(Ссылка,Номенклатура);
	//КонецЕсли;

	ЗафиксироватьТранзакцию();											

	Возврат Ссылка;	

КонецФункции
