
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Лико_ЗаявкаНаТранспортировку", Неопределено, Объект.Ссылка);
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
	ЭтаФорма.Прочитать();
	ИзменитьНазваниеКнопкиНачалаОкончанияСборкиИНадписиОСборке();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РазрешеноМенятьЗакрытуюЗаявку", РазрешеноМенятьЗакрытуюЗаявку);
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ РазрешеноМенятьЗакрытуюЗаявку Тогда
		ТолькоПросмотр = Истина;
		Элементы.ЗаказыНаОтгрузкуПодобратьОстатки.Доступность = Ложь;
		//Элементы.ПродукцияРассчитатьСтоимость.Доступность = Ложь;
		Элементы.СтоимостьДоставкиЗаКг.Доступность = Ложь;
		Элементы.ФормаВвестиИнформациюОПеревозчике.Видимость = Истина;
		Элементы.ПродукцияОчиститьМеста.Доступность = Ложь;
		Элементы.ЗаполнитьМеста.Доступность = Ложь;
		Элементы.ЗаказыНаОтгрузкуДобавитьВУпаковку.Доступность = Ложь;
		Элементы.ЗаказыНаОтгрузкуУстановитьФлажки.Доступность = Ложь;
		Элементы.ЗаказыНаОтгрузкуСнятьФлажки.Доступность = Ложь;
	Иначе
		Элементы.ФормаВвестиИнформациюОПеревозчике.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.СозданНаОснованииПолученияГПИзПроизводства Тогда
		Сообщить("Документ создан на основании " + Метаданные.Документы.Лико_ПолучениеГПИзПроизводства.Представление() + ", корректировка возможна только под полными правами");
		Если НЕ ТолькоПросмотр Тогда
			ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СтраницаКорректировки.Видимость = РазрешеноМенятьЗакрытуюЗаявку;
	
	ЗаполнитьОбщийВесКоробок();
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	ЗначениеДопРеквизита = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку", Объект.СкладГП);
	Элементы.ПродукцияМест.ТолькоПросмотр = НЕ ?(ЗначениеДопРеквизита = Неопределено, Ложь, ЗначениеДопРеквизита);
	Элементы.ЗаполнитьМеста.Видимость = НЕ Элементы.ПродукцияМест.ТолькоПросмотр;
	Элементы.ПродукцияОчиститьМеста.Видимость = НЕ Элементы.ПродукцияМест.ТолькоПросмотр;
	Элементы.Статус.ТолькоПросмотр = Элементы.ПродукцияМест.ТолькоПросмотр;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ТипЗаявки) Тогда
			Параметры.Свойство("ТипЗаявки", Объект.ТипЗаявки);
			Если НЕ ЗначениеЗаполнено(Объект.ТипЗаявки) Тогда
				Объект.ТипЗаявки = Перечисления.Лико_ТипыЗаявокНаТранспортировку.Транспортная;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.СкладГП) Тогда
			Параметры.Свойство("СкладГП", Объект.СкладГП);
			Если НЕ ЗначениеЗаполнено(Объект.СкладГП) Тогда
				Объект.СкладГП = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяСГП", ПараметрыСеанса.ТекущийПользователь);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Площадка) Тогда	
			Объект.Площадка = Объект.СкладГП.Лико_Площадка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда	
			Объект.Организация = Объект.Площадка.Организация;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.СоздалЗаявку) Тогда
			Объект.СоздалЗаявку = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ОтпускРазрешил) Тогда
			Объект.ОтпускРазрешил = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаОтпускРазрешил", Объект.СкладГП);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.СрокДоставки) Тогда
			Объект.СрокДоставки = ТекущаяДата();
		КонецЕсли;
		//ЗаполнитьАдресГрузоотправителя();
	КонецЕсли;
	
	ДобавитьУсловноеОформление();
	ИзменитьНазваниеКнопкиНачалаОкончанияСборкиИНадписиОСборке();
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.ЗаказыНаОтгрузкуЗаявкаНаОтгрузку.ТолькоПросмотр = Ложь;
		Элементы.ЗаказыНаОтгрузкуКонтрагент.ТолькоПросмотр = Ложь;
		Элементы.ЗаказыНаОтгрузкуНамотка.ТолькоПросмотр = Ложь;
		Элементы.ЗаказыНаОтгрузкуГород.ТолькоПросмотр = Ложь;
		Элементы.ЗаказыНаОтгрузкуКодЭтикеткиЗаказчика.ТолькоПросмотр = Ложь;
		Элементы.ЗаказыНаОтгрузкуЧестныйЗнак.ТолькоПросмотр = Ложь;
		Элементы.ЗаказыНаОтгрузкуНомерПоставки.ТолькоПросмотр = Ложь;
		Элементы.Статус.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ТипЗаявки) И (ВРег(Лев(ОбщегоНазначения.ИмяЗначенияПеречисления(Объект.ТипЗаявки), 7)) = "УДАЛИТЬ") Тогда
		Элементы.ТипЗаявки.СписокВыбора.Добавить(Объект.ТипЗаявки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление()
	
	ИмяТаблицы = "ЗаказыНаОтгрузку";
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "НомерСтроки");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".КоличествоПодобранное");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".Количество"); 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "НомерСтроки");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".КоличествоПодобранное");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".Количество"); 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "НомерСтроки");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицы + ".КоличествоПодобранное");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 0; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоКоралловый);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОстатки(Команда, СтрокаКлючевыхПараметров = ",Намотка,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки,Город")
	
	Если НЕ ПроверитьПередПодбором() Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЛеваяЧастьИмениКоманды = "ПодобратьОстаткиПо";
	ТипПодбора = Прав(Команда.Имя, СтрДлина(Команда.Имя) - СтрДлина(ЛеваяЧастьИмениКоманды));
	МассивИдентификаторовСтрок = Новый Массив;
	ВсеСтроки = Ложь;
	ЕстьПодобранныеКоробкиПоВыбраннымСтрокам = Ложь;
	МассивСтрокПродукцииДляОчистки = Новый Массив;
	СтруктураПодбора = Неопределено;
	Если ТипПодбора = "Всем" ИЛИ ТипПодбора = "ВсемБезУчетаКлючевыхПараметров" Тогда
		// Все строки
		Для каждого НайденнаяСтрока из Объект.ЗаказыНаОтгрузку Цикл
			МассивИдентификаторовСтрок.Добавить(НайденнаяСтрока.ПолучитьИдентификатор());
		КонецЦикла;			
		// Найдем строки Продукции
		Для каждого СтрокаПродукции из Объект.Продукция Цикл
			МассивСтрокПродукцииДляОчистки.Добавить(СтрокаПродукции);
			Если СтрокаПродукции.Мест > 0 Тогда
				ЕстьПодобранныеКоробкиПоВыбраннымСтрокам = Истина;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипПодбора = "Заказу" Тогда
		// Строки с таким же заказом, как в выделенной строке
		Отбор = Новый Структура("ЗаказКлиента", Элементы.ЗаказыНаОтгрузку.ТекущиеДанные.ЗаказКлиента);
		НайденныеСтроки = Объект.ЗаказыНаОтгрузку.НайтиСтроки(Отбор);
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			МассивИдентификаторовСтрок.Добавить(НайденнаяСтрока.ПолучитьИдентификатор());
		КонецЦикла;			
		// Найдем строки Продукции
		СтрокиПродукции = Объект.Продукция.НайтиСтроки(Отбор);
		Для каждого СтрокаПродукции из СтрокиПродукции Цикл
			МассивСтрокПродукцииДляОчистки.Добавить(СтрокаПродукции);
			Если СтрокаПродукции.Мест > 0 Тогда
				ЕстьПодобранныеКоробкиПоВыбраннымСтрокам = Истина;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипПодбора = "Строке" ИЛИ ТипПодбора = "СтрокеБезУчетаКлючевыхПараметров" ИЛИ ТипПодбора = "СтрокеВручную" Тогда
		// Только выделенная строка
		МассивИдентификаторовСтрок.Добавить(Элементы.ЗаказыНаОтгрузку.ТекущаяСтрока);
		// Найдем строки Продукции
		Отбор = Новый Структура("ЗаказКлиента,Номенклатура,Характеристика,Контрагент,Намотка,ЗаявкаНаОтгрузку,НомерПоставки,КодЭтикеткиЗаказчика,ЧестныйЗнак,Город");
		ЗаполнитьЗначенияСвойств(Отбор, Элементы.ЗаказыНаОтгрузку.ТекущиеДанные);
		СтруктураПодбора = Новый Структура("Характеристика,Намотка,НомерПоставки,КодЭтикеткиЗаказчика,ЧестныйЗнак,Город,Количество");
		ЗаполнитьЗначенияСвойств(СтруктураПодбора, Элементы.ЗаказыНаОтгрузку.ТекущиеДанные);
		СтрокиПродукции = Объект.Продукция.НайтиСтроки(Отбор);
		Для каждого СтрокаПродукции из СтрокиПродукции Цикл
			МассивСтрокПродукцииДляОчистки.Добавить(СтрокаПродукции);
			Если СтрокаПродукции.Мест > 0 Тогда
				ЕстьПодобранныеКоробкиПоВыбраннымСтрокам = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если МассивИдентификаторовСтрок.Количество() = 0 Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Выберите строки для подбора остатков");
		Возврат;	
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивИдентификаторовСтрок", МассивИдентификаторовСтрок);
	ДополнительныеПараметры.Вставить("МассивСтрокПродукцииДляОчистки", МассивСтрокПродукцииДляОчистки);
	ДополнительныеПараметры.Вставить("СтрокаКлючевыхПараметров", СтрокаКлючевыхПараметров);
	ДополнительныеПараметры.Вставить("ТипПодбора", ТипПодбора);
	ДополнительныеПараметры.Вставить("СтруктураПодбора", СтруктураПодбора);
	Если ЕстьПодобранныеКоробкиПоВыбраннымСтрокам Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОПодобранныхКоробках", ЭтотОбъект, ДополнительныеПараметры), "В табличной части Продукция уже есть подобранные коробки. Очистить?", РежимДиалогаВопрос.ДаНетОтмена);	
	Иначе
		ЗавершитьПодборКоробок(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПередПодбором()
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.СкладГП) Тогда
		Сообщить("Выберите склад ГП");
		Отказ = Истина;
	КонецЕсли;
	//Если (Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения) И НЕ ЗначениеЗаполнено(Объект.СкладРегиона) Тогда
	//	Сообщить("Выберите склад хранения");
	//	Отказ = Истина;
	//КонецЕсли;
	//СкладПодбора = ?(Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения, Объект.СкладРегиона, Объект.СкладГП);
	ЯчейкаУпаковка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаЯчейкаУпаковка", Объект.СкладГП);
	ЯчейкаРастарка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.СкладГП, "ЯчейкаРастарка");
	Если НЕ ЗначениеЗаполнено(ЯчейкаУпаковка)
		И Объект.СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Производство
		//И Объект.ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		//И Объект.ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		Тогда
		Сообщить("Для выбранного склада подбора не определена ячейка-упаковка");
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЯчейкаРастарка)
		//И Объект.СкладГП.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Производство
		//И Объект.ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		//И Объект.ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		Тогда
		Сообщить("Для выбранного склада подбора не определена ячейка-растарка");
		Отказ = Истина;
	КонецЕсли;
	Если Объект.Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
		Сообщить("Подбор коробок в статусе ""Закрыт"" невозможен. Для подбора измените статус и сохраните заявку.");
		Отказ = Истина;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиенте
Процедура ОтветНаВопросОПодобранныхКоробках(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗавершитьПодборКоробок(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодборКоробок(ДополнительныеПараметры) Экспорт
	
	УдалитьСтрокиИзПродукции(ДополнительныеПараметры.МассивСтрокПродукцииДляОчистки);
	Результат = ПодобратьОстаткиНаСервере(ДополнительныеПараметры.МассивИдентификаторовСтрок, ДополнительныеПараметры.СтрокаКлючевыхПараметров, ДополнительныеПараметры.ТипПодбора);
	Если ДополнительныеПараметры.ТипПодбора = "СтрокеВручную" Тогда
		Если ЗначениеЗаполнено(Результат) Тогда
			// Откроем форму ручного подбора
			ДопПараметрыДляНовойФормы = Новый Структура;
			ДопПараметрыДляНовойФормы.Вставить("ТаблицаКоробок", Результат);
			ДопПараметрыДляНовойФормы.Вставить("СтруктураПодбора", ДополнительныеПараметры.СтруктураПодбора);
			ДопПараметрыДляНовойФормы.Вставить("ТипОтгрузки", Объект.ТипОтгрузки);
			
			ОткрытьФорму("Документ.Лико_ЗаявкаНаТранспортировку.Форма.ФормаПодбораКоробокВручную", ДопПараметрыДляНовойФормы,,,,, Новый ОписаниеОповещения("ЗавершенПодборВручную", ЭтотОбъект, ДополнительныеПараметры), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			Сообщить("Нет остатков по выбранной строке");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ЗаполнитьОбщийВесКоробок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершенПодборВручную(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ДопПараметры.Вставить("СтрокиОстатков", Результат); 
		Если ДопПараметры.Свойство("МассивСтрокПродукцииДляОчистки") Тогда
			ДопПараметры.Удалить("МассивСтрокПродукцииДляОчистки");
		КонецЕсли;
		ДобавитьПодобранныеВручнуюКоробкиНаСервере(ДопПараметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьПодобранныеВручнуюКоробкиНаСервере(ДопПараметры)
	
	ТаблицаСтрок = Объект.ЗаказыНаОтгрузку.Выгрузить();
	// Заполним таблицу по массиву идентификаторов
	ТаблицаСтрок.Очистить();
	Для каждого ИдентификаторСтроки из ДопПараметры.МассивИдентификаторовСтрок Цикл
		Строка = Объект.ЗаказыНаОтгрузку.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Строка = Неопределено Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не найдена строка по идентификатору.");
			Продолжить;
		Иначе
			Строка.КоличествоПодобранное = 0;
			НоваяСтрока = ТаблицаСтрок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	ТаблицаСтрок.Сортировать("НомерСтроки");
	
	Для каждого Строка из ТаблицаСтрок Цикл
		Подобрано = 0;
		Для каждого СтрокаСерии из ДопПараметры.СтрокиОстатков Цикл
			НоваяСтрока = Объект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Затреб = 1;
			НоваяСтрока.Количество = СтрокаСерии.Количество;
			НоваяСтрока.Серия = СтрокаСерии.Серия;
			НоваяСтрока.АдресХранения = СтрокаСерии.Ячейка;
			НоваяСтрока.Паллет = СтрокаСерии.Паллет;
			Подобрано = Подобрано + НоваяСтрока.Количество;
		КонецЦикла;
		СтрокаЗаказовНаОтгрузку = Объект.ЗаказыНаОтгрузку[Строка.НомерСтроки-1];
		СтрокаЗаказовНаОтгрузку.КоличествоПодобранное = Подобрано; 
		Если Подобрано < Строка.Количество  Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("" + Строка.Номенклатура + " / " + Строка.Характеристика + " (строка №" + Строка.НомерСтроки + "): не хватает количества (требуется " + Строка.Количество + ", подобрано " + Подобрано + ").");
		КонецЕсли;
	КонецЦикла;
		
КонецФункции

&НаСервере
Функция ПодобратьОстаткиНаСервере(МассивИдентификаторовСтрок, СтрокаКлючевыхПараметров, ТипПодбора)

	ТаблицаСтрок = Объект.ЗаказыНаОтгрузку.Выгрузить();
	// Заполним таблицу по массиву идентификаторов
	ТаблицаСтрок.Очистить();
	ТаблицаСтрок.Колонки.Добавить("КонтрагентВладелецТовара", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Для каждого ИдентификаторСтроки из МассивИдентификаторовСтрок Цикл
		Строка = Объект.ЗаказыНаОтгрузку.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Строка = Неопределено Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не найдена строка по идентификатору.");
			Продолжить;
		Иначе
			Строка.КоличествоПодобранное = 0;
			НоваяСтрока = ТаблицаСтрок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	ТаблицаСтрок.Сортировать("НомерСтроки");

	ОтборПоКонтрагенту = Ложь;
	Если Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		Тогда
		ОтборПоКонтрагенту = Истина;
		Для каждого Строка из ТаблицаСтрок Цикл
			СтруктураДляОтбора = Новый Структура("Характеристика,Втулка,Намотка,Город,КодЭтикеткиЗаказчика,НомерПоставки,ЧестныйЗнак");
			ЗаполнитьЗначенияСвойств(СтруктураДляОтбора, Строка);
			НайденныеСтроки = Строка.ЗаявкаНаОтгрузку.Товары.НайтиСтроки(СтруктураДляОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Сообщить("По строке №" + Строка.НомерСтроки + " не найдена связанная строка в заявке на отгрузку. Обратитесь к программистам");
				Возврат Неопределено;
			КонецЕсли;
			Строка.КонтрагентВладелецТовара = НайденныеСтроки[0].Контрагент;
		КонецЦикла;
	КонецЕсли;

	МассивПодобранныхКоробок = Новый Массив;
	Для каждого Строка из Объект.Продукция Цикл
		МассивПодобранныхКоробок.Добавить(Строка.Серия);	
	КонецЦикла;
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Для каждого Строка из Объект.Ссылка.Продукция Цикл
	//		МассивПодобранныхКоробок.Добавить(Строка.Серия);	
	//	КонецЦикла;
	//КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.ЗаказКлиента КАК ЗаказКлиента,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Таблица.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_Таблица.Номенклатура КАК Номенклатура,
	|	ВТ_Таблица.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТаблицаСгруппирована
	|ИЗ
	|	ВТ_Таблица КАК ВТ_Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Таблица.ЗаказКлиента,
	|	ВТ_Таблица.Номенклатура,
	|	ВТ_Таблица.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток - ТоварыВЯчейкахОстатки.КОтборуОстаток КАК ВНаличииОстаток,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ ВТ_РегистрССериями
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			(Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						Т.Характеристика
	|					ИЗ
	|						ВТ_Таблица КАК Т)
	|				И Ячейка.Владелец = &СкладГП
	|				И НЕ Ячейка = &ЯчейкаУпаковка
	|				И НЕ Ячейка = &ЯчейкаРастарка) КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток - ТоварыВЯчейкахОстатки.КОтборуОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РегистрССериями.Номенклатура КАК Номенклатура,
	|	ВТ_РегистрССериями.Характеристика КАК Характеристика,
	|	ВТ_РегистрССериями.Серия КАК Серия,
	|	ВТ_РегистрССериями.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВТ_РегистрССериями.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ ВТ_ОстаткиИПодобранныеКоробкиИзСсылки
	|ИЗ
	|	ВТ_РегистрССериями КАК ВТ_РегистрССериями
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Номенклатура,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Характеристика,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Серия,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Количество,
	|	Лико_ЗаявкаНаТранспортировкуПродукция.АдресХранения
	|ИЗ
	|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЗаявкаНаТранспортировку = НЕОПРЕДЕЛЕНО
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка = &ЗаявкаНаТранспортировку
	|		КОНЕЦ
	|	И НЕ Лико_ЗаявкаНаТранспортировкуПродукция.Серия В
	|				(ВЫБРАТЬ
	|					ВТ_РегистрССериями.Серия
	|				ИЗ
	|					ВТ_РегистрССериями)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаСгруппирована.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ТаблицаСгруппирована.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаСгруппирована.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.Серия, НЕОПРЕДЕЛЕНО) КАК Серия,
	|	ЕСТЬNULL(ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
	|	ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.Серия.Лико_КоличествоВУпаковке, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.Серия.Лико_КоличествоВУпаковке, 0)
	|	КОНЕЦ КАК КоличествоВУпаковке
	|ПОМЕСТИТЬ ВТ_ТаблицаССериямиИОстатками
	|ИЗ
	|	ВТ_ТаблицаСгруппирована КАК ВТ_ТаблицаСгруппирована
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиИПодобранныеКоробкиИзСсылки КАК ВТ_ОстаткиИПодобранныеКоробкиИзСсылки
	|		ПО ВТ_ТаблицаСгруппирована.Номенклатура = ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.Номенклатура
	|			И ВТ_ТаблицаСгруппирована.Характеристика = ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.Характеристика
	|			И ВТ_ТаблицаСгруппирована.ЗаказКлиента = ВТ_ОстаткиИПодобранныеКоробкиИзСсылки.Характеристика.Лико_ЗаказНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Серия КАК Серия
	|ПОМЕСТИТЬ ВТ_СерииНезакрытыхЗаявок
	|ИЗ
	|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
	|ГДЕ
	|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаявокНаТранспортировку.Создан)
	|	И Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Проведен
	|	И (Лико_ЗаявкаНаТранспортировкуПродукция.Затреб <> 0
	|			ИЛИ Лико_ЗаявкаНаТранспортировкуПродукция.Мест <> 0)
	|	И НЕ Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ЗаявкаНаТранспортировку = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка <> &ЗаявкаНаТранспортировку
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаССериямиИОстатками.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ТаблицаССериямиИОстатками.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаССериямиИОстатками.Характеристика КАК Характеристика,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_НаправлениеНамотки КАК Намотка,
	|	ВТ_ТаблицаССериямиИОстатками.Серия КАК Серия,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_Город КАК Город,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_НомерПоставки КАК НомерПоставки,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_КонтрагентВладелецТовара КАК КонтрагентВладелецТовара,
	|	ВТ_ТаблицаССериямиИОстатками.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВТ_ТаблицаССериямиИОстатками.КоличествоВУпаковке КАК КоличествоВУпаковке,
	|	ВТ_ТаблицаССериямиИОстатками.ВНаличииОстаток / ВТ_ТаблицаССериямиИОстатками.КоличествоВУпаковке КАК ВНаличииОстатокКоробок,
	|	МАКСИМУМ(ЕСТЬNULL(Лико_АдресноеХранениеСрезПоследних.Паллет, НЕОПРЕДЕЛЕНО)) КАК Паллет,
	|	ВТ_ТаблицаССериямиИОстатками.Ячейка КАК Ячейка,
	|	ЛОЖЬ КАК Списано,
	|	0 КАК КолонкаДляСортировки
	|ИЗ
	|	ВТ_ТаблицаССериямиИОстатками КАК ВТ_ТаблицаССериямиИОстатками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|				,
	|				Активность
	|					И Серия В
	|						(ВЫБРАТЬ
	|							Т.Серия
	|						ИЗ
	|							ВТ_ТаблицаССериямиИОстатками КАК Т)
	|					И ВЫБОР
	|						КОГДА &ЗаявкаНаТранспортировку = НЕОПРЕДЕЛЕНО
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Регистратор <> &ЗаявкаНаТранспортировку
	|					КОНЕЦ) КАК Лико_АдресноеХранениеСрезПоследних
	|		ПО ВТ_ТаблицаССериямиИОстатками.Серия = Лико_АдресноеХранениеСрезПоследних.Серия
	|ГДЕ
	|	ВТ_ТаблицаССериямиИОстатками.ВНаличииОстаток > 0
	|	И НЕ ВТ_ТаблицаССериямиИОстатками.Серия В
	|				(ВЫБРАТЬ
	|					Т.Серия
	|				ИЗ
	|					ВТ_СерииНезакрытыхЗаявок КАК Т)
	|	И НЕ ВТ_ТаблицаССериямиИОстатками.Серия В (&МассивПодобранныхКоробок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаССериямиИОстатками.ЗаказКлиента,
	|	ВТ_ТаблицаССериямиИОстатками.Номенклатура,
	|	ВТ_ТаблицаССериямиИОстатками.Характеристика,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_НаправлениеНамотки,
	|	ВТ_ТаблицаССериямиИОстатками.Серия,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_Город,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_КодЭтикеткиЗаказчика,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_ЧестныйЗнак,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_НомерПоставки,
	|	ВТ_ТаблицаССериямиИОстатками.Серия.Лико_КонтрагентВладелецТовара,
	|	ВТ_ТаблицаССериямиИОстатками.ВНаличииОстаток,
	|	ВТ_ТаблицаССериямиИОстатками.КоличествоВУпаковке,
	|	ВТ_ТаблицаССериямиИОстатками.ВНаличииОстаток / ВТ_ТаблицаССериямиИОстатками.КоличествоВУпаковке,
	|	ВТ_ТаблицаССериямиИОстатками.Ячейка";

	Запрос.УстановитьПараметр("Таблица", ТаблицаСтрок);
	Запрос.УстановитьПараметр("ЗаявкаНаТранспортировку", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
	//СкладПодбора = ?(Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения ИЛИ Объект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения, Объект.СкладРегиона, Объект.СкладГП);
	СкладПодбора = Объект.СкладГП;
	Запрос.УстановитьПараметр("СкладГП", СкладПодбора);
	Если Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладПодбора, "ПодбиратьОстаткиИзЯчейкиУпаковки_ea01b5f3f4a1470cbcb8a690e7aaf194", Ложь) Тогда
		Запрос.УстановитьПараметр("ЯчейкаУпаковка", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("ЯчейкаУпаковка", Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаЯчейкаУпаковка", СкладПодбора));
	КонецЕсли;
	Запрос.УстановитьПараметр("ЯчейкаРастарка", Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладПодбора, "ЯчейкаРастарка"));
	Запрос.УстановитьПараметр("ЯчейкаОтгрузка", Лико_Дополнительно.ПолучитьЗонуОтгрузкиПоСкладу(СкладПодбора));
	Запрос.УстановитьПараметр("МассивПодобранныхКоробок", МассивПодобранныхКоробок);

	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();

	Если ТипПодбора = "СтрокеВручную" Тогда
		Возврат Лико_Дополнительно.ТаблицаВМассивСтруктур(ТаблицаОстатков);
	КонецЕсли;

	Отбор = Новый Структура("ЗаказКлиента,Номенклатура,Характеристика,Списано" + СтрокаКлючевыхПараметров + ?(ОтборПоКонтрагенту, ",КонтрагентВладелецТовара", ""));
	Отбор.Списано = Ложь;
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());

	Для каждого Строка из ТаблицаСтрок Цикл
		//СтрокаТЧ = Объект.ЗаказыНаОтгрузку[Строка.НомерСтроки];
		ОсталосьПодобрать = Строка.Количество;
		Если Строка.ОтгрузитьВсе Тогда
			// Будем искать все коробки, которые есть на складе. Для этого запишем в переменную ОсталосьПодобрать максимально возможное число
			ОсталосьПодобрать = 999999999999;
		КонецЕсли;
		Подобрано = 0;
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		СтрокиОстатков = ТаблицаОстатков.Скопировать(Отбор);
		СтрокиОстатков.Сортировать("Паллет,ВНаличииОстаток УБЫВ");
		МассивПодобранныхСтрок = Новый Массив;
		Для каждого СтрокаСерии из СтрокиОстатков Цикл
			Если ОсталосьПодобрать <= 0 Тогда
				Прервать;
			КонецЕсли;
			//Если СтрокаСерии.ВНаличииОстаток > ОсталосьПодобрать Тогда
			//	//Пойдем искать с конца таблицы (т.к. таблица отсортирована по ВНаличииОстаток) самую подходящую коробку
			//	сч = СтрокиОстатков.Количество()-1;
			//	Пока сч >= СтрокиОстатков.Индекс(СтрокаСерии) Цикл
			//		СтрокаСКонца = СтрокиОстатков[сч];
			//		Если СтрокаСКонца.ВНаличииОстаток < ОсталосьПодобрать Тогда
			//			сч = сч-1;
			//			Продолжить;
			//		Иначе
			//			// Берем эту строку (количество в ней или равно требуемуемому, или максимально близкое к нему)
			//			СтрокаСерии = СтрокаСКонца;
			//			Прервать;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			МассивПодобранныхСтрок.Добавить(СтрокаСерии);
			ОсталосьПодобрать = ОсталосьПодобрать - СтрокаСерии.ВНаличииОстаток;
			Подобрано = Подобрано + СтрокаСерии.ВНаличииОстаток;
		КонецЦикла;

		Если ОсталосьПодобрать < 0 Тогда
			// Попробуем еще, перемешивая таблицу строк
			МинимальныйОстаток = ОсталосьПодобрать; // Запомним, сколько оставалось подобрать после обычного алгоритма
			ЛучшийМассивПодобранных = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивПодобранныхСтрок); // Запомним текущий массив как лучший
			НайденБолееЛучшийВариант = Ложь;
			сч = 0;
			КоличествоИтераций = 300;
			Пока ОсталосьПодобрать < 0 И сч < КоличествоИтераций Цикл
				ОсталосьПодобрать = Строка.Количество;
				Подобрано = 0;
				МассивПодобранныхСтрок = ВыполнитьЦиклПодбора(ОсталосьПодобрать, Подобрано, СтрокиОстатков, Отбор, ГСЧ);
				Если ОсталосьПодобрать > МинимальныйОстаток Тогда
					МинимальныйОстаток = ОсталосьПодобрать;
					ЛучшийМассивПодобранных = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивПодобранныхСтрок); // Запомним текущий массив как лучший
					НайденБолееЛучшийВариант = Истина;	
				КонецЕсли;
				сч = сч + 1;
			КонецЦикла; 
			//СОобщить("" + сч);
			ОсталосьПодобрать = МинимальныйОстаток;
			Подобрано = Строка.Количество - ОсталосьПодобрать;
			МассивПодобранныхСтрок = ЛучшийМассивПодобранных;
			Если НайденБолееЛучшийВариант Тогда
				// Коробки перемешаны. Нужно попытаться по максимум собрать целые паллеты
				ТаблицаПодобранныхСтрок = СтрокиОстатков.СкопироватьКолонки();
				Для каждого СтрокаПодобранныхСтрок из МассивПодобранныхСтрок Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаПодобранныхСтрок.Добавить(), СтрокаПодобранныхСтрок);
				КонецЦИкла;
				МассивПаллет = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаПодобранныхСтрок.ВыгрузитьКолонку("Паллет"));
				Для каждого ТекПаллет из МассивПаллет Цикл
					ТекОтборПаллет = Новый Структура("Паллет", ТекПаллет);
					ТаблицаВсехОстатковПоПаллету = СтрокиОстатков.Скопировать(ТекОтборПаллет);
					ТаблицаПодобранныхСтрокПоПаллету = ТаблицаПодобранныхСтрок.Скопировать(ТекОтборПаллет);
					КоличествоВсехОстатковПоПаллету = ТаблицаВсехОстатковПоПаллету.Количество();
					КоличествоПодобранныхСтрокПоПаллету = ТаблицаПодобранныхСтрокПоПаллету.Количество();
					НужноПодобратьВЭтотПаллет = КоличествоВсехОстатковПоПаллету - КоличествоПодобранныхСтрокПоПаллету;
					Если КоличествоПодобранныхСтрокПоПаллету <> 0 И НужноПодобратьВЭтотПаллет > 0 Тогда
						// Попытаемся заполнить этот паллет, меняя другие подобранные коробки
						Для каждого СтрокаВсехОстатковПоПаллету из ТаблицаВсехОстатковПоПаллету Цикл
							Если НужноПодобратьВЭтотПаллет = 0 Тогда
								Прервать;
							КонецЕсли;
							Если ТаблицаПодобранныхСтрокПоПаллету.Найти(СтрокаВсехОстатковПоПаллету.Серия, "Серия") = Неопределено Тогда
								// Эта коробка еще не подобрана, поищем коробку с таким количеством из подобранных коробок на ДРУГИХ паллетах
								Для каждого СтрокаПодобранныхСтрок из ТаблицаПодобранныхСтрок Цикл
									Если СтрокаПодобранныхСтрок.Паллет <> СтрокаВсехОстатковПоПаллету.Паллет
										И СтрокаПодобранныхСтрок.КоличествоВУпаковке = СтрокаВсехОстатковПоПаллету.КоличествоВУпаковке Тогда
										// Строка подходит. Проверим, что она лежит на неполном паллете
										ТекОтборПаллетЗамена = Новый Структура("Паллет", СтрокаПодобранныхСтрок.Паллет);
										Если СтрокиОстатков.НайтиСтроки(ТекОтборПаллетЗамена).Количество() <> ТаблицаПодобранныхСтрок.НайтиСтроки(ТекОтборПаллетЗамена).Количество() Тогда
											// Паллет не полный, меняем
											СтрокиДляУдаления = ТаблицаПодобранныхСтрок.НайтиСтроки(Новый Структура("Серия", СтрокаПодобранныхСтрок.Серия));
											Для каждого СтрокаДляУдаления из СтрокиДляУдаления Цикл
												ТаблицаПодобранныхСтрок.Удалить(СтрокаДляУдаления);
											КОнецЦикла;
											ЗаполнитьЗначенияСвойств(ТаблицаПодобранныхСтрок.Добавить(), СтрокаВсехОстатковПоПаллету);
											НужноПодобратьВЭтотПаллет = НужноПодобратьВЭтотПаллет - 1;
											Прервать; // Одну коробку поменяли, выходим из этого цикла на верхний уровень
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				МассивПодобранныхСтрок = ТаблицаПодобранныхСтрок;
			КонецЕсли;
		КонецЕсли;

		Для каждого СтрокаСерии из МассивПодобранныхСтрок Цикл
			НоваяСтрока = Объект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Затреб = 1;
			НоваяСтрока.Количество = СтрокаСерии.ВНаличииОстаток;
			НоваяСтрока.Серия = СтрокаСерии.Серия;
			НоваяСтрока.АдресХранения = СтрокаСерии.Ячейка;
			НоваяСтрока.Паллет = СтрокаСерии.Паллет;
			СтрокаСерии.Списано = Истина;

			СтрокаТаблицыОстатков = ТаблицаОстатков.Найти(СтрокаСерии.Серия, "Серия");
			Если СтрокаТаблицыОстатков <> Неопределено Тогда
				СтрокаТаблицыОстатков.Списано = Истина;
			КонецЕсли;
		КонецЦикла;
		СтрокаЗаказовНаОтгрузку = Объект.ЗаказыНаОтгрузку[Строка.НомерСтроки-1];
		СтрокаЗаказовНаОтгрузку.КоличествоПодобранное = Подобрано; 
		Если Подобрано < Строка.Количество  Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("" + Строка.Номенклатура + " / " + Строка.Характеристика + " (строка №" + Строка.НомерСтроки + "): не хватает количества (требуется " + Строка.Количество + ", подобрано " + Подобрано + ").");
		КонецЕсли;
	КонецЦикла;

КонецФункции

&НаСервере
Функция ВыполнитьЦиклПодбора(ОсталосьПодобрать, Подобрано, СтрокиОстатков, Отбор, ГСЧ)
	
	// Каждый раз будем сортировать таблицу СтрокиОстатков рандомно
	КоличествоСтрок = СтрокиОстатков.Количество();
	Для каждого Строка из СтрокиОстатков Цикл
		Строка.КолонкаДляСортировки = ГСЧ.СлучайноеЧисло();
	КонецЦикла;
	СтрокиОстатков.Сортировать("КолонкаДляСортировки");
	
	МассивПодобранныхСтрок = Новый Массив;
	Для каждого СтрокаСерии из СтрокиОстатков Цикл
		Если ОсталосьПодобрать <= 0 Тогда
			Прервать;
		КонецЕсли;
		МассивПодобранныхСтрок.Добавить(СтрокаСерии);
		ОсталосьПодобрать = ОсталосьПодобрать - СтрокаСерии.ВНаличииОстаток;
		Подобрано = Подобрано + СтрокаСерии.ВНаличииОстаток;
	КонецЦикла;
	
	Возврат МассивПодобранныхСтрок;
	
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокиИзПродукции(МассивСтрок)
	
	Для каждого Строка из МассивСтрок Цикл
		Объект.Продукция.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	
	ИдТекущейСтроки = Элементы.Продукция.ТекущаяСтрока; 
	ПродукцияПриИзмененииНаСервере(ИдТекущейСтроки);

КонецПроцедуры

&НаСервере
Процедура ПродукцияПриИзмененииНаСервере(ИдТекущейСтроки)
	
	ПересчитатьПодобранноеКоличествоНаСервере();
	ЗаполнитьОбщийВесКоробок();
	
	Если ИдТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Объект.Продукция.НайтиПоИдентификатору(ИдТекущейСтроки);
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.Количество = ТекущаяСтрока.Серия.Лико_КоличествоВУпаковке;
		ТекущаяСтрока.Характеристика = ТекущаяСтрока.Серия.Лико_ХарактеристикаВладелец;
		ТекущаяСтрока.Номенклатура = ТекущаяСтрока.Характеристика.Владелец;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПодобранноеКоличествоНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ПересчитатьПодобранноеКоличество();
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбщийВесКоробок()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ОбщийВесКоробок = РеквизитОбъект.РассчитатьОбщийВесКоробок();
	СтоимостьДоставкиЗаКг = ?(ОбщийВесКоробок = 0, 0, Объект.ОбщаяСтоимостьДоставки / ОбщийВесКоробок);
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДоставкиЗаКгПриИзменении(Элемент)
	
	Объект.ОбщаяСтоимостьДоставки = СтоимостьДоставкиЗаКг * ОбщийВесКоробок;
	РассчитатьСтоимость(Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимость(Команда)
	
	РассчитатьСтоимостьНаСервре();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьНаСервре()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.РассчитатьСтоимостьДоставки();
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	СтоимостьДоставкиЗаКг = ?(ОбщийВесКоробок = 0, 0, Объект.ОбщаяСтоимостьДоставки / ОбщийВесКоробок);
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладГППриИзменении(Элемент)
	
	ЗначениеДопРеквизита = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаИспользоватьОстаткиТранспортногоМодуляДляПодбораМестВЗаявку", Объект.СкладГП);
	Элементы.ПродукцияМест.ТолькоПросмотр = НЕ ?(ЗначениеДопРеквизита = Неопределено, Ложь, ЗначениеДопРеквизита);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент);
	АдресПредставление = "";
	АдресЗначениеПолей = "";
	Если ИмяРеквизитаИВладельцаАдресаДоставки.ПолныйПутьКСтрокеТЧ Тогда
		Выполнить("АдресПредставление = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита);
		Выполнить("АдресЗначениеПолей = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей");
		ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
		    Элемент,
			АдресПредставление,
			АдресЗначениеПолей);
		Выполнить(ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + " = АдресПредставление");
		Выполнить(ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей = АдресЗначениеПолей");
	Иначе
		ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
		    Элемент,
			Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита],
			Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей"]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	АдресДоставкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент);
	
	Владелец = Неопределено;
	Если ИмяРеквизитаИВладельцаАдресаДоставки.ПолныйПутьКСтрокеТЧ Тогда
		Выполнить("Владелец = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяВладельца);
	Иначе
		Владелец = Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяВладельца];
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", Владелец);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьАдресЗавершение", ЭтотОбъект, ИмяРеквизитаИВладельцаАдресаДоставки);
	ОткрытьФорму("ОбщаяФорма.Лико_ФормаВыбораАдреса", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОписаниеОповещения);

	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Если ДополнительныеПараметры.ПолныйПутьКСтрокеТЧ Тогда
			Выполнить(ДополнительныеПараметры.ИмяРеквизита + " = Результат.Представление");
			Выполнить(ДополнительныеПараметры.ИмяРеквизита + "ЗначенияПолей = Результат.ЗначенияПолей");
		Иначе
			Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат.Представление;
			Объект[ДополнительныеПараметры.ИмяРеквизита + "ЗначенияПолей"] = Результат.ЗначенияПолей;
			Если ДополнительныеПараметры.ИмяРеквизита = "АдресДоставки" Тогда
				Объект.ДополнениеКАдресуДоставки = Результат.Комментарий;
			КонецЕсли;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент)
	
	Результат = Новый Структура("ПолныйПутьКСтрокеТЧ,ИмяРеквизита,ИмяВладельца", Ложь, "", "");
	Если СтрНайти(Элемент.Имя, "АдресГрузоотправителя") > 0 Тогда
		Результат.ИмяРеквизита = "АдресГрузоотправителя";
		Результат.ИмяВладельца = ПолучитьИмяГрузоотправителя();
	ИначеЕсли Элемент.Имя = "ЗаказыНаОтгрузкуАдресДоставки" Тогда
		// Получим полный путь к строке ТЧ
		Результат.ПолныйПутьКСтрокеТЧ = Истина;
		ИдСтроки = Элементы.ЗаказыНаОтгрузку.ТекущаяСтрока;
		ПутьКСтрокеТЧ = "Объект.ЗаказыНаОтгрузку.НайтиПоИдентификатору(" + ИдСтроки + ").";
		Результат.ИмяРеквизита = ПутьКСтрокеТЧ + "АдресДоставки";
		Результат.ИмяВладельца = ПутьКСтрокеТЧ + "Контрагент";
	Иначе
		Результат.ИмяРеквизита = "АдресДоставки";
		Результат.ИмяВладельца = "Контрагент";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент) 
	
	Объект.АдресДоставки = "";
	Объект.АдресДоставкиЗначенияПолей = "";
	//Объект.Менеджер = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Контрагент.Партнер.ОсновнойМенеджер", Объект.Контрагент, "Контрагент");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресГрузоотправителя()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураАдрес = РеквизитОбъект.ПолучитьАдресГрузоотправителя();
	
	Объект.АдресГрузоотправителя = СтруктураАдрес.Адрес;
	Объект.АдресГрузоотправителяЗначенияПолей = СтруктураАдрес.АдресЗначенияПолей;

КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	
	ЗаполнитьАдресГрузоотправителя();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяСтоимостьДоставкиПриИзменении(Элемент)
	РассчитатьСтоимость(Неопределено);	
КонецПроцедуры

&НаСервере
Функция ПолучитьГрузоотправителя()
	
	Возврат Объект[ПолучитьИмяГрузоотправителя()];
	
КонецФункции

&НаСервере
Функция ПолучитьИмяГрузоотправителя()
	Если ЗначениеЗаполнено(Объект.Грузоотправитель2) Тогда
		ИмяГрузоотправителя = "Грузоотправитель2";
	ИначеЕсли ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
		ИмяГрузоотправителя = "Грузоотправитель";
	Иначе
		ИмяГрузоотправителя = "Организация";
	КонецЕсли;
	
	Возврат ИмяГрузоотправителя;
КонецФункции

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	
	// Попробуем найти грузоперевозчика и машину
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТранспортныеСредстваЛико_Водители.Ссылка КАК Машина,
		|	ТранспортныеСредстваЛико_Водители.Ссылка.Лико_Грузоперевозчик КАК Диспетчер
		|ИЗ
		|	Справочник.ТранспортныеСредства.Лико_Водители КАК ТранспортныеСредстваЛико_Водители
		|ГДЕ
		|	ТранспортныеСредстваЛико_Водители.Водитель = &Водитель
		|	И НЕ ТранспортныеСредстваЛико_Водители.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортныеСредстваЛико_Водители.Ссылка.Код УБЫВ";
	
	Запрос.УстановитьПараметр("Водитель", Объект.Водитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Водитель) Тогда
		ВодительПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КладовщикПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Кладовщик) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ОтпускПроизвел) Тогда
			Объект.ОтпускПроизвел = Объект.Кладовщик;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ОтпускРазрешил) Тогда
			Объект.ОтпускРазрешил = Объект.Кладовщик;
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаОтгрузкуПередУдалением(Элемент, Отказ)
	
	МассивСтрокДляУдаления = Новый Массив;
	Для каждого ВыделеннаяСтрока из Элемент.ВыделенныеСтроки Цикл
		Строка = Объект[Элемент.Имя].НайтиПоИдентификатору(ВыделеннаяСтрока);
		// Найдем строки Продукции
		Отбор = Новый Структура("ЗаказКлиента,Номенклатура,Характеристика,Контрагент,Намотка,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки,Город,ЗаявкаНаОтгрузку");
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		СтрокиПродукции = Объект.Продукция.НайтиСтроки(Отбор);
		Для каждого СтрокаПродукции из СтрокиПродукции Цикл
			Если СтрокаПродукции.Мест > 0 Тогда
				Отказ = Истина;
				Сообщить("Для строки №" + Строка.НомерСтроки + " есть отобранные коробки, удаление таких заявок запрещено. Сначала очистите эти коробки через форму обработки заявки");
			Иначе
				МассивСтрокДляУдаления.Добавить(СтрокаПродукции);
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;
	Если НЕ Отказ Тогда
		Для каждого Строка из МассивСтрокДляУдаления Цикл
			Объект.Продукция.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	эОтбор.ПравоеЗначение = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ГруппаФизическихЛицВодители.ЗначениеПараметра");
	эОтбор.Использование = Истина;
	
	ПараметрыОтбора = Новый Структура;    
	ПараметрыОтбора.Вставить("ФиксированныеНастройки", фиксНастройки);
	ПараметрыОтбора.Вставить("РежимВыбора", Истина);
	ПараметрыОтбора.Вставить("Лико_РежимПросмотра", ОтображениеТаблицы.Список);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыОтбора,,,,, Новый ОписаниеОповещения("Лико_ВыбранВодитель", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ВыбранВодитель(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.Водитель = Результат;
	КонецЕсли;
	ВодительПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если РазрешеноМенятьЗакрытуюЗаявку Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешеноМенятьЗакрытуюЗаявку", Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиИнформациюОПеревозчике(Команда)
	ОткрытьФорму("Документ.Лико_ЗаявкаНаТранспортировку.Форма.ФормаВводаИнформацииОПеревозчике", Новый Структура("Ключ", Объект.Ссылка), ЭтаФорма, Истина,,, Новый ОписаниеОповещения("ВведенаИнформацияОВПеревозчике", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВведенаИнформацияОВПеревозчике(Результат, ДополнительныеПараметры) Экспорт
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.СрокДоставки = Объект.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВУпаковку(Команда)
	
	ПереносимыеСтроки = Объект.ЗаказыНаОтгрузку.НайтиСтроки(Новый Структура("ВыбранныеСтроки", Истина));
	Если ПереносимыеСтроки.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки.");	
	Иначе
		ИдентификаторыПереносимыхСтрок = Новый Массив;
		Для каждого ПереносимаяСтрока из ПереносимыеСтроки Цикл
			ИдентификаторыПереносимыхСтрок.Добавить(ПереносимаяСтрока.ПолучитьИдентификатор());
		КонецЦикла;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОДобавленииСтрокНаУпаковку", ЭтотОбъект, Новый Структура("ИдентификаторыПереносимыхСтрок", ИдентификаторыПереносимыхСтрок)), "Отмеченные строки будут добавлены в план упаковки.
		|Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОДобавленииСтрокНаУпаковку(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПоказатьВводДаты(Новый ОписаниеОповещения("ВвелиДатуУпаковки", ЭтотОбъект, ДопПараметры), ТекущаяДата(), "Введите дату", ЧастиДаты.ДатаВремя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвелиДатуУпаковки(ДатаУпаковки, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ДатаУпаковки) Тогда
		ДобавитьСтрокиВУпаковку(ДопПараметры.ИдентификаторыПереносимыхСтрок, ДатаУпаковки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокиВУпаковку(ИдентификаторыПереносимыхСтрок, ДатаУпаковки)
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПереносимыхСтрок = Объект.ЗаказыНаОтгрузку.Выгрузить();
	ТаблицаПереносимыхСтрок.Очистить();
	Для каждого ИдентификаторПереносимойСтроки из ИдентификаторыПереносимыхСтрок Цикл
		НоваяСтрока = ТаблицаПереносимыхСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект.ЗаказыНаОтгрузку.НайтиПоИдентификатору(ИдентификаторПереносимойСтроки));
	КонецЦикла;
	МассивЗаявок = Новый Массив;
	МассивЗаказов = Новый Массив;
	МассивХарактеристик = Новый Массив;
	Для каждого Строка из ТаблицаПереносимыхСтрок Цикл
		Если ЗначениеЗаполнено(Строка.ЗаявкаНаОтгрузку) И МассивЗаявок.Найти(Строка.ЗаявкаНаОтгрузку) = Неопределено Тогда
			МассивЗаявок.Добавить(Строка.ЗаявкаНаОтгрузку);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.ЗаказКлиента) И МассивЗаказов.Найти(Строка.ЗаказКлиента) = Неопределено Тогда
			МассивЗаказов.Добавить(Строка.ЗаказКлиента);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Характеристика) И МассивХарактеристик.Найти(Строка.Характеристика) = Неопределено Тогда
			МассивХарактеристик.Добавить(Строка.Характеристика);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаявкиНаОтгрузкуОстатки.ДокументОприходования КАК ЗаявкаНаОтгрузку,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Характеристика КАК Характеристика,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Город КАК Город,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.Намотка КАК Намотка,
		|	Лико_ЗаявкиНаОтгрузкуОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	РегистрНакопления.Лико_ЗаявкиНаОтгрузку.Остатки(
		|			,
		|			ДокументОприходования В (&ДокументыОприходования)
		|				И ЗаказКлиента В (&ЗаказыКлиентов)
		|				И Характеристика В (&МассивХарактеристик)) КАК Лико_ЗаявкиНаОтгрузкуОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
		|	ВТ_Заявки.Характеристика КАК Характеристика,
		|	ВТ_Заявки.Город КАК Город,
		|	ВТ_Заявки.Намотка КАК Намотка,
		|	ВТ_Заявки.Количество КАК Количество,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Лико_ПланУпаковкиТовары.Ссылка ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК УжеЕстьВПлане,
		|	ВТ_Заявки.ЗаявкаНаОтгрузку.Номер КАК НомерЗаявки,
		|	ВТ_Заявки.Характеристика.Владелец КАК Номенклатура
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПланУпаковки.Товары КАК Лико_ПланУпаковкиТовары
		|		ПО ВТ_Заявки.ЗаявкаНаОтгрузку = Лико_ПланУпаковкиТовары.ЗаявкаНаОтгрузку
		|			И ВТ_Заявки.Характеристика = Лико_ПланУпаковкиТовары.Характеристика
		|			И ВТ_Заявки.Город = Лико_ПланУпаковкиТовары.Город
		|			И ВТ_Заявки.Намотка = Лико_ПланУпаковкиТовары.Намотка
		|			И (Лико_ПланУпаковкиТовары.Ссылка.Проведен
		|				И НЕ Лико_ПланУпаковкиТовары.Ссылка.ПометкаУдаления
		|				И Лико_ПланУпаковкиТовары.Ссылка.ВидДвижения)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Заявки.ЗаявкаНаОтгрузку,
		|	ВТ_Заявки.Характеристика,
		|	ВТ_Заявки.Город,
		|	ВТ_Заявки.Намотка,
		|	ВТ_Заявки.Количество,
		|	ВТ_Заявки.ЗаявкаНаОтгрузку.Номер,
		|	ВТ_Заявки.Характеристика.Владелец";
	
	Запрос.УстановитьПараметр("ДокументыОприходования", МассивЗаявок);
	Запрос.УстановитьПараметр("ЗаказыКлиентов", МассивЗаказов);
	Запрос.УстановитьПараметр("МассивХарактеристик", МассивХарактеристик);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		НовыйДокумент = Документы.Лико_ПланУпаковки.СоздатьДокумент();
		НовыйДокумент.Дата = ДатаУпаковки;
		НовыйДокумент.ВидДокумента = Перечисления.Лико_ВидыДокументовПланУпаковки.УпаковкаИПеремотка;
		НовыйДокумент.ВидДвижения = Истина; // Приход
		НовыйДокумент.Автор = ПараметрыСеанса.ТекущийПользователь;
		Пока Выборка.Следующий() Цикл
			Если Выборка.УжеЕстьВПлане Тогда
				Сообщить("" + Выборка.НомерЗаявки + " / " + Выборка.Номенклатура + " / " + Выборка.Город + " / " + Выборка.Намотка + " уже есть в плане, строка пропущена");
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НовыйДокумент.Товары.Добавить(), Выборка);
		КонецЦикла;
		Если НовыйДокумент.Товары.Количество() > 0 Тогда
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("В план добавлено строк: " + НовыйДокумент.Товары.Количество());
			Исключение
				Сообщить("Не удалось провести документ """ + НовыйДокумент + """: " + ОписаниеОшибки());	
			КонецПопытки;
		КонецЕсли;
	Иначе
		Сообщить("Не найдено остатков по выбранным строкам");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого Строка из Объект.ЗаказыНаОтгрузку Цикл
		Строка.ВыбранныеСтроки = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого Строка из Объект.ЗаказыНаОтгрузку Цикл
		Строка.ВыбранныеСтроки = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОкончитьСборку(Команда)
	НачатьОкончитьСборкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура НачатьОкончитьСборкуНаСервере()
	
	Если ЗначениеЗаполнено(Объект.НачалоСборки) И ЗначениеЗаполнено(Объект.ОкончаниеСборки) Тогда
		// Отменяем
		Объект.ОкончаниеСборки = Неопределено;
		Объект.НачалоСборки = Неопределено;
		Объект.Сборщик = Неопределено;
	ИначеЕсли ЗначениеЗаполнено(Объект.НачалоСборки) Тогда
		// Заканчиваем
		Объект.ОкончаниеСборки = ТекущаяДатаСеанса();
	Иначе
		// Начинаем
		Объект.НачалоСборки = ТекущаяДатаСеанса();
		Объект.Сборщик = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	// Если Статус заявки = Закрыт, то сразу сохраним в режиме обмена данными
	Если Объект.Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ Модифицированность Тогда
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
		РеквизитОбъект.ОбменДанными.Загрузка = Истина;
		РеквизитОбъект.Записать(РежимЗаписиДокумента.Запись);
		ЭтаФорма.Прочитать();
	Иначе
		Модифицированность = Истина;
	КонецЕсли;
	
	ИзменитьНазваниеКнопкиНачалаОкончанияСборкиИНадписиОСборке();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьНазваниеКнопкиНачалаОкончанияСборкиИНадписиОСборке()
	
	Если ЗначениеЗаполнено(Объект.НачалоСборки) И ЗначениеЗаполнено(Объект.ОкончаниеСборки) Тогда
		Элементы.ФормаНачатьОкончитьСборку.Заголовок = "Отменить сборку";
		Элементы.ФормаНадписьОСборке.Заголовок = "Сборка окончена " + Формат(Объект.ОкончаниеСборки, "ДФ='dd.MM.yy ""в"" HH:mm:ss'") + ": " + Объект.Сборщик;
	ИначеЕсли ЗначениеЗаполнено(Объект.НачалоСборки) Тогда
		Элементы.ФормаНачатьОкончитьСборку.Заголовок = "Закончить сборку";
		Элементы.ФормаНадписьОСборке.Заголовок = "Сборка начата " + Формат(Объект.НачалоСборки, "ДФ='dd.MM.yy ""в"" HH:mm:ss'") + ": " + Объект.Сборщик;
	Иначе
		Элементы.ФормаНачатьОкончитьСборку.Заголовок = "Начать сборку";
		Элементы.ФормаНадписьОСборке.Заголовок = "Сборка НЕ начата";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОстаткиПоСтрокеБезУчетаКлючевыхПараметров(Команда)
	ОткрытьФорму("Документ.Лико_ЗаявкаНаТранспортировку.Форма.ФормаВыбораКлючевыхПараметров", Новый Структура("ВариантОткрытия", "ЗаявкаНаТранспортировку"),,,,, Новый ОписаниеОповещения("ВыбраныКлючевыеПараметрыПодбора", ЭтотОбъект, Новый Структура("ИмяКоманды", Команда.Имя)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраныКлючевыеПараметрыПодбора(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПодобратьОстатки(ЭтаФорма.Команды[ДопПараметры.ИмяКоманды], Результат);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбработкиЗаявки(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", Объект.Ссылка);
		//ОткрытьФорму("Документ.Лико_ЗаявкаНаТранспортировку.Форма.ФормаОбработкиЗаявкиНаТранспортировку", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ПараметрыКоманды = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнейОбработки(,, "ТранспортныйМодуль");
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ПараметрыКоманды.Ссылка);
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаОбработкиЗаявкиНаТранспортировку", ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМеста(Команда)
	Для каждого Строка из Объект.Продукция Цикл
		Строка.Мест = 1;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМеста(Команда)
	Для каждого Строка из Объект.Продукция Цикл
		Строка.Мест = 0;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОтгруженнымТоварам(Команда)
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед формированием отчета документ нужно записать");
		Возврат;	
	КонецЕсли;
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "Лико_ОтгруженныеТоварыСоСрокомХранения");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОтчета = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаявкаНаТранспортировку", Объект.Ссылка);
	СтруктураПараметров.Вставить("ДатаОтсчета", ?(ЗначениеЗаполнено(Объект.ДатаОтгрузки), Объект.ДатаОтгрузки, Объект.Дата));

	ПараметрыОткрытия = Лико_Дополнительно.ПолучитьПараметрыОткрытияОтчета(ИмяОтчета, СтруктураПараметров);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОтчета + ".ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
	
КонецПроцедуры 
