
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормаСверкиВзаиморасчетов = "Документ.СверкаВзаиморасчетов2_4.Форма.ФормаСписка";
	
	Если НоваяАрхитектураВзаиморасчетов() Тогда
		ФормаСверкиВзаиморасчетов = "ЖурналДокументов.СверкиВзаиморасчетов.Форма.ФормаСписка";
	КонецЕсли;
	
	ОткрытьФорму(ФормаСверкиВзаиморасчетов,,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НоваяАрхитектураВзаиморасчетов()
	
	Возврат ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	
КонецФункции

#КонецОбласти