#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОпределитьЭтапТУПоОперации(Операция) Экспорт
	
	Если Лев(Операция, 7) = "Склейка" Тогда
		ЭтапТУ = Справочники.Лико_ЭтапыВыполненияЗаказа.Склейка;
	ИначеЕсли Лев(Операция, 8) = "Продувка" Тогда
		ЭтапТУ = Справочники.Лико_ЭтапыВыполненияЗаказа.Продувка;
	ИначеЕсли Операция = "ПоперечнаяРезка" Тогда
		ЭтапТУ = Справочники.Лико_ЭтапыВыполненияЗаказа.ПоперечнаяРезка;
	ИначеЕсли Операция = "РаботаСБраком" Тогда
		ЭтапТУ = Справочники.Лико_ЭтапыВыполненияЗаказа.РаботаСБраком;
	ИначеЕсли Операция = "Упаковка" Тогда
		ЭтапТУ = Справочники.Лико_ЭтапыВыполненияЗаказа.Упаковка;
	Иначе
		ЭтапТУ = Неопределено;
	КонецЕсли;
	
	Возврат ЭтапТУ;
	
КонецФункции

#КонецЕсли  

Функция РассчитатьВыработкуПеремотчиков(ЗаказКлиента,ПараметрыДляВыработкиПеремотки) Экспорт // <-- Начало Лико Яцун С. В. 19.08.2025
	
	Если ЗначениеЗаполнено(ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки) И НЕ ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки.Перемотка И НЕ ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки = Справочники.Лико_ТипыОперацийПеремотка.ИсправлениеБрака Тогда
		ПараметрыДляВыработкиПеремотки.КоличествоТысШт = (ПараметрыДляВыработкиПеремотки.КоличествоПМ * ЗаказКлиента.ШтКВМ * ЗаказКлиента.Нарезка.Размер) / 1000000;	
	КонецЕсли;
	ВремяНастройки = Неопределено;	
	ВремяОперации = Неопределено;	
	Время = Неопределено;	
	
	Если ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки = Справочники.Лико_ТипыОперацийПеремотка.ИсправлениеБрака Тогда
		КоличествоПМ = Неопределено;	
		КоличествоКВМ = Неопределено;	
		Время = ПараметрыДляВыработкиПеремотки.ВремяВыполнения;
	ИначеЕсли ЗначениеЗаполнено(ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки) Тогда
		КоличествоПМ = ?(ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки.Перемотка,ПараметрыДляВыработкиПеремотки.КоличествоТысШт * 1000 * 1000 / ЗаказКлиента.ШтКВМ / ЗаказКлиента.Нарезка.Размер,ПараметрыДляВыработкиПеремотки.КоличествоПМ);	
		КоличествоКВМ = КоличествоПМ * ЗаказКлиента.Нарезка.Размер/1000;	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПараметрыРасчетаПеремотки.Наименование КАК Наименование,
		|	Лико_ПараметрыРасчетаПеремотки.ТипОперации КАК ТипОперации,
		|	Лико_ПараметрыРасчетаПеремотки.ДлинаЮмбы КАК ДлинаЮмбы,
		|	Лико_ПараметрыРасчетаПеремотки.Скорость КАК Скорость,
		|	Лико_ПараметрыРасчетаПеремотки.ВремяСъема КАК ВремяСъема,
		|	Лико_ПараметрыРасчетаПеремотки.ВремяРолика КАК ВремяРолика,
		|	Лико_ПараметрыРасчетаПеремотки.ВремяЮмбы КАК ВремяЮмбы,
		|	Лико_ПараметрыРасчетаПеремотки.ВремяНастройкиНожа КАК ВремяНастройкиНожа,
		|	Лико_ПараметрыРасчетаПеремотки.ВремяНастройкиNikka КАК ВремяНастройкиNikka,
		|	Лико_ПараметрыРасчетаПеремотки.ПЗВ КАК ПЗВ
		|ИЗ
		|	Справочник.Лико_ПараметрыРасчетаПеремотки КАК Лико_ПараметрыРасчетаПеремотки
		|ГДЕ
		|	Лико_ПараметрыРасчетаПеремотки.ТипОперации = &ТипОперации";
		
		Запрос.УстановитьПараметр("ТипОперации", ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВП = РезультатЗапроса.Выбрать();
		
		Пока ВП.Следующий() Цикл
			ДлинаЮмбы = ВП.ДлинаЮмбы;
			Скорость = ВП.Скорость;
			Если ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки = Справочники.Лико_ТипыОперацийПеремотка.ВалидацияБольшихЭтикеток Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Лико_ПараметрыРасчетаПеремотки.Наименование КАК Наименование,
				|	Лико_ПараметрыРасчетаПеремотки.ТипОперации КАК ТипОперации,
				|	Лико_ПараметрыРасчетаПеремотки.ДлинаЮмбы КАК ДлинаЮмбы,
				|	Лико_ПараметрыРасчетаПеремотки.Скорость КАК Скорость
				|ИЗ
				|	Справочник.Лико_ПараметрыРасчетаПеремотки КАК Лико_ПараметрыРасчетаПеремотки
				|ГДЕ
				|	Лико_ПараметрыРасчетаПеремотки.ТипОперации = &ТипОперации";
				
				Запрос.УстановитьПараметр("ТипОперации", ПараметрыДляВыработкиПеремотки.ТипОперацииПеремоткиАвто);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВПВ = РезультатЗапроса.Выбрать();
				
				Пока ВПВ.Следующий() Цикл
					ДлинаЮмбы = ВПВ.ДлинаЮмбы;
					Скорость = ВПВ.Скорость;
				КонецЦикла;
			КонецЕсли;
			Если ПараметрыДляВыработкиПеремотки.ТипОперацииПеремотки = Справочники.Лико_ТипыОперацийПеремотка.Переворот Тогда
				КоличествоРучьев = ПараметрыДляВыработкиПеремотки.КоличествоРучьевПереворота;
			Иначе
				КоличествоРучьев = ?(НЕ ЗаказКлиента.Цифровой,ЗаказКлиента.РучьиПечати,ЗаказКлиента.РучьиПечатиИндиго);
			КонецЕсли;
			ДлинаТиража = (ПараметрыДляВыработкиПеремотки.КоличествоТысШт * 1000 * ?(ЗначениеЗаполнено(ЗаказКлиента.ЭтМЭР),ЗаказКлиента.ЭтМЭР,Лико_ТиражМетраж.ПолучитьДлиннуИлиШиринуЭтикетки(ЗаказКлиента)/1000))/КоличествоРучьев;
			Если ПараметрыДляВыработкиПеремотки.КоличествоЭтикетокВРолике = 0 Тогда
				КоличествоСъемов = 1;
			Иначе
				ДлинаРолика = ПараметрыДляВыработкиПеремотки.КоличествоЭтикетокВРолике * ?(ЗначениеЗаполнено(ЗаказКлиента.ЭтМЭР),ЗаказКлиента.ЭтМЭР,Лико_ТиражМетраж.ПолучитьДлиннуИлиШиринуЭтикетки(ЗаказКлиента));
				КоличествоСъемов = ДлинаТиража / ДлинаРолика;
			КонецЕсли;
			КоличествоЮмб = ДлинаТиража / ДлинаЮмбы;
			КоличествоРоликов = ДлинаТиража / ДлинаЮмбы * КоличествоРучьев;
			
			//Время настройки
			КоличествоНожей = КоличествоРучьев + ?(ЗаказКлиента.Товары[0].ПодрезкаКромки,1,-1);
			ВремяНастройки = (ВП.ПЗВ + КоличествоНожей * ВП.ВремяНастройкиНожа + ?(ЗаказКлиента.Nikka,ВП.ВремяНастройкиNikka * ?(ПараметрыДляВыработкиПеремотки.ДвойнаяНика,2,1),0)) * ПараметрыДляВыработкиПеремотки.КоличествоНастроек;
			
			//Время операции
			ВремяОперации = ДлинаТиража / Скорость + КоличествоСъемов * ВП.ВремяСъема + КоличествоРоликов * ВП.ВремяРолика + КоличествоЮмб * ВП.ВремяЮмбы;	
			
			//Время общее
			Время = ВремяОперации + ПараметрыДляВыработкиПеремотки.КоличествоНастроек * ВремяНастройки;	
		КонецЦикла;
	КонецЕсли;
	
	РезультатыРасчетаВыработкиПеремотчиков = Новый Структура();
	РезультатыРасчетаВыработкиПеремотчиков.Вставить("КоличествоТысШт",ПараметрыДляВыработкиПеремотки.КоличествоТысШт);
	РезультатыРасчетаВыработкиПеремотчиков.Вставить("КоличествоПМ",КоличествоПМ);
	РезультатыРасчетаВыработкиПеремотчиков.Вставить("КоличествоКВМ",КоличествоКВМ);
	РезультатыРасчетаВыработкиПеремотчиков.Вставить("ВремяНастройки",ВремяНастройки);
	РезультатыРасчетаВыработкиПеремотчиков.Вставить("ВремяОперации",ВремяОперации);
	РезультатыРасчетаВыработкиПеремотчиков.Вставить("Время",Время);
	
	Возврат РезультатыРасчетаВыработкиПеремотчиков;
	
КонецФункции // <-- Конец Лико Яцун С. В. 19.08.2025

Функция ОпределитьТипОперацииПеремоткиАвто(ЗаказКлиента) Экспорт // <-- Начало Лико Яцун С. В. 19.08.2025
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
		|			ТОГДА ВЫРАЗИТЬ(Лико_ЗатратыПоЗаказуОбороты.Затрата КАК Справочник.ЦеновыеГруппы).ОсновнаяНоменклатура
		|		ИНАЧЕ ВЫРАЗИТЬ(Лико_ЗатратыПоЗаказуОбороты.Затрата КАК Справочник.Номенклатура)
		|	КОНЕЦ КАК Материал,
		|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента КАК ЗаказКлиента,
		|	Лико_ЗатратыПоЗаказуОбороты.КоличествоОборот КАК Количество
		|ПОМЕСТИТЬ ВТОснМатериал
		|ИЗ
		|	РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
		|			,
		|			,
		|			,
		|			ВЫБОР
		|					КОГДА &ЗаказВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка)
		|						ТОГДА ЗаказКлиента = &ЗаказИсходныйЗаказ
		|					ИНАЧЕ ЗаказКлиента = &Заказ
		|				КОНЕЦ
		|				И СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)) КАК Лико_ЗатратыПоЗаказуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента,
		|	Лико_ЗатратыПоЗаказуОбороты.КоличествоОборот,
		|	ВЫБОР
		|		КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.ЦеновыеГруппы
		|			ТОГДА ВЫРАЗИТЬ(Лико_ЗатратыПоЗаказуОбороты.Затрата КАК Справочник.ЦеновыеГруппы).ОсновнаяНоменклатура
		|		ИНАЧЕ ВЫРАЗИТЬ(Лико_ЗатратыПоЗаказуОбороты.Затрата КАК Справочник.Номенклатура)
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаТовары.МаксимальныйДиаметрРулона КАК ДиаметрРоликаПлан,
		|	ЗаказКлиентаТовары.ДиаметрРоликаФакт КАК ДиаметрРоликаФакт,
		|	ЗаказКлиентаТовары.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВТДиаметрРолика
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиентаТовары.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗаказКлиентаЦвета.Материал ССЫЛКА Справочник.ЦеновыеГруппы
		|				ТОГДА ВЫРАЗИТЬ(ЗаказКлиентаЦвета.Материал КАК Справочник.ЦеновыеГруппы).ОсновнаяНоменклатура
		|			ИНАЧЕ ВЫРАЗИТЬ(ЗаказКлиентаЦвета.Материал КАК Справочник.Номенклатура)
		|		КОНЕЦ) КАК МатериалЛаминации,
		|	ЗаказКлиентаЦвета.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВТМатериалЛаминации
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЗаказВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка)
		|				ТОГДА ЗаказКлиентаЦвета.Ссылка = &ЗаказИсходныйЗаказ
		|			ИНАЧЕ ЗаказКлиентаЦвета.Ссылка = &Заказ
		|		КОНЕЦ
		|	И ЗаказКлиентаЦвета.ВидСекции.Ламинация
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаЦвета.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОснМатериал.ЗаказКлиента.ТипЗаказа КАК ТипЗаказа,
		|	ВТОснМатериал.ЗаказКлиента.ДлинаЭтикетки КАК ДлинаЭтикетки,
		|	ВТОснМатериал.ЗаказКлиента.ШиринаЭтикетки КАК ШиринаЭтикетки,
		|	ВТОснМатериал.ЗаказКлиента.ВидЗаказа КАК ВидЗаказа,
		|	ВЫБОР
		|		КОГДА ВТОснМатериал.Материал.Лико_СвойстваМатериала = ЗНАЧЕНИЕ(Справочник.Лико_СвойстваМатериала.ПустаяСсылка)
		|				ИЛИ ВТОснМатериал.Материал.Лико_СвойстваМатериала.Подложка = ЗНАЧЕНИЕ(Справочник.Лико_Подложка.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ВТМатериалЛаминации.МатериалЛаминации.Лико_СвойстваМатериала.Подложка.ВидПодложки, """")
		|		ИНАЧЕ ЕСТЬNULL(ВТОснМатериал.Материал.Лико_СвойстваМатериала.Подложка.ВидПодложки, """")
		|	КОНЕЦ КАК МатериалВидПодложки,
		|	ВЫБОР
		|		КОГДА ВТОснМатериал.Материал.Лико_СвойстваМатериала = ЗНАЧЕНИЕ(Справочник.Лико_СвойстваМатериала.ПустаяСсылка)
		|				ИЛИ ВТОснМатериал.Материал.Лико_СвойстваМатериала.Подложка = ЗНАЧЕНИЕ(Справочник.Лико_Подложка.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ВТМатериалЛаминации.МатериалЛаминации.Лико_СвойстваМатериала.ГруппаМатериалов, ВТОснМатериал.Материал.Лико_СвойстваМатериала.ГруппаМатериалов)
		|		ИНАЧЕ ВТОснМатериал.Материал.Лико_СвойстваМатериала.ГруппаМатериалов
		|	КОНЕЦ КАК МатериалГруппаМатериалов,
		|	ЗаказКлиента1.МетражПМ КАК МетражПМ,
		|	ВЫБОР
		|		КОГДА ВТДиаметрРолика.ДиаметрРоликаФакт = 0
		|			ТОГДА ВТДиаметрРолика.ДиаметрРоликаПлан
		|		ИНАЧЕ ВТДиаметрРолика.ДиаметрРоликаФакт
		|	КОНЕЦ КАК ДиаметрРолика,
		|	ВЫБОР
		|		КОГДА ВТОснМатериал.Материал.Лико_СвойстваМатериала = ЗНАЧЕНИЕ(Справочник.Лико_СвойстваМатериала.ПустаяСсылка)
		|				ИЛИ ВТОснМатериал.Материал.Лико_СвойстваМатериала.Подложка = ЗНАЧЕНИЕ(Справочник.Лико_Подложка.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ВТМатериалЛаминации.МатериалЛаминации, ВТОснМатериал.Материал)
		|		ИНАЧЕ ВТОснМатериал.Материал
		|	КОНЕЦ КАК Материал
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснМатериал КАК ВТОснМатериал
		|		ПО (ВЫБОР
		|				КОГДА &ЗаказВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка)
		|					ТОГДА ЗаказКлиента1.Ссылка.ИсходныйЗаказ = ВТОснМатериал.ЗаказКлиента
		|				ИНАЧЕ ЗаказКлиента1.Ссылка = ВТОснМатериал.ЗаказКлиента
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДиаметрРолика КАК ВТДиаметрРолика
		|		ПО ЗаказКлиента1.Ссылка = ВТДиаметрРолика.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМатериалЛаминации КАК ВТМатериалЛаминации
		|		ПО (ВЫБОР
		|				КОГДА &ЗаказВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка)
		|					ТОГДА ЗаказКлиента1.Ссылка.ИсходныйЗаказ = ВТМатериалЛаминации.Заказ
		|				ИНАЧЕ ЗаказКлиента1.Ссылка = ВТМатериалЛаминации.Заказ
		|			КОНЕЦ)
		|ГДЕ
		|	ЗаказКлиента1.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	Запрос.УстановитьПараметр("ЗаказВидЗаказа", ЗаказКлиента.ВидЗаказа);
	Запрос.УстановитьПараметр("ЗаказИсходныйЗаказ", ЗаказКлиента.ИсходныйЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Упаковка Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.Круговая;
		ИначеЕсли ВыборкаДетальныеЗаписи.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.РезкаТУ;	
		ИначеЕсли ВыборкаДетальныеЗаписи.ДиаметрРолика < 160 И ВыборкаДетальныеЗаписи.ДиаметрРолика <> 0 Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.РоликиМаленькогоДиаметра;	
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Security Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.ПромоТипSecurity;	
		ИначеЕсли ВыборкаДетальныеЗаписи.МетражПМ <= 1000 Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.ЗаказыПМНебольше1Км;
		ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Материал) И ЗаказКлиента.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Аппликатор Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.ПленочнаяПодложка;
		ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Материал.Лико_СвойстваМатериала) Тогда
			Возврат "Не заполнены свойства материала, Данные о выработке не будут заполнены";
		ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МатериалГруппаМатериалов) Тогда
			Возврат "Не заполнена Группа материала в свойствах материала, Данные о выработке не будут заполнены";
		ИначеЕсли ВыборкаДетальныеЗаписи.МатериалГруппаМатериалов = Справочники.Лико_ГруппыМатериалов.ИксФойл Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.ИксФойл;
		ИначеЕсли ВыборкаДетальныеЗаписи.ДлинаЭтикетки < 25 Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.ЭтикеткиМаленькогоРазмера;	
		ИначеЕсли ВыборкаДетальныеЗаписи.МатериалГруппаМатериалов = Справочники.Лико_ГруппыМатериалов.ПленкаКристалл Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.CristalClear;
		ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МатериалВидПодложки) Тогда
			Возврат "Не заполнена Подложка в свойствах материала, Данные о выработке не будут заполнены";
		ИначеЕсли ВыборкаДетальныеЗаписи.МатериалВидПодложки = "Пленка" Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.ПленочнаяПодложка;
		ИначеЕсли ВыборкаДетальныеЗаписи.МатериалВидПодложки = "Бумага" Тогда
			Возврат Справочники.Лико_ТипыОперацийПеремотка.БумажнаяПодложка;
		Иначе
			Возврат "Не удалось определить тип операции, Данные о выработке не будут заполнены";
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПересчитатьВыработкуПеремотки(ЗаказКлиента,ДанныеСтроки) Экспорт
	
	ТипОперацииПеремоткиАвто = ОпределитьТипОперацииПеремоткиАвто(ЗаказКлиента);
	
	ПараметрыДляВыработкиПеремотки = Новый Структура();
	ПараметрыДляВыработкиПеремотки.Вставить("ТипОперацииПеремотки",ДанныеСтроки.ТипОперации);
	ПараметрыДляВыработкиПеремотки.Вставить("ТипОперацииПеремоткиАвто",ТипОперацииПеремоткиАвто);
	ПараметрыДляВыработкиПеремотки.Вставить("КоличествоТысШт",ДанныеСтроки.Количество);
	ПараметрыДляВыработкиПеремотки.Вставить("КоличествоПМ",ДанныеСтроки.КоличествоПМ);
	ПараметрыДляВыработкиПеремотки.Вставить("ВремяВыполнения",ДанныеСтроки.Время);
	ПараметрыДляВыработкиПеремотки.Вставить("КоличествоНастроек",ДанныеСтроки.КоличествоНастроек);
	ПараметрыДляВыработкиПеремотки.Вставить("ДвойнаяНика",ДанныеСтроки.ДвойнаяНика);
	ПараметрыДляВыработкиПеремотки.Вставить("КоличествоЭтикетокВРолике",КолЭтВРоликеПачке(ЗаказКлиента,ДанныеСтроки));
	ПараметрыДляВыработкиПеремотки.Вставить("КоличествоРучьевПереворота",ДанныеСтроки.КоличествоРучьевПереворота);
	
	ВыработкаПеремотки = РассчитатьВыработкуПеремотчиков(ЗаказКлиента,ПараметрыДляВыработкиПеремотки); 
	ЗаполнитьЗначенияСвойств(ДанныеСтроки,ВыработкаПеремотки);

	Возврат ДанныеСтроки;
	
КонецФункции 

Функция КолЭтВРоликеПачке(ЗаказКлиента,ДанныеСтроки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Линкс Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.КоличествоВРоликеПослеПеремотки) КАК КоличествоВРоликеПослеПеремотки
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры.Лико_Содержимое КАК СерииНоменклатурыЛико_Содержимое
		|		ПО Лико_ФормированиеПаллетаСодержимое.Серия = СерииНоменклатурыЛико_Содержимое.Ссылка
		|ГДЕ
		|	Лико_ФормированиеПаллетаСодержимое.Ссылка = &Ссылка
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.ДатаФормирования = &ДатаФормирования
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.Ответственный = &Ответственный
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.НомерБланка = &НомерБланка
		|	И СерииНоменклатурыЛико_Содержимое.ОбъектНоменклатуры.РабочийЦентрВыпускаВРоликеПослеПеремотки = &РабочийЦентрВыпускаВРоликеПослеПеремотки";
		
		Запрос.УстановитьПараметр("ДатаФормирования", ДанныеСтроки.Дата);
		Запрос.УстановитьПараметр("НомерБланка", ДанныеСтроки.НомерБланка);
		Запрос.УстановитьПараметр("Ответственный", ДанныеСтроки.Сотрудник);
		Запрос.УстановитьПараметр("РабочийЦентрВыпускаВРоликеПослеПеремотки", ДанныеСтроки.РабочийЦентр);
		Запрос.УстановитьПараметр("Ссылка", ДанныеСтроки.ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаОтветстввенный = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОтветстввенный.Следующий() Цикл
			// Вставить обработку выборки ВыборкаОтветстввенный
			
			ВыборкаДетальныеЗаписи = ВыборкаОтветстввенный.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Возврат ВыборкаДетальныеЗаписи.КоличествоВРоликеПослеПеремотки * 1000;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ТЗГородов = ЗаказКлиента.Товары.Выгрузить(, "Город");
	ТЗГородов.Свернуть("Город");
	КоличествоГородов = ТЗГородов.Количество();
	
	ВыбранныйГород = Неопределено;	
	Если КоличествоГородов > 1 Тогда
		Для каждого Город Из ТЗГородов Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	&Город КАК Город
			|ИЗ
			|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
			|ГДЕ
			|	Лико_ЭтапыЗаказа.Заказ = &Заказ
			|	И Лико_ЭтапыЗаказа.Ответственный = &Ответственный
			|	И Лико_ЭтапыЗаказа.Период = &Период
			|	И Лико_ЭтапыЗаказа.Количество = &Количество
			|	И Лико_ЭтапыЗаказа.Комментарий ПОДОБНО ""%"" + &Город + ""%""";
			
			Запрос.УстановитьПараметр("Город", Город[0]);
			Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
			Запрос.УстановитьПараметр("Количество", ДанныеСтроки.Количество);
			Запрос.УстановитьПараметр("Ответственный", ДанныеСтроки.Автор);
			Запрос.УстановитьПараметр("Период", ДанныеСтроки.Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ВыбранныйГород = Город[0];
			КонецЦикла;
			Если ЗначениеЗаполнено(ВыбранныйГород) Тогда
				Прервать;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.КоличествоЭтикетокВРолике КАК КоличествоЭтикетокВРолике
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Город = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиентаТовары.Город = &Город
	|		КОНЕЦ
	|	И ЗаказКлиентаТовары.Ссылка = &Заказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиентаТовары.НомерСтроки";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	Запрос.УстановитьПараметр("Город", ВыбранныйГород);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоЭтикетокВРолике;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции   

Функция ПолучитьСкоростьПеремотки(ТипОперацииПеремотки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыТипаОперации = Справочники.Лико_ПараметрыРасчетаПеремотки.НайтиПоРеквизиту("ТипОперации",ТипОперацииПеремотки);
    УстановитьПривилегированныйРежим(Ложь);

	Возврат ПараметрыТипаОперации.Скорость;
	
КонецФункции

