
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Лико_УчетГотовыхЭтикеток.Записывать = Истина;
	МассивТЧДляПроведения = Новый Массив;
	МассивТЧДляПроведения.Добавить("Перемотка");
	МассивТЧДляПроведения.Добавить("ВыходнойКонтроль");
	Для каждого ИмяТЧ из МассивТЧДляПроведения Цикл
		Для каждого Строка из ЭтотОбъект[ИмяТЧ] Цикл
			// <-- Начало Лико Яцун С. В. 22.08.2025 
			Если ИмяТЧ = "Перемотка" И (ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Ликофлекс ИЛИ ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Линкс) И ЗначениеЗаполнено(Строка.Сотрудник) И ЗначениеЗаполнено(Строка.ТипОперации) Тогда
								
				Движения.Лико_ВыработкаПеремоткиРезки.Записывать = Истина;
				НоваяСтрокаВыработкаПеремотки = Движения.Лико_ВыработкаПеремоткиРезки.Добавить();
				НоваяСтрокаВыработкаПеремотки.Период = Строка.Дата;
				НоваяСтрокаВыработкаПеремотки.Сотрудник = Строка.Сотрудник;
				НоваяСтрокаВыработкаПеремотки.Заказ = ЗаказКлиента;
				НоваяСтрокаВыработкаПеремотки.НомерБланка = Строка.НомерБланка;
				НоваяСтрокаВыработкаПеремотки.ДатаОперации = Строка.Дата;
				НоваяСтрокаВыработкаПеремотки.Смена = Строка.Смена;
				НоваяСтрокаВыработкаПеремотки.ТипОперации = Строка.ТипОперации;
				НоваяСтрокаВыработкаПеремотки.МетражПМ = Строка.КоличествоПМ;
				НоваяСтрокаВыработкаПеремотки.МетражКвМ = Строка.КоличествоКВМ;
				НоваяСтрокаВыработкаПеремотки.Время = Строка.Время;
				НоваяСтрокаВыработкаПеремотки.ВсегоКвМ = ЭтотОбъект[ИмяТЧ].Итог("КоличествоКВМ");
				НоваяСтрокаВыработкаПеремотки.Настройка_ЗП = Строка.КоличествоНастроек;
				Если НЕ Строка.ТипОперации.Перемотка Тогда
					Продолжить;	
				КонецЕсли;
			КонецЕсли;
			// <-- Конец Лико Яцун С. В. 22.08.2025
			Если Строка.Растарка Тогда
				Продолжить;
			КонецЕсли;
			// Общие параметры
			НоваяСтрока = Движения.Лико_УчетГотовыхЭтикеток.Добавить();
			НоваяСтрока.ЗаказКлиента = ЗаказКлиента;
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.Период = Строка.Дата;
			НоваяСтрока.ИдентификаторСтроки = Строка.ИдентификаторСтроки;
			НоваяСтрока.НомерБланка = Строка.НомерБланка;
			НоваяСтрока.НомерПриложения = Строка.НомерПриложения;
			// Отличающиеся параметры (в зависимости от ТЧ)
			Если ИмяТЧ = "Перемотка" Тогда
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрока.Место = Перечисления.Лико_МестаУчетаГотовыхЭтикеток.Перемотка;
			ИначеЕсли ИмяТЧ = "ВыходнойКонтроль" Тогда
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрока.Место = Перечисления.Лико_МестаУчетаГотовыхЭтикеток.ВыходнойКонтроль;
				// Нужен еще расход Перемотки
				НоваяСтрокаРасход = Движения.Лико_УчетГотовыхЭтикеток.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасход, НоваяСтрока);
				НоваяСтрокаРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаРасход.Место = Перечисления.Лико_МестаУчетаГотовыхЭтикеток.Перемотка;
			Иначе
				Сообщить("" + Ссылка + ": ошибка в обработчике проведения");
				Отказ = Истина;	
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 

	// Для строк с заполненым ВидРабочегоМеста будем писать в этапы заказа
	// При добавлении новых строк в массив нужно добавить и в процедуре ПередЗаписью
	МассивТЧДляПроведения = Новый Массив;
	МассивТЧДляПроведения.Добавить("ВыходнойКонтроль");
	МассивТЧДляПроведения.Добавить("Блокировка");
	МассивТЧДляПроведения.Добавить("Уничтожение");
	Для каждого ИмяТЧ из МассивТЧДляПроведения Цикл
		Для каждого Строка из ЭтотОбъект[ИмяТЧ] Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ВидРабочегоМеста) Тогда
				Продолжить;
			КонецЕсли; 
			
			ОперацияТУ = "";
			Если Лев(Строка.ВидРабочегоМеста, 2) = "ТУ" Тогда
				ОперацияТУ = Сред(Строка.ВидРабочегоМеста, 4, СтрДлина(Строка.ВидРабочегоМеста) - 3);
			КонецЕсли;
			ЭтапТУ = Документы.Лико_ДвиженияЗаказаПоЭтапам.ОпределитьЭтапТУПоОперации(ОперацияТУ);
			
			МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = Строка.Дата;
			МенеджерЗаписи.Заказ = ЗаказКлиента;
			МенеджерЗаписи.Площадка = МенеджерЗаписи.Заказ.Площадка;
			МенеджерЗаписи.Количество = Строка.Количество;
			МенеджерЗаписи.Ответственный = Строка.Автор;       
			МенеджерЗаписи.НомерБланка = Строка.НомерБланка;
			Если ИмяТЧ = "ВыходнойКонтроль" Тогда
				Если Строка.ВидРабочегоМеста = "Шобер" Тогда
					МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Упаковка;
					Если Строка.ОткудаПередано = "СМашины" Тогда
						МенеджерЗаписи.Комментарий = "Передано с вырубки шобер на упаковку шобер";
					Иначе
						МенеджерЗаписи.Комментарий = "Передано из заблокированного шобер на упаковку шобер";
					КонецЕсли; 
				ИначеЕсли Лев(Строка.ВидРабочегоМеста, 2) = "ТУ" Тогда
					МенеджерЗаписи.Этап = ЭтапТУ;
					МенеджерЗаписи.Комментарий = "Упаковано на участке ТУ";
				Иначе
					Отказ = Истина;
					Сообщить("В коде ошибка. Обратитесь к программистам"); 
					Прервать;
				КонецЕсли;
			ИначеЕсли ИмяТЧ = "Блокировка" Тогда
				Если Строка.Количество < 0 Тогда
					// для разблокировки писать больше не нужно (20250410 Артамонова на собрании по ТУ)
					Продолжить;
				КонецЕсли;
				Если Строка.ВидРабочегоМеста = "Шобер" Тогда
					МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.КСПМ;
					Если Строка.Количество > 0 Тогда
						МенеджерЗаписи.Комментарий = "Заблокировано на вырубке шобер";
					Иначе
						МенеджерЗаписи.Комментарий = "Разблокировано на вырубке шобер";
					КонецЕсли; 
				ИначеЕсли Лев(Строка.ВидРабочегоМеста, 2) = "ТУ" Тогда
					МенеджерЗаписи.Этап = ЭтапТУ;
					Если Строка.Количество > 0 Тогда
						МенеджерЗаписи.Комментарий = "Заблокировано на участке ТУ";
					Иначе
						МенеджерЗаписи.Комментарий = "Разблокировано на участке ТУ";
					КонецЕсли; 
				Иначе
					Отказ = Истина;
					Сообщить("В коде ошибка. Обратитесь к программистам"); 
					Прервать;
				КонецЕсли;
			ИначеЕсли ИмяТЧ = "Уничтожение" Тогда
				Если Строка.ВидРабочегоМеста = "Шобер" Тогда
					МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Уничтожение;
					МенеджерЗаписи.Комментарий = "Уничтожено из заблокированного шобер";
				ИначеЕсли Лев(Строка.ВидРабочегоМеста, 2) = "ТУ" Тогда
					МенеджерЗаписи.Этап = ЭтапТУ;
					МенеджерЗаписи.Комментарий = "Уничтожено из заблокированного на участке ТУ";
				Иначе
					Отказ = Истина;
					Сообщить("В коде ошибка. Обратитесь к программистам"); 
					Прервать;
				КонецЕсли;
			Иначе
				Отказ = Истина;
				Сообщить("В коде ошибка. Обратитесь к программистам"); 
				Прервать;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.НомерПриложения) Тогда
				МенеджерЗаписи.Комментарий = МенеджерЗаписи.Комментарий + " (прил. " + Строка.НомерПриложения + ")";
			КонецЕсли;
			
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				Сообщить("Не удалось добавить запись в регистр ""лк Этапы заказа"": " + ОписаниеОшибки());
				Отказ = Истина;
				ВызватьИсключение;
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Линкс Тогда
		Для каждого Строка из ЭтотОбъект.Перемотка Цикл
			Если ЗначениеЗаполнено(Строка.Сотрудник) И ЗначениеЗаполнено(Строка.ТипОперации) Тогда
				//Первая перемотка на РЦ должна быть с настройкой
				ЕстьНастройка = ЭтотОбъект.Перемотка.НайтиСтроки(Новый Структура("РабочийЦентр,КоличествоНастроек",Строка.РабочийЦентр,1));
				Если ЕстьНастройка.Количество() = 0 Тогда
					СтрокиРЦ = ЭтотОбъект.Перемотка.НайтиСтроки(Новый Структура("РабочийЦентр",Строка.РабочийЦентр));
					СтрПересчета = СтрокиРЦ[0];
					Для каждого Стр из СтрокиРЦ Цикл
						СтрПересчета = ?(Стр.Дата < СтрПересчета.Дата,Стр,СтрПересчета); 	
					КонецЦикла; 
					СтрПересчета.КоличествоНастроек = 1;
					Документы.Лико_ДвиженияЗаказаПоЭтапам.ПересчитатьВыработкуПеремотки(ЗаказКлиента,СтрПересчета);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.Проведен Тогда
		// Очистим движения регистра Лико_ЭтапыЗаказа, чтобы они перезаполнились в обработке проведения
		МассивТЧДляПроведения = Новый Массив;
		МассивТЧДляПроведения.Добавить("ВыходнойКонтроль");
		МассивТЧДляПроведения.Добавить("Блокировка");
		МассивТЧДляПроведения.Добавить("Уничтожение");
		Для каждого ИмяТЧ из МассивТЧДляПроведения Цикл
			Для каждого Строка из Ссылка[ИмяТЧ] Цикл
				Если НЕ ЗначениеЗаполнено(Строка.ВидРабочегоМеста) Тогда
					Продолжить;
				КонецЕсли;
				МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = Строка.Дата;
				МенеджерЗаписи.Заказ = ЗаказКлиента;
				МенеджерЗаписи.Площадка = МенеджерЗаписи.Заказ.Площадка;
				МенеджерЗаписи.Прочитать();
				Если ИмяТЧ = "ВыходнойКонтроль" Тогда
					ТекЭтап = Справочники.Лико_ЭтапыВыполненияЗаказа.Упаковка;
				ИначеЕсли ИмяТЧ = "Блокировка" Тогда
					ТекЭтап = Справочники.Лико_ЭтапыВыполненияЗаказа.КСПМ;
				ИначеЕсли ИмяТЧ = "Уничтожение" Тогда
					ТекЭтап = Справочники.Лико_ЭтапыВыполненияЗаказа.Уничтожение;
				Иначе
					Отказ = Истина;
					Сообщить("В коде ошибка. Обратитесь к программистам"); 
					Прервать;
				КонецЕсли;
				Если МенеджерЗаписи.Этап = ТекЭтап Тогда
					Попытка
						МенеджерЗаписи.Удалить();	
					Исключение
						Сообщить("Не удалось удалить запись из регистра ""лк Этапы заказа"": " + ОписаниеОшибки());
						Отказ = Истина;
						ВызватьИсключение;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив; 
	СтрокиБезКоличества = Перемотка.НайтиСтроки(Новый Структура("Количество",0));
	ОтключитьПроверкуКоличества = Истина;
	Для каждого Стр из СтрокиБезКоличества Цикл
		Если Стр.ТипОперации <> Справочники.Лико_ТипыОперацийПеремотка.ИсправлениеБрака Тогда
			ОтключитьПроверкуКоличества = Ложь;	
		КонецЕсли;
	КонецЦикла;
	Если ОтключитьПроверкуКоличества Тогда
		Для каждого Стр из Перемотка Цикл
			Если Стр.ТипОперации = Справочники.Лико_ТипыОперацийПеремотка.ИсправлениеБрака Тогда 
				МассивНепроверяемыхРеквизитов.Добавить("Перемотка.Количество");
				ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
