

Функция СоздатьРеквизитФормыТЗ(ЭтаФорма,ТЗ,НазваниеРеквизита) Экспорт  //+Лико m.shenderov 22.11.2021
	ДобавляемыеРеквизиты = Новый Массив();
	УдаляемыеРеквизиты   = Новый Массив();
	
	НоваяТаблица= Новый РеквизитФормы(НазваниеРеквизита,Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(НоваяТаблица);
	
	Для каждого  РеквизитМассива Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если РеквизитМассива.Имя=НазваниеРеквизита Тогда
			УдаляемыеРеквизиты.Добавить(НазваниеРеквизита);
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавляемые реквизиты: колонки новой таблицы значений
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(Колонка.ТипЗначения);
		НоваяКолонка = Новый РеквизитФормы(
		Колонка.Имя,
		Новый ОписаниеТипов(МассивТипов),
		НазваниеРеквизита
		);
		ДобавляемыеРеквизиты.Добавить(НоваяКолонка);
	КонецЦикла;
	
	// Удаляем старые реквизиты и добавляем новые
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// Присваиваем новое значение реквизиту формы
	ЭтаФорма.ЗначениеВРеквизитФормы(ТЗ, НазваниеРеквизита);	
	
	
КонецФункции //-Лико m.shenderov 22.11.2021 

Процедура СоздатьЭлементФормыТаблица(ЭтаФорма,ТЗ,НазваниеРеквизита,Родитель="") Экспорт
	
	СоздатьРеквизитФормыТЗ(ЭтаФорма,ТЗ,НазваниеРеквизита);
	
	// Удаляем таблицу с формы
	ЭлементТаблица = ЭтаФорма.Элементы.Найти(НазваниеРеквизита);
	Если ЭлементТаблица <> Неопределено Тогда
		ЭтаФорма.Элементы.Удалить(ЭлементТаблица);       
	КонецЕсли;    
	// И добавляем ее заново
	ЭлементТаблица = ЭтаФорма.Элементы.Добавить(НазваниеРеквизита, Тип("ТаблицаФормы"),Родитель);
	ЭлементТаблица.ПутьКДанным         		= НазваниеРеквизита;
	ЭлементТаблица.Отображение          	= ОтображениеТаблицы.Список;
	ЭлементТаблица.ИзменятьСоставСтрок  	= Истина;
	ЭлементТаблица.ИзменятьПорядокСтрок 	= Истина;
	ЭлементТаблица.ПоложениеКоманднойПанели	=ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	
	
	// Выводим на форму колонки таблицы
	ЭлементТаблица = ЭтаФорма.Элементы[НазваниеРеквизита];
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		НовыйЭлементФормы             = ЭтаФорма.Элементы.Добавить(НазваниеРеквизита + Колонка.Имя,	Тип("ПолеФормы"),ЭлементТаблица);
		НовыйЭлементФормы.Вид         = ВидПоляФормы.ПолеВвода;
		НовыйЭлементФормы.ПутьКДанным = НазваниеРеквизита+"." + Колонка.Имя;
		
		УстановитьСвойстваДляТаблицыЗаглушка(ЭлементТаблица,НовыйЭлементФормы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСвойстваДляТаблицыЗаглушка(ЭлементТаблица,НовыйЭлементФормы) //+Лико m.shenderov 22.11.2021
	
	Если Лев(ЭлементТаблица.Имя,8)="Заглушка" Тогда
		
		НовыйЭлементФормы.ПоложениеЗаголовка =ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлементФормы.отображатьВШапке   =Ложь;
		НовыйЭлементФормы.отображатьВПодвале =Ложь;
		ЦветЗаглушки                         =ЦветаСтиля.ЦветРамки;
		НовыйЭлементФормы.ЦветФонаЗаголовка  =ЦветЗаглушки;
		ЭлементТаблица.ЦветФона              =ЦветЗаглушки;
		ЭлементТаблица.Шапка                 =Ложь;
		
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 22.11.2021

Функция ПолучитьЭлементФормыТаблица(ЭтаФорма,ТЗ,НазваниеРеквизита,Родитель="") Экспорт
	
	СоздатьРеквизитФормыТЗ(ЭтаФорма,ТЗ,НазваниеРеквизита);
	
	// Удаляем таблицу с формы
	ЭлементТаблица = ЭтаФорма.Элементы.Найти(НазваниеРеквизита);
	Если ЭлементТаблица <> Неопределено Тогда
		ЭтаФорма.Элементы.Удалить(ЭлементТаблица);       
	КонецЕсли;    
	// И добавляем ее заново
	ЭлементТаблица = ЭтаФорма.Элементы.Добавить(НазваниеРеквизита, Тип("ТаблицаФормы"),Родитель);
	ЭлементТаблица.ПутьКДанным         		= НазваниеРеквизита;
	ЭлементТаблица.Отображение          	= ОтображениеТаблицы.Список;
	ЭлементТаблица.ИзменятьСоставСтрок  	= Истина;
	ЭлементТаблица.ИзменятьПорядокСтрок 	= Истина;
	ЭлементТаблица.ПоложениеКоманднойПанели	=ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	
	
	// Выводим на форму колонки таблицы
	ЭлементТаблица = ЭтаФорма.Элементы[НазваниеРеквизита];
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		НовыйЭлементФормы             = ЭтаФорма.Элементы.Добавить(НазваниеРеквизита + Колонка.Имя,	Тип("ПолеФормы"),ЭлементТаблица);
		НовыйЭлементФормы.Вид         = ВидПоляФормы.ПолеВвода;
		НовыйЭлементФормы.ПутьКДанным = НазваниеРеквизита+"." + Колонка.Имя;
		
		УстановитьСвойстваДляТаблицыЗаглушка(ЭлементТаблица,НовыйЭлементФормы);
		
	КонецЦикла;
	
	Возврат ЭлементТаблица;
	
	
КонецФункции





