
&НаСервере
Процедура Лико_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Параметры.Объект) Тогда
		Сообщить("Не удалось определить владельца контактной информации");
		Возврат;
	КонецЕсли;
	
	ВладелецКИ = Параметры.Объект;
	
	ЭтаФорма.Заголовок = "Выберите адрес";
	Элементы.ГруппаКонтактнаяИнформация.Заголовок = "Адреса (" + ВладелецКИ + ")";
	
	ИсключаемыеВиды = ЗаполнитьИсключаемыеВидыКИ();
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ДополнительныеПараметрыКИ = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформацией();
	ДополнительныеПараметрыКИ.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтактнаяИнформация");
	ДополнительныеПараметрыКИ.Вставить("ПоложениеЗаголовкаКИ", ПоложениеЗаголовкаЭлементаФормы.Лево);
	ДополнительныеПараметрыКИ.Вставить("СкрываемыеВиды", ИсключаемыеВиды);
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, ВладелецКИ, ДополнительныеПараметрыКИ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	Элементы.ГруппаКонтактнаяИнформация.ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.Справочники.Контрагенты);
	
	Для каждого Элемент из Элементы["ГруппаЗначенияКИГруппаКонтактнаяИнформация"].ПодчиненныеЭлементы Цикл
		НужноеИмяГруппы = "ГруппаКонтактнаяИнформацияПоле";
		Если СтрНачинаетсяС(Элемент.Имя, НужноеИмяГруппы) Тогда
			// Добавляем кнопку "Выбрать"
			ИмяРеквизита = Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина(НужноеИмяГруппы));
			
			Если Элемент.ПодчиненныеЭлементы.Количество() = 1 Тогда // Это гипперссылка
				// Добавляем декорацию, чтобы кнопка "Выбрать" не уехала влево
				НовыйЭлемент = Элементы.Добавить("ДекорацияНадпись_" + ИмяРеквизита, Тип("ДекорацияФормы"), Элемент);
				НовыйЭлемент.Заголовок = "";
				НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
			КонецЕсли;
			
			НоваяКоманда = Команды.Добавить("ВыбратьАдрес_" + ИмяРеквизита);
			НоваяКоманда.Действие = "КомандаВыбратьАдрес"; 
			НоваяКоманда.Картинка = БиблиотекаКартинок.ВыполненоУспешно;
			НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
			
			НовыйЭлемент = Элементы.Добавить("КнопкаВыбрать_" + ИмяРеквизита, Тип("КнопкаФормы"), Элемент);
			НовыйЭлемент.Заголовок = "Выбрать";
			НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
			НовыйЭлемент.ТолькоВоВсехДействиях = Ложь;
			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
