
#Область Лико_Доработки

 &НаКлиенте
 Процедура Лико_ШтрихкодДокумента(Команда) //+Лико m.shenderov 26.02.2018 	 
	 	//Вставить содержимое обработчика.
	Если Элементы.СписокДокументыПереработки.ТекущиеДанные<>Неопределено тогда	
	ПараметрыФормы = Новый Структура("Объект", Элементы.СписокДокументыПереработки.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Обработка.СА_ШтрихКодыДокументов.Форма.ФормаПривязкиШтрихКодаУпр", ПараметрыФормы, ЭтаФорма, , ,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    КонецЕсли;
	 
 КонецПроцедуры //-Лико m.shenderov 26.02.2018
  &НаКлиенте
 Процедура Лико_СканАрхив(Команда) //+Лико m.shenderov 26.02.2018 	 
	 	//Вставить содержимое обработчика.
	Если Элементы.СписокДокументыПереработки.ТекущиеДанные<>Неопределено тогда	
	ПараметрыФормы = Новый Структура("Объект", Элементы.СписокДокументыПереработки.ТекущиеДанные.Ссылка);
  ОткрытьФорму("Обработка.СА_ПросмотрСканОбраза.Форма.ФормаУправляемая", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

    КонецЕсли;
	 
 КонецПроцедуры //-Лико m.shenderov 26.02.2018

&НаСервере
 Процедура Лико_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		 	 //+ Лико m.shenderov 09.02.2022
	ТекстЗапроса=СписокДокументыПереработки.ТекстЗапроса;
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"РеестрДокументовПереопределяемый.Проведен КАК Проведен,",
	"РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	|РеестрДокументовПереопределяемый.Лико_Сканы КАК Сканы,");
	СписокДокументыПереработки.ТекстЗапроса=ТекстЗапроса;
	//Элементы.Удалить(Элементы.СписокДокументыПродажиСсылка); 	
	Элемент				= Элементы.Добавить("СписокДокументыПереработкиСканы", Тип("ПолеФормы"),Элементы.СписокДокументыПереработки);
	Элемент.Вид 		= ВидПоляФормы.ПолеФлажка;
	Элемент.Заголовок   = "Сканы";
	Элемент.ПутьКДанным = "СписокДокументыПереработки.Сканы";
	//- Лико m.shenderov 09.02.2022

 КонецПроцедуры

 Процедура Лико_СписокДокументыПереработкиПриПолученииДанныхНаСервереВместо(ИмяЭлемента, Настройки, Строки)
	 //Вставить содержимое обработчика
 КонецПроцедуры

 
 &НаСервере
&Вместо("НастроитьФормуПоВыбраннымОперациямИДокументам")
 Процедура Лико_НастроитьФормуПоВыбраннымОперациямИДокументам(ТЗХозОперацииИТипыДокументов)

	 ДанныеРабочегоМеста = ОбщегоНазначенияУТ.ДанныеРабочегоМеста(ТЗХозОперацииИТипыДокументов,
	 КлючНазначенияФормыПоУмолчанию(), НСтр("ru = 'Документы приема и передачи в переработку (все)';
	 |en = 'Subcontracting services received and delivered — All documents'"));

	 Заголовок = ДанныеРабочегоМеста.ЗаголовокРабочегоМеста;

	 КлючНазначенияИспользования = ДанныеРабочегоМеста.КлючНазначенияИспользования;
	 ОбновитьНавигационнуюСсылку();

	 УстановитьОтборыДинамическихСписков();
	 //ОбновитьГиперссылкуКОформлению();
	 УстановитьВидимостьДоступность();

	 ОбщегоНазначенияУТ.ЗаменитьПолеСсылкаКонструкциейВыразитьПоТипамДокументов(Элементы.СписокДокументыПереработки, 
	 ХозяйственныеОперацииИДокументы);

	 ОбщегоНазначенияУТ.СформироватьНадписьОтбор(Элементы.ИнформационнаяНадписьОтбор.Заголовок,
	 ХозяйственныеОперацииИДокументы, ОтборТипыДокументов, ОтборХозяйственныеОперации);
	 НастроитьКнопкиУправленияДокументами();

 КонецПроцедуры



#КонецОбласти