
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заказ") И Параметры.Свойство("ВалФорма") Тогда
		Объект.ВидОперации = Перечисления.Лико_ВидыОперацийЗаявокНаГравировку.Гравировка;		
		Объект.ЗаказКлиента = Параметры.Заказ;
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Организация = Параметры.Заказ.Площадка.Организация;
		Объект.Площадка = Параметры.Заказ.Площадка;
		Для Каждого ЭлМассива Из Параметры.ВалФорма Цикл
			НоваяСтрока = Объект.Валы.Добавить();
			НоваяСтрока.Вал = ЭлМассива.Вал;
			НоваяСтрока.Форма = ЭлМассива.Форма;
		КонецЦикла;
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеЦветаВалФорма() 
	
	МассивУсловногоОформленияВалФорма = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ВалыВал" ИЛИ Строка(Элемент.Поля) = "ВалыФорма" Тогда
			МассивУсловногоОформленияВалФорма.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияВалФорма Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Для каждого Стр Из Объект.Валы Цикл
		Если ЗначениеЗаполнено(Стр.Вал) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВалыВал");
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.НомерСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.НомерСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.Вал");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Вал.Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Форма) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВалыФорма");
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.НомерСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.НомерСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Валы.Форма");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Форма.Код);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
Процедура ВалыВалПриИзменении(Элемент)
	ДобавитьУсловноеОформлениеЦветаВалФорма();
КонецПроцедуры


&НаКлиенте
Процедура ВалыФормаПриИзменении(Элемент)
	ДобавитьУсловноеОформлениеЦветаВалФорма();
КонецПроцедуры


&НаКлиенте
Процедура ВалыПриИзменении(Элемент)
	ДобавитьУсловноеОформлениеЦветаВалФорма();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан ""Вид операции""";
		Сообщение.Поле = "ВидОперации"; //имя реквизита 
		Сообщение.ПутьКДанным = "Объект.ВидОперации";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	Для Каждого Стр Из Объект.Валы Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Вал) Тогда
			Сообщить("Вид операции - " + Объект.ВидОперации + ". Не заполнен Вал в строке " + Стр.НомерСтроки + ". Заполните или удалите строку");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.Форма) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Лико_ВидыОперацийЗаявокНаГравировку.Гравировка") Тогда
			Сообщить("Вид операции - " + Объект.ВидОперации + ". Не заполнеа Форма в строке " + Стр.НомерСтроки + ". Заполните или удалите строку");
			Отказ = Истина;
		КонецЕсли;
	Конеццикла; 
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

