
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Задание складскому работнику
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПечатьДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	////КомандаПечати.СразуНаПринтер = Истина;	
	//
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	"ПечатьДокумента",
		//	НСтр("ru = 'ПечатьДокумента'"),
		//	ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
КонецФункции
#КонецОбласти


#Область Отчеты

/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	//--> Маковеева А.Ю.
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	//<-- Маковеева А.Ю.
	
КонецПроцедуры

#КонецОбласти


#Область Прочее

#КонецОбласти

Функция ОпределениеРазмераПолимера(Заказ) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Длина",0);
	СТруктура.Вставить("Ширина",0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ПараметрыШтампа.Номенклатура,
	|	Лико_ПараметрыШтампа.ТипШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка Как ширинаРулона,
	|	Лико_ПараметрыШтампа.ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи,
	|	Лико_ПараметрыШтампа.РучьиМин,
	|	Лико_ПараметрыШтампа.Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКольеретки,
	|	Лико_ПараметрыШтампа.ШиринаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаКольеретки,
	|	Лико_ПараметрыШтампа.НаправлениеНамотки,
	|	Лико_ПараметрыШтампа.Цена,
	|	Лико_ПараметрыШтампа.ПорядковыйНомерШтанцыНаВалу,
	|	Лико_ПараметрыШтампа.ШиринаПоНожам,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками,
	|	Лико_ПараметрыШтампа.ШагПоНарезке,
	|	Лико_ПараметрыШтампа.ШагПоРаппорту,
	|	Лико_ПараметрыШтампа.Артикул,
	|	Лико_ПараметрыШтампа.Материал,
	|	Лико_ПараметрыШтампа.ИмяФайлаЧертежа,
	|	Лико_ПараметрыШтампа.Комментарий
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ЗаказКлиента.ШтампВырубной = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Заказ );
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ПараметрыШтампа = РезультатЗапроса.Выбрать();
	Пока ПараметрыШтампа.Следующий() Цикл
		
		Нарезка=ПараметрыШтампа.ШиринаРулона.Размер;
		Если ЗначениеЗаполнено(ПараметрыШтампа.Z) Тогда
			Раппорт=ПараметрыШтампа.Z.КоличествоЗубьев * 3.175;
			Дистроция=1-6.265/(раппорт + 3.14);
			Структура.Ширина = Раппорт*Дистроция + 10;  
			Структура.Длина = Нарезка+2;
			
			//		Структура.Длинна= (ПараметрыШтампа.Z.КоличествоЗубьев*3.175/10+0.025);
			//		Структура.Ширина=?(ПараметрыШтампа.ШиринаПоНожам=0,(Нарезка+0.02),ПараметрыШтампа.ШиринаПоНожам)/10; //По два миллиметра по краям
		Иначе 
			Если ЗначениеЗаполнено(ПараметрыШтампа.ШагПечати) Тогда			
				Структура.Ширина =ПараметрыШтампа.ШагПечати*1000+10;
				СТруктура.Длина=Нарезка+2;
			КонецЕсли;
		КонецЕсли;       
		
		
		
		
		
	КонецЦикла; 
	
	Возврат Структура;
	
КонецФункции


// Запись в форму угла поворота растра по умолчанию
//
// Описание:
//
//
// Параметры Форма- СпрвочникСсылка.Лико_Формы - 
//
Процедура ЗаписатьУголПоворотаРастра(Форма) Экспорт 
	ФормаОбъект=Форма.ПолучитьОбъект();
	УголПоворотаПоУмолчанию=Справочники.Лико_УглыПоворотаРастра.НайтиПоРеквизиту("ТипЦвета",ФормаОбъект.ТипЦвета);
	Если ЗначениеЗаполнено(УголПоворотаПоУмолчанию) Тогда
		ФормаОбъект.УголПоворотаРастра=УголПоворотаПоУмолчанию;
	Иначе
		ФормаОбъект.УголПоворотаРастра=Справочники.Лико_УглыПоворотаРастра.K;
	КонецЕсли;
	
	
	ФормаОбъект.Записать();
КонецПроцедуры //ЗаписатьУголПоворотаРастра


