#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеПоОснованию

#КонецОбласти

#Область Инициализация

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
		Растр			=150;
		ТолщинаПластины	=1.14;

	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ЗаказКлиента") Тогда
			ЗаполнитьПоЗаказу(ДанныеЗаполнения.ЗаказКлиента);
		КонецЕсли;
		
	КонецЕсли;	
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
КонецПроцедуры

#КонецОбласти

#Область Прочее


Процедура ЗаполнитьПоЗаказу(Заказ)
	
	ЗаказКлиента  = Заказ;
	ИмяФайла 	  = Заказ.ИмяФайла;
	Партнер 	  = Заказ.Партнер;
	Контрагент 	  = Заказ.Контрагент;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//Растр = Заказ.Растр;
	
	Если Заказ.Площадка = Справочники.Лико_Площадки.Сибирь Тогда
		
		//Контрагент=Справочники.Контрагенты.НайтиПоНаименованию("ФлексоЦентр ПАРТНЁР ООО");
		Контрагент=Справочники.Лико_ПредопределенныеЗначения.ПоставщикФормЭкофлекс.ЗначениеПараметра;	
		Поставщик=Контрагент.Партнер;  
		
	КонецЕсли; 
	
	РазмерПолимера=Документы.Лико_ЗаявкаНаИзготовлениеФорм.ОпределениеРазмераПолимера(Заказ);
	//ТолщинаПластины = Заказ.ТолщинаПластины;
	Для Каждого ТекСтрокаЦвета Из Заказ.Цвета Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаЦвета.Форма) и ТекСтрокаЦвета.Цветоделение и 
			//ТекСтрокаЦвета.Форма.ВидПечати=Перечисления.Лико_ВидыПечати.Флексо Тогда
			ТекСтрокаЦвета.Форма.ВидСекции.ВидПечати = Справочники.Лико_ВидыПечати.Флексо Тогда

			НоваяСтрока = Формы.Добавить();
			НоваяСтрока.Форма = ТекСтрокаЦвета.Форма;
			НоваяСтрока.НоваяФорма = Истина;
			НоваяСтрока.Длина  = РазмерПолимера.Длина;
			НоваяСтрока.Ширина = РазмерПолимера.Ширина;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Форма .УголПоворотаРастра) и
				
				Заказ.Площадка = Справочники.Лико_Площадки.Сибирь Тогда
				
				Документы.Лико_ЗаявкаНаИзготовлениеФорм.ЗаписатьУголПоворотаРастра(НоваяСтрока.Форма);
				
			КонецЕсли;			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	Для каждого СтрФорма Из Формы Цикл
		Если НЕ ЗначениеЗаполнено(СтрФорма.Форма.Заказ) Тогда
			СпрОбъект=СтрФорма.Форма.ПолучитьОбъект();
			СпрОбъект.Заказ=ЗаказКлиента;
			СпрОбъект.Записать();			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры






#КонецОбласти

#КонецОбласти

#КонецЕсли










