

//&Вместо("ТекстЗапроса")
//Функция Лико_ТекстЗапроса()  // --> Маковеева А.Ю. 07.06.2023   ВРЕМЕННО
//	
//	#Область ОтборПоСегментуПартнеров
//	ТекстЗапроса = "
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	Сегменты.Партнер КАК Партнер,
//	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
//	|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
//	|ИЗ
//	|	РегистрСведений.ПартнерыСегмента КАК Сегменты
//	|{ГДЕ
//	|	Сегменты.Сегмент.* КАК СегментПартнеров,
//	|	Сегменты.Партнер.* КАК Партнер}
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Партнер,
//	|	ИспользуетсяОтборПоСегментуПартнеров
//	|;";
//	#КонецОбласти
//	
//	#Область ОтборПоСегментуНоменклатуры
//	ТекстЗапроса = ТекстЗапроса + "
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	Сегменты.Номенклатура КАК Номенклатура,
//	|	Сегменты.Характеристика КАК Характеристика,
//	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуНоменклатуры
//	|ПОМЕСТИТЬ ОтборПоСегментуНоменклатуры
//	|ИЗ
//	|	РегистрСведений.НоменклатураСегмента КАК Сегменты
//	|{ГДЕ
//	|	Сегменты.Сегмент.* КАК СегментНоменклатуры,
//	|	Сегменты.Номенклатура.* КАК Номенклатура,
//	|	Сегменты.Характеристика.* КАК Характеристика}
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Номенклатура,
//	|	Характеристика,
//	|	ИспользуетсяОтборПоСегментуНоменклатуры
//	|;";
//	#КонецОбласти
//	
//	#Область ИсходныеПродажи
//	ТекстЗапроса = ТекстЗапроса + "
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ИсходныеПродажи.Регистратор КАК Регистратор,
//	|	ИсходныеПродажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ИсходныеПродажи.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
//	|	ИсходныеПродажи.Подразделение КАК Подразделение,
//	|	ИсходныеПродажи.ВидЗапасов КАК ВидЗапасов,
//	|	ИсходныеПродажи.РазделУчета КАК РазделУчета,
//	|	ИсходныеПродажи.Партия КАК Партия,
//	|	ИсходныеПродажи.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|	ИсходныеПродажи.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
//	|	ИсходныеПродажи.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
//	|	ИсходныеПродажи.КоличествоОборот КАК Количество
//	|ПОМЕСТИТЬ ИсходныеПродажи
//	|ИЗ
//	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, &КонецПериода {(&КонецПериода)}, Регистратор,) КАК
//	|		ИсходныеПродажи
//	|ГДЕ
//	|	ИсходныеПродажи.КоличествоОборот <> 0
//	|	И (&ПоказыватьПродажи = 1
//	|	И ИсходныеПродажи.АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|	ИЛИ &ПоказыватьПродажи = 2
//	|	И ИсходныеПродажи.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|	ИЛИ &ПоказыватьПродажи = 0)
//	|{ГДЕ
//	|	ИсходныеПродажи.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
//	|	ИсходныеПродажи.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
//	|	ИсходныеПродажи.АналитикаУчетаНоменклатуры.МестоХранения.* КАК Склад,
//	|	((ИсходныеПродажи.АналитикаУчетаНоменклатуры.Номенклатура, ИсходныеПродажи.АналитикаУчетаНоменклатуры.Характеристика)
//	|		В
//	|		(ВЫБРАТЬ
//	|			ОтборПоСегментуНоменклатуры.Номенклатура,
//	|			ОтборПоСегментуНоменклатуры.Характеристика
//	|		ИЗ
//	|			ОтборПоСегментуНоменклатуры
//	|		ГДЕ
//	|			ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
//	|	(ИсходныеПродажи.АналитикаУчетаПоПартнерам.Партнер В
//	|		(ВЫБРАТЬ
//	|			ОтборПоСегментуПартнеров.Партнер
//	|		ИЗ
//	|			ОтборПоСегментуПартнеров
//	|		ГДЕ
//	|			ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)),
//	|	(ЕСТЬNULL(ИсходныеПродажи.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка))).* КАК Сделка,
//	|	ИсходныеПродажи.Договор.* КАК Договор,
//	|	(ВЫБОР
//	|		КОГДА ИсходныеПродажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Контрагенты
//	|			ТОГДА ИсходныеПродажи.АналитикаУчетаПоПартнерам.Контрагент
//	|		ИНАЧЕ NULL
//	|	КОНЕЦ).* КАК Контрагент,
//	|	(ВЫБОР
//	|		КОГДА ИсходныеПродажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
//	|			ТОГДА ИсходныеПродажи.АналитикаУчетаПоПартнерам.Контрагент
//	|		ИНАЧЕ NULL
//	|	КОНЕЦ).* КАК Покупатель,
//	|	ИсходныеПродажи.ХозяйственнаяОперация.*,
//	|	ИсходныеПродажи.АналитикаУчетаПоПартнерам.Организация.* КАК Организация,
//	|	ИсходныеПродажи.АналитикаУчетаПоПартнерам.Партнер.* КАК Партнер,
//	|	(ЕСТЬNULL(ИсходныеПродажи.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка))).* КАК Сделка,
//	|	(ЕСТЬNULL(ИсходныеПродажи.ЗаказКлиента.Сделка.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))).* КАК
//	|		МенеджерСделки,
//	|	(ВЫБОР
//	|		КОГДА ИсходныеПродажи.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
//	|			ТОГДА ЕСТЬNULL(ИсходныеПродажи.ЗаказКлиента.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
//	|		ИНАЧЕ ИсходныеПродажи.Менеджер
//	|	КОНЕЦ).* КАК Менеджер,
//	|	(ВЫБОР
//	|		КОГДА ИсходныеПродажи.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|			ТОГДА ИсходныеПродажи.ВидЗапасов.ВладелецТовара
//	|		ИНАЧЕ ИсходныеПродажи.АналитикаУчетаПартий.Поставщик
//	|	КОНЕЦ).* КАК Поставщик,
//	|	ИсходныеПродажи.ВидЗапасов.ГруппаФинансовогоУчета.* КАК ГруппаФинансовогоУчета,
//	|	(ВЫБОР
//	|		КОГДА НЕ ИсходныеПродажи.ЗаказКлиента.Сделка.ВидСделки ЕСТЬ NULL
//	|			ТОГДА ИсходныеПродажи.ЗаказКлиента.Сделка.ВидСделки.Наименование
//	|		КОГДА ИсходныеПродажи.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
//	|		ИЛИ ИсходныеПродажи.ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
//	|			ТОГДА &СтрокаПродажиПоЗаказам
//	|		ИНАЧЕ &СтрокаПродажиБезЗаказов
//	|	КОНЕЦ) КАК ВидСделки}
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	АналитикаУчетаНоменклатуры,
//	|	АналитикаУчетаПоПартнерам,
//	|	Подразделение,
//	|	ВидЗапасов,
//	|	РазделУчета,
//	|	Партия,
//	|	АналитикаУчетаПартий,
//	|	АналитикаФинансовогоУчета,
//	|	ВидДеятельностиНДС
//	|;";
//	
//	#КонецОбласти
//	
//	#Область ОстаткиИДвижения
//	ТекстЗапроса = ТекстЗапроса + "
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	0 КАК НаборДанных,
//	|	Таблица.Регистратор,
//	|	
//	|	Таблица.ПериодСекунда,
//	|	Таблица.ПериодДень,
//	|	Таблица.ПериодНеделя,
//	|	Таблица.ПериодДекада,
//	|	Таблица.ПериодМесяц,
//	|	Таблица.ПериодКвартал,
//	|	Таблица.ПериодПолугодие,
//	|	Таблица.ПериодГод,
//	|	
//	|	СУММА(Таблица.Количество) КАК Количество,
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.Выручка)
//	|		КОГДА &ДанныеОтчета = 2 ИЛИ &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.ВыручкаБезНДС)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.ВыручкаРеглБезНДС)
//	|		ИНАЧЕ СУММА(Таблица.ВыручкаБезНДС)
//	|	КОНЕЦ КАК Выручка,
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.ВыручкаРегл) - СУММА(Таблица.ВыручкаРеглБезНДС)
//	|		ИНАЧЕ
//	|			СУММА(Таблица.Выручка) - СУММА(Таблица.ВыручкаБезНДС)
//	|	КОНЕЦ КАК ВыручкаНДС,
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.СуммаРучнойСкидкиОборот)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаРучнойСкидки,
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.СуммаАвтоматическойСкидкиОборот)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаАвтоматическойСкидки,
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.СуммаРучнойСкидкиОборот)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ + ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.СуммаАвтоматическойСкидкиОборот)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК ВсегоСкидок,
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.Себестоимость)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.СебестоимостьБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.СебестоимостьУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.СебестоимостьРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.СебестоимостьБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.СебестоимостьУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Себестоимость,
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.ДопРасходы)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.ДопРасходыБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.ДопРасходыУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.ДопРасходыРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.ДопРасходыБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.ДопРасходыУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ДопРасходы,
//	|	
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.Трудозатраты)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.Трудозатраты)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.ТрудозатратыУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.ТрудозатратыРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.Трудозатраты)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.ТрудозатратыУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Трудозатраты,
//	|	
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеСНДС)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.ПостатейныеПостоянныеРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ПостатейныеПостоянные,
//	|	
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеСНДС)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.ПостатейныеПеременныеРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ПостатейныеПеременные,
//	|	
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.РасходыНаПродажуСНДС)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.РасходыНаПродажуБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.РасходыНаПродажуУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.РасходыНаПродажуРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.РасходыНаПродажуБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.РасходыНаПродажуУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК РасходыНаПродажу,
//	|
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА 0
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА 0
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.РезервПодОбесценениеУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.РезервПодОбесценениеРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				0
//	|			ИНАЧЕ
//	|				СУММА(Таблица.РезервПодОбесценениеУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК РезервПодОбесценение,
//	|	
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.СебестоимостьПредварительная)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.СебестоимостьПредварительнаяБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.СебестоимостьПредварительнаяУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.СебестоимостьПредварительнаяРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.СебестоимостьПредварительнаяБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.СебестоимостьПредварительнаяУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК СебестоимостьПредварительная,
//	|	
//	|	ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.Себестоимость)
//	|			+ СУММА(Таблица.ДопРасходы)
//	|			+ СУММА(Таблица.Трудозатраты)
//	|			+ СУММА(Таблица.ПостатейныеПостоянныеСНДС)
//	|			+ СУММА(Таблица.ПостатейныеПеременныеСНДС)
//	|			- СУММА(Таблица.СебестоимостьПредварительная)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.СебестоимостьБезНДС)
//	|			+ СУММА(Таблица.ДопРасходыБезНДС)
//	|			+ СУММА(Таблица.Трудозатраты)
//	|			+ СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|			+ СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|			- СУММА(Таблица.СебестоимостьПредварительнаяБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.СебестоимостьУпр)
//	|			+ СУММА(Таблица.ДопРасходыУпр)
//	|			+ СУММА(Таблица.ТрудозатратыУпр)
//	|			+ СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|			+ СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|			+ СУММА(Таблица.РезервПодОбесценениеУпр)
//	|			- СУММА(Таблица.СебестоимостьПредварительнаяУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.СебестоимостьРегл)
//	|			+ СУММА(Таблица.ДопРасходыРегл)
//	|			+ СУММА(Таблица.ТрудозатратыРегл)
//	|			+ СУММА(Таблица.ПостатейныеПостоянныеРегл)
//	|			+ СУММА(Таблица.ПостатейныеПеременныеРегл)
//	|			+ СУММА(Таблица.РезервПодОбесценениеРегл)
//	|			- СУММА(Таблица.СебестоимостьПредварительнаяРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.СебестоимостьБезНДС)
//	|				+ СУММА(Таблица.ДопРасходыБезНДС)
//	|				+ СУММА(Таблица.Трудозатраты)
//	|				+ СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|				+ СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|				- СУММА(Таблица.СебестоимостьПредварительнаяБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.СебестоимостьУпр)
//	|				+ СУММА(Таблица.ДопРасходыУпр)
//	|				+ СУММА(Таблица.ТрудозатратыУпр)
//	|				+ СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|				+ СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|				+ СУММА(Таблица.РезервПодОбесценениеУпр)
//	|				- СУММА(Таблица.СебестоимостьПредварительнаяУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК СебестоимостьОтклонение,
//	|	
//	|	ВЫБОР
//	|		КОГДА Таблица.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|			ТОГДА 0
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА СУММА(Таблица.Выручка)
//	|			- СУММА(Таблица.Себестоимость)
//	|			- СУММА(Таблица.ДопРасходы)
//	|			- СУММА(Таблица.Трудозатраты)
//	|			- СУММА(Таблица.ПостатейныеПостоянныеСНДС)
//	|			- СУММА(Таблица.ПостатейныеПеременныеСНДС)
//	|			- СУММА(Таблица.РасходыНаПродажуСНДС)
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА СУММА(Таблица.ВыручкаБезНДС)
//	|			- СУММА(Таблица.СебестоимостьБезНДС)
//	|			- СУММА(Таблица.ДопРасходыБезНДС)
//	|			- СУММА(Таблица.Трудозатраты)
//	|			- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|			- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|			- СУММА(Таблица.РасходыНаПродажуБезНДС)
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА СУММА(Таблица.ВыручкаБезНДС)
//	|			- СУММА(Таблица.СебестоимостьУпр)
//	|			- СУММА(Таблица.ДопРасходыУпр)
//	|			- СУММА(Таблица.ТрудозатратыУпр)
//	|			- СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|			- СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|			- СУММА(Таблица.РасходыНаПродажуУпр)
//	|			- СУММА(Таблица.РезервПодОбесценениеУпр)
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА СУММА(Таблица.ВыручкаРеглБезНДС)
//	|			- СУММА(Таблица.СебестоимостьРегл)
//	|			- СУММА(Таблица.ДопРасходыРегл)
//	|			- СУММА(Таблица.ТрудозатратыРегл)
//	|			- СУММА(Таблица.ПостатейныеПостоянныеРегл)
//	|			- СУММА(Таблица.ПостатейныеПеременныеРегл)
//	|			- СУММА(Таблица.РасходыНаПродажуРегл)
//	|			- СУММА(Таблица.РезервПодОбесценениеРегл)
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				СУММА(Таблица.ВыручкаБезНДС)
//	|				- СУММА(Таблица.СебестоимостьБезНДС)
//	|				- СУММА(Таблица.ДопРасходыБезНДС)
//	|				- СУММА(Таблица.Трудозатраты)
//	|				- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|				- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|				- СУММА(Таблица.РасходыНаПродажуБезНДС)
//	|			ИНАЧЕ
//	|				СУММА(Таблица.ВыручкаБезНДС)
//	|				- СУММА(Таблица.СебестоимостьУпр)
//	|				- СУММА(Таблица.ДопРасходыУпр)
//	|				- СУММА(Таблица.ТрудозатратыУпр)
//	|				- СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|				- СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|				- СУММА(Таблица.РасходыНаПродажуУпр)
//	|				- СУММА(Таблица.РезервПодОбесценениеУпр)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК ВаловаяПрибыль,
//	|	ВЫБОР
//	|		КОГДА Таблица.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|			ТОГДА 0
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
//	|					КОГДА СУММА(Таблица.Выручка) <> 0
//	|						ТОГДА (СУММА(Таблица.Выручка)
//	|							- СУММА(Таблица.Себестоимость)
//	|							- СУММА(Таблица.ДопРасходы)
//	|							- СУММА(Таблица.Трудозатраты)
//	|							- СУММА(Таблица.ПостатейныеПостоянныеСНДС)
//	|							- СУММА(Таблица.ПостатейныеПеременныеСНДС)
//	|							- СУММА(Таблица.РасходыНаПродажуСНДС)
//	|						) / ВЫБОР КОГДА СУММА(Таблица.Выручка) > 0
//	|								ТОГДА СУММА(Таблица.Выручка)
//	|								ИНАЧЕ -1*СУММА(Таблица.Выручка)
//	|							КОНЕЦ
//	|					ИНАЧЕ 0
//	|				КОНЕЦ * 100 КАК ЧИСЛО(31,2))
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
//	|					КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
//	|						ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
//	|							- СУММА(Таблица.СебестоимостьБезНДС)
//	|							- СУММА(Таблица.ДопРасходыБезНДС)
//	|							- СУММА(Таблица.Трудозатраты)
//	|							- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|							- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|							- СУММА(Таблица.РасходыНаПродажуБезНДС)
//	|						) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
//	|								ТОГДА СУММА(Таблица.ВыручкаБезНДС)
//	|								ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
//	|							КОНЕЦ
//	|					ИНАЧЕ 0
//	|				КОНЕЦ * 100 КАК ЧИСЛО(31,2))
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
//	|					КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
//	|						ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
//	|							- СУММА(Таблица.СебестоимостьУпр)
//	|							- СУММА(Таблица.ДопРасходыУпр)
//	|							- СУММА(Таблица.ТрудозатратыУпр)
//	|							- СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|							- СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|							- СУММА(Таблица.РасходыНаПродажуУпр)
//	|							- СУММА(Таблица.РезервПодОбесценениеУпр)
//	|						) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
//	|								ТОГДА СУММА(Таблица.ВыручкаБезНДС)
//	|								ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
//	|							КОНЕЦ
//	|					ИНАЧЕ 0
//	|				КОНЕЦ * 100 КАК ЧИСЛО(31,2))
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
//	|					КОГДА СУММА(Таблица.ВыручкаРеглБезНДС) <> 0
//	|						ТОГДА (СУММА(Таблица.ВыручкаРеглБезНДС)
//	|							- СУММА(Таблица.СебестоимостьРегл)
//	|							- СУММА(Таблица.ДопРасходыРегл)
//	|							- СУММА(Таблица.ТрудозатратыРегл)
//	|							- СУММА(Таблица.ПостатейныеПостоянныеРегл)
//	|							- СУММА(Таблица.ПостатейныеПеременныеРегл)
//	|							- СУММА(Таблица.РасходыНаПродажуРегл)
//	|							- СУММА(Таблица.РезервПодОбесценениеРегл)
//	|						) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаРеглБезНДС) > 0
//	|								ТОГДА СУММА(Таблица.ВыручкаРеглБезНДС)
//	|								ИНАЧЕ -1*СУММА(Таблица.ВыручкаРеглБезНДС)
//	|							КОНЕЦ
//	|					ИНАЧЕ 0
//	|				КОНЕЦ * 100 КАК ЧИСЛО(31,2)) 
//	|		ИНАЧЕ
//	|			ВЫБОР КОГДА &ПоПредприятию ТОГДА
//	|				ВЫРАЗИТЬ(ВЫБОР
//	|						КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
//	|							ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
//	|								- СУММА(Таблица.СебестоимостьБезНДС)
//	|								- СУММА(Таблица.ДопРасходыБезНДС)
//	|								- СУММА(Таблица.Трудозатраты)
//	|								- СУММА(Таблица.ПостатейныеПостоянныеБезНДС)
//	|								- СУММА(Таблица.ПостатейныеПеременныеБезНДС)
//	|								- СУММА(Таблица.РасходыНаПродажуБезНДС)
//	|							) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
//	|									ТОГДА СУММА(Таблица.ВыручкаБезНДС)
//	|									ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
//	|								КОНЕЦ
//	|						ИНАЧЕ 0
//	|					КОНЕЦ * 100 КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ
//	|				ВЫРАЗИТЬ(ВЫБОР
//	|						КОГДА СУММА(Таблица.ВыручкаБезНДС) <> 0
//	|							ТОГДА (СУММА(Таблица.ВыручкаБезНДС)
//	|								- СУММА(Таблица.СебестоимостьУпр)
//	|								- СУММА(Таблица.ДопРасходыУпр)
//	|								- СУММА(Таблица.ТрудозатратыУпр)
//	|								- СУММА(Таблица.ПостатейныеПостоянныеУпр)
//	|								- СУММА(Таблица.ПостатейныеПеременныеУпр)
//	|								- СУММА(Таблица.РасходыНаПродажуУпр)
//	|								- СУММА(Таблица.РезервПодОбесценениеУпр)
//	|							) / ВЫБОР КОГДА СУММА(Таблица.ВыручкаБезНДС) > 0
//	|									ТОГДА СУММА(Таблица.ВыручкаБезНДС)
//	|									ИНАЧЕ -1*СУММА(Таблица.ВыручкаБезНДС)
//	|								КОНЕЦ
//	|						ИНАЧЕ 0
//	|					КОНЕЦ * 100 КАК ЧИСЛО(31,2))
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Рентабельность,
//	|	ВЫБОР
//	|		КОГДА Таблица.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ПродажиМеждуОрганизациями,
//	|	Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Таблица.Номенклатура КАК Номенклатура,
//	|	Таблица.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
//	|	Таблица.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
//	|	Таблица.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
//	|	&ТекстЗапросаВесНоменклатуры1 КАК НоменклатураВес,
//	|	&ТекстЗапросаОбъемНоменклатуры1 КАК НоменклатураОбъем,
//	|	Таблица.Номенклатура.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
//	|	Таблица.Характеристика КАК Характеристика,
//	|	Таблица.Серия КАК Серия,
//	|	Таблица.Организация КАК Организация,
//	|	Таблица.Продавец КАК Продавец,
//	|	Таблица.Партнер КАК Партнер,
//	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	Таблица.ЗаказКлиента КАК ЗаказКлиента,
//	|	Таблица.Подразделение КАК Подразделение,
//	|	Таблица.Склад КАК Склад,
//	|	Таблица.Контрагент КАК Контрагент,
//	|	Таблица.Покупатель КАК Покупатель,
//	|	Таблица.Поставщик КАК Поставщик,
//	|	Таблица.Менеджер КАК Менеджер,
//	|	Таблица.Сделка КАК Сделка,
//	|	Таблица.МенеджерСделки КАК МенеджерСделки,
//	|	Таблица.ТипЗапасов КАК ТипЗапасов,
//	|	Таблица.ВидЗапасов КАК ВидЗапасов,
//	|	Таблица.РазделУчета КАК РазделУчета,
//	|	Таблица.Партия КАК Партия,
//	|	Таблица.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|	Таблица.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
//	|	Таблица.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
//	|	Таблица.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
//	|	Таблица.ВидСделки,
//	|	Таблица.НаправлениеДеятельностиКонтрагента,
//	|	Таблица.НаправлениеДеятельностиНоменклатуры,
//	|	Таблица.Соглашение,
//	|	Таблица.АналитикаУчетаНаборов,
//	|	ВЫБОР КОГДА &ДанныеОтчета = 4 ТОГДА
//	|		Таблица.Организация.ВалютаРегламентированногоУчета
//	|	ИНАЧЕ
//	|		&ВалютаУправленческогоУчета
//	|	КОНЕЦ КАК Валюта,
//	|
//	|	Таблица.ХозяйственнаяОперация,
//	//--> Маковеева А.Ю. 13.12.2022
//	|	СУММА(Таблица.ВыручкаРегл) КАК ВыручкаРегл, 
//	|	СУММА(Таблица.ВыручкаРеглБезНДС) КАК ВыручкаРеглБезНДС, 
//	|	СУММА(Таблица.ВыручкаБезНДС) КАК ВыручкаБезНДС,    
//	|	СУММА(Таблица.СебестоимостьРегл) КАК СебестоимостьРегл,
//	|	СУММА(Таблица.СебестоимостьУпр) КАК СебестоимостьУпр, 
//	|	СУММА(Таблица.СебестоимостьБезНДС) КАК СебестоимостьБезНДС, 
//	|	СУММА(Таблица.ДопРасходыРегл) КАК ДопРасходыРегл,
//	|	СУММА(Таблица.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
//	|	СУММА(Таблица.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,    
//	|	СУММА(Таблица.ДопРасходыУпр) КАК ДопРасходыУпр,
//	|	СУММА(Таблица.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
//	|	СУММА(Таблица.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр,
//	|	СУММА(Таблица.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
//	|	СУММА(Таблица.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
//	|	СУММА(Таблица.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
//	//<-- Маковеева А.Ю. 13.12.2022
//	|	СУММА(Таблица.КоличествоДляДетализации) КАК КоличествоДляДетализации
//	|{ВЫБРАТЬ
//	|	ЗаказКлиента.*,
//	|	Сделка.*,
//	|	МенеджерСделки,
//	|	Подразделение.*,
//	|	АналитикаУчетаНоменклатуры.*,
//	|	Номенклатура.*,
//	|	Характеристика.*,
//	|	Склад.*,
//	|	Организация.*,
//	|	Продавец.*,
//	|	Партнер.*,
//	|	Контрагент.*,
//	|	Покупатель.*,
//	|	Поставщик.*,
//	|	Менеджер.*,
//	|	ВидЗапасов.*,
//	|	ГруппаФинансовогоУчета.*,
//	|	Регистратор,
//	|	ПериодСекунда,
//	|	ПериодДень,
//	|	ПериодНеделя,
//	|	ПериодДекада,
//	|	ПериодМесяц,
//	|	ПериодКвартал,
//	|	ПериодПолугодие,
//	|	ПериодГод,
//	|	ВидСделки,
//	|	НаправлениеДеятельностиКонтрагента.*,
//	|	НаправлениеДеятельностиНоменклатуры.*,
//	|	Соглашение.*,
//	|	АналитикаУчетаНаборов.*,
//	|	ХозяйственнаяОперация.*,
//	|	Количество,
//	|	Выручка,
//	|	ВыручкаНДС,
//	|	СуммаРучнойСкидки,
//	|	СуммаАвтоматическойСкидки,
//	|	ВсегоСкидок,
//	|	Себестоимость,
//	|	ДопРасходы,
//	|	Трудозатраты,
//	|	ПостатейныеПеременные,
//	|	РасходыНаПродажу,
//	|	РезервПодОбесценение,
//	|	СебестоимостьПредварительная,
//	|	СебестоимостьОтклонение,
//	|	ВаловаяПрибыль,
//	|	Рентабельность,
//	|	ПродажиМеждуОрганизациями,
//	//--> Маковеева А.Ю. 13.12.2022    
//	|	ВыручкаРегл,
//	|	ВыручкаРеглБезНДС,
//	|	ВыручкаБезНДС,    
//	|	СебестоимостьРегл,
//	|	СебестоимостьУпр, 
//	|	СебестоимостьБезНДС, 
//	|	ДопРасходыРегл,
//	|	ПостатейныеПостоянныеРегл,
//	|	ПостатейныеПеременныеРегл,    
//	|	ДопРасходыУпр,
//	|	ПостатейныеПостоянныеУпр,
//	|	ПостатейныеПеременныеУпр,
//	|	ДопРасходыБезНДС,
//	|	ПостатейныеПостоянныеБезНДС,
//	|	ПостатейныеПеременныеБезНДС,
//	//<-- Маковеева А.Ю. 13.12.2022
//	|	КоличествоДляДетализации}
//	|
//	|ПОМЕСТИТЬ ОстаткиИДвижения
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ВЫБОР
//	|			КОГДА Продажи.Регистратор = НЕОПРЕДЕЛЕНО
//	|				ТОГДА NULL
//	|			ИНАЧЕ Продажи.Регистратор
//	|		КОНЕЦ КАК Регистратор,
//	|		
//	|		Продажи.Период                           КАК ПериодСекунда,
//	|		НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ)      КАК ПериодДень,
//	|		НАЧАЛОПЕРИОДА(Продажи.Период, НЕДЕЛЯ)    КАК ПериодНеделя,
//	|		НАЧАЛОПЕРИОДА(Продажи.Период, ДЕКАДА)    КАК ПериодДекада,
//	|		НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ)     КАК ПериодМесяц,
//	|		НАЧАЛОПЕРИОДА(Продажи.Период, КВАРТАЛ)   КАК ПериодКвартал,
//	|		НАЧАЛОПЕРИОДА(Продажи.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
//	|		НАЧАЛОПЕРИОДА(Продажи.Период, ГОД)       КАК ПериодГод,
//	|		
//	|		ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)) КАК Сделка,
//	|		ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК МенеджерСделки,
//	|		ВЫБОР
//	|			КОГДА Продажи.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
//	|				ТОГДА ЕСТЬNULL(Продажи.ЗаказКлиента.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
//	|			ИНАЧЕ Продажи.Менеджер
//	|		КОНЕЦ КАК Менеджер,
//	|		Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|		Продажи.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
//	|		Продажи.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
//	|		Продажи.АналитикаУчетаНоменклатуры.Серия КАК Серия,
//	|		Продажи.АналитикаУчетаПоПартнерам.Организация КАК Организация,
//	|		Продажи.АналитикаУчетаПоПартнерам.Организация КАК Продавец,
//	|		Продажи.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,  
//	|		Продажи.АналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|		Продажи.ТипЗапасов КАК ТипЗапасов,
//	|		Продажи.ВидЗапасов КАК ВидЗапасов,
//	|		Продажи.ВидЗапасов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
//	|		Продажи.РазделУчета КАК РазделУчета,
//	|		Продажи.Партия КАК Партия,
//	|		Продажи.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|		Продажи.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
//	|		Продажи.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
//	|		Продажи.Подразделение КАК Подразделение,
//	|		Продажи.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
//	|		ВЫБОР
//	|			КОГДА Продажи.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА Продажи.ВидЗапасов.ВладелецТовара
//	|		ИНАЧЕ
//	|			Продажи.АналитикаУчетаПартий.Поставщик
//	|		КОНЕЦ КАК Поставщик,
//	|		Продажи.ЗаказКлиента КАК ЗаказКлиента,
//	|		ВЫБОР
//	|			КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Контрагенты
//	|				ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
//	|			ИНАЧЕ NULL
//	|		КОНЕЦ КАК Контрагент,
//	|		ВЫБОР
//	|			КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
//	|				ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
//	|			ИНАЧЕ NULL
//	|		КОНЕЦ КАК Покупатель,
//	|		ВЫБОР
//	|			КОГДА НЕ Продажи.ЗаказКлиента.Сделка.ВидСделки ЕСТЬ NULL 
//	|				ТОГДА Продажи.ЗаказКлиента.Сделка.ВидСделки.Наименование
//	|			КОГДА Продажи.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
//	|					ИЛИ Продажи.ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
//	|				ТОГДА &СтрокаПродажиПоЗаказам
//	|			ИНАЧЕ &СтрокаПродажиБезЗаказов
//	|		КОНЕЦ КАК ВидСделки,
//	|		Продажи.НаправлениеДеятельностиКонтрагента,
//	|		Продажи.НаправлениеДеятельностиНоменклатуры,
//	|		Продажи.Соглашение,
//	|		Продажи.АналитикаУчетаНаборов,
//	|		Продажи.Количество КАК Количество,
//	|		Продажи.СуммаВыручки КАК Выручка,
//	|		Продажи.СуммаВыручкиРегл КАК ВыручкаРеглБезНДС,
//	|		Продажи.СуммаВыручкиСНДСРегл КАК ВыручкаРегл,
//	|		Продажи.СуммаВыручкиБезНДС КАК ВыручкаБезНДС,
//	|		ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.Стоимость, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.Стоимость
//	|		КОНЕЦ КАК Себестоимость,
//	|		ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьБезНДС, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.СтоимостьБезНДС
//	|		КОНЕЦ КАК СебестоимостьБезНДС,
//	|		ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.СтоимостьРегл
//	|		КОНЕЦ КАК СебестоимостьРегл,
//	|		ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьУпр, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.СтоимостьУпр
//	|		КОНЕЦ КАК СебестоимостьУпр,
//	|		
//	|		// Доп. расходы
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходы, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ДопРасходы
//	|		КОНЕЦ КАК ДопРасходы,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ДопРасходыУпр, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ДопРасходыУпр
//	|		КОНЕЦ КАК ДопРасходыУпр,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ДопРасходыБезНДС
//	|		КОНЕЦ КАК ДопРасходыБезНДС,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ДопРасходыРегл
//	|		КОНЕЦ КАК ДопРасходыРегл,
//	|		
//	|		// Трудозатраты
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.Трудозатраты, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.Трудозатраты
//	|		КОНЕЦ КАК Трудозатраты,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ТрудозатратыУпр, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ТрудозатратыУпр
//	|		КОНЕЦ КАК ТрудозатратыУпр,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ТрудозатратыРегл
//	|		КОНЕЦ КАК ТрудозатратыРегл,
//	|		
//	|		// Постоянные постательные
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеСНДС, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеСНДС
//	|		КОНЕЦ КАК ПостатейныеПостоянныеСНДС,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеБезНДС, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеБезНДС
//	|		КОНЕЦ КАК ПостатейныеПостоянныеБезНДС,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеУпр, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеУпр
//	|		КОНЕЦ КАК ПостатейныеПостоянныеУпр,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПостоянныеРегл
//	|		КОНЕЦ КАК ПостатейныеПостоянныеРегл,
//	|		
//	|		// Переменные постательные
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеСНДС, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПеременныеСНДС
//	|		КОНЕЦ КАК ПостатейныеПеременныеСНДС,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеБезНДС, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПеременныеБезНДС
//	|		КОНЕЦ КАК ПостатейныеПеременныеБезНДС,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеУпр, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПеременныеУпр
//	|		КОНЕЦ КАК ПостатейныеПеременныеУпр,
//	|		ВЫБОР
//	|			КОГДА ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|				ТОГДА ВЫРАЗИТЬ(Продажи.Количество * ЕСТЬNULL(СтоимостьНоменклатуры.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))
//	|			ИНАЧЕ Продажи.ПостатейныеПеременныеРегл
//	|		КОНЕЦ КАК ПостатейныеПеременныеРегл,
//	|		
//	|		(ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА Продажи.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
//	|				ТОГДА Продажи.Стоимость
//	|				+ Продажи.ДопРасходы
//	|				+ Продажи.Трудозатраты
//	|				+ Продажи.ПостатейныеПостоянныеСНДС
//	|				+ Продажи.ПостатейныеПеременныеСНДС
//	|			ИНАЧЕ 0 КОНЕЦ) КАК СебестоимостьПредварительная,
//	|		(ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА Продажи.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
//	|				ТОГДА Продажи.СтоимостьБезНДС
//	|				+ Продажи.ДопРасходыБезНДС
//	|				+ Продажи.Трудозатраты
//	|				+ Продажи.ПостатейныеПостоянныеБезНДС
//	|				+ Продажи.ПостатейныеПеременныеБезНДС
//	|			ИНАЧЕ 0 КОНЕЦ) КАК СебестоимостьПредварительнаяБезНДС,
//	|		(ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА Продажи.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
//	|				ТОГДА Продажи.СтоимостьРегл
//	|				+ Продажи.ДопРасходыРегл
//	|				+ Продажи.ТрудозатратыРегл
//	|				+ Продажи.ПостатейныеПостоянныеРегл
//	|				+ Продажи.ПостатейныеПеременныеРегл
//	|			ИНАЧЕ 0 КОНЕЦ) КАК СебестоимостьПредварительнаяРегл,
//	|		(ВЫБОР
//	|			КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА 0
//	|			КОГДА Продажи.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
//	|				ТОГДА Продажи.СтоимостьУпр
//	|				+ Продажи.ДопРасходыУпр
//	|				+ Продажи.ТрудозатратыУпр
//	|				+ Продажи.ПостатейныеПостоянныеУпр
//	|				+ Продажи.ПостатейныеПеременныеУпр
//	|			ИНАЧЕ 0 КОНЕЦ) КАК СебестоимостьПредварительнаяУпр,
//	|		
//	|		Продажи.РасходыНаПродажуСНДС КАК РасходыНаПродажуСНДС,
//	|		Продажи.РасходыНаПродажуБезНДС КАК РасходыНаПродажуБезНДС,
//	|		Продажи.РасходыНаПродажуРегл КАК РасходыНаПродажуРегл,
//	|		Продажи.РасходыНаПродажуУпр КАК РасходыНаПродажуУпр,
//	|
//	|		Продажи.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
//	|		Продажи.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
//	|		
//	|		Продажи.СуммаРучнойСкидки КАК СуммаРучнойСкидкиОборот,
//	|		Продажи.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидкиОборот,
//	|		Продажи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|		ЕСТЬNULL(ИсходныеПродажи.Количество, 0) КАК КоличествоДляДетализации
//	|	ИЗ
//	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Продажи
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСебестоимостиТоваров.Организации КАК РасчетСебестоимостиТоваров
//	|			ПО (НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетСебестоимостиТоваров.Ссылка.Дата, МЕСЯЦ))
//	|			И (Продажи.АналитикаУчетаПоПартнерам.Организация = РасчетСебестоимостиТоваров.Организация)
//	|			И (РасчетСебестоимостиТоваров.Ссылка.Проведен)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК СтоимостьНоменклатуры
//	|			ПО Продажи.АналитикаУчетаНоменклатуры = СтоимостьНоменклатуры.АналитикаУчетаНоменклатуры
//	|			И (Продажи.АналитикаУчетаПоПартнерам.Организация = СтоимостьНоменклатуры.Организация)
//	|			И Продажи.ВидЗапасов = СтоимостьНоменклатуры.ВидЗапасов
//	|			И (СтоимостьНоменклатуры.Период = НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ))
//	|			И Продажи.РазделУчета = СтоимостьНоменклатуры.РазделУчета
//	|			И ЕСТЬNULL(РасчетСебестоимостиТоваров.Ссылка.ПредварительныйРасчет, ЛОЖЬ)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеПродажи КАК ИсходныеПродажи
//	|			ПО ВЫРАЗИТЬ(Продажи.ИсточникГФУРасчетов.Объект КАК Документ.РеализацияТоваровУслуг) <> Продажи.Регистратор
//	|			И ВЫРАЗИТЬ(Продажи.ИсточникГФУРасчетов.Объект КАК Документ.РеализацияТоваровУслуг) = ИсходныеПродажи.Регистратор
//	|			И ИсходныеПродажи.Количество <> 0
//	|			И Продажи.АналитикаУчетаНоменклатуры = ИсходныеПродажи.АналитикаУчетаНоменклатуры
//	|			И Продажи.АналитикаУчетаПоПартнерам = ИсходныеПродажи.АналитикаУчетаПоПартнерам
//	|			И Продажи.Подразделение = ИсходныеПродажи.Подразделение
//	|			И Продажи.ВидЗапасов = ИсходныеПродажи.ВидЗапасов
//	|			И Продажи.РазделУчета = ИсходныеПродажи.РазделУчета
//	|		    И Продажи.Партия = ИсходныеПродажи.Партия
//	|		    И Продажи.АналитикаУчетаПартий = ИсходныеПродажи.АналитикаУчетаПартий
//	|		    И Продажи.АналитикаФинансовогоУчета = ИсходныеПродажи.АналитикаФинансовогоУчета
//	|		    И Продажи.ВидДеятельностиНДС = ИсходныеПродажи.ВидДеятельностиНДС
//	|	ГДЕ
//	|		(&ПоказыватьПродажи = 1
//	|					И Продажи.АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|				ИЛИ &ПоказыватьПродажи = 2
//	|					И Продажи.АналитикаУчетаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|				ИЛИ &ПоказыватьПродажи = 0)
//	|		И (Продажи.Период МЕЖДУ &НачалоПериода И &КонецПериода ИЛИ &КонецПериода = ДАТАВРЕМЯ(1,1,1))
//	|	{ГДЕ
//	|		Продажи.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
//	|		Продажи.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
//	|		Продажи.АналитикаУчетаНоменклатуры.МестоХранения.* КАК Склад,
//	|		((Продажи.АналитикаУчетаНоменклатуры.Номенклатура, Продажи.АналитикаУчетаНоменклатуры.Характеристика) В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуНоменклатуры.Номенклатура,
//	|					ОтборПоСегментуНоменклатуры.Характеристика
//	|				ИЗ
//	|					ОтборПоСегментуНоменклатуры
//	|				ГДЕ
//	|					ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
//	|		(Продажи.АналитикаУчетаПоПартнерам.Партнер В
//	|				(ВЫБРАТЬ
//	|					ОтборПоСегментуПартнеров.Партнер
//	|				ИЗ
//	|					ОтборПоСегментуПартнеров
//	|				ГДЕ
//	|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)),
//	|		(ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка))).* КАК Сделка,
//	|		Продажи.Договор.* КАК Договор,
//	|		(ВЫБОР
//	|				КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Контрагенты
//	|					ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
//	|				ИНАЧЕ NULL
//	|			КОНЕЦ).* КАК Контрагент,
//	|		(ВЫБОР
//	|				КОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
//	|					ТОГДА Продажи.АналитикаУчетаПоПартнерам.Контрагент
//	|				ИНАЧЕ NULL
//	|			КОНЕЦ).* КАК Покупатель,
//	|		Продажи.ХозяйственнаяОперация.*,
//	|		Продажи.АналитикаУчетаПоПартнерам.Организация.* КАК Организация,
//	|		Продажи.АналитикаУчетаПоПартнерам.Партнер.* КАК Партнер,
//	|		(ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка))).* КАК Сделка,
//	|		(ЕСТЬNULL(Продажи.ЗаказКлиента.Сделка.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))).* КАК МенеджерСделки, 
//	|		(ВЫБОР
//	|		    КОГДА Продажи.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
//	|		        ТОГДА ЕСТЬNULL(Продажи.ЗаказКлиента.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
//	|		    ИНАЧЕ Продажи.Менеджер
//	|		КОНЕЦ).* КАК Менеджер,
//	|		(ВЫБОР
//	|			КОГДА Продажи.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
//	|				ТОГДА Продажи.ВидЗапасов.ВладелецТовара
//	|			ИНАЧЕ
//	|				Продажи.АналитикаУчетаПартий.Поставщик
//	|		КОНЕЦ).* КАК Поставщик,
//	|		(Продажи.ВидЗапасов.ГруппаФинансовогоУчета).* КАК ГруппаФинансовогоУчета,
//	|		(ВЫБОР
//	|		    КОГДА НЕ Продажи.ЗаказКлиента.Сделка.ВидСделки ЕСТЬ NULL 
//	|				ТОГДА Продажи.ЗаказКлиента.Сделка.ВидСделки.Наименование
//	|			КОГДА Продажи.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
//	|			 ИЛИ Продажи.ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
//	|				ТОГДА &СтрокаПродажиПоЗаказам
//	|			ИНАЧЕ &СтрокаПродажиБезЗаказов
//	|		КОНЕЦ) КАК ВидСделки
//	|		}
//	|	) КАК Таблица
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Таблица.Сделка,
//	|	Таблица.МенеджерСделки,
//	|	ВЫБОР
//	|		КОГДА Таблица.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ, // ПродажиМеждуОрганизациями
//	|	Таблица.АналитикаУчетаНоменклатуры,
//	|	Таблица.Номенклатура,
//	|	Таблица.Характеристика,
//	|	Таблица.Серия,
//	|	Таблица.Организация,
//	|	Таблица.Продавец,
//	|	Таблица.Партнер,
//	|	Таблица.НаправлениеДеятельности,
//	|	Таблица.Регистратор,
//	|	Таблица.ПериодСекунда,
//	|	Таблица.ПериодДень,
//	|	Таблица.ПериодНеделя,
//	|	Таблица.ПериодДекада,
//	|	Таблица.ПериодМесяц,
//	|	Таблица.ПериодКвартал,
//	|	Таблица.ПериодПолугодие,
//	|	Таблица.ПериодГод,
//	|	Таблица.ЗаказКлиента,
//	|	Таблица.Подразделение,
//	|	Таблица.Склад,
//	|	Таблица.Контрагент,
//	|	Таблица.Покупатель,
//	|	Таблица.Поставщик,
//	|	Таблица.Менеджер,
//	|	Таблица.ТипЗапасов,
//	|	Таблица.ВидЗапасов,
//	|	Таблица.РазделУчета,
//	|	Таблица.Партия,
//	|	Таблица.АналитикаУчетаПартий,
//	|	Таблица.АналитикаФинансовогоУчета,
//	|	Таблица.ВидДеятельностиНДС,
//	|	Таблица.ГруппаФинансовогоУчета,
//	|	Таблица.ВидСделки,
//	|	Таблица.НаправлениеДеятельностиКонтрагента,
//	|	Таблица.НаправлениеДеятельностиНоменклатуры,
//	|	Таблица.Соглашение,
//	|	Таблица.АналитикаУчетаНаборов,
//	|	Таблица.Номенклатура.ЕдиницаИзмерения,
//	|	Таблица.Номенклатура.ЕдиницаДляОтчетов,
//	|	Таблица.Номенклатура.КоэффициентЕдиницыДляОтчетов,
//	|	&ТекстЗапросаВесНоменклатуры1,
//	|	&ТекстЗапросаОбъемНоменклатуры1,
//	|	Таблица.СуммаРучнойСкидкиОборот,
//	|	Таблица.СуммаАвтоматическойСкидкиОборот,
//	|	Таблица.ХозяйственнаяОперация
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Номенклатура,
//	|	Характеристика,
//	|	ВидЗапасов,
//	|	Организация,
//	|	Партия,
//	|	АналитикаУчетаПартий,
//	|	ПериодМесяц,
//	|	АналитикаУчетаНоменклатуры
//	|;";

//	#КонецОбласти
//	
//	#Область ДетализацияСгруппированная
//	ТекстЗапроса = ТекстЗапроса + " 
//	|//!!! ИСПОЛЬЗУЮТСЯ ТЭГИ !!!
//	|
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ДАТАВРЕМЯ(1,1,1) КАК ПериодМесяц,
//	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
//	|	ДетализацияСебестоимостиПартииТоваров.Партия КАК ПартияДетализация,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаПартий КАК АналитикаУчетаПартийДетализация,
//	|	ДетализацияСебестоимостиПартииТоваров.Организация КАК ОрганизацияДетализация,
//	|	ДетализацияСебестоимостиПартииТоваров.ВидЗапасов КАК ВидЗапасовДетализация,
//	|	ДетализацияСебестоимостиПартииТоваров.Номенклатура КАК НоменклатураДетализация,
//	|	ДетализацияСебестоимостиПартииТоваров.Характеристика КАК ХарактеристикаДетализация,
//	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
//	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура КАК НоменклатураИсходная,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика КАК ХарактеристикаИсходная,
//	|	ДетализацияСебестоимостиПартииТоваров.ДокументПоступления КАК ДокументПоступленияИсходный,
//	|	СУММА(ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьСНДС
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДС
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДСУпр
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДСРегл
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА &ПоПредприятию
//	|				ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДС
//	|			ИНАЧЕ ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДСУпр
//	|		КОНЕЦ
//	|	КОНЕЦ) КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
//	|	СУММА(0) КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
//	|	СУММА(0) КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
//	|	СУММА(0) КАК ИсходныеДопРасходыНаЕдиницу,
//	|	СУММА(0) КАК КоличествоПартии
//	|ПОМЕСТИТЬ ДетализацияСгруппированная
//	|ИЗ
//	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК ДетализацияСебестоимостиПартииТоваров
//	|ГДЕ
//	|	(ДетализацияСебестоимостиПартииТоваров.Номенклатура, ДетализацияСебестоимостиПартииТоваров.Характеристика, ДетализацияСебестоимостиПартииТоваров.ВидЗапасов, ДетализацияСебестоимостиПартииТоваров.Организация, ДетализацияСебестоимостиПартииТоваров.Партия, ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаПартий) В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ОстаткиИДвижения.Номенклатура,
//	|				ОстаткиИДвижения.Характеристика,
//	|				ОстаткиИДвижения.ВидЗапасов,
//	|				ОстаткиИДвижения.Организация,
//	|				ОстаткиИДвижения.Партия,
//	|				ОстаткиИДвижения.АналитикаУчетаПартий
//	|			ИЗ
//	|				ОстаткиИДвижения)
//	|{ГДЕ
//	|	ДетализацияСебестоимостиПартииТоваров.Номенклатура.* КАК Номенклатура,
//	|	ДетализацияСебестоимостиПартииТоваров.Характеристика.* КАК Характеристика,
//	|	ДетализацияСебестоимостиПартииТоваров.Организация.* КАК Организация,
//	|	ДетализацияСебестоимостиПартииТоваров.ВидЗапасов.* КАК ВидЗапасов}
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДетализацияСебестоимостиПартииТоваров.Партия,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаПартий,
//	|	ДетализацияСебестоимостиПартииТоваров.Организация,
//	|	ДетализацияСебестоимостиПартииТоваров.ВидЗапасов,
//	|	ДетализацияСебестоимостиПартииТоваров.Номенклатура,
//	|	ДетализацияСебестоимостиПартииТоваров.Характеристика,
//	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаПартийДокументаПоступления.ВидЦенности,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаПартийДокументаПоступления,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаНоменклатурыДокументаПоступления,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура,
//	|	ДетализацияСебестоимостиПартииТоваров.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика,
//	|	ДетализацияСебестоимостиПартииТоваров.ДокументПоступления
//	|	
//	|ИМЕЮЩИЕ
//	|	СУММА(ВЫБОР
//	|		КОГДА &ДанныеОтчета = 1
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьСНДС
//	|		КОГДА &ДанныеОтчета = 2
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДС
//	|		КОГДА &ДанныеОтчета = 3
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДСУпр
//	|		КОГДА &ДанныеОтчета = 4
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДСРегл
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА &ПоПредприятию
//	|				ТОГДА ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДС
//	|			ИНАЧЕ ДетализацияСебестоимостиПартииТоваров.СтоимостьБезНДСУпр
//	|		КОНЕЦ
//	|	КОНЕЦ) <> 0
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДАТАВРЕМЯ(1,1,1) КАК ПериодМесяц,
//	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Партия КАК ПартияДетализация,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартий КАК АналитикаУчетаПартийДетализация,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Организация КАК ОрганизацияДетализация,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.ВидЗапасов КАК ВидЗапасовДетализация,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Номенклатура КАК НоменклатураДетализация,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Характеристика КАК ХарактеристикаДетализация,
//	|	ВЫБОР
//	|		КОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
//	|		ИНАЧЕ ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов
//	|	КОНЕЦ КАК СтатьяРасходов,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаРасходов КАК АналитикаРасходов,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
//	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатурыДокументаПоступления,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НоменклатураИсходная,
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаИсходная,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.ДокументПоступления КАК ДокументПоступления,
//	|	СУММА(0) КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
//	|	СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|					ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
//	|					ИЛИ
//	//-- НЕ УТ
//	|						ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
//	|	СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|				ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
//	|				ИЛИ
//	//-- НЕ УТ
//	|				ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
//	|	СУММА(ВЫБОР
//	|		КОГДА &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ НЕ &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) КАК ИсходныеДопРасходыНаЕдиницу,
//	|	СУММА(0) КАК КоличествоПартии
//	|ИЗ
//	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты
//	|ГДЕ
//	|	(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Номенклатура, ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Характеристика, ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.ВидЗапасов, ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Организация, ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Партия, ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартий) В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ОстаткиИДвижения.Номенклатура,
//	|				ОстаткиИДвижения.Характеристика,
//	|				ОстаткиИДвижения.ВидЗапасов,
//	|				ОстаткиИДвижения.Организация,
//	|				ОстаткиИДвижения.Партия,
//	|				ОстаткиИДвижения.АналитикаУчетаПартий
//	|			ИЗ
//	|				ОстаткиИДвижения)
//	|{ГДЕ
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Номенклатура.* КАК Номенклатура,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Характеристика.* КАК Характеристика,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Организация.* КАК Организация,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.ВидЗапасов.* КАК ВидЗапасов}
//	|СГРУППИРОВАТЬ ПО
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Партия,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартий,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Организация,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.ВидЗапасов,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Номенклатура,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Характеристика,
//	|	ВЫБОР
//	|		КОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
//	|			ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
//	|		ИНАЧЕ ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов
//	|	КОНЕЦ,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаРасходов,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности,
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления,
//	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.ДокументПоступления
//	|	
//	|ИМЕЮЩИЕ
//	|	СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|					ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
//	|					ИЛИ
//	//-- НЕ УТ
//	|						ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) <> 0
//	|	ИЛИ СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|				ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
//	|				ИЛИ
//	//-- НЕ УТ
//	|				ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) <> 0
//	|	ИЛИ СУММА(ВЫБОР
//	|		КОГДА &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ НЕ &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) <> 0
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	НАЧАЛОПЕРИОДА(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Период, МЕСЯЦ) КАК ПериодМесяц,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Партия КАК ПартияДетализация,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартий КАК АналитикаУчетаПартийДетализация,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Организация КАК ОрганизацияДетализация,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.ВидЗапасов КАК ВидЗапасовДетализация,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Номенклатура КАК НоменклатураДетализация,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Характеристика КАК ХарактеристикаДетализация,
//	|	ВЫБОР
//	|		КОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
//	|			ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
//	|		ИНАЧЕ ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов
//	|	КОНЕЦ КАК СтатьяРасходов,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаРасходов КАК АналитикаРасходов,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
//	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатурыДокументаПоступления,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НоменклатураИсходная,
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаИсходная,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.ДокументПоступления КАК ДокументПоступления,
//	|	СУММА(0) КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
//	|	СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|				ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
//	|				ИЛИ
//	//-- НЕ УТ
//	|				ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
//	|	СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|				ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
//	|				ИЛИ
//	//-- НЕ УТ
//	|				ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
//	|	СУММА(ВЫБОР
//	|		КОГДА &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ НЕ &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) КАК ИсходныеДопРасходыНаЕдиницу,
//	|	СУММА(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.КоличествоПартии)
//	|ИЗ
//	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимостиТоваровПостатейныеЗатраты
//	|ГДЕ
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
//	|	И (ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Характеристика, ДетализацияСебестоимостиТоваровПостатейныеЗатраты.ВидЗапасов, ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Организация, ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Партия, ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартий) В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ОстаткиИДвижения.Номенклатура,
//	|				ОстаткиИДвижения.Характеристика,
//	|				ОстаткиИДвижения.ВидЗапасов,
//	|				ОстаткиИДвижения.Организация,
//	|				ОстаткиИДвижения.Партия,
//	|				ОстаткиИДвижения.АналитикаУчетаПартий
//	|			ИЗ
//	|				ОстаткиИДвижения)
//	|{ГДЕ 
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Организация.* КАК Организация,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.ВидЗапасов.* КАК ВидЗапасов
//	|}
//	|СГРУППИРОВАТЬ ПО
//	|	НАЧАЛОПЕРИОДА(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Период, МЕСЯЦ),
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Партия,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартий,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Организация,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.ВидЗапасов,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Номенклатура,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаНоменклатуры.Характеристика,
//	|	ВЫБОР
//	|		КОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
//	|			ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
//	|		ИНАЧЕ ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов
//	|	КОНЕЦ,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаРасходов,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления.ВидЦенности,
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.АналитикаУчетаПартийДокументаПоступления,
//	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	ДетализацияСебестоимостиТоваровПостатейныеЗатраты.ДокументПоступления
//	|	
//	|ИМЕЮЩИЕ
//	|	СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|				ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
//	|				ИЛИ
//	//-- НЕ УТ
//	|				ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) <> 0
//	|	ИЛИ СУММА(ВЫБОР
//	|		КОГДА (&ДанныеОтчета = 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ &ДанныеОтчета <> 4
//	|				И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
//	|				И (
//	//++ НЕ УТ
//	|				ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат, ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
//	|				ИЛИ
//	//-- НЕ УТ
//	|				ЛОЖЬ)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) <> 0
//	|	ИЛИ СУММА(ВЫБОР
//	|		КОГДА &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|				ИЛИ НЕ &ДанныеОтчета = 4
//	|					И ЕСТЬNULL(ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
//	|			ТОГДА ВЫБОР
//	|					КОГДА &ДанныеОтчета = 1
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьСНДС
//	|					КОГДА &ДанныеОтчета = 2
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДС
//	|					КОГДА &ДанныеОтчета = 3
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСУпр
//	|					КОГДА &ДанныеОтчета = 4
//	|						ТОГДА ДетализацияСебестоимостиТоваровПостатейныеЗатраты.СтоимостьБезНДСРегл
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ) <> 0
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	НоменклатураДетализация,
//	|	ХарактеристикаДетализация,
//	|	ВидЗапасовДетализация,
//	|	ОрганизацияДетализация,
//	|	ПартияДетализация,
//	|	АналитикаУчетаПартийДетализация,
//	|	ПериодМесяц,
//	|	АналитикаУчетаНоменклатуры
//	|;";

//	#КонецОбласти
//	
//	#Область НаборДанных
//	ТекстЗапроса = ТекстЗапроса + "
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ОстаткиИДвижения.НаборДанных КАК НаборДанных,
//	|	(ВЫБОР
//	|		КОГДА ОстаткиИДвижения.Регистратор = НЕОПРЕДЕЛЕНО 
//	|			ТОГДА NULL
//	|		ИНАЧЕ ОстаткиИДвижения.Регистратор 
//	|	КОНЕЦ) КАК Регистратор,
//	|	ОстаткиИДвижения.ПериодСекунда КАК ПериодСекунда,
//	|	ОстаткиИДвижения.ПериодДень КАК ПериодДень,
//	|	ОстаткиИДвижения.ПериодНеделя КАК ПериодНеделя,
//	|	ОстаткиИДвижения.ПериодДекада КАК ПериодДекада,
//	|	ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
//	|	ОстаткиИДвижения.ПериодКвартал КАК ПериодКвартал,
//	|	ОстаткиИДвижения.ПериодПолугодие КАК ПериодПолугодие,
//	|	ОстаткиИДвижения.ПериодГод КАК ПериодГод,
//	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ОстаткиИДвижения.Номенклатура КАК Номенклатура,
//	|	ОстаткиИДвижения.ЕдиницаХранения КАК ЕдиницаХранения,
//	|	ОстаткиИДвижения.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
//	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
//	|	ОстаткиИДвижения.НоменклатураВес КАК НоменклатураВес,
//	|	ОстаткиИДвижения.НоменклатураОбъем КАК НоменклатураОбъем,
//	|	ОстаткиИДвижения.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
//	|	ОстаткиИДвижения.Характеристика КАК Характеристика,
//	|	ОстаткиИДвижения.Серия КАК Серия,
//	|	ОстаткиИДвижения.Организация КАК Организация,
//	|	ОстаткиИДвижения.Продавец КАК Продавец,
//	|	ОстаткиИДвижения.Партнер КАК Партнер,
//	|	ОстаткиИДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	ОстаткиИДвижения.ЗаказКлиента КАК ЗаказКлиента,
//	|	ОстаткиИДвижения.Подразделение КАК Подразделение,
//	|	ОстаткиИДвижения.Склад КАК Склад,
//	|	ОстаткиИДвижения.Контрагент КАК Контрагент,
//	|	ОстаткиИДвижения.Покупатель КАК Покупатель,
//	|	ОстаткиИДвижения.Поставщик КАК Поставщик,
//	|	ОстаткиИДвижения.Менеджер КАК Менеджер,
//	|	ОстаткиИДвижения.Сделка КАК Сделка,
//	|	ОстаткиИДвижения.МенеджерСделки КАК МенеджерСделки,
//	|	ОстаткиИДвижения.ТипЗапасов КАК ТипЗапасов,
//	|	ОстаткиИДвижения.ВидЗапасов КАК ВидЗапасов,
//	|	ОстаткиИДвижения.РазделУчета КАК РазделУчета,
//	|	ОстаткиИДвижения.Партия КАК Партия,
//	|	ОстаткиИДвижения.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|	ОстаткиИДвижения.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
//	|	ОстаткиИДвижения.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
//	|	ОстаткиИДвижения.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
//	|	ОстаткиИДвижения.ВидСделки КАК ВидСделки,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
//	|	ОстаткиИДвижения.Соглашение КАК Соглашение,
//	|	ОстаткиИДвижения.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
//	|	ОстаткиИДвижения.Валюта КАК Валюта,
//	|	ОстаткиИДвижения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	ОстаткиИДвижения.Количество КАК Количество,
//	|	ОстаткиИДвижения.Выручка КАК Выручка,
//	|	ОстаткиИДвижения.ВыручкаНДС КАК ВыручкаНДС,
//	|	ОстаткиИДвижения.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
//	|	ОстаткиИДвижения.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
//	|	ОстаткиИДвижения.ВсегоСкидок КАК ВсегоСкидок,
//	|	ОстаткиИДвижения.Себестоимость КАК Себестоимость,
//	|	ОстаткиИДвижения.ДопРасходы КАК ДопРасходы,
//	|	ОстаткиИДвижения.Трудозатраты КАК Трудозатраты,
//	|	ОстаткиИДвижения.ПостатейныеПостоянные КАК ПостатейныеПостоянные,
//	|	ОстаткиИДвижения.ПостатейныеПеременные КАК ПостатейныеПеременные,
//	|	ОстаткиИДвижения.РасходыНаПродажу КАК РасходыНаПродажу,
//	|	ОстаткиИДвижения.РезервПодОбесценение КАК РезервПодОбесценение,
//	|	ОстаткиИДвижения.СебестоимостьПредварительная КАК СебестоимостьПредварительная,
//	|	ОстаткиИДвижения.СебестоимостьОтклонение КАК СебестоимостьОтклонение,
//	|	ОстаткиИДвижения.ВаловаяПрибыль КАК ВаловаяПрибыль,
//	|	ОстаткиИДвижения.Рентабельность КАК Рентабельность,
//	|	ОстаткиИДвижения.ПродажиМеждуОрганизациями КАК ПродажиМеждуОрганизациями,
//	|	ОстаткиИДвижения.КоличествоДляДетализации КАК КоличествоДляДетализации,
//	|	НЕОПРЕДЕЛЕНО КАК ПартияДетализация,
//	|
//	|	NULL КАК АналитикаУчетаПартийДетализация,
//	|	NULL КАК ОрганизацияДетализация,
//	|	NULL КАК ВидЗапасовДетализация,
//	|	NULL КАК НоменклатураДетализация,
//	|	NULL КАК ХарактеристикаДетализация,
//	|	NULL КАК СтатьяРасходов,
//	|	NULL КАК АналитикаРасходов,
//	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка) КАК ВидЦенности,
//	|	NULL КАК АналитикаУчетаПартийДокументаПоступления,
//	|	NULL КАК АналитикаУчетаНоменклатурыДокументаПоступления,
//	|	NULL КАК НоменклатураИсходная,
//	|	NULL КАК ХарактеристикаИсходная,
//	|	NULL КАК ДокументПоступленияИсходный,
//	|
//	|	0 КАК ИсходныеМатериальныеЗатраты,
//	|	0 КАК ИсходныеПостатейныеПостоянные,
//	|	0 КАК ИсходныеПостатейныеПеременные,
//	|	0 КАК ИсходныеДопРасходы,
//	//--> Маковеева А.Ю. 13.12.2022
//	|	ОстаткиИДвижения.ВыручкаРегл КАК ВыручкаРегл, 
//	|	ОстаткиИДвижения.ВыручкаРеглБезНДС КАК ВыручкаРеглБезНДС, 
//	|	ОстаткиИДвижения.ВыручкаБезНДС КАК ВыручкаБезНДС,    
//	|	ОстаткиИДвижения.СебестоимостьРегл КАК СебестоимостьРегл,
//	|	ОстаткиИДвижения.СебестоимостьУпр КАК СебестоимостьУпр,   
//	|	ОстаткиИДвижения.СебестоимостьБезНДС КАК СебестоимостьБезНДС, 
//	|	ОстаткиИДвижения.ДопРасходыРегл КАК ДопРасходыРегл,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,    
//	|	ОстаткиИДвижения.ДопРасходыУпр КАК ДопРасходыУпр,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
//	|	ОстаткиИДвижения.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
//	//<-- Маковеева А.Ю. 13.12.2022
//	|	0 КАК КоличествоПартии
//	|
//	|{ВЫБРАТЬ
//	|	Регистратор,
//	|	ПериодСекунда,
//	|	ПериодДень,
//	|	ПериодНеделя,
//	|	ПериодДекада,
//	|	ПериодМесяц,
//	|	ПериодКвартал,
//	|	ПериодПолугодие,
//	|	ПериодГод,
//	|	АналитикаУчетаНоменклатуры.*,
//	|	Номенклатура.*,
//	|	ЕдиницаХранения.*,
//	|	ЕдиницаДляОтчетов.*,
//	|	КоэффициентЕдиницыДляОтчетов,
//	|	НоменклатураВес,
//	|	НоменклатураОбъем,
//	|	ГруппаАналитическогоУчета.*,
//	|	Характеристика.*,
//	|	Серия.*,
//	|	Организация.*,
//	|	Продавец.*,
//	|	Партнер.*,
//	|	НаправлениеДеятельности.*,
//	|	ЗаказКлиента.*,
//	|	Подразделение.*,
//	|	Склад.*,
//	|	Контрагент.*,
//	|	Покупатель.*,
//	|	Поставщик.*,
//	|	Менеджер.*,
//	|	Сделка.*,
//	|	МенеджерСделки.*,
//	|	ТипЗапасов.*,
//	|	ВидЗапасов.*,
//	|	РазделУчета.*,
//	|	Партия.*,
//	|	АналитикаУчетаПартий.*,
//	|	АналитикаФинансовогоУчета.*,
//	|	ВидДеятельностиНДС.*,
//	|	ГруппаФинансовогоУчета.*,
//	|	ВидСделки.*,
//	|	НаправлениеДеятельностиКонтрагента.*,
//	|	НаправлениеДеятельностиНоменклатуры.*,
//	|	Соглашение.*,
//	|	АналитикаУчетаНаборов.*,
//	|	Валюта.*,
//	|	ХозяйственнаяОперация.*,
//	|	Количество,
//	|	Выручка,
//	|	ВыручкаНДС,
//	|	СуммаРучнойСкидки,
//	|	СуммаАвтоматическойСкидки,
//	|	ВсегоСкидок,
//	|	Себестоимость,
//	|	ДопРасходы,
//	|	Трудозатраты,
//	|	ПостатейныеПостоянные,
//	|	ПостатейныеПеременные,
//	|	РасходыНаПродажу,
//	|	РезервПодОбесценение,
//	|	СебестоимостьПредварительная,
//	|	СебестоимостьОтклонение,
//	|	ВаловаяПрибыль,
//	|	Рентабельность,
//	|	ПродажиМеждуОрганизациями,
//	|	КоличествоДляДетализации,
//	|	ПартияДетализация.*,
//	|	АналитикаУчетаПартийДетализация.*,
//	|	ОрганизацияДетализация.*,
//	|	ВидЗапасовДетализация.*,
//	|	НоменклатураДетализация.*,
//	|	ХарактеристикаДетализация.*,
//	|	СтатьяРасходов.*,
//	|	АналитикаРасходов.*,
//	|	ВидЦенности.*,
//	|	АналитикаУчетаПартийДокументаПоступления.*,
//	|	АналитикаУчетаНоменклатурыДокументаПоступления.*,
//	|	НоменклатураИсходная.*,
//	|	ХарактеристикаИсходная.*,
//	|	ДокументПоступленияИсходный.*,
//	|	ИсходныеМатериальныеЗатраты,
//	|	ИсходныеПостатейныеПостоянные,
//	|	ИсходныеПостатейныеПеременные,
//	|	ИсходныеДопРасходы,
//	//--> Маковеева А.Ю. 13.12.2022
//	|	ВыручкаРегл, 
//	|	ВыручкаРеглБезНДС, 
//	|	ВыручкаБезНДС,    
//	|	СебестоимостьРегл,
//	|	СебестоимостьУпр,
//	|	СебестоимостьБезНДС, 
//	|	ДопРасходыРегл,
//	|	ПостатейныеПостоянныеРегл,
//	|	ПостатейныеПеременныеРегл,    
//	|	ДопРасходыУпр,
//	|	ПостатейныеПостоянныеУпр,
//	|	ПостатейныеПеременныеУпр,
//	|	ДопРасходыБезНДС,
//	|	ПостатейныеПостоянныеБезНДС,
//	|	ПостатейныеПеременныеБезНДС,
//	//<-- Маковеева А.Ю. 13.12.2022
//	|	КоличествоПартии}
//	|ИЗ
//	|	ОстаткиИДвижения КАК ОстаткиИДвижения
//	|{ГДЕ
//	|	ОстаткиИДвижения.Регистратор,
//	|	ОстаткиИДвижения.ПериодСекунда,
//	|	ОстаткиИДвижения.ПериодДень,
//	|	ОстаткиИДвижения.ПериодНеделя,
//	|	ОстаткиИДвижения.ПериодДекада,
//	|	ОстаткиИДвижения.ПериодМесяц,
//	|	ОстаткиИДвижения.ПериодКвартал,
//	|	ОстаткиИДвижения.ПериодПолугодие,
//	|	ОстаткиИДвижения.ПериодГод,
//	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры.*,
//	|	ОстаткиИДвижения.Номенклатура.*,
//	|	ОстаткиИДвижения.ЕдиницаХранения.*,
//	|	ОстаткиИДвижения.ЕдиницаДляОтчетов.*,
//	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов,
//	|	ОстаткиИДвижения.НоменклатураВес,
//	|	ОстаткиИДвижения.НоменклатураОбъем,
//	|	ОстаткиИДвижения.ГруппаАналитическогоУчета.*,
//	|	ОстаткиИДвижения.Характеристика.*,
//	|	ОстаткиИДвижения.Серия.*,
//	|	ОстаткиИДвижения.Организация.*,
//	|	ОстаткиИДвижения.Продавец.*,
//	|	ОстаткиИДвижения.Партнер.*,
//	|	ОстаткиИДвижения.НаправлениеДеятельности.*,
//	|	ОстаткиИДвижения.ЗаказКлиента.*,
//	|	ОстаткиИДвижения.Подразделение.*,
//	|	ОстаткиИДвижения.Склад.*,
//	|	ОстаткиИДвижения.Контрагент.*,
//	|	ОстаткиИДвижения.Покупатель.*,
//	|	ОстаткиИДвижения.Поставщик.*,
//	|	ОстаткиИДвижения.Менеджер.*,
//	|	ОстаткиИДвижения.Сделка.*,
//	|	ОстаткиИДвижения.МенеджерСделки.*,
//	|	ОстаткиИДвижения.ТипЗапасов.*,
//	|	ОстаткиИДвижения.ВидЗапасов.*,
//	|	ОстаткиИДвижения.РазделУчета.*,
//	|	ОстаткиИДвижения.Партия.*,
//	|	ОстаткиИДвижения.АналитикаУчетаПартий.*,
//	|	ОстаткиИДвижения.АналитикаФинансовогоУчета.*,
//	|	ОстаткиИДвижения.ВидДеятельностиНДС.*,
//	|	ОстаткиИДвижения.ГруппаФинансовогоУчета.*,
//	|	ОстаткиИДвижения.ВидСделки,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиКонтрагента.*,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиНоменклатуры.*,
//	|	ОстаткиИДвижения.Соглашение.*,
//	|	ОстаткиИДвижения.АналитикаУчетаНаборов.*,
//	|	ОстаткиИДвижения.Валюта.*,
//	|	ОстаткиИДвижения.ХозяйственнаяОперация.*,
//	|	ОстаткиИДвижения.Количество,
//	|	ОстаткиИДвижения.Выручка,
//	|	ОстаткиИДвижения.ВыручкаНДС,
//	|	ОстаткиИДвижения.СуммаРучнойСкидки,
//	|	ОстаткиИДвижения.СуммаАвтоматическойСкидки,
//	|	ОстаткиИДвижения.ВсегоСкидок,
//	|	ОстаткиИДвижения.Себестоимость,
//	|	ОстаткиИДвижения.ДопРасходы,
//	|	ОстаткиИДвижения.Трудозатраты,
//	|	ОстаткиИДвижения.ПостатейныеПостоянные,
//	|	ОстаткиИДвижения.ПостатейныеПеременные,
//	|	ОстаткиИДвижения.РасходыНаПродажу,
//	|	ОстаткиИДвижения.РезервПодОбесценение,
//	|	ОстаткиИДвижения.СебестоимостьПредварительная,
//	|	ОстаткиИДвижения.СебестоимостьОтклонение,
//	|	ОстаткиИДвижения.ВаловаяПрибыль,
//	|	ОстаткиИДвижения.Рентабельность,
//	|	ОстаткиИДвижения.ПродажиМеждуОрганизациями,
//	//--> Маковеева А.Ю. 13.12.2022
//	|	ОстаткиИДвижения.ВыручкаРегл,
//	|	ОстаткиИДвижения.ВыручкаБезНДС,    
//	|	ОстаткиИДвижения.СебестоимостьРегл,
//	|	ОстаткиИДвижения.СебестоимостьУпр,
//	|	ОстаткиИДвижения.СебестоимостьБезНДС, 
//	|	ОстаткиИДвижения.ДопРасходыРегл,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеРегл,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеРегл,    
//	|	ОстаткиИДвижения.ДопРасходыУпр,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеУпр,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеУпр,
//	|	ОстаткиИДвижения.ДопРасходыБезНДС,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеБезНДС,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеБезНДС,
//	//<-- Маковеева А.Ю. 13.12.2022
//	|	ОстаткиИДвижения.КоличествоДляДетализации}
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ОстаткиИДвижения.НаборДанных + 2 КАК НаборДанных,
//	|	(ВЫБОР
//	|		КОГДА ОстаткиИДвижения.Регистратор = НЕОПРЕДЕЛЕНО 
//	|			ТОГДА NULL
//	|		ИНАЧЕ ОстаткиИДвижения.Регистратор 
//	|	КОНЕЦ) КАК Регистратор,
//	|	ОстаткиИДвижения.ПериодСекунда КАК ПериодСекунда,
//	|	ОстаткиИДвижения.ПериодДень КАК ПериодДень,
//	|	ОстаткиИДвижения.ПериодНеделя КАК ПериодНеделя,
//	|	ОстаткиИДвижения.ПериодДекада КАК ПериодДекада,
//	|	ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
//	|	ОстаткиИДвижения.ПериодКвартал КАК ПериодКвартал,
//	|	ОстаткиИДвижения.ПериодПолугодие КАК ПериодПолугодие,
//	|	ОстаткиИДвижения.ПериодГод КАК ПериодГод,
//	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ОстаткиИДвижения.Номенклатура КАК Номенклатура,
//	|	ОстаткиИДвижения.ЕдиницаХранения КАК ЕдиницаХранения,
//	|	ОстаткиИДвижения.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
//	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
//	|	ОстаткиИДвижения.НоменклатураВес КАК НоменклатураВес,
//	|	ОстаткиИДвижения.НоменклатураОбъем КАК НоменклатураОбъем,
//	|	ОстаткиИДвижения.ГруппаАналитическогоУчета КАК ГруппаАналитическогоУчета,
//	|	ОстаткиИДвижения.Характеристика КАК Характеристика,
//	|	ОстаткиИДвижения.Серия КАК Серия,
//	|	ОстаткиИДвижения.Организация КАК Организация,
//	|	ОстаткиИДвижения.Продавец КАК Продавец,
//	|	ОстаткиИДвижения.Партнер КАК Партнер,
//	|	ОстаткиИДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	ОстаткиИДвижения.ЗаказКлиента КАК ЗаказКлиента,
//	|	ОстаткиИДвижения.Подразделение КАК Подразделение,
//	|	ОстаткиИДвижения.Склад КАК Склад,
//	|	ОстаткиИДвижения.Контрагент КАК Контрагент,
//	|	ОстаткиИДвижения.Покупатель КАК Покупатель,
//	|	ОстаткиИДвижения.Поставщик КАК Поставщик,
//	|	ОстаткиИДвижения.Менеджер КАК Менеджер,
//	|	ОстаткиИДвижения.Сделка КАК Сделка,
//	|	ОстаткиИДвижения.МенеджерСделки КАК МенеджерСделки,
//	|	ОстаткиИДвижения.ТипЗапасов КАК ТипЗапасов,
//	|	ОстаткиИДвижения.ВидЗапасов КАК ВидЗапасов,
//	|	ОстаткиИДвижения.РазделУчета КАК РазделУчета,
//	|	ОстаткиИДвижения.Партия КАК Партия,
//	|	ОстаткиИДвижения.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|	ОстаткиИДвижения.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
//	|	ОстаткиИДвижения.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
//	|	ОстаткиИДвижения.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
//	|	ОстаткиИДвижения.ВидСделки КАК ВидСделки,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
//	|	ОстаткиИДвижения.Соглашение КАК Соглашение,
//	|	ОстаткиИДвижения.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
//	|	ОстаткиИДвижения.Валюта КАК Валюта,
//	|	ОстаткиИДвижения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	0 КАК Количество,
//	|	0 КАК Выручка,
//	|	0 КАК ВыручкаНДС,
//	|	0 КАК СуммаРучнойСкидки,
//	|	0 КАК СуммаАвтоматическойСкидки,
//	|	0 КАК ВсегоСкидок,
//	|	0 КАК Себестоимость,
//	|	0 КАК ДопРасходы,
//	|	0 КАК Трудозатраты,
//	|	0 КАК ПостатейныеПостоянные,
//	|	0 КАК ПостатейныеПеременные,
//	|	0 КАК РасходыНаПродажу,
//	|	0 КАК РезервПодОбесценение,
//	|	0 КАК СебестоимостьПредварительная,
//	|	0 КАК СебестоимостьОтклонение,
//	|	0 КАК ВаловаяПрибыль,
//	|	0 КАК Рентабельность,
//	|	0 КАК ПродажиМеждуОрганизациями,
//	|	0 КАК КоличествоДляДетализации,
//	|	ДетализацияСгруппированная.ПартияДетализация КАК ПартияДетализация,
//	|	ДетализацияСгруппированная.АналитикаУчетаПартийДетализация КАК АналитикаУчетаПартийДетализация,
//	|	ДетализацияСгруппированная.ОрганизацияДетализация КАК ОрганизацияДетализация,
//	|	ДетализацияСгруппированная.ВидЗапасовДетализация КАК ВидЗапасовДетализация,
//	|	ДетализацияСгруппированная.НоменклатураДетализация КАК НоменклатураДетализация,
//	|	ДетализацияСгруппированная.ХарактеристикаДетализация КАК ХарактеристикаДетализация,
//	|	ДетализацияСгруппированная.СтатьяРасходов КАК СтатьяРасходов,
//	|	ДетализацияСгруппированная.АналитикаРасходов КАК АналитикаРасходов,
//	|	ДетализацияСгруппированная.ВидЦенности КАК ВидЦенности,
//	|	ДетализацияСгруппированная.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
//	|	ДетализацияСгруппированная.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
//	|	ДетализацияСгруппированная.НоменклатураИсходная КАК НоменклатураИсходная,
//	|	ДетализацияСгруппированная.ХарактеристикаИсходная КАК ХарактеристикаИсходная,
//	|	ДетализацияСгруппированная.ДокументПоступленияИсходный КАК ДокументПоступленияИсходный,
//	|	ВЫБОР
//	|		КОГДА ОстаткиИДвижения.Количество = 0
//	|			ТОГДА ОстаткиИДвижения.КоличествоДляДетализации
//	|		ИНАЧЕ ОстаткиИДвижения.Количество
//	|	КОНЕЦ * ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу КАК ИсходныеМатериальныеЗатраты,
//	|	ВЫБОР
//	|		КОГДА ОстаткиИДвижения.Количество = 0
//	|			ТОГДА ОстаткиИДвижения.КоличествоДляДетализации
//	|		ИНАЧЕ ОстаткиИДвижения.Количество
//	|	КОНЕЦ * ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу КАК ИсходныеПостатейныеПостоянные,
//	|	ВЫБОР
//	|		КОГДА ОстаткиИДвижения.Количество = 0
//	|			ТОГДА ОстаткиИДвижения.КоличествоДляДетализации
//	|		ИНАЧЕ ОстаткиИДвижения.Количество
//	|	КОНЕЦ * ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу КАК ИсходныеПостатейныеПеременные,
//	|	ВЫБОР
//	|		КОГДА ОстаткиИДвижения.Количество = 0
//	|			ТОГДА ОстаткиИДвижения.КоличествоДляДетализации
//	|		ИНАЧЕ ОстаткиИДвижения.Количество
//	|	КОНЕЦ * ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу КАК ИсходныеДопРасходы,
//	//--> Маковеева А.Ю. 13.12.2022
//	|	0 КАК ВыручкаРегл,
//	|	0 КАК ВыручкаРеглБезНДС,
//	|	0 КАК ВыручкаБезНДС,    
//	|	0 КАК СебестоимостьРегл,
//	|	0 КАК СебестоимостьУпр,
//	|	0 КАК СебестоимостьБезНДС, 
//	|	0 КАК ДопРасходыРегл,
//	|	0 КАК ПостатейныеПостоянныеРегл,
//	|	0 КАК ПостатейныеПеременныеРегл,    
//	|	0 КАК ДопРасходыУпр,
//	|	0 КАК ПостатейныеПостоянныеУпр,
//	|	0 КАК ПостатейныеПеременныеУпр,
//	|	0 КАК ДопРасходыБезНДС,
//	|	0 КАК ПостатейныеПостоянныеБезНДС,
//	|	0 КАК ПостатейныеПеременныеБезНДС,
//	//<-- Маковеева А.Ю. 13.12.2022
//	|	ДетализацияСгруппированная.КоличествоПартии КАК КоличествоПартии
//	|ИЗ
//	|	ОстаткиИДвижения КАК ОстаткиИДвижения
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДетализацияСгруппированная КАК ДетализацияСгруппированная
//	|		ПО ОстаткиИДвижения.Номенклатура = ДетализацияСгруппированная.НоменклатураДетализация
//	|			И ОстаткиИДвижения.Характеристика = ДетализацияСгруппированная.ХарактеристикаДетализация
//	|			И ОстаткиИДвижения.ВидЗапасов = ДетализацияСгруппированная.ВидЗапасовДетализация
//	|			И ОстаткиИДвижения.Организация = ДетализацияСгруппированная.ОрганизацияДетализация
//	|			И ОстаткиИДвижения.Партия = ДетализацияСгруппированная.ПартияДетализация
//	|			И ОстаткиИДвижения.АналитикаУчетаПартий = ДетализацияСгруппированная.АналитикаУчетаПартийДетализация
//	|			И (ВЫБОР
//	|				КОГДА ДетализацияСгруппированная.ПериодМесяц = ДАТАВРЕМЯ(1, 1, 1)
//	|					ТОГДА ИСТИНА
//	|				ИНАЧЕ ОстаткиИДвижения.ПериодМесяц = ДетализацияСгруппированная.ПериодМесяц
//	|			КОНЕЦ)
//	|			И (ВЫБОР
//	|				КОГДА ДетализацияСгруппированная.АналитикаУчетаНоменклатуры = НЕОПРЕДЕЛЕНО
//	|					ТОГДА ИСТИНА
//	|				ИНАЧЕ ОстаткиИДвижения.АналитикаУчетаНоменклатуры = ДетализацияСгруппированная.АналитикаУчетаНоменклатуры
//	|			КОНЕЦ)
//	|			И (ОстаткиИДвижения.Количество <> 0 ИЛИ ОстаткиИДвижения.КоличествоДляДетализации <> 0)
//	|{ГДЕ
//	|	ОстаткиИДвижения.Регистратор,
//	|	ОстаткиИДвижения.ПериодСекунда,
//	|	ОстаткиИДвижения.ПериодДень,
//	|	ОстаткиИДвижения.ПериодНеделя,
//	|	ОстаткиИДвижения.ПериодДекада,
//	|	ОстаткиИДвижения.ПериодМесяц,
//	|	ОстаткиИДвижения.ПериодКвартал,
//	|	ОстаткиИДвижения.ПериодПолугодие,
//	|	ОстаткиИДвижения.ПериодГод,
//	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры.*,
//	|	ОстаткиИДвижения.Номенклатура.*,
//	|	ОстаткиИДвижения.ЕдиницаХранения.*,
//	|	ОстаткиИДвижения.ЕдиницаДляОтчетов.*,
//	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов,
//	|	ОстаткиИДвижения.НоменклатураВес,
//	|	ОстаткиИДвижения.НоменклатураОбъем,
//	|	ОстаткиИДвижения.ГруппаАналитическогоУчета.*,
//	|	ОстаткиИДвижения.Характеристика.*,
//	|	ОстаткиИДвижения.Серия.*,
//	|	ОстаткиИДвижения.Организация.*,
//	|	ОстаткиИДвижения.Продавец.*,
//	|	ОстаткиИДвижения.Партнер.*,
//	|	ОстаткиИДвижения.НаправлениеДеятельности.*,
//	|	ОстаткиИДвижения.ЗаказКлиента.*,
//	|	ОстаткиИДвижения.Подразделение.*,
//	|	ОстаткиИДвижения.Склад.*,
//	|	ОстаткиИДвижения.Контрагент.*,
//	|	ОстаткиИДвижения.Покупатель.*,
//	|	ОстаткиИДвижения.Поставщик.*,
//	|	ОстаткиИДвижения.Менеджер.*,
//	|	ОстаткиИДвижения.Сделка.*,
//	|	ОстаткиИДвижения.МенеджерСделки.*,
//	|	ОстаткиИДвижения.ТипЗапасов.*,
//	|	ОстаткиИДвижения.ВидЗапасов.*,
//	|	ОстаткиИДвижения.РазделУчета.*,
//	|	ОстаткиИДвижения.Партия.*,
//	|	ОстаткиИДвижения.АналитикаУчетаПартий.*,
//	|	ОстаткиИДвижения.АналитикаФинансовогоУчета.*,
//	|	ОстаткиИДвижения.ВидДеятельностиНДС.*,
//	|	ОстаткиИДвижения.ГруппаФинансовогоУчета.*,
//	|	ОстаткиИДвижения.ВидСделки,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиКонтрагента.*,
//	|	ОстаткиИДвижения.НаправлениеДеятельностиНоменклатуры.*,
//	|	ОстаткиИДвижения.Соглашение.*,
//	|	ОстаткиИДвижения.АналитикаУчетаНаборов.*,
//	|	ОстаткиИДвижения.Валюта.*,
//	|	ОстаткиИДвижения.ХозяйственнаяОперация.*,
//	|	ОстаткиИДвижения.Количество,
//	|	ОстаткиИДвижения.Выручка,
//	|	ОстаткиИДвижения.ВыручкаНДС,
//	|	ОстаткиИДвижения.СуммаРучнойСкидки,
//	|	ОстаткиИДвижения.СуммаАвтоматическойСкидки,
//	|	ОстаткиИДвижения.ВсегоСкидок,
//	|	ОстаткиИДвижения.Себестоимость,
//	|	ОстаткиИДвижения.ДопРасходы,
//	|	ОстаткиИДвижения.Трудозатраты,
//	|	ОстаткиИДвижения.ПостатейныеПостоянные,
//	|	ОстаткиИДвижения.ПостатейныеПеременные,
//	|	ОстаткиИДвижения.РасходыНаПродажу,
//	|	ОстаткиИДвижения.РезервПодОбесценение,
//	|	ОстаткиИДвижения.СебестоимостьПредварительная,
//	|	ОстаткиИДвижения.СебестоимостьОтклонение,
//	|	ОстаткиИДвижения.ВаловаяПрибыль,
//	|	ОстаткиИДвижения.Рентабельность,
//	|	ОстаткиИДвижения.ПродажиМеждуОрганизациями,
//	//--> Маковеева А.Ю. 13.12.2022
//	|	ОстаткиИДвижения.ВыручкаРегл,
//	|	ОстаткиИДвижения.ВыручкаРеглБезНДС,
//	|	ОстаткиИДвижения.ВыручкаБезНДС,    
//	|	ОстаткиИДвижения.СебестоимостьРегл,
//	|	ОстаткиИДвижения.СебестоимостьУпр,
//	|	ОстаткиИДвижения.СебестоимостьБезНДС, 
//	|	ОстаткиИДвижения.ДопРасходыРегл,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеРегл,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеРегл,    
//	|	ОстаткиИДвижения.ДопРасходыУпр,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеУпр,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеУпр,
//	|	ОстаткиИДвижения.ДопРасходыБезНДС,
//	|	ОстаткиИДвижения.ПостатейныеПостоянныеБезНДС,
//	|	ОстаткиИДвижения.ПостатейныеПеременныеБезНДС,
//	//<-- Маковеева А.Ю. 13.12.2022
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.ПартияДетализация, НЕОПРЕДЕЛЕНО)).* КАК ПартияДетализация,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.АналитикаУчетаПартийДетализация, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))).* КАК АналитикаУчетаПартийДетализация,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.ОрганизацияДетализация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))).* КАК ОрганизацияДетализация,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.ВидЗапасовДетализация, ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))).* КАК ВидЗапасовДетализация,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.НоменклатураДетализация, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))).* КАК НоменклатураДетализация,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.ХарактеристикаДетализация, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))).* КАК ХарактеристикаДетализация,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.СтатьяРасходов, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))).* КАК СтатьяРасходов,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.АналитикаРасходов, НЕОПРЕДЕЛЕНО)).* КАК АналитикаРасходов,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка))).* КАК ВидЦенности,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.АналитикаУчетаПартийДокументаПоступления, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))).* КАК АналитикаУчетаПартийДокументаПоступления,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.АналитикаУчетаНоменклатурыДокументаПоступления, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка))).* КАК АналитикаУчетаНоменклатурыДокументаПоступления,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.НоменклатураИсходная, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))).* КАК НоменклатураИсходная,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.ХарактеристикаИсходная, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))).* КАК ХарактеристикаИсходная,
//	|	(ЕСТЬNULL(ДетализацияСгруппированная.ДокументПоступленияИсходный, НЕОПРЕДЕЛЕНО)).* КАК ДокументПоступленияИсходный}";
//	#КонецОбласти
//	
//	Возврат ТекстЗапроса;
//	
//	
//	
//КонецФункции   // <-- Маковеева А.Ю. 07.06.2023



