
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	СхемаПуста 				 =  Истина;
	
	КоличествоКолонокМонтажа =	Объект.Ручьи;
	КоличествоСтрокМонтажа 	 = Цел(Объект.ЭтикетокНаЛисте / Объект.Ручьи); 	
	
	УбратьВидимостьКолонокСхемы();
	УстановитьВидимостьКолонокСхемы();
	
	ПрочитатьСхемыМонтажей(Отказ);
	
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьКолонкиСхемы()
	Схема.Очистить();
	УбратьВидимостьКолонокСхемы();
	УстановитьВидимостьКолонокСхемы();
	
	ДобавитьСтрокиСхемы();
	
КонецПроцедуры //СоздатьКолонкиСхемы

&НаСервере 
Процедура УбратьВидимостьКолонокСхемы () //+Лико m.shenderov 11/11/2019
	Для Индекс=1 По 40 Цикл
		Элементы["СхемаКолонка"+Строка(Индекс)].Видимость=Ложь;	
	КонецЦикла;  	
	
КонецПроцедуры //-Лико m.shenderov 11/11/2019

&НаСервере 
Процедура УстановитьВидимостьКолонокСхемы () //+Лико m.shenderov 11/11/2019
	Для Индекс=1 По КоличествоКолонокМонтажа Цикл
		Элементы["СхемаКолонка"+Строка(Индекс)].Видимость=Истина;	
	КонецЦикла;  
	
	
КонецПроцедуры //-Лико m.shenderov 11/11/2019

&НаСервере 
Процедура ДобавитьСтрокиСхемы () //+Лико m.shenderov 11/11/2019
	
	Для Индекс=1 По КоличествоСтрокМонтажа Цикл
		НоваяСтрока = Схема.Добавить();
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 11/11/2019


&НаСервере 
Процедура ПрочитатьСхемыМонтажей(Отказ)
	
	Для Каждого СтрокаМонтаж Из Объект.МонтажСхема Цикл
		
		НомерМонтажа = Цел(СтрокаМонтаж.ИндексСтроки/1000000);
		ПроверитьСоздатьКнопкуНомераМонтажа(НомерМонтажа);
		
		КоличествоМонтажей = Макс(КоличествоМонтажей, НомерМонтажа);
		
	КонецЦикла;
	
	Если КоличествоМонтажей>0 Тогда
		
		НомерТекущегоМонтажа = 1;
		
		ПрочитатьСхемуМонтажа(НомерТекущегоМонтажа);
		ВключитьПометкуКнопкиВыбораМонтажа();
		
	КонецЕсли;
	
КонецПроцедуры //ПрочитатьСхемыМонтажей

&НаСервере 
Процедура ВключитьПометкуКнопкиВыбораМонтажа()
	
	// у всех выключим
	ПрефиксИмени = "Монтаж";
	ИмяКнопки=ПрефиксИмени+Строка(НомерТекущегоМонтажа);
	
	
	Если ЗначениеЗаполнено(ТекущаяКнопка) Тогда
		Элементы[ТекущаяКнопка].ЦветФона=	ЦветаСтиля.ЦветФонаКнопки;
	КонецЕсли;
	ТекущаяКнопка=ИмяКнопки;
	//Заголовок=  Сред(Элемент.Имя,3,СтрДлина(Элемент.Имя));
	Элементы[ТекущаяКнопка].ЦветФона =   Новый Цвет(200, 200, 255);
	
КонецПроцедуры //ВключитьПометкуКнопкиВыбораМонтажа



&НаСервере 
Процедура ПрочитатьСхемуМонтажа(НомерТекущегоМонтажа)
	
	
	СоздатьКолонкиСхемы();
	
	
	
	Попытка
		
		Для Каждого СтрокаМонтажа Из Объект.МонтажСхема Цикл
			
			ИндексСтроки = СтрокаМонтажа.ИндексСтроки;
			
			НомерМонтажа = Цел(ИндексСтроки/1000000);
			ИндексСтроки = ИндексСтроки - НомерМонтажа*1000000; // индекс без монтажа
			
			Если НомерМонтажа<>НомерТекущегоМонтажа Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтрокиМонтажа = Цел(ИндексСтроки/1000);
			ИндексСтроки = ИндексСтроки - НомерСтрокиМонтажа*1000; // индекс без строки
			
			НомерКолонкиМонтажа = ИндексСтроки;
			
			СтрокаСхемы = Схема[НомерСтрокиМонтажа-1];
			СтрокаСхемы["Колонка"+НомерКолонкиМонтажа] = СтрокаМонтажа.ИндексНоменклатуры;
			
			Если СтрокаМонтажа.ИндексНоменклатуры<>0 Тогда
				СхемаПуста = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	Исключение
		
		Предупреждение="Ошибка заполнения сохраненной схемы монтажа"
		+Символы.ПС
		+"(скорее всего было изменено количество ручьев и/или этикеток на листе)."
		+Символы.ПС
		+"Сформируйте, пожалуйста, схему монтажа заново.";
		ТекстПредупреждения = НСтр("ru = "+Предупреждение);		
		
	КонецПопытки;
	
КонецПроцедуры //ПрочитатьСхемуМонтажа


&НаКлиенте
Процедура СформироватьПредупреждение() //+Лико m.shenderov 11/11/2019
	Если ЗначениеЗаполнено(ТекстПредупреждения) ТОгда
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		ТекстПредупреждения=Неопределено;
	КонецЕсли;
КонецПроцедуры //-Лико m.shenderov 11/11/2019


&НаСервере 
Процедура ПроверитьСоздатьКнопкуНомераМонтажа(НомерМонтажа)
	
	ПрефиксИмени = "Монтаж";
	ИмяКнопки=ПрефиксИмени+Строка(НомерМонтажа);
	
	Если Элементы.ГруппаСхемыМонтажа.ПодчиненныеЭлементы.Найти(ИмяКнопки)=Неопределено Тогда
		
		
		КомандаФормы  = Команды.Добавить(ИмяКнопки);
		КомандаФормы.Действие = "КнопкаВыборМонтажаНажатие";
		Элементы.Добавить(ИмяКнопки,Тип("КнопкаФормы"), Элементы.ГруппаСхемыМонтажа);
		Элементы[ИмяКнопки].Заголовок = Строка(НомерМонтажа);
		Элементы[ИмяКнопки].ИмяКоманды = ИмяКнопки;
		Элементы[ИмяКнопки].Ширина = 5;
		Элементы[ИмяКнопки].Высота = 1;
		
		
	КонецЕсли;
	
КонецПроцедуры //ПроверитьСоздатьКнопкуНомераМонтажа

&НаКлиенте
Процедура КнопкаВыборМонтажаНажатие(Элемент)
	
	НомерТекущегоМонтажа = Число(СтрЗаменить(Элемент.Имя,"Монтаж",""));
	
	ПрочитатьСхемуМонтажа(НомерТекущегоМонтажа);
	ВключитьПометкуКнопкиВыбораМонтажа();
	
КонецПроцедуры //КнопкаВыборМонтажаНажатие


&НаСервере
Процедура ЗаполнитьИзЗаказаНаСервере()
	
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОчисткаМонтажаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьКнопкиМонтажей();

		КоличествоМонтажей = 0;
		НомерТекущегоМонтажа = 0; 			
		Объект.МонтажСхема.Очистить();
		Схема.Очистить();
		МонтажЗагрузитьСервер();
		

		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура МонтажЗагрузитьСервер() //+Лико m.shenderov 12/11/2019
	
	Объект.МонтажСоответствия.Загрузить(Объект.Товары.Выгрузить());		
	
КонецПроцедуры  //-Лико m.shenderov 12/11/2019




&НаКлиенте
Процедура ЗаполнитьИзЗаказа(Команда)
	Если Объект.МонтажСхема.Количество()>0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчисткаМонтажаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "При загрузке из заказа будут очищены все монтажи. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		КоличествоМонтажей          = 0;
		НомерТекущегоМонтажа        = 0; 			
		Объект.МонтажСхема.Очистить();
		Схема.Очистить();
		ЗагрузитьНоменклатуру();
	КонецЕсли;
		
	
		ЭтаФорма.Модифицированность=Истина;

	
КонецПроцедуры

&НаСервере
Процедура УдалитьКнопкиМонтажей() //+Лико m.shenderov 12/11/2019
Для НомерМонтажа=1 По КоличествоМонтажей Цикл
		
		
		ПрефиксИмени = "Монтаж";
		ИмяКнопки=ПрефиксИмени+Строка(НомерМонтажа);  	НайденныйЭлементФормы=Элементы.ГруппаСхемыМонтажа.ПодчиненныеЭлементы.Найти(ИмяКнопки);
		
		Если НайденныйЭлементФормы<>Неопределено Тогда
		
			 Команды.Удалить(Команды.Найти(НайденныйЭлементФормы.ИмяКоманды));
		     Элементы.Удалить(НайденныйЭлементФормы);


		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры  //-Лико m.shenderov 12/11/2019



&НаСервере
Процедура ЗагрузитьНоменклатуру() //+Лико m.shenderov 11/11/2019
	
	Объект.МонтажСоответствия.Загрузить(Объект.Товары.Выгрузить());			
	
	
КонецПроцедуры  //-Лико m.shenderov 11/11/2019




&НаСервере
Процедура ДобавитьМонтажНаСервере()
	// Insert handler content.
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьМонтаж(Команда)
	КоличествоМонтажей = КоличествоМонтажей + 1;
	НомерТекущегоМонтажа = КоличествоМонтажей;
	
	ПроверитьСоздатьКнопкуНомераМонтажа(НомерТекущегоМонтажа);
	
	СоздатьКолонкиСхемы();
	ВключитьПометкуКнопкиВыбораМонтажа();
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьМонтаж(Команда)
	Для Каждого СтрокаСхема Из Схема Цикл
		Для  Колонка=1 По 40 Цикл
			СтрокаСхема["Колонка"+Колонка] = 0;
		КонецЦикла;
	КонецЦикла;
	//Схема.Очистить();
	ЗаписатьМонтажиВТЧ();
		ЭтаФорма.Модифицированность=Истина;

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьМонтажиВТЧ()
	
	Если НомерТекущегоМонтажа=0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Индекс=1 По Схема.Количество() Цикл
		Для  Колонка=1 По КоличествоКолонокМонтажа Цикл
			СтрокаСхемы = Схема[Индекс-1];
			
			// x 00y 00z
			// x - порядковый номер монтажа
			// y - индекс строки конкретного монтажа
			// z - индекс колонки конкретного монтажа
			ТекущийИндексСтроки = НомерТекущегоМонтажа*1000000 + Индекс*1000 + Число(Колонка);
			
			ЗаписатьМонтажнуюСхему(ТекущийИндексСтроки,СтрокаСхемы["Колонка"+Колонка],Колонка);			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //ЗаписатьМонтажСхему

&НаСервере
Процедура ЗаписатьМонтажнуюСхему(ТекущийИндексСтроки,СтрокаСхемы,Колонка) //+Лико m.shenderov 11/11/2019
	Структура = Новый Структура;
	Структура.Вставить("ИндексСтроки",ТекущийИндексСтроки);
	СтрокаПоиска = Объект.МонтажСхема.НайтиСтроки(Структура);
	Если СтрокаПоиска.Количество()=0 Тогда
		
		НоваяСтрока = Объект.МонтажСхема.Добавить();
		НоваяСтрока.ИндексСтроки = ТекущийИндексСтроки;
		НоваяСтрока.ИндексНоменклатуры = СтрокаСхемы;
		
	Иначе
		
		СтрокаПоиска[0].ИндексНоменклатуры = СтрокаСхемы;
		
	КонецЕсли;
	
КонецПроцедуры  //-Лико m.shenderov 11/11/2019


&НаКлиенте
Процедура ЗаполнитьПоПервойМонтаж(Команда)
	
	Для Счетчик=2 По Схема.Количество() Цикл
		
		Строка0Схемы = Схема[0];
		СтрокаСхемы = Схема[Счетчик-1];
		
		ЗаполнитьЗначенияСвойств(СтрокаСхемы, Строка0Схемы);
		
	КонецЦикла;
	
	СхемаПуста = Ложь;
	
	ЭтаФорма.Модифицированность = Истина;
	
	ЗаписатьМонтажиВТЧ();
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры


&НаКлиенте
Процедура СхемаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для каждого СторкаЗаказа Из Элементы.МонтажСоответствия.ВыделенныеСтроки Цикл
		Данные=Элементы.МонтажСоответствия.ДанныеСтроки(СторкаЗаказа);
		
		Если Поле=Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Схема.НайтиПоИдентификатору(Строка)[СтрЗаменить(Поле.Имя,"Схема","")]=Данные.НомерСтроки;
		//ПолеСтр = Данные.НомерСтроки;
		
		СхемаПуста = Ложь;
		
		ЭтаФорма.Модифицированность = Истина;
		
		ЗаписатьМонтажиВТЧ();
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	//ЭтаФорма.Модифицированность=Ложь;
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура СохранитьМонтажНаСервере()
	РеквизитОбъект=РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ОбменДанными.Загрузка=Истина;
	РеквизитОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры


&НаКлиенте
Процедура СохранитьМонтаж(Команда)
	СохранитьМонтажНаСервере();
	Модифицированность=Ложь;
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьСхемуМонтажа(Команда)
	Массив = Новый Массив();
	Для каждого СтрМонтажСхема Из Объект.МонтажСхема Цикл
		КодМонтажа=Строка(КоличествоМонтажей)+",";
		ДлиннаКодаМонтажа=СтрДлина(КодМонтажа);

		Если Лев(СтрМонтажСхема.ИндексСтроки,ДлиннаКодаМонтажа)=КодМонтажа Тогда
			Массив.Добавить(СтрМонтажСхема.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	Для каждого СтрМассив Из Массив Цикл
		   Объект.МонтажСхема.Удалить(СтрМассив);
	КонецЦикла;
	
	
	КоличествоМонтажей = КоличествоМонтажей -1;
	УбратьВидимостьКолонокСхемы();
	УстановитьВидимостьКолонокСхемы();
	
	ПрочитатьСхемыМонтажей(Ложь);

КонецПроцедуры


&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
				
		ЭтаФорма.Модифицированность = Истина;
		
		ЗаписатьМонтажиВТЧ();

КонецПроцедуры

