
////////////////////////////////////////////////////////////////////////////////
// Подсистема "WebSocket".
// ОбщийМодуль.WebSocketСервер.
////////////////////////////////////////////////////////////////////////////////

//Для Подключения вебсокита на форме необходимо выполнить следующие действия:
//	
//1. Добавить группу в элементах формы с именем  "GroupWebSocket";
//2. Добавить реквизит формы  "WebSocketMessage" тип "Произвольный";

////3. В процедуре формы "ПриСозданииНаСервере" добавить код:


//// Подсистема WebSocket
//ПоказыватьQRCode=Ложь;
//WebSocketСервер.Инициализация(ЭтаФорма,ПоказыватьQRCode);
//// Подсистема WebSocket
//	  

////4. В модуль формы добавить процедуры:

//          
//// Подсистема WebSocket
//&НаКлиенте
//Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
//	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);	
//КонецПроцедуры  

//&НаКлиенте
//Процедура WebSocketОбработкаШтрихКода() Экспорт 
//	Если ВводДоступен() Тогда
//		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
//	КонецЕсли;   
//КонецПроцедуры 

//// Подсистема WebSocket

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

	   
Функция Settings() Экспорт //+Лико m.shenderov 19.06.2021
	Возврат Справочники.HTTPConnections.Settings(Справочники.HTTPСервисы.INT);

	Возврат  SettingsTest();
	Структура = Новый Структура;
	//Структура.Вставить("username","1ctester");
	//Структура.Вставить("password","1365709585");
	
	Структура.Вставить("username","i-portal");
	Структура.Вставить("password","3457Qe!56785");

	//Структура.Вставить("WebSocketURL","https://i.okil.ru/interconnection");
	Структура.Вставить("WebSocketURL","https://int.okil.ru/ws");
	
	Структура.Вставить("domain","int.okil.ru");
	Структура.Вставить("ApiEndPoint_Send","api/v1/talks/message");
    Структура.Вставить("usernameToken","i-portal");
	Структура.Вставить("passwordToken","3457Qe!56785");
    Структура.Вставить("ApiEndPoint_Token","api/v1/signin");
	Структура.Вставить("ApiEndPoint_AttachFiles","/api/v1/ext/init");

	
	Возврат Структура;  
КонецФункции //-Лико m.shenderov 19.06.2021 


	   
Функция SettingsTest() Экспорт //+Лико m.shenderov 19.06.2021
	Возврат Справочники.HTTPConnections.Settings(Справочники.HTTPСервисы.INT);
	Структура = Новый Структура;
	//Структура.Вставить("username","1ctester");
	//Структура.Вставить("password","1365709585");
	Структура.Вставить("username","i-portal");
	Структура.Вставить("password","3457Qe!56785");

	
	//Структура.Вставить("WebSocketURL","https://i.okil.ru/interconnection");
	Структура.Вставить("WebSocketURL","https://int-dev.okil.ru/ws");
	
	Структура.Вставить("domain","int-dev.okil.ru");
	Структура.Вставить("ApiEndPoint_Send","api/v1/talks/message");
    Структура.Вставить("usernameToken","i-portal");
	Структура.Вставить("passwordToken","3457Qe!56785");
    Структура.Вставить("ApiEndPoint_Token","api/v1/signin");
	Структура.Вставить("ApiEndPoint_AttachFiles","/api/v1/ext/init");

	
	Возврат Структура;  
КонецФункции //-Лико m.shenderov 19.06.2021 


Процедура Инициализация(Форма, 
                                                                                              WebSocketПоказыватьQRCode = Ложь,
                                                                                              Группа    = "GroupWebSocket",
                                                                                              Settings = Неопределено,
                                                                                              url = Неопределено,
                                                                                              payload = Неопределено,
                                                                                              КодРабочегоМеста = Неопределено,
                                                                                              Оператор = Неопределено,
                                                                                              ТабельныйНомер = неопределено) Экспорт  //+Лико m.shenderov 19.06.2021
                
                КолПопыток=2; 
				
                Пока КолПопыток>0 Цикл
                               Попытка
                                    ИнициализацияПопытка(Форма,WebSocketПоказыватьQRCode,Группа,Settings,url,payload,КодРабочегоМеста, Оператор, ТабельныйНомер);
                                               Возврат;
                               Исключение
                                               //ОписаниеОшибки()
                               КонецПопытки;              
                               
                               КолПопыток=КолПопыток-1;   
                КонецЦикла;
                
    Сообщить("QR-код не сформирован!");                

                
                
                
                
                
КонецПроцедуры //-Лико m.shenderov 19.06.2021
   
Процедура ИнициализацияПопытка(Форма, 
	WebSocketПоказыватьQRCode = Ложь,
	Группа    = "GroupWebSocket",
	Settings = Неопределено,
	url = Неопределено,
	payload=Неопределено,
	КодРабочегоМеста=Неопределено,
	Оператор = Неопределено,
	ТабельныйНомер = неопределено) Экспорт  //+Лико m.shenderov 19.06.2021
	
	ВключитьWebSocket=Справочники.Лико_ПредопределенныеЗначения.ВключитьWebSocket.ЗначениеПараметра;
	
	Если НЕ (ТипЗнч(ВключитьWebSocket)=Тип("Булево") И 
		ВключитьWebSocket И 
		ПараметрыСеанса.Лико_РабочееМесто.WebSocket) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Форма.Элементы.Найти(Группа)=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если КодРабочегоМеста=Неопределено Тогда
		КодРабочегоМеста=ПолучитьКодРабочегоМеста();
	КонецЕсли;
	
	Если Оператор=Неопределено Тогда
		Оператор=Строка(ПараметрыСеанса.Лико_РабочееМесто.СотрудникПоF2);
	КонецЕсли;
	
	
	
	
	Если Не ЗначениеЗаполнено(КодРабочегоМеста) Тогда
		Возврат;
	КонецЕсли;
	
	Если Settings=Неопределено Тогда
		Settings=Settings();
	КонецЕсли;
	
	////+AttachFiles
	action= "attach-files";
	
	//Если  ЭтоИнфопад() Тогда
	Если payload=Неопределено Тогда
		payload = Новый Структура;
		payload.Вставить("workplace",КодРабочегоМеста);    
		payload.Вставить("fullName", СтрШаблон("%1", Оператор));
		payload.Вставить("personNumber", СтрШаблон("%1", ТабельныйНомер));
		action= "infopad";
	КонецЕсли; 
	
	Структура = Новый Структура;
	Структура.Вставить("action",action);
	Структура.Вставить("payload",payload);
	Структура.Вставить("ttl",720); 
	Структура.Вставить("refresh",Ложь);
	
	
	//Иначе 
	//               
	//               Если payload=Неопределено Тогда
	//                               payload = Новый Структура;
	//                               payload.Вставить("handler","SendTo1C");
	//                               payload.Вставить("workplace",КодРабочегоМеста);
	//                               //payload.Вставить("fullName",Оператор);
	//                               //payload.Вставить("personNumber",ТабельныйНомер);
	//                               
	//                               action= "barcode-scanner";
	//               КонецЕсли; 
	//               
	//               Структура = Новый Структура;
	//               Структура.Вставить("action",action);
	//               Структура.Вставить("payload",payload);
	//               Структура.Вставить("ttl",30); 
	//               Структура.Вставить("refresh",Истина); 
	//               
	//КонецЕсли;
	
	
	
	Json    = WebSocketСервер.СтруктураВJSON(Структура);                           
	Settings= WebSocketСервер.SettingsTest();
	Token   = WebSocketСервер.ПолучитьToken(Settings);  
	
	ssl      = Новый ЗащищенноеСоединениеOpenSSL();
	
	Массив = Новый Массив();
	Массив.Добавить(Новый Структура("Authorization", СтрШаблон("Bearer %1",Token)));
	
	HttpRespons     = WebSocketСервер.HttpRequest(Settings.domain,Settings.ApiEndPoint_AttachFiles,Json,ssl,,Массив);
	ОтветПотокаJSON = WebSocketСервер.ПолучитьОтветJSON(HttpRespons);                     
	
	Если ОтветПотокаJSON.Свойство("uuid") Тогда 
		uuid_=ОтветПотокаJSON.uuid;
		//КодРабочегоМеста=WebSocketСервер.ПолучитьКодРабочегоМеста();
		
		url=WebSocketСервер.url(WebSocketСервер.settingsTest(),Новый Структура("ext,subject",uuid_,КодРабочегоМеста));    
	КонецЕсли;
	
	
	
	
	
	////-AttachFiles
	ДобавляемыеРеквизиты           = Новый Массив;
	
	Если не  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "WebSocketПоказыватьQRCode")Тогда 
		
		
		ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("WebSocketПоказыватьQRCode",Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)),, "WebSocketПоказыватьQRCode"));
		
		
		
		ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("WebSocketURL",Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)),, "WebSocketURL"));
		
		ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("WebSocketSubject",Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)),, "WebSocketSubject"));
		
		ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("WebSocketUUID",Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная)),, "WebSocketUUID"));
		
		ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("FormGUID",Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная)),, "FormGUID"));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	
	Форма.WebSocketSubject=КодРабочегоМеста;
	Форма.FormGUID=Строка(Новый УникальныйИдентификатор);
	Форма.WebSocketПоказыватьQRCode=WebSocketПоказыватьQRCode;
	
	Если url=Неопределено Тогда
		url =СтрШаблон("%1?username=%2&password=%3&subject=%4",Settings.WebSocketURL,Settings.username,Settings.password,Форма.WebSocketSubject);
	КонецЕсли;
	
	
	Форма.WebSocketURL=url;
	
	Если  Форма.Элементы.Найти("WebSocketURL") = неопределено Тогда
		
		Элемент                        = Форма.Элементы.Добавить("WebSocketURL", Тип("ПолеФормы"),Форма.Элементы[Группа]); 
		Элемент.Вид                    = ВидПоляФормы.ПолеHTMLДокумента;
		Элемент.ПутьКДанным            = "WebSocketURL";
		Элемент.АвтоМаксимальнаяВысота = Ложь;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.Ширина                 = 1;
		Элемент.Высота                 = 1;
		Элемент.Доступность            = WebSocketПоказыватьQRCode;
		Элемент.ПоложениеЗаголовка     = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ЦветРамки              = ЦветаСтиля.ЦветФонаФормы;
		Элемент.УстановитьДействие("ПриНажатии","WebSocketURLПриНажатии");
		Элемент.УстановитьДействие("ДокументСформирован","WebSocketДокументСформирован");
		
	КонецЕсли;
	//Док = Форма.Элементы.WebSocketURL.Документ; 
	//Док.forms["form"].subject.Value  = Форма.WebSocketSubject; 
	//Док.forms["form"].username.Value = Settings.username;
	//Док.forms["form"].password.Value = Settings.password;
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 19.06.2021

Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) 
    
    КлючУникальности   = Новый УникальныйИдентификатор;
    СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
    ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
    
    Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
    
КонецФункции



Процедура ИнициализацияNew(Форма,WebSocketПоказыватьQRCode=Ложь,Группа="GroupWebSocket",Settings=Неопределено,url=Неопределено) Экспорт  //+Лико m.shenderov 19.06.2021
	
	
	КолПопыток=2;
	
	Пока КолПопыток>0 Цикл
		Попытка
			ИнициализацияNewПопытка(Форма,WebSocketПоказыватьQRCode,Группа,Settings,url);
			Возврат;
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;	
		
		КолПопыток=КолПопыток-1;	
	КонецЦикла;
	
  Сообщить("QR-код не сформирован!");       	
	

КонецПроцедуры //-Лико m.shenderov 19.06.2021

Процедура ИнициализацияNewПопытка(Форма,WebSocketПоказыватьQRCode=Ложь,Группа="GroupWebSocket",Settings=Неопределено,url=Неопределено) Экспорт  //+Лико m.shenderov 19.06.2021
	 ВключитьWebSocket=Справочники.Лико_ПредопределенныеЗначения.ВключитьWebSocket.ЗначениеПараметра;
	 
	 Если НЕ (ТипЗнч(ВключитьWebSocket)=Тип("Булево") И 
		 ВключитьWebSocket И 
		 ПараметрыСеанса.Лико_РабочееМесто.WebSocket) Тогда
		 Возврат;
	 КонецЕсли;
	 
	
	Если Форма.Элементы.Найти(Группа)=Неопределено Тогда
       Возврат;
   КонецЕсли;
   КодРабочегоМеста=ПолучитьКодРабочегоМеста();
   Если Не ЗначениеЗаполнено(КодРабочегоМеста) Тогда 
	 	   Возврат;
   КонецЕсли;
   
   Если Settings=Неопределено Тогда
	   Settings=Settings();
   КонецЕсли;
   
   ДобавляемыеРеквизиты	= Новый Массив;
   
    ДобавляемыеРеквизиты.Добавить(
   Новый РеквизитФормы("WebSocketПоказыватьQRCode",Новый ОписаниеТипов("Строка", ,
   Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)),, "WebSocketПоказыватьQRCode"));

 
   
   ДобавляемыеРеквизиты.Добавить(
   Новый РеквизитФормы("WebSocketURL",Новый ОписаниеТипов("Строка", ,
   Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)),, "WebSocketURL"));
   
   ДобавляемыеРеквизиты.Добавить(
   Новый РеквизитФормы("WebSocketSubject",Новый ОписаниеТипов("Строка", ,
   Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)),, "WebSocketSubject"));
   
   ДобавляемыеРеквизиты.Добавить(
   Новый РеквизитФормы("WebSocketUUID",Новый ОписаниеТипов("Строка", ,
   Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная)),, "WebSocketUUID"));
   
    ДобавляемыеРеквизиты.Добавить(
   Новый РеквизитФормы("FormGUID",Новый ОписаниеТипов("Строка", ,
   Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная)),, "FormGUID"));
   Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

   Форма.WebSocketSubject=КодРабочегоМеста;
   Форма.FormGUID=Строка(Новый УникальныйИдентификатор);
   Форма.WebSocketПоказыватьQRCode=WebSocketПоказыватьQRCode;
   
   Если url=Неопределено Тогда
	   url =СтрШаблон("%1?username=%2&password=%3&subject=%4",Settings.WebSocketURL,Settings.username,Settings.password,Форма.WebSocketSubject);
   КонецЕсли;
   
   Форма.WebSocketURL=url;

   
    Элемент                        = Форма.Элементы.Добавить("WebSocketURL", Тип("ПолеФормы"),Форма.Элементы[Группа]); 
	Элемент.Вид                    = ВидПоляФормы.ПолеHTMLДокумента;
	Элемент.ПутьКДанным            = "WebSocketURL";
	Элемент.АвтоМаксимальнаяВысота = Ложь;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.Ширина                 = 1;
	Элемент.Высота                 = 1;
	Элемент.Доступность            = WebSocketПоказыватьQRCode;
	Элемент.ПоложениеЗаголовка     = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.ЦветРамки              = ЦветаСтиля.ЦветФонаФормы;
    Элемент.УстановитьДействие("ПриНажатии","WebSocketURLПриНажатии");
	Элемент.УстановитьДействие("ДокументСформирован","WebSocketДокументСформирован");

   
							
																  


КонецПроцедуры //-Лико m.shenderov 19.06.2021


Функция ПолучитьКодРабочегоМеста() Экспорт //+Лико m.shenderov 04.04.2021
	
	РМ            = ПараметрыСеанса.Лико_РабочееМесто;
	ИмяКомпьютера = ПараметрыСеанса.РабочееМестоКлиента.ИмяКомпьютера;
	Если Не ЗначениеЗаполнено(РМ.ИмяКомпьютера) Тогда 
		Если  ЗначениеЗаполнено(ИмяКомпьютера) Тогда 
			Возврат СтрШаблон("%1(%2)",РМ,ИмяКомпьютера);
			
		Иначе
			
			Возврат Неопределено;
		КонецЕсли;
	Иначе 
		Возврат  ПараметрыСеанса.Лико_РабочееМесто.Наименование;
	КонецЕсли;	
	
КонецФункции  //-Лико m.shenderov 04.04.2021

Процедура ОтправитьСообщение(Форма,Контент) Экспорт  //+Лико m.shenderov 17.06.2021
	Token=ПолучитьToken();
	Если Не ЗначениеЗаполнено(Token) Тогда 		
		Возврат ; 		
	КонецЕсли;
	
	Settings=Settings();
	Контент.Вставить("FormGUID",Форма.FormGUID);
	Контент.Вставить("DateTime",ТекущаяДата());
	Структура = Новый Структура;
	Структура.Вставить("talk_uuid", Форма.WebSocketUUID);	
	Структура.Вставить("content", СтруктураВJSON(Контент)); 	
	ТелоЗапроса=СтруктураВJSON(Структура);	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(); 	
	Попытка		
		Массив = Новый Массив();
		Массив.Добавить(Новый Структура("Authorization", СтрШаблон("Bearer %1",Token)));		
		HttpRespons=HttpRequest(Settings.Domain,Settings.ApiEndPoint_Send,ТелоЗапроса,ssl,,Массив); 		
	Исключение
		Сообщить(ОписаниеОшибки());		
		
	КонецПопытки;	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 17.06.2021

Функция ПолучитьToken(Settings=Неопределено) Экспорт  //+Лико m.shenderov 07.05.2021
	//ЗаполнитьЗначенияСвойств(Структура,СоздаваемыйКонтрагент);
	Если Settings=Неопределено Тогда
	Settings=Settings();
	КонецЕсли;

	
	Структура = Новый Структура;
	Структура.Вставить("username",Settings.UserNameToken);
	Структура.Вставить("password",Settings.passwordToken);
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура,НастройкиСериализациииJSON); 	
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL();
	
	Попытка
		
		HttpRespons=HttpRequest(Settings.domain,Settings.ApiEndPoint_Token,ТелоЗапроса,ssl,);
		ОтветПотокаJSON = ПолучитьОтветJSON(HttpRespons);		
		
		Если ОтветПотокаJSON.Свойство("token") Тогда 				
			Возврат  ОтветПотокаJSON.token;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
		Возврат Неопределено;

	КонецПопытки;

		
	
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция СтруктураВJSON(Структура) Экспорт  //+Лико m.shenderov 07.05.2021
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура,НастройкиСериализациииJSON); 	
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	 Возврат ТелоЗапроса; 
КонецФункции //-Лико m.shenderov 07.05.2021


Функция Base64To(json) Экспорт  //+Лико m.shenderov 23.10.2021
	
		Возврат  СтрЗаменить(СтрЗаменить(Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(json)),Символ(10),""),Символ(13),"");
	
	
КонецФункции //-Лико m.shenderov 23.10.2021 

Функция Url(Settings,Parameters) Экспорт  //+Лико m.shenderov 23.10.2021
	
	url =СтрШаблон("%1",Settings.WebSocketURL);
	i=0;
	Для каждого Param Из Parameters Цикл
		url =СтрШаблон("%1%2%3=%4",url,?(i=0,"?","&"),Param.Ключ,Param.Значение);
		i=i+1; 
	КонецЦикла;
	
	Возврат url;
	
КонецФункции //-Лико m.shenderov 23.10.2021 


Функция HttpRecuest(host,slug,json,ssl=Неопределено,port="",header="")Экспорт
	Возврат  HttpRequest(host,slug,json,ssl,port,header);	
КонецФункции

	

Функция HttpRequest(host,slug,json,ssl=Неопределено,port="",header="")Экспорт  //+Лико m.shenderov 07.05.2021
	
	СоединениеHTTP=Неопределено;	
	СтрКоманда=СтрШаблон("СоединениеHTTP = новый HTTPСоединение(%1,%2,,,,,%3)",
   "host",
	port,
	?(ssl=Неопределено,"","ssl"));
	Выполнить(СтрКоманда); 	
		
		HTTPЗапрос = Новый HTTPЗапрос(slug);
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		Если ТипЗнч(header)=Тип("Массив") Тогда
			 Для каждого Структура Из header Цикл 			
				   Для каждого Ключ Из  Структура Цикл
				   	     HTTPЗапрос.Заголовки.Вставить(Ключ.Ключ, Ключ.Значение);
				   КонецЦикла;
			   КонецЦикла;
		КонецЕсли;	   
		HTTPЗапрос.УстановитьТелоИзСтроки(json);		
	 Возврат СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция ПолучитьОтветJSON(HTTPОтвет) Экспорт//+Лико m.shenderov 07.05.2021
	
	    ПотокОтветаJSON  = HTTPОтвет.ПолучитьТелоКакПоток();
		ЧтениеПотокаJSON = Новый ЧтениеJSON;
		ЧтениеПотокаJSON.ОткрытьПоток(ПотокОтветаJSON, КодировкаТекста.UTF8);
		Результат=ПрочитатьJSON(ЧтениеПотокаJSON);
		ЧтениеПотокаJSON.Закрыть();
		Возврат Результат; 
		
		
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция ЭтоИнфопад() //+Лико m.shenderov 16.09.2022
	
	  Возврат ПараметрыСеанса.Лико_РабочееМесто.ТипРабочегоМеста=Перечисления.Лико_ТипыРабочегоМеста.Инфопад;
	
КонецФункции //-Лико m.shenderov 16.09.2022 
