
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВысотаШирина") Тогда
		Ширина = Параметры.ВысотаШирина.Ширина;
		Высота = Параметры.ВысотаШирина.Высота;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(Высота) ИЛИ ЗначениеЗаполнено(Ширина) Тогда
		Для Каждого Стр Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Стр) = Тип("ОтборКомпоновкиДанных") Тогда
				Стр.Элементы.Очистить();
				
				НовГруппаИ = Стр.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				НовГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				НовЭлементОтбора = НовГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовЭлементОтбора.Использование = Истина;
				НовЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ширина");
				НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				НовЭлементОтбора.ПравоеЗначение = Ширина;
				НовЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
				
				НовЭлементОтбора = НовГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовЭлементОтбора.Использование = Истина;
				НовЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Высота");
				НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				НовЭлементОтбора.ПравоеЗначение = Высота;
				НовЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
