&НаКлиенте
Перем ПропуститьВопросПередЗаписью; // Для отработки записи после вопроса

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Свойство("ЛикоЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЛикоЗначенияЗаполнения);
	КонецЕсли;
	
	
	УстановитьУсловноеОформление(); 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ПриЧтенииСозданииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Объект.ВидДокумента=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства;
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий); 		
		
		//Элементы.ГруппаИнформация.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
		ЭтоБылНовый=Истина;
		
		
	Иначе	
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТоварыОтбор;
		Если Объект.Проведен Тогда
			ЭтоБылПроведенный=Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ПечататьСкладОперацииДокументаПриПроведении=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечататьСкладОперацииДокументаПриПроведении",Ложь);
	ПроставитьЗаказВФормах();
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 	
	
	Если  РольДоступна("АдминистраторСистемы") Или РольДоступна("Лико_РедактированиеКоличестоУУ") Тогда
		Элементы.ТоварыКоличество.Видимость		=Истина;
		
		Элементы.ТоварыКоличество.ТолькоПросмотр	=Ложь; 	
		
	Иначе
		Элементы.ТоварыКоличество.ТолькоПросмотр=Истина;		  
	КонецЕсли;
	
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка",Объект.Ссылка);
	СписокТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("ПоказыватьДокумент",ЗначениеЗаполнено(Объект.Ссылка));
	
	// Подсистема WebSocket
	ПоказыватьQRCode=Ложь;
	WebSocketСервер.Инициализация(ЭтаФорма,ПоказыватьQRCode);
	// Подсистема WebSocket

	
КонецПроцедуры



&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//УсловноеОформление.Элементы.Очистить();
	
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма); 
	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);
	
	УстановитьУсловноеОформлениеВидаОпераци(ЭтаФорма);
	УстановитьУсловноеОформлениеЗаказаКлиента(ЭтаФорма,Объект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.Лико_ПередачаТоваров);
	
	
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов);
	
	
	ПересчитатьВесОбъемВСтрокахТЧ();
	//Элементы.ГруппаИнформация.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() 	
	Если Объект.ОтражатьВБухгалтерскомУчете Тогда
		Элементы.ГруппаЛикоБУ.Видимость=Истина;
		Если Объект.БезНДС Тогда 
			Элементы.ГруппаВхСФ.Видимость=Ложь;
			Элементы.Лико_ЦенаВключаетНДС.Видимость=Ложь;
		Иначе
			Элементы.ГруппаВхСФ.Видимость=Истина;
            Элементы.Лико_ЦенаВключаетНДС.Видимость=Истина;
			КонецЕсли;
	Иначе
		Элементы.ГруппаЛикоБУ.Видимость=Ложь;
	КонецЕсли;
	
	Элементы.ПричинаПрихода.Видимость = Ложь;	
	Элементы.ГруппаНомерЗаказа.Видимость	=Ложь;
	Элементы.Отправитель.Видимость=Ложь;	
	Элементы.Перегравировка.Видимость=Ложь;
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость	=Истина;
		Элементы.ГруппаФормы.Видимость			=Ложь;
		Элементы.ГруппаБрак.Видимость			=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость	=ИСтина;
		
		Элементы.ГруппаДополнительно.Видимость	=Ложь;
		Элементы.Отправитель.Заголовок			="Рабочий центр";
		Элементы.Отправитель.Видимость			=Истина;
		Элементы.Распоряжение.Видимость			=Ложь;
		
		Элементы.Отправитель.Видимость=Истина;	
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;	
		
		
	ИначеЕсли Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходПоАктуРазборки") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость	=Истина;
		Элементы.ГруппаФормы.Видимость			=Ложь;
		Элементы.ГруппаБрак.Видимость			=Ложь;
		Элементы.ГруппаНомерЗаказа.Видимость	=Ложь;
		
		Элементы.ГруппаДополнительно.Видимость	=Ложь;
		
		
		Элементы.Распоряжение.Видимость			=Ложь;
		
		Элементы.Отправитель.Видимость=Ложь;	
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;	
		Элементы.АдресХранения.Видимость=Истина;
		Элементы.ПричинаПрихода.Видимость = Истина;
		
		Если Не ЗначениеЗаполнено(Объект.Отправитель) Тогда
			Объект.Отправитель=ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка");
		КонецЕсли;
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки") Тогда	
		Элементы.ГруппаТоварыОтбор.Видимость=Истина;
		Элементы.ГруппаФормы.Видимость=Ложь;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Истина;
		Элементы.АдресХранения.Видимость=Истина;
		
		Элементы.Отправитель.Видимость=Ложь;	
		Элементы.ГруппаПартнерКонтрагент.Видимость=Истина;	
		
		Элементы.АдресХранения.Видимость=Истина;
		Элементы.Перегравировка.Видимость=Истина;
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Ложь;
		Элементы.ГруппаФормы.Видимость=Истина;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Если Не ЗначениеЗаполнено(Объект.Отправитель) Тогда
			Объект.Отправитель=ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка");
		КонецЕсли;
		Элементы.ШапкаПраво.Видимость=Ложь;
		
	ИначеЕсли  Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм") Тогда
		Элементы.ГруппаТоварыОтбор.Видимость=Ложь;
		Элементы.ГруппаФормы.Видимость=Истина;
		Элементы.ГруппаБрак.Видимость=Ложь;
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		
		Элементы.ГруппаНомерЗаказа.Видимость=ИСтина;
		
		Элементы.ГруппаДополнительно.Видимость=Ложь;
		Элементы.Отправитель.Заголовок="Рабочий центр";
		Элементы.Отправитель.Видимость=Истина;
		Элементы.Распоряжение.Видимость=Ложь;
		Элементы.АдресХранения.Видимость=Ложь;
		
		Элементы.Отправитель.Видимость=Истина;	
		Элементы.ГруппаПартнерКонтрагент.Видимость=Ложь;	
		
		
		
		
		Если Не ЗначениеЗаполнено(Объект.Отправитель) Тогда
			Объект.Отправитель=ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка");
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		Элементы.ВидОперации.ТолькоПросмотр=Истина;
	Иначе
		Элементы.ВидОперации.ТолькоПросмотр=Ложь;
	КонецЕсли;	
	
	
	Если Объект.ДанныеПоНаработке Тогда
		Элементы.ТоварыГруппаНаработки.Видимость=Истина;
		Для каждого Товар Из Объект.Товары Цикл  		
			лДанныеПоНаработке = Лико_Дополнительно.ПолучитьДанныеПоНаработке(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Серия,"ЯССМ_ОбъектНоменклатуры"), ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата-1)); 		
			Товар.НаработкаПредыдущихОпераций = лДанныеПоНаработке.ОбщаяНаработка;
			Товар.ПримечаниеПоПредыдущимНаработкам = лДанныеПоНаработке.Примечание;
			
		КонецЦикла;
		
		
		
	Иначе
		Элементы.ТоварыГруппаНаработки.Видимость=Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры 



&НаСервере
Процедура ПересчитатьВесОбъемВСтрокахТЧ()
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", "");
	
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Перем ТекущаяСтрока;
	Перем СтруктураДействий;
	Элементы.Товары.ТекущиеДанные.Серия=Неопределено;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	Суффикс = "";
	
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу"      , ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	//+m.shenderov 10.07.2017 
	
	Характеристика	=Элементы.Товары.ТекущиеДанные.Характеристика;
	Нарезка			=ПолучитьНарезку(Характеристика);
	Серия			=Элементы.Товары.ТекущиеДанные.Серия;
	ОБъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Серия,"ЯССМ_ОбъектНоменклатуры");
	Если ЗначениеЗаполнено(ОБъектНоменклатуры) И Характеристика<>Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОБъектНоменклатуры,"Характеристика") ТОгда
		Элементы.Товары.ТекущиеДанные.Серия					=Неопределено;
		Элементы.Товары.ТекущиеДанные.СтатусУказанияСерий	=7;
		Элементы.Товары.ТекущиеДанные.Упаковка				=Неопределено;
	КонецЕсли;
	
	
	
	
	//Если ЗначениеЗаполнено(Нарезка) Тогда
	//	Элементы.Товары.ТекущиеДанные.Упаковка=ПолучитьУпаковку(Нарезка);
	//	КоличествоУпаковокПриИзменении(Элемент);
	
	//Если ЗначениеЗаполнено(Серия)и Нарезка<>Серия.ЯССМ_ОбъектНоменклатуры.Нарезка Тогда
	//	ОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
	//	ОбъектНоменклатуры.Нарезка=Нарезка;
	//	ОбъектНоменклатуры.ЕдиницаИзмеренияУУ=Элементы.Товары.ТекущиеДанные.Упаковка;
	//	ОбъектНоменклатуры.Записать();
	//	Серия.ПолучитьОбъект.Записать();			
	//КонецЕсли;		
	//КонецЕсли;	
	//-m.shenderov 10.07.2017	
	
КонецПроцедуры


//+m.shenderov 10.07.2017  
#Область Дополнительно
&НаСервереБезКонтекста
Функция ПолучитьНарезку (Характеристика)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,"ЯССМ_Нарезка")	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУпаковку(Нарезка)
	Возврат	Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка)
	
КонецФункции

&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);		
КонецФункции 

&НаКлиенте
Процедура ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры)
	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	КоличествоЭкземпляров=0;
	
	ТабДокумент=Лико_Дополнительно.ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры,,БыстраяПечать);
	//!ТабДокумент.ИмяПринтера = ИмяПринтера;
	
	//
	//ТабДокумент.АвтоМасштаб = Истина;
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.ПолеСлева = 1;
	//ТабДокумент.ПолеСправа = 0;
	//ТабДокумент.ПолеСнизу = 0;
	//ТабДокумент.ПолеСверху = 1;
	////
	//ТабДокумент.РазмерСтраницы="Custom";//нестандартный размер бумаги
	//ТабДокумент.ВысотаСтраницы=64;
	//ТабДокумент.ШиринаСтраницы=90; 		
	
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ТабДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если БыстраяПечать Тогда
		ТабДокумент.Напечатать();
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;  	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Суффикс = "";
	
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПереработки") Или
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходПоАктуРазборки")Тогда
		
		Товар=Элементы.Товары.ТекущиеДанные;	
		Структура = Новый Структура;
		Структура.Вставить("ВидОперации","ДобавитьВОрдер");
		Если Товар<>Неопределено и  УчетПоСериям(Товар.Номенклатура) Тогда  
			Структура.Вставить("Номенклатура",Товар.Номенклатура);
			Структура.Вставить("Характеристика",Товар.Характеристика);
		КонецЕсли;
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ПодборСерийЗавершение",ЭтаФорма);
		ОткрытьФорму("Обработка.Лико_СозданиеОбъектовНоменклатурыГрупповое.Форма.Форма",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		
	Иначе
		ОткрытьПодборСерий("Товары");
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПодборСерий(ИмяТЧ, Текст = "", ТекущиеДанные = Неопределено)
	//Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные) Тогда
	
	
	
	
	//НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные) ;
	
	//Если ТекущиеДанные=Неопределено Тогда
	
	Номенклатура=Элементы.Товары.ТекущиеДанные.Номенклатура;
	Характеристика=Элементы.Товары.ТекущиеДанные.Характеристика;
	//    Иначе
	//    Номенклатура=ТекущиеДанные.Номенклатура;
	//    Характеристика=ТекущиеДанные.Характеристика;  		 
	//КонецЕсли;
	
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Номенклатура);
	Структура.Вставить("Характеристика",Характеристика);
	Структура.Вставить("Склад",Объект.Склад);
	Структура.Вставить("ТолькоОстатки",Истина);
	
	
	
	
	
	//Структура = Новый Структура;
	//Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
	//Структура.Вставить("Характеристика",ТекущиеДанные.Характеристика);
	//Структура.Вставить("Склад",Объект.Склад);
	//Структура.Вставить("ТолькоОстатки",Истина);
	
	
	ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПодборСерийЗавершение(РезультатФорма,ПараметрыФорма) Экспорт 
	
	Если ТипЗнч(РезультатФорма)=Тип("Массив") Тогда
		
		Для каждого Серия Из РезультатФорма  Цикл
			
			СтруктураНоменклатуры=ПолучитьСтруктуруСерии(Серия);
			
			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура",СтруктураНоменклатуры.Номенклатура);
			СтруктураОтбора.Вставить("Характеристика",СтруктураНоменклатуры.Характеристика);
			СтруктураОтбора.Вставить("Серия",ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
			
			СтрокиСПустымиСериями=Объект.Товары.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаСПустйСерией Из СтрокиСПустымиСериями Цикл				
				Объект.Товары.Удалить(Объект.Товары.Индекс(СтрокаСПустйСерией));				
			КонецЦикла;
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 				 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатуры);
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=8;
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");      
				Действия 			= Новый Структура();
				ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( Действия,"");	
				Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НовыйТовар,Действия,КэшированныеЗначения);			
				
				// --> Начало Лико Ефимов ЕВВ 27.08.2021
				ЗаполнитьДанныеПоНаработке(НовыйТовар);
				// <-- Конец Лико Ефимов ЕВВ 27.08.2021
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер();
		
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер() //+Лико m.shenderov 25.10.2017
	
	//ЗаполнитьСлужебныеРеквизитыТЧТовары();
	
КонецПроцедуры  //-Лико m.shenderov 25.10.2017



&НаСервереБезКонтекста
Функция УчетПоСериям(Товар) //+Лико m.shenderov 25.10.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВидыНоменклатуры.Ссылка = Номенклатура.ВидНоменклатуры
	|ГДЕ
	|	Номенклатура.Ссылка = &Товар
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыНоменклатуры.ИспользоватьСерии";
	Запрос.УстановитьПараметр("Товар",Товар );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИспользоватьСерии;
	КонецЦикла; 
	
	Возврат Ложь;
	
	
КонецФункции  //-Лико m.shenderov 25.10.2017



&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(ИмяТЧ, Текст, ТекущиеДанные)
	// Вставить содержимое метода.
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий[ИмяТЧ],Текст, ТекущиеДанные)
		и Лико_ОбщегоНазначенияСервер.ЕстьОбъектНоменклатуры(ТекущиеДанные.Номенклатура,ТекущиеДанные.Характеристика) Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",ТекущиеДанные.Характеристика);
		Структура.Вставить("Склад",Объект.Склад);
		Структура.Вставить("ТолькоОстатки",Истина);
		
		
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;	 
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ОткрытьПодборСерийЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 28.09.2017
	
	Если РезультатФормы<>Неопределено Тогда
		Счет=0;
		Для каждого Результат Из РезультатФормы Цикл
			Счет=Счет+1;
			Если Счет=1 И  ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Серия) Тогда
				Счет=2;
			КонецЕсли;
			
			Если Счет>1 Тогда 	
				Отбор= Новый Структура;
				Отбор.Вставить("Серия",Результат.Серия);
				НайденныеСтроки=Объект.Товары.НайтиСтроки(Отбор); 
				Если  НайденныеСтроки.Количество()>0 Тогда
					Элементы.Товары.ТекущаяСтрока=Объект.Товары.Индекс(НайденныеСтроки[0]);
					Для каждого Стр Из НайденныеСтроки Цикл
						
					КонецЦикла;
				Иначе
					Элементы.Товары.СкопироватьСтроку();
				КонецЕсли;
				
			КонецЕсли; 			
			ТекСтрока				=Элементы.Товары.ТекущиеДанные;			
			ТекСтрока.Серия			=Результат.Серия;
			Данныесерии				=ПолучитьДанныеПоСерии(Результат.Серия);
			ТекСтрока.Упаковка		=ДанныеСерии.Упаковка;
			ТекСтрока.АдресХранения	=Результат.АдресХранения;
			ТекСтрока.КоличествоУпаковок=Данныесерии.Количество; 
			ТекСтрока.СтатусУказанияСерий=8;
			
			Действия 			= Новый Структура();
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( Действия,"");	
			//Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекСтрока,Действия,КэшированныеЗначения);						
		КонецЦикла;
	КонецЕсли;
	УдалитьСтрокиТоварыБезАдресаХранения();
	
КонецПроцедуры //-Лико m.shenderov 28.09.2017

Процедура УдалитьСтрокиТоварыБезАдресаХранения() //+Лико m.shenderov 27/11/2019
	
	Если Объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства Тогда
		Структура = Новый Структура;
		Структура.Вставить("АдресХранения",Справочники.СкладскиеЯчейки.ПустаяСсылка());
		
		НайденныеСтроки=Объект.Товары.НайтиСтроки(Структура);
		Для каждого НайденаяСтрока Из НайденныеСтроки Цикл
			Объект.Товары.Удалить(ОБъект.Товары.Индекс(НайденаяСтрока));
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 27/11/2019





&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор, ИмяТЧ)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(Объект, ПараметрыУказанияСерий, ТекущиеДанныеИдентификатор, ЭтаФорма);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоСерии(Серия) //+Лико m.shenderov 28.09.2017
	Если Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
		Количество= Серия.ЯССМ_ОбъектНоменклатуры.Количество;
	Иначе
		Количество=1
	КонецЕсли;
	
	//Серия=Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Структура = Новый Структура;
	Структура.Вставить("Количество",Количество);
	Структура.Вставить("Упаковка",Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);	
	Возврат Структура; 
	
	
КонецФункции  //-Лико m.shenderov 28.09.2017


&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СкладПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер () //+Лико m.shenderov 10.10.2017
	
	ПриЧтенииСозданииНаСервере();		
	ЗаполнитьСтатусыУказанияСерий();
КонецПроцедуры  //-Лико m.shenderov 10.10.2017

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерий() //+Лико m.shenderov 10.10.2017
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	
КонецПроцедуры  //-Лико m.shenderov 10.10.2017





&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	// <-- Начало Лико Яцун С. В. 16.02.2026 
	ТекстОповещениеПользователю = ПроверитьНеобходимостьУтилизацииФорм();
	Если ЗначениеЗаполнено(ТекстОповещениеПользователю) Тогда
		ПоказатьПредупреждение(,ТекстОповещениеПользователю,,"Хранение/Утилизация Форм");
	КонецЕсли;
	//ПоказатьОповещениеПользователя("Утилизация/Хранение Форм",,ПроверитьНеобходимостьУтилизацииФорм(),БиблиотекаКартинок.ВниманиеТонкоеОранжевое,СтатусОповещенияПользователя.Информация);
	// <-- Конец Лико Яцун С. В. 16.02.2026
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор)и  Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ОчиститьСообщения(); 	
		//ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","Лико_ВозвратТоваров");
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		Отказ=Истина;
	КонецЕсли; 
	
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		//Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		//	Сообщить("Не выполнена авторизация!");
		//	Отказ=Истина;
		//КонецЕсли;
		Объект.АвторДокумента=ГлЛико_Оператор;
	КонецЕсли;
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьВидимость();
КонецПроцедуры



// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Объект.Отправитель=Неопределено;
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		ПометитьНаУдалениеРаспоряжение(Объект.Распоряжение);	
		Объект.Распоряжение=Неопределено;	
	КонецЕсли;
	УстановитьВидимость();
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм") Или 
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм") Тогда
		Объект.Товары.Очистить();
	Иначе
		Объект.Формы.Очистить();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	УстановитьУсловноеОформление();
	ПриЧтенииСозданииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
	УстановитьВидимость();
	
	
	Если ЭтоБылНовый И ПечататьСкладОперацииДокументаПриПроведении И Объект.Проведен Тогда
		//	Если Объект.Товары.Количество()>5 Тогда
		//		ОписаниеОповещения= Новый ОписаниеОповещения("ПослеЗаписиПечатьСкладскойКарточки",ЭтаФорма);
		//		ПоказатьВопрос(ОписаниеОповещения,"Пеатать карточку складской операции?",РежимДиалогаВопрос.ДаНет);
		//	Иначе 			
		ПечатьСкладскойКарточки(Неопределено);
		
		//КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиПечатьСкладскойКарточки(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 15.05.2018
	
	Если  РезультатФормы= КодВозвратаДиалога.Да Тогда
		ПечатьСкладскойКарточки(Неопределено);
	КонецЕсли;
КонецПроцедуры //-Лико m.shenderov 15.05.2018



&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеВидаОпераци(Форма,
	ИмяПоляВводаВидОперации = "ВидОперации",
	ПутьКПолюОтбора = "Объект.Проведен") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаВидОперации].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения    = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение  = Истина;
	
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры





Процедура ПометитьНаУдалениеРаспоряжение(Ссылка) //+Лико m.shenderov 16.10.2017
	
	ОбъектСсылка=Ссылка.получитьОбъект();
	ОбъектСсылка.ПометкаУдаления=Истина;
	ОбъектСсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //-Лико m.shenderov 16.10.2017

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихКодДокумента(МассивСсылок) //+Лико m.shenderov 23.08.2018
	
	Для каждого СсылкаДокумента Из МассивСсылок Цикл
		
		Если ТипЗНЧ(СсылкаДокумента)=Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
			Объект.ЗаявкаНаСклад=СсылкаДокумента;
			Тз=Объект.ЗаявкаНаСклад.Товары.Выгрузить();
			Тз.Свернуть("Номенклатура, характеристика");
			Объект.Товары.Загрузить(Тз);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий); 	
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
КонецПроцедуры  //-Лико m.shenderov 23.08.2018

&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоШтрихкодуТабличногоДокументаСервер(Штрихкод) //+Лико m.shenderov 23.08.2018
	МенеджерыОбъектов = Новый Массив();
	МенеджерыОбъектов.Добавить(Документы.Лико_ЗаявкаНаСклад.ПустаяСсылка());
	Возврат	ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, МенеджерыОбъектов);
	
	
КонецФункции  //-Лико m.shenderov 23.08.2018



&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		МенеджерыОбъектов = Новый Массив();
		МенеджерыОбъектов.Добавить(ПредопределенноеЗначение("Документ.Лико_ЗаявкаНаСклад.ПустаяСсылка"));
		
		МассивСсылок =ПолучитьСсылкуПоШтрихкодуТабличногоДокументаСервер(ДанныеШтрихкода.Штрихкод);
		Если МассивСсылок.Количество()<>0 Тогда
			ОбработатьШтрихКодДокумента(МассивСсылок);
			УстановитьВидимость();
		Иначе
			
			
			Сообщить(Результат.Ошибка);
		КонецЕсли;
		
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			Объект.НомерБланка=Результат.НомерБланка;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа); 		
		ИначеЕсли Результат.ВидШК =ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			Объект.НомерБланка=Результат.НомерБланка;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа); 			
			
			Объект.Сотрудник = Результат.Сотрудник;
			
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 			
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			
			
			Если Не ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда
				
				Сообщить("Штрих код не найден! "+ Результат.ШК);
				Возврат;	
			КонецЕсли;
			
			ОбработатьШКНоменклатуры(Результат);
			
			
			
			
			
		ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//Это ячейка
			Если  ТекущийЭлемент = Элементы.АдресХранения или Элементы.Товары.ТекущиеДанные=Неопределено Тогда
				Объект.АдресХранения=Результат.АдресаХранения;
			Иначе
				
				Элементы.Товары.ТекущиеДанные.АдресХраненияНовый = Результат.АдресаХранения;
			КонецЕсли;
			
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Конверта") Тогда
			
			Конверт= Результат.Конверт;
			Если ЗначениеЗаполнено(Конверт) и Элементы.Товары.ТекущиеДанные<>Неопределено Тогда
				Элементы.Товары.ТекущиеДанные.Конверт=Конверт;
			КонецЕсли;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
			ОБъект.Отправитель=Результат.РабочийЦентр;
			
		Иначе
			ОбработатьШтрихкодыТиповой(ДанныеШтрихкода);
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаказКлиентаПоНомеру(НомерЗаказа) //+Лико m.shenderov 30.11.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерБезПрефикса = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомерЗаказа );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
	
	
КонецФункции  //-Лико m.shenderov 30.11.2017




#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкодыТиповой(ДанныеШтрихкодов)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул")); 	
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПересчитатьВесОбъем");
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( СтруктураДействийСДобавленнымиСтроками,"");
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	СтруктураДействийСИзмененнымиСтроками.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьВесОбъем");
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСИзмененнымиСтроками,"");
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = Новый Структура;
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ПересчитатьВесОбъем");
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий;
	СтруктураДействий.ТолькоТовары                           = Истина;
	
	
	СтруктураДействий.ДействияСНеизвестнымиШтрихкодами       = "НетДействий";
	СтруктураДействий.СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = СтруктураДействийСоСтрокамиИзУпаковочныхЛистов;
	
	
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
		
	КонецЕсли;
	
	Элементы.Товары.ТекущиеДанные.АдресХранения=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерии(Элементы.Товары.ТекущиеДанные.Серия,Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураДействий,КэшированныеЗначения);
	
	СтруктураДействийСТекущейСтрокой = Новый Структура;
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	//СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока);
	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействийСТекущейСтрокой, КэшированныеЗначения);
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	//+m.shenderov 11.07.2017
	ПечатьЭтикеток=Ложь ;	
	ОчиститьСообщения();  	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрано ни одного товара.'");
		
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	Для каждого Стр Из ВыделенныеСтроки Цикл
		Товар= Объект.Товары.НайтиПоИдентификатору(Стр);
		ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Серия,"ЯССМ_ОбъектНоменклатуры");
		
		Если ОбъектНоменклатуры=Неопределено Тогда
			ОбъектНоменклатуры=Лико_ОбщегоНазначенияСервер.ПолучитьОбъектНоменклатуры(Товар.Номенклатура);
		КонецЕсли;
		
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры); 
		ПечатьЭтикеток=Истина;
	КонецЦикла;	
	Если ПечатьЭтикеток Тогда
		Возврат;
	КонецЕсли;
	//-m.shenderov 11.07.2017
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю1(Команда)
	Объект.ЧленКомиссии1=ГлЛико_Оператор;
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю2(Команда)
	Объект.ЧленКомиссии2=ГлЛико_Оператор;
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю3(Команда)
	Объект.ЧленКомиссии3=ГлЛико_Оператор;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПодборФорм(Команда)
	Структура = Новый Структура;
	Структура.Вставить("РабочийЦентр",Объект.Отправитель);
	ОписаниеОповещения= Новый ОписаниеОповещения("ПодборФормЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_Формы.Форма.ФормаПодбора",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ПодборФормЗавершение(РезультатФормы,ПараметрыФормы) Экспорт  
	Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
		Для каждого Форма Из РезультатФормы.Массив Цикл
			Если Объект.Формы.НайтиСтроки(Новый Структура("Форма",Форма)).количество()=0 Тогда
				НоваяФорма=Объект.Формы.Добавить();
				НоваяФорма.Форма=Форма;
				НоваяФорма.Конверт=РезультатФормы.Соответствие[Форма];
			КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЕсли;
	ПроставитьЗаказВФормах();
КонецПроцедуры 


&НаКлиенте
Процедура ДанныеПоНаработке(Команда)
	Объект.ДанныеПоНаработке = Не Объект.ДанныеПоНаработке;
	
	УстановитьВидимость();
	
КонецПроцедуры



&НаКлиенте
Процедура ПечатьСтикераДокумента1(Команда)
	ПечатьСтикераДокумента();
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСтикераДокумента(БыстраяПечать=Истина)  	
	ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСтикераДокумента(Объект.Ссылка);	
	
	Если ПечатьСразуНаПринтер() Тогда
		ТабДокумент.Напечатать(БыстраяПечать);
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция ПечатьСразуНаПринтер() //+Лико m.shenderov 19.10.2017
	Возврат	Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
КонецФункции  //-Лико m.shenderov 19.10.2017


&НаКлиенте
Процедура ПечатьСкладскойКарточки(Команда)
	
	Если Не Объект.Проведен Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Распечатать карточку складской операции можно только после проведения документа!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("ДатаВремя", Объект.Дата);
	Данные.Вставить("Номер", Объект.Номер);
	Данные.Вставить("ВидОперации", Объект.ВидОперации);
	Данные.Вставить("НомерЗаказа", Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента,"Номер"),7));
	Данные.Вставить("Сотрудник", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.Сотрудник)));
	Данные.Вставить("Получатель", Строка(Объект.АдресХранения)+" "+ ПомещениеАдресаХранения( Объект.АдресХранения));
	Данные.Вставить("АвторДокумента", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.АвторДокумента)));
	
	//Если Товары.Количество()>3 Тогда
	//	Если Вопрос("Будет распечатано "+Товары.Количество()+" карточек складских операций. Вы уверены, что хотите распечатать все эти карточки?", РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, "Внимание!")=КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	КоличествоКопий = 1;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		Данные.Вставить("КоличествоЕдиницаИзмерения", "" + СтрокаТовары.Количество + " " + СтрокаТовары.Упаковка);
		Данные.Вставить("ОбъектНоменклатуры", СтрокаТовары.Серия);
		Данные.Вставить("Дополнительное", "");
		Если Не ЗначениеЗаполнено(Объект.АдресХранения) Тогда
			Данные.Вставить("Получатель", Строка(СтрокаТовары.АдресХраненияНовый)+" "+ ПомещениеАдресаХранения(СтрокаТовары.АдресХраненияНовый));
			
			
		КонецЕсли;
		
		// переопределим адрес хранения для ролика
		//Данные.Вставить("Получатель", СтрокаТовары.АдресХранения);
		
		
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСкладскойОперации(Данные, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		
		ТабДокумент.Напечатать();
	КонецЦикла;
	
	
	Если Объект.Формы.Количество()>0 Тогда
		
		//ВремФормы = Объект.Формы.Выгрузить();
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ФормыПечатьСкладскойОперации(Объект.Ссылка, Данные, Ложь, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		
		ТабДокумент.Напечатать();
		
	КонецЕсли;
	
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПомещениеАдресаХранения( АдресХранения) //+Лико m.shenderov 11.01.2018
	
	Возврат АдресХранения.Помещение.Наименование;
	
КонецФункции  //-Лико m.shenderov 11.01.2018




&НаСервереБезКонтекста
Функция СразуНапринтер() //+Лико m.shenderov 22.10.2017
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	
КонецФункции  //-Лико m.shenderov 22.10.2017


&НаКлиенте
Процедура ЗаказКлиенткаПриИзменении(Элемент)
	Попытка
		Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента,"Номер"),7));
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеЗаказаКлиента(Форма,Объект,
	ИмяПоляВводаЗаказаКлиента = "ЗаказКлиента",
	ПутьКПолюОтбора = "Объект.ЗаказКлиента") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЗаказаКлиента].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Проведен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	НЗаказа=Прав(Объект.ЗаказКлиента.Номер,7);
	
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст","111" );
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Склад",Объект.Склад);	
	Структура.Вставить("Период",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	Структура.Вставить("ТолькоОстатки",Истина);
	
	Если ЗначениеЗаполнено(Объект.Отправитель) И ТипЗнч(Объект.Отправитель)=Тип("СправочникСсылка.РабочиеЦентры") Тогда
		Ячейка=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Отправитель,"ЛикоЯчейка");
		Структура.Вставить("Ячейка",Ячейка);
		ПомещениеПроизводство=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Ячейка,"Помещение");
		Структура.Вставить("Помещение",ПомещениеПроизводство); 
	КонецЕсли;
	
	Если Не Структура.Свойство("Помещение") Тогда
		ПомещениеПроизводство=ПолучитьПомещениеПроизводство();
		Структура.Вставить("Помещение",ПомещениеПроизводство);
	КонецЕсли;
	
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПомещениеПроизводство()	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПомещениеПроизводство",Неопределено);
КонецФункции  


&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 25.10.2017
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		
		Для каждого Товар Из РезультатФормы  Цикл
			ТекущаяСтрока = Товар;
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
			
			// Если  ЗначениеЗаполнено(Товар.Серия) Тогда
			//    
			// СтруктураСерии= ПолучитьСтруктуруСерии(Товар.Серия);
			// 
			// 
			//КонецЕсли;
			
			
			СтруктураНоменклатуры = Новый Структура;
			СтруктураНоменклатуры.Вставить("Номенклатура");
			СтруктураНоменклатуры.Вставить("Характеристика");
			СтруктураНоменклатуры.Вставить("Серия");
			
			ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 			 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
				
				НовыйТовар.АдресХранения=Товар.Ячейка;
				
				//Найти Старое место хранения
				//НовыйТовар.АдресХраненияНовый=Товар.Ячейка;
				
				
				
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");  
				
				// --> Начало Лико Ефимов ЕВВ 27.08.2021
				ЗаполнитьДанныеПоНаработке(НовыйТовар);
				// <-- Конец Лико Ефимов ЕВВ 27.08.2021
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ПослеЗаписиНаСервере();
		
		
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 25.10.2017


&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСерии(Серия) //+Лико m.shenderov 24.10.2017
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Неопределено);
	Структура.Вставить("Характеристика",Неопределено);
	Структура.Вставить("КоличествоУпаковок",Неопределено);
	Структура.Вставить("Серия",Неопределено);
	Структура.Вставить("Упаковка",Неопределено);
	Структура.Вставить("Количество",Неопределено); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|	СерииНоменклатуры.Ссылка КАК Серия,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Характеристика КАК Характеристика,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество КАК КоличествоУпаковок,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество * СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК Количество
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Ссылка = &Серия";
	Запрос.УстановитьПараметр("Серия",Серия );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.10.2017

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ТоварыСерия" Тогда
		Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Серия) Тогда
			
			Структура = Новый Структура;
			Структура.Вставить("Ключ",Элементы.Товары.ТекущиеДанные.Серия);
			ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаОбъекта",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	Если Поле.Имя="ТоварыСерияЯССМ_ОбъектНоменклатурыКатегория2" Тогда
		ЗаменитьКатегориюНаСервере(Элементы.Товары.ТекущиеДанные.Серия); 		
		ОбновитьИнтерфейс();		
	КонецЕсли;
	
	
КонецПроцедуры
&НаСервере
Процедура ЗаменитьКатегориюНаСервере(Серия) //+Лико m.shenderov 30.05.2018
	ОбъектНоменклатуры=Серия.ЯССМ_ОБъектНоменклатуры;
	Если  ОбъектНоменклатуры.Уникальный Тогда
		ОбъектНоменклатурыОбъект=ОбъектНоменклатуры.ПолучитьОбъект();
		ОбъектНоменклатурыОбъект.Категория2= Не ОбъектНоменклатурыОбъект.Категория2;
		ОбъектНоменклатурыОбъект.Записать();
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 30.05.2018



&НаКлиенте
Процедура ФормыФормаПриИзменении(Элемент)
	ПроставитьЗаказВФормах();
КонецПроцедуры


&НаСервере
Процедура ПроставитьЗаказВФормах() //+Лико m.shenderov 22.01.2018
	
	Для каждого Форма Из Объект.Формы Цикл
		//Форма.ЗаказКлиента=Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",Лев(Форма.Форма.Код,7)); 		
		Форма.ЗаказКлиента = Форма.Форма.ЗаказПоРельсе;
	
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 22.01.2018


&НаКлиенте
Процедура ОбработатьШКНоменклатуры(Результат);
	
	СтруктураНоменклатура = Новый Структура;
	ПолучитьСтруктуруОбъектаНоменклатуры(СтруктураНоменклатура,Результат.ОбъектНоменклатуры);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура",СтруктураНоменклатура.Номенклатура);
	СтруктураПоиска.Вставить("Характеристика",СтруктураНоменклатура.Характеристика);
	СтруктураПоиска.Вставить("Серия",СтруктураНоменклатура.Серия);
	
	НайденныеСтроки=Объект.Товары.НайтиСтроки(СтруктураПоиска);	
	
	Если  НайденныеСтроки.Количество()=0 Тогда
		
		НовыйТовар = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатура);
		//Если СтруктураНоменклатура.Уникальный Тогда
		НовыйТовар.СтатусУказанияСерий=8;		
		
		//КонецЕсли;
		Элементы.Товары.ТекущаяСтрока=НовыйТовар.ПолучитьИдентификатор(); 
		//ТоварыНоменклатураПриИзменении(Неопределено);
		//ТоварыКоличествоУпаковокПриИзменении(Неопределено);
		ПослеЗаписиНаСервере();
		Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходПоАктуРазборки") Тогда
			НовыйТовар.АдресХранения		=Неопределено;
			НовыйТовар.АдресХраненияНовый	=Неопределено;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.АдресХранения)  Тогда
			
			ОткрытьПодборСерий("Товары");
		// --> Начало Лико Ефимов ЕВВ 27.08.2021
		Иначе
			ЗаполнитьДанныеПоНаработке(НовыйТовар);
		// <-- Конец Лико Ефимов ЕВВ 27.08.2021
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 14.01.2018


&НаСервереБезКонтекста
Процедура ПолучитьСтруктуруОбъектаНоменклатуры(Структура,ОбъектНоменклатуры) //+Лико m.shenderov 14.01.2018
	
	Структура.Вставить("Номенклатура"	,	ОбъектНоменклатуры.Номенклатура);
	Структура.Вставить("Характеристика" ,	ОбъектНоменклатуры.Характеристика);
	Структура.Вставить("Упаковка"       ,   ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);
	Структура.Вставить("КоличествоУпаковок",ОбъектНоменклатуры.Количество);
	Структура.Вставить("Количество"     ,	ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);
	
	Структура.Вставить("Серия"          ,	ОбъектНоменклатуры.Серия);
	Структура.Вставить("Уникальный"     ,   ОбъектНоменклатуры.Уникальный);
	
	АдресХранения=Неопределено;
	
	
	//Если ОбъектНоменклатуры.Уникальный И ЗначениеЗаполнено(ОбъектНоменклатуры.Серия) Тогда
	
	Если  ЗначениеЗаполнено(ОбъектНоменклатуры.Серия) Тогда
		
		АдресХранения=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерии(ОбъектНоменклатуры.Серия);
	КонецЕсли;
	
	
	АдресХраненияНовый=Неопределено;
	
	//Если ОбъектНоменклатуры.Уникальный И ЗначениеЗаполнено(ОбъектНоменклатуры.Серия) Тогда
	
	АдресХраненияНовый=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПредыдущий(ОбъектНоменклатуры);
	//КонецЕсли;
	Структура.Вставить("АдресХраненияНовый" ,АдресХраненияНовый);
	Структура.Вставить("АдресХранения" ,АдресХранения);
	
	
	
КонецПроцедуры  //-Лико m.shenderov 14.01.2018

&НаСервере
Процедура КопироватьПоРельсеНаСервере(Форма,Конверт)
	//Форма		=Элементы.Формы.ТекущиеДанные.Форма;
	//Конверт		=Элементы.Формы.ТекущиеДанные.Конверт;
	
	Если ЗначениеЗаполнено(Форма) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_Формы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лико_Формы КАК Лико_Формы
		|ГДЕ
		|	ПОДСТРОКА(Лико_Формы.Код, 1, 7) = &Код
		|	И Лико_Формы.Ссылка <> &Форма
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лико_Формы.Код";
		Запрос.УстановитьПараметр("Форма",Форма);
		Запрос.УстановитьПараметр("Код",Сред(Форма.Код,1,7));
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяФорма= Объект.Формы.Добавить();
			НоваяФорма.Форма=Выборка.Ссылка;
			НоваяФорма.Конверт=Конверт; 
			
		КонецЦикла; 
		ПроставитьЗаказВФормах();
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьПоРельсе(Команда)
	Форма		=Элементы.Формы.ТекущиеДанные.Форма;
	Конверт		=Элементы.Формы.ТекущиеДанные.Конверт;
	
	КопироватьПоРельсеНаСервере(ФОрма,Конверт);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСкладскойКарточки1(Команда)
	Данные=Элементы.Товары.ТекущиеДанные;
	Если Данные<>Неопределено Тогда
		Лико_ДополнительноКлиент.ПечатьСкладскойКарточки(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Данные.Серия,"ЯССМ_ОбъектНоменклатуры"));
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция СотрудникАвтоПодборНаСервере(Текст)
	
	СписокЗначений= Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Код ПОДОБНО &Код
	|	И Сотрудники.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Код","%"+Текст+"%" );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Ссылка);
		
	КонецЦикла; 
	Возврат СписокЗначений;	
КонецФункции


&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Попытка
		Код=Число(Текст);
		СтандартнаяОбработка=Ложь;
		ДанныеВыбора=СотрудникАвтоПодборНаСервере(Текст);
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер,Объект.Контрагент );
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВБухгалтерскомУчетеПриИзменении(Элемент)
	ЗаполнитьТаблицуСЦенами();
	УстановитьВидимость();
	ЛК_СформироватьБухгалтерскиеДокументы=Объект.ОтражатьВБухгалтерскомУчете;
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьТаблицуСЦенами() //+Лико m.shenderov 24.02.2018
	Если Объект.ОтражатьВБухгалтерскомУчете Тогда
		ТзНоменклатура=Объект.Товары.Выгрузить();
		ТзНоменклатура.Свернуть("Номенклатура","Количество");
		Объект.Лико_ЦеныНоменклатуры.Загрузить(ТзНоменклатура);
	Иначе
		Объект.Лико_ЦеныНоменклатуры.Очистить();		
	КонецЕсли;
	Для каждого ЦенаНоменклатуры Из Объект.Лико_ЦеныНоменклатуры Цикл
		ЦенаНоменклатуры.Услуга=Справочники.Лико_ПредопределенныеЗначения.УслугаПерегравировкиНаименование.ЗначениеПараметра;		
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 24.02.2018


&НаКлиенте
Процедура Лико_Лико_ЦеныНоменклатурыЦенаПриИзмененииПосле(Элемент)
	ТекСтр=Элементы.Лико_ЦеныНоменклатуры.ТекущиеДанные;
	ЕСли  ТекСтр.Количество<>0 Тогда
		ТекСтр.Цена_0=ТекСтр.Цена/ТекСтр.Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ЦеныНоменклатурыЦена_0ПриИзмененииПосле(Элемент)
	ТекСтр=Элементы.Лико_ЦеныНоменклатуры.ТекущиеДанные;
	
	ТекСтр.Цена=ТекСтр.Цена_0*ТекСтр.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ДоговорНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Структура = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("ВалютаВзаиморасчетов",Объект.Лико_Валюта);
	Отбор.Вставить("Контрагент",	Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Контрагент"));
	Отбор.Вставить("Организация",	Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Организация"));
	Отбор.Вставить("Партнер",		Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Распоряжение,"Партнер"));
	Структура.Вставить("Отбор",		Отбор);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора",Структура,Элементы.Лико_Договор);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыНоменклатураПриИзмененииПеред(Элемент)
	Элементы.Товары.ТекущиеДанные.Серия=Неопределено; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства")  Тогда
		
		Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
			ПроверитьАдресПроизводства(Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// <-- Начало Лико Яцун С. В. 16.02.2026 
	Если НЕ Отказ И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьНеобходимостьУтилизацииФорм();
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 16.02.2026
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьУтилизацииФорм() // <-- Начало Лико Яцун С. В. 16.02.2026
	
	ВидОперацииДокумента = Объект.ВидОперации;
	ОповещениеПользователю = "";
	Если ВидОперацииДокумента = Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходФорм Тогда
		
		Для каждого Стр Из Объект.Формы Цикл
				Если Стр.Форма.ДействияСФормой = Перечисления.Лико_ДействияСФормой.Утилизировать Тогда
					ТекстСообщения = "Строка №" + Стр.НомерСтроки + ": Форма № " + Стр.Форма.Код + " - Данную форму надо утилизировать";
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ТекстСообщения;
					Сообщение.Сообщить();
					ОповещениеПользователю = ?(ЗначениеЗаполнено(ОповещениеПользователю),ОповещениеПользователю + Символы.ПС + ТекстСообщения,ТекстСообщения)
				КонецЕсли;
		КонецЦикла;
			
	ИначеЕсли ВидОперацииДокумента = Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ВводНачальныхОстатковФорм Тогда
		
		ТЗФорм = Объект.Формы.Выгрузить();
		ТЗФорм.Свернуть("Конверт");
		
		Для каждого Стр Из ТЗФорм Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код КАК Форма
			|ИЗ
			|	РегистрСведений.Лико_ИсторияДвиженийФорм.СрезПоследних КАК Лико_ИсторияДвиженийФормСрезПоследних
			|ГДЕ
			|	Лико_ИсторияДвиженийФормСрезПоследних.Расположение = &Расположение
			|	И Лико_ИсторияДвиженийФормСрезПоследних.Форма.ДействияСФормой = &ДействияСФормой";
			
			Запрос.УстановитьПараметр("ДействияСФормой", Перечисления.Лико_ДействияСФормой.Утилизировать);
			Запрос.УстановитьПараметр("Расположение", Стр.Конверт);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекстСообщения = "В конверте " + Стр.Конверт + " хранится Форма № " + ВыборкаДетальныеЗаписи.Форма + ", которую надо утилизировать";
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				ОповещениеПользователю = ?(ЗначениеЗаполнено(ОповещениеПользователю),ОповещениеПользователю + Символы.ПС + ТекстСообщения,ТекстСообщения)
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ОповещениеПользователю;
	
КонецФункции // <-- Конец Лико Яцун С. В. 16.02.2026

Процедура  ПроверитьАдресПроизводства(Отказ) //+Лико m.shenderov 25/12/2019
	ИндексСтроки=0;
	Для каждого Товар Из Объект.Товары  Цикл
		Если Товар.АдресХранения.Помещение.Лико_ТипСклада<>Перечисления.Лико_ТипСклада.Производство ТОгда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Товар находится не на производстве!";
			Сообщение.Поле = "Объект.Товары["+Строка(ИндексСтроки)+"].АдресХранения"; //имя реквизита 
			//Сообщение.КлючДанных = Ссылка;
			//Сообщение.ПутьКДанным = "Объект";
			Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
			
			Сообщение.Сообщить();		
			//Отказ=Истина;	
		КонецЕсли;
		
		ИндексСтроки=ИндексСтроки+1;
	КонецЦикла;
	
	
КонецПроцедуры //-Лико m.shenderov 25/12/2019

&НаСервере
Процедура ЗаявкаНаСкладПриИзмененииНаСервере()
	Тз=Объект.ЗаявкаНаСклад.Товары.Выгрузить();
	Тз.Свернуть("Номенклатура, характеристика");
	Объект.Товары.Загрузить(Тз);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий); 	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаСкладПриИзменении(Элемент)
	ЗаявкаНаСкладПриИзмененииНаСервере();
	
КонецПроцедуры



// Подсистема WebSocket
&НаКлиенте
Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);	
КонецПроцедуры  

&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;   
КонецПроцедуры 

// Подсистема WebSocket

&НаКлиенте
Процедура ЗаполнитьНаработкуПоДаннымСчетчика(Команда) // --> Начало Лико Ефимов ЕВВ 26.08.2021 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ЗаполнитьДанныеПоНаработке(ТекущаяСтрока, Истина);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 26.08.2021 

&НаКлиенте
Процедура ЗаполнитьДанныеПоНаработке(ТекущаяСтрока, РучнойВызов = Ложь) // --> Начало Лико Ефимов ЕВВ 27.08.2021
	Если ТекущаяСтрока <> Неопределено Тогда
		Модифицированность = Истина;
		ТекущаяСтрока.НаработкаТекущейОперации = Лико_Дополнительно.ПолучитьПробегШтампаПоДаннымСчетчика(ТекущаяСтрока.Серия, Объект.Дата, ТекущаяСтрока.АдресХранения, РучнойВызов);
		Если ТекущаяСтрока.НаработкаТекущейОперации <> 0 И НЕ Объект.ДанныеПоНаработке Тогда
			Объект.ДанныеПоНаработке = Истина;
			УстановитьВидимость();
		ИначеЕсли ТекущаяСтрока.НаработкаТекущейОперации <> 0 И ТекущаяСтрока.НаработкаПредыдущихОпераций = 0 И Объект.ДанныеПоНаработке И ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			лДанныеПоНаработке = Лико_Дополнительно.ПолучитьДанныеПоНаработке(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Серия,"ЯССМ_ОбъектНоменклатуры"), ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата-1)); 		
			ТекущаяСтрока.НаработкаПредыдущихОпераций = лДанныеПоНаработке.ОбщаяНаработка;
			ТекущаяСтрока.ПримечаниеПоПредыдущимНаработкам = лДанныеПоНаработке.Примечание;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 27.08.2021 

&НаКлиенте
Процедура БезНДСПриИзменении(Элемент)
		УстановитьВидимость();

КонецПроцедуры
