
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
НаборЗаписей = РегистрыСведений.BRC_ВходнойКонтроль.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументПрихода.Установить(Документ);
	
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.ДокументПрихода=Документ; 		
		НоваяЗапись.Подписан=Истина;
		НоваяЗапись.ОтветственноеЛицо=ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.Дата=ТекущаяДата();
		НоваяЗапись.Комментарий=Комментарий;		
		НаборЗаписей.Записать();
		НаписатьПисьмоНаСклад();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ=Параметры.Документ;

КонецПроцедуры


Процедура НаписатьПисьмоНаСклад() //+Лико m.shenderov 14.05.2020
	УстановитьПривилегированныйРежим(Истина);
	
	
	
	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
	СхемаКомпоновкиДанных = Документы.ПриходныйОрдерНаТовары.ПолучитьМакет("BRCВходнойКонтрольРешение");
	//URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	ОтборНастройки.Инициализировать(ИсточникНастроек);
		

		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);

	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Ссылка", Документ.Ссылка);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТД=Новый ТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТД);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	 ИмяТемпФайла = ПолучитьИмяВременногоФайла();
	Тд.Записать(ИмяТемпФайла,ТипФайлаТабличногоДокумента.HTML5);
	ТекстHТМЛ = Новый ТекстовыйДокумент;
    ТекстHТМЛ.Прочитать(ИмяТемпФайла);
	ТекстHТМЛ = ТекстHТМЛ.ПолучитьТекст();
	

		
		
		
		
		Текст=" BRC Решение по документу N " ;
		
		Текст = Текст + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Документ.Ссылка) + " от " + Формат(Документ.Дата, "ДФ='дд ММММ гггг'");
		Тема  = текст;  		
			
	     Текст=ТекстHТМЛ;
		

		
		
		//Адресат ="mshenderov@okil-sato.ru; OKIL_Zakupki@okil-sato.ru";
		Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(Справочники.Лико_ТипыСообщений.BRCВходнойКонтрольРешение,Документ.Распоряжение.Организация); 		
		//Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат,,"textBody");  
		Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат);  		

	


		
КонецПроцедуры //-Лико m.shenderov 14.05.2020



Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

