// Вызываем из модулей-механизмов, чтобы при необходимости скорректировать параметры
Процедура ПараметрыДляПроведенияДокумента(Документ, Свойства, Параметры) Экспорт
	
	ТипДокумента = ТипЗнч(Документ);
	     
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение И (ТипДокумента = Тип("ДокументОбъект.Лико_БланкЭтапа")
		Или ТипДокумента = Тип("ДокументОбъект.Лико_ПередачаТоваров")
		Или ТипДокумента = Тип("ДокументОбъект.Лико_ВозвратТоваров")) Тогда
		Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ТоварыВЯчейках);
	КонецЕсли;

	Если Документ.ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении") Тогда
		Параметры.КонтрольныеРегистрыИзменений= Новый Массив;
	КонецЕсли;
	
КонецПроцедуры        

// Вызываем из процедуры ПроведениеДокументов.ПровестиДокумент после формирования массива механизмов
// Можно добавить свои механизмы или удалить "лишние"
Процедура УчетныеМеханизмыДокумента(Документ, МеханизмыДокумента) Экспорт

	ТипДокумента = ТипЗнч(Документ);
	СвойстваДокумента = ПроведениеДокументов.СвойстваДокумента(Документ);
	Если СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ((ОбщегоНазначения.ЕстьРеквизитОбъекта("Лико_НеНужныДвиженияОрдерныхСкладов", Документ.Метаданные())
				И Документ.Лико_НеНужныДвиженияОрдерныхСкладов)
			ИЛИ
			(ОбщегоНазначения.ЕстьРеквизитОбъекта("Лико_НеНужныДвиженияПоСкладу", Документ.Метаданные())
				И Документ.Лико_НеНужныДвиженияПоСкладу))
		Тогда
		МеханизмОбеспечение = МеханизмыДокумента.Найти("Обеспечение"); 
		Если МеханизмОбеспечение <> Неопределено Тогда 
			МеханизмыДокумента.Удалить(МеханизмОбеспечение);
		КонецЕсли;	
		МеханизмАдресныйСклад = МеханизмыДокумента.Найти("АдресныйСклад"); 
		Если МеханизмАдресныйСклад <> Неопределено Тогда 
			МеханизмыДокумента.Удалить(МеханизмАдресныйСклад);
		КонецЕсли;	
	КонецЕсли;

	Если СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И (ТипДокумента = Тип("ДокументОбъект.ПриемкаТоваровНаХранение")
		ИЛИ ТипДокумента = Тип("ДокументОбъект.ОтгрузкаТоваровСХранения")
		)
		И (Документ.Склад.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки
		ИЛИ Документ.Склад.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи)
		Тогда
		МеханизмОбеспечение = МеханизмыДокумента.Найти("Обеспечение"); 
		Если МеханизмОбеспечение <> Неопределено Тогда 
			МеханизмыДокумента.Удалить(МеханизмОбеспечение);
		КонецЕсли;	
		МеханизмАдресныйСклад = МеханизмыДокумента.Найти("АдресныйСклад"); 
		Если МеханизмАдресныйСклад <> Неопределено Тогда 
			МеханизмыДокумента.Удалить(МеханизмАдресныйСклад);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры