
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") И Параметры.Свойство("Характеристика") Тогда
		 СписокРезервирования.Параметры.УстановитьЗначениеПараметра("Номенклатура",Параметры.Номенклатура);
		 СписокРезервирования.Параметры.УстановитьЗначениеПараметра("Характеристика",Параметры.Характеристика);
		 СписокРезервирования.Параметры.УстановитьЗначениеПараметра("Лико_Площадка",Параметры.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРезервированияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Структура = Новый Структура;
	Структура.Вставить("Ключ",Элементы.СписокРезервирования.ТекущиеДанные.ПодготовкаЗаказов);
	ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.ФормаОбъекта",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
