
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Лико_ПланированиеУпаковки Приход или Расход
	// Чтобы не получать для каждой строки номенклатуру из характеристики, получим данные одним запросом
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Дата = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Лико_ПланУпаковкиТовары.Ссылка.Дата
		|		ИНАЧЕ Лико_ПланУпаковкиТовары.Дата
		|	КОНЕЦ КАК Период,
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДвижения
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВЫРАЗИТЬ(Лико_ПланУпаковкиТовары.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Лико_ПланУпаковкиТовары.Характеристика КАК Характеристика,
		|	Лико_ПланУпаковкиТовары.Намотка КАК Намотка,
		|	Лико_ПланУпаковкиТовары.Город КАК Город,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.Упаковка)
		|					ИЛИ Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.УпаковкаИПеремотка)
		|				ТОГДА Лико_ПланУпаковкиТовары.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоУпаковка,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.Перемотка)
		|					ИЛИ Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.УпаковкаИПеремотка)
		|				ТОГДА Лико_ПланУпаковкиТовары.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоПеремотка,
		|	Лико_ПланУпаковкиТовары.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.Упаковка)
		|					ИЛИ Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.УпаковкаИПеремотка)
		|				ТОГДА Лико_ПланУпаковкиТовары.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоСклад
		|ИЗ
		|	Документ.Лико_ПланУпаковки.Товары КАК Лико_ПланУпаковкиТовары
		|ГДЕ
		|	Лико_ПланУпаковкиТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Дата = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Лико_ПланУпаковкиТовары.Ссылка.Дата
		|		ИНАЧЕ Лико_ПланУпаковкиТовары.Дата
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(Лико_ПланУпаковкиТовары.Характеристика.Владелец КАК Справочник.Номенклатура),
		|	Лико_ПланУпаковкиТовары.Характеристика,
		|	Лико_ПланУпаковкиТовары.Намотка,
		|	Лико_ПланУпаковкиТовары.Город,
		|	Лико_ПланУпаковкиТовары.ЗаявкаНаОтгрузку,
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДвижения
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Запрос.Выполнить().Выбрать();
	Движения.Лико_ПланированиеУпаковки.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.Лико_ПланированиеУпаковки.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры
