#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если переданная статья используется для учета доходов.
//
// Параметры:
//	ВидСтатьи - ПеречислениеСсылка.ВидыПрочихДоходовИРасходов - Проверяемая статья.
//
// Возвращаемое значение:
//	Булево - Признак использования статьи для учета доходов.
//	                                                       
Функция ИспользуетсяДляДоходов(ВидСтатьи) Экспорт
	
	Возврат ВидСтатьи = РеализацияОсновныхСредств
		Или ВидСтатьи = РеализацияНематериальныхАктивов;
	
КонецФункции
	
	
// Возвращает перечисления, которые устарели и являются архивными.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПрочихДоходовИРасходов - устаревшие виды прочих доходов и расходов.
// 
Функция УстаревшиеВидыПрочихДоходовИРасходов() Экспорт 
	
	Результат = Новый Массив;
	Результат.Добавить(ПроцентыКПолучениюУплате);
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#КонецЕсли
