 
 #Область ОбработчикиСобытийФормы
 &НаСервере

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РезервПодРегионы = Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы();
	
	УстановитьВидимостьПоказатьОстаткиСервер();
    Площадка=Объект.РабочийЦентр.Лико_Площадка.Организация;
	лОрганизация = Объект.РабочийЦентр.Лико_Площадка.Организация;
     ПодготовкаПоПлощадке();	

	ДатаНачалаПроверкиТехнологомМатериала=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПроверкиТехнологомМатериала.ЗначениеПараметра;
	ДатаКонтроля= ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
	ОрганизацияЛикофлекс=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра;
	РЦЛаминаторИксПак=Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",300);
	ЭтоОрганизацияЛикофлекс=лОрганизация=ОрганизацияЛикофлекс;
	ЭтоПробник=Объект.ЗаказКлиента.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.Пробник;
	
	Если лОрганизация=ОрганизацияЛикофлекс И ЗначениеЗаполнено(ДатаНачалаПроверкиТехнологомМатериала) И ДатаКонтроля>ДатаНачалаПроверкиТехнологомМатериала Тогда
		ПроверкаМатериаловТехнологом=Истина; 
	КонецЕсли;
	
	Если ПроверкаМатериаловТехнологом Тогда
		Элементы.ОстаткиНоменклатурыПроверенТехнологом.Видимость=Истина; 
	Иначе
		Элементы.ОстаткиНоменклатурыПроверенТехнологом.Видимость=Ложь;
	КонецЕсли;
	
	Если ПодготовкаПоПлощадке Тогда
		
		УстановитьЗапросОстатковЛКПоПлощадке();
		
	Иначе
		УстановитьЗапросОстатковЛК();
		
	КонецЕсли;
	
	
		BRC= Ложь;
	Если ЗначениеЗаполнено(лОрганизация) Тогда 
		Если ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(лОрганизация,"Лико_УчетНаСкладеПоBRC"))  Тогда 
			BRC= УправлениеСвойствами.ЗначениеСвойства(лОрганизация,"Лико_УчетНаСкладеПоBRC");
		КонецЕсли;
	КонецЕсли;
	BRC_ДатаКарантина = ТекущаяДата();
	Если  BRC Тогда 
		Элементы.Площадка.Видимость=Истина;
		BRC_ДатаКарантина=ТекущаяДата()-Справочники.Лико_ПредопределенныеЗначения.BRC_ДлительностьКарантинаЧас.ЗначениеПараметра*60*60;
		Если ПодготовкаПоПлощадке Тогда
			УстановитьЗапросОстатковПоПлощадке();
		Иначе
			
			УстановитьЗапросОстатков();
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ГруппаСмеси.Видимость=BRC;
	
	Если ПодготовкаПоПлощадке Тогда 
		Элементы.Площадка.Видимость=Ложь;
	КонецЕсли;

	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("BRC",BRC);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("BRC_ДатаКарантина",  BRC_ДатаКарантина);
	
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Артикул","%"+АртикулОтбор+"%");
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьАртикул",ЗначениеЗаполнено(АртикулОтбор));
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Код","%"+КодНоменклатурыОтбор+"%");
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКод",ЗначениеЗаполнено(КодНоменклатурыОтбор));
	
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Нарезка",НарезкаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНарезка",ЗначениеЗаполнено(НарезкаОтбор));
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПроизводственноеПомещение",ПроизводственноеПомещениеОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПроизводственноеПомещение",ЗначениеЗаполнено(ПроизводственноеПомещениеОтбор));

	
	
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Наименование","%"+НаименованиеОтбор+"%");
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНаименование",ЗначениеЗаполнено(НаименованиеОтбор));  	

	// <-- Начало Лико Яцун С. В. 26.02.2024
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ГруппаМатериалов",ГруппаМатериаловОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьГруппаМатериалов",ГруппаМатериаловОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Псевдоним",ПсевдонимОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПсевдоним",ПсевдонимОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЛицевойМатериал",ЛицевойМатериалОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЛицевойМатериал",ЛицевойМатериалОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Покрытие",ПокрытиеОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПокрытие",ПокрытиеОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Подложка",ПодложкаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПодложка",ПодложкаОтборИспользовать); 
	
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("КодКлея",КодКлеяОтбор);
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКодКлея",КодКлеяОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ВидКлея",ВидКлеяОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьВидКлея",ВидКлеяОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипКлея",ТипКлеяОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьТипКлея",ТипКлеяОтборИспользовать);
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("МинимальнаяТемператураЭтикерования",МинимальнаяТемператураЭтикерованияОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьМинимальнаяТемператураЭтикерования",МинимальнаяТемператураЭтикерованияОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("МинимальнаяТемператураЭксплуатации",МинимальнаяТемператураЭксплуатацииОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьМинимальнаяТемператураЭксплуатации",МинимальнаяТемператураЭксплуатацииОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("МаксимальнаяТемператураЭксплуатации",МаксимальнаяТемператураЭксплуатацииОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьМаксимальнаяТемператураЭксплуатации",МаксимальнаяТемператураЭксплуатацииОтборИспользовать);
	
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("КлейДляЛаминации",КлейДляЛаминацииОтбор);
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКлейДляЛаминации",КлейДляЛаминацииОтборИспользовать); 
		
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("НаличиеПраймера",НаличиеПраймераОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНаличиеПраймера",НаличиеПраймераОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("КольеИлиМаленькийРадиус",КольеИлиМаленькийРадиусОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКольеИлиМаленькийРадиус",КольеИлиМаленькийРадиусОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Этикетка",ЭтикеткаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЭтикетка",ЭтикеткаОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПЕФлакон",ПЕФлаконОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПЕФлакон",ПЕФлаконОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПослеЗаморозки",ПослеЗаморозкиОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПослеЗаморозки",ПослеЗаморозкиОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЧестныйЗнак",ЧестныйЗнакОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЧестныйЗнак",ЧестныйЗнакОтборИспользовать); 
	// <-- Конец Лико Яцун С. В. 26.02.2024
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЦеноваяГруппа",ЦеноваяГруппаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЦеноваяГруппа",Ложь);
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Номенклатура",НоменклатураОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНоменклатура",Ложь);
	
	
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Склад",Объект.Склад);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Организация",лОрганизация);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Площадка",Площадка); 
	
	Если ПодготовкаПоПлощадке Тогда 
		ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Лико_Площадка",Лико_Площадка); 
	КонецЕсли;
	
	
	
	
	Партнер= Объект.ЗаказКлиента.Партнер;
	Регион = Объект.ЗаказКлиента.Регион;
	Массив = Новый Массив();
	Массив.Добавить(Справочники.Партнеры.ПустаяСсылка()); 
	Массив.Добавить(Партнер); 
		
	Если Не  BRC  Тогда
		Если РезервПодРегионы Тогда
			
			Массив.Добавить(Регион);
			Массив.Добавить(Неопределено);			
			Резерв.ЗагрузитьЗначения(Массив);
			
			
		ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Резерв",Массив);
	Иначе
		ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Партнер",Массив);
	КонецЕсли;
	
		ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭтоОрганизацияЛикофлекс",ЭтоОрганизацияЛикофлекс);
        ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("РЦЛаминаторИксПак",РЦЛаминаторИксПак); 
        ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭтоПробник",ЭтоПробник);

	КонецЕсли;
	
	ПомещениеСИМ=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПомещениеСИМ");
	ПомещениеПроизводство=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПомещениеПроизводство");
	ПомещениеПроизводство2=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПомещениеПроизводство");
	
	Если лОрганизация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
		ПомещениеПроизводство2= Новый СписокЗначений;
		ПомещениеПроизводство2.Добавить(Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПомещениеПроизводство"));
		УстановитьПривилегированныйРежим(Истина);
		ПомещениеПроизводство2.Добавить(Справочники.СкладскиеПомещения.НайтиПоНаименованию("Производство цифра (Ликофлекс)"));
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	
	ПомещенияСимДоп = Новый СписокЗначений;
	//Сз.Добавить(ПомещениеПроизводство2);
	//Сз.Добавить(ПомещениеСИМ);
	ПолучитьДопПомещенияСим(ПомещенияСимДоп);
	
	Если BRC тогда
		ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПомещениеСИМ",ПомещениеСИМ);
		//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПомещениеПроизводство",ПомещениеПроизводство2);
	КонецЕсли;
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПомещениеПроизводство",ПомещениеПроизводство2);
	
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПомещенияСимДоп",ПомещенияСимДоп);
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("НаНастройку",НаНастройку);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",ТекущаяДата());
	
	ЗаказыПоставщикам.Параметры.УстановитьЗначениеПараметра("ЗаказКлиента",Объект.ЗаказКлиента);
	
	Если РольДоступна("АдминистраторСистемы") Тогда
		Элементы.РезервированиеАвто.Доступность=Истина;
	КонецЕсли; 
	
	//// --> Начало Лико Субботин 01.03.2023 
	////Для проверки рек-тов идущих в ПФ
	//КонтрольныйХэш = ВернутьКонтрольныйХэш();
	//// <-- Конец Лико Субботин 01.03.2023 	
	
	// <-- Начало Лико Яцун С. В. 01.04.2026 
	////Если ЗначениеЗаполнено(Объект.ЗаказКлиента) И ЗначениеЗаполнено(Объект.ЗаказКлиента.НарезкаРасчетнаяБезОкругления) Тогда
	////	Элементы.НарезкаБезОкругления.Заголовок = "(" + Объект.ЗаказКлиента.НарезкаРасчетнаяБезОкругления + ")";
	////Иначе
	////	Элементы.НарезкаБезОкругления.Заголовок = "";	
	////КонецЕсли;
	// <-- Конец Лико Яцун С. В. 01.04.2026 
	
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УчетПоВидуСекций=УстановитьВидУчетаПоСекцииСервер(Объект.Дата);
    УстановитьВидимостьУчетПоСекции();

	ПоказатьОстатки=Истина;
	ПодключитьОбработчикОжидания("УстановитьВидимостьПоказатьОстаткиКлиент",1,Истина);
КонецПроцедуры


 #КонецОбласти
 
#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда,Объект);  
	// --> Начало Лико Субботин 27.02.2023
	Если Команда.Имя = "ПодменюПечатьОбычное_ТребованиеНакладная_Подготовка" Тогда
		ЗаписатьРеквизит("ДатаПечатиТребования", ТекущаяДата()); 
		ЭтотОбъект.Прочитать();
	КонецЕсли;
	// <-- Конец Лико Субботин 27.02.2023 
	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);  	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры



#КонецОбласти

#Область ОбрабочикиФормы


&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ЗаполнитьТаблицуМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура НомерПрокатаПриИзменении(Элемент)
	ЗаполнитьТаблицуМатериалов();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере

Процедура ЗаполнитьТаблицуМатериалов()
	Запрос= Новый Запрос;
	Документы.Лико_ПодготовкаМатериалов.СформироватьЗапросПоМатериалуВЗаказе(Запрос);
	Запрос.УстановитьПараметр("ЗаказКлиента",Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("НомерПроката",Объект.НомерПроката);
	Объект.Материалы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыОстатковКлиент()
	ПоНоменклатуреОтбор		=Ложь; 
	ПоЦенновойГруппеОтбор	=Ложь;
	
	Если ФильтрПоНоменклатуре() Тогда
		ПоНоменклатуреОтбор= Не ПоЦеновойГруппе; 
		ПоЦенновойГруппеОтбор= ПоЦеновойГруппе;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НарезкаОтбор) 	Или 
		ЗначениеЗаполнено(АртикулОтбор) 	Или 
		ЗначениеЗаполнено(НаименованиеОтбор) Или
		ЗначениеЗаполнено(КодНоменклатурыОтбор) Или
		ГруппаМатериаловОтборИспользовать Или
		ПсевдонимОтборИспользовать Или
		ЛицевойМатериалОтборИспользовать Или
		ПокрытиеОтборИспользовать Или
		ПодложкаОтборИспользовать Или
		//КодКлеяОтборИспользовать Или
		ВидКлеяОтборИспользовать Или
		ТипКлеяОтборИспользовать Или
		//КлейДляЛаминацииОтборИспользовать Или
		НаличиеПраймераОтборИспользовать Или
		КольеИлиМаленькийРадиусОтборИспользовать Или
		ЭтикеткаОтборИспользовать Или
		ПЕФлаконОтборИспользовать Или
		ПослеЗаморозкиОтборИспользовать Или
		ЧестныйЗнакОтборИспользовать Или
		МинимальнаяТемператураЭтикерованияОтборИспользовать Или
		МинимальнаяТемператураЭксплуатацииОтборИспользовать Или
		МаксимальнаяТемператураЭксплуатацииОтборИспользовать	
		Тогда
		ПоНоменклатуреОтбор= Ложь; 
		ПоЦенновойГруппеОтбор= Ложь;
		
	КонецЕсли;
	
	Если НаНастройку Тогда
		
		ПоНоменклатуреОтбор		= Ложь; 
		ПоЦенновойГруппеОтбор	= Ложь;
		
		
	КонецЕсли;
	
	
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Артикул","%"+АртикулОтбор+"%");
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьАртикул",ЗначениеЗаполнено(АртикулОтбор));
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Код","%"+КодНоменклатурыОтбор+"%");
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКод",ЗначениеЗаполнено(КодНоменклатурыОтбор));
	
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Нарезка",НарезкаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНарезка",ЗначениеЗаполнено(НарезкаОтбор));
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПроизводственноеПомещение",ПроизводственноеПомещениеОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПроизводственноеПомещение",ЗначениеЗаполнено(ПроизводственноеПомещениеОтбор));
	
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Наименование","%"+НаименованиеОтбор+"%");
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНаименование",ЗначениеЗаполнено(НаименованиеОтбор));  	
	
	// <-- Начало Лико Яцун С. В. 26.02.2024
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ГруппаМатериалов",ГруппаМатериаловОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьГруппаМатериалов",ГруппаМатериаловОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Псевдоним",ПсевдонимОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПсевдоним",ПсевдонимОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЛицевойМатериал",ЛицевойМатериалОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЛицевойМатериал",ЛицевойМатериалОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Покрытие",ПокрытиеОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПокрытие",ПокрытиеОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Подложка",ПодложкаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПодложка",ПодложкаОтборИспользовать); 
	
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("КодКлея",КодКлеяОтбор);
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКодКлея",КодКлеяОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ВидКлея",ВидКлеяОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьВидКлея",ВидКлеяОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТипКлея",ТипКлеяОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьТипКлея",ТипКлеяОтборИспользовать);
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("МинимальнаяТемператураЭтикерования",МинимальнаяТемператураЭтикерованияОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьМинимальнаяТемператураЭтикерования",МинимальнаяТемператураЭтикерованияОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("МинимальнаяТемператураЭксплуатации",МинимальнаяТемператураЭксплуатацииОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьМинимальнаяТемператураЭксплуатации",МинимальнаяТемператураЭксплуатацииОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("МаксимальнаяТемператураЭксплуатации",МаксимальнаяТемператураЭксплуатацииОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьМаксимальнаяТемператураЭксплуатации",МаксимальнаяТемператураЭксплуатацииОтборИспользовать);
	
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("КлейДляЛаминации",КлейДляЛаминацииОтбор);
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКлейДляЛаминации",КлейДляЛаминацииОтборИспользовать); 
		
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("НаличиеПраймера",НаличиеПраймераОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНаличиеПраймера",НаличиеПраймераОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("КольеИлиМаленькийРадиус",КольеИлиМаленькийРадиусОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьКольеИлиМаленькийРадиус",КольеИлиМаленькийРадиусОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Этикетка",ЭтикеткаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЭтикетка",ЭтикеткаОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПЕФлакон",ПЕФлаконОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПЕФлакон",ПЕФлаконОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ПослеЗаморозки",ПослеЗаморозкиОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьПослеЗаморозки",ПослеЗаморозкиОтборИспользовать); 
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЧестныйЗнак",ЧестныйЗнакОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЧестныйЗнак",ЧестныйЗнакОтборИспользовать); 
	// <-- Конец Лико Яцун С. В. 26.02.2024
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЦеноваяГруппа",ЦеноваяГруппаОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьЦеноваяГруппа",ПоЦенновойГруппеОтбор);
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Номенклатура",НоменклатураОтбор);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЕстьНоменклатура",ПоНоменклатуреОтбор);
	
	//ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Склад",Объект.Склад);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Организация",лОрганизация);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Площадка",Площадка);
	
	
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("НаНастройку",НаНастройку);
	ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",ТекущаяДата());
	
	Если ПодготовкаПоПлощадке Тогда 
		
		ОстаткиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Лико_Площадка",Лико_Площадка);
		
	КонецЕсли;
	
	
КонецПроцедуры



&НаКлиенте
Функция ФильтрПоНоменклатуре() //+Лико m.shenderov 21.12.2017
	
	Возврат (Не ЗначениеЗаполнено(НарезкаОтбор) 
	и Не ЗначениеЗаполнено(КодНоменклатурыОтбор) 
	и Не ЗначениеЗаполнено(АртикулОтбор)
	и Не ЗначениеЗаполнено(НаименованиеОтбор))
	и Не НаНастройку;
	
	
КонецФункции //-Лико m.shenderov 21.12.2017 

&НаКлиенте
Процедура МатериалыПриАктивизацииСтроки(Элемент)
	
	ТД=Элементы.Материалы.ТекущиеДанные;
	
	Если    ТД<>Неопределено Тогда
		
		НоменклатураОтбор=ТД.Номенклатура;
		// <-- Начало Лико Яцун С. В. 12.03.2024
		ЗаполнитьСвойстваМатериалаВПоляОтбора();
		// <-- Конец Лико Яцун С. В. 12.03.2024
		Если ТипЗнч(ТД.Затрата)=Тип("СправочникСсылка.Номенклатура") ТОгда
			ЦеноваяГруппаОтбор=ТД.ЦеноваяГруппа;
			
		Иначе
			ЦеноваяГруппаОтбор=ТД.Затрата;
		КонецЕсли;
		
		Если BRC  Тогда
			
			СоставСмесиПлан.Очистить();
			
			ВидНоменклатуры= Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Номенклатура,"ВидНоменклатуры");
			ВидНоменклатурыКраска=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска"),"ЗначениеПараметра");
			
			Если ВидНоменклатуры=ВидНоменклатурыКраска Тогда
				ЗаполнитьСотавСмесиСервер(ТД.Номенклатура,Тд.Количество);
				
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли; 
	
	
	УстановитьПараметрыОстатковКлиент();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваМатериалаВПоляОтбора() // <-- Начало Лико Яцун С. В. 12.03.2024
	
	ГруппаМатериаловОтборИспользовать = Ложь;
	ПсевдонимОтборИспользовать = Ложь;
	ЛицевойМатериалОтборИспользовать = Ложь;
	ПокрытиеОтборИспользовать = Ложь;
	ПодложкаОтборИспользовать = Ложь;
	//КодКлеяОтборИспользовать = Ложь;
	ВидКлеяОтборИспользовать = Ложь;
	ТипКлеяОтборИспользовать = Ложь;
	//КлейДляЛаминацииОтборИспользовать = Ложь;
	НаличиеПраймераОтборИспользовать = Ложь;
	КольеИлиМаленькийРадиусОтборИспользовать = Ложь;
	ЭтикеткаОтборИспользовать = Ложь;
	ПЕФлаконОтборИспользовать = Ложь;
	ПослеЗаморозкиОтборИспользовать = Ложь;
	ЧестныйЗнакОтборИспользовать = Ложь;
	МинимальнаяТемператураЭтикерованияОтборИспользовать = Ложь;
	МинимальнаяТемператураЭксплуатацииОтборИспользовать = Ложь;
	МаксимальнаяТемператураЭксплуатацииОтборИспользовать = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_СвойстваМатериала.ГруппаМатериалов КАК ГруппаМатериалов,
		|	Лико_СвойстваМатериала.Псевдоним КАК Псевдоним,
		|	Лико_СвойстваМатериала.ЛицевойМатериал КАК ЛицевойМатериал,
		|	Лико_СвойстваМатериала.КодКлея.ТипКлея КАК ТипКлея,
		|	Лико_СвойстваМатериала.КодКлея.ВидКлея КАК ВидКлея,
		|	Лико_СвойстваМатериала.КодКлея КАК КодКлея,
		|	Лико_СвойстваМатериала.КлейДляЛаминации КАК КлейДляЛаминации,
		|	Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала КАК ПокрытиеРулонногоМатериала,
		|	Лико_СвойстваМатериала.НаличиеПраймера КАК НаличиеПраймера,
		|	Лико_СвойстваМатериала.КольеИлиМаленькийРадиус КАК КольеИлиМаленькийРадиус,
		|	Лико_СвойстваМатериала.Этикетка КАК Этикетка,
		|	Лико_СвойстваМатериала.ПЕФлакон КАК ПЕФлакон,
		|	Лико_СвойстваМатериала.ПослеЗаморозки КАК ПослеЗаморозки,
		|	Лико_СвойстваМатериала.ЧестныйЗнак КАК ЧестныйЗнак,
		|	Лико_СвойстваМатериала.Подложка КАК Подложка,
		|	Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования КАК МинимальнаяТемператураЭтикерования,
		|	Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации КАК МинимальнаяТемператураЭксплуатации,
		|	Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации КАК МаксимальнаяТемператураЭксплуатации
		|ИЗ
		|	Справочник.Лико_СвойстваМатериала КАК Лико_СвойстваМатериала
		|ГДЕ
		|	Лико_СвойстваМатериала.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураОтбор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ГруппаМатериаловОтбор = ВыборкаДетальныеЗаписи.ГруппаМатериалов;
		ПсевдонимОтбор = ВыборкаДетальныеЗаписи.Псевдоним;
		ЛицевойМатериалОтбор.Очистить();
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЛицевойМатериал) Тогда
			ЛицевойМатериалОтбор.Добавить(ВыборкаДетальныеЗаписи.ЛицевойМатериал); 
		КонецЕсли;
		ПокрытиеОтбор.Очистить();
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПокрытиеРулонногоМатериала) Тогда
			ПокрытиеОтбор.Добавить(ВыборкаДетальныеЗаписи.ПокрытиеРулонногоМатериала);
		КонецЕсли;
		ПодложкаОтбор.Очистить(); 
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подложка) Тогда
			ПодложкаОтбор.Добавить(ВыборкаДетальныеЗаписи.Подложка);
		КонецЕсли;
		//КодКлеяОтбор = ВыборкаДетальныеЗаписи.КодКлея;
		ВидКлеяОтбор = ВыборкаДетальныеЗаписи.ВидКлея;
		ТипКлеяОтбор = ВыборкаДетальныеЗаписи.ТипКлея;
		МинимальнаяТемператураЭтикерованияОтбор = ВыборкаДетальныеЗаписи.МинимальнаяТемператураЭтикерования;
		МинимальнаяТемператураЭксплуатацииОтбор = ВыборкаДетальныеЗаписи.МинимальнаяТемператураЭксплуатации;
		МаксимальнаяТемператураЭксплуатацииОтбор = ВыборкаДетальныеЗаписи.МаксимальнаяТемператураЭксплуатации;
		//КлейДляЛаминацииОтбор = ВыборкаДетальныеЗаписи.КлейДляЛаминации;
		НаличиеПраймераОтбор = ВыборкаДетальныеЗаписи.НаличиеПраймера;
		КольеИлиМаленькийРадиусОтбор = ВыборкаДетальныеЗаписи.КольеИлиМаленькийРадиус;
		ЭтикеткаОтбор = ВыборкаДетальныеЗаписи.Этикетка;
		ПЕФлаконОтбор = ВыборкаДетальныеЗаписи.ПЕФлакон;
		ПослеЗаморозкиОтбор = ВыборкаДетальныеЗаписи.ПослеЗаморозки;
		ЧестныйЗнакОтбор = ВыборкаДетальныеЗаписи.ЧестныйЗнак;
	КонецЦикла;
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		ГруппаМатериаловОтбор = Неопределено;
		ПсевдонимОтбор = Неопределено;
		ЛицевойМатериалОтбор = Неопределено;
		ПокрытиеОтбор = Неопределено;
		ПодложкаОтбор = Неопределено;
		//КодКлеяОтбор = Неопределено;
		ВидКлеяОтбор = Неопределено;
		ТипКлеяОтбор = Неопределено;
		//КлейДляЛаминацииОтбор = Неопределено;
		НаличиеПраймераОтбор = Ложь;
		КольеИлиМаленькийРадиусОтбор = Неопределено;
		ЭтикеткаОтбор = Неопределено;
		ПЕФлаконОтбор = Неопределено;
		ПослеЗаморозкиОтбор = Неопределено;
		ЧестныйЗнакОтбор = Неопределено;
		МинимальнаяТемператураЭтикерованияОтбор = Неопределено;
		МинимальнаяТемператураЭксплуатацииОтбор = Неопределено;
		МаксимальнаяТемператураЭксплуатацииОтбор = Неопределено;
	КонецЕсли;
	
КонецПроцедуры  // <-- Конец Лико Яцун С. В. 12.03.2024

&НаКлиенте
Процедура ПоЦеновойГруппеПриИзменении(Элемент)
	УстановитьПараметрыОстатковКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура НарезкаОтборПриИзменении(Элемент)
	УстановитьПараметрыОстатковКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура КодНоменклатурыОтборПриИзменении(Элемент)
	УстановитьПараметрыОстатковКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура АртикулОтборПриИзменении(Элемент)
	УстановитьПараметрыОстатковКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОтборПриИзменении(Элемент)
	УстановитьПараметрыОстатковКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРезерв(Команда)
	Резервировать();
	
	
КонецПроцедуры

&НаКлиенте
Процедура Резервировать110122()
	
	Перем Данные, ОписаниеОповещения, Структура, СтруктураЗаполнения;
	КоличествоРезервирования=0;
	Данные=Элементы.СоставСмесиПлан.ТекущиеДанные;
	Если Данные=Неопределено Тогда 
		Данные=Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
	КонецЕсли;
	
	Если Данные<> Неопределено Тогда
		РасчитатьКоличество(КоличествоРезервирования);
		
		ОписаниеОповещения=Новый ОписаниеОповещения("ВыбратьРезервЗавершение",ЭтаФорма);	
		Структура = Новый Структура;
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Количество",КоличествоРезервирования);
		СтруктураЗаполнения.Вставить("Нарезка",Данные.Нарезка);
		СтруктураЗаполнения.Вставить("ВидНастроечногоМатериала",Данные.ВидНастроечногоМатериала);
		СтруктураЗаполнения.Вставить("ОжидаетсяПриход",Ложь);
		СтруктураЗаполнения.Вставить("ОжидаетсяРасход",Ложь);
		СтруктураЗаполнения.Вставить("ЕстьНарезка",ЭтоРулонныйМатериал(Данные.Номенклатура)
		ИЛИ ЗначениеЗаполнено(Элементы.Материалы.ТекущиеДанные.Нарезка));
		Структура.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаВыборМатериала",Структура,
		,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Резервировать(СтрДанные = Неопределено)
	
	Перем Данные, ОписаниеОповещения, Структура, СтруктураЗаполнения;
	КоличествоРезервирования=0;
	// <-- Начало Лико Яцун С. В. 27.04.2024 
	//Данные=Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
	Если СтрДанные = Неопределено Тогда
		Данные = Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
	Иначе
		Данные = СтрДанные;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 27.04.2024
	ОрганизацияЛикофлекс=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс"),"ЗначениеПараметра");
	
	//Если Объект.Организация=ОрганизацияЛикофлекс И ПроверкаМатериаловТехнологом И Не НоменклатураПроверенаТехнологомСервер(Данные.Номенклатура) Тогда 
	//	Ждать ПредупреждениеАсинх(СтрШаблон("Номенклатура  %1 не проверена технологом!",Данные.Номенклатура));
	//	Возврат;		
	//КонецЕсли;
	
	
	Если Данные<> Неопределено Тогда
		РасчитатьКоличество(КоличествоРезервирования,СтрДанные);
		
		ОписаниеОповещения=Новый ОписаниеОповещения("ВыбратьРезервЗавершение2",ЭтаФорма,СтрДанные);	
		Структура = Новый Структура;
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Количество",КоличествоРезервирования);
		СтруктураЗаполнения.Вставить("Нарезка",Данные.Нарезка);
		СтруктураЗаполнения.Вставить("ВидНастроечногоМатериала",Данные.ВидНастроечногоМатериала);
		СтруктураЗаполнения.Вставить("ОжидаетсяПриход",Ложь);
		СтруктураЗаполнения.Вставить("ОжидаетсяРасход",Ложь);
		СтруктураЗаполнения.Вставить("ЕстьНарезка",ЭтоРулонныйМатериал(Данные.Номенклатура)
		ИЛИ ЗначениеЗаполнено(Элементы.Материалы.ТекущиеДанные.Нарезка));
		Структура.Вставить("СтруктураЗаполнения",СтруктураЗаполнения);
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаВыборМатериала",Структура,
		,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция НоменклатураПроверенаТехнологомСервер(лНоменклатура) //+Лико m.shenderov 17.03.2022
	//Номенклатура=Справочники.Номенклатура.СоздатьЭлемент();
	лВидНоменклатуры= лНоменклатура.ВидНоменклатуры;
	Если лВидНоменклатуры.Лико_РулонныйМатериал И 
		лВидНоменклатуры<>Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		Возврат ЗначениеЗаполнено(лНоменклатура.Лико_ПроверенТехнологом);
	КонецЕсли;	
	Возврат Истина;
КонецФункции  //-Лико m.shenderov 17.03.2022



&НаКлиенте  
Процедура ВыбратьРезервЗавершение2(РезультатФормы, ПараметрФормы) Экспорт
	
	Если РезультатФормы<>Неопределено Тогда
		Если  ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
			// <-- Начало Лико Яцун С. В. 27.04.2024
			//Данные=Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
			Если ПараметрФормы = Неопределено Тогда
				Данные = Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
			Иначе
				Данные = ПараметрФормы;
			КонецЕсли;
			// <-- Конец Лико Яцун С. В. 27.04.2024
			
			НовыйРезерв						 = Объект.Резервирование.Добавить();
			НовыйРезерв.Номенклатура		 = Данные.Номенклатура;
			Если ЭтоРулонныйМатериал(Данные.Номенклатура) Тогда
				
				НовыйРезерв.Нарезка			     = РезультатФормы.Нарезка; 
				НовыйРезерв.Характеристика		 = ПолучитьХарактеристикуПоНарезкеСервер(РезультатФормы.Нарезка);
				НовыйРезерв.Нарезка				 = РезультатФормы.Нарезка;
				НовыйРезерв.Упаковка			 = ПолучитьУпаковкуПоНарезкеСервер(РезультатФормы.Нарезка);
				НовыйРезерв.КоличествоУпаковок	 = РезультатФормы.Количество; 
				НовыйРезерв.Количество			 = НовыйРезерв.КоличествоУпаковок*Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйРезерв.Упаковка,"Числитель");
			Иначе
				НовыйРезерв.Количество	 = РезультатФормы.Количество;
				НовыйРезерв.КоличествоУпаковок	 = РезультатФормы.Количество;
				
			КонецЕсли;
			
			
			
			
			НовыйРезерв.СтатьяЗатрат         = Элементы.Материалы.ТекущиеДанные.СтатьяЗатрат;
			НовыйРезерв.ОжидаетсяПриход		 = РезультатФормы.ОжидаетсяПриход;
			НовыйРезерв.ОжидаетсяПереработка = РезультатФормы.ОжидаетсяПереработка;
			НовыйРезерв.ВидРабот 			 = Элементы.Материалы.ТекущиеДанные.ВидРабот;
			НовыйРезерв.ВидСекции 			 = Элементы.Материалы.ТекущиеДанные.ВидСекции;

			НовыйРезерв.НомерРаботы 	     = Элементы.Материалы.ТекущиеДанные.НомерРаботы;
			НовыйРезерв.ВидНастроечногоМатериала = Данные.ВидНастроечногоМатериала;
			НовыйРезерв.Настройка = Данные.ВидНастроечногоМатериала;
			НовыйРезерв.ВидНастроечногоМатериала = Данные.ВидНастроечногоМатериала;
			Если ЭтоЛикофлексНеЦифровой() Тогда
				
				НовыйРезерв.ОжидаетсяПриход = Истина;
				НовыйРезерв.ОжидаетсяПереработка = Истина;
				
				
				
			КонецЕсли;
			
			
			
			
			
			
			ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);  
			Элементы.ОстаткиНоменклатуры.Обновить();
			Если ЭтоЛикофлексНеЦифровой() Тогда
				
				Модифицированность=Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте  
Процедура РезервироватьСоставСмесиКлиент() 
	
	ЗаписатьРезерв=Ложь;
	
	Для каждого Смесь Из СоставСмесиПлан Цикл
		
		
		НайденныеСтроки=Объект.Резервирование.НайтиСтроки(Новый Структура("Номенклатура",Смесь.Номенклатура));
		КолСпис=0;
		Для каждого НСтр Из НайденныеСтроки Цикл
			КолСпис=КолСпис+НСтр.Количество;	
		КонецЦикла;
		Списать=Смесь.Количество-КолСпис;
		Если Списать>0 Тогда
			ЗаписатьРезерв=Истина;
			
			НовыйРезерв						 = Объект.Резервирование.Добавить();
			НовыйРезерв.Номенклатура		 = Смесь.Номенклатура;
			НовыйРезерв.Количество	         = Списать;
			НовыйРезерв.КоличествоУпаковок	 = Списать;			  
			НовыйРезерв.СтатьяЗатрат 		 = Элементы.Материалы.ТекущиеДанные.СтатьяЗатрат;
			НовыйРезерв.ВидРабот             = Элементы.Материалы.ТекущиеДанные.ВидРабот;
			НовыйРезерв.НомерРаботы 	     = Элементы.Материалы.ТекущиеДанные.НомерРаботы; 
		КонецЕсли;		
	КонецЦикла; 	
	
	Если ЗаписатьРезерв Тогда
		
		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);  
		Элементы.ОстаткиНоменклатуры.Обновить();
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьКоличество(КоличествоРезервирования,СтрДанные = Неопределено)
	Если Объект.Организация=ПолучитьОрганизациюИксПакНаСервере() Тогда
		
		Материал=Элементы.СоставСмесиПлан.ТекущиеДанные;
		
		Если Материал=Неопределено Тогда
			Материал=Элементы.Материалы.ТекущиеДанные; 
		КонецЕсли;
		Номенклатура=Материал.Номенклатура;
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Номенклатура);
		КоличествоРезервирования=Материал.КоличествоУпаковок;
		НайденныеСтроки=Объект.Резервирование.НайтиСтроки(Структура);
		Для каждого Стр Из НайденныеСтроки Цикл
			КоличествоРезервирования=КоличествоРезервирования-Стр.КоличествоУпаковок;
			
		КонецЦикла;
		КоличествоРезервирования=Макс(КоличествоРезервирования,0);
		
		Материал=Элементы.Материалы.ТекущиеДанные;
		
		СкорректироватьКоличествоРезервирования(КоличествоРезервирования,Материал.СтатьяЗатрат);
		
		
		
	Иначе	
		
		Материал=Элементы.Материалы.ТекущиеДанные;
		СтатьяЗатрат=Материал.СтатьяЗатрат;
		Структура = Новый Структура;
		Структура.Вставить("СтатьяЗатрат",СтатьяЗатрат);
		КоличествоРезервирования=Материал.КоличествоУпаковок;
		НайденныеСтроки=Объект.Резервирование.НайтиСтроки(Структура);
		Для каждого Стр Из НайденныеСтроки Цикл
			КоличествоРезервирования=КоличествоРезервирования-Стр.КоличествоУпаковок;
			
		КонецЦикла;
		КоличествоРезервирования=Макс(КоличествоРезервирования,0);
		
		СкорректироватьКоличествоРезервирования(КоличествоРезервирования,Материал.СтатьяЗатрат); 
		
		// <-- Начало Лико Яцун С. В. 27.04.2024
		//ТД=Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
		Если СтрДанные = Неопределено Тогда
			ТД = Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
		Иначе
			ТД = СтрДанные;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 27.04.2024
		
		Если ТД<>Неопределено И Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Номенклатура,"Код")="n0000165119" Тогда
			
			КоличествоРезервирования=КоличествоРезервирования/3;	
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры


Функция ПолучитьОрганизациюИксПакНаСервере () //+Лико m.shenderov 13.05.2021
	Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра;	
КонецФункции //-Лико m.shenderov 13.05.2021 



Процедура СкорректироватьКоличествоРезервирования080621 (КоличествоРезервирования,СтатьяЗатрат)
	Если Объект.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра  Тогда
		Если   СтатьяЗатрат=Справочники.Лико_СтатьиЗатрат.КраскаОфсет ТОгда
			КоличествоРезервирования=КоличествоРезервирования+5;
		ИначеЕсли   СтатьяЗатрат=Справочники.Лико_СтатьиЗатрат.КраскаФлексо ТОгда
			КоличествоРезервирования=КоличествоРезервирования+2.5;
		ИначеЕсли   СтатьяЗатрат=Справочники.Лико_СтатьиЗатрат.ЛакФлексо ТОгда
			КоличествоРезервирования=КоличествоРезервирования+2.5; 
		КонецЕсли;		
	КонецЕсли
	
КонецПроцедуры


Процедура СкорректироватьКоличествоРезервирования(КоличествоРезервирования, СтатьяЗатрат)
	Возврат;
КонецПроцедуры



&НаКлиенте
Процедура ВыбратьРезервЗавершение080621(РезультатФормы, ПараметрФормы) Экспорт
	
	Если РезультатФормы<>Неопределено Тогда
		Если  ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
			Данные=Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
			
			НовыйРезерв						 = Объект.Резервирование.Добавить();
			НовыйРезерв.Номенклатура		 = Данные.Номенклатура;
			НовыйРезерв.Нарезка			     = РезультатФормы.Нарезка; 
			НовыйРезерв.Характеристика		 = ПолучитьХарактеристикуПоНарезкеСервер(РезультатФормы.Нарезка);
			НовыйРезерв.Нарезка				 = РезультатФормы.Нарезка;
			НовыйРезерв.КоличествоУпаковок	 = РезультатФормы.Количество;
			НовыйРезерв.Упаковка			 = ПолучитьУпаковкуПоНарезкеСервер(РезультатФормы.Нарезка);
			НовыйРезерв.Количество			 = НовыйРезерв.КоличествоУпаковок*Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйРезерв.Упаковка,"Числитель");
			НовыйРезерв.СтатьяЗатрат         = Элементы.Материалы.ТекущиеДанные.СтатьяЗатрат;
			НовыйРезерв.ОжидаетсяПриход		 = РезультатФормы.ОжидаетсяПриход;
			НовыйРезерв.ОжидаетсяПереработка = РезультатФормы.ОжидаетсяПереработка;
			НовыйРезерв.ВидРабот 			 = Элементы.Материалы.ТекущиеДанные.ВидРабот;
			НовыйРезерв.НомерРаботы 	     = Элементы.Материалы.ТекущиеДанные.НомерРаботы;
			НовыйРезерв.ВидНастроечногоМатериала = Данные.ВидНастроечногоМатериала;
			НовыйРезерв.Настройка = Данные.ВидНастроечногоМатериала;
			НовыйРезерв.ВидНастроечногоМатериала = Данные.ВидНастроечногоМатериала;
			Если ЭтоЛикофлексНеЦифровой() Тогда
				
				НовыйРезерв.ОжидаетсяПриход = Истина;
				НовыйРезерв.ОжидаетсяПереработка = Истина;
				
				
				
			КонецЕсли;
			
			
			
			
			
			
			ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);  
			Элементы.ОстаткиНоменклатуры.Обновить();
			Если ЭтоЛикофлексНеЦифровой() Тогда
				
				Модифицированность=Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРезервЗавершение(РезультатФормы, ПараметрФормы)
	
	Если РезультатФормы<>Неопределено Тогда
		Если  ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
			Данные=Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
			
			
			НовыйРезерв						 = Объект.Резервирование.Добавить();
			НовыйРезерв.Номенклатура		 = Данные.Номенклатура;
			Если ЭтоРулонныйМатериал(Данные.Номенклатура) Тогда
				
				НовыйРезерв.Нарезка			     = РезультатФормы.Нарезка; 
				НовыйРезерв.Характеристика		 = ПолучитьХарактеристикуПоНарезкеСервер(РезультатФормы.Нарезка);
				НовыйРезерв.Нарезка				 = РезультатФормы.Нарезка;
				НовыйРезерв.Упаковка			 = ПолучитьУпаковкуПоНарезкеСервер(РезультатФормы.Нарезка);
				НовыйРезерв.КоличествоУпаковок	 = РезультатФормы.Количество; 
				НовыйРезерв.Количество			 = НовыйРезерв.КоличествоУпаковок*Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйРезерв.Упаковка,"Числитель");
			Иначе
				НовыйРезерв.Количество	 = РезультатФормы.Количество;
				НовыйРезерв.КоличествоУпаковок	 = РезультатФормы.Количество;
				
			КонецЕсли;
			
			
			
			
			НовыйРезерв.СтатьяЗатрат         = Элементы.Материалы.ТекущиеДанные.СтатьяЗатрат;
			НовыйРезерв.ОжидаетсяПриход		 = РезультатФормы.ОжидаетсяПриход;
			НовыйРезерв.ОжидаетсяПереработка = РезультатФормы.ОжидаетсяПереработка;
			НовыйРезерв.ВидРабот 			 = Элементы.Материалы.ТекущиеДанные.ВидРабот;
			НовыйРезерв.НомерРаботы 	     = Элементы.Материалы.ТекущиеДанные.НомерРаботы;
			НовыйРезерв.ВидНастроечногоМатериала = Данные.ВидНастроечногоМатериала;
			НовыйРезерв.Настройка = Данные.ВидНастроечногоМатериала;
			НовыйРезерв.ВидНастроечногоМатериала = Данные.ВидНастроечногоМатериала;
			Если ЭтоЛикофлексНеЦифровой() Тогда
				
				НовыйРезерв.ОжидаетсяПриход = Истина;
				НовыйРезерв.ОжидаетсяПереработка = Истина;
				
				
				
			КонецЕсли;
			
			
			
			
			
			
			ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);  
			Элементы.ОстаткиНоменклатуры.Обновить();
			Если ЭтоЛикофлексНеЦифровой() Тогда
				
				Модифицированность=Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры



Функция ЭтоЛикофлексНеЦифровой () //+Лико m.shenderov 05.07.2020
	Возврат Объект.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра и Не Объект.ЗаказКлиента.Цифровой;	
КонецФункции //-Лико m.shenderov 05.07.2020 


&НаСервереБезКонтекста
Функция ПолучитьХарактеристикуПоНарезкеСервер(Нарезка) //+Лико m.shenderov 21.12.2017
	Справочники.ЯССМ_Нарезки.ПроверкаНаличияХарактеистикиНарезки(Нарезка); 
	Возврат Справочники.ЯССМ_Нарезки.ХарактеристикаПоНарезке(Нарезка);
	
КонецФункции  //-Лико m.shenderov 21.12.2017


&НаСервереБезКонтекста
Функция ПолучитьУпаковкуПоНарезкеСервер(Нарезка) //+Лико m.shenderov 21.12.2017
	
	Возврат Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка);
	
КонецФункции  //-Лико m.shenderov 21.12.2017

&НаКлиенте
Процедура ОстаткиНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
КонецПроцедуры

&НаКлиенте
Процедура РезервированиеПослеУдаления(Элемент)
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);  
	Элементы.ОстаткиНоменклатуры.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура РезервированиеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Резервировать(); 
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоСкладу(Команда)
	ТекСтрока=Неопределено;
	Если ЭтаФорма.ТекущийЭлемент=Элементы.Материалы Тогда
		ТекСтрока=Элементы.Материалы.ТекущиеДанные;
	ИначеЕсли ЭтаФорма.ТекущийЭлемент=Элементы.Резервирование Тогда
		ТекСтрока=Элементы.Резервирование.ТекущиеДанные;
		
	ИначеЕсли ЭтаФорма.ТекущийЭлемент=Элементы.ОстаткиНоменклатуры Тогда
		ТекСтрока=Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
		
	КонецЕсли;
	Если ТекСтрока<>Неопределено Тогда	
		
		Лико_СкладыКлиент.ОткрытьОтчетПоОстаткам(Элементы.Материалы.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиНоменклатурыВыбор300920(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ОстаткиНоменклатурыВРезерве" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала);
		
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаРезервирования",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
	
	Если Поле.Имя="ОстаткиНоменклатурыОстатокНаМашине" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала);
		
		Массив=Новый Массив;
		Массив.добавить(ПомещениеПроизводство);		
		Структура.Вставить("МассивПомещений",Массив); 		
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	
	Если Поле.Имя="ОстаткиНоменклатурыОстаток" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала);
		
		Массив=Новый Массив;
		Массив.добавить(ПомещениеСИМ);
		Массив.Добавить(ПомещенияСимДоп);
		Структура.Вставить("МассивПомещений",Массив); 		
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиНоменклатурыВыбор110122(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ОстаткиНоменклатурыВРезерве" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала);
		Структура.Вставить("Организация",Объект.Организация);
		
		Структура.Вставить("Площадка",Площадка);
		
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаРезервирования",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
	
	Если Поле.Имя="ОстаткиНоменклатурыОстатокНаМашине" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала);
		
		Массив=Новый Массив;
		Массив.добавить(ПомещениеПроизводство);	
		Если Объект.Организация=ПолучитьОрганизациюЛикофлексНаСервере() Тогда
			Массив.добавить(ПолучитьПомещениеПроизводствоЦифраНаСервере());	
			
		КонецЕсли;
		Структура.Вставить("МассивПомещений",Массив); 		
		Структура.Вставить("Площадка",Площадка);
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	
	Если Поле.Имя="ОстаткиНоменклатурыОстаток" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала);
		
		Массив=Новый Массив;
		Массив.добавить(ПомещениеСИМ);
		Массив.добавить(ПомещенияСимДоп);
		
		
		Структура.Вставить("МассивПомещений",Массив);
		Структура.Вставить("Площадка",Площадка);
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОстаткиНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ОстаткиНоменклатурыВРезерве" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала); 
		Структура.Вставить("К2",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.К2);

		Структура.Вставить("Организация",Объект.Организация);
		
		Структура.Вставить("Площадка",Площадка);
		
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаРезервирования",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
	
	Если Поле.Имя="ОстаткиНоменклатурыОстатокНаМашине" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала); 
		Структура.Вставить("К2",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.К2);

		
		//Массив=Новый Массив;
		//Массив.добавить(ПомещениеПроизводство);	
		//Если Объект.Организация=ПолучитьОрганизациюЛикофлексНаСервере() Тогда
		//	Массив.добавить(ПолучитьПомещениеПроизводствоЦифраНаСервере());	
		//	
		//КонецЕсли;
		//Структура.Вставить("МассивПомещений",Массив); 		
		Структура.Вставить("Площадка",Площадка);
		Структура.Вставить("ТипСклада",ПредопределенноеЗначение("Перечисление.Лико_ТипСклада.Производство"));
		Структура.Вставить("УдаленныйСклад",Ложь);
		Структура.Вставить("ОтветХранение",Ложь);


		
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	
	Если Поле.Имя="ОстаткиНоменклатурыОстаток" ИЛИ Поле.Имя="ОстаткиНоменклатурыРезервПодКлиента" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала);
		Структура.Вставить("К2",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.К2); 
		Структура.Вставить("ЗаказКлиента",Объект.ЗаказКлиента); 
		
		Если РезервПодРегионы Тогда
			
			Структура.Вставить("Резерв",Резерв); 
		Иначе
			Структура.Вставить("Партнер",Партнер);
		КонецЕсли;
		


		
		//Массив=Новый Массив;
		//Массив.добавить(ПомещениеСИМ);
		//Для каждого ПД Из ПомещенияСимДоп Цикл
		//	Массив.Добавить(ПД.Значение);	
		//КонецЦикла;
		////Массив.добавить(ПомещенияСимДоп);
		//
		//
		//Структура.Вставить("МассивПомещений",Массив); 
		Структура.Вставить("ТипСклада",ПредопределенноеЗначение("Перечисление.Лико_ТипСклада.СИМ"));
		Структура.Вставить("УдаленныйСклад",Ложь);
		Структура.Вставить("Площадка",Площадка);
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	Если Поле.Имя="ОстаткиНоменклатурыУдаленныйСклад" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала); 
		Структура.Вставить("К2",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.К2); 
		//Структура.Вставить("МассивПомещений",МассивУдаленныхПомещенийСервер());
		Структура.Вставить("Площадка",Площадка);  
		Структура.Вставить("ЗаказКлиента",Объект.ЗаказКлиента); 
		
		Если РезервПодРегионы Тогда
			
			Структура.Вставить("Резерв",Резерв); 
		Иначе
			Структура.Вставить("Партнер",Партнер);
		КонецЕсли;

		
        Структура.Вставить("ТипСклада",ПредопределенноеЗначение("Перечисление.Лико_ТипСклада.СИМ")); 
		Структура.Вставить("УдаленныйСклад",Истина);  
		Структура.Вставить("ОтветХранение",Ложь);
		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
	Если Поле.Имя="ОстаткиНоменклатурыОтветХранение" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Характеристика);
		Структура.Вставить("ВидНастроечногоМатериала",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.ВидНастроечногоМатериала); 
		Структура.Вставить("К2",Элементы.ОстаткиНоменклатуры.ТекущиеДанные.К2); 
		//Структура.Вставить("МассивПомещений",МассивУдаленныхПомещенийСервер());
		Структура.Вставить("Площадка",Площадка);  
		Структура.Вставить("ЗаказКлиента",Объект.ЗаказКлиента); 
		
		Если РезервПодРегионы Тогда
			
			Структура.Вставить("Резерв",Резерв); 
		Иначе
			Структура.Вставить("Партнер",Партнер);
		КонецЕсли;

		
		Структура.Вставить("ТипСклада",ПредопределенноеЗначение("Перечисление.Лико_ТипСклада.ПустаяСсылка")); 
		Структура.Вставить("УдаленныйСклад",Ложь); 
		Структура.Вставить("ОтветХранение",Истина);

		ОткрытьФорму("Документ.Лико_ПодготовкаМатериалов.Форма.ФормаОстатков",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;


	
	
КонецПроцедуры



Функция ПолучитьОрганизациюЛикофлексНаСервере() //+Лико m.shenderov 24.07.2020
	Возврат	Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра;	
КонецФункции //-Лико m.shenderov 24.07.2020 

Функция ПолучитьПомещениеПроизводствоЦифраНаСервере() //+Лико m.shenderov 24.07.2020
	Возврат Справочники.СкладскиеПомещения.НайтиПоНаименованию("Производство цифра (Ликофлекс)");	
КонецФункции //-Лико m.shenderov 24.07.2020 



&НаКлиенте
Процедура КопироватьВБуфер(Команда)
	#Если Клиент И Не МобильныйКлиент Тогда
		мОбъект = Новый COMОбъект("htmlfile");
		мОбъект.ParentWindow.ClipboardData.SetData("Text", Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.ОстаткиНоменклатуры.ТекущиеДанные.Номенклатура,"Код"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НаНастройкуПриИзменении(Элемент)
	УстановитьПараметрыОстатковКлиент();
	
КонецПроцедуры



Процедура УстановитьЗапросОстатков()
	
	ОстаткиНоменклатуры.ТекстЗапроса= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	                                  |	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	                                  |	РабочиеЦентры.Лико_ПроизводственноеПомещение КАК ПроизводственноеПомещение
	                                  |ПОМЕСТИТЬ ВтРабочиеЦентры
	                                  |ИЗ
	                                  |	Справочник.РабочиеЦентры КАК РабочиеЦентры
	                                  |ГДЕ
	                                  |	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                                  |	ТоварыВЯчейкахОстатки.Серия КАК Серия
	                                  |ПОМЕСТИТЬ ВтТоварыК2
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
	                                  |			Характеристика.ЯССМ_Нарезка.Размер > 0
	                                  |				И Ячейка.Лико_Организация = &Организация
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = Лико_БракСерий.Серия
	                                  |ГДЕ
	                                  |	Лико_БракСерий.Решение = ЗНАЧЕНИЕ(Справочник.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2)
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ТоварыВЯчейкахОстатки.Серия
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ) КАК ОстатокНаСкладе,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ) КАК ОстатокНаМашине,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	                                  |	0 КАК Карантин,
	                                  |	0 КАК КарантинУУ,
	                                  |	0 КАК Блокировка,
	                                  |	0 КАК БлокировкаУУ,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал КАК РулонныйМатериал,
	                                  |	0 КАК УдаленныйСклад,
	                                  |	0 КАК УдаленныйСкладУУ,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ КАК К2,
	                                  |	0 КАК ОтветХранение,
	                                  |	0 КАК ОтветХранениеУУ
	                                  |ПОМЕСТИТЬ ВтТоварыНаСкладах2
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
	                                  |			Ячейка.Лико_Организация = &Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ),
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ),
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	0,
	                                  |	0,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	0,
	                                  |	0
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
	                                  |			Ячейка.Лико_Организация = &Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |ГДЕ
	                                  |	ВЫБОР
	                                  |			КОГДА &BRC
	                                  |				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	                                  |						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	                                  |			ИНАЧЕ ЛОЖЬ
	                                  |		КОНЕЦ
	                                  |	И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо >= &ТекущаяДата
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	СУММА(0),
	                                  |	СУММА(0),
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	0,
	                                  |	0,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	0,
	                                  |	0,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	0,
	                                  |	0
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
	                                  |			Ячейка.Лико_Организация = &Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |ГДЕ
	                                  |	(ВЫБОР
	                                  |				КОГДА &BRC
	                                  |					ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	                                  |				ИНАЧЕ ЛОЖЬ
	                                  |			КОНЕЦ
	                                  |			ИЛИ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо < &ТекущаяДата)
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ),
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	0,
	                                  |	0
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
	                                  |			Ячейка.Лико_Организация = &Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	0,
	                                  |	0,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ)
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
	                                  |			Ячейка.Лико_Организация = &Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ
	                                  |	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	                                  |	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.ОстатокНаСкладе
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ
	                                  |		КОНЕЦ) КАК ОстатокНаСкладе,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.ОстатокНаМашине
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.ОстатокНаМашинеУУ
	                                  |		КОНЕЦ) КАК ОстатокНаМашине,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	                                  |	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	                                  |	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	                                  |	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.Карантин
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.КарантинУУ
	                                  |		КОНЕЦ) КАК Карантин,
	                                  |	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.Блокировка
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.БлокировкаУУ
	                                  |		КОНЕЦ) КАК Блокировка,
	                                  |	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ,
	                                  |	ВтТоварыНаСкладах2.РулонныйМатериал КАК РулонныйМатериал,
	                                  |	СУММА(ВтТоварыНаСкладах2.УдаленныйСклад) КАК УдаленныйСклад,
	                                  |	СУММА(ВтТоварыНаСкладах2.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	                                  |	ВтТоварыНаСкладах2.К2 КАК К2,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОтветХранение) КАК ОтветХранение,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОтветХранениеУУ) КАК ОтветХранениеУУ
	                                  |ПОМЕСТИТЬ ВтТоварыНаСкладах3
	                                  |ИЗ
	                                  |	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ВтТоварыНаСкладах2.Номенклатура,
	                                  |	ВтТоварыНаСкладах2.Нарезка,
	                                  |	ВтТоварыНаСкладах2.Характеристика,
	                                  |	ВтТоварыНаСкладах2.КатегорияТовара,
	                                  |	ВтТоварыНаСкладах2.ВидНастроечногоМатериала,
	                                  |	ВтТоварыНаСкладах2.РулонныйМатериал,
	                                  |	ВтТоварыНаСкладах2.К2
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	                                  |	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	                                  |	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	                                  |	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	                                  |	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСклад КАК УдаленныйСклад,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСкладУУ КАК УдаленныйСкладУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ) КАК К2,
	                                  |	ВтТоварыНаСкладах3.ОтветХранение КАК ОтветХранение,
	                                  |	ВтТоварыНаСкладах3.ОтветХранениеУУ КАК ОтветХранениеУУ
	                                  |ПОМЕСТИТЬ ВтОстатки
	                                  |ИЗ
	                                  |	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	                                  |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	                                  |				,
	                                  |				Организация = &Организация
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНарезка
	                                  |							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЦеноваяГруппа
	                                  |							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНоменклатура
	                                  |							ТОГДА Номенклатура = &Номенклатура
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьКод
	                                  |							ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНаименование
	                                  |							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьАртикул
	                                  |							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьГруппаМатериалов
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПсевдоним
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЛицевойМатериал
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПокрытие
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПодложка
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьВидКлея
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьТипКлея
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНаличиеПраймера
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЭтикетка
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПЕФлакон
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПослеЗаморозки
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЧестныйЗнак
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	                                  |		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	                                  |			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	                                  |			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	                                  |	ВтТоварыНаСкладах3.Карантин,
	                                  |	ВтТоварыНаСкладах3.КарантинУУ,
	                                  |	ВтТоварыНаСкладах3.Блокировка,
	                                  |	ВтТоварыНаСкладах3.БлокировкаУУ,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСклад,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСкладУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ),
	                                  |	ВтТоварыНаСкладах3.ОтветХранение,
	                                  |	ВтТоварыНаСкладах3.ОтветХранениеУУ
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	Номен.Ссылка КАК Номенклатура,
	                                  |	ВтОстатки.Нарезка КАК Нарезка,
	                                  |	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	                                  |	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	                                  |	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	                                  |	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	                                  |	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	                                  |	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	                                  |	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	                                  |	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	                                  |	ВтОстатки.Характеристика КАК Характеристика,
	                                  |	ВтОстатки.Категория КАК Категория,
	                                  |	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	                                  |	СУММА(ВтОстатки.Карантин) КАК Карантин,
	                                  |	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	                                  |	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	                                  |	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ,
	                                  |	&Склад КАК Склад,
	                                  |	&ПомещениеПроизводство КАК ПомещениеПроизводство,
	                                  |	&ПомещениеСИМ КАК ПомещениеСИМ,
	                                  |	Номен.Лико_ПроверенТехнологом КАК ПроверенТехнологом,
	                                  |	МАКСИМУМ(ВтОстатки.УдаленныйСклад) КАК УдаленныйСклад,
	                                  |	МАКСИМУМ(ВтОстатки.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	                                  |	ВтОстатки.К2 КАК К2,
	                                  |	МАКСИМУМ(ВтОстатки.ОтветХранение) КАК ОтветХранение,
	                                  |	МАКСИМУМ(ВтОстатки.ОтветХранениеУУ) КАК ОтветХранениеУУ
	                                  |ИЗ
	                                  |	Справочник.Номенклатура КАК Номен
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	                                  |		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	                                  |			И (ВЫБОР
	                                  |				КОГДА &ЕстьНарезка
	                                  |					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	                                  |				ИНАЧЕ ИСТИНА
	                                  |			КОНЕЦ)
	                                  |ГДЕ
	                                  |	ВЫБОР
	                                  |			КОГДА &ЕстьЦеноваяГруппа
	                                  |				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНоменклатура
	                                  |				ТОГДА Номен.Ссылка = &Номенклатура
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьКод
	                                  |				ТОГДА Номен.Код ПОДОБНО &Код
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНаименование
	                                  |				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьАртикул
	                                  |				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНарезка
	                                  |				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &НаНастройку
	                                  |				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	                                  |						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьГруппаМатериалов
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПсевдоним
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьЛицевойМатериал
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПокрытие
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПодложка
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьВидКлея
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьТипКлея
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНаличиеПраймера
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьЭтикетка
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПЕФлакон
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПослеЗаморозки
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьЧестныйЗнак
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	Номен.Ссылка,
	                                  |	ВтОстатки.Нарезка,
	                                  |	ВтОстатки.Характеристика,
	                                  |	ВтОстатки.Категория,
	                                  |	ВтОстатки.ВидНастроечногоМатериала,
	                                  |	Номен.Лико_ПроверенТехнологом,
	                                  |	ВтОстатки.К2
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтТоварыНаСкладах2
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтТоварыНаСкладах3
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтРабочиеЦентры
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтОстатки"
	
	
КонецПроцедуры

Процедура УстановитьЗапросОстатковПоПлощадке()
	
	ОстаткиНоменклатуры.ТекстЗапроса= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	                                  |	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	                                  |	РабочиеЦентры.Лико_ПроизводственноеПомещение КАК ПроизводственноеПомещение
	                                  |ПОМЕСТИТЬ ВтРабочиеЦентры
	                                  |ИЗ
	                                  |	Справочник.РабочиеЦентры КАК РабочиеЦентры
	                                  |ГДЕ
	                                  |	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                                  |	ТоварыВЯчейкахОстатки.Серия КАК Серия
	                                  |ПОМЕСТИТЬ ВтТоварыК2
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
	                                  |			Характеристика.ЯССМ_Нарезка.Размер > 0
									  //|				И Ячейка.Лико_Организация = &Организация
	                                  |				И Ячейка.Лико_Площадка = &Лико_Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = Лико_БракСерий.Серия
	                                  |ГДЕ
	                                  |	Лико_БракСерий.Решение = ЗНАЧЕНИЕ(Справочник.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2)
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ТоварыВЯчейкахОстатки.Серия
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ) КАК ОстатокНаСкладе,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ) КАК ОстатокНаМашине,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	                                  |	0 КАК Карантин,
	                                  |	0 КАК КарантинУУ,
	                                  |	0 КАК Блокировка,
	                                  |	0 КАК БлокировкаУУ,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал КАК РулонныйМатериал,
	                                  |	0 КАК УдаленныйСклад,
	                                  |	0 КАК УдаленныйСкладУУ,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ КАК К2,
	                                  |	0 КАК ОтветХранение,
	                                  |	0 КАК ОтветХранениеУУ
	                                  |ПОМЕСТИТЬ ВтТоварыНаСкладах2
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
									  //|			Ячейка.Лико_Организация = &Площадка
	                                  |				 Ячейка.Лико_Площадка = &Лико_Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ВЫБОР
	                                  |						КОГДА НЕ &ЕстьПроизводственноеПомещение
	                                  |								ИЛИ &ЕстьПроизводственноеПомещение
	                                  |									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	                                  |							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	                                  |					КОНЕЦ
	                                  |		КОНЕЦ),
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ),
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	0,
	                                  |	0,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	0,
	                                  |	0
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
									  //|			Ячейка.Лико_Организация = &Площадка
	                                  |				Ячейка.Лико_Площадка = &Лико_Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |ГДЕ
	                                  |	ВЫБОР
	                                  |			КОГДА &BRC
	                                  |				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	                                  |						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	                                  |			ИНАЧЕ ЛОЖЬ
	                                  |		КОНЕЦ
	                                  |	И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо >= &ТекущаяДата
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	СУММА(0),
	                                  |	СУММА(0),
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	0,
	                                  |	0,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	0,
	                                  |	0,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	0,
	                                  |	0
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
									  //|			Ячейка.Лико_Организация = &Площадка
	                                  |				 Ячейка.Лико_Площадка = &Лико_Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |ГДЕ
	                                  |	(ВЫБОР
	                                  |				КОГДА &BRC
	                                  |					ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	                                  |				ИНАЧЕ ЛОЖЬ
	                                  |			КОНЕЦ
	                                  |			ИЛИ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо < &ТекущаяДата)
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ),
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	0,
	                                  |	0
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
									  //|			Ячейка.Лико_Организация = &Площадка
	                                  |				 Ячейка.Лико_Площадка = &Лико_Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И Ячейка.Лико_УдаленныйСклад
	                                  |				И НЕ Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	0,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	0,
	                                  |	0,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	                                  |		КОНЕЦ),
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	                                  |				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 1)
	                                  |		КОНЕЦ)
	                                  |ИЗ
	                                  |	РегистрНакопления.ТоварыВЯчейках.Остатки(
	                                  |			,
									  //|			Ячейка.Лико_Организация = &Площадка
	                                  |				 Ячейка.Лико_Площадка = &Лико_Площадка
	                                  |				И НЕ Ячейка.Лико_ПомещениеБрака
	                                  |				И НЕ Ячейка.Лико_УдаленныйСклад
	                                  |				И Ячейка.Лико_ОтветственноеХранение
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНарезка
	                                  |						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЦеноваяГруппа
	                                  |						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНоменклатура
	                                  |						ТОГДА Номенклатура = &Номенклатура
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКод
	                                  |						ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаименование
	                                  |						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьАртикул
	                                  |						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьГруппаМатериалов
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПсевдоним
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЛицевойМатериал
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПокрытие
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПодложка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьВидКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьТипКлея
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьНаличиеПраймера
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЭтикетка
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПЕФлакон
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьПослеЗаморозки
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьЧестныйЗнак
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ
	                                  |				И ВЫБОР
	                                  |					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |					ИНАЧЕ ИСТИНА
	                                  |				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	                                  |		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	                                  |		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура,
	                                  |	ТоварыВЯчейкахОстатки.Характеристика,
	                                  |	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	                                  |	ТоварыВЯчейкахОстатки.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал,
	                                  |	ВЫБОР
	                                  |		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	                                  |			ТОГДА ИСТИНА
	                                  |		ИНАЧЕ ЛОЖЬ
	                                  |	КОНЕЦ
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ
	                                  |	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	                                  |	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.ОстатокНаСкладе
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ
	                                  |		КОНЕЦ) КАК ОстатокНаСкладе,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.ОстатокНаМашине
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.ОстатокНаМашинеУУ
	                                  |		КОНЕЦ) КАК ОстатокНаМашине,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	                                  |	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	                                  |	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	                                  |	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.Карантин
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.КарантинУУ
	                                  |		КОНЕЦ) КАК Карантин,
	                                  |	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	                                  |	СУММА(ВЫБОР
	                                  |			КОГДА ВтТоварыНаСкладах2.РулонныйМатериал
	                                  |				ТОГДА ВтТоварыНаСкладах2.Блокировка
	                                  |			ИНАЧЕ ВтТоварыНаСкладах2.БлокировкаУУ
	                                  |		КОНЕЦ) КАК Блокировка,
	                                  |	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ,
	                                  |	ВтТоварыНаСкладах2.РулонныйМатериал КАК РулонныйМатериал,
	                                  |	СУММА(ВтТоварыНаСкладах2.УдаленныйСклад) КАК УдаленныйСклад,
	                                  |	СУММА(ВтТоварыНаСкладах2.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	                                  |	ВтТоварыНаСкладах2.К2 КАК К2,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОтветХранение) КАК ОтветХранение,
	                                  |	СУММА(ВтТоварыНаСкладах2.ОтветХранениеУУ) КАК ОтветХранениеУУ
	                                  |ПОМЕСТИТЬ ВтТоварыНаСкладах3
	                                  |ИЗ
	                                  |	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ВтТоварыНаСкладах2.Номенклатура,
	                                  |	ВтТоварыНаСкладах2.Нарезка,
	                                  |	ВтТоварыНаСкладах2.Характеристика,
	                                  |	ВтТоварыНаСкладах2.КатегорияТовара,
	                                  |	ВтТоварыНаСкладах2.ВидНастроечногоМатериала,
	                                  |	ВтТоварыНаСкладах2.РулонныйМатериал,
	                                  |	ВтТоварыНаСкладах2.К2
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	                                  |	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	                                  |	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	                                  |	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	                                  |	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСклад КАК УдаленныйСклад,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСкладУУ КАК УдаленныйСкладУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ) КАК К2,
	                                  |	ВтТоварыНаСкладах3.ОтветХранение КАК ОтветХранение,
	                                  |	ВтТоварыНаСкладах3.ОтветХранениеУУ КАК ОтветХранениеУУ
	                                  |ПОМЕСТИТЬ ВтОстатки
	                                  |ИЗ
	                                  |	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	                                  |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	                                  |				,
									  //|				Организация = &Организация
	                                  |					 ЗаказКлиента.Площадка = &Лико_Площадка
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНарезка
	                                  |							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЦеноваяГруппа
	                                  |							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНоменклатура
	                                  |							ТОГДА Номенклатура = &Номенклатура
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьКод
	                                  |							ТОГДА Номенклатура.Код ПОДОБНО &Код
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНаименование
	                                  |							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьАртикул
	                                  |							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьГруппаМатериалов
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПсевдоним
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЛицевойМатериал
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПокрытие
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПодложка
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьВидКлея
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьТипКлея
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьНаличиеПраймера
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЭтикетка
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПЕФлакон
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьПослеЗаморозки
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьЧестныйЗнак
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ
	                                  |					И ВЫБОР
	                                  |						КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |						ИНАЧЕ ИСТИНА
	                                  |					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	                                  |		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	                                  |			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	                                  |			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	                                  |	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	                                  |	ВтТоварыНаСкладах3.Карантин,
	                                  |	ВтТоварыНаСкладах3.КарантинУУ,
	                                  |	ВтТоварыНаСкладах3.Блокировка,
	                                  |	ВтТоварыНаСкладах3.БлокировкаУУ,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСклад,
	                                  |	ВтТоварыНаСкладах3.УдаленныйСкладУУ,
	                                  |	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ),
	                                  |	ВтТоварыНаСкладах3.ОтветХранение,
	                                  |	ВтТоварыНаСкладах3.ОтветХранениеУУ
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	Номен.Ссылка КАК Номенклатура,
	                                  |	ВтОстатки.Нарезка КАК Нарезка,
	                                  |	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	                                  |	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	                                  |	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	                                  |	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	                                  |	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	                                  |	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	                                  |	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	                                  |	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	                                  |	ВтОстатки.Характеристика КАК Характеристика,
	                                  |	ВтОстатки.Категория КАК Категория,
	                                  |	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	                                  |	СУММА(ВтОстатки.Карантин) КАК Карантин,
	                                  |	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	                                  |	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	                                  |	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ,
	                                  |	&Склад КАК Склад,
	                                  |	&ПомещениеПроизводство КАК ПомещениеПроизводство,
	                                  |	&ПомещениеСИМ КАК ПомещениеСИМ,
	                                  |	Номен.Лико_ПроверенТехнологом КАК ПроверенТехнологом,
	                                  |	МАКСИМУМ(ВтОстатки.УдаленныйСклад) КАК УдаленныйСклад,
	                                  |	МАКСИМУМ(ВтОстатки.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	                                  |	ВтОстатки.К2 КАК К2,
	                                  |	МАКСИМУМ(ВтОстатки.ОтветХранение) КАК ОтветХранение,
	                                  |	МАКСИМУМ(ВтОстатки.ОтветХранениеУУ) КАК ОтветХранениеУУ
	                                  |ИЗ
	                                  |	Справочник.Номенклатура КАК Номен
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	                                  |		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	                                  |			И (ВЫБОР
	                                  |				КОГДА &ЕстьНарезка
	                                  |					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	                                  |				ИНАЧЕ ИСТИНА
	                                  |			КОНЕЦ)
	                                  |ГДЕ
	                                  |	ВЫБОР
	                                  |			КОГДА &ЕстьЦеноваяГруппа
	                                  |				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНоменклатура
	                                  |				ТОГДА Номен.Ссылка = &Номенклатура
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьКод
	                                  |				ТОГДА Номен.Код ПОДОБНО &Код
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНаименование
	                                  |				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьАртикул
	                                  |				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНарезка
	                                  |				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &НаНастройку
	                                  |				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	                                  |						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьГруппаМатериалов
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПсевдоним
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьЛицевойМатериал
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПокрытие
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПодложка
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.Подложка В (&Подложка)
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьВидКлея
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьТипКлея
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьНаличиеПраймера
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьКольеИлиМаленькийРадиус
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьЭтикетка
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.Этикетка = &Этикетка
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПЕФлакон
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьПослеЗаморозки
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьЧестныйЗнак
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |	И ВЫБОР
	                                  |			КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	                                  |				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	                                  |			ИНАЧЕ ИСТИНА
	                                  |		КОНЕЦ
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	Номен.Ссылка,
	                                  |	ВтОстатки.Нарезка,
	                                  |	ВтОстатки.Характеристика,
	                                  |	ВтОстатки.Категория,
	                                  |	ВтОстатки.ВидНастроечногоМатериала,
	                                  |	Номен.Лико_ПроверенТехнологом,
	                                  |	ВтОстатки.К2
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтТоварыНаСкладах2
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтТоварыНаСкладах3
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтРабочиеЦентры
	                                  |;
	                                  |
	                                  |////////////////////////////////////////////////////////////////////////////////
	                                  |УНИЧТОЖИТЬ ВтОстатки"
	
	
КонецПроцедуры


Функция ЭтоРулонныйМатериал(Номенклатура)
	
	Возврат Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал;	
	
КонецФункции

&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	УстановитьПараметрыОстатковКлиент();
КонецПроцедуры


Процедура ПолучитьДопПомещенияСим(СЗ) //+Лико m.shenderov 02.06.2021
	
	Для каждого СтрПомещение Из ПараметрыСеанса.Лико_РабочееМесто.ПомещениеСИМДополнительно Цикл
		
		Если ЗначениеЗаполнено(СтрПомещение.Помещение) Тогда
			СЗ.Добавить(СтрПомещение.Помещение);
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.06.2021


&НаСервере
Процедура ЗаполнитьСотавСмесиСервер(Номенклатура,КоличествоСмеси) //+Лико m.shenderov 11.01.2022
    УстановитьПривилегированныйРежим(Истина);
	ЦГЭтилацетат    = Справочники.ЦеновыеГруппы.Этилацетат;
	КПЭтилацетата= ПолучитьКПЭтилацетата(Объект.Организация,Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ФормулыПантоновСостав.Номенклатура КАК Номенклатура,
	|	Лико_ФормулыПантоновСостав.ПроцентВСмеси КАК ПроцентВСмеси,
	|	ВЫБОР
	|		КОГДА Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа = &ЦГЭтилацетат
	|			ТОГДА Лико_ФормулыПантоновСостав.ПроцентВСмеси / 100 * &КоличествоСмеси * &КПЭтилацетата
	|		ИНАЧЕ Лико_ФормулыПантоновСостав.ПроцентВСмеси / 100 * &КоличествоСмеси
	|	КОНЕЦ КАК Количество,
	|	Лико_ФормулыПантоновСостав.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Справочник.Лико_ФормулыПантонов.Состав КАК Лико_ФормулыПантоновСостав
	|ГДЕ
	|	Лико_ФормулыПантоновСостав.Ссылка.Номенклатура = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Номенклатура КАК Номенклатура,
	|	Вт.ПроцентВСмеси КАК ПроцентВСмеси,
	|	Вт.Количество КАК Количество,
	|	Вт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Вт.Количество КАК КоличествоУпаковок
	|ИЗ
	|	Вт КАК Вт";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("КоличествоСмеси",КоличествоСмеси );
	Запрос.УстановитьПараметр("ЦГЭтилацетат",ЦГЭтилацетат ); 
	Запрос.УстановитьПараметр("КПЭтилацетата",КПЭтилацетата );
	
	
	
	СоставСмесиПлан.Загрузить(Запрос.Выполнить().Выгрузить());
	   НеВыводитьОСтаткиСостава=Истина;
	
	
КонецПроцедуры  //-Лико m.shenderov 11.01.2022

&НаСервереБезКонтекста
Функция ПолучитьКПЭтилацетата(Площадка,Период) //+Лико m.shenderov 11.01.2022
    УстановитьПривилегированныйРежим(Истина);
	Результат=1; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗначенияКоэффициентовПереносаСрезПоследних.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(
	|			&Период,
	|			Площадка = &Площадка
	|				И Коэффициент = &Коэффициент) КАК Лико_ЗначенияКоэффициентовПереносаСрезПоследних";
	Запрос.УстановитьПараметр("Площадка",Площадка );
	Запрос.УстановитьПараметр("Период",Период );
	Запрос.УстановитьПараметр("Коэффициент",Справочники.Лико_КоэффициентыДляРасчетов.КоэффициентПереносаЭтилацетата );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат=Выборка.Значение;
		
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции  //-Лико m.shenderov 11.01.2022

&НаКлиенте
Процедура СоставСмесиПланПриАктивизацииСтроки(Элемент)

	Если НеВыводитьОСтаткиСостава Тогда 
		НеВыводитьОСтаткиСостава=ложь;
		Возврат;	
	КонецЕсли;

	ТД=Элементы.СоставСмесиПлан.ТекущиеДанные; 
	Если ТД<>Неопределено Тогда
		НоменклатураОтбор=ТД.Номенклатура;
		// <-- Начало Лико Яцун С. В. 12.03.2024
		ЗаполнитьСвойстваМатериалаВПоляОтбора();
		// <-- Конец Лико Яцун С. В. 12.03.2024
		ЦеноваяГруппаОтбор=ТД.ЦеноваяГруппа;		
		УстановитьПараметрыОстатковКлиент(); 
	КонецЕсли;
	
	
КонецПроцедуры


Процедура УстановитьЗапросОстатковЛКБезРезерваРегионов () //+Лико m.shenderov 11.06.2021
	
	ОстаткиНоменклатуры.ТекстЗапроса=
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РабочиеЦентры.Ссылка) КАК РабочийЦентр,
	|	&Площадка КАК Площадка,
	|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	|	&ТекущаяДата КАК ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине КАК НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение КАК ПроизводственноеПомещение
	|ПОМЕСТИТЬ ВтРабочиеЦентры
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.ЛикоЯчейка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеЦентры.Ссылка),
	|	&Площадка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	&ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Лико_НаМашине <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_НаМашине
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО (ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|				ИЛИ ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.НаМашине)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия
	|ПОМЕСТИТЬ ВтТоварыК2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	|		ПО ТоварыВЯчейкахОстатки.Серия = Лико_БракСерий.Серия
	|ГДЕ
	|	Лико_БракСерий.Решение = ЗНАЧЕНИЕ(Справочник.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	0 КАК Карантин,
	|	0 КАК КарантинУУ,
	|	0 КАК Блокировка,
	|	0 КАК БлокировкаУУ,
	|	0 КАК УдаленныйСклад,
	|	0 КАК УдаленныйСкладУУ,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК К2,
	|	0 КАК ОстатокТоваровРезерв,
	|	0 КАК ОСтатокНаСкладеУУРезерв,
	|	0 КАК ОстатокНаМашинеРезерв,
	|	0 КАК ОстатокНаМашинеУУРезерв,
	|	0 КАК ОтветХранение,
	|	0 КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			НЕ Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтТоварыНаСкладах2.Карантин) КАК Карантин,
	|	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтТоварыНаСкладах2.Блокировка) КАК Блокировка,
	|	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСклад) КАК УдаленныйСклад,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтТоварыНаСкладах2.К2 КАК К2,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокТоваровРезерв) КАК ОстатокТоваровРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУРезерв) КАК ОСтатокНаСкладеУУРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранение) КАК ОтветХранение,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах3
	|ИЗ
	|	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыНаСкладах2.Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка,
	|	ВтТоварыНаСкладах2.Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах2.К2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад КАК УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ КАК УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ) КАК К2,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0) КАК РезервПодКлиента,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0) КАК РезервПодКлиентаУУ,
	|	ВтТоварыНаСкладах3.ОтветХранение КАК ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	|				,
	|				Организация = &Организация
	|					И ВЫБОР
	|						КОГДА &ЕстьНарезка
	|							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЦеноваяГруппа
	|							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНоменклатура
	|							ТОГДА Номенклатура = &Номенклатура
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКод
	|							ТОГДА Номенклатура.Код ПОДОБНО &Код
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаименование
	|							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьАртикул
	|							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьГруппаМатериалов
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПсевдоним
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЛицевойМатериал
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПокрытие
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПодложка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьВидКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьТипКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаличиеПраймера
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКольеИлиМаленькийРадиус
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЭтикетка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПЕФлакон
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПослеЗаморозки
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЧестныйЗнак
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	|		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	|			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	|			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	|	ВтТоварыНаСкладах3.Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0),
	|	ВтТоварыНаСкладах3.ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номен.Ссылка КАК Номенклатура,
	|	ВтОстатки.Нарезка КАК Нарезка,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	|	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	|	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	|	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	|	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Категория КАК Категория,
	|	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтОстатки.Карантин) КАК Карантин,
	|	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	|	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ,
	|	Номен.Лико_ПроверенТехнологом КАК ПроверенТехнологом,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСклад) КАК УдаленныйСклад,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтОстатки.К2 КАК К2,
	|	ВтОстатки.РезервПодКлиента КАК РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ КАК РезервПодКлиентаУУ,
	|	МАКСИМУМ(ВтОстатки.ОтветХранение) КАК ОтветХранение,
	|	МАКСИМУМ(ВтОстатки.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ИЗ
	|	Справочник.Номенклатура КАК Номен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	|		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	|			И (ВЫБОР
	|				КОГДА &ЕстьНарезка
	|					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьЦеноваяГруппа
	|				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНоменклатура
	|				ТОГДА Номен.Ссылка = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКод
	|				ТОГДА Номен.Код ПОДОБНО &Код
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаименование
	|				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьАртикул
	|				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНарезка
	|				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НаНастройку
	|				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	|						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЭтоОрганизацияЛикофлекс
	|					И НЕ &ЭтоПробник
	|					И Номен.Лико_МатериалВыпущенныйНаРЦ = &РЦЛаминаторИксПак
	|				ТОГДА Номен.Лико_ПроверенТехнологом <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьГруппаМатериалов
	|				ТОГДА Номен.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПсевдоним
	|				ТОГДА Номен.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЛицевойМатериал
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПокрытие
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПодложка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьВидКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьТипКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаличиеПраймера
	|				ТОГДА Номен.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКольеИлиМаленькийРадиус
	|				ТОГДА Номен.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЭтикетка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПЕФлакон
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПослеЗаморозки
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЧестныйЗнак
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Номен.Ссылка,
	|	ВтОстатки.Нарезка,
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.Категория,
	|	ВтОстатки.ВидНастроечногоМатериала,
	|	Номен.Лико_ПроверенТехнологом,
	|	ВтОстатки.К2,
	|	ВтОстатки.РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтРабочиеЦентры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстатки";
	
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	//|	&Площадка КАК Площадка,
	//|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	//|	&ТекущаяДата КАК ТекущаяДата
	//|ПОМЕСТИТЬ ВтРабочиеЦентры
	//|ИЗ
	//|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	//|ГДЕ
	//|	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаСкладе,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашине,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	//|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	//|ПОМЕСТИТЬ ВтТоварыНаСкладах
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И Ячейка.Владелец = &Склад
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаСкладе,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашине,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	//|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	//|	0 КАК Карантин,
	//|	0 КАК КарантинУУ,
	//|	0 КАК Блокировка,
	//|	0 КАК БлокировкаУУ
	//|ПОМЕСТИТЬ ВтТоварыНаСкладах2
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Владелец = &Склад
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &BRC
	//|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	//|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	0,
	//|	0,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ),
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ),
	//|	0,
	//|	0
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Владелец = &Склад
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &BRC
	//|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	//|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	0,
	//|	0,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ),
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	//|	0,
	//|	0,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ)
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Владелец = &Склад
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &BRC
	//|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	//|	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	//|	СУММА(ВтТоварыНаСкладах2.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	//|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	//|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашине) КАК ОстатокНаМашине,
	//|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	//|	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	//|	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	//|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	//|	СУММА(ВтТоварыНаСкладах2.Карантин) КАК Карантин,
	//|	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	//|	СУММА(ВтТоварыНаСкладах2.Блокировка) КАК Блокировка,
	//|	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ
	//|ПОМЕСТИТЬ ВтТоварыНаСкладах3
	//|ИЗ
	//|	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВтТоварыНаСкладах2.Номенклатура,
	//|	ВтТоварыНаСкладах2.Нарезка,
	//|	ВтТоварыНаСкладах2.Характеристика,
	//|	ВтТоварыНаСкладах2.КатегорияТовара,
	//|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	//|	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	//|	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	//|	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	//|	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ
	//|ПОМЕСТИТЬ ВтОстатки
	//|ИЗ
	//|	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	//|				,
	//|				Организация = &Организация
	//|					И ВЫБОР
	//|						КОГДА &ЕстьНарезка
	//|							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьЦеноваяГруппа
	//|							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьНоменклатура
	//|							ТОГДА Номенклатура = &Номенклатура
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьКод
	//|							ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьНаименование
	//|							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьАртикул
	//|							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	//|		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	//|			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	//|			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	//|	ВтТоварыНаСкладах3.Карантин,
	//|	ВтТоварыНаСкладах3.КарантинУУ,
	//|	ВтТоварыНаСкладах3.Блокировка,
	//|	ВтТоварыНаСкладах3.БлокировкаУУ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Номен.Ссылка КАК Номенклатура,
	//|	ВтОстатки.Нарезка КАК Нарезка,
	//|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	//|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	//|	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	//|	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	//|	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	//|	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	//|	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	//|	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	//|	ВтОстатки.Характеристика КАК Характеристика,
	//|	ВтОстатки.Категория КАК Категория,
	//|	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	//|	СУММА(ВтОстатки.Карантин) КАК Карантин,
	//|	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	//|	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	//|	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номен
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	//|		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	//|			И (ВЫБОР
	//|				КОГДА &ЕстьНарезка
	//|					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	//|				ИНАЧЕ ИСТИНА
	//|			КОНЕЦ)
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &ЕстьЦеноваяГруппа
	//|				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьНоменклатура
	//|				ТОГДА Номен.Ссылка = &Номенклатура
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьКод
	//|				ТОГДА Номен.Код ПОДОБНО &Код
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьНаименование
	//|				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьАртикул
	//|				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьНарезка
	//|				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &НаНастройку
	//|				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	//|						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Номен.Ссылка,
	//|	ВтОстатки.Нарезка,
	//|	ВтОстатки.Характеристика,
	//|	ВтОстатки.Категория,
	//|	ВтОстатки.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВтТоварыНаСкладах
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВтРабочиеЦентры
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВтОстатки";
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 11.06.2021



Процедура УстановитьЗапросОстатковЛК () //+Лико m.shenderov 11.06.2021
	
	
		Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		УстановитьЗапросОстатковЛКБезРезерваРегионов();
		
		Возврат;
		
	КонецЕсли;

	
	ОстаткиНоменклатуры.ТекстЗапроса=
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РабочиеЦентры.Ссылка) КАК РабочийЦентр,
	|	&Площадка КАК Площадка,
	|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	|	&ТекущаяДата КАК ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине КАК НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение КАК ПроизводственноеПомещение
	|ПОМЕСТИТЬ ВтРабочиеЦентры
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.ЛикоЯчейка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеЦентры.Ссылка),
	|	&Площадка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	&ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Лико_НаМашине <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_НаМашине
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО (ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|				ИЛИ ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.НаМашине)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия
	|ПОМЕСТИТЬ ВтТоварыК2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	|		ПО ТоварыВЯчейкахОстатки.Серия = Лико_БракСерий.Серия
	|ГДЕ
	|	Лико_БракСерий.Решение = ЗНАЧЕНИЕ(Справочник.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	0 КАК Карантин,
	|	0 КАК КарантинУУ,
	|	0 КАК Блокировка,
	|	0 КАК БлокировкаУУ,
	|	0 КАК УдаленныйСклад,
	|	0 КАК УдаленныйСкладУУ,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК К2,
	|	0 КАК ОстатокТоваровРезерв,
	|	0 КАК ОСтатокНаСкладеУУРезерв,
	|	0 КАК ОстатокНаМашинеРезерв,
	|	0 КАК ОстатокНаМашинеУУРезерв,
	|	0 КАК ОтветХранение,
	|	0 КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			НЕ Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Организация = &Организация
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтТоварыНаСкладах2.Карантин) КАК Карантин,
	|	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтТоварыНаСкладах2.Блокировка) КАК Блокировка,
	|	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСклад) КАК УдаленныйСклад,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтТоварыНаСкладах2.К2 КАК К2,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокТоваровРезерв) КАК ОстатокТоваровРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУРезерв) КАК ОСтатокНаСкладеУУРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранение) КАК ОтветХранение,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах3
	|ИЗ
	|	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыНаСкладах2.Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка,
	|	ВтТоварыНаСкладах2.Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах2.К2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад КАК УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ КАК УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ) КАК К2,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0) КАК РезервПодКлиента,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0) КАК РезервПодКлиентаУУ,
	|	ВтТоварыНаСкладах3.ОтветХранение КАК ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	|				,
	|				Организация = &Организация
	|					И ВЫБОР
	|						КОГДА &ЕстьНарезка
	|							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЦеноваяГруппа
	|							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНоменклатура
	|							ТОГДА Номенклатура = &Номенклатура
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКод
	|							ТОГДА Номенклатура.Код ПОДОБНО &Код
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаименование
	|							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьАртикул
	|							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьГруппаМатериалов
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПсевдоним
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЛицевойМатериал
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПокрытие
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПодложка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьВидКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьТипКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаличиеПраймера
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКольеИлиМаленькийРадиус
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЭтикетка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПЕФлакон
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПослеЗаморозки
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЧестныйЗнак
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	|		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	|			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	|			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	|	ВтТоварыНаСкладах3.Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0),
	|	ВтТоварыНаСкладах3.ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номен.Ссылка КАК Номенклатура,
	|	ВтОстатки.Нарезка КАК Нарезка,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	|	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	|	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	|	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	|	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Категория КАК Категория,
	|	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтОстатки.Карантин) КАК Карантин,
	|	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	|	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ,
	|	Номен.Лико_ПроверенТехнологом КАК ПроверенТехнологом,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСклад) КАК УдаленныйСклад,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтОстатки.К2 КАК К2,
	|	ВтОстатки.РезервПодКлиента КАК РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ КАК РезервПодКлиентаУУ,
	|	МАКСИМУМ(ВтОстатки.ОтветХранение) КАК ОтветХранение,
	|	МАКСИМУМ(ВтОстатки.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ИЗ
	|	Справочник.Номенклатура КАК Номен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	|		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	|			И (ВЫБОР
	|				КОГДА &ЕстьНарезка
	|					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьЦеноваяГруппа
	|				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНоменклатура
	|				ТОГДА Номен.Ссылка = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКод
	|				ТОГДА Номен.Код ПОДОБНО &Код
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаименование
	|				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьАртикул
	|				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНарезка
	|				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НаНастройку
	|				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	|						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЭтоОрганизацияЛикофлекс
	|					И НЕ &ЭтоПробник
	|					И Номен.Лико_МатериалВыпущенныйНаРЦ = &РЦЛаминаторИксПак
	|				ТОГДА Номен.Лико_ПроверенТехнологом <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьГруппаМатериалов
	|				ТОГДА Номен.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПсевдоним
	|				ТОГДА Номен.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЛицевойМатериал
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПокрытие
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПодложка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьВидКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьТипКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаличиеПраймера
	|				ТОГДА Номен.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКольеИлиМаленькийРадиус
	|				ТОГДА Номен.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЭтикетка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПЕФлакон
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПослеЗаморозки
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЧестныйЗнак
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Номен.Ссылка,
	|	ВтОстатки.Нарезка,
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.Категория,
	|	ВтОстатки.ВидНастроечногоМатериала,
	|	Номен.Лико_ПроверенТехнологом,
	|	ВтОстатки.К2,
	|	ВтОстатки.РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтРабочиеЦентры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстатки";
	
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	//|	&Площадка КАК Площадка,
	//|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	//|	&ТекущаяДата КАК ТекущаяДата
	//|ПОМЕСТИТЬ ВтРабочиеЦентры
	//|ИЗ
	//|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	//|ГДЕ
	//|	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаСкладе,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашине,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	//|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	//|ПОМЕСТИТЬ ВтТоварыНаСкладах
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И Ячейка.Владелец = &Склад
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаСкладе,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашине,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	//|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	//|	0 КАК Карантин,
	//|	0 КАК КарантинУУ,
	//|	0 КАК Блокировка,
	//|	0 КАК БлокировкаУУ
	//|ПОМЕСТИТЬ ВтТоварыНаСкладах2
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Владелец = &Склад
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &BRC
	//|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	//|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	0,
	//|	0,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ),
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ),
	//|	0,
	//|	0
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Владелец = &Склад
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &BRC
	//|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	//|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	0,
	//|	0,
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ),
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	//|	0,
	//|	0,
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	//|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	//|		КОНЕЦ)
	//|ИЗ
	//|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	//|			,
	//|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Владелец = &Склад
	//|				И Ячейка.Помещение.Лико_Организация = &Организация
	//|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	//|				И НЕ Ячейка.Помещение.Лико_ОтветственноеХранение
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНарезка
	//|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьЦеноваяГруппа
	//|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНоменклатура
	//|						ТОГДА Номенклатура = &Номенклатура
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьКод
	//|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьНаименование
	//|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//|				И ВЫБОР
	//|					КОГДА &ЕстьАртикул
	//|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	//|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &BRC
	//|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	//|	ТоварыВЯчейкахОстатки.Номенклатура,
	//|	ТоварыВЯчейкахОстатки.Характеристика,
	//|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	//|	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	//|	СУММА(ВтТоварыНаСкладах2.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	//|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	//|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашине) КАК ОстатокНаМашине,
	//|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	//|	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	//|	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	//|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	//|	СУММА(ВтТоварыНаСкладах2.Карантин) КАК Карантин,
	//|	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	//|	СУММА(ВтТоварыНаСкладах2.Блокировка) КАК Блокировка,
	//|	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ
	//|ПОМЕСТИТЬ ВтТоварыНаСкладах3
	//|ИЗ
	//|	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВтТоварыНаСкладах2.Номенклатура,
	//|	ВтТоварыНаСкладах2.Нарезка,
	//|	ВтТоварыНаСкладах2.Характеристика,
	//|	ВтТоварыНаСкладах2.КатегорияТовара,
	//|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	//|	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	//|	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	//|	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	//|	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ
	//|ПОМЕСТИТЬ ВтОстатки
	//|ИЗ
	//|	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	//|				,
	//|				Организация = &Организация
	//|					И ВЫБОР
	//|						КОГДА &ЕстьНарезка
	//|							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьЦеноваяГруппа
	//|							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьНоменклатура
	//|							ТОГДА Номенклатура = &Номенклатура
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьКод
	//|							ТОГДА Номенклатура.Код ПОДОБНО &Код
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьНаименование
	//|							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &ЕстьАртикул
	//|							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	//|		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	//|			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	//|			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	//|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	//|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	//|	ВтТоварыНаСкладах3.Карантин,
	//|	ВтТоварыНаСкладах3.КарантинУУ,
	//|	ВтТоварыНаСкладах3.Блокировка,
	//|	ВтТоварыНаСкладах3.БлокировкаУУ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Номен.Ссылка КАК Номенклатура,
	//|	ВтОстатки.Нарезка КАК Нарезка,
	//|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	//|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	//|	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	//|	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	//|	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	//|	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	//|	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	//|	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	//|	ВтОстатки.Характеристика КАК Характеристика,
	//|	ВтОстатки.Категория КАК Категория,
	//|	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	//|	СУММА(ВтОстатки.Карантин) КАК Карантин,
	//|	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	//|	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	//|	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номен
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	//|		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	//|			И (ВЫБОР
	//|				КОГДА &ЕстьНарезка
	//|					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	//|				ИНАЧЕ ИСТИНА
	//|			КОНЕЦ)
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &ЕстьЦеноваяГруппа
	//|				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьНоменклатура
	//|				ТОГДА Номен.Ссылка = &Номенклатура
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьКод
	//|				ТОГДА Номен.Код ПОДОБНО &Код
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьНаименование
	//|				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьАртикул
	//|				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ЕстьНарезка
	//|				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &НаНастройку
	//|				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	//|						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Номен.Ссылка,
	//|	ВтОстатки.Нарезка,
	//|	ВтОстатки.Характеристика,
	//|	ВтОстатки.Категория,
	//|	ВтОстатки.ВидНастроечногоМатериала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВтТоварыНаСкладах
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВтРабочиеЦентры
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВтОстатки";
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 11.06.2021


Процедура УстановитьЗапросОстатковЛКПоПлощадкеБезРезерваРегионов () //+Лико m.shenderov 11.06.2021
	
	ОстаткиНоменклатуры.ТекстЗапроса=
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РабочиеЦентры.Ссылка) КАК РабочийЦентр,
	|	&Площадка КАК Площадка,
	|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	|	&ТекущаяДата КАК ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине КАК НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение КАК ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка КАК Лико_Площадка
	|ПОМЕСТИТЬ ВтРабочиеЦентры
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.ЛикоЯчейка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеЦентры.Ссылка),
	|	&Площадка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	&ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Лико_НаМашине <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка,
	|	РабочиеЦентры.Лико_НаМашине
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО (ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|				ИЛИ ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.НаМашине)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия
	|ПОМЕСТИТЬ ВтТоварыК2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	|		ПО ТоварыВЯчейкахОстатки.Серия = Лико_БракСерий.Серия
	|ГДЕ
	|	Лико_БракСерий.Решение = ЗНАЧЕНИЕ(Справочник.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	0 КАК Карантин,
	|	0 КАК КарантинУУ,
	|	0 КАК Блокировка,
	|	0 КАК БлокировкаУУ,
	|	0 КАК УдаленныйСклад,
	|	0 КАК УдаленныйСкладУУ,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК К2,
	|	0 КАК ОстатокТоваровРезерв,
	|	0 КАК ОСтатокНаСкладеУУРезерв,
	|	0 КАК ОстатокНаМашинеРезерв,
	|	0 КАК ОстатокНаМашинеУУРезерв,
	|	0 КАК ОтветХранение,
	|	0 КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			НЕ Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Партнер В (&Партнер)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	//|				И Ячейка.Лико_Организация = &Организация
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтТоварыНаСкладах2.Карантин) КАК Карантин,
	|	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтТоварыНаСкладах2.Блокировка) КАК Блокировка,
	|	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСклад) КАК УдаленныйСклад,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтТоварыНаСкладах2.К2 КАК К2,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокТоваровРезерв) КАК ОстатокТоваровРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУРезерв) КАК ОСтатокНаСкладеУУРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранение) КАК ОтветХранение,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах3
	|ИЗ
	|	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыНаСкладах2.Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка,
	|	ВтТоварыНаСкладах2.Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах2.К2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад КАК УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ КАК УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ) КАК К2,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0) КАК РезервПодКлиента,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0) КАК РезервПодКлиентаУУ,
	|	ВтТоварыНаСкладах3.ОтветХранение КАК ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	|				,
	//|				Организация = &Организация
	|					ЗаказКлиента.Площадка = &Лико_Площадка
	|					И ВЫБОР
	|						КОГДА &ЕстьНарезка
	|							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЦеноваяГруппа
	|							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНоменклатура
	|							ТОГДА Номенклатура = &Номенклатура
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКод
	|							ТОГДА Номенклатура.Код ПОДОБНО &Код
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаименование
	|							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьАртикул
	|							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьГруппаМатериалов
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПсевдоним
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЛицевойМатериал
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПокрытие
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПодложка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьВидКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьТипКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаличиеПраймера
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКольеИлиМаленькийРадиус
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЭтикетка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПЕФлакон
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПослеЗаморозки
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЧестныйЗнак
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	|		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	|			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	|			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	|	ВтТоварыНаСкладах3.Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0),
	|	ВтТоварыНаСкладах3.ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номен.Ссылка КАК Номенклатура,
	|	ВтОстатки.Нарезка КАК Нарезка,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	|	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	|	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	|	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	|	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Категория КАК Категория,
	|	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтОстатки.Карантин) КАК Карантин,
	|	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	|	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ,
	|	Номен.Лико_ПроверенТехнологом КАК ПроверенТехнологом,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСклад) КАК УдаленныйСклад,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтОстатки.К2 КАК К2,
	|	ВтОстатки.РезервПодКлиента КАК РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ КАК РезервПодКлиентаУУ,
	|	МАКСИМУМ(ВтОстатки.ОтветХранение) КАК ОтветХранение,
	|	МАКСИМУМ(ВтОстатки.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ИЗ
	|	Справочник.Номенклатура КАК Номен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	|		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	|			И (ВЫБОР
	|				КОГДА &ЕстьНарезка
	|					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьЦеноваяГруппа
	|				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНоменклатура
	|				ТОГДА Номен.Ссылка = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКод
	|				ТОГДА Номен.Код ПОДОБНО &Код
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаименование
	|				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьАртикул
	|				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНарезка
	|				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НаНастройку
	|				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	|						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЭтоОрганизацияЛикофлекс
	|					И НЕ &ЭтоПробник
	|					И Номен.Лико_МатериалВыпущенныйНаРЦ = &РЦЛаминаторИксПак
	|				ТОГДА Номен.Лико_ПроверенТехнологом <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьГруппаМатериалов
	|				ТОГДА Номен.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПсевдоним
	|				ТОГДА Номен.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЛицевойМатериал
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПокрытие
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПодложка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьВидКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьТипКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаличиеПраймера
	|				ТОГДА Номен.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКольеИлиМаленькийРадиус
	|				ТОГДА Номен.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЭтикетка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПЕФлакон
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПослеЗаморозки
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЧестныйЗнак
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Номен.Ссылка,
	|	ВтОстатки.Нарезка,
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.Категория,
	|	ВтОстатки.ВидНастроечногоМатериала,
	|	Номен.Лико_ПроверенТехнологом,
	|	ВтОстатки.К2,
	|	ВтОстатки.РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтРабочиеЦентры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстатки";
	
		
	
	
	
КонецПроцедуры //-Лико m.shenderov 11.06.2021


Процедура УстановитьЗапросОстатковЛКПоПлощадке2 () //+Лико m.shenderov 11.06.2021
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		УстановитьЗапросОстатковЛКПоПлощадкеБезРезерваРегионов();
		
		Возврат;
		
	КонецЕсли;

	
	ОстаткиНоменклатуры.ТекстЗапроса=
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РабочиеЦентры.Ссылка) КАК РабочийЦентр,
	|	&Площадка КАК Площадка,
	|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	|	&ТекущаяДата КАК ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине КАК НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение КАК ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка КАК Лико_Площадка
	|ПОМЕСТИТЬ ВтРабочиеЦентры
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.ЛикоЯчейка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеЦентры.Ссылка),
	|	&Площадка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	&ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Лико_НаМашине <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.Пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка,
	|	РабочиеЦентры.Лико_НаМашине
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО (ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|				ИЛИ ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.НаМашине)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия
	|ПОМЕСТИТЬ ВтТоварыК2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	|		ПО ТоварыВЯчейкахОстатки.Серия = Лико_БракСерий.Серия
	|ГДЕ
	|	Лико_БракСерий.Решение = ЗНАЧЕНИЕ(Справочник.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)) КАК Нарезка,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ) КАК ОстатокНаСкладе,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашине,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара) КАК КатегорияТовара,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	0 КАК Карантин,
	|	0 КАК КарантинУУ,
	|	0 КАК Блокировка,
	|	0 КАК БлокировкаУУ,
	|	0 КАК УдаленныйСклад,
	|	0 КАК УдаленныйСкладУУ,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК К2,
	|	0 КАК ОстатокТоваровРезерв,
	|	0 КАК ОСтатокНаСкладеУУРезерв,
	|	0 КАК ОстатокНаМашинеРезерв,
	|	0 КАК ОстатокНаМашинеУУРезерв,
	|	0 КАК ОтветХранение,
	|	0 КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах2
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования > &BRC_ДатаКАрантина
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЕстьПроизводственноеПомещение
	|								ИЛИ &ЕстьПроизводственноеПомещение
	|									И ВтРабочиеЦентры.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|							ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|					КОНЕЦ
	|		КОНЕЦ),
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|					И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ),
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			НЕ Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И НЕ Ячейка.Лико_ОтветственноеХранение
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара),
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ВтРабочиеЦентры.РабочийЦентр ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) * ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Серия.ЯССМ_ОбъектНоменклатуры.Резерв В (&Резерв)
	|				И Характеристика.ЯССМ_Нарезка.Размер > 0
	|				И Ячейка.Лико_Площадка = &Лико_Площадка
	|				И НЕ Ячейка.Лико_ПомещениеБрака
	|				И Ячейка.Лико_ОтветственноеХранение
	|				И НЕ Ячейка.Лико_УдаленныйСклад
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРабочиеЦентры
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = ВтРабочиеЦентры.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтТоварыК2
	|		ПО ТоварыВЯчейкахОстатки.Серия = ВтТоварыК2.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &BRC
	|				ТОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК = ЛОЖЬ
	|						И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &BRC_ДатаКАрантина
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.Пустаяссылка)),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	ВЫБОР
	|		КОГДА НЕ ВтТоварыК2.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыНаСкладах2.Номенклатура КАК Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка КАК Нарезка,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	ВтТоварыНаСкладах2.Характеристика КАК Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара КАК КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтТоварыНаСкладах2.Карантин) КАК Карантин,
	|	СУММА(ВтТоварыНаСкладах2.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтТоварыНаСкладах2.Блокировка) КАК Блокировка,
	|	СУММА(ВтТоварыНаСкладах2.БлокировкаУУ) КАК БлокировкаУУ,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСклад) КАК УдаленныйСклад,
	|	СУММА(ВтТоварыНаСкладах2.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтТоварыНаСкладах2.К2 КАК К2,
	|	СУММА(ВтТоварыНаСкладах2.ОстатокТоваровРезерв) КАК ОстатокТоваровРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОСтатокНаСкладеУУРезерв) КАК ОСтатокНаСкладеУУРезерв,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранение) КАК ОтветХранение,
	|	СУММА(ВтТоварыНаСкладах2.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтТоварыНаСкладах3
	|ИЗ
	|	ВтТоварыНаСкладах2 КАК ВтТоварыНаСкладах2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыНаСкладах2.Номенклатура,
	|	ВтТоварыНаСкладах2.Нарезка,
	|	ВтТоварыНаСкладах2.Характеристика,
	|	ВтТоварыНаСкладах2.КатегорияТовара,
	|	ВтТоварыНаСкладах2.ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах2.К2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад КАК УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ КАК УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ) КАК К2,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0) КАК РезервПодКлиента,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0) КАК РезервПодКлиентаУУ,
	|	ВтТоварыНаСкладах3.ОтветХранение КАК ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	|				,
	|				ЗаказКлиента.Площадка = &Лико_Площадка
	|					И ВЫБОР
	|						КОГДА &ЕстьНарезка
	|							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЦеноваяГруппа
	|							ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНоменклатура
	|							ТОГДА Номенклатура = &Номенклатура
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКод
	|							ТОГДА Номенклатура.Код ПОДОБНО &Код
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаименование
	|							ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьАртикул
	|							ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьГруппаМатериалов
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПсевдоним
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЛицевойМатериал
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПокрытие
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПодложка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьВидКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьТипКлея
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьНаличиеПраймера
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьКольеИлиМаленькийРадиус
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЭтикетка
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПЕФлакон
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьПослеЗаморозки
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьЧестныйЗнак
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|							ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	|		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	|			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	|			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала),
	|	ВтТоварыНаСкладах3.Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0),
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0),
	|	ВтТоварыНаСкладах3.ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номен.Ссылка КАК Номенклатура,
	|	ВтОстатки.Нарезка КАК Нарезка,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	|	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	|	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	|	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	|	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Категория КАК Категория,
	|	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтОстатки.Карантин) КАК Карантин,
	|	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	|	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ,
	|	Номен.Лико_ПроверенТехнологом КАК ПроверенТехнологом,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСклад) КАК УдаленныйСклад,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтОстатки.К2 КАК К2,
	|	ВтОстатки.РезервПодКлиента КАК РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ КАК РезервПодКлиентаУУ,
	|	МАКСИМУМ(ВтОстатки.ОтветХранение) КАК ОтветХранение,
	|	МАКСИМУМ(ВтОстатки.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ИЗ
	|	Справочник.Номенклатура КАК Номен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	|		ПО (ВтОстатки.Номенклатура = Номен.Ссылка)
	|			И (ВЫБОР
	|				КОГДА &ЕстьНарезка
	|					ТОГДА НЕ Номен.Ссылка ЕСТЬ NULL
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьЦеноваяГруппа
	|				ТОГДА Номен.ЦеноваяГруппа = &ЦеноваяГруппа
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНоменклатура
	|				ТОГДА Номен.Ссылка = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКод
	|				ТОГДА Номен.Код ПОДОБНО &Код
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаименование
	|				ТОГДА Номен.Наименование ПОДОБНО &Наименование
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьАртикул
	|				ТОГДА Номен.Артикул ПОДОБНО &Артикул
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНарезка
	|				ТОГДА ЕСТЬNULL(ВтОстатки.Нарезка.Размер, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НаНастройку
	|				ТОГДА ВтОстатки.Номенклатура.Наименование ПОДОБНО ""%на настр%""
	|						ИЛИ ВтОстатки.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЭтоОрганизацияЛикофлекс
	|					И НЕ &ЭтоПробник
	|					И Номен.Лико_МатериалВыпущенныйНаРЦ = &РЦЛаминаторИксПак
	|				ТОГДА Номен.Лико_ПроверенТехнологом <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьГруппаМатериалов
	|				ТОГДА Номен.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПсевдоним
	|				ТОГДА Номен.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЛицевойМатериал
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПокрытие
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПодложка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьВидКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьТипКлея
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьНаличиеПраймера
	|				ТОГДА Номен.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьКольеИлиМаленькийРадиус
	|				ТОГДА Номен.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЭтикетка
	|				ТОГДА Номен.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПЕФлакон
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьПослеЗаморозки
	|				ТОГДА Номен.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьЧестныйЗнак
	|				ТОГДА Номен.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|				ТОГДА Номен.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Номен.Ссылка,
	|	ВтОстатки.Нарезка,
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.Категория,
	|	ВтОстатки.ВидНастроечногоМатериала,
	|	Номен.Лико_ПроверенТехнологом,
	|	ВтОстатки.К2,
	|	ВтОстатки.РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтРабочиеЦентры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстатки";
	
		
	
	
	
КонецПроцедуры //-Лико m.shenderov 11.06.2021


 Процедура УстановитьЗапросОстатковЛКПоПлощадке () //+Лико m.shenderov 11.06.2021
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		УстановитьЗапросОстатковЛКПоПлощадкеБезРезерваРегионов();
		
		Возврат;
		
	КонецЕсли;

	
	ОстаткиНоменклатуры.ТекстЗапроса=
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.Серия КАК Серия,
	|	Остатки.Ячейка КАК Ячейка,
	|	Остатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	Остатки.Упаковка.Числитель КАК Числитель,
	|	Остатки.Ячейка.Владелец.Лико_Есть_СкладскиеСекции КАК СекционныйСклад,
	|	Остатки.Ячейка.Лико_Организация КАК ЯчейкаОрганизация,
	|	Остатки.Ячейка.Лико_Площадка КАК ЯчейкаПлощадка,
	|	Остатки.Ячейка.Лико_ПомещениеБрака КАК ПомещениеБрака,
	|	Остатки.Ячейка.Лико_ОтветственноеХранение КАК ОтветственноеХранение,
	|	Остатки.Ячейка.Лико_УдаленныйСклад КАК УдаленныйСклад,
	|	Остатки.Ячейка.Лико_ТипСклада КАК ТипСклада,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.Резерв КАК Резерв,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка КАК Нарезка,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара КАК КатегорияТовара,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК КАК BRC_БлокировкаВК,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования КАК ДатаФормирования
	|ПОМЕСТИТЬ ВтСырые
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			ВЫБОР
	|					КОГДА &BRC
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Характеристика.ЯССМ_Нарезка.Размер > 0
	|				КОНЕЦ
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И Номенклатура = &Номенклатура) КАК Остатки
	|ГДЕ
	|	&ЕстьНоменклатура = ИСТИНА
	|	И &ЕстьЦеноваяГруппа = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика,
	|	Остатки.Серия,
	|	Остатки.Ячейка,
	|	Остатки.ВНаличииОстаток,
	|	Остатки.Упаковка.Числитель,
	|	Остатки.Ячейка.Владелец.Лико_Есть_СкладскиеСекции,
	|	Остатки.Ячейка.Лико_Организация,
	|	Остатки.Ячейка.Лико_Площадка,
	|	Остатки.Ячейка.Лико_ПомещениеБрака,
	|	Остатки.Ячейка.Лико_ОтветственноеХранение,
	|	Остатки.Ячейка.Лико_УдаленныйСклад,
	|	Остатки.Ячейка.Лико_ТипСклада,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.Резерв,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			ВЫБОР
	|					КОГДА &BRC
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Характеристика.ЯССМ_Нарезка.Размер > 0
	|				КОНЕЦ
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа) КАК Остатки
	|ГДЕ
	|	&ЕстьНоменклатура = ЛОЖЬ
	|	И &ЕстьЦеноваяГруппа = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика,
	|	Остатки.Серия,
	|	Остатки.Ячейка,
	|	Остатки.ВНаличииОстаток,
	|	Остатки.Упаковка.Числитель,
	|	Остатки.Ячейка.Владелец.Лико_Есть_СкладскиеСекции,
	|	Остатки.Ячейка.Лико_Организация,
	|	Остатки.Ячейка.Лико_Площадка,
	|	Остатки.Ячейка.Лико_ПомещениеБрака,
	|	Остатки.Ячейка.Лико_ОтветственноеХранение,
	|	Остатки.Ячейка.Лико_УдаленныйСклад,
	|	Остатки.Ячейка.Лико_ТипСклада,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.Резерв,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.КатегорияТовара,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.BRC_БлокировкаВК,
	|	Остатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			ВЫБОР
	|					КОГДА &BRC
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Характеристика.ЯССМ_Нарезка.Размер > 0
	|				КОНЕЦ
	|				И Ячейка.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Переработка)
	|				И ВЫБОР
	|					КОГДА &ЕстьНарезка
	|						ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЦеноваяГруппа
	|						ТОГДА Номенклатура.ЦеноваяГруппа = &ЦеноваяГруппа
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНоменклатура
	|						ТОГДА Номенклатура = &Номенклатура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКод
	|						ТОГДА Номенклатура.Код ПОДОБНО &Код
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаименование
	|						ТОГДА Номенклатура.Наименование ПОДОБНО &Наименование
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьАртикул
	|						ТОГДА Номенклатура.Артикул ПОДОБНО &Артикул
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &НаНастройку
	|						ТОГДА Номенклатура.Наименование ПОДОБНО ""%на настр%""
	|								ИЛИ Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЭтоОрганизацияЛикофлекс
	|							И НЕ &ЭтоПробник
	|							И Номенклатура.Лико_МатериалВыпущенныйНаРЦ = &РЦЛаминаторИксПак
	|						ТОГДА Номенклатура.Лико_ПроверенТехнологом <> ДАТАВРЕМЯ(1, 1, 1)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьГруппаМатериалов
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ГруппаМатериалов = &ГруппаМатериалов
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПсевдоним
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Псевдоним = &Псевдоним
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЛицевойМатериал
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЛицевойМатериал В (&ЛицевойМатериал)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПокрытие
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала В (&Покрытие)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПодложка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Подложка В (&Подложка)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьВидКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ВидКлея = &ВидКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьТипКлея
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.ТипКлея = &ТипКлея
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьНаличиеПраймера
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.НаличиеПраймера = &НаличиеПраймера
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКольеИлиМаленькийРадиус
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КольеИлиМаленькийРадиус = &КольеИлиМаленькийРадиус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЭтикетка
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.Этикетка = &Этикетка
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПЕФлакон
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПЕФлакон = &ПЕФлакон
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьПослеЗаморозки
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ПослеЗаморозки = &ПослеЗаморозки
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьЧестныйЗнак
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.ЧестныйЗнак = &ЧестныйЗнак
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭтикерования
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭтикерования <= &МинимальнаяТемператураЭтикерования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМинимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МинимальнаяТемператураЭксплуатации <= &МинимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьМаксимальнаяТемператураЭксплуатации
	|						ТОГДА Номенклатура.Лико_СвойстваМатериала.КодКлея.МаксимальнаяТемператураЭксплуатации >= &МаксимальнаяТемператураЭксплуатации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК Остатки
	|ГДЕ
	|	(&ЕстьНоменклатура = ЛОЖЬ
	|				И &ЕстьЦеноваяГруппа = ЛОЖЬ
	|			ИЛИ &ЕстьНоменклатура = ИСТИНА
	|				И &ЕстьЦеноваяГруппа = ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	С.Серия КАК Серия,
	|	С.Организация КАК Организация,
	|	МИНИМУМ(Пл.Ссылка) КАК ПлощадкаПоОрг
	|ПОМЕСТИТЬ ВтОргСерии
	|ИЗ
	|	РегистрСведений.Лико_СерииНоменклатурыДоп.СрезПоследних(
	|			,
	|			Серия В
	|				(ВЫБРАТЬ
	|					ВтСырые.Серия
	|				ИЗ
	|					ВтСырые КАК ВтСырые)) КАК С
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Площадки КАК Пл
	|		ПО (Пл.Организация = С.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	С.Серия,
	|	С.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Серия КАК Серия,
	|	Т.Ячейка КАК Ячейка,
	|	Т.ВНаличииОстаток КАК ВНаличииОстаток,
	|	Т.Числитель КАК Числитель,
	|	Т.ОтветственноеХранение КАК ОтветственноеХранение,
	|	Т.УдаленныйСклад КАК УдаленныйСклад,
	|	Т.ТипСклада КАК ТипСклада,
	|	Т.Резерв КАК Резерв,
	|	Т.Нарезка КАК Нарезка,
	|	Т.КатегорияТовара КАК КатегорияТовара,
	|	Т.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	Т.BRC_БлокировкаВК КАК BRC_БлокировкаВК,
	|	Т.ДатаФормирования КАК ДатаФормирования
	|ПОМЕСТИТЬ ВтОстаткиРегистра
	|ИЗ
	|	ВтСырые КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОргСерии КАК ОргСерии
	|		ПО Т.Серия = ОргСерии.Серия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Т.СекционныйСклад
	|				ТОГДА Т.ВидНастроечногоМатериала <> ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.Брак)
	|			ИНАЧЕ НЕ Т.ПомещениеБрака
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Т.СекционныйСклад
	|				ТОГДА ВЫБОР
	|						КОГДА ОргСерии.ПлощадкаПоОрг ЕСТЬ NULL
	|								ИЛИ Т.ЯчейкаОрганизация = ОргСерии.Организация
	|							ТОГДА Т.ЯчейкаПлощадка = &Лико_Площадка
	|						ИНАЧЕ ОргСерии.ПлощадкаПоОрг = &Лико_Площадка
	|					КОНЕЦ
	|			ИНАЧЕ Т.ЯчейкаПлощадка = &Лико_Площадка
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия,
	|	Ячейка,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РабочиеЦентры.Ссылка) КАК РабочийЦентр,
	|	&Площадка КАК Площадка,
	|	РабочиеЦентры.ЛикоЯчейка КАК Ячейка,
	|	&ТекущаяДата КАК ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине КАК НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение КАК ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка КАК Лико_Площадка
	|ПОМЕСТИТЬ ВтРабочиеЦентры
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ЛикоЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.ЛикоЯчейка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(РабочиеЦентры.Ссылка),
	|	&Площадка,
	|	РабочиеЦентры.Лико_НаМашине,
	|	&ТекущаяДата,
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Лико_НаМашине <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеЦентры.Лико_НаМашине,
	|	РабочиеЦентры.Лико_ПроизводственноеПомещение,
	|	РабочиеЦентры.Лико_Площадка,
	|	РабочиеЦентры.Лико_НаМашине
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ячейка,
	|	НаМашине
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	О.Серия КАК Серия
	|ПОМЕСТИТЬ ВтТоварыК2
	|ИЗ
	|	ВтОстаткиРегистра КАК О
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	|		ПО О.Серия = Лико_БракСерий.Серия
	|ГДЕ
	|	Лико_БракСерий.Решение = ЗНАЧЕНИЕ(Справочник.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2)
	|	И НЕ О.ОтветственноеХранение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Нарезка КАК Нарезка,
	|	СУММА(Данные.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	СУММА(Данные.ОСтатокНаСкладеУУ) КАК ОСтатокНаСкладеУУ,
	|	СУММА(Данные.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(Данные.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	Данные.Характеристика КАК Характеристика,
	|	МАКСИМУМ(Данные.КатегорияТовара) КАК КатегорияТовара,
	|	Данные.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(Данные.Карантин) КАК Карантин,
	|	СУММА(Данные.КарантинУУ) КАК КарантинУУ,
	|	СУММА(Данные.Блокировка) КАК Блокировка,
	|	СУММА(Данные.БлокировкаУУ) КАК БлокировкаУУ,
	|	СУММА(Данные.УдаленныйСклад) КАК УдаленныйСклад,
	|	СУММА(Данные.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	Данные.К2 КАК К2,
	|	СУММА(Данные.ОстатокТоваровРезерв) КАК ОстатокТоваровРезерв,
	|	СУММА(Данные.ОСтатокНаСкладеУУРезерв) КАК ОСтатокНаСкладеУУРезерв,
	|	СУММА(Данные.ОтветХранение) КАК ОтветХранение,
	|	СУММА(Данные.ОтветХранениеУУ) КАК ОтветХранениеУУ,
	|	Данные.РулонныйМатериал КАК РулонныйМатериал
	|ПОМЕСТИТЬ ВтТоварыНаСкладах3
	|ИЗ
	|	(ВЫБРАТЬ
	|		О.Номенклатура КАК Номенклатура,
	|		ЕСТЬNULL(О.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)) КАК Нарезка,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0)
	|			КОНЕЦ) КАК ОстатокНаСкладе,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0) * ЕСТЬNULL(О.Числитель, 0)
	|			КОНЕЦ) КАК ОСтатокНаСкладеУУ,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И НЕ ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И О.ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|					ТОГДА ВЫБОР
	|							КОГДА НЕ &ЕстьПроизводственноеПомещение
	|									ИЛИ &ЕстьПроизводственноеПомещение
	|										И ВтРЦ.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|								ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0)
	|						КОНЕЦ
	|			КОНЕЦ) КАК ОстатокНаМашине,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И НЕ ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И О.ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)
	|					ТОГДА ВЫБОР
	|							КОГДА НЕ &ЕстьПроизводственноеПомещение
	|									ИЛИ &ЕстьПроизводственноеПомещение
	|										И ВтРЦ.ПроизводственноеПомещение = &ПроизводственноеПомещение
	|								ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0) * ЕСТЬNULL(О.Числитель, 0)
	|						КОНЕЦ
	|			КОНЕЦ) КАК ОстатокНаМашинеУУ,
	|		О.Характеристика КАК Характеристика,
	|		МАКСИМУМ(О.КатегорияТовара) КАК КатегорияТовара,
	|		О.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования > &BRC_ДатаКАрантина
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0)
	|			КОНЕЦ) КАК Карантин,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования > &BRC_ДатаКАрантина
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0) * ЕСТЬNULL(О.Числитель, 0)
	|			КОНЕЦ) КАК КарантинУУ,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0)
	|			КОНЕЦ) КАК Блокировка,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0) * ЕСТЬNULL(О.Числитель, 0)
	|			КОНЕЦ) КАК БлокировкаУУ,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0)
	|			КОНЕЦ) КАК УдаленныйСклад,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0) * ЕСТЬNULL(О.Числитель, 0)
	|			КОНЕЦ) КАК УдаленныйСкладУУ,
	|		ВЫБОР
	|			КОГДА НЕ ВтК2.Серия ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК К2,
	|		СУММА(ВЫБОР
	|				КОГДА НЕ О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0)
	|			КОНЕЦ) КАК ОстатокТоваровРезерв,
	|		СУММА(ВЫБОР
	|				КОГДА НЕ О.Резерв В (&Резерв)
	|						И НЕ О.ОтветственноеХранение
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0) * ЕСТЬNULL(О.Числитель, 0)
	|			КОНЕЦ) КАК ОСтатокНаСкладеУУРезерв,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0)
	|			КОНЕЦ) КАК ОтветХранение,
	|		СУММА(ВЫБОР
	|				КОГДА О.Резерв В (&Резерв)
	|						И О.ОтветственноеХранение
	|						И НЕ О.УдаленныйСклад
	|						И ВтРЦ.РабочийЦентр ЕСТЬ NULL
	|						И ВЫБОР
	|							КОГДА &BRC
	|								ТОГДА О.BRC_БлокировкаВК = ЛОЖЬ
	|										И О.ДатаФормирования <= &BRC_ДатаКАрантина
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|					ТОГДА ЕСТЬNULL(О.ВНаличииОстаток, 0) * ЕСТЬNULL(О.Числитель, 0)
	|			КОНЕЦ) КАК ОтветХранениеУУ,
	|		О.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал КАК РулонныйМатериал
	|	ИЗ
	|		ВтОстаткиРегистра КАК О
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтРабочиеЦентры КАК ВтРЦ
	|			ПО О.Ячейка = ВтРЦ.Ячейка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыК2 КАК ВтК2
	|			ПО О.Серия = ВтК2.Серия
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСТЬNULL(О.Нарезка, ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)),
	|		О.Номенклатура,
	|		О.Характеристика,
	|		О.ВидНастроечногоМатериала,
	|		ВЫБОР
	|			КОГДА НЕ ВтК2.Серия ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Номенклатура,
	|	Данные.Нарезка,
	|	Данные.Характеристика,
	|	Данные.ВидНастроечногоМатериала,
	|	Данные.К2,
	|	Данные.РулонныйМатериал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ВидНастроечногоМатериала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Номенклатура, Лико_МатериалыВРезервеОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Нарезка, Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка) КАК Нарезка,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) КАК ОстатокНаСкладеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашине, 0) КАК ОстатокНаМашине,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаМашинеУУ, 0) КАК ОстатокНаМашинеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокНаСкладе, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУ, 0) - ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ОстатокУУ,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) КАК ВРезерве,
	|	ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.КоличествоОстаток, 0) * (ЕСТЬNULL(Лико_МатериалыВРезервеОстатки.Характеристика.ЯССМ_Нарезка.Размер, 0) / 1000) КАК ВРезервеУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.Характеристика, Лико_МатериалыВРезервеОстатки.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.КатегорияТовара, 0) КАК Категория,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ВидНастроечногоМатериала, Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала) КАК ВидНастроечногоМатериала,
	|	ВтТоварыНаСкладах3.Карантин КАК Карантин,
	|	ВтТоварыНаСкладах3.КарантинУУ КАК КарантинУУ,
	|	ВтТоварыНаСкладах3.Блокировка КАК Блокировка,
	|	ВтТоварыНаСкладах3.БлокировкаУУ КАК БлокировкаУУ,
	|	ВтТоварыНаСкладах3.УдаленныйСклад КАК УдаленныйСклад,
	|	ВтТоварыНаСкладах3.УдаленныйСкладУУ КАК УдаленныйСкладУУ,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.К2, ЛОЖЬ) КАК К2,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОстатокТоваровРезерв, 0) КАК РезервПодКлиента,
	|	ЕСТЬNULL(ВтТоварыНаСкладах3.ОСтатокНаСкладеУУРезерв, 0) КАК РезервПодКлиентаУУ,
	|	ВтТоварыНаСкладах3.ОтветХранение КАК ОтветХранение,
	|	ВтТоварыНаСкладах3.ОтветХранениеУУ КАК ОтветХранениеУУ
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	ВтТоварыНаСкладах3 КАК ВтТоварыНаСкладах3
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_МатериалыВРезерве.Остатки(
	|				,
	|				ЗаказКлиента.Площадка = &Лико_Площадка
	|					И ВЫБОР
	|						КОГДА &ЕстьНарезка
	|							ТОГДА Характеристика.ЯССМ_Нарезка = &Нарезка
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК Лико_МатериалыВРезервеОстатки
	|		ПО ВтТоварыНаСкладах3.Номенклатура = Лико_МатериалыВРезервеОстатки.Номенклатура
	|			И ВтТоварыНаСкладах3.Характеристика = Лико_МатериалыВРезервеОстатки.Характеристика
	|			И ВтТоварыНаСкладах3.ВидНастроечногоМатериала = Лико_МатериалыВРезервеОстатки.ВидНастроечногоМатериала
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ВидНастроечногоМатериала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтОстатки.Номенклатура КАК Номенклатура,
	|	ВтОстатки.Нарезка КАК Нарезка,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	МАКСИМУМ(ВтОстатки.ОстатокНаСкладеУУ) КАК ОстатокНаСкладеУУ,
	|	СУММА(ВтОстатки.ОстатокНаМашине) КАК ОстатокНаМашине,
	|	СУММА(ВтОстатки.ОстатокНаМашинеУУ) КАК ОстатокНаМашинеУУ,
	|	МАКСИМУМ(ВтОстатки.Остаток) КАК Остаток,
	|	МАКСИМУМ(ВтОстатки.ОстатокУУ) КАК ОстатокУУ,
	|	МАКСИМУМ(ВтОстатки.ВРезерве) КАК ВРезерве,
	|	МАКСИМУМ(ВтОстатки.ВРезервеУУ) КАК ВРезервеУУ,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Категория КАК Категория,
	|	ВтОстатки.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
	|	СУММА(ВтОстатки.Карантин) КАК Карантин,
	|	СУММА(ВтОстатки.КарантинУУ) КАК КарантинУУ,
	|	СУММА(ВтОстатки.Блокировка) КАК Блокировка,
	|	СУММА(ВтОстатки.БлокировкаУУ) КАК БлокировкаУУ,
	|	ВтОстатки.Номенклатура.Лико_ПроверенТехнологом КАК ПроверенТехнологом,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСклад) КАК УдаленныйСклад,
	|	МАКСИМУМ(ВтОстатки.УдаленныйСкладУУ) КАК УдаленныйСкладУУ,
	|	ВтОстатки.К2 КАК К2,
	|	ВтОстатки.РезервПодКлиента КАК РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ КАК РезервПодКлиентаУУ,
	|	МАКСИМУМ(ВтОстатки.ОтветХранение) КАК ОтветХранение,
	|	МАКСИМУМ(ВтОстатки.ОтветХранениеУУ) КАК ОтветХранениеУУ
	|ИЗ
	|	ВтОстатки КАК ВтОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОстатки.Нарезка,
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.Категория,
	|	ВтОстатки.ВидНастроечногоМатериала,
	|	ВтОстатки.К2,
	|	ВтОстатки.РезервПодКлиента,
	|	ВтОстатки.РезервПодКлиентаУУ,
	|	ВтОстатки.Номенклатура,
	|	ВтОстатки.Номенклатура.Лико_ПроверенТехнологом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтСырые
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОргСерии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстаткиРегистра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтРабочиеЦентры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТоварыК2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтТоварыНаСкладах3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстатки";
	
	
		
	
	
	
КонецПроцедуры //-Лико m.shenderov 11.06.2021


&НаКлиенте
Процедура РезервироватьСоставСмеси(Команда)
	РезервироватьСоставСмесиКлиент();
КонецПроцедуры


Функция МассивУдаленныхПомещенийСервер() //+Лико m.shenderov 28.09.2022
	  
	  Запрос = Новый Запрос;
	  Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	СкладскиеПомещения.Ссылка КАК Ссылка
	  |ИЗ
	  |	Справочник.СкладскиеПомещения КАК СкладскиеПомещения
	  |ГДЕ
	  |	СкладскиеПомещения.Лико_УдаленныйСклад
	  |	И СкладскиеПомещения.Лико_Организация = &Площадка";
	  Запрос.УстановитьПараметр("Площадка",Объект.Организация );
	  Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	  
	  
	  
  КонецФункции //-Лико m.shenderov 28.09.2022 


&НаСервере
Процедура УстановитьВидимостьПоказатьОстаткиСервер() //+Лико m.shenderov 15.06.2023
	Если ПоказатьОстатки=Истина  Тогда
		Элементы.ГруппаОтбораПоПолям.Видимость=Истина;
		Элементы.ОстаткиНоменклатуры.Видимость=Истина; 
	Иначе
		Элементы.ГруппаОтбораПоПолям.Видимость=Ложь;
		Элементы.ОстаткиНоменклатуры.Видимость=Ложь;
	КонецЕсли;
	
	Если ПоказатьСвойстваМатериала Тогда
		Элементы.ГруппаОтбораПоСвойствамМатериала.Видимость=Истина;
	Иначе
		Элементы.ГруппаОтбораПоСвойствамМатериала.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 15.06.2023

   
   &НаКлиенте
  Процедура УстановитьВидимостьУчетПоСекции() //+Лико m.shenderov 12.10.2023
	   
	   Если УчетПоВидуСекций Тогда 
		   
		   Элементы.МатериалыВидСекции.Видимость	=	Истина;
		   Элементы.МатериалыВидСекции.Заголовок	=	"Вид работы";
		   Элементы.МатериалыВидРабот.Видимость		=	Ложь;
		   
		   Элементы.РезервированиеВидСекции.Видимость	=	Истина;
		   Элементы.РезервированиеВидСекции.Заголовок	=	"Вид работы";
		   Элементы.РезервированиеВидРабот.Видимость		=	Ложь;

		   
	   Иначе
		   
		   Элементы.МатериалыВидСекции.Видимость	=Ложь;
		   Элементы.МатериалыВидРабот.Видимость	=Истина;
		   
		    Элементы.РезервированиеВидСекции.Видимость	=Ложь;
		   Элементы.РезервированиеВидРабот.Видимость	=Истина; 

		   
	   КонецЕсли;
	   
	   Если РольДоступнаСервер("ПолныеПрава") Тогда
		   
		   Элементы.МатериалыВидСекции.Видимость	=Истина;
		   Элементы.МатериалыВидРабот.Заголовок	="Вид работы(старый)";
		   Элементы.МатериалыВидРабот.Видимость	=Истина; 
		   
		    Элементы.РезервированиеВидСекции.Видимость	=Истина;
		   Элементы.РезервированиеВидРабот.Заголовок	="Вид работы(старый)";
		   Элементы.РезервированиеВидРабот.Видимость	=Истина;

		   
	   КонецЕсли;
	   
	   
	   
   КонецПроцедуры //-Лико m.shenderov 12.10.2023
   
     &НаСервереБезКонтекста
 Функция РольДоступнаСервер (Роль) //+Лико m.shenderov 12.10.2023
	 
	 Возврат РольДоступна(Роль); 
	 
 КонецФункции  //-Лико m.shenderov 12.10.2023
 


&НаКлиенте
Процедура УстановитьВидимостьПоказатьОстаткиКлиент() //+Лико m.shenderov 15.06.2023
	УстановитьВидимостьПоказатьОстаткиСервер();    	  
	
КонецПроцедуры //-Лико m.shenderov 15.06.2023


&НаКлиенте
Процедура ПоказатьОстаткиПриИзменении(Элемент)
	УстановитьВидимостьПоказатьОстаткиСервер();
КонецПроцедуры

  
 &НаСервереБезКонтекста
Функция УстановитьВидУчетаПоСекцииСервер(Дата) //+Лико m.shenderov 11.10.2023
	
	     Возврат Документы.Лико_БланкЭтапа.УчетПоВидуСекцииУстановлен(Дата);
	
КонецФункции  //-Лико m.shenderov 11.10.2023

&НаКлиенте
Процедура СвойстваМатериалаОтборПриИзменении(Элемент) // <-- Начало Лико Яцун С. В. 27.02.2024
	//УстановитьПараметрыОстатковКлиент();
КонецПроцедуры // <-- Конец Лико Яцун С. В. 27.02.2024

&НаКлиенте
Процедура СвойстваМатериалаОтборОчистка(Элемент, СтандартнаяОбработка) // <-- Начало Лико Яцун С. В. 12.03.2024
	ЭтаФорма[Элемент.Имя + "Использовать"] = Ложь;
	УстановитьПараметрыОстатковКлиент();
КонецПроцедуры // <-- Конец Лико Яцун С. В. 12.03.2024

&НаКлиенте
Процедура ПодобратьАналоги(Команда) // <-- Начало Лико Яцун С. В. 18.03.2024
	//УстановитьПараметрыОстатковКлиент();
	
	Обработка = НайтиДО("лк Список рулонных материалов");
	Если Обработка <> Неопределено Тогда
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка")); 
		СписокЗначений.Добавить(Партнер);
		СписокЗначений.Добавить(Регион);
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Дата", Объект.Дата);
		ПараметрыОткрытия.Вставить("ПартнерОтбор", СписокЗначений);
		ПараметрыОткрытия.Вставить("Партнер", Партнер);  
		ПараметрыОткрытия.Вставить("Заказ", Объект.ЗаказКлиента);  
		ПараметрыОткрытия.Вставить("BRC", BRC);
		ПараметрыОткрытия.Вставить("BRC_ДатаКарантина",BRC_ДатаКарантина);
		ПараметрыОткрытия.Вставить("АртикулОтбор", Неопределено);
		ПараметрыОткрытия.Вставить("КодНоменклатурыОтбор",Неопределено);
		ПараметрыОткрытия.Вставить("НарезкаОтбор", Неопределено);
		ПараметрыОткрытия.Вставить("НаименованиеОтбор", Неопределено);
		ПараметрыОткрытия.Вставить("ГруппаМатериаловОтбор", ГруппаМатериаловОтбор);
		ПараметрыОткрытия.Вставить("ГруппаМатериаловОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПсевдонимОтбор", ПсевдонимОтбор);
		ПараметрыОткрытия.Вставить("ПсевдонимОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ЛицевойМатериалОтбор", ЛицевойМатериалОтбор);
		ПараметрыОткрытия.Вставить("ЛицевойМатериалОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПокрытиеОтбор", ПокрытиеОтбор);
		ПараметрыОткрытия.Вставить("ПокрытиеОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПодложкаОтбор", ПодложкаОтбор);
		ПараметрыОткрытия.Вставить("ПодложкаОтборИспользовать", Ложь);
		//ПараметрыОткрытия.Вставить("КодКлеяОтбор", КодКлеяОтбор);
		//ПараметрыОткрытия.Вставить("КодКлеяОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ВидКлеяОтбор", ВидКлеяОтбор);
		ПараметрыОткрытия.Вставить("ВидКлеяОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ТипКлеяОтбор", ТипКлеяОтбор);
		ПараметрыОткрытия.Вставить("ТипКлеяОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭтикерованияОтбор", МинимальнаяТемператураЭтикерованияОтбор);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭтикерованияОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭксплуатацииОтбор", МинимальнаяТемператураЭксплуатацииОтбор);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭксплуатацииОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("МаксимальнаяТемператураЭксплуатацииОтбор", МаксимальнаяТемператураЭксплуатацииОтбор); 
		ПараметрыОткрытия.Вставить("МаксимальнаяТемператураЭксплуатацииОтборИспользовать", Ложь);
		//ПараметрыОткрытия.Вставить("КлейДляЛаминацииОтбор", КлейДляЛаминацииОтбор);
		//ПараметрыОткрытия.Вставить("КлейДляЛаминацииОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("НаличиеПраймераОтбор", НаличиеПраймераОтбор);
		ПараметрыОткрытия.Вставить("НаличиеПраймераОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("КольеИлиМаленькийРадиусОтбор", КольеИлиМаленькийРадиусОтбор);
		ПараметрыОткрытия.Вставить("КольеИлиМаленькийРадиусОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ЭтикеткаОтбор", ЭтикеткаОтбор);
		ПараметрыОткрытия.Вставить("ЭтикеткаОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПЕФлаконОтбор", ПЕФлаконОтбор);
		ПараметрыОткрытия.Вставить("ПЕФлаконОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПослеЗаморозкиОтбор", ПослеЗаморозкиОтбор);
		ПараметрыОткрытия.Вставить("ПослеЗаморозкиОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ЧестныйЗнакОтбор", ЧестныйЗнакОтбор);
		ПараметрыОткрытия.Вставить("ЧестныйЗнакОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ЦеноваяГруппаОтбор", ЦеноваяГруппаОтбор);
		ПараметрыОткрытия.Вставить("ПоЦенновойГруппеОтбор", Ложь);
		ПараметрыОткрытия.Вставить("НоменклатураОтбор", НоменклатураОтбор);
		ПараметрыОткрытия.Вставить("ПоНоменклатуреОтбор", Ложь);
		ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
		ПараметрыОткрытия.Вставить("Организация", Объект.Организация);
		ПараметрыОткрытия.Вставить("Площадка", Площадка);
		ПараметрыОткрытия.Вставить("НаНастройку", НаНастройку);  
		ПараметрыОткрытия.Вставить("ПроизводственноеПомещениеОтбор", ПроизводственноеПомещениеОтбор); 
		Если ПодготовкаПоПлощадке Тогда
			ПараметрыОткрытия.Вставить("Лико_Площадка", Лико_Площадка);	
		КонецЕсли;
		
		


		
		
		ПараметрыОткрытия.Вставить("ТекстЗапросаОстаткиНоменклатуры", ПолучитьТекстЗапросаОстаткиНоменклатуры());
		ПараметрыДляОткрытия = Новый Структура("ДанныеЗаполненияОтборов",ПараметрыОткрытия);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораАналогаМатериала", ЭтаФорма);
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаПодбораАналогаМатериала",ПараметрыДляОткрытия,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//ОткрытьФорму("Обработка.Лико_СписокРулонныхМатериалов.Форма.ФормаПодбораАналогаМатериала",ПараметрыДляОткрытия,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 18.03.2024

&НаСервере
Функция НайтиДО(Наименование) // <-- Начало Лико Яцун С. В. 25.04.2024
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование);
	Возврат ВПФ;
КонецФункции // <-- Конец Лико Яцун С. В. 25.04.2024

&НаСервере
Функция ПолучитьТекстЗапросаОстаткиНоменклатуры() // <-- Начало Лико Яцун С. В. 25.04.2024
	ТекстЗапросаОстаткиНоменклатуры = ОстаткиНоменклатуры.ТекстЗапроса;
	Возврат ТекстЗапросаОстаткиНоменклатуры;
КонецФункции // <-- Конец Лико Яцун С. В. 25.04.2024

&НаКлиенте
Процедура ПослеВыбораАналогаМатериала(Результат, Параметры) Экспорт // <-- Начало Лико Яцун С. В. 25.04.2024    
	
	Если Результат <> Неопределено Тогда
		Резервировать(Результат);
	КонецЕсли;

КонецПроцедуры // <-- Конец Лико Яцун С. В. 25.04.2024 

&НаКлиенте
Процедура СнятьФлажкиОтборов(Команда) // <-- Начало Лико Яцун С. В. 18.03.2024
	
	ЗаполнитьСвойстваМатериалаВПоляОтбора();
    УстановитьПараметрыОстатковКлиент();
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 18.03.2024

&НаКлиенте
Процедура ПоказатьСвойстваМатериалаПриИзменении(Элемент)
	
	УстановитьВидимостьПоказатьОстаткиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвойства(Команда)

	СсылкаНаЭлементСправочника = Элементы.ОстаткиНоменклатуры.ТекущиеДанные;
	СвойстваМатериалаСсылка = ПолучитьСвойстваМатериала(СсылкаНаЭлементСправочника.Номенклатура);
	Если ЗначениеЗаполнено(СвойстваМатериалаСсылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ,ТолькоПросмотр", СвойстваМатериалаСсылка,Истина);
		ОткрытьФорму("Справочник.Лико_СвойстваМатериала.Форма.ФормаЭлемента", ПараметрыФормы);
	Иначе
		Сообщить("По материалу " + СсылкаНаЭлементСправочника.Номенклатура + " свойства не заполнены");
	КонецЕсли;
        
КонецПроцедуры

&НаСервере
Функция ПолучитьСвойстваМатериала(Номенклатура)
	Возврат Номенклатура.Лико_СвойстваМатериала;
КонецФункции

&НаКлиенте
Процедура ПроизводственноеПомещениеОтборПриИзменении(Элемент)
	
	УстановитьПараметрыОстатковКлиент();

КонецПроцедуры


Процедура  ЗаписатьРеквизит(Рек, Значение)
	
		
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект(); 
	
	ДокОбъект[Рек] = Значение; 
	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись,);
	
КонецПроцедуры


Процедура ПодготовкаПоПлощадке() //+--->Лико m.shenderov 30.12.2024
	
	ДатаНачалаПодготовкиМатериаловПоПлощадке = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПодготовкиМатериаловПоПлощадке.ЗначениеПараметра;	
	
	Если ЗначениеЗаполнено(ДатаНачалаПодготовкиМатериаловПоПлощадке) 
		И ТипЗнч(ДатаНачалаПодготовкиМатериаловПоПлощадке) = Тип("Дата")
		И  ДатаНачалаПодготовкиМатериаловПоПлощадке< ТекущаяДата() Тогда
		ПодготовкаПоПлощадке = Истина;
		Лико_Площадка = Объект.ЗаказКлиента.Площадка;
		Площадка = Лико_Площадка.Организация;
		Если Объект.ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Ликофлекс
			Или Объект.ЗаказКлиента.Площадка = Справочники.Лико_Площадки.ИксПак Или Объект.ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Линкс Тогда
			Элементы.Лико_Площадка.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-<---Лико m.shenderov 30.12.2024

&НаКлиенте
Процедура Лико_ПлощадкаПриИзменении(Элемент)
	Площадка = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Лико_Площадка,"Организация");
	УстановитьПараметрыОстатковКлиент();

КонецПроцедуры 






#КонецОбласти