
&НаКлиенте
&Вместо("РедактированиеРеквизитаЗавершение")
Процедура Лико_РедактированиеРеквизитаЗавершение(РезультатФормы, ПараметрФормы)
	Если РезультатФормы=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Лико_Дополнительно.РедактироватьРеквизитСервер(ПараметрФормы.ТекущийДокумент,ПараметрФормы.Ключ,РезультатФормы);
	Если ПараметрФормы.Ключ = "Лико_ДатаЗакрытия"  И  ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ПараметрФормы.ТекущийДокумент, "Лико_ДатаОплаты") Тогда 
		Лико_ДатаОплаты 		= ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрФормы.ТекущийДокумент, "Лико_ДатаОплаты");
		ДатаПолученияДокументов = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрФормы.ТекущийДокумент,"ДатаПолученияДокументов") ;
		Если (РезультатФормы<> Макс(Лико_ДатаОплаты ,ДатаПолученияДокументов) ИЛИ Не ЗначениеЗаполнено(Мин(Лико_ДатаОплаты ,ДатаПолученияДокументов) ))
			И Не ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрФормы.ТекущийДокумент , "Лико_РучнаяКорректировкаДатыЗакрытия")  Тогда  
			Лико_Дополнительно.РедактироватьРеквизитСервер(ПараметрФормы.ТекущийДокумент,"Лико_РучнаяКорректировкаДатыЗакрытия",Истина);
		КонецЕсли;
	КонецЕсли;
	ПараметрФормы.СписокДляРедактирования.Обновить();	

КонецПроцедуры

