
&НаСервере
Процедура УдалитьОбъектыНоменклатурыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	НЕ ЯССМ_ОбъектыНоменклатуры.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект=Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Удалить();		
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект=Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ЯССМ_ОбъектНоменклатуры=Справочники.ЯССМ_ОбъектыНоменклатуры.ПустаяСсылка();
		СправочникОбъект.Записать();    
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектыНоменклатуры(Команда)
	
	УдалитьОбъектыНоменклатурыНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаГруппФинансовогоУчетаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВводОстатковПоСкладуТоварыВЯчейках.Номенклатура.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Документ.Лико_ВводОстатковПоСкладу.ТоварыВЯчейках КАК Лико_ВводОстатковПоСкладуТоварыВЯчейках
	|ГДЕ
	|	Лико_ВводОстатковПоСкладуТоварыВЯчейках.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ВводОстатковПоСкладуТоварыВЯчейках.Номенклатура.ГруппаФинансовогоУчета";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("ГруппаФинансовогоУчета",Выборка.ГруппаФинансовогоУчета);
		НайденыеСтроки=Объект.СоответствиеВводаОстатков.НайтиСтроки(Структура);
		Если НайденыеСтроки.Количество()>0 Тогда
			Для  каждого Стр Из НайденыеСтроки Цикл
				Стр.Количество=Выборка.Количество;
			КонецЦикла;
			
			
		Иначе
			Стр=Объект.СоответствиеВводаОстатков.Добавить();
			Стр.ГруппаФинансовогоУчета=Выборка.ГруппаФинансовогоУчета;
			Стр.Количество=Выборка.Количество;
		КонецЕсли;
	КонецЦикла; 
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаГруппФинансовогоУчета(Команда)
	ЗагрузкаГруппФинансовогоУчетаНаСервере();
КонецПроцедуры
