#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает надпись о состоянии проверки документа по статусу.
//
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыПроверкиРНПТ - статус проверки документа
// Возвращаемое значение:
// - Строка - надпись для отображения в документе.
Функция НадписьПоСтатусу(Статус) Экспорт
	
	Если Статус = Перечисления.СтатусыПроверкиРНПТ.НекорректныйРНПТ Тогда
		Возврат НСтр("ru = 'обнаружены ошибки при проверке сервисом ФНС';
					|en = 'errors are found while checking with the Federal Tax Service'");
	ИначеЕсли Статус = Перечисления.СтатусыПроверкиРНПТ.Проверено Тогда
		Возврат НСтр("ru = 'ошибок не обнаружено';
					|en = 'no errors are found'");
	ИначеЕсли Статус = Перечисления.СтатусыПроверкиРНПТ.Выполняется Тогда
		Возврат НСтр("ru = 'выполняется';
					|en = 'in progress'");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли