
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЗаказКлиента", ЗаказКлиента);
	Параметры.Свойство("ТекущийНомерПроката", ТекущийНомерПроката);
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	СформироватьТаблицуДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ОчиститьСообщения();
	ЗаписатьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();

	ЗапросДЗПЭ = Новый Запрос;
	ЗапросДЗПЭ.Текст = 
	"ВЫБРАТЬ
	|	Лико_ДвиженияЗаказаПоЭтапам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ДвиженияЗаказаПоЭтапам КАК Лико_ДвиженияЗаказаПоЭтапам
	|ГДЕ
	|	Лико_ДвиженияЗаказаПоЭтапам.ЗаказКлиента = &ЗаказКлиента
	|	И НЕ Лико_ДвиженияЗаказаПоЭтапам.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ЗапросДЗПЭ.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	ВыборкаДЗПЭ = ЗапросДЗПЭ.Выполнить().Выбрать();
	Если ВыборкаДЗПЭ.Следующий() Тогда
		ДокОбъект = ВыборкаДЗПЭ.Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.Лико_ДвиженияЗаказаПоЭтапам.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.ЗаказКлиента = ЗаказКлиента;
		ДокОбъект.Автор = ТекущийПользователь.ФизическоеЛицо;
	КонецЕсли;
	
	ДокОбъект.ФактыНастройки.Очистить();
	Для каждого Строка из ТаблицаНастроек Цикл
		Если Строка.Настройка Тогда
			НоваяСтрока = ДокОбъект.ФактыНастройки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать(?(ДокОбъект.Проведен ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.Ссылка), РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись), РежимПроведенияДокумента.Неоперативный);
		ЗафиксироватьТранзакцию();
		Сообщить("Обновленные данные по заказу " + ЗаказКлиента.НомерБезПрефикса + " успешно сохранены");
	Исключение
		Сообщить("Не удалось обновить данные: " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;

	СформироватьТаблицуДанных();
	Модифицированность = Ложь;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СформироватьТаблицуДанных()

	УстановитьПривилегированныйРежим(Истина);
			   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТСИсторияРабочегоСтолаОператора.Заказ КАК Заказ,
		|	ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства.НомерПроката КАК НомерПроката,
		|	ТСИсторияРабочегоСтолаОператора.НомерБланка КАК НомерБланка,
		|	ТСИсторияРабочегоСтолаОператора.Оператор КАК Оператор,
		|	МАКСИМУМ(ТСИсторияРабочегоСтолаОператора.РабочийЦентр) КАК РабочийЦентр,
		|	МИНИМУМ(ТСИсторияРабочегоСтолаОператора.Период) КАК Период
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ТСИсторияРабочегоСтолаОператора КАК ТСИсторияРабочегоСтолаОператора
		|ГДЕ
		|	ТСИсторияРабочегоСтолаОператора.Заказ = &Заказ
		|	И ТСИсторияРабочегоСтолаОператора.Оператор <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТСИсторияРабочегоСтолаОператора.Заказ,
		|	ТСИсторияРабочегоСтолаОператора.ЭтапПроизводства.НомерПроката,
		|	ТСИсторияРабочегоСтолаОператора.Оператор,
		|	ТСИсторияРабочегоСтолаОператора.НомерБланка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТССтатистикаСкорости.Заказ,
		|	ТССтатистикаСкорости.ЭтапПроизводства.НомерПроката,
		|	ТССтатистикаСкорости.НомерБланка,
		|	ТССтатистикаСкорости.Оператор,
		|	МАКСИМУМ(ТССтатистикаСкорости.РабочийЦентр),
		|	МИНИМУМ(ТССтатистикаСкорости.ДатаНачала)
		|ИЗ
		|	РегистрСведений.ТССтатистикаСкорости КАК ТССтатистикаСкорости
		|ГДЕ
		|	ТССтатистикаСкорости.Заказ = &Заказ
		|	И ТССтатистикаСкорости.Оператор <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТССтатистикаСкорости.Заказ,
		|	ТССтатистикаСкорости.ЭтапПроизводства.НомерПроката,
		|	ТССтатистикаСкорости.Оператор,
		|	ТССтатистикаСкорости.НомерБланка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Заказ КАК Заказ,
		|	МАКСИМУМ(ВТ.РабочийЦентр) КАК РабочийЦентр,
		|	ВТ.НомерПроката КАК НомерПроката,
		|	ВТ.НомерБланка КАК НомерБланка,
		|	ВТ.Оператор КАК Оператор,
		|	МИНИМУМ(ВТ.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_Сгруппировано
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.НомерПроката,
		|	ВТ.НомерБланка,
		|	ВТ.Заказ,
		|	ВТ.Оператор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сгруппировано.Заказ КАК Заказ,
		|	ВТ_Сгруппировано.РабочийЦентр КАК РабочийЦентр,
		|	ВТ_Сгруппировано.НомерПроката КАК НомерПроката,
		|	ВТ_Сгруппировано.НомерБланка КАК НомерБланка,
		|	МАКСИМУМ(ВТ_Сгруппировано.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_МаксимальныеЗаписиПоБланкам
		|ИЗ
		|	ВТ_Сгруппировано КАК ВТ_Сгруппировано
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Сгруппировано.Заказ,
		|	ВТ_Сгруппировано.РабочийЦентр,
		|	ВТ_Сгруппировано.НомерПроката,
		|	ВТ_Сгруппировано.НомерБланка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сгруппировано.Заказ КАК Заказ,
		|	ВТ_Сгруппировано.РабочийЦентр КАК РабочийЦентр,
		|	ВТ_Сгруппировано.НомерПроката КАК НомерПроката,
		|	ВТ_Сгруппировано.НомерБланка КАК НомерБланка,
		|	ВТ_Сгруппировано.Оператор КАК Оператор,
		|	ВТ_Сгруппировано.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ВТ_МаксимальныеЗаписиПоБланкам.Период ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПоследняяЗаписьПоБланку
		|ПОМЕСТИТЬ ВТ_СПризнакомПервойЗаписиПоБланку
		|ИЗ
		|	ВТ_Сгруппировано КАК ВТ_Сгруппировано
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальныеЗаписиПоБланкам КАК ВТ_МаксимальныеЗаписиПоБланкам
		|		ПО ВТ_Сгруппировано.Заказ = ВТ_МаксимальныеЗаписиПоБланкам.Заказ
		|			И ВТ_Сгруппировано.РабочийЦентр = ВТ_МаксимальныеЗаписиПоБланкам.РабочийЦентр
		|			И ВТ_Сгруппировано.НомерПроката = ВТ_МаксимальныеЗаписиПоБланкам.НомерПроката
		|			И ВТ_Сгруппировано.НомерБланка = ВТ_МаксимальныеЗаписиПоБланкам.НомерБланка
		|			И ВТ_Сгруппировано.Период = ВТ_МаксимальныеЗаписиПоБланкам.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаЦвета.Ссылка КАК ЗаказКлиента,
		|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката,
		|	МАКСИМУМ(ЗаказКлиентаЦвета.РабочийЦентр) КАК РабочийЦентр
		|ПОМЕСТИТЬ ВТ_ПрокатыИзЗаказа
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаЦвета.Ссылка,
		|	ЗаказКлиентаЦвета.НомерПроката
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПрокатыИзЗаказа.ЗаказКлиента КАК Заказ,
		|	ВТ_ПрокатыИзЗаказа.НомерПроката КАК НомерПроката,
		|	ЕСТЬNULL(ВТ_СПризнакомПервойЗаписиПоБланку.РабочийЦентр, ВТ_ПрокатыИзЗаказа.РабочийЦентр) КАК РабочийЦентр,
		|	ВТ_СПризнакомПервойЗаписиПоБланку.НомерБланка КАК НомерБланка,
		|	ВТ_СПризнакомПервойЗаписиПоБланку.Оператор КАК Оператор,
		|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Дата КАК Дата,
		|	Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Дата ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Настройка,
		|	ВЫБОР
		|		КОГДА ВТ_СПризнакомПервойЗаписиПоБланку.НомерБланка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПустаяСтрока,
		|	ВТ_СПризнакомПервойЗаписиПоБланку.Период КАК Период
		|ИЗ
		|	ВТ_ПрокатыИзЗаказа КАК ВТ_ПрокатыИзЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СПризнакомПервойЗаписиПоБланку КАК ВТ_СПризнакомПервойЗаписиПоБланку
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ДвиженияЗаказаПоЭтапам.ФактыНастройки КАК Лико_ДвиженияЗаказаПоЭтапамФактыНастройки
		|			ПО ВТ_СПризнакомПервойЗаписиПоБланку.Заказ = Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Ссылка.ЗаказКлиента
		|				И ВТ_СПризнакомПервойЗаписиПоБланку.НомерПроката = Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.НомерПроката
		|				И ВТ_СПризнакомПервойЗаписиПоБланку.НомерБланка = Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.НомерБланка
		|				И (ВЫБОР
		|					КОГДА Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Оператор = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|						ТОГДА ВТ_СПризнакомПервойЗаписиПоБланку.ПоследняяЗаписьПоБланку
		|					ИНАЧЕ Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Оператор = ВТ_СПризнакомПервойЗаписиПоБланку.Оператор
		|				КОНЕЦ)
		|				И (Лико_ДвиженияЗаказаПоЭтапамФактыНастройки.Ссылка.Проведен)
		|		ПО ВТ_ПрокатыИзЗаказа.ЗаказКлиента = ВТ_СПризнакомПервойЗаписиПоБланку.Заказ
		|			И ВТ_ПрокатыИзЗаказа.НомерПроката = ВТ_СПризнакомПервойЗаписиПоБланку.НомерПроката
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПроката,
		|	НомерБланка,
		|	ВТ_СПризнакомПервойЗаписиПоБланку.Период,
		|	Дата";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить(); 

	Для каждого Строка из ТаблицаДанных Цикл
		Если Элементы.ТекущийНомерПроката.СписокВыбора.НайтиПоЗначению(Строка.НомерПроката) = Неопределено Тогда
			Элементы.ТекущийНомерПроката.СписокВыбора.Добавить(Строка.НомерПроката, СокрЛП(Строка.РабочийЦентр) + " (" + Строка.НомерПроката + " прокат)"); 
			Если НЕ ЗначениеЗаполнено(ТекущийНомерПроката) Тогда
				ТекущийНомерПроката = Строка.НомерПроката;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ТаблицаНастроек.Загрузить(ТаблицаДанных);   
	
 	Элементы.ТаблицаНастроек.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерПроката,ПустаяСтрока", ТекущийНомерПроката, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТекущийНомерПрокатаПриИзменении(Элемент)
 	Элементы.ТаблицаНастроек.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерПроката,ПустаяСтрока", ТекущийНомерПроката, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОчиститьСообщения();
	СформироватьТаблицуДанных();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекНастройкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаНастроек.ТекущиеДанные;
	Если ТекущаяСтрока.Настройка Тогда
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Комментарий) Тогда
			// Установили настройку. Нужно убрать настройку у других строк
			Для каждого Строка из ТаблицаНастроек Цикл
				Если Строка = ТекущаяСтрока ИЛИ Строка.НомерПроката <> ТекущийНомерПроката ИЛИ ЗначениеЗаполнено(Строка.Комментарий) Тогда
					Продолжить;
				КонецЕсли;
				Если Строка.Настройка Тогда
					Строка.Настройка = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ТекущаяСтрока.Дата = ТекущаяДата();
		ТекущаяСтрока.Комментарий = "Настройка установлена пользователем """ + ТекущийПользователь + """";
	КонецЕсли;
		
КонецПроцедуры
