#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает соответствие кодов планируемого статуса маркируемого товара значению перечисления
// 
// Возвращаемое значение:
//  Соответствие
//
Функция КодыПланируемыхСтатусовМаркируемогоТовара() Экспорт
	
	Результат = Новый Соответствие(); 
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован"), 1);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.МерныйТоварВСтадииРеализации"), 2);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен"), 3);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ЧастьТовараВозвращена"), 4);  
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВСтадииРеализации"), 5);  
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.МерныйТоварРеализован"), 6);  
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.СтатусТовараНеИзменился"), 255);
	Возврат Результат;
	
КонецФункции

// Возвращает соответствие планируемых статусов маркируемого товара коду
// 
// Возвращаемое значение:
//  Соответствие
//
Функция ПланируемыеСтатусыМаркируемогоТовараПоКоду() Экспорт
	
	Результат = Новый Соответствие(); 
	Результат.Вставить(1, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован"));
	Результат.Вставить(2, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.МерныйТоварВСтадииРеализации"));
	Результат.Вставить(3, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВозвращен"));
	Результат.Вставить(4, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ЧастьТовараВозвращена"));
	Результат.Вставить(5, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварВСтадииРеализации"));
	Результат.Вставить(6, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.МерныйТоварРеализован"));
	Результат.Вставить(255, ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.СтатусТовараНеИзменился"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли