
&НаКлиенте
Процедура ПодписатьДокумент(Команда)
	Данные=Элементы.Список.ТекущиеДанные;
	Если Данные.Подписан Тогда
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьПодписьДокументаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Отменить подпись документа?",РежимДиалогаВопрос.ДаНет, 60);
Иначе
	Структура = Новый Структура;
	Структура.Вставить("Документ",Данные.Документ);
	Структура.Вставить("Правило",Данные.Правило);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодписьЗавершение", ЭтотОбъект);

	ОткрытьФорму("Обработка.ДокументыНаПодпись.Форма.ФормаПодписи",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

	 
		
КонецПроцедуры
&НаКлиенте
Процедура ПодписьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
Элементы.Список.Обновить();	
КонецПроцедуры

//Вынести в отдельную процедуру
&НаКлиенте
Процедура ОтменитьПодписьДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Данные=Элементы.Список.ТекущиеДанные;
			ОтменитьПодписьНаСервере(Данные.Документ,Данные.Правило);
		КонецЕсли; 
	Элементы.Список.Обновить();	
КонецПроцедуры	

&НаСервере
Процедура ОтменитьПодписьНаСервере(Документ,Правило) //+Лико m.shenderov 02.06.2020
УстановитьПривилегированныйРежим(Истина);
	    НаборЗаписей = РегистрыСведений.Лико_ПодписанныеДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Документ);
		НаборЗаписей.Отбор.Правило.Установить(Правило);
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Документ=Документ;
		НоваяЗапись.Правило=Правило;  
		НаборЗаписей.Записать();

КонецПроцедуры  //-Лико m.shenderov 02.06.2020


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Данные=Элементы.Список.ТекущиеДанные;
	Если  Данные<>Неопределено Тогда
		ЕСли Данные.Подписан Тогда
			Элементы.СписокПодписатьДокумент.Заголовок="Отмена подписи";
		Иначе
			Элементы.СписокПодписатьДокумент.Заголовок="Подписать документ";

		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;

КонецПроцедуры

