
&НаКлиенте
Процедура Лико_ПродукцияХарактеристикаПриИзмененииПосле(Элемент)
	ПриВвводеРоликовПродукция("Продукция");
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПродукцияЛико_ВтулкаПриИзмененииПосле(Элемент)
	ПриВвводеРоликовПродукция("Продукция");
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПродукцияЛико_НамоткаПриИзмененииПосле(Элемент)
	ПриВвводеРоликовПродукция("Продукция");
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПродукцияЛико_КолРоликовПриИзмененииПосле(Элемент)
	ПриВвводеРоликовПродукция("Продукция");
	
КонецПроцедуры

&НаКлиенте
Функция ПриВвводеРоликовПродукция(Таблица) //+Лико m.shenderov 14.12.2017 
	
	Нарезка=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы[Таблица].ТекущиеДанные.Характеристика,"ЯССМ_Нарезка");
	
	Если Нарезка <> ПредопределенноеЗначение("Справочник.ЯССМ_Нарезки.ПустаяСсылка") Тогда
		
		Если Не ЗначениеЗаполнено(Элементы[Таблица].ТекущиеДанные.Лико_Втулка) Тогда
			 Элементы[Таблица].ТекущиеДанные.Лико_Втулка=ВтулкаСервер76();
		КонецЕсли;
		
		
		КоличествоПГ = 0;
		КоличествоКВ = (Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Нарезка,"Размер")/1000) *
		Элементы[Таблица].ТекущиеДанные.Лико_Намотка * 
		Элементы[Таблица].ТекущиеДанные.Лико_КолРоликов;
		
		Элементы[Таблица].ТекущиеДанные.КоличествоУпаковок = КоличествоКВ; 	
		Если Таблица="Продукция" Тогда
		ПродукцияКоличествоУпаковокПриИзменении("ПриВвводеРоликов");
			Иначе
		 МатериалыКоличествоУпаковокПриИзменении("ПриВвводеРоликов"); 

		КонецЕсли;
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции  //-Лико m.shenderov 14.12.2017

&НаКлиенте
Процедура Лико_МатериалыХарактеристикаПриИзмененииПосле(Элемент)
	
	ПриВвводеРоликовПродукция("Материалы");

КонецПроцедуры

&НаКлиенте
Процедура Лико_МатериалыЛико_ВтулкаПриИзмененииПосле(Элемент)
	ПриВвводеРоликовПродукция("Материалы");

КонецПроцедуры

&НаКлиенте
Процедура Лико_МатериалыЛико_НамоткаПриИзмененииПосле(Элемент)
	ПриВвводеРоликовПродукция("Материалы");

КонецПроцедуры

&НаКлиенте
Процедура Лико_МатериалыЛико_КолРоликовПриИзмененииПосле(Элемент)
	ПриВвводеРоликовПродукция("Материалы");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВтулкаСервер76() //+Лико m.shenderov 15.12.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Втулки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Втулки КАК Лико_Втулки
	|ГДЕ
	|	Лико_Втулки.Размер = 76";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	 Выборка = РезультатЗапроса.Выбрать();
	 Пока Выборка.Следующий() Цикл
	     Возврат Выборка.Ссылка;
	 КонецЦикла; 
	
КонецФункции  //-Лико m.shenderov 15.12.2017

