#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция Контролировать(Площадка, Номенклатура, Дата ) Экспорт 
УстановитьПривилегированныйРежим(Истина);	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодности КАК СрокГодности
	|ИЗ
	|	РегистрСведений.Лико_СрокиГодностиНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Площадка = &Площадка
	|				И Номенклатура = &Номенклатура) КАК Лико_СрокиГодностиНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.СрокГодности;
	
	КонецЦикла; 
	
	
Возврат Результат;	

КонецФункции 

Функция СрокГодностиНоменклатуры(Площадка, Номенклатура, Дата ) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Соответствие;
	Результат.Вставить(Справочники.Номенклатура.ПустаяСсылка(),0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодности КАК СрокГодности,
	|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Лико_СрокиГодностиНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Площадка = &Площадка
	|				И Номенклатура В (&Номенклатура)) КАК Лико_СрокиГодностиНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат.Вставить(Выборка.Номенклатура,Выборка.СрокГодности);
	
	КонецЦикла; 
	
	
Возврат Результат;	

КонецФункции 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
#КонецЕсли