&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заказ") Тогда
		ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Заказ");
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Заказ");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.ПравоеЗначение   = Параметры.Заказ;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		//Иначе	
		
		//	Если РольДоступна("Лико_Регионы_Менеджер") Тогда 
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	Пользователи.ФизЛицо
		//		|ПОМЕСТИТЬ ВТ
		//		|ИЗ
		//		|	Справочник.Пользователи КАК Пользователи
		//		|ГДЕ
		//		|	Пользователи.Ссылка = &пользователь
		//		|;
		//		|
		//		|////////////////////////////////////////////////////////////////////////////////
		//		|ВЫБРАТЬ
		//		|	Пользователи.Ссылка КАК Менеджер
		//		|ИЗ
		//		|	ВТ КАК ВТ
		//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НастройкаДоступаКЗаказамНаСайте КАК Лико_НастройкаДоступаКЗаказамНаСайте
		//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		//		|			ПО Лико_НастройкаДоступаКЗаказамНаСайте.ДоступныЗаказыМенеджера = Пользователи.ФизЛицо
		//		|		ПО ВТ.ФизЛицо = Лико_НастройкаДоступаКЗаказамНаСайте.Менеджер";
		//		Запрос.УстановитьПараметр("пользователь",Пользователи.ТекущийПользователь()); 
		//		СП = Новый СписокЗначений;
		//		ТЗ = Запрос.Выполнить().Выгрузить();
		//		СП.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Менеджер")); 
		//		ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Менеджер");
		
		//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Менеджер");
		//		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		//		ЭлементОтбора.Использование    = Истина;
		//		ЭлементОтбора.ПравоеЗначение   = СП;
		//		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		
		//		
		//		
		//		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//		//Список,
		//		//"Менеджер",
		//		//глЗначениеПеременной("ГлТекущийПользователь"),
		//		//Истина, // Установить
		//		//ВидСравненияКомпоновкиДанных.Равно);
		//	КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Элемент.ЦветТекста = WebЦвета.Аквамарин;
	ПараметрыФормы    = новый Структура("Ключ", ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.Лико_ЗаказОснастки.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры


&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФорму("Документ.Лико_ЗаказОснастки.ФормаОбъекта");
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
	ОбновитьИнтерфейс();
КонецПроцедуры


&НаКлиенте
Процедура Скопировать(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Элемент.ЦветТекста = WebЦвета.Аквамарин;
	ПараметрыФормы    = новый Структура("ЗначениеКопирования", ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ.Лико_ЗаказОснастки.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

