
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РабочееМесто=ПараметрыСеанса.Лико_РабочееМесто;
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если Параметры.Свойство("ИмяДокумента") Тогда
		ИмяДокумента=Параметры.ИмяДокумента;
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") Тогда
		СсылкаДокумента=Параметры.Ключ;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Оператор=ГлЛико_Оператор;
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если  ИмяСобытия="АвторизацияОператора" Тогда
		Оператор=ГлЛико_Оператор;   
	КонецЕсли;
	
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо  			
			Оператор = Результат.Сотрудник;
			ГлЛико_Оператор=Оператор;
			Оповестить("АвторизацияОператора");
			ОткрытьФормуДокумента();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуДокумента() //+Лико m.shenderov 18.12.2017
	Закрыть();
	Если  ЗначениеЗаполнено(ИмяДокумента)Тогда
		
		Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
			Структура = Новый Структура;
			Структура.Вставить("Ключ",СсылкаДокумента);	
			ОткрытьФорму("Документ."+ИмяДокумента+".Форма.ФормаДокумента",Структура);
			
		Иначе
			
			ОткрытьФорму("Документ."+ИмяДокумента+".Форма.ФормаДокумента");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 18.12.2017

&НаСервере
Процедура СотрудникПоF2НаСервере()
	ПолучитьОператора =Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СотрудникПоF2",Неопределено);
	Если ЗначениеЗаполнено(ПолучитьОператора) Тогда
		Оператор=ПолучитьОператора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПоF2(Команда)
	СотрудникПоF2НаСервере();
	ГлЛико_Оператор=Оператор;
	
	Оповестить("АвторизацияОператора");
	Если ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		ОткрытьФормуДокумента() 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПоF3НаСервере()
	ПолучитьОператора =Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СотрудникПоF3",Неопределено);
	Если ЗначениеЗаполнено(ПолучитьОператора) Тогда
		Оператор=ПолучитьОператора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПоF3(Команда)
	СотрудникПоF3НаСервере();
	ГлЛико_Оператор=Оператор;
	Оповестить("АвторизацияОператора");
	Если ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		ОткрытьФормуДокумента() 
	КонецЕсли;
	
КонецПроцедуры


