&НаКлиенте
Перем   НомГрПроизводство;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвторДокумента") Тогда
		АвторДокумента=Параметры.АвторДокумента;
	КонецЕсли;	
	Если Параметры.Свойство("НомерЗаказа") Тогда
		НомерЗаказа=Параметры.НомерЗаказа;
	КонецЕсли;
	Если Параметры.Свойство("НомерБланка") Тогда
		НомерБланка=Параметры.НомерБланка;
	КонецЕсли;
	Если Параметры.Свойство("Нарезка") Тогда
		Нарезка=Параметры.Нарезка;
	КонецЕсли;
	Если Параметры.Свойство("Втулка") Тогда
		Втулка=Параметры.Втулка;
	КонецЕсли;
	
	Если Параметры.Свойство("СерийныйНомер") Тогда
		СерийныйНомер=Параметры.СерийныйНомер;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектНоменклатураAmcor") Тогда
		ОбъектНоменклатураAmcor=Параметры.ОбъектНоменклатураAmcor;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоРоликов = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРолики(Команда)
	Если Не ЗначениеЗаполнено(АвторДокумента) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнен автор документа!";
		Сообщение.Поле = "АвторДокумента";
		Сообщение.УстановитьДанные(АвторДокумента);
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнен номер заказа!";
		Сообщение.Поле = "НомерЗаказа";
		Сообщение.УстановитьДанные(НомерЗаказа);
		Сообщение.Сообщить();		
		Возврат;
		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Нарезка) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнена нарезка!";
		Сообщение.Поле = "Нарезка";
		Сообщение.УстановитьДанные(Нарезка);
		Сообщение.Сообщить();		
		
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Втулка) Тогда
		
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не заполнена втулка!";
		Сообщение.Поле = "Втулка";
		Сообщение.УстановитьДанные(Втулка);
		Сообщение.Сообщить();	
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КоличествоРоликов) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст ="Не указано количество роликов!";
		Сообщение.Поле = "КоличествоРоликов";
		Сообщение.УстановитьДанные(КоличествоРоликов);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивОбъектов = СоздатьОбъектыНоменклатуры();
	ЭтаФорма.Закрыть(МассивОбъектов);
	
	
КонецПроцедуры


&НаСервере 
Функция СоздатьОбъектыНоменклатуры()
	УстановитьПривилегированныйРежим(Истина);
	ЗаказКлиента=Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказа,"ЗаказКлиента");
	МенеджерЗаказа=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ЗаказКлиента,"Менеджер");
	МассивСозданныхОбъектов = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ОбъектНоменклатураAmcor) Тогда
		
		// Ищем номенклатуру
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияСвойствОбъектов.Объект КАК Характеристика
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗначенияСвойствЗаказ.Объект КАК ХарактеристкиСЗаказом
		|		ИЗ
		|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствЗаказ
		|		ГДЕ
		|			ЗначенияСвойствЗаказ.Свойство В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
		|					ИЗ
		|						ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
		|					ГДЕ
		|						СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоЗаказ)
		|			И ЗначенияСвойствЗаказ.Значение = &NЗаказ) КАК ВложенныйЗапрос
		|		ПО ЗначенияСвойствОбъектов.Объект = ВложенныйЗапрос.ХарактеристкиСЗаказом
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				СвойстваОбъектовЗаказ.Ссылка КАК Ссылка
		|			ИЗ
		|				ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектовЗаказ
		|			ГДЕ
		|				СвойстваОбъектовЗаказ.Наименование = &НаименованиеСвовоХарактеристика)
		|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА
		|	И ЗначенияСвойствОбъектов.Объект.Владелец.ВидНоменклатуры = &Полуфабрикат
		|	И ЗначенияСвойствОбъектов.Объект.Владелец.Наименование ПОДОБНО &Название";
		
		Запрос.Текст ="ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ
		|	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры = &ВидНоменклатуры";
		
		Запрос.УстановитьПараметр("Заказ",ЗаказКлиента);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураНезавершенка = Неопределено;
		ХарактеристикаНезавершенка = Неопределено;
		
		//=--------- создаем незавершенку -----
		РодительНезавершенкаНоменклатура = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		РодительНезавершенка = Справочники.Лико_ПредопределенныеЗначения.ГруппаОбъектовНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			ВыборкаЗапроса.Следующий();
			
			ХарактеристикаНезавершенка = ВыборкаЗапроса.Характеристика;
			НоменклатураНезавершенка = ХарактеристикаНезавершенка.Владелец;
		Иначе 	//запрос пуст!
			
			//Если Не ЗначениеЗаполнено(РодительНезавершенкаНоменклатура) Тогда
			//	Сообщить("Не найдена группа полуфабрикатов!");
			//	Возврат Неопределено;
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(МенеджерЗаказа) Тогда
				ФИО = МенеджерЗаказа.Наименование;
				Фамилия		= ВыделитьСлово(ФИО);
				Имя			= ВыделитьСлово(ФИО);
				Отчество	= ВыделитьСлово(ФИО);
				ФИОСтрока = Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
			Иначе
				ФИОСтрока = "";
			КонецЕсли;
			//---------=
			
			Номенклатура1С = Справочники.Номенклатура.СоздатьЭлемент();
			Номенклатура1С.УстановитьНовыйКод("n");
			Номенклатура1С.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
			Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура1С);
			
			Номенклатура1С.Наименование = "Незавершенное производство по заказу №" + Формат(НомерЗаказа, "ЧГ=0") + " (" + ФИОСтрока + ")";
			Номенклатура1С.НаименованиеПолное = Номенклатура1С.Наименование;
			//Номенклатура1С.НоменклатурнаяГруппа = НомГрПроизводство;
			//Номенклатура1С.ЦеноваяГруппа = Справочники.ЦеновыеГруппы.Полуфабрикат;
			//Номенклатура1С.ВесовойКоэффициентВхождения = 100;
			
			Если Не РодительНезавершенкаНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
				Номенклатура1С.Родитель = РодительНезавершенкаНоменклатура;			
				//Номенклатура1С.ВидНоменклатуры = РодительНезавершенкаНоменклатура.ВидНоменклатуры;
				//ПрисвоитьСтЗатратОтСоседа(Номенклатура1С, РодительНезавершенкаНоменклатура);
			Иначе
				//Номенклатура1С.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004"); //Полуфабрикате
			КонецЕсли;
			//Если Номенклатура1С.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004") Тогда
			//	Номенклатура1С.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("00003");	
			//	Номенклатура1С.НаправлениеВыпуска = Перечисления.НаправленияВыпуска.НаСклад;
			//КонецЕсли;
			//Номенклатура1С.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055"); //м2
			//Номенклатура1С.Артикул = "";
			//Номенклатура1С.Комментарий = "";
			//Номенклатура1С.Записать();
			//Номенклатура1С.ЕдиницаХраненияОстатков = НайтиИлиСоздатьЕдиницуИзмерения(Номенклатура1С.Ссылка);
			//Номенклатура1С.ЕдиницаДляОтчетов = НайтиИлиСоздатьЕдиницуИзмерения(Номенклатура1С.Ссылка);
			Номенклатура1С.Записать();
			
			НоменклатураНезавершенка = Номенклатура1С.Ссылка;
			
			//=--------- создаем ему характеристику -----
			/// создадим ХарКу
			//СтрНоменклатура = Новый Структура("Номенклатура", НоменклатураНезавершенка);
			//СтрХарактеристика = Новый Структура("OrderNum", НомерЗаказа);
			//СтрХарактеристика.Вставить("NКонтракта" ,"");
			//СтрХарактеристика.Вставить("КодЭтикетки","");
			//
			//ЛикоМодулиРаботыСоСкладами.СоздатьХарактеристику(СтрХарактеристика,,СтрНоменклатура,Истина);
			ХарактеристикаНезавершенкаОбъект=Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНезавершенкаОбъект.Владелец=НоменклатураНезавершенка;
			ХарактеристикаНезавершенкаОбъект.Лико_ЗаказНоменклатуры=ЗаказКлиента;
			ХарактеристикаНезавершенкаОбъект.Записать();
			ХарактеристикаНезавершенка=ХарактеристикаНезавершенкаОбъект.Ссылка;
		КонецЕсли;
		
		Если НоменклатураНезавершенка<>Неопределено И ХарактеристикаНезавершенка<>Неопределено Тогда
			//=--------- находим или создаем ед. изм. УУ -----
			
			//БазоваяЕдиницаИзмеренияНезавершенка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("018"); //пог. м.
			//
			//Коэффициент = Нарезка.Размер / 1000;
			//
			//ЗапросЕИ = Новый Запрос;
			//ЗапросЕИ.Текст = 
			//"ВЫБРАТЬ
			//|	ЯССМ_ЕдиницыИзмерения.Ссылка
			//|ИЗ
			//|	Справочник.ЯССМ_ЕдиницыИзмерения КАК ЯССМ_ЕдиницыИзмерения
			//|ГДЕ
			//|	ЯССМ_ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
			//|	И ЯССМ_ЕдиницыИзмерения.Коэффициент = &Коэффициент
			//|	И ЯССМ_ЕдиницыИзмерения.ЕдиницаПоКлассификаторуУУ = &ЕдиницаПоКлассификаторуУУ";
			//
			//ЗапросЕИ.УстановитьПараметр("ЕдиницаПоКлассификатору", БазоваяЕдиницаИзмеренияНезавершенка);
			//ЗапросЕИ.УстановитьПараметр("ЕдиницаПоКлассификаторуУУ", НоменклатураНезавершенка.БазоваяЕдиницаИзмерения);
			//ЗапросЕИ.УстановитьПараметр("Коэффициент", Коэффициент);
			//
			//РезультатЗапросаЕИ = ЗапросЕИ.Выполнить();
			//
			//Если Не РезультатЗапросаЕИ.Пустой() Тогда
			//	ВыборкаЗапросаЕИ = РезультатЗапросаЕИ.Выбрать();
			//	ВыборкаЗапросаЕИ.Следующий();
			//	
			//	ЕдиницаИзмеренияУУНезавершенка = ВыборкаЗапросаЕИ.Ссылка;
			//Иначе 	//запрос пуст!
			//	НовыйЭлемент = Справочники.ЯССМ_ЕдиницыИзмерения.СоздатьЭлемент();
			//	НовыйЭлемент.ЕдиницаПоКлассификатору = БазоваяЕдиницаИзмеренияНезавершенка;
			//	НовыйЭлемент.ЕдиницаПоКлассификаторуУУ = НоменклатураНезавершенка.БазоваяЕдиницаИзмерения;
			//	НовыйЭлемент.Коэффициент = Коэффициент;
			//	НовыйЭлемент.Наименование = НовыйЭлемент.ЕдиницаПоКлассификатору.Наименование
			//								+ ?(ЗначениеЗаполнено(НовыйЭлемент.ЕдиницаПоКлассификатору), " (" + НовыйЭлемент.Коэффициент + " " + НовыйЭлемент.ЕдиницаПоКлассификаторуУУ + ")", "");
			//	НовыйЭлемент.Записать();
			//	
			//	ЕдиницаИзмеренияУУНезавершенка = НовыйЭлемент.Ссылка;
			//КонецЕсли;
			//
			//=--------- Создание объектов номенклатуры -----
			Для Счетчик=1 По КоличествоРоликов Цикл
				
				
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Номенклатура"			,НоменклатураНезавершенка);
				СтруктураПараметров.Вставить("Родитель"				,РодительНезавершенка);
				СтруктураПараметров.Вставить("Характеристика"		,ХарактеристикаНезавершенка);
				СтруктураПараметров.Вставить("Нарезка"				,Нарезка);
				СтруктураПараметров.Вставить("Втулка"				,Втулка);
				СтруктураПараметров.Вставить("Количество"			,0);
				СтруктураПараметров.Вставить("Упаковка"				,Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка));
				СтруктураПараметров.Вставить("Уникальный"			,Истина);
				СтруктураПараметров.Вставить("НомерЗаказаКлиента"	,НомерЗаказа);
				СтруктураПараметров.Вставить("НомерБланка"			,НомерБланка);
				СтруктураПараметров.Вставить("СерийныйНомер"		,СерийныйНомер);
				СтруктураПараметров.Вставить("Комментарий"			,"");
				СтруктураПараметров.Вставить("Ответсвенный"			,АвторДокумента);
				СтруктураПараметров.Вставить("Рулонный"				,Истина); 
				НовыйЭлемент=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров);	
				
				МассивСозданныхОбъектов.Добавить(НовыйЭлемент.Ссылка);
			КонецЦикла;
			
		Иначе
			Сообщить("Не удалось создать незавершенку!");
		КонецЕсли;
		
	Иначе // ОбъектНоменклатураAmcor
		
		//=--------- Создание объектов номенклатуры -----
		Для Счетчик=1 По КоличествоРоликов Цикл  			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Номенклатура"			,ОбъектНоменклатураAmcor.Номенклатура);
			СтруктураПараметров.Вставить("Родитель"				,ОбъектНоменклатураAmcor.Родитель);
			СтруктураПараметров.Вставить("Характеристика"		,ОбъектНоменклатураAmcor.Характеристика);
			СтруктураПараметров.Вставить("Нарезка"				,Нарезка);
			СтруктураПараметров.Вставить("Втулка"				,Втулка);
			СтруктураПараметров.Вставить("Количество"			,0);
			СтруктураПараметров.Вставить("Упаковка"				,Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка));
			СтруктураПараметров.Вставить("Уникальный"			,Истина);
			СтруктураПараметров.Вставить("НомерЗаказаКлиента"	,НомерЗаказа);
			СтруктураПараметров.Вставить("НомерБланка"			,НомерБланка);
			СтруктураПараметров.Вставить("СерийныйНомер"		,СерийныйНомер);
			СтруктураПараметров.Вставить("Комментарий"			,"");
			СтруктураПараметров.Вставить("Ответсвенный"			,АвторДокумента);
			СтруктураПараметров.Вставить("Рулонный"				,Истина); 
			НовыйЭлемент=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьОбъектНоменклатуры(СтруктураПараметров);	
			МассивСозданныхОбъектов.Добавить(НовыйЭлемент.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

	КоличествоРоликов = 1;
	
	Возврат МассивСозданныхОбъектов;
	
КонецФункции //СоздатьОбъектыНоменклатуры





/// Функция выделяет первое слово в предложении
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции



















//НомГрПроизводство = ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.НоменклатурнаяГруппаПроизводство").ЗначениеПараметра;
				