
Функция ПолучитьСвойстваПользователяИБ(UserID=Неопределено) Экспорт //+Лико m.shenderov 11.06.2019
	Если   UserID="0" Тогда
		   UserID=Неопределено;
	КонецЕсли;
	   
	ПространствоИмен="http://okil-sato.ru";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФильтрПоПользователю
	|				ТОГДА Пользователи.Наименование = &UserID
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ФильтрПоПользователю",ЗначениеЗаполнено(UserID));
	Запрос.УстановитьПараметр("UserID",UserID);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	 ТипТаблицы = ФабрикаXDTO.Тип(ПространствоИмен,"GridUserProporties");
	 ВыходнаяТаблица = ФабрикаXDTO.Создать(ТипТаблицы);
	 ЭлементСтркТаблТип = ФабрикаXDTO.Тип(ПространствоИмен,"RecordUserProporties");
	Пока Выборка.Следующий() Цикл  		
		
		СвойстваПользователя	=	Пользователи.СвойстваПользователяИБ(Выборка.Наименование); 		
			 СтркТабл			= 	ФабрикаXDTO.Создать(ЭлементСтркТаблТип);			
			 СтркТабл.UserID 	= 	Выборка.Наименование;
			 
			 ГУИД=Выборка.Ссылка.УникальныйИдентификатор();	
		Если СвойстваПользователя<>Неопределено Тогда 
			 СтркТабл.UserOS 	= 	СвойстваПользователя.ПользовательОС;
			 ВыходнаяТаблица.Состав.Добавить(СтркТабл); 
		 КонецЕсли;
		 
		
	КонецЦикла;  	
	  Возврат ВыходнаяТаблица;
ВыходнаяТаблица.Получить("ТипТаблицы")
	
КонецФункции //-Лико m.shenderov 11.06.2019



Функция GetUserPropertiesHttp(UserOS=Неопределено) Экспорт //+Лико m.shenderov 11.06.2019
		   
	ПространствоИмен="http://okil-sato.ru";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Наименование КАК Name,
	|	Пользователи.Ссылка КАК Ref
	|	"                                    " КАК UserOS,
	|	"                                    " КАК Guid

	|ИЗ
	|	Справочник.Пользователи КАК Пользователи";
	
	Тз = Запрос.Выполнить().Выгрузить();

    Для каждого СтрТЗ Из Тз Цикл 		
		СвойстваПользователя	=	Пользователи.СвойстваПользователяИБ(СтрТЗ.Name); 		
			 		
			 СтрТЗ.Guid=СтрТЗ.Ссылка.УникальныйИдентификатор();	
			  СтрТЗ.UserOS="";
		Если СвойстваПользователя<>Неопределено Тогда 
			 СтрТЗ.UserOS 	= 	СвойстваПользователя.ПользовательОС;			 
		 КонецЕсли;		
	 КонецЦикла;  
	 
	 МассивВозврата = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
	
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, МассивВозврата,НастройкиСериализациииJSON); 	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть(); 
	
	//ХЗ = Новый ХранилищеЗначения(ТЗ);
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.УстановитьСтроку();	
	//ЗаписатьXML(ЗаписьXML, ХЗ); 	
	//СтрокаДляОтвета = ЗаписьXML.Закрыть(); 

	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8"); 	
	//Ответ.Заголовки.Вставить("Content-type", "application/xml;  charset=utf-8"); 	
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

	
	
КонецФункции //-Лико m.shenderov 11.06.2019


