#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция ПолучитьСвойство
//
// Описание: Получает значение свойства рабочего места
//
// Параметры: 
// ИмяСвойства 		   - Строка          	    - (обязательный).  Пример: "Код"
// ЗначениеПоУмолчанию - Любое 					- (необязательный).Пример: "000001" . Возвращается при ненайденом значении свойства.
// Пользователь 	   - СправочникСсылка       - (необязательный).Пример: ПараметрыСеанса.ТекущийПользователь
// ИмяКомпьютера 	   - Строка 				- (необязательный).Пример: ПараметрыСеанса.РабочееМестоКлиента.ИмяКомпьютера
//
// Возвращаемое значение:
// Любое                 
Функция ПолучитьСвойство(ИмяСвойства,ЗначениеПоУмолчанию=Неопределено, Знач Пользователь=Неопределено,ИмяКомпьютера=Неопределено) Экспорт
	
	Результат		=Неопределено;
	РабочееМесто	=Неопределено;	
	
	Если ИмяКомпьютера=Неопределено Тогда
		ИмяКомпьютера=ПараметрыСеанса.Лико_РабочееМесто.ИмяКомпьютера;
	КонецЕсли;
	
	Если Пользователь=Неопределено Тогда
		Пользователь=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_РабочиеМеста.Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.Лико_РабочиеМеста КАК Лико_РабочиеМеста
	|ГДЕ
	|	Лико_РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера
	|	И Лико_РабочиеМеста.Пользователь = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_РабочиеМеста.Ссылка
	|ИЗ
	|	Справочник.Лико_РабочиеМеста КАК Лико_РабочиеМеста
	|ГДЕ
	|	Лико_РабочиеМеста.Пользователь = &Пользователь
	|	И Лико_РабочиеМеста.ИмяКомпьютера = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_РабочиеМеста.Ссылка
	|ИЗ
	|	Справочник.Лико_РабочиеМеста КАК Лико_РабочиеМеста
	|ГДЕ
	|	Лико_РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера
	|	И Лико_РабочиеМеста.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ.Ссылка
	|ИЗ
	|	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("ИмяКомпьютера",ИмяКомпьютера );
	Запрос.УстановитьПараметр("Пользователь",Пользователь );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		РабочееМесто=Выборка.Ссылка;
	КонецЦикла; 
	Если РабочееМесто=Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;	
	КонецЕсли;
	Если ИмяСвойства="Код" Или  
		ИмяСвойства="Наименование" Или 
		Метаданные.Справочники.Лико_РабочиеМеста.Реквизиты.Найти(ИмяСвойства)<>Неопределено Тогда
		Возврат РабочееМесто[ИмяСвойства];
	Иначе
		ДопСвойстваОбъекта= УправлениеСвойствами.ПолучитьЗначенияСвойств(РабочееМесто);
		Для каждого ДопСвойство Из ДопСвойстваОбъекта Цикл
			Если ДопСвойство.Свойство.Заголовок=ИмяСвойства Тогда
				Возврат ДопСвойство.Значение;
			КонецЕсли; 			
		КонецЦикла; 		
	КонецЕсли;	
КонецФункции

#КонецЕсли