
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаЗаполнения(Отказ);
	Если Не Отказ Тогда
	Код				=?(ЗначениеЗаполнено(Пользователь),СокрЛП(Пользователь.Наименование),"")+?(ЗначениеЗаполнено(ИмяКомпьютера),"("+СокрЛП(ИмяКомпьютера)+")","");
	Наименование	=?(ЗначениеЗаполнено(Пользователь),СокрЛП(Пользователь.Наименование),"")+?(ЗначениеЗаполнено(ИмяКомпьютера),"("+СокрЛП(ИмяКомпьютера)+")","");

	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаЗаполнения (Отказ)
	Если Не ЗначениеЗаполнено(ИмяКомпьютера) и Не ЗначениеЗаполнено(Пользователь) Тогда
		Отказ=Истина;
		ТекстСообщения="Необходимо заполнить хотябы один из следующих реквизитов: ""Имя компьютера"" или ""Пользователь""!";
		Собощение= Новый СообщениеПользователю();
		Собощение.Текст=ТекстСообщения;
	    Собощение.Сообщить();
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 03.10.2017
	Если ПечататьДокументыПриРаботеНаТСД И НЕ ПечатьСразуНаПринтер Тогда
		Отказ = Истина;
		Сообщить("Если реквизит ПечататьДокументыПриРаботеНаТСД установлен в значение Истина, то реквизит ПечатьСразуНаПринтер тоже должен быть Истина.");
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 03.10.2017
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Наименование	=Неопределено;
	ИмяКомпьютера	=Неопределено;
	Пользователь	=Неопределено;	
КонецПроцедуры
 
