
Процедура СоздатьОбсуждение(КлючОбсуждения, ИдентификаторТекущегоПользователя) Экспорт
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Возврат;
	КонецЕсли;
	
	Если КлючОбсуждения="ERP_mobile" Тогда
		
		 КлючОбсуждения=КлючОбсуждения+"_"+Строка(ПараметрыСеанса.Лико_РабочееМесто);
		
	КонецЕсли;
	
	
	Если СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбсуждения) = Неопределено Тогда
		Обсуждение 					= СистемаВзаимодействия.СоздатьОбсуждение();
		Обсуждение.Групповое 		= Истина; 
		Обсуждение.Отображаемое 	= Ложь;
		Обсуждение.Ключ 			= КлючОбсуждения;
		Обсуждение.Участники.Добавить(ИдентификаторТекущегоПользователя); 		
		Обсуждение.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция РабочееМестоИмя() Экспорт //+Лико m.shenderov 30.03.2021
		Возврат Строка(ПараметрыСеанса.Лико_РабочееМесто);
КонецФункции //-Лико m.shenderov 30.03.2021 



Процедура ВывестиUserQRCode(Форма,Группа="UserQRCode") Экспорт //+Лико m.shenderov 06.04.2021

	Если 	Форма.Элементы.Найти(Группа)=Неопределено Тогда
       Возврат;
   КонецЕсли;
   
	ДобавляемыеРеквизиты	= Новый Массив;
	Реквизит_QRCode         = Новый РеквизитФормы("QRCode",Новый ОписаниеТипов("Строка", ,
																  Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)),, "QRCode");
																  
	ДобавляемыеРеквизиты.Добавить(Реквизит_QRCode);	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма.QRCode=ПолучитьUserQRCode();
	
	Элемент                        = Форма.Элементы.Добавить("QRCode", Тип("ПолеФормы"),Форма.Элементы[Группа]); 
	Элемент.Вид                    = ВидПоляФормы.ПолеHTMLДокумента;
	Элемент.ПутьКДанным            = "QRCode";
	Элемент.АвтоМаксимальнаяВысота = Ложь;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.Ширина                 = 19;
	Элемент.Высота                 = 10;
	Элемент.Доступность            = Ложь;
	Элемент.ПоложениеЗаголовка     = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.ЦветРамки              = ЦветаСтиля.ЦветФонаФормы;

		
КонецПроцедуры //-Лико m.shenderov 06.04.2021



Функция ПолучитьUserQRCode() //+Лико m.shenderov 04.04.2021
	РМ=ПараметрыСеанса.Лико_РабочееМесто;
	Если Не ЗначениеЗаполнено(РМ.ИмяКомпьютера) ТОгда
	Возврат Неопределено;
КонецЕсли;

	

	
	КодРабочегоМеста="ERP_mobile_"+ ПараметрыСеанса.Лико_РабочееМесто.Наименование;

	
Возврат	"<!DOCTYPE html>
	|<html lang='en'>
	|<head>
	|<meta charset='UTF-8'>
	|<meta name='viewport' content='width=device-width, initial-scale=1.0'>
	|</head>
	|<body>
	|<div id='app'>
	|   <div id='qrCodeOutput' class='text-center'>
	|   </div>
	|</div>
	//|<script src='http://cosmic.mearie.org/2011/01/qrjs/qr.js'></script>
	|<script src='http://it-mshenderov/js/qr.js'></script> 
	|<script>
	|        qrCodeOutput.append(QRCode.generateHTML('"
	+КодРабочегоМеста +"', {}))
	|</script>
	|</body>
	|</html>";
	
	
КонецФункции  //-Лико m.shenderov 04.04.2021



Процедура ПроверкаВозможностиИспользованияСистемыВзаимодействия() Экспорт//+Лико m.shenderov 21.04.2021

		УстановитьПривилегированныйРежим(Истина);
	Если  СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Если  Не  Лико_Дополнительно.ПроверитьЭтоРабочаяБаза() Тогда
			
			СистемаВзаимодействия.ОтменитьРегистрациюИнформационнойБазы();
		КонецЕсли;		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь); 
		
КонецПроцедуры //-Лико m.shenderov 21.04.2021

