
&Вместо("СоздатьАвтоМонтаж")
Процедура Лико_СоздатьАвтоМонтаж()

	
	// --> Начало Лико Митюшин МФМ 05.08.2021
	
	//Если ЗначениеЗаполнено(Объект.РучьиПечати) Тогда
	//	лРучьи=Объект.РучьиПечати;
	//Иначе
	//	лРучьи=Объект.Ручьи;
	//КонецЕсли;

	
	Если ЗначениеЗаполнено(Объект.РучьиПечатиИндиго) Тогда
		лРучьи = Объект.РучьиПечатиИндиго;
	Иначе
		лРучьи = ?(ЗначениеЗаполнено(Объект.РучьиПечати), Объект.РучьиПечати, Объект.Ручьи);
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ЭтикетокНаЛистеИндиго) Тогда
		лЭтикетокНаЛисте = Объект.ЭтикетокНаЛистеИндиго;
	Иначе
		лЭтикетокНаЛисте = ?(ЗначениеЗаполнено(Объект.ЭтикетокНаЛистеПечати), Объект.ЭтикетокНаЛистеПечати, Объект.ЭтикетокНаЛисте);
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 05.08.2021

	
	
	
	
	
	
	Объект.МонтажСхема.Очистить();
	Объект.МонтажСоответствия.Очистить();
	Тираж=Объект.Товары.итог("Количество");
	тираж_на_руч=Тираж/лРучьи;
	НомерТекущегоМонтажа=1;

	Отказ=Ложь;
	КоличествоСтрокМонтажа=Цел(лЭтикетокНаЛисте /лРучьи);
	Для каждого Товар Из Объект.Товары Цикл
		НовыйТовар= Объект.МонтажСоответствия.Добавить();
		НовыйТовар.Номенклатура= Товар.Номенклатура;
	КонецЦикла;
	Для Лист=1 По КоличествоСтрокМонтажа Цикл

		Ручей=0;
		Для каждого Товар Из Объект.Товары Цикл
			//ручьев_эт= Товар.Количество/тираж_на_руч;
			ручьев_эт= Окр(Товар.Количество/тираж_на_руч,2);
			Если  ручьев_эт-Цел(ручьев_эт)<>0  Тогда
				Сообщить("Количество ручьев рсчитано не првильно"); 
				Отказ=Истина;
			Иначе
				Если Не Отказ Тогда
					Для Сч=1  По ручьев_эт Цикл
						Ручей=Ручей+1;
						Индекс=Товар.ПолучитьИдентификатор()+1;

						ТекущийИндексСтроки = НомерТекущегоМонтажа*1000000 + Лист*1000 +Ручей;

						НовыйМС=Объект.МонтажСхема.Добавить();
						НовыйМС.ИндексСтроки=ТекущийИндексСтроки;
						НовыйМС.ИндексНоменклатуры=Индекс; 				 
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если Не Отказ Тогда
		Записать();
	КонецЕсли;


КонецПроцедуры

&НаСервере
&Вместо("ПроверитьЗаполнениеПроцентаЗаливкиИксПак")
Функция Лико_ПроверитьЗаполнениеПроцентаЗаливкиИксПак()
	НомераСтрок = Новый Массив;
	Для Каждого Цвет Из Объект.Цвета Цикл
		Если Не ЗначениеЗаполнено(Цвет.ПроцентЗаливки) И Цвет.ТипЦвета1 <> Справочники.Лико_ТипыЦвета.ЛакСплошной И Цвет.ТипЦвета1 <> Справочники.Лико_ТипыЦвета.Ламинирование Тогда
			НомераСтрок.Добавить(Цвет.НомерСтроки)			
		КонецЕсли;
	КонецЦикла;

	Если НомераСтрок.Количество() = 0 Тогда
		Возврат Неопределено
	Иначе
		Возврат НомераСтрок
	КонецЕсли;

КонецФункции

&Вместо("ПолучитьКоличествоЦветов")
Функция Лико_ПолучитьКоличествоЦветов(ВидСекции)
	КоличествоСекций = 0;
	Для каждого стр из Объект.Цвета Цикл
		Если стр.видсекции.видпечати = Видсекции И 	(стр.Цветоделение ИЛИ стр.перегравировка) Тогда 
			КоличествоСекций = КоличествоСекций +1;
		КонецЕсли;		
	КонецЦикла;
	Возврат КоличествоСекций;
КонецФункции


&НаКлиенте
&Вместо("ВыполнитьЦветоделение")
Процедура Лико_ВыполнитьЦветоделение()

	стр = Элементы.Цветоделение.ТекущиеДанные ;
	стр.ДатаЦветоделения = ТекущаяДата();
	стр.Цветоделитель =  Пользователь;
	стр.количествоНаименований 	 = ПолучитьКоличествоНаименований();
	стр.количествоЦветовОфсет 	 = ПолучитьКоличествоЦветов(ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Офсет"));
	стр.количествоЦветовФлексо 	 = ПолучитьКоличествоЦветов(ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Флексо"));
	стр.КоличествоЦветовИнкджет  = ПолучитьКоличествоЦветов(ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Инкджет"));
	стр.количествоЦветовГлубокая = ПолучитьКоличествоЦветов(ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Глубокая"));
	стр.количествоЦветовТрафарет = ПолучитьКоличествоЦветов(ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Трафарет"));
	стр.количествоЦветовЦифровая = ПолучитьКоличествоЦветов(ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Цифровая"));	

	стр.КоличествоКонгревов 	 = ПолучитьКоличествоРабот(ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Конгревы"));	
	стр.КоличествоТиснений 	 	 = ПолучитьКоличествоРабот(ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Тиснение"));	
	стр.Версия = Объект.Версия; 

	ЗаполнитьРЦВФормахНаСервере();

	Если Не Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда
		// <-- Начало Лико Яцун С. В.
		Переделка = Ложь;
		НайденныеСтроки = Объект.Цветоделение.НайтиСтроки(Новый Структура("КлючСтроки", Идентификатор));
		Для каждого Строка из НайденныеСтроки Цикл
			Если Строка.Переделка <> 0 Тогда
				Переделка = Истина;
			КонецЕсли;
		КонецЦикла;
		Если (Переделка = Истина И Объект.Цифровой) ИЛИ (Объект.Площадка = ГлЛико_Площадки.Ликофлекс И Объект.БезОМ) Тогда
			ПеренестиЗаказНаСервере( ПредопределенноеЗначение("Справочник.Лико_ЭтапыВыполненияЗаказа.Производство"));     
		Иначе
			// <-- Конец Лико Яцун С. В.	
			ПеренестиЗаказНаСервере( ПредопределенноеЗначение("Справочник.Лико_ЭтапыВыполненияЗаказа.Корректура"));     
		КонецЕсли;
	КонецЕсли;

	ЭтаФорма.Записать();

	// --> Начало Лико Ефимов ЕВВ 14.09.2021
	Если Элементы.Цветоделение.ТекущиеДанные.НеВыводитьФормы = Ложь Тогда
		СоздатьЗаявкиНаФормы(Объект.Ссылка, Идентификатор); 
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 14.09.2021

КонецПроцедуры


&НаКлиенте
Процедура Лико_ЦветоделениеВместо(Команда)
	Если Модифицированность Тогда
		Сообщить("Необходимо записать форму заявки");
		возврат;
	КонецЕсли; 
	
	Если СостояниеИсключения(объект.Состояние) Тогда  
		Сообщить("Заказ закрыт/аннулирован/заблокирован");
		возврат		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(Пользователь)  Тогда 
		Сообщить("Не заполнен пользователь");
		возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаУтвержденияЦветов) Тогда 
		Сообщить("Необходимо утвердить цвета");
		возврат;
	КонецЕсли;   

	// --> Начало Лико Ефимов ЕВВ 03.02.2025
	Если НЕ Элементы.ЦветоделениеПлощадкаВыводаФорм.ТолькоПросмотр // Линкс
		И НЕ ЗначениеЗаполнено(Элементы.Цветоделение.ТекущиеДанные.ПлощадкаВыводаФорм) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить площадку вывода форм",,,"Элементы.Цветоделение.ТекущиеДанные.ПлощадкаВыводаФорм");
		Возврат;
	КонецЕсли;   
	// <-- Конец Лико Ефимов ЕВВ 03.02.2025
	
	// <-- Начало Лико Яцун С. В. 21.08.2024 
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак ИЛИ Объект.Площадка = ГлЛико_Площадки.Ликофлекс Тогда
		ФормаНеСоответствуетЗаказу = Ложь;
		Для каждого Стр Из Объект.Цвета Цикл
			Если Стр.Цветоделение И ЗначениеРеквизита(Стр.Форма,"Заказ") <> Объект.Ссылка
				// --> Начало Лико Ефимов ЕВВ 13.09.2024
				// Аня сказала добавить исключения (письмо 13.09.24 11:47)
				И НЕ (Стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") 
					ИЛИ Стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЦифровоеТиснение"))
				// <-- Конец Лико Ефимов ЕВВ 13.09.2024
				И НЕ ((Стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Инкджет")  
						ИЛИ Стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЦифровойЛак")) 
					И ЗначениеРеквизита(Стр.РабочийЦентр,"ПорядковыйНомер") = 9) Тогда
				Сообщить("В строке " + Стр.НомерСтроки + " указано цветоделение, но форма не соответствует заказу. Создайте новые формы");
				ФормаНеСоответствуетЗаказу = Истина;
		    КонецЕсли;
		КонецЦикла;
		Если ФормаНеСоответствуетЗаказу Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 21.08.2024
	 
	//--> o.pukhova 08102020
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда
		НомераСтрок = ПроверитьЗаполнениеПроцентаЗаливкиИксПак();  //Есть отдельная Функция для всех ПроверитьЗаполнениеПроцентаЗаливки()
		Если НомераСтрок <> Неопределено Тогда
			Для каждого Ном Из НомераСтрок Цикл
				Сообщить("Не указан процент заливки в строке № " + Ном + ". Цветоделение не отмечено.");	
			КонецЦикла; 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//<-- o.pukhova 08102020   
	
	// <-- Начало Лико Яцун С. В. 27.06.2024 
	//ПорядковыйНомерРЦ = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(Объект.РабочийЦентр, "ПорядковыйНомер"); 
	
	ПорядковыйНомерРЦ = ЗначениеРеквизитСервер(Объект.РабочийЦентр, "ПорядковыйНомер");

	Если ПорядковыйНомерРЦ = 17 ИЛИ ПорядковыйНомерРЦ = 3 ИЛИ ПорядковыйНомерРЦ = 1 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросООтправкеПДФВНикка", ЭтотОбъект),"Отправили PDF в NIKKA?",РежимДиалогаВопрос.ДаНет);
		Возврат;
	ИначеЕсли ПорядковыйНомерРЦ = 9 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросООтправкеПДФВНикка", ЭтотОбъект),"Сохранили файлы в DFM?",РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 27.06.2024
	
	
	ВыполнитьЦветоделение();
	

КонецПроцедуры 


&НаСервере
Функция ЗначениеРеквизитСервер(ОбъектСсылка, РеквизитИмя) //+Лико m.shenderov 19.11.2025  
	УстановитьПривилегированныйРежим(Истина);
	Возврат Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектСсылка, РеквизитИмя);

КонецФункции  //-Лико m.shenderov 19.11.2025





