
//&Вместо("СписаниеВЗаказ")
//Функция Лико_СписаниеВЗаказ(Номенклатура)
//УстановитьПривилегированныйРежим(Истина);
//	СтатьяРасходов=Неопределено;	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Ссылка КАК Ссылка,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВерсияДанных КАК ВерсияДанных,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Код КАК Код,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Наименование КАК Наименование,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить КАК Выключить,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Организация КАК Организация,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Описание КАК Описание,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Предопределенный КАК Предопределенный,
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
//	|ИЗ
//	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры
//	|ГДЕ
//	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
//	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления
//	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить";
//	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл 		
//		ИспользоватьЭтоПравило=Истина;	
//		Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
//			Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
//				Структура = Новый Структура;
//				Структура.Вставить("Свойство",ДопРеквизит.Свойство);
//				Структура.Вставить("Значение",ДопРеквизит.Значение);
//				НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
//				ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
//					ИспользоватьЭтоПравило=Ложь;
//					Прервать;
//				ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
//					ИспользоватьЭтоПравило=Ложь; 
//					Прервать;				
//				КонецЕсли;				
//			КонецЕсли;
//		КонецЦикла; 
//		Если ИспользоватьЭтоПравило Тогда
//			Возврат Истина;
//		КонецЕсли;			
//		
//	КонецЦикла;
//	
//	Возврат Ложь ;

//КонецФункции

//&Вместо("ОпределитьПравило")
//Функция Лико_ОпределитьПравило(Номенклатура, ДокументРасхода)
//	УстановитьПривилегированныйРежим(Истина);
//	Если ДокументРасхода=Неопределено Тогда
//		ДокументРасхода=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
//	КонецЕсли;
//	СтатьяРасходов=Неопределено;	
//	Запрос = Новый Запрос;
//	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
//	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл 		
//		ИспользоватьЭтоПравило=Истина;	
//		Если Выборка.СложнаяНастройка Тогда 
//		ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Номенклатура,ДокументРасхода);		
//			
//		Иначе
//			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
//				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
//					Структура = Новый Структура;
//					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
//					Структура.Вставить("Значение",ДопРеквизит.Значение);
//					НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
//					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
//						ИспользоватьЭтоПравило=Ложь;
//						Прервать;
//					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
//						ИспользоватьЭтоПравило=Ложь; 
//						Прервать;				
//					КонецЕсли;				
//				КонецЕсли;
//			КонецЦикла; 
//		КонецЕсли;
//		
//		Если ИспользоватьЭтоПравило Тогда
//			Возврат Выборка.Ссылка;
//		КонецЕсли;			
//		
//	КонецЦикла;
//	

//КонецФункции

//&Вместо("ИспользоватьПравилоСКД")
//Функция Лико_ИспользоватьПравилоСКД(Выборка, Номенклатура,ДокументРасхода)
//	УстановитьПривилегированныйРежим(Истина);
//	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
//    СхемаКомпоновкиДанных = Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ПолучитьМакет("ОтборПоУсловию");
//	//URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
//   ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
//   ОтборНастройки.Инициализировать(ИсточникНастроек);
//   	ТекНастройки = Выборка.ОтборНастройки.Получить();
//	
//	Если ТекНастройки = Неопределено Тогда
//		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
//	Иначе
//		ОтборНастройки.ЗагрузитьНастройки(ТекНастройки);
//	КонецЕсли;
//	//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
//	Если Не ЗначениеЗаполнено(ДокументРасхода) Тогда
//		ДокументРасхода=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
//	КонецЕсли;
//	
//	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Номенклатура" , Номенклатура);
//	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "ДокументРасхода", ДокументРасхода);

//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
//	
//	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
//	
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

//	Если 	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).Количество()>0 Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли; 	
//КонецФункции
