#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция КодДляВыгрузки(ПризнакУчастникаСделки) Экспорт
	
	Если ПризнакУчастникаСделки = ОтсутствуетИнформация Тогда
		Возврат "0";
	ИначеЕсли ПризнакУчастникаСделки = Производитель Тогда
		Возврат "1";
	ИначеЕсли ПризнакУчастникаСделки = КонечныйОптовыйПокупатель Тогда
		Возврат "2";
	ИначеЕсли ПризнакУчастникаСделки = КонечныйРозничныйПокупатель Тогда
		Возврат "3";
	ИначеЕсли ПризнакУчастникаСделки = ТорговыйПосредник Тогда
		Возврат "4";
	Иначе
		Возврат "0";
	КонецЕсли;
	
КонецФункции

#КонецЕсли