
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Для каждого Спр Из Метаданные.Справочники Цикл
		
		СписокСправочников.Добавить(Спр.Имя,Спр.Синоним);
		
	КонецЦикла;
	
	
	Для каждого Док Из Метаданные.Документы Цикл
		
		СписокДокументов.Добавить(Док.Имя,Док.Синоним);
		
	КонецЦикла;
	СписокСправочников.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	СписокДокументов.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	Если Параметры.Свойство("Источник") Тогда
		Источник=Параметры.Источник;
		Если ТипЗнч(Источник)<>Тип("Неопределено") Тогда	
			Если ОбщегоНазначения.ЭтоСправочник(Источник.Метаданные()) Тогда
				Элементы.СписокСправочников.ТекущаяСтрока=СписокСправочников.Индекс(СписокСправочников.НайтиПоЗначению(Источник.Метаданные().Имя));
				//СписокСправочников.НайтиПоЗначению(Источник.Метаданные().Имя);
				Элементы.Объекты.ТекущаяСтраница=Элементы.Справочники;
			Иначе 			
				Элементы.СписокДокументов.ТекущаяСтрока=СписокДокументов.Индекс(СписокДокументов.НайтиПоЗначению(Источник.Метаданные().Имя));

				//СписокДокументов.НайтиПоЗначению(Источник.Метаданные().Имя);
				Элементы.Объекты.ТекущаяСтраница=Элементы.Документы;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Структура = Новый Структура;
	Структура.Вставить("Источник",ПредопределенноеЗначение("Документ."+СписокДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока).Значение+".ПустаяСсылка"));
	Структура.Вставить("ИмяИсточника",Строка(СписокДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока))); 	
	Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСправочниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	Структура = Новый Структура;
	Структура.Вставить("Источник",ПредопределенноеЗначение("Справочник."+СписокСправочников.НайтиПоИдентификатору(ВыбраннаяСтрока).Значение+".ПустаяСсылка"));
	Структура.Вставить("ИмяИсточника",Строка(СписокСправочников.НайтиПоИдентификатору(ВыбраннаяСтрока))); 	
	Закрыть(Структура);
	
	
КонецПроцедуры
