
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Структура = Новый Структура;
	Структура.Вставить("ПараметрКоманды",ПараметрКоманды);
	Структура.Вставить("ПараметрыВыполненияКоманды",ПараметрыВыполненияКоманды);
Режим = РежимДиалогаВопрос.ДаНет; 
Если ПараметрКоманды.Количество()>1 Тогда 
	Вопрос= "Закрыть заказы?";
Иначе
	Вопрос= "Закрыть заказ?";

КонецЕсли;


	ОписаниеОповещения=Новый ОписаниеОповещения("Лико_ЗакрытьЗаказЗавершение",ПараметрыВыполненияКоманды.Источник,Структура);
	ПоказатьВопрос(ОписаниеОповещения,Вопрос,Режим);
	//Для каждого ЗаказПоставщику Из ПараметрКоманды Цикл
	//	ЗакрытьЗаказНаСервере(ЗаказПоставщику);		
	//КонецЦикла;
	//
	////Попытка
	//Если ПараметрыВыполненияКоманды.Источник.ИмяФормы="Документ.ЗаказПоставщику.Форма.ФормаСпискаДокументов" Тогда
	//	ПараметрыВыполненияКоманды.Источник.Элементы.Список.Обновить();
	//	
	//ИначеЕсли ПараметрыВыполненияКоманды.Источник.ИмяФормы="Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
	//	Структура = Новый Структура;
	//	Структура.Вставить("Состояние");
	//	Для каждого ЗаказПоставщику Из ПараметрКоманды Цикл
	//		ОбновитьСостояниеСервер(ЗаказПоставщику,Структура);
	//	 ПараметрыВыполненияКоманды.Источник.Состояние=Структура.Состояние;	
	//	КонецЦикла;		
	//	
	//	//Исключение
	//	//ОписаниеОшибки()
	//	//КонецПопытки;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаказЗавершение(РезультатКоманды,ПараметрыКоманды) Экспорт //+Лико m.shenderov 22.05.2018
	    Если РезультатКоманды = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Для каждого ЗаказПоставщику Из ПараметрыКоманды.ПараметрКоманды Цикл
		ЗакрытьЗаказНаСервере(ЗаказПоставщику);		
	КонецЦикла;
	
	//Попытка
	Если ПараметрыКоманды.ПараметрыВыполненияКоманды.Источник.ИмяФормы="Документ.ЗаказПоставщику.Форма.ФормаСпискаДокументов" Тогда
		ПараметрыКоманды.ПараметрыВыполненияКоманды.Источник.Элементы.Список.Обновить();
		
	ИначеЕсли ПараметрыКоманды.ПараметрыВыполненияКоманды.Источник.ИмяФормы="Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Состояние");
		Для каждого ЗаказПоставщику Из ПараметрыКоманды.ПараметрКоманды Цикл
			ОбновитьСостояниеСервер(ЗаказПоставщику,Структура);
		 ПараметрыКоманды.ПараметрыВыполненияКоманды.Источник.Состояние=Структура.Состояние;	
		КонецЦикла;		
		
		//Исключение
		//ОписаниеОшибки()
		//КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 22.05.2018



&НаСервере
Процедура ЗакрытьЗаказНаСервере(ЗаказПоставщику) 

	Лико_Склады.ЗакрытьЗаказНаСервере(ЗаказПоставщику);
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьСостояниеСервер(ЗаказПоставщику, Форма)
	
	Документы.ЗаказПоставщику.РассчитатьСостояние(
	ЗаказПоставщику,
	ЗаказПоставщику.Договор,
	Форма);
	
КонецПроцедуры
