
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
КонецПроцедуры

Процедура ПередатьВЭксплуатацию(Отказ) //+Лико m.shenderov 31.10.2017
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	//|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	//|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	//|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	//|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	//|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
	//|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	//|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
	//|	ВЫБОР
	//|		КОГДА ТоварыНаСкладахОстатки.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.Пустаяссылка)
	//|			ТОГДА 0
	//|		ИНАЧЕ 8
	//|	КОНЕЦ КАК СтатусУказанияСерий
	//|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	//|			&Дата,
	//|			Номенклатура.ВидНоменклатуры.Лико_ТМЦ_ВЭксплуатации
	//|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	//Запрос.УстановитьПараметр("Дата",Месяц);
	//Запрос.УстановитьПараметр("Склад",Склад);
	//РезультатЗапроса = Запрос.Выполнить();

	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат;
	//КонецЕсли; 
	//ТЗ=РезультатЗапроса.Выгрузить();
	ДокументПередачаВЭксплуатацию=НайтиДокументПередачаВЭксплуатацию();
	//ДокументПередачаВЭксплуатацию=  Документы.ВнутреннееПотреблениеТоваров.СоздатьДокумент();
	
	//ДокументПередачаВЭксплуатацию.Серии.Очистить();
	
	//ЗаполнитьЗначенияСвойств(ДокументПередачаВЭксплуатацию,ЭтотОбъект,,"Ссылка,Дата,ХозяйственнаяОперация");
	ДокументПередачаВЭксплуатацию.Дата=Месяц-1;
	ДокументПередачаВЭксплуатацию.Организация=Организация;
	ДокументПередачаВЭксплуатацию.Подразделение=Подразделение;
	ДокументПередачаВЭксплуатацию.Склад=Склад;
	
	ДокументПередачаВЭксплуатацию.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию;
	//ДокументПередачаВЭксплуатацию.Товары.Загрузить(ТЗ);
	//ДокументПередачаВЭксплуатацию.Товары.Свернуть("Номенклатура,Характеристика,Упаковка,СтатусУказанияСерий","Количество,КоличествоУпаковок");
	//ОтборПоСерии = Новый Структура;
	//ОтборПоСерии.Вставить("СтатусУказанияСерий",8);
	//ТЗ_ТолькоСерии= Тз.НайтиСтроки(ОтборПоСерии);
	//Для каждого ТЗ_Серия Из ТЗ_ТолькоСерии Цикл
	//	НоаяСерия=ДокументПередачаВЭксплуатацию.Серии.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоаяСерия,ТЗ_Серия);		
	//КонецЦикла;
	
	
	
	ДокументПередачаВЭксплуатацию.Лико_Распоряжение=Ссылка;
	ДокументПередачаВЭксплуатацию.Лико_Помещение=Помещение;
	ДокументПередачаВЭксплуатацию.Подразделение=ПараметрыСеанса.ТекущийПользователь.Подразделение;
	ДокументПередачаВЭксплуатацию.Лико_ВидОперации=Перечисления.Лико_ВидыОпераций_Списание.ПередачаВЭксплуатацию;
	//Для каждого Товар Из ДокументПередачаВЭксплуатацию.Товары Цикл 		
	//	Товар.КатегорияЭксплуатации= Справочники.Лико_ПредопределенныеЗначения.КатегорияЭксплуатации.ЗначениеПараметра;	
	//	Товар.СтатьяРасходов= Товар.КатегорияЭксплуатации.СтатьяРасходов;
	//	Товар.ФизическоеЛицо=ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	//	Товар.Серия=Неопределено;		
	//КонецЦикла;
	
	Попытка
		ДокументПередачаВЭксплуатацию.Записать(РежимЗаписиДокумента.Запись); 		
	Исключение
		//Отказ = Истина;
		//ДокументПередачаВЭксплуатацию.Записать(РежимЗаписиДокумента.Запись);
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + ДокументПередачаВЭксплуатацию + """ не удалось провести! " + ОписаниеОшибки());		
	КонецПопытки;
	
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		НоваяЗапись= НаборЗаписей.Добавить();
		НоваяЗапись.Документ=Ссылка;
		НоваяЗапись.ТиповойДокумент=ДокументПередачаВЭксплуатацию.Ссылка;
		НоваяЗапись.НомерВЦепочке=1;
		НаборЗаписей.Записать(Истина);		
	КонецЕсли;
	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 31.10.2017

Функция НайтиДокументПередачаВЭксплуатацию () //+Лико m.shenderov 31.10.2017
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК ВнутреннееПотреблениеТоваров
	|ГДЕ
	|	ВнутреннееПотреблениеТоваров.Лико_Распоряжение = &Лико_Распоряжение";
	Запрос.УстановитьПараметр("Лико_Распоряжение",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() Тогда
		Возврат Документы.ВнутреннееПотребление.СоздатьДокумент();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат  Выборка.Ссылка.ПолучитьОбъект();
		КонецЦикла;
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 31.10.2017 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПередатьВЭксплуатацию(Отказ);
	//СписатьИзЭксплуатации(Отказ);
КонецПроцедуры

Функция НайтиДокументСписанияИзЭксплуатации () //+Лико m.shenderov 31.10.2017
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеИзЭксплуатации.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации КАК СписаниеИзЭксплуатации
	|ГДЕ
	|	СписаниеИзЭксплуатации.Лико_Распоряжение = &Лико_Распоряжение";
	Запрос.УстановитьПараметр("Лико_Распоряжение",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() Тогда
		Возврат Документы.СписаниеИзЭксплуатации.СоздатьДокумент();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат  Выборка.Ссылка.ПолучитьОбъект();
		КонецЦикла;
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 31.10.2017 

Процедура СписатьИзЭксплуатации(Отказ) //+Лико m.shenderov 31.10.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТМЦВЭксплуатацииОбороты.Номенклатура КАК Номенклатура,
	|	ТМЦВЭксплуатацииОбороты.Характеристика КАК Характеристика,
	|	ТМЦВЭксплуатацииОбороты.Партия КАК ПартияТМЦВЭксплуатации,
	|	ТМЦВЭксплуатацииОбороты.КоличествоОборот КАК Количество,
	|	ТМЦВЭксплуатацииОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов
	|ИЗ
	|	РегистрНакопления.ТМЦВЭксплуатации.Обороты(
	|			,
	|			&Дата,
	|			,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение) КАК ТМЦВЭксплуатацииОбороты
	|ГДЕ
	|	ТМЦВЭксплуатацииОбороты.КоличествоОборот > 0";
	Запрос.УстановитьПараметр("Дата",Месяц);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("АналитикаРасходов",Подразделение);
	КатегорияЭксплуатации= Справочники.Лико_ПредопределенныеЗначения.КатегорияЭксплуатации.ЗначениеПараметра;	
	Запрос.УстановитьПараметр("СтатьяРасходов",КатегорияЭксплуатации.СтатьяРасходов);


	

	РезультатЗапроса = Запрос.Выполнить();

	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ТЗ=РезультатЗапроса.Выгрузить();
	ДокументСписанияИзЭксплуатации=НайтиДокументСписанияИзЭксплуатации();
	//ДокументСписанияИзЭксплуатации=  Документы.СписаниеИзЭксплуатации.СоздатьДокумент();
	 
	
	//ЗаполнитьЗначенияСвойств(ДокументПередачаВЭксплуатацию,ЭтотОбъект,,"Ссылка,Дата,ХозяйственнаяОперация");
	ДокументСписанияИзЭксплуатации.Дата=КонецДня(Месяц);
	ДокументСписанияИзЭксплуатации.Организация=Организация;
	ДокументСписанияИзЭксплуатации.Подразделение=Подразделение;
	
	
	ДокументСписанияИзЭксплуатации.Товары.Загрузить(ТЗ);
	
		
	
	
	ДокументСписанияИзЭксплуатации.Лико_Распоряжение=Ссылка;
	
	
	Попытка
		ДокументСписанияИзЭксплуатации.Записать(РежимЗаписиДокумента.Проведение); 		
	Исключение
		//Отказ = Истина;
		ДокументСписанияИзЭксплуатации.Записать(РежимЗаписиДокумента.Запись);
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + ДокументСписанияИзЭксплуатации + """ не удалось провести! " + ОписаниеОшибки());		
	КонецПопытки;
	
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыСведений.Лико_СвязиСТиповымиДокументами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		НоваяЗапись= НаборЗаписей.Добавить();
		НоваяЗапись.Документ=Ссылка;
		НоваяЗапись.ТиповойДокумент=ДокументСписанияИзЭксплуатации.Ссылка;
		НоваяЗапись.НомерВЦепочке=1;
		НаборЗаписей.Записать(Истина);		
	КонецЕсли;
	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 31.10.2017

