
&Вместо("ЗаполнитьДокументНаСервере")
Процедура Лико_ЗаполнитьДокументНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПересчетТоваровТовары.Ссылка КАК Документ,
	|	ПересчетТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ПересчетТоваровТовары.Количество КАК Количество,
	|	ПересчетТоваровТовары.КоличествоФакт КАК КоличествоФакт,
	|	ПересчетТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПересчетТоваровТовары.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПересчетТоваровТовары.Упаковка КАК Упаковка,
	|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
	|	ПересчетТоваровТовары.Назначение КАК Назначение,
	|	ПересчетТоваровТовары.Ячейка КАК Ячейка,
	|	ПересчетТоваровТовары.ИзлишекПорча КАК ИзлишекПорча,
	|	ПересчетТоваровТовары.Серия КАК Серия,
	|	ПересчетТоваровТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ПересчетТоваровТовары.Лико_ЯчейкаФакт КАК Лико_ЯчейкаФакт,
	|	ПересчетТоваровТовары.BRC_ВидКонтактаСПищевойПродукцией КАК BRC_ВидКонтактаСПищевойПродукцией,
	|	ПересчетТоваровТовары.BRC_НомерПартииИзготовления КАК BRC_НомерПартииИзготовления,
	|	ПересчетТоваровТовары.BRC_УпотребитьДо КАК BRC_УпотребитьДо,
	|	ПересчетТоваровТовары.BRC_ДатаПроизводства КАК BRC_ДатаПроизводства,
	|	ПересчетТоваровТовары.Ссылка.Помещение КАК Помещение,
	|	ПересчетТоваровТовары.Ссылка.Ответственный КАК Ответственный,
	|	ПересчетТоваровТовары.КоличествоФакт - ПересчетТоваровТовары.Количество КАК Разница
	|ИЗ
	|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
	|ГДЕ
	|	НЕ ПересчетТоваровТовары.Ссылка.ПометкаУдаления
	|	И ПересчетТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПересчетТоваровТовары.Ссылка.Склад = &Склад
	|	И ПересчетТоваровТовары.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.ВнесениеРезультатов), ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.Выполнено))
	|	И НЕ ПересчетТоваровТовары.Ссылка.Лико_СкрытаяИнвентаризация
	|	И НЕ ПересчетТоваровТовары.Ссылка.Лико_КонтрольПриемки";
	Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания",Объект.ДатаОкончания ); 
	Запрос.УстановитьПараметр("Склад",Объект.Склад );

	Объект.ТоварыИвентаризаций.Загрузить(Запрос.Выполнить().Выгрузить());

	ТзДокументов =Объект.ТоварыИвентаризаций.Выгрузить();
	ТзДокументов.Свернуть("Документ,Серия","Разница");
	Для каждого Документ Из ТзДокументов Цикл
		Если Документ.Разница<>0 Тогда

			Документ.Разница=1;

		КонецЕсли;

	КонецЦикла;
	ТзДокументов.Свернуть("Документ","Разница");

	Объект.ПересчетыТоваров.Загрузить(ТзДокументов);
	ТЗПустыхЯчеек = Новый ТаблицаЗначений;
	ТЗПустыхЯчеек.Колонки.Добавить("Ячейка",Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));

	Для каждого СтрПересчетаТоваров  Из Объект.ПересчетыТоваров  Цикл
		ТЗ = Новый ТаблицаЗначений;
		Тз.Колонки.Добавить("ГруппаЯчейки",Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));
		ТоварПересчета = Объект.ТоварыИвентаризаций.НайтиСтроки(Новый Структура("Документ",СтрПересчетаТоваров.Документ)); 
		Для каждого Товар Из ТоварПересчета Цикл 

			Грурпа =Товар.Ячейка.Родитель.Родитель;
			ГруппаФакт = Товар.Лико_ЯчейкаФакт.Родитель.Родитель;

			Если ЗначениеЗаполнено(Грурпа) Тогда
				НоваяСтрТз = ТЗ.Добавить();
				НоваяСтрТз.ГруппаЯчейки=Грурпа;
			КонецЕсли;

			Если ЗначениеЗаполнено(ГруппаФакт) Тогда 
				НоваяСтрТз = ТЗ.Добавить();
				НоваяСтрТз.ГруппаЯчейки=ГруппаФакт;
			КонецЕсли;

		КонецЦикла;
		Тз.Свернуть("ГруппаЯчейки");
		МассивГрупп=Тз.ВыгрузитьКолонку("ГруппаЯчейки");

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СкладскиеЯчейки.Ссылка КАК Ячейка
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				&Период,
		|				Ячейка.Владелец = &Склад
		|					И Ячейка В ИЕРАРХИИ (&МассивГрупп)) КАК ТоварыВЯчейкахОстатки
		|		ПО (ТоварыВЯчейкахОстатки.Ячейка = СкладскиеЯчейки.Ссылка)
		|ГДЕ
		|	СкладскиеЯчейки.Владелец = &Склад
		|	И СкладскиеЯчейки.Лико_ТипСклада = &Лико_ТипСклада
		|	И СкладскиеЯчейки.Ссылка В ИЕРАРХИИ(&МассивГрупп)
		|	И ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
		|	И НЕ СкладскиеЯчейки.ПометкаУдаления";
		Запрос.УстановитьПараметр("Период",СтрПересчетаТоваров.Документ.Дата );
		Запрос.УстановитьПараметр("МассивГрупп",МассивГрупп);
		Запрос.УстановитьПараметр("Склад",Объект.Склад); 
		Запрос.УстановитьПараметр("Лико_ТипСклада",Перечисления.Лико_ТипСклада.СИМ);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл

			НоваяТзЯчейка = ТЗПустыхЯчеек.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяТзЯчейка,Выборка);

		КонецЦикла; 



	КонецЦикла;


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладскиеЯчейки.Ссылка КАК Ячейка,
	|	1 КАК Поле1
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(&ДатаНачала, Ячейка.Владелец = &Склад) КАК ТоварыВЯчейкахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Ячейка = СкладскиеЯчейки.Ссылка)
	|ГДЕ
	|	СкладскиеЯчейки.Владелец = &Склад
	|	И СкладскиеЯчейки.Лико_ТипСклада = &Лико_ТипСклада
	|	И ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
	|	И НЕ СкладскиеЯчейки.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладскиеЯчейки.Ссылка,
	|	1
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(&ДатаОкончания, Ячейка.Владелец = &Склад) КАК ТоварыВЯчейкахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Ячейка = СкладскиеЯчейки.Ссылка)
	|ГДЕ
	|	СкладскиеЯчейки.Владелец = &Склад
	|	И СкладскиеЯчейки.Лико_ТипСклада = &Лико_ТипСклада
	|	И ТоварыВЯчейкахОстатки.Номенклатура ЕСТЬ NULL
	|	И НЕ СкладскиеЯчейки.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.Ячейка КАК Ячейка,
	|	СУММА(Вт.Поле1) КАК Поле1
	|ПОМЕСТИТЬ Вт2
	|ИЗ
	|	Вт КАК Вт
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт2.Ячейка КАК Ячейка
	|ИЗ
	|	Вт2 КАК Вт2
	|ГДЕ
	|	Вт2.Поле1 = 2";
	Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания",Объект.ДатаОкончания ); 
	Запрос.УстановитьПараметр("Склад",Объект.Склад );
	Запрос.УстановитьПараметр("Лико_ТипСклада",Перечисления.Лико_ТипСклада.СИМ);


	Объект.ПустыеЯчейки.Загрузить(Запрос.Выполнить().Выгрузить());

    ТЗПустыхЯчеек.Свернуть("Ячейка");
	Для каждого СтрокаТЗ  Из ТЗПустыхЯчеек Цикл

		НоваяСтрока = Объект.ПустыеЯчейки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ); 

	КонецЦикла;



	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ячейка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	НЕ СкладскиеЯчейки.Ссылка В (&МассивПустыхЯчеек)
	|	И НЕ СкладскиеЯчейки.Ссылка В (&МассивЯчеекПлан)
	|	И НЕ СкладскиеЯчейки.Ссылка В (&МассивЯчеекФакт)
	|	И НЕ СкладскиеЯчейки.ЭтоГруппа
	|	И НЕ СкладскиеЯчейки.ПометкаУдаления
	|	И СкладскиеЯчейки.Лико_ТипСклада = &Лико_ТипСклада
	|	И СкладскиеЯчейки.Владелец = &Склад";
	Запрос.УстановитьПараметр("МассивПустыхЯчеек",Объект.ПустыеЯчейки.Выгрузить().ВыгрузитьКолонку("Ячейка")); 
	Запрос.УстановитьПараметр("МассивЯчеекПлан",Объект.ТоварыИвентаризаций.Выгрузить().ВыгрузитьКолонку("Ячейка")); 
	Запрос.УстановитьПараметр("МассивЯчеекФакт",Объект.ТоварыИвентаризаций.Выгрузить().ВыгрузитьКолонку("Лико_ЯчейкаФакт"));
	Запрос.УстановитьПараметр("Склад",Объект.Склад); 
	Запрос.УстановитьПараметр("Лико_ТипСклада",Перечисления.Лико_ТипСклада.СИМ);


	Объект.ЯчейкиБезПересчета.Загрузить(Запрос.Выполнить().Выгрузить());


	



	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваровТовары.Ссылка КАК Документ,
	|	Лико_ПередачаТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	Лико_ПередачаТоваровТовары.Номенклатура КАК Номенклатура,
	|	Лико_ПередачаТоваровТовары.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Лико_ПередачаТоваровТовары.Характеристика КАК Характеристика,
	|	Лико_ПередачаТоваровТовары.Упаковка КАК Упаковка,
	|	Лико_ПередачаТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Лико_ПередачаТоваровТовары.Количество КАК Количество,
	|	Лико_ПередачаТоваровТовары.Цена КАК Цена,
	|	Лико_ПередачаТоваровТовары.ВидЦеныПоставщика КАК ВидЦеныПоставщика,
	|	Лико_ПередачаТоваровТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	Лико_ПередачаТоваровТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	Лико_ПередачаТоваровТовары.Сумма КАК Сумма,
	|	Лико_ПередачаТоваровТовары.СтавкаНДС КАК СтавкаНДС,
	|	Лико_ПередачаТоваровТовары.СуммаНДС КАК СуммаНДС,
	|	Лико_ПередачаТоваровТовары.СуммаСНДС КАК СуммаСНДС,
	|	Лико_ПередачаТоваровТовары.СтатьяРасходов КАК СтатьяРасходов,
	|	Лико_ПередачаТоваровТовары.АналитикаРасходов КАК АналитикаРасходов,
	|	Лико_ПередачаТоваровТовары.КодСтроки КАК КодСтроки,
	|	Лико_ПередачаТоваровТовары.НомерГТД КАК НомерГТД,
	|	Лико_ПередачаТоваровТовары.Склад КАК Склад,
	|	Лико_ПередачаТоваровТовары.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Лико_ПередачаТоваровТовары.УдалитьНомерСтрокиДокументаПоставщика КАК УдалитьНомерСтрокиДокументаПоставщика,
	|	Лико_ПередачаТоваровТовары.Сертификат КАК Сертификат,
	|	Лико_ПередачаТоваровТовары.НомерПаспорта КАК НомерПаспорта,
	|	Лико_ПередачаТоваровТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	Лико_ПередачаТоваровТовары.Сделка КАК Сделка,
	|	Лико_ПередачаТоваровТовары.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	Лико_ПередачаТоваровТовары.СуммаНДСВзаиморасчетов КАК СуммаНДСВзаиморасчетов,
	|	Лико_ПередачаТоваровТовары.ВидЗапасов КАК ВидЗапасов,
	|	Лико_ПередачаТоваровТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Лико_ПередачаТоваровТовары.УдалитьАналитикаУчетаПартий КАК УдалитьАналитикаУчетаПартий,
	|	Лико_ПередачаТоваровТовары.Назначение КАК Назначение,
	|	Лико_ПередачаТоваровТовары.Серия КАК Серия,
	|	Лико_ПередачаТоваровТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Лико_ПередачаТоваровТовары.Подразделение КАК Подразделение,
	|	Лико_ПередачаТоваровТовары.СписатьНаРасходы КАК СписатьНаРасходы,
	|	Лико_ПередачаТоваровТовары.УпаковочныйЛист КАК УпаковочныйЛист,
	|	Лико_ПередачаТоваровТовары.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
	|	Лико_ПередачаТоваровТовары.АдресХранения КАК АдресХранения,
	|	Лико_ПередачаТоваровТовары.АдресХраненияНовый КАК АдресХраненияНовый,
	|	Лико_ПередачаТоваровТовары.СкладОтправитель КАК СкладОтправитель,
	|	Лико_ПередачаТоваровТовары.СкладПолучатель КАК СкладПолучатель,
	|	Лико_ПередачаТоваровТовары.Ссылка.Дата КАК Дата,
	|	Лико_ПередачаТоваровТовары.Ссылка.АвторДокумента КАК АвторДокумента
	|ИЗ
	|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
	|ГДЕ
	|	Лико_ПередачаТоваровТовары.Ссылка.Проведен
	|	И Лико_ПередачаТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Лико_ПередачаТоваровТовары.Ссылка.Склад = &Склад
	|	И Лико_ПередачаТоваровТовары.Ссылка.ПричинаСписания = &ПричинаСписания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ВозвратТоваровТовары.Ссылка,
	|	Лико_ВозвратТоваровТовары.НомерСтроки,
	|	Лико_ВозвратТоваровТовары.Номенклатура,
	|	Лико_ВозвратТоваровТовары.НоменклатураПоставщика,
	|	Лико_ВозвратТоваровТовары.Характеристика,
	|	Лико_ВозвратТоваровТовары.Упаковка,
	|	Лико_ВозвратТоваровТовары.КоличествоУпаковок,
	|	Лико_ВозвратТоваровТовары.Количество,
	|	Лико_ВозвратТоваровТовары.Цена,
	|	Лико_ВозвратТоваровТовары.ВидЦеныПоставщика,
	|	Лико_ВозвратТоваровТовары.ПроцентРучнойСкидки,
	|	Лико_ВозвратТоваровТовары.СуммаРучнойСкидки,
	|	Лико_ВозвратТоваровТовары.Сумма,
	|	Лико_ВозвратТоваровТовары.СтавкаНДС,
	|	Лико_ВозвратТоваровТовары.СуммаНДС,
	|	Лико_ВозвратТоваровТовары.СуммаСНДС,
	|	Лико_ВозвратТоваровТовары.СтатьяРасходов,
	|	Лико_ВозвратТоваровТовары.АналитикаРасходов,
	|	Лико_ВозвратТоваровТовары.КодСтроки,
	|	Лико_ВозвратТоваровТовары.НомерГТД,
	|	Лико_ВозвратТоваровТовары.Склад,
	|	Лико_ВозвратТоваровТовары.ЗаказПоставщику,
	|	Лико_ВозвратТоваровТовары.УдалитьНомерСтрокиДокументаПоставщика,
	|	Лико_ВозвратТоваровТовары.Сертификат,
	|	Лико_ВозвратТоваровТовары.НомерПаспорта,
	|	Лико_ВозвратТоваровТовары.СтатусУказанияСерий,
	|	Лико_ВозвратТоваровТовары.Сделка,
	|	Лико_ВозвратТоваровТовары.СуммаВзаиморасчетов,
	|	Лико_ВозвратТоваровТовары.СуммаНДСВзаиморасчетов,
	|	Лико_ВозвратТоваровТовары.ВидЗапасов,
	|	Лико_ВозвратТоваровТовары.ИдентификаторСтроки,
	|	Лико_ВозвратТоваровТовары.УдалитьАналитикаУчетаПартий,
	|	Лико_ВозвратТоваровТовары.Назначение,
	|	Лико_ВозвратТоваровТовары.Серия,
	|	Лико_ВозвратТоваровТовары.АналитикаУчетаНоменклатуры,
	|	Лико_ВозвратТоваровТовары.Подразделение,
	|	Лико_ВозвратТоваровТовары.СписатьНаРасходы,
	|	Лико_ВозвратТоваровТовары.УпаковочныйЛист,
	|	Лико_ВозвратТоваровТовары.УпаковочныйЛистРодитель,
	|	Лико_ВозвратТоваровТовары.АдресХранения,
	|	Лико_ВозвратТоваровТовары.АдресХраненияНовый,
	|	Лико_ВозвратТоваровТовары.СкладОтправитель,
	|	Лико_ВозвратТоваровТовары.СкладПолучатель,
	|	Лико_ВозвратТоваровТовары.Ссылка.Дата,
	|	Лико_ВозвратТоваровТовары.Ссылка.АвторДокумента
	|ИЗ
	|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
	|ГДЕ
	|	Лико_ВозвратТоваровТовары.Ссылка.Проведен
	|	И Лико_ВозвратТоваровТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Лико_ВозвратТоваровТовары.Ссылка.Склад = &Склад
	|	И Лико_ВозвратТоваровТовары.Ссылка.ПричинаПрихода = &ПричинаПрихода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ПричинаПрихода", Справочники.Лико_ПричиныПриходаПоАктуРазборки.ПриходИзлишкаИнвентаризации);
	Запрос.УстановитьПараметр("ПричинаСписания", Справочники.Лико_ПричиныСписания.СписаниеНедостачИнвентаризации);

	Объект.ТоварыПриходСписание.Загрузить( Запрос.Выполнить().Выгрузить());



КонецПроцедуры
