// Создает элемент справочника объекта номенклатуры и возвращает ссылку .
//
// Параметры: 
// СтруктураПараметров 			- Структура
// 				*Номенклатура    	-  СправочникСсылка.Номенклатура
// 				*Родитель        	-  СправочникСсылка.ЯССМ_ОбъектНоменклатуры  
// 				*Характеристика  	-  СправочникСсылка.ХарактеристикаНоменклатуры  
// 				*Нарезка         	-  СправочникСсылка.ЯССМ_Нарезки                 
// 				*Втулка          	-  СправочникСсылка.Лико_Втулка                  
// 				*Количество      	-  Число                                    
// 				*Упаковка       	-  СправочникСсылка.УпаковкиЕдиницыИзмерения
// 				*Уникальный     	-  Булево
// 				*Серия           	-  СправочникСсылка.Серия 
// 				*Рулонный           -  Булево 
// 				*НомерЗаказаКлиента -  Число 
// 				*НомерБланка        -  Число 
// 				*СерийныйНомер      -  Строка 
//              *Комментарий        -  Строка 
//              *Ответственный      -  СправочникСсылка.ФизическиеЛица. 
// Возвращаемое значение:  
//  СправочникСсылка - СправочникСсылка.ЯССМОбъектНоменклатуры
Функция СоздатьОбъектНоменклатуры(СтруктураПараметров) Экспорт
	//СтруктураПараметров = Новый Структура;

	//Номенклатура,Характеристика,Нарезка,Втулка,Количество,Упаковка,Уникальный=Ложь,Серия)
	Если СтруктураПараметров.Свойство("Серия") и 
		ЗначениеЗаполнено(СтруктураПараметров.Серия.ЯССМ_ОбъектНоменклатуры)
		И  СтруктураПараметров.Серия.ЯССМ_ОбъектНоменклатуры.Код<>0  Тогда
		ОбъектНоменклатуры=СтруктураПараметров.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект() ;
	Иначе 		
		ОбъектНоменклатуры =Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьЭлемент();
		Если СтруктураПараметров.Свойство("Организация") Тогда
			ОбъектНоменклатуры.Организация=СтруктураПараметров.Организация;		
		КонецЕсли;	
	КонецЕсли; 	

	Если СтруктураПараметров.Свойство("Номенклатура") Тогда
		ОбъектНоменклатуры.Номенклатура	=СтруктураПараметров.Номенклатура;
		ОбъектНоменклатуры.ЕдиницаИзмеренияУУ =СтруктураПараметров.Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("Родитель") Тогда
		ОбъектНоменклатуры.Родитель	=СтруктураПараметров.Родитель;		
	КонецЕсли;	
	Если СтруктураПараметров.Свойство("Характеристика") Тогда

		ОбъектНоменклатуры.Характеристика =СтруктураПараметров.Характеристика;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Нарезка") Тогда

		ОбъектНоменклатуры.Нарезка	=СтруктураПараметров.Нарезка;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Втулка") Тогда

		ОбъектНоменклатуры.Втулка	=СтруктураПараметров.Втулка;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Количество") Тогда

		ОбъектНоменклатуры.Количество	=СтруктураПараметров.Количество;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Упаковка") Тогда

		Если  НЕ  ЗначениеЗаполнено(ОбъектНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
			ОбъектНоменклатуры.БазоваяЕдиницаИзмерения	=СтруктураПараметров.Упаковка;
		КонецЕсли;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Уникальный") Тогда

		ОбъектНоменклатуры.Уникальный=СтруктураПараметров.Уникальный;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("Серия") Тогда

		ОбъектНоменклатуры.Серия=СтруктураПараметров.Серия;
	КонецЕсли; 

	Если СтруктураПараметров.Свойство("Комментарий") Тогда

		ОбъектНоменклатуры.Комментарий=СтруктураПараметров.Комментарий;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Ответственный") Тогда

		ОбъектНоменклатуры.Ответственный=СтруктураПараметров.Ответственный;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Рулонный") Тогда

		ОбъектНоменклатуры.Рулонный=СтруктураПараметров.Рулонный;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("ЗаказКлиента") Тогда

		ОбъектНоменклатуры.ЗаказКлиента= СтруктураПараметров.ЗаказКлиента;

	КонецЕсли;

	Если СтруктураПараметров.Свойство("НомерЗаказаКлиента") Тогда

		ОбъектНоменклатуры.НомерЗаказаКлиента=СтруктураПараметров.НомерЗаказаКлиента;
		НомерЗаказаСтрока=Формат(СтруктураПараметров.НомерЗаказаКлиента,"ЧЦ=7; ЧГ=");
		Если  Не ЗначениеЗаполнено(ОбъектНоменклатуры.ЗаказКлиента) Тогда
			ОбъектНоменклатуры.ЗаказКлиента=Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",НомерЗаказаСтрока);
		КонецЕсли;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("НомерБланка") Тогда

		ОбъектНоменклатуры.НомерБланка=СтруктураПараметров.НомерБланка;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("СерийныйНомер") Тогда 		
		ОбъектНоменклатуры.СерийныйНомер=СтруктураПараметров.СерийныйНомер;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("НомерСетки") Тогда 		
		ОбъектНоменклатуры.НомерСетки=СтруктураПараметров.НомерСетки;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("Z") Тогда 		
		ОбъектНоменклатуры.Z=СтруктураПараметров.Z;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("Тип") Тогда 		
		ОбъектНоменклатуры.Тип=СтруктураПараметров.Тип;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("ПроцентСетки") Тогда 		
		ОбъектНоменклатуры.ПроцентСетки=СтруктураПараметров.ПроцентСетки;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("ДлинаСетки") Тогда 		
		ОбъектНоменклатуры.ДлинаСетки=СтруктураПараметров.ДлинаСетки;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("УпотребитьДо") Тогда 		
		ОбъектНоменклатуры.УпотребитьДо=СтруктураПараметров.УпотребитьДо;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ДатаПроизводства") Тогда 		
		ОбъектНоменклатуры.ДатаПроизводства=СтруктураПараметров.ДатаПроизводства;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ВидКонтактаСПищевойПродукцией") Тогда 		
		ОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией=СтруктураПараметров.ВидКонтактаСПищевойПродукцией;
	КонецЕсли;

	Если СтруктураПараметров.Свойство("НомерПартииИзготовления") Тогда 		
		ОбъектНоменклатуры.НомерПартииИзготовления=СтруктураПараметров.НомерПартииИзготовления;
	КонецЕсли;   
	
	Если СтруктураПараметров.Свойство("ПричинаОтсутствияНомераПартииИзготовления") Тогда 		
		ОбъектНоменклатуры.ПричинаОтсутствияНомераПартииИзготовления=СтруктураПараметров.ПричинаОтсутствияНомераПартииИзготовления;
	КонецЕсли;   
	Если СтруктураПараметров.Свойство("ПричинаОтсутствияДатыИзготовления") Тогда 		
		ОбъектНоменклатуры.ПричинаОтсутствияДатыИзготовления=СтруктураПараметров.ПричинаОтсутствияДатыИзготовления;
	КонецЕсли; 
	// --> Начало Лико Ефимов ЕВВ
	Если СтруктураПараметров.Свойство("СтатусРоликаПослеПеремотки") Тогда 		
		ОбъектНоменклатуры.СтатусРоликаПослеПеремотки=СтруктураПараметров.СтатусРоликаПослеПеремотки;
	КонецЕсли;   
	Если СтруктураПараметров.Свойство("КоличествоВРоликеПослеПеремотки") Тогда 		
		ОбъектНоменклатуры.КоличествоВРоликеПослеПеремотки=СтруктураПараметров.КоличествоВРоликеПослеПеремотки;
	КонецЕсли; 
	Если СтруктураПараметров.Свойство("НомерСтрокиЗаказаВРоликеПослеПеремотки") Тогда 		
		ОбъектНоменклатуры.НомерСтрокиЗаказаВРоликеПослеПеремотки=СтруктураПараметров.НомерСтрокиЗаказаВРоликеПослеПеремотки;
	КонецЕсли; 
	Если СтруктураПараметров.Свойство("РабочийЦентрВыпускаВРоликеПослеПеремотки") Тогда 		
		ОбъектНоменклатуры.РабочийЦентрВыпускаВРоликеПослеПеремотки=СтруктураПараметров.РабочийЦентрВыпускаВРоликеПослеПеремотки;
	КонецЕсли; 
	Если СтруктураПараметров.Свойство("СоставРоликаПослеПеремотки") Тогда
		Для каждого ЭлементМассива из СтруктураПараметров.СоставРоликаПослеПеремотки Цикл 
			ЗаполнитьЗначенияСвойств(ОбъектНоменклатуры.СоставРоликаПослеПеремотки.Добавить(), ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("СтруктураРастарки") И СтруктураПараметров.СтруктураРастарки <> Неопределено Тогда
		ОбъектНоменклатуры.РаспоряжениеНаРастарку = СтруктураПараметров.СтруктураРастарки.Документ;	
		ОбъектНоменклатуры.НомерЦепочкиВРаспоряженииНаРастарку = СтруктураПараметров.СтруктураРастарки.НомерЦепочки;	
		ОбъектНоменклатуры.НомерСтрокиВРаспоряженииНаРастарку = СтруктураПараметров.СтруктураРастарки.НомерСтроки;
	КонецЕсли; 
	Если СтруктураПараметров.Свойство("РодительОбъектаНоменклатуры") Тогда
		ОбъектНоменклатуры.РодительОбъектаНоменклатуры = СтруктураПараметров.РодительОбъектаНоменклатуры;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Длина") Тогда
		ОбъектНоменклатуры.Длина = СтруктураПараметров.Длина;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Ширина") Тогда
		ОбъектНоменклатуры.Ширина = СтруктураПараметров.Ширина;
	КонецЕсли;
    // <-- Конец Лико Ефимов ЕВВ
	
	Если   Не ОбъектНоменклатуры.Уникальный Тогда  		
		НеУникальныйОбъектНоменклатуры=НайтиНеУникальныйОбъектНоменклатуры(ОбъектНоменклатуры.Номенклатура,ОбъектНоменклатуры.Характеристика);
		Если ЗначениеЗаполнено(НеУникальныйОбъектНоменклатуры) Тогда
			Возврат НеУникальныйОбъектНоменклатуры;			
		КонецЕсли;
	КонецЕсли;	

	УстановитьПривилегированныйРежим(Истина); 	

	ОбъектНоменклатуры.Записать();
	Если ОбъектНоменклатуры.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		Если ОбъектНоменклатуры.Характеристика.Владелец<>ОбъектНоменклатуры.Номенклатура Тогда
			ОбъектНоменклатуры.Характеристика=ХарактеристикаНП(ОбъектНоменклатуры.Номенклатура);
		КонецЕсли; 		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры.Серия)и  ОбъектНоменклатуры.Уникальный  Тогда 		
		НоваяСерия=Справочники.СерииНоменклатуры.СоздатьЭлемент();
		НоваяСерия.ЯССМ_ОбъектНоменклатуры =ОбъектНоменклатуры.Ссылка;
		НоваяСерия.ВидНоменклатуры=ОбъектНоменклатуры.Номенклатура.ВидНоменклатуры;
		НоваяСерия.Наименование=ОбъектНоменклатуры.Наименование; 
		НоваяСерия.Записать();
		ОбъектНоменклатуры.Серия=НоваяСерия.Ссылка;
		ОбъектНоменклатуры.Записать();		
	КонецЕсли;

	Если  ЗначениеЗаполнено(ОбъектНоменклатуры.Серия) И
		ОбъектНоменклатуры.Серия.Наименование<>ОбъектНоменклатуры.Наименование Тогда
		СерияОбъект=ОбъектНоменклатуры.Серия.ПолучитьОбъект();
		СерияОбъект.ЯССМ_ОбъектНоменклатуры=ОбъектНоменклатуры.Ссылка;
		СерияОбъект.Записать();
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);


	Возврат ОбъектНоменклатуры.Ссылка; 

КонецФункции

// Функция получает 30-значный штрихкод Объекта номенклатуры
// управл.символ	вид информации		код номенклатуры     нарезка     количество     код элемента спр.  серийный номер     контр.символ
//      6                01                 1234567            123         1234             1234567            12345               N
Функция ПолучитьШтрихКод(Ссылка,ШКСтрокой="", лКоличество=0) Экспорт
	Перем ШК;
	Перем КодНоменклатуры7; // 7 символов справа
	ЭтотОбъект=Ссылка;	
	
	КодНоменклатуры7 = Прав(ЭтотОбъект.Номенклатура.Код, 7);
	
	ВидИнформации = ?(Ссылка.Уникальный, 1, 2);
	
	//=--------- ШК с пробелами и без -----
	// так было
	//ШК = "6"+ Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0")
	//		+ Формат(КодНоменклатуры7, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0")   // 7 правых символов кода номенклатуры
	//		+ Формат(ЭтотОбъект.Нарезка.Размер, "ЧЦ=3; ЧН=000; ЧВН=; ЧГ=0") // 3 символа нарезки
	//		+ Формат(ЭтотОбъект.Количество, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=0") // 4 символа количества в поставке (вес банки, количество пог.метров)
	//		
	//		//+ Формат(ЭтотОбъект.НомерПоставки, "ЧЦ=12; ЧН=000000000000; ЧВН=; ЧГ=0"); // 12 символов серийного номера
	//		+ Формат(ЭтотОбъект.Код, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0") // 7 символов код объекта номенклатуры
	//		+ Формат(ЭтотОбъект.НомерПоставки, "ЧЦ=5; ЧН=00000; ЧВН=; ЧГ=0"); // 5 символов серийного номера
	//		//+ Формат(ЭтотОбъект.Код,"ЧЦ="+ЭтотОбъект.Метаданные().ДлинаКода+"; ЧВН=; ЧГ=0");
	// так есть
	
	КоличествоВШтрихКоде = ?(лКоличество=0, ЭтотОбъект.Количество, лКоличество);
	
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	ФКодНоменклатуры7 = Формат(КодНоменклатуры7, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0");   // 7 правых символов кода номенклатуры
	ФНарезка = Формат(ЭтотОбъект.Нарезка.Размер, "ЧЦ=3; ЧН=000; ЧВН=; ЧГ=0"); // 3 символа нарезки
	ФКоличество = Формат(КоличествоВШтрихКоде, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=0"); // 4 символа количества в поставке (вес банки, количество пог.метров)Формат(ЭтотОбъект.Количество, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=0") // 4 символа количества в поставке (вес банки, количество пог.метров)
	ФКод = Формат(ЭтотОбъект.Код, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0"); // 7 символов код объекта номенклатуры
	ФНомерПоставки = Формат(ЭтотОбъект.НомерПоставки, "ЧЦ=5; ЧН=00000; ЧВН=; ЧГ=0"); // 5 символов серийного номера
	
	Разделитель = " ";
	
	ШК = "6"+ ФВидИнформации
	+ ФКодНоменклатуры7
	+ ФНарезка
	+ ФКоличество
	+ ФКод
	+ ФНомерПоставки;
	
	ШКСтрокой = "6"+ ФВидИнформации + Разделитель
	+ ФКодНоменклатуры7 + Разделитель
	+ ФНарезка + Разделитель
	+ ФКоличество + Разделитель
	+ ФКод + Разделитель
	+ ФНомерПоставки;
	
	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШК = ШК + КонтольныйСимвол;
	ШКСтрокой = ШКСтрокой + Разделитель + КонтольныйСимвол;
	
	Возврат ШК;
КонецФункции //ПолучитьШтрихКод Экспорт

// Функция получает 15-значный штрихкод Объекта номенклатуры
// управл.символ	вид информации		количество     код элемента спр.  контр.символ
//      6                05                 1234           1234567             N
Функция ПолучитьКороткийШтрихКод(Ссылка,ШКСтрокой="", лКоличество=0) Экспорт
	
	Перем ШК;
	Перем КодНоменклатуры7; // 7 символов справа
	ЭтотОбъект=Ссылка;	
	ВидИнформации = 5;
	
	КоличествоВШтрихКоде = ?(лКоличество=0, ЭтотОбъект.Количество, лКоличество);
	
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	ФКоличество = Формат(КоличествоВШтрихКоде, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=0"); // 4 символа количества в поставке (вес банки, количество пог.метров)Формат(ЭтотОбъект.Количество, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=0") // 4 символа количества в поставке (вес банки, количество пог.метров)
	ФКод = Формат(ЭтотОбъект.Код, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0"); // 7 символов код объекта номенклатуры
	
	Разделитель = " ";
	
	ШК = "6"+ ФВидИнформации
	+ ФКоличество
	+ ФКод;
	
	ШКСтрокой = "6"+ ФВидИнформации + Разделитель
	+ ФКоличество + Разделитель
	+ ФКод;
	
	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШК = ШК + КонтольныйСимвол;
	ШКСтрокой = ШКСтрокой + Разделитель + КонтольныйСимвол;
	
	Возврат ШК;
КонецФункции //ПолучитьКороткийШтрихКод Экспорт

#Если Клиент Тогда
	
Процедура ПечатьСкладскойКарточки(КоличествоЭкземпляров=1, СразуНаПринтер=Ложь) Экспорт 
		
		//ЯССМ_Печать.ПечатьСкладскойКарточкиОбъектаНоменклатуры(Ссылка, КоличествоЭкземпляров, СразуНаПринтер);
		
	КонецПроцедуры
	
#КонецЕсли

//Заполняет Коллекция по найденым штрихкодам
// Описание:
//
//
// Параметры Коллекция -Коллекция-
// Параметры ШтрихКоды -Массив- 
//
Процедура ЗаполнениеКоллекциюПоШтрихКоду(Коллекция,ШтрихКоды) Экспорт
	
	
	
	МассивКодов = Новый Массив();
	
	
	
	Для каждого ШК Из ШтрихКоды Цикл
		
		Результат=Лико_Дополнительно.РасшифроватьШК(ШК);
		
		Если Не ЗначениеЗаполнено(Результат.Ошибка) и
			Результат.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий Тогда	
			МассивКодов.Добавить(Число(Сред(ШК, 8, 7)));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Результат.Ошибка) и
			Результат.ВидШК=Перечисления.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры Тогда	
			МассивКодов.Добавить(Число(Сред(ШК, 18, 7)));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивКодов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура,
	|	ЯССМ_ОбъектыНоменклатуры.Количество,
	|	ЯССМ_ОбъектыНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	ЯССМ_ОбъектыНоменклатуры.ЕдиницаИзмеренияУУ КАК ЕдиницаИзмерения,
	|	ЯССМ_ОбъектыНоменклатуры.Серия,
	|	ЯССМ_ОбъектыНоменклатуры.Характеристика,
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЯССМ_ОбъектыНоменклатуры.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ХарактеристикиИспользуются,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)) КАК ВариантРасчетаЦеныНабора,
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ЯССМ_ОбъектыНоменклатуры.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
	|			И ЯССМ_ОбъектыНоменклатуры.Характеристика = ВариантыКомплектацииНоменклатуры.Характеристика
	|			И (ВариантыКомплектацииНоменклатуры.Основной)
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Код В(&Коды)";
	Запрос.УстановитьПараметр("Коды",МассивКодов );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекДанные = Коллекция[ВРег(СокрЛП(ПолучитьКороткийШтрихКод(Выборка.Ссылка)))];
		Если ТекДанные=Неопределено Тогда
			ТекДанные = Коллекция[ВРег(СокрЛП(ПолучитьШтрихКод(Выборка.Ссылка)))];
			
		КонецЕсли;
		Если ТекДанные=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекДанные.Номенклатура                    = Выборка.Номенклатура;
		ТекДанные.ТипНоменклатуры                 = Выборка.ТипНоменклатуры;
		ТекДанные.Характеристика                  = Выборка.Характеристика;
		ТекДанные.Упаковка                        = Выборка.Упаковка; 		
		Если ТипЗнч(ТекДанные)=Тип("Структура") И Не ТекДанные.Свойство("Серия") Тогда
			
			ТекДанные.Вставить("Серия",Выборка.Серия);
			
		КонецЕсли;
		
		ТекДанные.Серия                     	  = Выборка.Серия;
		
		ТекДанные.КоличествоУпаковок              = Выборка.Количество;
		//ТекДанные.ПодакцизныйТовар                = Выборка.ПодакцизныйТовар;
		//ТекДанные.МаркируемаяАлкогольнаяПродукция = Выборка.МаркируемаяАлкогольнаяПродукция;
		ТекДанные.ХарактеристикиИспользуются      = Выборка.ХарактеристикиИспользуются;
		ТекДанные.Коэффициент                     = Выборка.Упаковка.Числитель;
		ТекДанные.ЕдиницаИзмерения                = Выборка.ЕдиницаИзмерения;
		//ТекДанные.ЕдиничнаяУпаковка               = ?(Выборка.КоличествоЕдиничныхУпаковок = 1 И Выборка.Коэффициент = 1,
		//Выборка.ЕдиничнаяУпаковка,
		//Неопределено);
		//ТекДанные.НесколькоЕдиничныхУпаковок      = ?(Выборка.КоличествоЕдиничныхУпаковок > 1, Истина, Ложь);
		ТекДанные.НесколькоЕдиничныхУпаковок      = Ложь;
		
		ТекДанные.НеизвестныйШтрихкод             = Ложь;
		ТекДанные.ВариантРасчетаЦеныНабора        = Выборка.ВариантРасчетаЦеныНабора;
		
		
	КонецЦикла; 
	
	
	
	
КонецПроцедуры //ЗаполнениеКоллекцииПоШтрихКоду


Функция НайтиНеУникальныйОбъектНоменклатуры(Номенклатура,Знач Характеристика=Неопределено);
	Характеристика=?(Характеристика=Неопределено,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),Характеристика);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ ЯССМ_ОбъектыНоменклатуры.Уникальный
	|	И НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления
	|	И ЯССМ_ОбъектыНоменклатуры.Характеристика = &Характеристика";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",Характеристика);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	Возврат Неопределено;
	
	
КонецФункции //-Лико m.shenderov 14.12.2017 


Функция ХарактеристикаНП(Номенклатура) //+Лико m.shenderov 10.09.2018
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Номенклатура);
	РезультатЗапроса2 = Запрос.Выполнить();
	Выборка2 = РезультатЗапроса2.Выбрать();
	
	Пока Выборка2.Следующий() Цикл  						
		Возврат Выборка2.Характеристика;			 
	КонецЦикла;
	
	
	ХарактеристикаНезавершенкаОбъект=Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	ХарактеристикаНезавершенкаОбъект.Владелец=Номенклатура;
	ХарактеристикаНезавершенкаОбъект.Лико_ЗаказНоменклатуры=НайтиЗаказ(Номенклатура.Наименование);
	ХарактеристикаНезавершенкаОбъект.Записать();
	Возврат ХарактеристикаНезавершенкаОбъект.Ссылка;  		
	
	
КонецФункции //-Лико m.shenderov 10.09.2018 


Функция НайтиЗаказ(Наименование) //+Лико m.shenderov 06.02.2018
	Заказ=Неопределено;
	НомерСимвола=0;
	Для н=1 По СтрДлина(Наименование) Цикл
		
		Если  Сред(Наименование,н,1)="№" Тогда
			НомерСимвола=н; 
			Прервать;
		КонецЕсли;
		
		
		
		
	КонецЦикла;	
	
	Если НомерСимвола<>0 Тогда
		НомерЗаказа=Сред(Наименование,НомерСимвола+1,7);
		Заказ=Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",НомерЗаказа);
		
	КонецЕсли;
	
	Возврат Заказ;
	
	
КонецФункции //-Лико m.shenderov 06.02.2018 


#Область Определение_Заказа_Клиента


Функция ОпределеитьДокументЗакрытияБланкаСНомеромЗаказа(Серия) Экспорт //+Лико m.shenderov 27/10/2019
	Если  ЗначениеЗаполнено(Серия) ТОгда
		
		
	Запрос=СформироватьЗапрос(Серия);
		Документ=ПолучитьДокумент(Запрос);
		
		Если ТипЗнч(Документ)=Тип("ДокументСсылка.Лико_БланкЭтапа")  Тогда
			
			Если ЗначениеЗаполнено(Документ.ЗаказПокупателя) Тогда
				Возврат Документ;
			Иначе
				НоваяСерия=ПолучитьСериюРодителяСерии(Документ);
				Возврат ОпределеитьДокументЗакрытияБланкаСНомеромЗаказа(НоваяСерия);
			КонецЕсли;
			
			
			
		КонецЕсли;	
	КонецЕсли;
	
		Возврат Документы.Лико_БланкЭтапа.ПустаяСсылка();

КонецФункции  //-Лико m.shenderov 27/10/2019

Функция СформироватьЗапрос(Серия) //+Лико m.shenderov 27/10/2019
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыВЯчейках.Регистратор КАК Регистратор,
	|	ТоварыВЯчейках.Регистратор.НомерЗаказа КАК РегистраторНомерЗаказа,
	|	ТоварыВЯчейках.Регистратор.ЗаказПокупателя КАК РегистраторЗаказПокупателя,
	|	ТоварыВЯчейках.Регистратор.НомерБланка КАК РегистраторНомерБланка
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|ГДЕ
	|	ТоварыВЯчейках.Серия = &Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	Запрос.УстановитьПараметр("Серия",Серия );
	
	Возврат Запрос;
КонецФункции //-Лико m.shenderov 27/10/2019 

Функция ПолучитьДокумент(Запрос) //+Лико m.shenderov 27/10/2019

РезультатЗапроса=Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
	
	Возврат Выборка.Регистратор;

КонецЦикла; 
	
КонецФункции //-Лико m.shenderov 27/10/2019 

Функция ПолучитьСериюРодителяСерии(Документ) //+Лико m.shenderov 27/10/2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Серия КАК Серия
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.Списать";
	Запрос.УстановитьПараметр("Ссылка",Документ );
	РезультатЗапроса = Запрос.Выполнить();
	 Выборка = РезультатЗапроса.Выбрать();
	 Пока Выборка.Следующий() Цикл
	       Возврат Выборка.Серия;
	 КонецЦикла; 
		
КонецФункции //-Лико m.shenderov 27/10/2019 


#КонецОбласти

Процедура УстановитьСрокГодности(ОбъектНоменклатуры,Дата) Экспорт
УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Дата) Тогда
		ОбъектОбъектНоменклатуры=ОбъектНоменклатуры.ПолучитьОбъект();
		ОбъектОбъектНоменклатуры.УпотребитьДо=Дата;
		ОбъектОбъектНоменклатуры.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьДатуПроизводства(ОбъектНоменклатуры,Дата) Экспорт
УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Дата) Тогда
		ОбъектОбъектНоменклатуры=ОбъектНоменклатуры.ПолучитьОбъект();
		ОбъектОбъектНоменклатуры.ДатаПроизводства=Дата;
		ОбъектОбъектНоменклатуры.Записать();
	КонецЕсли;
КонецПроцедуры


Процедура УстановитьПартнера(ОбъектыНоменклатуры) Экспорт //+Лико m.shenderov 09.01.2023
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_РезервСерийСрезПоследних.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_РезервСерийСрезПоследних.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВтПартнер
	|ИЗ
	|	РегистрСведений.Лико_РезервСерий.СрезПоследних(, ОбъектНоменклатуры В (&ОбъектыНоменклатуры)) КАК Лико_РезервСерийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтОбъектыНоменклатуры
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка В(&ОбъектыНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыНоменклатуры.Ссылка КАК ОбъектНоменклатуры,
	|	ЕСТЬNULL(ВтПартнер.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.Пустаяссылка)) КАК Партнер,
	|	ВтОбъектыНоменклатуры.Ссылка.Партнер КАК СсылкаПартнер
	|ИЗ
	|	ВтОбъектыНоменклатуры КАК ВтОбъектыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПартнер КАК ВтПартнер
	|		ПО ВтОбъектыНоменклатуры.Ссылка = ВтПартнер.ОбъектНоменклатуры
	|ГДЕ
	|	ВтОбъектыНоменклатуры.Ссылка.Партнер <> ЕСТЬNULL(ВтПартнер.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.Пустаяссылка))";
	Запрос.УстановитьПараметр("ОбъектыНоменклатуры",ОбъектыНоменклатуры );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Результатзапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект			             	=	Выборка.ОбъектНоменклатуры.ПолучитьОбъект();		
	    СпрОбъект.ОбменДанными.Загрузка  	=	Истина;		
		СпрОбъект.Партнер					=	Выборка.Партнер;
		СпрОбъект.Записать();
	
	КонецЦикла; 
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 09.01.2023

Процедура УстановитьРезерв(ОбъектыНоменклатуры) Экспорт 
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		УстановитьПартнера(ОбъектыНоменклатуры);
		
		Возврат;

				
	КонецЕсли;


	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_РезервСерийСрезПоследних.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_РезервСерийСрезПоследних.Партнер КАК Партнер,
	|	Лико_РезервСерийСрезПоследних.Резерв КАК Резерв
	|ПОМЕСТИТЬ ВтПартнер
	|ИЗ
	|	РегистрСведений.Лико_РезервСерий.СрезПоследних(, ОбъектНоменклатуры В (&ОбъектыНоменклатуры)) КАК Лико_РезервСерийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтОбъектыНоменклатуры
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка В(&ОбъектыНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыНоменклатуры.Ссылка КАК ОбъектНоменклатуры,
	|	ЕСТЬNULL(ВтПартнер.Резерв, ЗНАЧЕНИЕ(Справочник.Партнеры.Пустаяссылка)) КАК Резерв,
	|	ВтОбъектыНоменклатуры.Ссылка.Партнер КАК СсылкаПартнер,
	|	ВтОбъектыНоменклатуры.Ссылка.Резерв КАК СсылкаРезерв
	|ИЗ
	|	ВтОбъектыНоменклатуры КАК ВтОбъектыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПартнер КАК ВтПартнер
	|		ПО ВтОбъектыНоменклатуры.Ссылка = ВтПартнер.ОбъектНоменклатуры
	|ГДЕ
	|	ВтОбъектыНоменклатуры.Ссылка.Резерв <> ЕСТЬNULL(ВтПартнер.Резерв, ЗНАЧЕНИЕ(Справочник.Партнеры.Пустаяссылка))";
	Запрос.УстановитьПараметр("ОбъектыНоменклатуры",ОбъектыНоменклатуры );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Результатзапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект			             	=	Выборка.ОбъектНоменклатуры.ПолучитьОбъект();		
	    СпрОбъект.ОбменДанными.Загрузка  	=	Истина;		
		СпрОбъект.Резерв					=	Выборка.Резерв;
		СпрОбъект.Партнер					=	Выборка.Резерв;
		СпрОбъект.Записать();
	
	КонецЦикла; 
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 09.01.2023

