// Определяет запросом последний порядковый номер для данной номенклатуры
Функция ОпределитьПоследнийНомерПоставкиДляНоменклатуры(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ЯССМ_ОбъектыНоменклатуры.НомерПоставки) КАК НомерПоставки
	               |ИЗ
	               |	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	               |ГДЕ
	               |	ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
	               |	И НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления";
	Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультата = РезультатЗапроса.Выбрать();
		ВыборкаРезультата.Следующий();
		
		Если ВыборкаРезультата.НомерПоставки=NULL Тогда
			Возврат 0; // первый объект данной номенклатуры
		Иначе
			Возврат ВыборкаРезультата.НомерПоставки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //ОпределитьПоследнийНомерПоставкиДляНоменклатуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ДатаФормирования = Дата(1,1,1);
	ЭтотОбъект.НомерПоставки = 0;
	ЭтотОбъект.ШК_SQL_Pack = "";  
	
	ДатаПроизводства2			=	Неопределено;
	НомерПартииИзготовления2	=	Неопределено;
	
КонецПроцедуры

// Формирует наименование объекта как номенклатура + нарезка + втулка + номер поставки
Процедура СформироватьНаименованиеОбъекта() Экспорт
	
	НовоеНаименование = СокрЛП(Номенклатура.Наименование)
	+ ?(ЗначениеЗаполнено(Номенклатура.Артикул), ", ("+Номенклатура.Артикул+")", "")
	// {{ DGavrilov 20150930
	//+ ?(ЗначениеЗаполнено(НомерБланка), ", бл."+НомерБланка, "")
	+ ?(Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыПолуфабрикат.ЗначениеПараметра,
	?(ЗначениеЗаполнено(НомерБланка), ", бл."+НомерБланка, ""),
	"")
	// }} DGavrilov 20150930
	+ ?(ЗначениеЗаполнено(Нарезка), ", Ø"+Нарезка+" ", "")
	+ ?(ЗначениеЗаполнено(Втулка), ?(ЗначениеЗаполнено(Нарезка), "", ", ")+"("+Втулка+")", "")
	+ ?(СокрЛП(Комментарий)="", "", ", " + СокрЛП(Комментарий))
	// --> Начало Лико Ефимов ЕВВ 03.03.2026 
	//+ ?(Уникальный И Количество<>0, ", "+Количество+" "+БазоваяЕдиницаИзмерения, "")
	// Если заполнена Длина, то выведем размер остатка
	+ ?(ЗначениеЗаполнено(Длина) И ЗначениеЗаполнено(Ширина), ", " + БазоваяЕдиницаИзмерения + " " + Длина + "см*" + Ширина + "см",
	// иначе оставим как было
	?(Уникальный И Количество<>0, ", "+Количество+" "+БазоваяЕдиницаИзмерения, ""))
	// <-- Конец Лико Ефимов ЕВВ 03.03.2026
	+ ?(НомерПоставки=0, "", ", #"+Формат(НомерПоставки, "ЧГ=0"))
	// --> Начало Лико Ефимов ЕВВ 06.04.2026
	// Добавлю уникальный номер родителя
	+ ?(ЗначениеЗаполнено(РодительОбъектаНоменклатуры), " (из #" + РодительОбъектаНоменклатуры.НомерПоставки + ")", "") 
	// <-- Конец Лико Ефимов ЕВВ 06.04.2026
	;
	
	НовоеНаименованиеКороткое="";					
	НовоеНаименованиеКороткое=	 ?(Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыПолуфабрикат.ЗначениеПараметра,
	?(ЗначениеЗаполнено(НомерБланка), ", бл."+НомерБланка, ""),	"")
	// }} DGavrilov 20150930
	+ ?(ЗначениеЗаполнено(Нарезка), ", Ø"+Нарезка+" ", "")
	+ ?(ЗначениеЗаполнено(Втулка), ?(ЗначениеЗаполнено(Нарезка), "", ", ")+"("+Втулка+")", "")
	+ ?(СокрЛП(Комментарий)="", "", ", " + СокрЛП(Комментарий))
	// --> Начало Лико Ефимов ЕВВ 03.03.2026 
	//+ ?(Уникальный И Количество<>0, ", "+Количество+" "+БазоваяЕдиницаИзмерения, "")
	// Если заполнены Длина и Ширина, то выведем размер остатка
	+ ?(ЗначениеЗаполнено(Длина) И ЗначениеЗаполнено(Ширина), ", " + БазоваяЕдиницаИзмерения + " " + Длина + "см*" + Ширина + "см",
	// иначе оставим как было
	?(Уникальный И Количество<>0, ", "+Количество+" "+БазоваяЕдиницаИзмерения, ""))
	// <-- Конец Лико Ефимов ЕВВ 03.03.2026
	+ ?(НомерПоставки=0, "", ", #"+Формат(НомерПоставки, "ЧГ=0"));
	
	Если СтрДлина(НовоеНаименованиеКороткое)>0 Тогда
		НовоеНаименованиеКороткое=Прав(НовоеНаименованиеКороткое, СтрДлина(НовоеНаименованиеКороткое)-1);	
	КонецЕсли;			
	//// добавление номера бланка
	//Если ЗначениеЗаполнено(НомерБланка) И Номенклатура.ВидНоменклатуры=Перечисления.видыноме Тогда
	//	НовоеНаименование = СтрЗаменить(НовоеНаименование, " (", " / "+НомерБланка+" ("
	//КонецЕсли;
	
	Если СокрЛП(Наименование)<>СокрЛП(НовоеНаименование) Тогда
		Наименование = НовоеНаименование;
	КонецЕсли;
	
	Если СокрЛП(НаименованиеКороткое)<>СокрЛП(НовоеНаименованиеКороткое) Тогда
		НаименованиеКороткое = НовоеНаименованиеКороткое;
	КонецЕсли;
	
	
КонецПроцедуры //СформироватьНаименованиеОбъекта


Процедура ПередЗаписью040526(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Партнер) И Не ЗначениеЗаполнено(Резерв) Тогда
		Резерв = Партнер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Резерв) И Не ЗначениеЗаполнено(Партнер) Тогда
		Партнер = Резерв;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Резерв)  Тогда
		Резерв = Справочники.Партнеры.ПустаяСсылка();
	КонецЕсли; 
	

	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Категория2 И Не Ссылка.Категория2 Тогда
		ДополнительныеСвойства.Вставить("Категория2");
	КонецЕсли; 	
	Если Не Рулонный и Не ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Или Не ЗначениеЗаполнено(БазоваяЕдиницаИзмерения.ЕдиницаИзмерения) Тогда
		Упаковка=Неопределено;
		Если Количество=0 Тогда
			Количество=1;
		КонецЕсли;		
		Лико_Дополнительно.ПроверитьНаличиеУпаковки(Номенклатура,Упаковка,Количество); 		
		БазоваяЕдиницаИзмерения=Упаковка;
	КонецЕсли;	
	Если Не ЭтоГруппа Тогда
		Если ЭтоНовый() Тогда			
			ОбработкаЗаполнения(Отказ);			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НомерПоставки) Тогда
				ПоследнийНомерПоставки = ОпределитьПоследнийНомерПоставкиДляНоменклатуры(Номенклатура);				
				НомерПоставки =  ?(Уникальный,ПоследнийНомерПоставки+ 1, 0);
			КонецЕсли; 			
			ДатаФормирования = ТекущаяДата();
		КонецЕсли; 		
		СформироватьНаименованиеОбъекта();		
		КодНоменклатуры = Номенклатура.Код;		
	КонецЕсли;	
	Если ЗначениеЗаполнено(НомерЗаказаКлиента) И Не ЗначениеЗаполнено(ЗаказКлиента) ТОгда
		НомерЗаказаСтрока=Формат(НомерЗаказаКлиента,"ЧЦ=7; ЧГ=");
		Если СтрДлина(НомерЗаказаСтрока) = Метаданные.Документы.ЗаказКлиента.Реквизиты.НомерБезПрефикса.Тип.КвалификаторыСтроки.Длина Тогда // --> Начало Лико Ефимов ЕВВ 15.12.2021
			ЗаказКлиента=Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",НомерЗаказаСтрока);
		КонецЕсли;       
		
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(Серия) Тогда
		НоваяСерия=Справочники.СерииНоменклатуры.СоздатьЭлемент();		
		Если ЭтоНовый() Тогда
			НоваяСсылка=Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьСсылку();
			УстановитьСсылкуНового(НоваяСсылка);
		КонецЕсли;
		
		НоваяСерия.ЯССМ_ОбъектНоменклатуры 	=НоваяСсылка;
		НоваяСерия.ВидНоменклатуры			=Номенклатура.ВидНоменклатуры;
		НоваяСерия.Наименование				=Наименование; 
		Попытка   			
			НоваяСерия.Записать();
			Серия								=НоваяСерия.Ссылка;
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
		
		
		
	КонецЕсли; 	
	
	Если Рулонный Тогда
		//ЗакрытиеБланка =Справочники.ЯССМ_ОбъектыНоменклатуры.ОпределеитьДокументЗакрытияБланкаСНомеромЗаказа(Серия);
		//ЗаказКлиента   =ЗакрытиеБланка.ЗаказПокупателя;
	КонецЕсли;
	BRC_БлокировкаВК=Ложь;
	
	
	Если Не  ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией) Тогда
		ВидКонтактаСПищевойПродукцией=Номенклатура.Лико_ВидКонтактаСПищевойПродукцией;
	КонецЕсли;
	
	
	Если ДатаПроизводства=УпотребитьДо Тогда
		ОстаточныйСрокГодности=0;
	ИначеЕсли ЗначениеЗаполнено(ДатаПроизводства) и ЗначениеЗаполнено(УпотребитьДо)   Тогда
		
		ОстаточныйСрокГодности= (УпотребитьДо-ДатаФормирования)/(УпотребитьДо-ДатаПроизводства)*100;
	КонецЕсли;
	Массив = Новый Массив();
	Массив.Добавить(Справочники.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт);
	Массив.Добавить(Справочники.Лико_ВидыКонтактовСПищевойПродукцией.НепрямойКонтакт);
	
	
	
	Если ЗначениеЗаполнено(ОстаточныйСрокГодности)И
		ПриходныйОрдер.BRC_РешениеОПриемке<>Перечисления.BRC_РешенияОПриемке.ПринятьСЗамечаниями И
		Массив.Найти(ВидКонтактаСПищевойПродукцией)<>Неопределено И
		ОстаточныйСрокГодности<50  Тогда
		BRC_БлокировкаВК=Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией)И
		Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		
		ВидКонтактаСПищевойПродукцией=ЗакрытиеБланка.ЗаказПокупателя.ВидКонтактаСПищевойПродукцией;
		Если Не ЗначениеЗаполнено(Номенклатура.Лико_ВидКонтактаСПищевойПродукцией) И ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией) Тогда
			НоменклатураОбъект= Номенклатура.ПолучитьОбъект();
			НоменклатураОбъект.Лико_ВидКонтактаСПищевойПродукцией=ВидКонтактаСПищевойПродукцией;
			НоменклатураОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	
	
	Если ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией)И
		Номенклатура.ВидНоменклатуры<>Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_КритерииВходногоКонтроляВидыКонтактов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтКритерии
		|ИЗ
		|	Справочник.Лико_КритерииВходногоКонтроля.ВидыКонтактов КАК Лико_КритерииВходногоКонтроляВидыКонтактов
		|ГДЕ
		|	Лико_КритерииВходногоКонтроляВидыКонтактов.ВидКонтакта = &ВидКонтакта
		|	И Лико_КритерииВходногоКонтроляВидыКонтактов.Блокировать 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтКритерии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЯССМ_ОбъектыНоменклатуры.Лико_ПараметрыВходногоКонтроля КАК ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКритерии КАК ВтКритерии
		|		ПО ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля.Критерий = ВтКритерии.Ссылка
		|ГДЕ
		|	ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля.Ссылка = &Ссылка
		|	И НЕ ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля.НесоответствиеНеВыявлено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтКритерии.Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.Лико_ПараметрыВходногоКонтроля КАК ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКритерии КАК ВтКритерии
		|		ПО ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля.Критерий = ВтКритерии.Ссылка
		|ГДЕ
		|	ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля.Ссылка = &ПриходныйОрдер
		|	И НЕ ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля.НесоответствиеНеВыявлено";
		Запрос.УстановитьПараметр("Ссылка",Ссылка );
		Запрос.УстановитьПараметр("ПриходныйОрдер",ПриходныйОрдер );
		Запрос.УстановитьПараметр("ВидКонтакта",ВидКонтактаСПищевойПродукцией);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() И ЗначениеЗаполнено(ПриходныйОрдер) И ПриходныйОрдер.BRC_РешениеОПриемке<>Перечисления.BRC_РешенияОПриемке.ПринятьСЗамечаниями Тогда
			BRC_БлокировкаВК=Истина;  
		КонецЕсли;
	КонецЕсли;
	
	
	
	////СтруктураПоиска = Новый Структура;
	////СтруктураПоиска.Вставить("НесоответствиеНеВыявлено",Ложь);	
	////
	////Если Лико_ПараметрыВходногоКонтроля.НайтиСтроки(СтруктураПоиска).Количество()>0 и
	////	  BRC_РешениеОПриемке<>Перечисления.BRC_РешенияОПриемке.ПринятьСЗамечаниями Тогда
	////	BRC_БлокировкаВК=Истина;
	////КонецЕсли;
	////
	////Если 
	////	  BRC_РешениеОПриемке=Перечисления.BRC_РешенияОПриемке.ВернутьПоставщику Тогда
	////	BRC_БлокировкаВК=Истина;
	////КонецЕсли;
	
	////
	
	////Если  Не BRC_БлокировкаВК И ПриходныйОрдер.BRC_РезультатВходногоКонтроля=Перечисления.BRC_РезультатыВходногоКонтроля.ПринятьСЗамечаниямиИИзвеститьОтделЗакупок и
	
	////	ПриходныйОрдер.BRC_РешениеОПриемке<>Перечисления.BRC_РешенияОПриемке.ПринятьСЗамечаниями ТОгда
	////	BRC_БлокировкаВК=Истина;
	
	////КонецЕсли;
	////Массив = Новый Массив();
	////Массив.Добавить(Справочники.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт);
	////Массив.Добавить(Справочники.Лико_ВидыКонтактовСПищевойПродукцией.НепрямойКонтакт);
	
	////Если  Массив.Найти(ВидКонтактаСПищевойПродукцией)<>Неопределено и УпотребитьДо<ТекущаяДата() Тогда
	////	//BRC_БлокировкаВК=Истина;
	////КонецЕсли;

	Если (ЗначениеЗаполнено(НомерПартииИзготовления) Или ЗначениеЗаполнено(ПричинаОтсутствияНомераПартииИзготовления)) И 
		(ЗначениеЗаполнено(ДатаПроизводства) Или ЗначениеЗаполнено(ПричинаОтсутствияДатыИзготовления)) Тогда
		ЕстьПартияПроизводства=Истина;
	Иначе
		ЕстьПартияПроизводства=Ложь;
	КонецЕсли;

	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(Партнер) И Не ЗначениеЗаполнено(Резерв) Тогда
		Резерв = Партнер;
	КонецЕсли;

	Если ЗначениеЗаполнено(Резерв) И Не ЗначениеЗаполнено(Партнер) Тогда
		Партнер = Резерв;
	КонецЕсли; 

	Если Не ЗначениеЗаполнено(Резерв)  Тогда
		Резерв = Справочники.Партнеры.ПустаяСсылка();
	КонецЕсли; 



	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Категория2 И Не Ссылка.Категория2 Тогда
		ДополнительныеСвойства.Вставить("Категория2");
	КонецЕсли; 	
	Если Не Рулонный и Не ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Или Не ЗначениеЗаполнено(БазоваяЕдиницаИзмерения.ЕдиницаИзмерения) Тогда
		Упаковка=Неопределено;
		Если Количество=0 Тогда
			Количество=1;
		КонецЕсли;		
		Лико_Дополнительно.ПроверитьНаличиеУпаковки(Номенклатура,Упаковка,Количество); 		
		БазоваяЕдиницаИзмерения=Упаковка;
	КонецЕсли;	
	Если Не ЭтоГруппа Тогда
		Если ЭтоНовый() Тогда			
			ОбработкаЗаполнения(Отказ);			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(НомерПоставки) Тогда
				ПоследнийНомерПоставки = ОпределитьПоследнийНомерПоставкиДляНоменклатуры(Номенклатура);				
				НомерПоставки =  ?(Уникальный,ПоследнийНомерПоставки+ 1, 0);
			КонецЕсли; 			
			ДатаФормирования = ТекущаяДата();
		КонецЕсли; 		
		СформироватьНаименованиеОбъекта();		
		КодНоменклатуры = Номенклатура.Код;		
	КонецЕсли;	
	Если ЗначениеЗаполнено(НомерЗаказаКлиента) И Не ЗначениеЗаполнено(ЗаказКлиента) ТОгда
		НомерЗаказаСтрока=Формат(НомерЗаказаКлиента,"ЧЦ=7; ЧГ=");
		Если СтрДлина(НомерЗаказаСтрока) = Метаданные.Документы.ЗаказКлиента.Реквизиты.НомерБезПрефикса.Тип.КвалификаторыСтроки.Длина Тогда // --> Начало Лико Ефимов ЕВВ 15.12.2021
			ЗаказКлиента=Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",НомерЗаказаСтрока);
		КонецЕсли;       

	КонецЕсли;


	Если Не ЗначениеЗаполнено(Серия) Тогда
		НоваяСерия=Справочники.СерииНоменклатуры.СоздатьЭлемент();		
		Если ЭтоНовый() Тогда
			НоваяСсылка=Справочники.ЯССМ_ОбъектыНоменклатуры.ПолучитьСсылку();
			УстановитьСсылкуНового(НоваяСсылка);
		КонецЕсли;

		НоваяСерия.ЯССМ_ОбъектНоменклатуры 	=НоваяСсылка;
		НоваяСерия.ВидНоменклатуры			=Номенклатура.ВидНоменклатуры;
		НоваяСерия.Наименование				=Наименование; 
		Попытка   			
			НоваяСерия.Записать();
			Серия								=НоваяСерия.Ссылка;
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;



	КонецЕсли; 	

	Если Рулонный Тогда
		//ЗакрытиеБланка =Справочники.ЯССМ_ОбъектыНоменклатуры.ОпределеитьДокументЗакрытияБланкаСНомеромЗаказа(Серия);
		//ЗаказКлиента   =ЗакрытиеБланка.ЗаказПокупателя;
	КонецЕсли;
	BRC_БлокировкаВК=Ложь;


	Если Не  ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией) Тогда
		ВидКонтактаСПищевойПродукцией=Номенклатура.Лико_ВидКонтактаСПищевойПродукцией;
	КонецЕсли;


	Если ДатаПроизводства=УпотребитьДо Тогда
		ОстаточныйСрокГодности=0;
	ИначеЕсли ЗначениеЗаполнено(ДатаПроизводства) и ЗначениеЗаполнено(УпотребитьДо)   Тогда

		ОстаточныйСрокГодности= (УпотребитьДо-ДатаФормирования)/(УпотребитьДо-ДатаПроизводства)*100;
	КонецЕсли;
	Массив = Новый Массив();
	Массив.Добавить(Справочники.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт);
	Массив.Добавить(Справочники.Лико_ВидыКонтактовСПищевойПродукцией.НепрямойКонтакт);



	Если ЗначениеЗаполнено(ОстаточныйСрокГодности)И
		ПриходныйОрдер.BRC_РешениеОПриемке<>Перечисления.BRC_РешенияОПриемке.ПринятьСЗамечаниями И
		Массив.Найти(ВидКонтактаСПищевойПродукцией)<>Неопределено И
		ОстаточныйСрокГодности<50  Тогда
		BRC_БлокировкаВК=Истина;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией)И
		Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда

		ВидКонтактаСПищевойПродукцией=ЗакрытиеБланка.ЗаказПокупателя.ВидКонтактаСПищевойПродукцией;
		Если Не ЗначениеЗаполнено(Номенклатура.Лико_ВидКонтактаСПищевойПродукцией) И ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией) Тогда
			НоменклатураОбъект= Номенклатура.ПолучитьОбъект();
			НоменклатураОбъект.Лико_ВидКонтактаСПищевойПродукцией=ВидКонтактаСПищевойПродукцией;
			НоменклатураОбъект.Записать();
		КонецЕсли;
	КонецЕсли;



	Если ЗначениеЗаполнено(ВидКонтактаСПищевойПродукцией)И
		Номенклатура.ВидНоменклатуры<>Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_КритерииВходногоКонтроляВидыКонтактов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтКритерии
		|ИЗ
		|	Справочник.Лико_КритерииВходногоКонтроля.ВидыКонтактов КАК Лико_КритерииВходногоКонтроляВидыКонтактов
		|ГДЕ
		|	Лико_КритерииВходногоКонтроляВидыКонтактов.ВидКонтакта = &ВидКонтакта
		|	И Лико_КритерииВходногоКонтроляВидыКонтактов.Блокировать 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтКритерии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЯССМ_ОбъектыНоменклатуры.Лико_ПараметрыВходногоКонтроля КАК ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКритерии КАК ВтКритерии
		|		ПО ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля.Критерий = ВтКритерии.Ссылка
		|ГДЕ
		|	ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля.Ссылка = &Ссылка
		|	И НЕ ЯССМ_ОбъектыНоменклатурыЛико_ПараметрыВходногоКонтроля.НесоответствиеНеВыявлено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтКритерии.Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.Лико_ПараметрыВходногоКонтроля КАК ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКритерии КАК ВтКритерии
		|		ПО ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля.Критерий = ВтКритерии.Ссылка
		|ГДЕ
		|	ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля.Ссылка = &ПриходныйОрдер
		|	И НЕ ПриходныйОрдерНаТоварыЛико_ПараметрыВходногоКонтроля.НесоответствиеНеВыявлено";
		Запрос.УстановитьПараметр("Ссылка",Ссылка );
		Запрос.УстановитьПараметр("ПриходныйОрдер",ПриходныйОрдер );
		Запрос.УстановитьПараметр("ВидКонтакта",ВидКонтактаСПищевойПродукцией);

		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() И ЗначениеЗаполнено(ПриходныйОрдер) И ПриходныйОрдер.BRC_РешениеОПриемке<>Перечисления.BRC_РешенияОПриемке.ПринятьСЗамечаниями Тогда
			BRC_БлокировкаВК=Истина;  
		КонецЕсли;
	КонецЕсли;

   
	Если (ЗначениеЗаполнено(НомерПартииИзготовления) Или ЗначениеЗаполнено(ПричинаОтсутствияНомераПартииИзготовления)) И 
		(ЗначениеЗаполнено(ДатаПроизводства) Или ЗначениеЗаполнено(ПричинаОтсутствияДатыИзготовления)) Тогда
		ЕстьПартияПроизводства=Истина;
	Иначе
		ЕстьПартияПроизводства=Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПроизводства) И ЗначениеЗаполнено(УпотребитьДо) Тогда
		
		
		Площадка=ПриходныйОрдер.Склад.Лико_Площадка;
		Если Не ЗначениеЗаполнено(Площадка) Тогда
			Площадка=ЗакрытиеБланка.Склад.Лико_Площадка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Площадка) Тогда 
			СрокГодности = РегистрыСведений.Лико_СрокиГодностиНоменклатуры. Контролировать(Площадка, Номенклатура, ТекущаяДата());
			
			Если ЗначениеЗаполнено(СрокГодности) Тогда
				ДатаПроизводства = УпотребитьДо -(60*60*24*СрокГодности); 
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры



// 
Процедура ОбработкаЗаполнения(Отказ)
Если Не Рулонный Тогда	
	Возврат;
КонецЕсли;

	
	//=--------- Проверка на уникальность/неуникальность -----
	Если ЗначениеЗаполнено(Номенклатура)  Тогда
		ЗапросНаУникальность = Новый Запрос;
		ЗапросНаУникальность.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВложенныйЗапрос.КоличествоУникальных, 0) КАК КоличествоУникальных,
		|	ЕСТЬNULL(ВложенныйЗапрос.КоличествоНеуникальных, 0) КАК КоличествоНеуникальных
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЯССМ_ОбъектыНоменклатуры.Уникальный
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК КоличествоУникальных,
		|		СУММА(ВЫБОР
		|				КОГДА НЕ ЯССМ_ОбъектыНоменклатуры.Уникальный
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК КоличествоНеуникальных
		|	ИЗ
		|		Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
		|	ГДЕ
		|		ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
		|		И НЕ ЯССМ_ОбъектыНоменклатуры.ПометкаУдаления
		|		И ЯССМ_ОбъектыНоменклатуры.Тип = &Тип) КАК ВложенныйЗапрос";
		
		ЗапросНаУникальность.УстановитьПараметр("Номенклатура", Номенклатура);
		ЗапросНаУникальность.УстановитьПараметр("Тип", Справочники.ЯССМ_ТипыОбъектаНоменклатуры.ПустаяСсылка());

		
		// Если создаем уникальный объект, то в базе не должно быть ни одного неуникального.
		// Если создаем НЕуникальный объект, то в базе не должно быть ни одного вообще (кроме создаваемого).
		
		РезультатЗапросаНаУникальность = ЗапросНаУникальность.Выполнить().Выбрать();
		
		Если РезультатЗапросаНаУникальность.Следующий() Тогда
			ТекстСообщенияДляКлиента = "";
			
			Если Не Уникальный И РезультатЗапросаНаУникальность.КоличествоУникальных>0 Тогда
				ТекстСообщенияДляКлиента = "Нельзя создать объект!" + Символы.ПС + "Для номенклатуры (код номенкл. " +Номенклатура.Код+ ") """ + Номенклатура+ """ можно создать только уникальный объект!";
			ИначеЕсли Не Уникальный И РезультатЗапросаНаУникальность.КоличествоНеуникальных>0 Тогда
				ТекстСообщенияДляКлиента = "Нельзя создать объект!" + Символы.ПС + "Для номенклатуры (код номенкл. " +Номенклатура.Код+ ") """ + Номенклатура+ """ уже создан неуникальный объект!";
			ИначеЕсли Уникальный И РезультатЗапросаНаУникальность.КоличествоНеуникальных И Не ЗначениеЗаполнено(Тип) Тогда
				ТекстСообщенияДляКлиента = "Нельзя создать объект!" + Символы.ПС + "Для номенклатуры (код номенкл. " +Номенклатура.Код+ ") """ + Номенклатура+ """ уже создан неуникальный объект!";
			КонецЕсли;
			
			Если ТекстСообщенияДляКлиента<>"" Тогда
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента(ТекстСообщенияДляКлиента, СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//---------=
	
КонецПроцедуры //ОбработкаЗаполнения

// 
Функция НайтиСоздатьЕдиницуИзмеренияУУ() Экспорт
	
	//Если ЗначениеЗаполнено(Нарезка) И ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) И ЗначениеЗаполнено(Номенклатура) Тогда
	//	
	//	Если Номенклатура.БазоваяЕдиницаИзмерения=Справочники.Лико_ПредопределенныеЗначения.КлассификаторЕИКвадрМетр.ЗначениеПараметра Тогда
	//		
	//		Коэффициент = Нарезка.Размер / 1000; // коэффициент пересчета в м2
	//		
	//	Иначе
	//		
	//		Коэффициент = 1; // коэффициент пересчета = 1
	//		
	//	КонецЕсли;
	//	
	//	
	//	ЗапросЕИ = Новый Запрос;
	//	ЗапросЕИ.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЯССМ_ЕдиницыИзмерения.Ссылка
	//	|ИЗ
	//	|	Справочник.ЯССМ_ЕдиницыИзмерения КАК ЯССМ_ЕдиницыИзмерения
	//	|ГДЕ
	//	|	ЯССМ_ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
	//	|	И ЯССМ_ЕдиницыИзмерения.Коэффициент = &Коэффициент
	//	|	И ЯССМ_ЕдиницыИзмерения.ЕдиницаПоКлассификаторуУУ = &ЕдиницаПоКлассификаторуУУ";
	//	
	//	ЗапросЕИ.УстановитьПараметр("ЕдиницаПоКлассификатору", БазоваяЕдиницаИзмерения);
	//	ЗапросЕИ.УстановитьПараметр("ЕдиницаПоКлассификаторуУУ", Номенклатура.БазоваяЕдиницаИзмерения);
	//	ЗапросЕИ.УстановитьПараметр("Коэффициент", Коэффициент);
	//	
	//	РезультатЗапросаЕИ = ЗапросЕИ.Выполнить();
	//	
	//	Если Не РезультатЗапросаЕИ.Пустой() Тогда
	//		ВыборкаЗапросаЕИ = РезультатЗапросаЕИ.Выбрать();
	//		ВыборкаЗапросаЕИ.Следующий();
	//		
	//		ЕдиницаИзмеренияУУ = ВыборкаЗапросаЕИ.Ссылка;
	//	Иначе 	//запрос пуст!
	//		НовыйЭлемент = Справочники.ЯССМ_ЕдиницыИзмерения.СоздатьЭлемент();
	//		НовыйЭлемент.ЕдиницаПоКлассификатору = БазоваяЕдиницаИзмерения;
	//		НовыйЭлемент.ЕдиницаПоКлассификаторуУУ = Номенклатура.БазоваяЕдиницаИзмерения;
	//		НовыйЭлемент.Коэффициент = Коэффициент;
	//		НовыйЭлемент.Наименование = НовыйЭлемент.ЕдиницаПоКлассификатору.Наименование
	//									+ ?(ЗначениеЗаполнено(НовыйЭлемент.ЕдиницаПоКлассификатору), " (" + НовыйЭлемент.Коэффициент + " " + НовыйЭлемент.ЕдиницаПоКлассификаторуУУ + ")", "");
	//		НовыйЭлемент.Записать();
	//		
	//		ЕдиницаИзмеренияУУ = НовыйЭлемент.Ссылка;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецФункции //НайтиСоздатьЕдиницуИзмеренияУУ Экспорт


Процедура ПриЗаписи(Отказ)
	УстановитьПривилегированныйРежим(Истина);

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если  ЗначениеЗаполнено(Серия) И
		Серия.Наименование<>Наименование Тогда
		СерияОбъект=Серия.ПолучитьОбъект();
		СерияОбъект.ЯССМ_ОбъектНоменклатуры=Ссылка;
		СерияОбъект.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Отказ и ДополнительныеСвойства.Свойство("Категория2") Тогда
		Попытка
			ОтправитьСообщениеПоОСнастке(); 
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ОтправитьСообщениеПоОСнастке()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаВидыРабот.Оснастка КАК Оснастка,
	|	МАКСИМУМ(ЗаказКлиентаВидыРабот.Ссылка.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТДаты
	|ИЗ
	|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Оснастка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаВидыРабот.Оснастка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДаты.Оснастка КАК Оснастка,
	|	ЗаказКлиентаВидыРабот.ВидРабот КАК ВидРабот,
	|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТЗаказ
	|ИЗ
	|	ВТДаты КАК ВТДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|		ПО ВТДаты.Оснастка = ЗаказКлиентаВидыРабот.Оснастка
	|			И ВТДаты.Дата = ЗаказКлиентаВидыРабот.Ссылка.Дата,
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДаты.Оснастка,
	|	ЗаказКлиентаВидыРабот.ВидРабот,
	|	ЗаказКлиентаВидыРабот.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказ.Заказ КАК Заказ,
	|	ВТЗаказ.Оснастка КАК Оснастка,
	|	СУММА(ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0)) КАК Метраж,
	|	ВТЗаказ.Заказ.ШагПечати КАК ШагПечати,
	|	ВТЗаказ.Заказ.Z КАК Z,
	|	Лико_ЗаказыНаОснасткуСрезПоследних.ЗаказНаОснастку КАК ЗаказНаОснастку,
	|	ВТЗаказ.ВидРабот КАК ВидРабот
	|ПОМЕСТИТЬ ВТПлан
	|ИЗ
	|	ВТЗаказ КАК ВТЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ПО ВТЗаказ.Заказ = Лико_ПараметрыПроизводстваЗаказа.Заказ
	|			И ВТЗаказ.Заказ.РабочийЦентр = Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр
	|			И (Лико_ПараметрыПроизводстваЗаказа.НомерПроката = 1)
	|			И (ВТЗаказ.Заказ.Состояние = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.ВключенВПлан))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗаказыНаОснастку.СрезПоследних КАК Лико_ЗаказыНаОснасткуСрезПоследних
	|		ПО ВТЗаказ.Оснастка = Лико_ЗаказыНаОснасткуСрезПоследних.Номенклатура
	|			И (Лико_ЗаказыНаОснасткуСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаказовНаОснастку.Поступил))
	|			И (Лико_ЗаказыНаОснасткуСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаказовНаОснастку.Отменен))
	|ГДЕ
	|	Лико_ЗаказыНаОснасткуСрезПоследних.ЗаказНаОснастку ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаказ.Заказ,
	|	ВТЗаказ.Заказ.ШагПечати,
	|	ВТЗаказ.Заказ.Z,
	|	Лико_ЗаказыНаОснасткуСрезПоследних.ЗаказНаОснастку,
	|	ВТЗаказ.Оснастка,
	|	ВТЗаказ.ВидРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПлан.Оснастка КАК Оснастка,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК СерияЯССМ_ОбъектНоменклатуры,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоОстаток,
	|	Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка КАК ОбщаяНаработка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТПлан.Z <> ЗНАЧЕНИЕ(Справочник.Лико_ZКоличествоЗубьев.ПустаяСсылка)
	|				ТОГДА Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка / (ВТПлан.Z.КоличествоЗубьев * 3.175 / 1000)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТПлан.ШагПечати <> 0
	|						ТОГДА Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка / ВТПлан.ШагПечати
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 0)) КАК КоличествоУдаровФакт
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	ВТПлан КАК ВТПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НаработкиОбъектовНоменклатуры.СрезПоследних КАК Лико_НаработкиОбъектовНоменклатурыСрезПоследних
	|		ПО ВТПлан.Оснастка = Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбъектНоменклатуры.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|		ПО ВТПлан.Оснастка = ТоварыВЯчейкахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки.Оснастка КАК Оснастка,
	|	СУММА(ВТОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВТОстатки.КоличествоУдаровФакт) КАК КоличествоУдаровФакт
	|ПОМЕСТИТЬ ВТОстаткиИтог
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстатки.Оснастка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПлан.Оснастка КАК Оснастка,
	|	ВТПлан.Оснастка.Артикул КАК Артикул,
	|	ВТПлан.ВидРабот КАК ВидРабот,
	|	ВТПлан.Заказ КАК Заказ,
	|	ВТПлан.Заказ.Менеджер КАК Менеджер,
	|	ВТОстаткиИтог.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТОстаткиИтог.КоличествоУдаровФакт КАК КоличествоУдаровФакт,
	|	ВТПлан.ЗаказНаОснастку КАК ЗаказНаОснастку,
	|	ВТПлан.Заказ.Этикетки КАК Этикетки
	|ИЗ
	|	ВТПлан КАК ВТПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиИтог КАК ВТОстаткиИтог
	|		ПО ВТПлан.Оснастка = ВТОстаткиИтог.Оснастка
	|ГДЕ
	|	(ВТОстаткиИтог.КоличествоОстаток ЕСТЬ NULL
	|			ИЛИ (ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ВТПлан.Z <> ЗНАЧЕНИЕ(Справочник.Лико_ZКоличествоЗубьев.ПустаяСсылка)
	|						ТОГДА ВТПлан.Метраж / (ВТПлан.Z.КоличествоЗубьев * 3.175 / 1000)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТПлан.ШагПечати <> 0
	|								ТОГДА ВТПлан.Метраж / ВТПлан.ШагПечати
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ КАК ЧИСЛО(15, 0))) + ВТОстаткиИтог.КоличествоУдаровФакт > 3000000)
	|ИТОГИ ПО
	|	Менеджер";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаМенеджер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Менеджер");
	ОтветственныйЗаОснастку = Справочники.Лико_ПредопределенныеЗначения.ПользовательОтветственныйЗаОснастку.ЗначениеПараметра;
	Пока ВыборкаМенеджер.Следующий() Цикл
		СтрОснастки = "";
		Выборка = ВыборкаМенеджер.Выбрать();
		Пока Выборка.Следующий() Цикл
			стрОснастки = СтрОснастки+ " Штамп "+Выборка.Оснастка.Артикул+ " использовался в заказе N" +Выборка.Заказ.НомерБезПрефикса+" для печати этикеток "+ Выборка.Этикетки+";  "+Символы.ПС ;	
			стрОснастки = "Для штампа "+Выборка.Оснастка.Артикул+ " установлена ""Категория 2""" ;	
			
		КонецЦикла;
		
		
		Адресат = Новый  СписокЗначений;
		Адресат.Добавить(ВыборкаМенеджер.Менеджер);
		Адресат.Добавить(ОтветственныйЗаОснастку);
		текст = стрОснастки+":          "+ Символы.ПС+стрОснастки;
		Тема = стрОснастки;
		Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат) ;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры
