&НаКлиенте
Процедура ОткрытьФормуСекции(Команда)
	//СтандартнаяОбработка = Ложь;
	//
	//текПараметрыВыбора = Новый Структура;
	//текПараметрыВыбора.Вставить("РежимВыбора", Истина);
	//текПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);	
	//текПараметрыВыбора.Вставить("Секция", Объект.Ссылка);

	////МассивНеПараметров = Новый Массив;
	////МассивНеПараметров.Добавить("ВидСекции");
	////МассивНеПараметров.Добавить("НомерПроката");
	////МассивНеПараметров.Добавить("НомерВарианта");

	////текПараметрыВыбора.Вставить("ПараметрыСекции", ЗаписатьВХранилище(Элемент.ТекущиеДанные.ВидСекции, Элемент.ТекущиеДанные.НомерСтроки));
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированиеПараметровСекции", ЭтотОбъект,"Подбор");

	//ОткрытьФорму("Справочник.Лико_ВидыСекций.Форма.Лико_РедактированиеПараметровСекции",текПараметрыВыбора,
	//        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированиеПараметровСекции(Значение, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат;
	КонецЕсли;
	
	//Модифицированность = Истина;
КонецПроцедуры

//&НаКлиенте
//Процедура УдалитьСписокЗначений(ИмяТЧ, КлючСтроки);
//	НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки));	
//	Для Каждого Строка из НайденныеСтроки Цикл	
//		Объект[ИмяТЧ].Удалить(Строка);		
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура ВидыРаботПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	ТекущиеДанные = Элементы.ВидыРабот.ТекущиеДанные;
//	
//	Если НоваяСтрока Тогда
//		СтарыйКлючСтроки = ТекущиеДанные.КлючСтроки;
//		КлючСтроки = Новый УникальныйИдентификатор;
//		ТекущиеДанные.КлючСтроки = КлючСтроки;
//		ТекущиеДанные.номерпроката = 1;
//		ТекущиеДанные.номерварианта = 1;
//		//ПустаяЦГ =  ПолучитьПустуюЦеновуюГруппу();
//		//текущиеданные.материал = ПустаяЦГ;
//		//текущиеданные.клей =  ПустаяЦГ;
//			
//		//Элементы.Сотрудники.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", КлючСтроки);	
//	КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДобавкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	текстр = Элементы.ПараметрыСекций.ТекущиеДанные;
//	Если НоваяСтрока Тогда 
//		Элемент.ТекущиеДанные.ПараметрСекции = текстр.ПараметрСекции;
//		Элементы.ЗначенияПараметров.ОтборСтрок = Новый ФиксированнаяСтруктура("ПараметрСекции", текстр.ПараметрСекции); 
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура УдалитьСтрокиПоПараметруСекции(ПараметрСекции, ИмяТЧ, ИмяКолонки = "ПараметрСекции")  
//	МассивСтрок =Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяКолонки,  ПараметрСекции));
//	Для каждого ЭлементМассива Из МассивСтрок Цикл
//		Объект[ИмяТЧ].Удалить(ЭлементМассива);
//	КонецЦикла;	
//КонецПроцедуры
