
//&Вместо("ОпределитьПравило")
//Функция Лико_ОпределитьПравило(Номенклатура, ДокументРасхода)
//	Если ТипЗнч(Номенклатура)=Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
//		Ном=Номенклатура.ОсновнаяНоменклатура;
//	Иначе
//		Ном=Номенклатура;
//	КонецЕсли;
//	
//	Если ДокументРасхода=Неопределено Тогда
//		ДокументРасхода=Документы.Лико_БланкЭтапа.ПустаяСсылка();
//	КонецЕсли;


//	Запрос = Новый Запрос;
//	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
//	Запрос.УстановитьПараметр("ВидНоменклатуры",Ном.ВидНоменклатуры );
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	Пока Выборка.Следующий() Цикл 		
//		ИспользоватьЭтоПравило=Истина;	
//		Если Выборка.СложнаяНастройка Тогда 
//			ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Ном,ДокументРасхода);		

//		Иначе
//			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
//				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
//					Структура = Новый Структура;
//					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
//					Структура.Вставить("Значение",ДопРеквизит.Значение);
//					НайденоСвойство=Ном.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
//					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
//						ИспользоватьЭтоПравило=Ложь;
//						Прервать;
//					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
//						ИспользоватьЭтоПравило=Ложь; 
//						Прервать;				
//					КонецЕсли;				
//				КонецЕсли;
//			КонецЦикла; 
//		КонецЕсли;

//		Если ИспользоватьЭтоПравило Тогда
//			Возврат Выборка.Ссылка;
//		КонецЕсли;			

//	КонецЦикла;


//КонецФункции
