
Процедура СформироватьНаименование() Экспорт
	
	Наименование = "Паллет № " + Формат(Код, "ЧГ=0");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(Код) Тогда
			УстановитьНовыйКод();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Автор) Тогда
			Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДатаФормирования) Тогда
			ДатаФормирования = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	СформироватьНаименование();
	
КонецПроцедуры 
