
&НаКлиенте
Процедура ПересчитатьВыработкуПеремотки(Команда)
	
	ТипОперацииПеремоткиАвто = ОпределитьТипОперацииПеремоткиАвто(Объект.ЗаказКлиента);	
	Если ТипЗнч(ТипОперацииПеремоткиАвто) = Тип("Строка") Тогда
		Сообщить(ТипОперацииПеремоткиАвто);
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Перемотка.ТекущиеДанные;
	
	ДанныеСтроки = СформироватьОписаниеКолонок();
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекДанные);
	
	ДанныеСтроки = ПересчитатьВыработкуПеремоткиНаСервере(Объект.ЗаказКлиента,ДанныеСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекДанные,ДанныеСтроки);

	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьОписаниеКолонок()
	
	ОписаниеКолонок = Метаданные.Документы.Лико_ДвиженияЗаказаПоЭтапам.ТабличныеЧасти.Перемотка.Реквизиты;
	РеквизитыТЧ = Новый Структура();
	Для каждого ТекПараметр из ОписаниеКолонок Цикл
		 РеквизитыТЧ.Вставить(ТекПараметр.Имя)  ;
	 КонецЦикла;		
	Возврат РеквизитыТЧ;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПересчитатьВыработкуПеремоткиНаСервере(ЗаказКлиента,ДанныеСтроки)
		
	ВыработкаПеремотки = Документы.Лико_ДвиженияЗаказаПоЭтапам.ПересчитатьВыработкуПеремотки(ЗаказКлиента,ДанныеСтроки);
	Возврат ВыработкаПеремотки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьТипОперацииПеремоткиАвто(ЗаказКлиента)
	
	ТипОперацииПеремоткиАвто = Документы.Лико_ДвиженияЗаказаПоЭтапам.ОпределитьТипОперацииПеремоткиАвто(ЗаказКлиента);
	Возврат ТипОперацииПеремоткиАвто;
	
КонецФункции   
