
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать


Функция ПечатьСкладскойКарточки(Форма) Экспорт 
	
	МассивОбъектов = Новый Массив(); 
	МассивОбъектов.Добавить(Форма);
	Возврат  ПечатьЗадания(МассивОбъектов, Неопределено);
		
КонецФункции



// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьСкладскойКарточки";
	КомандаПечати.Представление = НСтр("ru = 'Печать складской карточки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	
	//КомандаПечати.СразуНаПринтер = Истина;	
	
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСкладскойКарточки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПечатьСкладскойКарточки",
		НСтр("ru = 'Печать складской карточки'"),
		ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "Лико_ПАРАМЕТРЫ_ПЕЧАТИ_Формы_СкладскаяКарточка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Формы.Ссылка КАК Ссылка,
	|	Лико_Формы.Код КАК Код,
	|	""Форма полимерная цифровая"" КАК Наименование,
	|	Лико_Формы.Заказ.Контрагент КАК Контрагент,
	|	"""" КАК Спецификация,
	|	МАКСИМУМ(Лико_ФормыЭтикетки.Номенклатура) КАК Номенклатура
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Формы.Этикетки КАК Лико_ФормыЭтикетки
	|		ПО Лико_ФормыЭтикетки.Ссылка = Лико_Формы.Ссылка
	|ГДЕ
	|	Лико_Формы.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_Формы.Ссылка,
	|	Лико_Формы.Код,
	|	Лико_Формы.Заказ.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	//Нужно напечатать номер и дату накладной, но к накладным может не быть доступа
	УстановитьПривилегированныйРежим(Истина);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаПоДокументам      = Результаты[0].Выбрать();
	
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("КодНоменклатуры");
	РеквизитыДокумента.Вставить("Код");
	РеквизитыДокумента.Вставить("Наименование", "Форма полимерная цифровая");
	РеквизитыДокумента.Вставить("Контрагент");
	РеквизитыДокумента.Вставить("Спецификация");
	РеквизитыДокумента.Вставить("Номенклатура"); 	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Лико_Формы.ПФ_MXL_СкладскаяКарточка");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл  			
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаПоДокументам); 		
		ОбластьШапка.Параметры.Заполнить(РеквизитыДокумента);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
	КонецЦикла;   	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ПолеСлева 	= 1;
	ТабличныйДокумент.ПолеСправа	= 0;
	ТабличныйДокумент.ПолеСнизу 	= 0;
	ТабличныйДокумент.ПолеСверху 	= 1;
	
	ИмяПринтера = СокрЛП(Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераДляПечатиА4", ""));
	ТабличныйДокумент.ИмяПринтера = ИмяПринтера; 	
	ТабличныйДокумент.АвтоМасштаб = Истина; 	
	Возврат ТабличныйДокумент;	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		СписокЗначений=Новый СписокЗначений;
	СтандартнаяОбработка=Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Лико_Формы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|ГДЕ
	|	Лико_Формы.Код ПОДОБНО &Код";
	Запрос.УстановитьПараметр("Код",Параметры.СтрокаПоиска+"%" );
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ДанныеВыбора=СписокЗначений; 	
	// Вставить содержимое обработчика.
	//ПродолжитьВызов(ДанныеВыбора, Параметры, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#КонецЕсли