
Процедура ПередЗаписью(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	Если Не ЗначениеЗаполнено(Код) И Не ЗначениеЗаполнено(Заказ) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_Формы.Код КАК Код,
		|	ПОДСТРОКА(Лико_Формы.Код, 1, 1) КАК Порядок
		|ИЗ
		|	Справочник.Лико_Формы КАК Лико_Формы
		|ГДЕ
		|	(ВЫРАЗИТЬ(Лико_Формы.Код КАК СТРОКА(5))) = Лико_Формы.Код
		|	И (ВЫРАЗИТЬ(Лико_Формы.Код КАК СТРОКА(4))) <> Лико_Формы.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		Код = Формат(Число(Результат.Код)+1,"ЧГ=");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КодЛинкс) И ЗначениеЗаполнено(Код) И ЗаказПоРельсе.НомерБезПрефикса<> Лев(Код,7) И НЕ Сплошная Тогда
		//ЗаказПоРельсе=Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса",Лев(Код,7))
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.НомерБезПрефикса = &НомерЗаказа";
		Запрос.УстановитьПараметр("НомерЗаказа",Лев(Код,7));
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаказПоРельсе=Выборка.Ссылка;
		КонецЦикла; 
		
	КонецЕсли;
	Если ЗначениеЗаполнено(КодЛинкс)  Тогда
		ЗаказПоРельсе =Заказ;
	КонецЕсли;
	
	
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		ЗаказТех=Заказ;
	Иначе
		ЗаказТех=ЗаказПоРельсе;
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);

	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	ЗаказТех=Неопределено;
КонецПроцедуры

