
&Вместо("Лико_ЗаполнитьСлужебныеРеквизиты")
Процедура Лико_Лико_ЗаполнитьСлужебныеРеквизиты()

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Помещение) Тогда

		Лико_ОтветственноеХранение = Помещение.Лико_ОтветственноеХранение; 
		Лико_Организация = Помещение.Лико_Организация;
		Лико_ТипСклада = Помещение.Лико_ТипСклада;
		Лико_ОтветственноеХранение = Помещение.Лико_ОтветственноеХранение;
		Лико_ОрганизацияОтветственногоХранения = Помещение.Лико_ОрганизацияОтветственногоХранения;
		Лико_СкладОтветственногоХранения = Помещение.Лико_СкладОтветственногоХранения;
		Лико_ПомещениеБрака = Помещение.Лико_ПомещениеБрака;
		Лико_УдаленныйСклад = Помещение.Лико_УдаленныйСклад;

	Иначе

		Лико_ОтветственноеХранение = Владелец.Лико_ОтветственноеХранение; 
		Лико_Организация = Владелец.Лико_Площадка.Организация;
		Лико_ТипСклада = Владелец.Лико_ТипСклада;
		Лико_ОтветственноеХранение = Владелец.Лико_ОтветственноеХранение;
		Лико_ОрганизацияОтветственногоХранения = Владелец.Лико_ОрганизацияОтветственногоХранения;
		Лико_СкладОтветственногоХранения = Владелец.Лико_СкладОтветственногоХранения;
		Лико_ПомещениеБрака = Владелец.Лико_ПомещениеБрака;
		Лико_УдаленныйСклад = Владелец.Лико_УдаленныйСклад;


	КонецЕсли;
	Лико_Площадка =  Владелец.Лико_Площадка; 
	
	Если ЗначениеЗаполнено(Лико_СкладОтветственногоХранения) И ЗначениеЗаполнено(Лико_Организация) Тогда
		
		Лико_Площадка = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(Лико_Организация);
		
	КонецЕсли;
	


КонецПроцедуры
