
&НаКлиенте
Процедура ПодписатьДокумент(Команда)
	Данные=Элементы.Список.ТекущиеДанные;
	Если Данные.Подписан Тогда
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьПодписьДокументаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Отменить подпись документа?",РежимДиалогаВопрос.ДаНет, 60);
Иначе
		Ссылка=Элементы.Список.ТекущиеДанные.Документ;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОписаниеОповещение= Новый ОписаниеОповещения("ПодписатьДокументыЗавершение",ЭтаФорма);
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Ссылка);
		Структура.Вставить("BRC_Подпись",Истина);
		ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента",Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
КонецЕсли;


	 
		
КонецПроцедуры
&НаКлиенте
Процедура ПодписьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
Элементы.Список.Обновить();	
КонецПроцедуры

//Вынести в отдельную процедуру
&НаКлиенте
Процедура ОтменитьПодписьДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Данные=Элементы.Список.ТекущиеДанные;
			ОтменитьПодписьНаСервере(Данные.Документ);
		КонецЕсли; 
	Элементы.Список.Обновить();	
КонецПроцедуры	

&НаСервере
Процедура ОтменитьПодписьНаСервере(Документ) //+Лико m.shenderov 02.06.2020
УстановитьПривилегированныйРежим(Истина);
	    НаборЗаписей = РегистрыСведений.BRC_ВходнойКонтроль.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументПрихода.Установить(Документ);
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.ДокументПрихода=Документ;
		НаборЗаписей.Записать();

КонецПроцедуры  //-Лико m.shenderov 02.06.2020


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	УстановитьЗоголовокКнопки();
	

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Ссылка=Элемент.ТекущиеДанные.Документ;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОписаниеОповещение= Новый ОписаниеОповещения("ПодписатьДокументыЗавершение",ЭтаФорма);
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Ссылка);
		//Структура.Вставить("BRC_Подпись",Истина);
		ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента",Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДокументыЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 16.07.2020
	Данные=Элементы.Список.ТекущиеДанные;

	Если  ЗначениеЗаполнено(РезультатФормы) и РезультатФормы Тогда
		Структура = Новый Структура;
		Структура.Вставить("Документ",Данные.Документ);
		//Структура.Вставить("Правило",Данные.Правило);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодписьЗавершение", ЭтотОбъект);  
		ОткрытьФорму("Обработка.BRCВходнойКонтрольНаПодпись.Форма.ФормаПодписи",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 16.07.2020

&НаКлиенте
Процедура УстановитьЗоголовокКнопки() //+Лико m.shenderov 17.07.2020
	 Данные=Элементы.Список.ТекущиеДанные;
	Если  Данные<>Неопределено Тогда
		ЕСли Данные.Подписан Тогда
			Элементы.СписокПодписатьДокумент.Заголовок="Отмена подписи";
		Иначе
			Элементы.СписокПодписатьДокумент.Заголовок="Подписать документ"; 
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры //-Лико m.shenderov 17.07.2020


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗоголовокКнопки();
КонецПроцедуры


&НаКлиенте
Процедура ПриПовторномОткрытии()
	УстановитьЗоголовокКнопки();
КонецПроцедуры

