
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.ДекорацияУказанияСменыТехнологии.Заголовок=
	//СтрШаблон("    - для указанных продуктов будут созданы варианты с технологией: %1.",Параметры.Технология);
	Дизайнер=Параметры.Дизайнер;
	Для каждого Товар Из Параметры.Товары Цикл
		НоваяСтрТовара= Товары.Добавить();
		НоваяСтрТовара.Артикул=?(ЗначениеЗаполнено(Товар.ВерсияНоменклатуры),Товар.ВерсияНоменклатуры.Артикул,Товар.Номенклатура.Артикул);
		НоваяСтрТовара.Номенклатура=Товар.Номенклатура;
		НоваяСтрТовара.УведомитьДизайнера=Истина;
		НоваяСтрТовара.ВерсияНоменклатуры=Товар.ВерсияНоменклатуры;
		
	КонецЦикла;
	Если  ЗначениеЗаполнено(Дизайнер) ТОгда
		ЕстьПочта=ПроверитьНаличияПочтыУДизайнера();
	КонецЕсли;
	ПроверитьУведомлениеДизайнера();
  
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьКоманда(Команда)
	Если ПроверитьЗаполнениеПолей() Тогда
		
		Массив = Новый Массив();
		Для каждого Товар Из Товары Цикл
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",Товар.Номенклатура);
			Структура.Вставить("ВерсияНоменклатуры",Товар.ВерсияНоменклатуры);
			Структура.Вставить("УведомитьДизайнера",Товар.УведомитьДизайнера);
			Структура.Вставить("Дизайнер",Дизайнер);
			Структура.Вставить("Комментарий",Комментарий);

			Массив.Добавить(Структура);	
		КонецЦикла;
		Закрыть(Массив);
		
	КонецЕсли;
	
КонецПроцедуры
Функция ПроверитьЗаполнениеПолей() //+Лико m.shenderov 10.06.2021
	Результат=Истина;
	
	
	Если ОтправитьУведомление Тогда
		СообщитьПользователю(Дизайнер,"Дизайнер","Дизайнер",Результат); 
	КонецЕсли;
	
	Если Результат И ОтправитьУведомление И Не ЕстьПочта Тогда
		Результат=Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("У сотрудника: %1 не заведена почта в 1С . Обратитесь в отдел ИТ.",Дизайнер);
		Сообщение.Поле = "Дизайнер"; //имя реквизита 
		Сообщение.Сообщить();  			
	КонецЕсли;

		Возврат Результат;
КонецФункции //-Лико m.shenderov 10.06.2021 


Процедура СообщитьПользователю(Поле,РеквизитПоля,Текст,Результат)
	Если Не ЗначениеЗаполнено(Поле) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не заполнено: %1",Текст);
		Сообщение.Поле = РеквизитПоля; //имя реквизита 
		//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
		Сообщение.Сообщить(); 		
		Результат=Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры



Функция ПроверитьНаличияПочтыУДизайнера();
	
	Почта=Справочники.Лико_ВерсииНоменклатуры.ПолучитьEmail(Дизайнер);
	Если ЗначениеЗаполнено(Почта) Тогда
				
		//Элементы.Группа1Дизайнер.Видимость=Истина;
		Элементы.Группа2Дизайнер.Видимость=Ложь;
		Возврат Истина;
	Иначе
		//Элементы.Группа1Дизайнер.Видимость=Ложь;
		Элементы.Группа2Дизайнер.Видимость=Истина;
        Возврат Ложь;

	КонецЕсли;
	


		
КонецФункции //-Лико m.shenderov 19.07.2021

&НаКлиенте
Процедура ДизайнерПриИзменении(Элемент)
	Если  ЗначениеЗаполнено(Дизайнер) ТОгда
		ЕстьПочта=ПроверитьНаличияПочтыУДизайнера();
	КонецЕсли;

КонецПроцедуры


Процедура ПроверитьУведомлениеДизайнера() //+Лико m.shenderov 25.07.2021
	ОтправитьУведомление= Товары.НайтиСтроки(Новый Структура("УведомитьДизайнера",Истина)).Количество()>0;
	  Элементы.Дизайнер.Доступность=ОтправитьУведомление;

КонецПроцедуры //-Лико m.shenderov 25.07.2021

&НаКлиенте
Процедура ТоварыУведомитьДизайнераПриИзменении(Элемент)
	ПроверитьУведомлениеДизайнера();
  

КонецПроцедуры


