&НаКлиенте
Перем ЗаголовокКнопкиДа;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстВопроса", Элементы.ДекорацияНадписьТекстВопроса.Заголовок);
	Если Параметры.Свойство("Кнопки") Тогда
		Если Параметры.Кнопки = "ДаНет" Тогда
			Элементы.Отмена.Видимость = Ложь;
			Элементы.ДекорацияМеждуНетОтмена.Видимость = Ложь;
			Элементы.Да.Ширина = Элементы.Да.Ширина * 1.5;
			Элементы.Нет.Ширина = Элементы.Нет.Ширина * 1.5;
		ИначеЕсли Параметры.Кнопки = "ДаОтмена" Тогда
			Элементы.Нет.Видимость = Ложь;
			Элементы.ДекорацияМеждуНетОтмена.Видимость = Ложь;
			Элементы.Да.Ширина = Элементы.Да.Ширина * 1.5;
			Элементы.Отмена.Ширина = Элементы.Нет.Ширина * 1.5;
		ИначеЕсли Параметры.Кнопки = "СнятьЗакрытьОтмена" Тогда
			Элементы.Да.Заголовок = "Снять";
			Элементы.Нет.Заголовок = "Закрыть";
		ИначеЕсли Параметры.Кнопки = "ПроблемаРешенаПечатьМП" Тогда
			Элементы.Да.Заголовок = "Проблема решена";
			Элементы.Нет.Заголовок = "Печать МП"; 
			Элементы.Да.Ширина = Элементы.Да.Ширина * 1.3;
			//Элементы.Нет.Ширина = Элементы.Нет.Ширина * 0.8;
			Элементы.Отмена.Ширина = Элементы.Отмена.Ширина * 0.7;
			ИначеЕсли Параметры.Кнопки = "Сообщение" Тогда
			Элементы.Нет.Заголовок = "ОК";
			Элементы.ДА.Видимость = Ложь; 
			Элементы.Отмена.Видимость=Ложь ;

		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ПодождатьСек") И Параметры.ПодождатьСек > 0 Тогда
		Элементы.Да.Доступность = Ложь;
		Элементы.Нет.Доступность = Ложь;
		СекундОжидания = Параметры.ПодождатьСек;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	ЭтаФорма.Закрыть(КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	ЭтаФорма.Закрыть(КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(КодВозвратаДиалога.Отмена);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если СекундОжидания <> 0 Тогда
		ЗаголовокКнопкиДа = ?(ЗначениеЗаполнено(Элементы.Да.Заголовок), Элементы.Да.Заголовок, Элементы.Да.Имя);
		ДатаОткрытия = ТекущаяДата();
		ПодключитьОбработчикОжидания("РазблокироватьКнопки", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьКнопки()
	
	ТекущаяДата = ТекущаяДата();
	Если ТекущаяДата <= ДатаОткрытия + СекундОжидания Тогда
		Элементы.Да.Заголовок = ЗаголовокКнопкиДа + " (" + (ДатаОткрытия + СекундОжидания - ТекущаяДата) + ")"; 
		
		ПодключитьОбработчикОжидания("РазблокироватьКнопки", 0.1, Истина);
	Иначе
		Элементы.Да.Заголовок = ЗаголовокКнопкиДа;
		
		Элементы.Да.Доступность = Истина;
		Элементы.Нет.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
