

&НаКлиенте
Процедура Лико_ЛикоПодборПоПриходныиОрдерамВместо(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Партнер",Объект.Партнер);
	Структура.Вставить("Склад",Объект.Склад);

	Массив=Новый Массив;
	Для каждого Товар Из Объект.Товары Цикл
		СтруктураТовар = Новый Структура;
		СтруктураТовар.Вставить("Номенклатура",Товар.Номенклатура);
		СтруктураТовар.Вставить("Характеристика",Товар.Характеристика);
		Массив.Добавить(СтруктураТовар);
	КонецЦикла;
	Структура.Вставить("НоменклатураДокумента", Массив);
	ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ЗаполнитьПоОрдерамПослеЗавершение",ЭтаФорма);
	ОткрытьФорму("Обработка.Лико_ЗаполнениеТЧПТУ.Форма.Форма",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  	
	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ТоварыЛико_ПриходныйОрдер" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.Товары.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Партнер",Объект.Партнер);
		Структура.Вставить("Склад",Объект.Склад);

		
		Структура.Вставить("Характеристика",Элементы.Товары.ТекущиеДанные.Характеристика);
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ТоварыВыборПослеЗавершение",ЭтаФорма);
		ОткрытьФорму("Обработка.Лико_ЗаполнениеТЧПТУ.Форма.Форма",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  	
		
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыВыборПослеЗавершение(ФормаРезультат,ФормаПараметры) Экспорт//+Лико m.shenderov 24.01.2018
	Если ЗначениеЗаполнено(ФормаРезультат) Тогда
		Элементы.Товары.ТекущиеДанные.Лико_ПриходныйОрдер=ФормаРезультат;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ЗаполнитьПоОрдерамПослеЗавершение(ФормаРезультат,ФормаПараметры) Экспорт//+Лико m.shenderov 24.01.2018
	
	Если ТипЗнч(ФормаРезультат)=Тип("Массив") Тогда
		Для каждого Товар Из ФормаРезультат  Цикл
			СтруктураПоискаСОрдером = Новый Структура;
			СтруктураПоиска = Новый Структура;
			СтруктураПоискаСОрдером.Вставить("Номенклатура",Товар.Номенклатура);
			СтруктураПоискаСОрдером.Вставить("Характеристика",Товар.Характеристика);
			СтруктураПоискаСОрдером.Вставить("Лико_ПриходныйОрдер",Товар.ПриходныйОрдер);
			
			СтруктураПоиска.Вставить("Номенклатура",Товар.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика",Товар.Характеристика);
			
			
			
			НайтиСтрокиСОрдером=Объект.Товары.НайтиСтроки(СтруктураПоискаСОрдером);
			Если НайтиСтрокиСОрдером.Количество()>0 Тогда
				Для каждого ТОварСОрдером Из НайтиСтрокиСОрдером Цикл
					
					ТОварСОрдером.Количество=Товар.Количество;
					ТОварСОрдером.КоличествоУпаковок=Товар.Количество;
					Элементы.Товары.ТекущаяСтрока=ТОварСОрдером.ПолучитьИдентификатор();
					ТоварыКоличествоУпаковокПриИзменении(Неопределено);	
					//ТоварыПриИзменении(Неопределено);
					
				КонецЦикла;
			Иначе
				НовыйТовар= Объект.Товары.Добавить();
				Элементы.Товары.ТекущаяСтрока=НовыйТовар.ПолучитьИдентификатор();
				НовыйТовар.Номенклатура=Товар.Номенклатура;
				ТоварыНоменклатураПриИзменении(Неопределено);
				НовыйТовар.Характеристика=Товар.Характеристика;
				НовыйТовар.Количество=Товар.Количество;
				НовыйТовар.КоличествоУпаковок=Товар.Количество;
				НовыйТовар.Лико_ПриходныйОрдер=Товар.ПриходныйОрдер;
				
				
				Цена=0;
				НайтиСтрокиСЦеной=Объект.Товары.НайтиСтроки(СтруктураПоиска);
				Для каждого ТоварСЦеной Из НайтиСтрокиСЦеной Цикл
					Если  ТоварСЦеной.Цена>0 Тогда  						
						НовыйТовар.Цена=ТоварСЦеной.Цена;
						Прервать;						
					КонецЕсли; 					
				КонецЦикла; 				
				ТоварыКоличествоУпаковокПриИзменении(Неопределено);				
				//ТоварыПриИзменении(Неопределено);
				
			КонецЕсли;
			
			
			
			
		КонецЦикла;
	КонецЕсли;	
//ОбновитьНарезкуТовара();	
КонецПроцедуры //-Лико m.shenderov 24.01.2018

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Лико_УстановитьУсловноеОформление()
	
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Товары");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Лико_ПриходныйОрдер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(205, 255, 205));
КонецПроцедуры
