
&НаСервере
Процедура ЗаполнитьПоВыручкеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр КАК РабочийЦентр,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручки,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.Сумма КАК Сумма,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СуммаПлан КАК СуммаПлан,
	|	ВыручкаИСебестоимостьПродажОбороты.Период КАК Период,
	|	ВЫБОР
	|		КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат.УчитыватьВВыпуске
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ КАК ДокументПродажи
	|ПОМЕСТИТЬ ВТВыручка
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр.Лико_ОсновнаяМашина) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПрочиеЗатраты.ЗатратыКРаспределению КАК Лико_ПрочиеЗатратыЗатратыКРаспределению
	|		ПО (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Партнер = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Менеджер = ВыручкаИСебестоимостьПродажОбороты.Менеджер
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Площадка = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Площадка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор.Лико_Площадка
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.РабочийЦентр = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Лико_ПрочиеЗатратыЗатратыКРаспределению.Заказ = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
	|			КОНЕЦ)
	|ГДЕ
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.Ссылка = &ссылка
	|	И ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.РабочийЦентр,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.Сумма,
	|	Лико_ПрочиеЗатратыЗатратыКРаспределению.СуммаПлан,
	|	ВыручкаИСебестоимостьПродажОбороты.Период,
	|	ВЫБОР
	|		КОГДА Лико_ПрочиеЗатратыЗатратыКРаспределению.СтатьяЗатрат.УчитыватьВВыпуске
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТВыручка.СуммаВыручки) КАК СуммаВыручки
	|ПОМЕСТИТЬ ИтогоВыручка
	|ИЗ
	|	ВТВыручка КАК ВТВыручка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВыручка.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТВыручка.РабочийЦентр КАК РабочийЦентр,
	|	ВТВыручка.Заказ КАК Заказ,
	|	1 КАК НомерПроката,
	|	ВТВыручка.ДокументПродажи КАК ДокументПродажи,
	|	ВТВыручка.Сумма / ИтогоВыручка.СуммаВыручки * ВТВыручка.СуммаВыручки КАК Сумма,
	|	ВТВыручка.СуммаПлан / ИтогоВыручка.СуммаВыручки * ВТВыручка.СуммаВыручки КАК СуммаПлан,
	|	ДОБАВИТЬКДАТЕ(ВТВыручка.Период, СЕКУНДА, -1) КАК Период,
	|	ВТВыручка.СуммаВыручки КАК Выручка
	|ИЗ
	|	ВТВыручка КАК ВТВыручка,
	|	ИтогоВыручка КАК ИтогоВыручка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период"  ;
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Объект.Затраты.Очистить();
	Объект.затраты.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВыручке(Команда)
	ЗаполнитьПоВыручкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
