
//&Вместо("НайтиДокументПоЗначениюШтрихКода")
//Процедура ЛИКО_НайтиДокументПоЗначениюШтрихКода(СтрокаТабОбразы) Экспорт 
//	ОбъектИТипПечатнойФормы = Справочники.СА_КлассификаторОбъектовДляСА.ПолучитьОбъектПоЗначениюШтрихКода(СтрокаТабОбразы.ЗначениеШтрихКода);
//	Если ЗначениеЗаполнено(ОбъектИТипПечатнойФормы) Тогда
//		СтрокаТабОбразы.Объект = ОбъектИТипПечатнойФормы.Ссылка;
//		СтрокаТабОбразы.ТипПечатнойФормы = ОбъектИТипПечатнойФормы.ТипПечатнойФормы;
//		СтрокаТабОбразы.НайденПоШтрихКоду = Истина;
//		СтрокаТабОбразы.ОсновнаяКопия = Не ЭтоДубликат(СтрокаТабОбразы.Объект);
//		Если ОбъектИТипПечатнойФормы.Изменен Тогда
//			ПримечаниеИзменения = ПредопределенноеЗначение("Справочник.СА_Примечания.Изменен");
//			МассивПримечаний = Примечания.НайтиСтроки(Новый Структура("ИмяФайла", СтрокаТабОбразы.ИмяФайла));
//			КоличествоПримечаний = МассивПримечаний.Количество();
//			ОбъектИзменен = Ложь;
//			Для Каждого СтрПримечания Из МассивПримечаний Цикл
//				Если СтрПримечания.Примечание = ПримечаниеИзменения Тогда
//					ОбъектИзменен = Истина;
//					Прервать;
//				КонецЕсли;
//			КонецЦикла;
//			Если Не ОбъектИзменен Тогда
//				НовоеПримечание = Примечания.Добавить();

//				ИмяФайла = СА_ПроцедурыСканАрхива.ПолучитьИмяИзПути(СтрокаТабОбразы.ИмяФайла);
//				НовоеПримечание.ИмяФайла = ИмяФайла;
//				НовоеПримечание.Примечание = ПримечаниеИзменения;
//			КонецЕсли;
//			СтрокаТабОбразы.Примечание = СтрокаТабОбразы.Примечание + ?(КоличествоПримечаний = 0, ПримечаниеИзменения.Наименование, "; " + ПримечаниеИзменения.Наименование);
//		КонецЕсли;
//	Иначе
//		Попытка

//			МассивСсылок = Новый Массив;
//			//+ Лико m.shenderov 22.02.2018

//			УстановитьПривилегированныйРежим(Истина);

//			МенеджерыОбъектов = Новый Массив();
//			МенеджерыОбъектов.Добавить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ПриобретениеТоваровУслуг.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ПриобретениеУслугПрочихАктивов.ПустаяСсылка());

//			МенеджерыОбъектов.Добавить(Документы.КорректировкаРеализации.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.КорректировкаПриобретения.ПустаяСсылка());

//			МенеджерыОбъектов.Добавить(Документы.СверкаВзаиморасчетов2_4.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.СверкаВзаиморасчетов2_5_11.ПустаяСсылка());

//			МенеджерыОбъектов.Добавить(Документы.СчетФактураВыданный.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.СчетФактураПолученный.ПустаяСсылка());



//			МенеджерыОбъектов.Добавить(Документы.ПоступлениеДенежныхДокументов.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ВыбытиеДенежныхДокументов.ПустаяСсылка());

//			МенеджерыОбъектов.Добавить(Документы.ВозвратСырьяОтПереработчика.ПустаяСсылка());       
//			МенеджерыОбъектов.Добавить(Документы.ПоступлениеОтПереработчика.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ОтчетПереработчика.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ПринятиеКУчетуОС.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ПринятиеКУчетуОС2_4.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ЗаказКлиента.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ВозвратТоваровПоставщику.ПустаяСсылка());
//		 	Организация=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b");
//			Если Организация<>Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра ТОгда 
//			МенеджерыОбъектов.Добавить(Документы.ТранспортнаяНакладная.ПустаяСсылка());
//			КонецЕсли;
//			МенеджерыОбъектов.Добавить(Документы.Лико_ЗаявкаНаТранспортировку.ПустаяСсылка());
//			//МенеджерыОбъектов.Добавить(Документы.СверкаВзаиморасчетов.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.АктВыполненныхРабот.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.Лико_УстановкаВидаНастроечногоМатериала.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ДвижениеПродукцииИМатериалов.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ВозвратТоваровОтКлиента.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ВнутреннееПотребление.ПустаяСсылка());
//			МенеджерыОбъектов.Добавить(Документы.ПеремещениеТоваров.ПустаяСсылка()); 
//				МенеджерыОбъектов.Добавить(Документы.ПриемкаТоваровНаХранение.ПустаяСсылка());
//   		МенеджерыОбъектов.Добавить(Документы.ОтгрузкаТоваровСХранения.ПустаяСсылка());
//		МенеджерыОбъектов.Добавить(Документы.ПоступлениеТоваровОтХранителя.ПустаяСсылка()); 
//		МенеджерыОбъектов.Добавить(Документы.Бронирование.ПустаяСсылка()); 
//		МенеджерыОбъектов.Добавить(Документы.СписаниеБезналичныхДенежныхСредств.ПустаяСсылка());
//		







//			//Выполнить("МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(СтрокаТабОбразы.ЗначениеШтрихКода, Неопределено)");
//			Выполнить("МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(СтрокаТабОбразы.ЗначениеШтрихКода, МенеджерыОбъектов)");

//			//- Лико m.shenderov 22.02.2018

//			УстановитьПривилегированныйРежим(Ложь);
//			Если МассивСсылок.Количество()=0 Тогда
//				
//				Результат = Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(СтрокаТабОбразы.ЗначениеШтрихКода);
//				
//				Если Результат.Ошибка = "" И (Результат.ВидШК = Перечисления.ЯС_ВидыШК.ШК_КартаСнятияПерерасхода)  Тогда
//					
//					МассивСсылок.Добавить(Результат.Документ);
//					
//				КонецЕсли;
//				
//			КонецЕсли;
//			

//			Если МассивСсылок.Количество() > 0 Тогда
//				Ссылка = МассивСсылок[0];
//				//+ Лико m.shenderov 31.05.2018
//				ПроверитьСсылку(Ссылка);
//				//- Лико m.shenderov 31.05.2018

//				СтрокаТабОбразы.Объект = Ссылка;
//				СтрокаТабОбразы.НайденПоШтрихКоду = Истина;
//				СтрокаТабОбразы.ОсновнаяКопия = Не ЭтоДубликат(СтрокаТабОбразы.Объект);
//			КонецЕсли;
//		Исключение
//			//Сообщить("В данной конфигурации типовое штрихкодирование на используется.");
//		КонецПопытки;
//	КонецЕсли;
//	СтрокаТабОбразы.ДатаОбработки = ТекущаяДата();
//КонецПроцедуры

