#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует массив состояний, которые не учитываются при вычислении стажа, дающего право на ежегодные оплачиваемые отпуска.
// См. ст. 121 ТК РФ.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияСотрудника
//
Функция СостоянияПрерывающиеПравоНаОтпуск() Экспорт 

	ПрерывающиеСостояния = Новый Массив;
	ПрерывающиеСостояния.Добавить(Прогул);
	ПрерывающиеСостояния.Добавить(ПростойПоВинеРаботника);
	ПрерывающиеСостояния.Добавить(ОтсутствиеПоНевыясненнымПричинам);
	ПрерывающиеСостояния.Добавить(ОтпускПоУходуЗаРебенком);
	ПрерывающиеСостояния.Добавить(ОтпускНеоплачиваемыйПоЗаконодательству);
	ПрерывающиеСостояния.Добавить(ДополнительныйОтпускНеоплачиваемый);
	ПрерывающиеСостояния.Добавить(ОтпускУчебныйНеоплачиваемый);
	ПрерывающиеСостояния.Добавить(ОтпускНеоплачиваемыйПоРазрешениюРаботодателя);

	Возврат ПрерывающиеСостояния;
	
КонецФункции
	
#КонецОбласти

#КонецЕсли