
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает синоним контрагента по типу задолженности.
// 
// Параметры:
//   ТипЗадолженности - ПеречислениеСсылка.ТипыЗадолженности - Тип задолженности.
//
// Возвращаемое значение:
//	Строка - Синоним контрагента.
//
Функция СинонимКонтрагента(ТипЗадолженности) Экспорт
	
	Если ТипЗадолженности=Перечисления.ТипыЗадолженности.Дебиторская Тогда
		ТекстСинонима = НСтр("ru = 'Дебитор';
							|en = 'Debtor'");
	ИначеЕсли ТипЗадолженности=Перечисления.ТипыЗадолженности.Кредиторская Тогда
		ТекстСинонима = НСтр("ru = 'Кредитор';
							|en = 'Creditor'");
	Иначе
		ТекстСинонима = НСтр("ru = 'Контрагент';
							|en = 'Counterparty'");
	КонецЕсли;
	
	Возврат ТекстСинонима;
	
КонецФункции

#КонецОбласти

#КонецЕсли