
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;	
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	
    Склад=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СкладСИМ",Ложь);
	Объект.АдресХранения = Склад.Лико_ПолПриемкиГлавный;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	

КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// СтандартныеПодсистемы.ПодключаемыеКоманды

// ОбработатьШтрихкоды

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
		Возврат
	КонецЕсли;
	
	
	ОбработатьШтрихкодТипоразмерПаллета(Результат);
	ОбработатьШтрихкодПаллета(Результат);
	ОбработатьШтрихкодСотрудника(Результат);
	ОбработатьШтрихкодОбъектаНоменклатуры(Результат);
	ОбработатьШтрихкодАдресХранения(Результат);
			
	
КонецПроцедуры 
&НаКлиенте	
Процедура ОбработатьШтрихкодТипоразмерПаллета(Результат) 
	
	Если Результат.ВидШК 
			= Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_ТипоразмерПаллета") Тогда
			
			Объект.Типоразмер = Результат.ТипоразмерПаллета; 
			
	КонецЕсли;
		
КонецПроцедуры 
&НаКлиенте
Процедура ОбработатьШтрихкодПаллета(Результат) 
	
	Если Результат.ВидШК 
			= Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Паллета2_0") Тогда
			
			Объект.Паллет = Результат.Паллет;
			СерииНаПаллете();
			
	КонецЕсли;
		
КонецПроцедуры 
&НаКлиенте	
Процедура ОбработатьШтрихкодСотрудника(Результат) 
	
	Если Результат.ВидШК 
			= Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			
			Объект.АвторДокумента = Результат.Сотрудник; 
			
	КонецЕсли;
		
КонецПроцедуры 
&НаКлиенте
Процедура ОбработатьШтрихкодОбъектаНоменклатуры(Результат) 
	
			
		Если Результат.ВидШК 
			= ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			
			ДанныеОбъекта = АдресХраненияПоОбъектуНоменклатурыСервер(Результат.ОбъектНоменклатуры);
			
			Если Не ЗначениеЗаполнено(ДанныеОбъекта.АдресХранения) Тогда 
				
				
				Текст = СтрШаблон("Не найден объект номенклатуры #%1-%2",ДанныеОбъекта.НомерПоставки,Результат.ОбъектНоменклатуры);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = Текст;
				Сообщение.Сообщить();
				Возврат;
				
				
			КонецЕсли;
			ОбработатьНоменклатуру(ДанныеОбъекта.Серия);	
			
		КонецЕсли;
		
	КонецПроцедуры 
	
	
 &НаСервереБезКонтекста	
Функция АдресХраненияПоОбъектуНоменклатурыСервер(ОбъектНоменклатуры)
		
		Возврат Документы.Лико_ФормированиеПаллета2_0.АдресХраненияПоОбъектуНоменклатуры(ОбъектНоменклатуры);
	
КонецФункции 	
	
&НаКлиенте
Процедура ОбработатьШтрихкодАдресХранения(Результат) 
	
	Если Результат.ВидШК 
			= Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			
				Объект.АдресХранения = Результат.АдресаХранения;

			
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьНоменклатуру(Серия) //+Лико m.shenderov 08.12.2017
			
	
		
	Если ЗначениеЗаполнено(Серия) Тогда
		СтруктураПоиска = Новый Структура;
		
		
		СтруктураПоиска.Вставить("Серия",Серия);
		НайденныеСтроки=Объект.Товары.НайтиСтроки(СтруктураПоиска);	
		
		Если НайденныеСтроки.Количество()>0  Тогда
			Возврат;		
		КонецЕсли;
		НоваяСтрока=Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураПоиска);
		
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 08.12.2017

&НаКлиенте
Процедура СерииНаПаллете()
	
	МассивСерий = СерииНаПаллетеСервер(Объект.Паллет);
	
	Для каждого Серия Из МассивСерий Цикл
		
	ОбработатьНоменклатуру(Серия);	
		
	КонецЦикла;
	
КонецПроцедуры 

 &НаСервереБезКонтекста
 Функция СерииНаПаллетеСервер(Паллет) 	
	 Возврат  Справочники.Лико_Паллеты2_0.СерииНаПаллете(Паллет)
 КонецФункции  

&НаКлиенте
 Процедура ПаллетПриИзменении(Элемент)
	 СерииНаПаллете();
 КонецПроцедуры
 
 



#КонецОбласти
