Процедура ЗаполнениеУпаковкиПоХарактеристики (Форма,Элемент) Экспорт //+Лико m.shenderov 09.11.2017
	
	Характеристика	=Форма.Элементы.Товары.ТекущиеДанные.Характеристика;
	Нарезка			=Лико_СкладыВызовСервера.ПолучитьНарезку(Характеристика);
	//Серия			=Форма.Элементы.Товары.ТекущиеДанные.Серия;
	Форма.Элементы.Товары.ТекущиеДанные.Упаковка=Неопределено;
	Если ЗначениеЗаполнено(Нарезка) Тогда
		Форма.Элементы.Товары.ТекущиеДанные.Упаковка=Лико_СкладыВызовСервера.ПолучитьУпаковку(Нарезка);	
	КонецЕсли;	
КонецПроцедуры //-Лико m.shenderov 09.11.2017

&НаКлиенте 
Процедура ПоказатьФормуОбъектаНоменклатуры(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка,Имя="ТоварыСерияИмяКороткое") Экспорт  //+Лико m.shenderov 16.12.2017


	Если Поле.Имя=Имя Тогда
		СтандартнаяОбработка=Ложь;  		 
		ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элемент.ТекущиеДанные.Серия,"ЯССМ_ОбъектНоменклатуры");
		
		Если ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда 			
			Структура = Новый Структура;
			Структура.Вставить("Ключ",ОбъектНоменклатуры);
			ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли; 		
	КонецЕсли;
	Если Поле.Имя="ТоварыСерия" Тогда
		СтандартнаяОбработка=Ложь;  		 
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) Тогда 			
			Структура = Новый Структура;
			Структура.Вставить("Ключ",Элемент.ТекущиеДанные.Серия);
			ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли; 		
	КонецЕсли;

	

		
КонецПроцедуры //-Лико m.shenderov 16.12.2017


&НаКлиенте
Процедура ОткрытьОтчетПоОстаткам(ТекСтр) Экспорт //+Лико m.shenderov 26.12.2017
	КомпоновщикНастроек=Лико_ОбщегоНазначенияСервер.ПолучитьКомпановщикЛикоОстаткиТоваров();

Если ТекСтр=Неопределено Тогда
	Возврат;
КонецЕсли;

	Для каждого Отбор Из  КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение= ТекСтр.Номенклатура;
				ОтборНоменклатуры.Использование=Истина;
			КонецЕсли;
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Характеристика.ЯССМ_Нарезка") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение= ТекСтр.Нарезка;
				ОтборНоменклатуры.Использование=Истина;
			КонецЕсли;	
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура.Код") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;	
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура.Артикул") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;	
			
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Объектноменклатуры") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;	
			
			
			Если Отбор.ЛевоеЗначение= Новый ПолеКомпоновкиДанных("Номенклатура.ЦеноваяГруппа.Код") Тогда				
				ОтборНоменклатуры=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
				ОтборНоменклатуры.ПравоеЗначение="";
				ОтборНоменклатуры.Использование=Ложь;
			КонецЕсли;			
		КонецЦикла; 
		
		Для каждого ТекЭлемент Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ТекЭлемент)= Тип("ГруппировкаКомпоновкиДанных")Тогда
				ТекЭлемент.Использование=Ложь;
			КонецЕсли;
			

		КонецЦикла;
	      

Структура = Новый Структура;
Структура.Вставить("СформироватьПриОткрытии",Истина);
Структура.Вставить("ПользовательскиеНастройки",КомпоновщикНастроек.ПользовательскиеНастройки);

ОткрытьФорму("Отчет.ЛикоОстаткиТоваров.Форма.ФормаОтчета",Структура);

КонецПроцедуры //-Лико m.shenderov 26.12.2017

