#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Проведен ТОгда
		ТолькоПросмотр=Истина;
	КонецЕсли;
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
	
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы


&НаКлиенте
Процедура ФормыПриИзменении(Элемент)
	ЗаполнитьТаблицуФормДополнительнымиПолями();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборФорм(Команда)
	Структура = Новый Структура;
	Структура.Вставить("ЗаявкаНаИзготовлениеФорм",Истина);
	Структура.Вставить("ВидПечати",ПредопределенноеЗначение("Перечисление.Лико_ВидыПечати.Флексо"));
	Структура.Вставить("Организация",ПолучитьЗначениеДопРеквизитаСервер(Объект.Ответственный,"ОрганизацияПродавец"));
	ОписаниеОповещения= Новый ОписаниеОповещения("ПодборФормЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_Формы.Форма.ФормаПодбораТз",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьТаблицуФормДополнительнымиПолями() //+Лико m.shenderov 14/11/2019
	
	Для каждого Форма Из Объект.Формы Цикл
		Форма.ВидПолимера			=Форма.Форма.ВидПолимера;
		Форма.УголПоворотаРастра	=Форма.Форма.УголПоворотаРастра; 
		
		Форма.КоличествоМ2 = Форма.Длина/1000 * Форма.Ширина/1000;
		
		
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 14/11/2019


&НаКлиенте
Процедура ПодборФормЗавершение(РезультатФормы,ПараметрыФормы) Экспорт  
	Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
		РазмерПолимера=ОпределениеРазмераПолимера();
		Для каждого Форма Из РезультатФормы.Массив Цикл
			Если Объект.Формы.НайтиСтроки(Новый Структура("Форма",Форма)).количество()=0 Тогда
				НоваяФорма=Объект.Формы.Добавить();
				НоваяФорма.Форма=Форма;
				НоваяФорма.Длина=РазмерПолимера.Длина;
				НоваяФорма.Ширина=РазмерПолимера.Ширина;
				
				
			КонецЕсли;
			
			
			
		КонецЦикла;
		ЗаполнитьТаблицуФормДополнительнымиПолями();
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ОпределениеРазмераПолимера() //+Лико m.shenderov 12/01/2020
	Возврат 	Документы.Лико_ЗаявкаНаИзготовлениеФорм.ОпределениеРазмераПолимера(Объект.ЗаказКлиента);	
КонецФункции //-Лико m.shenderov 12/01/2020 


&НаСервере
Функция ПолучитьЗначениеДопРеквизитаСервер(ОбъектСсылка,ИмяСвойства) //+Лико m.shenderov 15/11/2019  
	Возврат УправлениеСвойствами.ЗначениеСвойства(ОбъектСсылка,ИмяСвойства);	
КонецФункции  //-Лико m.shenderov 15/11/2019



//СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаСервере
Процедура ФормыВидПолимераПриИзмененииНаСервере(СтрФорма,ВидПолимера)
	Для каждого Форма Из Объект.Формы Цикл
		СпрОбъект				=Форма.Форма.ПолучитьОбъект();
	//СпрОбъект				=Справочники.Лико_Формы.СоздатьЭлемент();
	СпрОбъект.ВидПолимера	=ВидПолимера;
	СпрОбъект.Записать();

		
	КонецЦикла;
		// Insert handler content.
КонецПроцедуры

&НаКлиенте
Процедура ФормыВидПолимераПриИзменении(Элемент)
	Форма=Элементы.Формы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Форма.Форма) Тогда
		ФормыВидПолимераПриИзмененииНаСервере(Форма.Форма,Форма.ВидПолимера);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФормыУголПоворотаРастраПриИзмененииНаСервере(Форма,УголПоворота)
	СпрОбъект				=Форма.ПолучитьОбъект();
	//СпрОбъект				=Справочники.Лико_Формы.СоздатьЭлемент();
	СпрОбъект.УголПоворотаРастра	=УголПоворота;
	СпрОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормыУголПоворотаРастраПриИзменении(Элемент)
	Форма=Элементы.Формы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Форма.Форма) Тогда
		ФормыУголПоворотаРастраПриИзмененииНаСервере(Форма.Форма,Форма.УголПоворотаРастра);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормыПричинаПеределкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.ЛК_ПричиныИзмененияФорм.ФормаВыбора",,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФормыПричинаПеределкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Для каждого СтрФорма Из Объект.Формы Цикл
			
			Если Не СтрФорма.НоваяФорма и НЕ ЗначениеЗаполнено(СтрФорма.ПричинаПеределки) Тогда
				НомерСтроки=Строка(Объект.Формы.Индекс(СтрФорма));	
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не указана причина переделки № "+ СтрФорма.номерстроки;
				Сообщение.Поле = "Объект.Формы["+НомерСтроки+"].ПричинаПеределки"; //имя реквизита 
				Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
				Сообщение.Сообщить(); 
				Отказ=Истина;
			КонецЕсли;
			
			//	Если НЕ ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(СтрФорма.Форма,"Заказ")) Тогда
			//	НомерСтроки=Строка(Объект.Формы.Индекс(СтрФорма));	
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Текст = " не указан заказ в форме № "+ СтрФорма.номерстроки;
			//	Сообщение.Поле = "Объект.Формы["+НомерСтроки+"].Форма"; //имя реквизита 
			//	Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
			//	Сообщение.Сообщить(); 
			//	Отказ=Истина;
			//КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	Если Объект.Организация=ПолучитьОрганизациуЭкофлексСервер() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьПоЗаказу();
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
КонецПроцедуры


Функция ПолучитьОрганизациуЭкофлексСервер()

	Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра;

КонецФункции // ПолучитьОрганизациуЭкофлексСервер()


Процедура ЗаполнитьПоЗаказу()
	Объект.Формы.Очистить();
	Заказ=Объект.ЗаказКлиента;
	Объект.ИмяФайла = Заказ.ИмяФайла;
	Объект.Партнер=Заказ.Партнер;
	Объект.Контрагент = Заказ.Контрагент;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Растр = Заказ.Растр;
	
	Если Заказ.Площадка= Справочники.Лико_Площадки.Сибирь Тогда
		
		//Объект.Контрагент=Справочники.Контрагенты.НайтиПоНаименованию("ФлексоЦентр ПАРТНЁР ООО");
		Объект.Контрагент=Справочники.Лико_ПредопределенныеЗначения.ПоставщикФормЭкофлекс.ЗначениеПараметра;
		
		Объект.Партнер=Объект.Контрагент.Партнер;
	КонецЕсли;
	РазмерПолимера=Документы.Лико_ЗаявкаНаИзготовлениеФорм.ОпределениеРазмераПолимера(Заказ);
	Объект.ТолщинаПластины = Заказ.ТолщинаПластины;
	Для Каждого ТекСтрокаЦвета Из Заказ.Цвета Цикл
		Если ЗначениеЗаполнено(ТекСтрокаЦвета.Форма) и ТекСтрокаЦвета.Цветоделение и 
			ТекСтрокаЦвета.Форма.ВидПечати=Перечисления.Лико_ВидыПечати.Флексо Тогда
			
			НоваяСтрока = Объект.Формы.Добавить();
			НоваяСтрока.Форма = ТекСтрокаЦвета.Форма;
			НоваяСтрока.НоваяФорма=Истина;
			НоваяСтрока.Длина=РазмерПолимера.Длина;
			НоваяСтрока.Ширина=РазмерПолимера.Ширина;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Форма .УголПоворотаРастра) и
				Заказ.Площадка= Справочники.Лико_Площадки.Сибирь Тогда
				
				Документы.Лико_ЗаявкаНаИзготовлениеФорм.ЗаписатьУголПоворотаРастра(НоваяСтрока.Форма);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

&НаСервере
Процедура ПоставщикПриИзмененииНаСервере()
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер,Объект.Контрагент );
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ПоставщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДлинуШиринуНаСервере()	
	РазмерПолимера=ОпределениеРазмераПолимера();
	Для каждого Форма Из Объект.Формы Цикл				
		Форма.Длина		=РазмерПолимера.Длина;
		Форма.Ширина	=РазмерПолимера.Ширина;
	КонецЦикла;
	ЗаполнитьТаблицуФормДополнительнымиПолями();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДлинуШирину(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПересчитатьДлиннуШиринуНаСервереЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Пересчитать длину ширину?",РежимДиалогаВопрос.ДаНет, 60);
КонецПроцедуры

&НаКлиенте 
Процедура ПересчитатьДлиннуШиринуНаСервереЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПересчитатьДлинуШиринуНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры



#КонецОбласти

