
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("АдминистраторСистемы")  Тогда 		
		Элементы.БазоваяЕдиницаИзмерения.ТолькоПросмотр	=Ложь;
		Элементы.Количество.ТолькоПросмотр				=Ложь;
		Элементы.Уникальный.ТолькоПросмотр				=Ложь;
		Элементы.Втулка.ТолькоПросмотр					=Ложь;
		Элементы.Ответственный.ТолькоПросмотр			=Ложь;
		Элементы.НомерПоставки.ТолькоПросмотр			=Ложь;
		Элементы.ЕдиницаИзмеренияУУ.ТолькоПросмотр		=Ложь;
		Элементы.Характеристика.ТолькоПросмотр			=Ложь; 
		Элементы.ЗаказКлиента.ТолькоПросмотр			=Ложь; 
	    Элементы.ЗакрытиеБланка.ТолькоПросмотр			=Ложь; 
	    Элементы.BRC_БлокировкаВК.ТолькоПросмотр		=Ложь; 
        Элементы.BRC_РешениеОПриемке.ТолькоПросмотр		=Ложь;
		Элементы.ФормулаСмеси.ТолькоПросмотр			=Ложь;
		Элементы.СоставСмеси.ТолькоПросмотр				=Ложь;
		Элементы.СтраницаХарактеристики.Видимость		=Истина;
        Элементы.ВидНастроечногоМатериала.Доступность = Истина;


		
	Иначе
		Элементы.БазоваяЕдиницаИзмерения.ТолькоПросмотр	=Истина;
		Элементы.Количество.ТолькоПросмотр				=Ложь;
		Элементы.Уникальный.ТолькоПросмотр				=Истина;
		Элементы.Втулка.ТолькоПросмотр					=Истина;
		Элементы.Ответственный.ТолькоПросмотр			=Истина;
		Элементы.НомерПоставки.ТолькоПросмотр			=Истина;
		Элементы.ЕдиницаИзмеренияУУ.ТолькоПросмотр		=Истина;
		Элементы.Характеристика.ТолькоПросмотр			=Истина;
		Элементы.ЗаказКлиента.ТолькоПросмотр			=Истина; 
        Элементы.ЗакрытиеБланка.ТолькоПросмотр			=Истина;
		
	    Элементы.BRC_БлокировкаВК.ТолькоПросмотр        =Истина; 
        Элементы.BRC_РешениеОПриемке.ТолькоПросмотр		=Истина;
	    Элементы.ФормулаСмеси.ТолькоПросмотр			=Ложь;
		  Элементы.ВидНастроечногоМатериала.Доступность = Ложь;

		Элементы.СоставСмеси.ТолькоПросмотр				=Ложь;
			Элементы.СтраницаХарактеристики.Видимость		=Ложь;
	КонецЕсли;
		Если РольДоступна("ПолныеПрава") или РольДоступна("Лико_ВходнойКонтроль") Тогда

		Элементы.Лико_ПараметрыВходногоКонтроля.ТолькоПросмотр=Ложь;
	Иначе
		Элементы.Лико_ПараметрыВходногоКонтроля.ТолькоПросмотр=Истина;
	КонецЕсли;

	ЗаполнениеТаблицыК2();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
	Если Объект.Уникальный Тогда	
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(Объект.Ссылка);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект);
		ПоказатьВводЧисла(Оповещение, 1, "Введите количество", 5, 0);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСкладскойКарточки(Команда)
	Лико_ДополнительноКлиент.ПечатьСкладскойКарточки(Объект.Ссылка); 	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Число, Параметры) Экспорт
	Если НЕ Число = Неопределено Тогда
		
		Для н=1 По Число Цикл
			Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(Объект.Ссылка); 
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоответсвуетВК(Команда)
	Для каждого СтрКр Из объект.Лико_ПараметрыВходногоКонтроля  Цикл
		
		 СтрКр.НесоответствиеНеВыявлено=Истина;
		 
	 КонецЦикла;
 КонецПроцедуры

&НаКлиенте
 Процедура НеСоответсвуетВК(Команда)
	 Для каждого СтрКр Из объект.Лико_ПараметрыВходногоКонтроля  Цикл
		
		 СтрКр.НесоответствиеНеВыявлено=Ложь;
		 
	 КонецЦикла;

 КонецПроцедуры

&НаКлиенте
 Процедура СрокГодностиПриИзменении(Элемент)
		УстановитьСрокГодности();

 КонецПроцедуры

&НаКлиенте
 Процедура ДатаПроизводстваПриИзменении(Элемент)
		УстановитьСрокГодности();

 КонецПроцедуры



 

Процедура УстановитьСрокГодности()
	
	
	СрокКодности=Объект.Номенклатура.Лико_СрокГодности;
	
	
	Если   ЗначениеЗаполнено(СрокКодности) Тогда
		
		
		Объект.УпотребитьДо=Объект.ДатаПроизводства+СрокКодности*24*60*60;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
	Элемент.ТекущиеДанные.Дата=ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТаблицыК2() //+Лико m.shenderov 14.12.2022
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БракСерий.Регистратор КАК Регистратор,
	|	Лико_БракСерий.Серия КАК Серия,
	|	Лико_БракСерий.Дефект КАК Дефект,
	|	Лико_БракСерий.ОписаниеДефекта КАК ОписаниеДефекта,
	|	Лико_БракСерий.Решение КАК Решение,
	|	Лико_БракСерий.КомментарийКРешению КАК КомментарийКРешению
	|ИЗ
	|	РегистрСведений.Лико_БракСерий КАК Лико_БракСерий
	|ГДЕ
	|	Лико_БракСерий.ОбъектНоменклатуры = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка );
	ПричиныК2.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры  //-Лико m.shenderov 14.12.2022


