
Процедура ПередЗаписьюУдалить(Отказ)
	Описание="";
	ЕстьДанные=Ложь;
	Для каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
	Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда	
		ЕстьДанные=Истина;
		Описание=Описание+" " +ДопРеквизит.Свойство.Наименование+ ?(ДопРеквизит.Исключить," <> "," = ")+Строка(ДопРеквизит.Значение)+";";	
	КонецЕсли;	
КонецЦикла;
Если ЕстьДанные Тогда
	Описание=Лев(Описание,СтрДлина(Описание)-1);
КонецЕсли;
//Наименование=Строка(ВидНоменклатуры)+" "+Описание;
КонецПроцедуры





Процедура ПередЗаписью(Отказ)
	Если ЭтоГруппа=Истина Тогда
		Наименование=ВидНоменклатуры.Наименование;	
	Иначе
		Если Приоритет=0 Тогда
			Приоритет=Справочники.Лико_ПараметрыРасчетаРаскрояМатериалов.ПолучитьПриоритетМакс(ВидНоменклатуры)+1;
		КонецЕсли;
		Если Не СложнаяНастройка Тогда
			
			Описание="";
			ЕстьДанные=Ложь;
			Для каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда	
					ЕстьДанные=Истина;
					Описание=Описание+" " +ДопРеквизит.Свойство.Наименование+ ?(ДопРеквизит.Исключить," <> "," = ")+Строка(ДопРеквизит.Значение)+";";	
				КонецЕсли;	
			КонецЦикла;
			Если ЕстьДанные Тогда
				Описание=Лев(Описание,СтрДлина(Описание)-1);
			КонецЕсли;
		КонецЕсли;
		//Наименование=Строка(ВидНоменклатуры)+" "+Описание;

		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Приоритет=0;
КонецПроцедуры
