
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	СформироватьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименованиеНаСервере()
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ОбъектФормы.СформироватьНаименование();
	ЗначениеВДанныеФормы(ОбъектФормы, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийПаллет = Объект.Ссылка;
	Иначе
		ТекущийПаллет = Неопределено;
	КонецЕсли;
	ИсторияРазмещения.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущийПаллет);
	ТекущееСодержимое.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущийПаллет);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		СформироватьНаименованиеНаСервере();
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ИсторияРазмещения.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	ТекущееСодержимое.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ИсторияРазмещения.Обновить();
	Элементы.ТекущееСодержимое.Обновить();
КонецПроцедуры
