
&НаКлиенте
Асинх Процедура Лико_СоздатьНоменклатуруПантонаПосле(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Ждать ПредупреждениеАсинх("Необходимо записать формулу пантона!");
		 Возврат;
	КонецЕсли;
	Если ПроверкаЗаполненияПолей() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		НаименованиеПантона=ПолучитьНаименованиеПантона();
		
		Текст=СтрШаблон("Создать номенклатуру пантона :%1 ?",НаименованиеПантона);
		Ответ = Ждать ВопросАсинх(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		СоздатьНоменклатуруНаСервере();
	КонецЕсли; 	
КонецПроцедуры

Процедура СоздатьНоменклатуруНаСервере () //+Лико m.shenderov 16.06.2021
	
		
		//Объект.Номенклатура=Справочники.Лико_ФормулыПантонов.СодатьНоменклатуруСмеси(Объект.Ссылка,Объект.ВидТМЦ,Объект.ВидПечати,Объект.Состав[0].Номенклатура);
	
	  Объект.Номенклатура=
	Справочники.Лико_ФормулыПантонов.СодатьНоменклатуруСмеси(?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Ссылка,Новый Структура("Наименование",Объект.Наименование))
	,Объект.ВидТМЦ,
	Объект.ВидПечати,
	Объект.Состав[0].Номенклатура);
	

КонецПроцедуры //-Лико m.shenderov 16.06.2021


&НаКлиенте
Функция ПроверкаЗаполненияПолей() Экспорт  //+Лико m.shenderov 28.04.2021
	Результат=Истина;
	СообщитьПользователю(Объект.Состав,"Объект.Состав","Состав",Результат);
	СообщитьПользователю(Объект.ВидПечати,"Объект.ВидПечати","Вид Печати",Результат);
	СообщитьПользователю(Объект.ВидТМЦ,"Объект.ВидТМЦ","Вид ТМЦ",Результат);
	СообщитьПользователю(Объект.Наименование,"Объект.Наименование","Наименование",Результат);

	
	Если Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.ИксПак") Тогда		
		СообщитьПользователю(Объект.ЦеноваяГруппа,"Объект.ЦеноваяГруппа","Ценовая группа",Результат);
		//СообщитьПользователю(Объект.ВидПечати,"Объект.Номенклатура","Номенклатура",Результат); 		
	КонецЕсли;
	
	
	Возврат Результат;	
КонецФункции //-Лико m.shenderov 28.04.2021 

&НаКлиенте
Процедура СообщитьПользователю(Поле,РеквизитПоля,Текст,Результат) Экспорт 
	Если Не ЗначениеЗаполнено(Поле) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не заполнен реквизит: %1",Текст);
		Сообщение.Поле = РеквизитПоля; //имя реквизита 
		
		Сообщение.Сообщить(); 		
		Результат=Ложь;	
	КонецЕсли;
КонецПроцедуры


Функция ПолучитьНаименованиеПантона() //+Лико m.shenderov 16.06.2021
		 Возврат СокрЛП(Объект.ВидТМЦ)+"_"+ СокрЛП(Объект.ВидПечати)+"_"+СокрЛП(Объект.Наименование);
КонецФункции //-Лико m.shenderov 16.06.2021 


&НаКлиенте
Асинх Процедура СоздатьНоменклатуруПантона(Команда)
	
	Если Объект.Состав.Количество()>0 и НЕ ЗначениеЗаполнено(Объект.Состав[0].Номенклатура ) Тогда
		
		Ждать ПредупреждениеАсинх("Не указана номенклатура  смеси!");
		Возврат;
	КонецЕсли;
	
	
	Если ПроверкаЗаполненияПолей() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		НаименованиеПантона=ПолучитьНаименованиеПантона();
		
		Текст=СтрШаблон("Создать номенклатуру пантона :%1 ?",НаименованиеПантона);
		Ответ = Ждать ВопросАсинх(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		СоздатьНоменклатуруНаСервере();
	КонецЕсли; 	
	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

