#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает статусы обработки запроса КМ по коду.
//  
// Возвращаемое значение:
//  Соответствие
Функция СтатусыПоКоду() Экспорт
	
	СтатусыОбработки = Новый Соответствие; 
	СтатусыОбработки.Вставить(0, ПредопределенноеЗначение("Перечисление.СтатусОбработкиЗапросаКМ.КорректныйФормат"));
	СтатусыОбработки.Вставить(1, ПредопределенноеЗначение("Перечисление.СтатусОбработкиЗапросаКМ.НекорректныйФормат"));
	СтатусыОбработки.Вставить(2, ПредопределенноеЗначение("Перечисление.СтатусОбработкиЗапросаКМ.НекорректныйФорматКМ"));
	Возврат СтатусыОбработки;
	
КонецФункции

#КонецОбласти

#КонецЕсли