
#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных; 
	
КонецФункции

Процедура ЗаполнитьПараметрыИнициализации021025(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗакрытиеЗаказа.Дата КАК Период,
	|	Лико_ЗакрытиеЗаказа.Номер КАК Номер,
	|	Лико_ЗакрытиеЗаказа.Организация КАК Организация
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа КАК Лико_ЗакрытиеЗаказа
	|ГДЕ
	|	Лико_ЗакрытиеЗаказа.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	
	
	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);	
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Массив = Новый Массив();
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Omega);
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Cartes);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",    		Массив);
    Запрос.УстановитьПараметр("Состояние",    				Перечисления.Лико_СостоянияЗаказов.Закрыт);
    Запрос.УстановитьПараметр("ТипЗаказа",    				Перечисления.Лико_ТипыЗаказов.Полуфабрикат);
	Запрос.УстановитьПараметр("ТипЗаказаУпаковка",    		Перечисления.Лико_ТипыЗаказов.Упаковка);
	
	 
	 Массив = Новый Массив();
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 01"));
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 02"));
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Перемотка"));
	 Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Ротофлекс"));     
	Запрос.УстановитьПараметр("МассивНПЦУ",    		Массив);

	
КонецПроцедуры


Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект)
	
	ДокументСсылка = ДокументОбъект.Ссылка;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗакрытиеЗаказа.Дата КАК Период,
	|	Лико_ЗакрытиеЗаказа.Номер КАК Номер,
	|	Лико_ЗакрытиеЗаказа.Организация КАК Организация
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа КАК Лико_ЗакрытиеЗаказа
	|ГДЕ
	|	Лико_ЗакрытиеЗаказа.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();



	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);	
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Массив = Новый Массив();
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Omega);
	Массив.Добавить(Справочники.ВидыРабочихЦентров.Cartes);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",    		Массив);
	Запрос.УстановитьПараметр("Состояние",    				Перечисления.Лико_СостоянияЗаказов.Закрыт);
	Запрос.УстановитьПараметр("ТипЗаказа",    				Перечисления.Лико_ТипыЗаказов.Полуфабрикат);

	Массив = Новый Массив();
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 01"));
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ 02"));
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Перемотка"));
	Массив.Добавить(Справочники.СкладскиеЯчейки.НайтиПоКоду("Пол ЦУ Ротофлекс"));     
	Запрос.УстановитьПараметр("МассивНПЦУ",    		Массив);
	Запрос.УстановитьПараметр("ТипЗаказаУпаковка",    		Перечисления.Лико_ТипыЗаказов.Упаковка);



КонецПроцедуры



Функция ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыВЯчейках";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Назначение КАК Назначение,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличии,
	|	ТоварыВЯчейкахОстатки.КОтборуОстаток КАК КОтбору,
	|	ТоварыВЯчейкахОстатки.КРазмещениюОстаток КАК КРазмещению
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия.ЯССМ_ОбъектНоменклатуры.Рулонный) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ЗакрытиеЗаказаЗаказы.Заказ = ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры
	|ГДЕ
	|	(ТоварыВЯчейкахОстатки.Ячейка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					РабочиеЦентры.ЛикоЯчейка КАК ЛикоЯчейка
	|				ИЗ
	|					Справочник.РабочиеЦентры КАК РабочиеЦентры
	|				ГДЕ
	|					РабочиеЦентры.ВидРабочегоЦентра В (&ВидРабочегоЦентра))
	|			ИЛИ ТоварыВЯчейкахОстатки.Ячейка В (&МассивНПЦУ))
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.Состояние = &Состояние
	|	И Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.ТипЗаказа <> &ТипЗаказа
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.ТипЗаказа <> &ТипЗаказаУпаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Назначение,
	|	ТоварыВЯчейкахОстатки.Упаковка,
	|	ТоварыВЯчейкахОстатки.Ячейка,
	|	ТоварыВЯчейкахОстатки.Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток,
	|	ТоварыВЯчейкахОстатки.КОтборуОстаток,
	|	ТоварыВЯчейкахОстатки.КРазмещениюОстаток
	|ИЗ
	|	Документ.Лико_ЗакрытиеЗаказа.Заказы КАК Лико_ЗакрытиеЗаказаЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, Серия.ЯССМ_ОбъектНоменклатуры.Рулонный) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ЗакрытиеЗаказаЗаказы.Заказ = ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.Состояние = &Состояние
	|	И Лико_ЗакрытиеЗаказаЗаказы.Ссылка = &Ссылка
	|	И ТоварыВЯчейкахОстатки.Характеристика.Лико_ЗаказНоменклатуры.ТипЗаказа = &ТипЗаказаУпаковка
	|	И ТоварыВЯчейкахОстатки.Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Производство)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти




/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	//--> Маковеева А.Ю.
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	//<-- Маковеева А.Ю.
	
КонецПроцедуры

Процедура УстановитьДатуОбработкиЭтаповВРегистреЭтапыЗаказа(МассивЗаказов, МассивЭтаповВыполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ЭтапыЗаказа.Период КАК Период,
	|	Лико_ЭтапыЗаказа.Заказ КАК Заказ,
	|	Лико_ЭтапыЗаказа.Площадка КАК Площадка
	|ИЗ
	|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
	|ГДЕ
	|	Лико_ЭтапыЗаказа.Заказ В(&СписокЗаказов)
	|	И Лико_ЭтапыЗаказа.Этап В (&СписокЭтапов)
	|	И Лико_ЭтапыЗаказа.Период >= &ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа
	|	И Лико_ЭтапыЗаказа.ДатаОбработкиЭтапа = ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа", Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа.ЗначениеПараметра);
	Запрос.УстановитьПараметр("СписокЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("СписокЭтапов", МассивЭтаповВыполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ДатаОбработкиЭтапа = ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры


   
//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
   МеханизмыДокумента.Добавить("АдресныйСклад");
   МеханизмыДокумента.Добавить("Лико_Склад");
КонецПроцедуры


// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаТоварыВЯчейках(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции
 


//- <--- Лико2.5 m.shenderov 30.03.2022 


