
&НаСервере
Процедура Лико_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	Если Объект.ВидОперации  = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ  И НЕ Лико_Дополнительно.РольДоступнаНаСервере("Лико_ИнженерОснастки")Тогда 
		    
		УстановитьВидимостьПараметров(Ложь,Ложь);
	Иначе
		УстановитьВидимостьПараметров(Истина,Истина);
	КонецЕсли;
	//Если ТипЗнч(ЭтаФорма.Параметры.Основание) = Тип("ДокументСсылка.ЗаказКлиента") И Параметры.Ключ.Пустая() И НЕ Лико_Дополнительно.РольДоступнаНаСервере("Лико_ИнженерОснастки") Тогда
	//	Элементы.ВидОперации.Доступность = Ложь;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(параметры.ЗначениеКопирования) Тогда 
		Для каждого стр из Объект.Оснастка Цикл
			стр.статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан;	
		КонецЦикла;
	КонецЕсли;	
	Если Не (РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке") ИЛИ  Лико_Дополнительно.РольДоступнаНаСервере("Лико_ИнженерОснастки")) Тогда 
		Элементы.Комментарий.Доступность = Ложь;
	КонецЕсли;
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.Номер.Доступность = Ложь;
	КонецЕсли;
	
	Если   Не РольДоступна("ПолныеПрава") И  УправлениеДоступом.ЕстьРоль("Лико_Разработчик3dМоделей") Тогда
		 УстановитьВидемостьДляРазработчика3dМоделей();
	КонецЕсли;
	
	
	ДобавитьУсловноеОформление();
	ОбновитьЗаголовокДлинаШирина();

КонецПроцедуры

&НаКлиенте
Процедура Лико_ПечатьОБЗВместо(Команда)
	
	
	
	стр = Элементы.Оснастка.ТекущиеДанные;
	Если ЗначениеЗаполнено(Стр.Заказ) Тогда
		//Обработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ВнутреннийБланкЗаказаЕРП");
		//Если НЕ ЗначениеЗаполнено(Обработка) Тогда
		//	Сообщить("В системе не зарегистрирована печатная форма с именем объекта ""ВнутреннийБланкЗаказаЕРП""");
		//	Возврат ;
		//КонецЕсли;
		//Если Обработка.Команды.Количество() = 0 Тогда
		//	Сообщить("В печатной форме ""ВнутреннийБланкЗаказаЕРП"" не найдено команд печати.");
		//	Возврат ;
		//КонецЕсли;
		//
		////Команда = Обработка.Команды.Найти(Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода, "ВариантЗапуска");
		////Если Команда = Неопределено Тогда
		//
		//ИдентификаторКоманды = Обработка.Команды[0].Идентификатор;
		//МассивОбъектов = Новый Массив;
		//МассивОбъектов.Добавить(Стр.Заказ);
		//ПараметрыОткрытия = Новый Структура;
		//ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
		//ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения,НеПечататьСразуНаПринтер", ИдентификаторКоманды, МассивОбъектов,Истина));
		//ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", СформироватьПараметрыОткрытияДляПечатнойФормыВБЗ(Стр.Заказ));  
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция СформироватьПараметрыОткрытияДляПечатнойФормыВБЗ(Заказ)
	
	Обработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ВнутреннийБланкЗаказаЕРП");
	Если НЕ ЗначениеЗаполнено(Обработка) Тогда
		Сообщить("В системе не зарегистрирована печатная форма с именем объекта ""ВнутреннийБланкЗаказаЕРП""");
		Возврат Неопределено;
	КонецЕсли;
	Если Обработка.Команды.Количество() = 0 Тогда
		Сообщить("В печатной форме ""ВнутреннийБланкЗаказаЕРП"" не найдено команд печати.");
		Возврат Неопределено;
	КонецЕсли;
	
	//Команда = Обработка.Команды.Найти(Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода, "ВариантЗапуска");
	//Если Команда = Неопределено Тогда
	
	ИдентификаторКоманды = Обработка.Команды[0].Идентификатор;
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Заказ);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
	ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения,НеПечататьСразуНаПринтер", ИдентификаторКоманды, МассивОбъектов,Истина));
	ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);

	Возврат ПараметрыОткрытия;	
	
КонецФункции

