#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура РассылкаВыполнена(Рассылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_КонтрольСроковГодностиНоменклатуры.Ссылка КАК Ссылка,
	|	Лико_КонтрольСроковГодностиНоменклатуры.Дата КАК Дата
	|ИЗ
	|	Документ.Лико_КонтрольСроковГодностиНоменклатуры КАК Лико_КонтрольСроковГодностиНоменклатуры
	|ГДЕ
	|	Лико_КонтрольСроковГодностиНоменклатуры.Проведен
	|	И Лико_КонтрольСроковГодностиНоменклатуры.Рассылка = &Рассылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Рассылка",Рассылка );
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Период = КонецДня(ТекущаяДата());
	
		Пока Выборка.Следующий() Цикл
		
		Площадки = Выборка.Ссылка.Площадки.ВыгрузитьКолонку("Площадка");

		ОтметитьУведомлениеУОбъектовНоменклатуры(Период, Площадки);
	
	КонецЦикла; 
	

КонецПроцедуры 



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтметитьУведомлениеУОбъектовНоменклатуры(Период, Площадки) //+--->Лико m.shenderov 20.08.2025
	
МассивОбъектов = НеотмеченныеОбъекты(Период, Площадки);

Для каждого ОбъектНоменклатуры Из МассивОбъектов Цикл 
	
	СпрОбъект =  ОбъектНоменклатуры.ПолучитьОбъект();
	СпрОбъект.УведомлениеОтправлено = ТекущаяДата();
	СпрОбъект.Записать();
	
	
КонецЦикла;
	
	
	
КонецПроцедуры //-<---Лико m.shenderov 20.08.2025



Функция НеотмеченныеОбъекты(Период, Площадки) //+Лико m.shenderov 20.08.2025
	
	
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокУведомления КАК СрокУведомления,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодности КАК СрокГодности,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Площадка КАК Площадка,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодностиАдминистративный КАК СрокГодностиАдминистративный
|ПОМЕСТИТЬ ВтНоменклатура
|ИЗ
|	РегистрСведений.Лико_СрокиГодностиНоменклатуры.СрезПоследних(, ) КАК Лико_СрокиГодностиНоменклатурыСрезПоследних
|ГДЕ
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Площадка В(&Площадки)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТоварыВЯчейкахОстатки.Ячейка.Лико_Площадка КАК Площадка,
|	ТоварыВЯчейкахОстатки.Ячейка.Владелец КАК Склад,
|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Помещение,
|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Остаток,
|	ВтНоменклатура.СрокГодности КАК СрокГодности,
|	ВтНоменклатура.СрокУведомления КАК СрокУведомления,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства КАК ДатаПроизводства,
|	ВтНоменклатура.СрокГодностиАдминистративный КАК СрокГодностиАдминистративный,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо КАК УпотребитьДо,
|	ДОБАВИТЬКДАТЕ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства, ДЕНЬ, ВтНоменклатура.СрокГодностиАдминистративный - ВтНоменклатура.СрокУведомления) КАК ДатаУведомления,
|	&ТекущаяДата КАК ТекущаяДата,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
|	ВЫБОР
|		КОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства = ДАТАВРЕМЯ(1, 1, 1)
|			ТОГДА ВЫБОР
|					КОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо <> ДАТАВРЕМЯ(1, 1, 1)
|						ТОГДА ДОБАВИТЬКДАТЕ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо, ДЕНЬ, -ВтНоменклатура.СрокГодности)
|					ИНАЧЕ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства
|				КОНЕЦ
|		ИНАЧЕ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства
|	КОНЕЦ КАК ДатаПроизводстваРасчетная
|ПОМЕСТИТЬ ВременнаяТаблица
|ИЗ
|	РегистрНакопления.ТоварыВЯчейках.Остатки(, ) КАК ТоварыВЯчейкахОстатки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНоменклатура КАК ВтНоменклатура
|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ВтНоменклатура.Номенклатура
|			И ТоварыВЯчейкахОстатки.Ячейка.Лико_Площадка = ВтНоменклатура.Площадка
|ГДЕ
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный
|	И (ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства <> ДАТАВРЕМЯ(1, 1, 1)
|			ИЛИ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо <> ДАТАВРЕМЯ(1, 1, 1))
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВременнаяТаблица.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
|	ВременнаяТаблица.ОбъектНоменклатуры.УведомлениеОтправлено КАК УведомлениеОтправлено,
|	ДОБАВИТЬКДАТЕ(ВременнаяТаблица.ДатаПроизводстваРасчетная, ДЕНЬ, ВременнаяТаблица.СрокГодностиАдминистративный - ВременнаяТаблица.СрокУведомления) КАК ДатаУведомления
|ИЗ
|	ВременнаяТаблица КАК ВременнаяТаблица
|ГДЕ
|	ДОБАВИТЬКДАТЕ(ВременнаяТаблица.ДатаПроизводстваРасчетная, ДЕНЬ, ВременнаяТаблица.СрокГодностиАдминистративный - ВременнаяТаблица.СрокУведомления) <= ВременнаяТаблица.ТекущаяДата
|	И ВременнаяТаблица.ОбъектНоменклатуры.УведомлениеОтправлено = ДАТАВРЕМЯ(1, 1, 1)
|	И ВременнаяТаблица.ДатаПроизводстваРасчетная <> ДАТАВРЕМЯ(1, 1, 1)
|
|УПОРЯДОЧИТЬ ПО
|	ДатаУведомления";
Запрос.УстановитьПараметр("Площадки",Площадки);
Запрос.УстановитьПараметр("ТекущаяДата",Период);

РезультатЗапроса = Запрос.Выполнить();

Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОбъектНоменклатуры");

	
	
КонецФункции //-Лико m.shenderov 20.08.2025 




#КонецОбласти

#КонецЕсли