
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Лико_СрокиГодностиНоменклатуры.Записывать = Истина;
	Для каждого Площадка Из Площадки Цикл
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.Лико_СрокиГодностиНоменклатуры.Добавить();
			Движение.Период = Дата;
			Движение.Площадка = Площадка.Площадка;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.СрокГодности = ТекСтрокаТовары.СрокГодности;
			Движение.СрокГодностиАдминистративный = ТекСтрокаТовары.СрокГодностиАдминистративный;
			
			Если   Движение.СрокГодности = 0 Тогда 
				
				Движение.СрокГодности = СрокГодности;
				
			КонецЕсли; 
			
			Если   Движение.СрокГодностиАдминистративный = 0 Тогда 
				
				Движение.СрокГодностиАдминистративный = СрокГодностиАдминистративный;
				
			КонецЕсли;
			
			
			
			Движение.СрокУведомления = ТекСтрокаТовары.СрокУведомления;
			
			Если   Движение.СрокУведомления = 0 Тогда 
				
				Движение.СрокУведомления = СрокУведомления;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;


КонецПроцедуры
