Функция СтрокаXML(Значение) Экспорт
	Если Значение = НеМенялся Тогда
		Возврат "same";
	
	ИначеЕсли Значение = ИзменилсяПолностью Тогда
		Возврат "other";
	
	ИначеЕсли Значение = ИзменилсяЧастично Тогда
		Возврат "mix";
	
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ЗначениеИзXML(СтрокаXML) Экспорт
	Если СтрСравнить(СтрокаXML, "same") = 0 Тогда
		Возврат НеМенялся;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "other") = 0 Тогда
		Возврат ИзменилсяПолностью;
	
	ИначеЕсли СтрСравнить(СтрокаXML, "mix") = 0 Тогда
		Возврат ИзменилсяЧастично;
	
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции