
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ВнешнийОбразец);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ЦветоПроба);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.БезОбразца);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ПредыдущийТираж);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ЭтикеткаВОМ);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.КаталогПантонов);
	СЗ.Добавить(Перечисления.Лико_ОбразцыЦвета.ЭтикеткаВКнигеОбразцов);
	ДанныеВыбора = СЗ;

	
КонецПроцедуры
