

Функция СоздатьРаспоряжение(Объект) Экспорт 
	
	НачатьТранзакцию(); 	
	НовыйДокументПередачаВПроизводствоСсылка = СоздатьЗаказПередачуМатериаловВПроизводство(Объект);
	Если НовыйДокументПередачаВПроизводствоСсылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 	
	ЗафиксироватьТранзакцию();
	Возврат НовыйДокументПередачаВПроизводствоСсылка;
	
КонецФункции




Функция СоздатьПередачуВПроизводство(Объект) 	
	НовыйДокОбъект=Неопределено; 	
	Отказ 			 = Ложь;
	ОбъектыОснований = Новый Массив;
	ОбъектыОснований.Добавить(Объект.Ссылка); 	
	
	НовыйДокОбъект 							=Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	НовыйДокОбъект.ВидЦены					=Справочники.ВидыЦен.НайтиПоНаименованию("Прайс-лист");
	НовыйДокОбъект.Организация				=Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.ОрганизацияПолучатель	=НовыйДокОбъект.Организация;
	НовыйДокОбъект.Отправитель				=Объект.Склад;
	НовыйДокОбъект.Получатель				=Объект.Получатель;
	НовыйДокОбъект.Ответственный			=Объект.Ответственный;
	НовыйДокОбъект.ХозяйственнаяОперация	=Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
	НовыйДокОбъект.Товары.Загрузить(Объект.ОтгружаемыеТовары.Выгрузить());	
	
	НовыйДокОбъект.Дата 			= Объект.Дата;
	НовыйДокОбъект.Статус 			= Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	
	НовыйДокОбъект.Серии.Очистить();
	Для каждого СтрокаСерии Из Объект.ОтгружаемыеТовары Цикл
		НоваяСерия=НовыйДокОбъект.Серии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСерия,СтрокаСерии);		//
		Для каждого НовыйТовар Из НовыйДокОбъект.Товары Цикл
			НовыйТовар.СтатусУказанияСерий=8;
			НовыйТовар.СтатусУказанияСерийОтправитель=8;
			НовыйТовар.СтатусУказанияСерийПолучатель=8; 			
		КонецЦикла;		
	КонецЦикла;	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 		
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции



Функция СоздатьЗаказПередачуМатериаловВПроизводство(Объект) 	
	НовыйДокОбъект=Неопределено; 	
	Отказ 			 = Ложь;
	ОбъектыОснований = Новый Массив;
	ОбъектыОснований.Добавить(Объект.Ссылка); 	
	
	НовыйДокОбъект 								=Документы.ЗаказМатериаловВПроизводство.СоздатьДокумент();
	НовыйДокОбъект.Дата 			       		=Объект.Дата; 	
	НовыйДокОбъект.Организация					=Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", ПараметрыСеанса.ТекущийПользователь);
	НовыйДокОбъект.Подразделение        		=Объект.Получатель.Подразделение;
	НовыйДокОбъект.ЦеховаяКладовая				=Объект.Получатель;
	НовыйДокОбъект.Склад						=Объект.Склад;
	НовыйДокОбъект.Ответственный				=Объект.Ответственный;
	НовыйДокОбъект.ХозяйственнаяОперация		=Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
	НовыйДокОбъект.УправлениеПроизводством2_2	=Истина;				
	НовыйДокОбъект.Статус						=Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению;	
	Объект.ОтгружаемыеТовары.Выгрузить();
	Тз= Объект.ОтгружаемыеТовары.Выгрузить();
	Тз.Свернуть("Номенклатура,Характеристика,Назначение,Упаковка","Количество,КоличествоУпаковок");
	НовыйДокОбъект.Товары.Загрузить(Тз);	
	
	Для каждого Товар Из НовыйДокОбъект.Товары Цикл
		Товар.НачалоОтгрузки		=Объект.Дата;
		Товар.ОкончаниеПоступления	=Объект.Дата;
		Товар.ВариантОбеспечения	=Перечисления.ВариантыОбеспечения.Отгрузить;		
	КонецЦикла;	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 		
	Исключение
		Отказ = Истина;
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;  	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции





