#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс 

Процедура Проведение(ДокументОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументОбъект.Движения.Лико_РезервПодЗаявкуНаСклад.Записывать = Истина;
	Движения = Неопределено;
	ПолучитьДвиженияПоДокументу(ДокументОбъект.Ссылка, Движения); 
	
	ПроверкаНаОшибки(Движения, ДокументОбъект);
	
	ДокументОбъект.Движения.Лико_РезервПодЗаявкуНаСклад.Загрузить(Движения);
	
КонецПроцедуры 


Процедура СформироватьДвижения(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.Лико_РезервПодЗаявкуНаСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Движения = Новый ТаблицаЗначений;
	ПолучитьДвиженияПоДокументу(ДокументСсылка, Движения);
	
	ПроверкаНаОшибки(Движения, ДокументСсылка);

	
	НаборЗаписей.Загрузить(Движения);
	
	НаборЗаписей.Записать(Истина); 	
	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Процедура ПолучитьДвиженияПоДокументу(Ссылка, Движения)
	
	ПолучитьДвиженияПоДокументуЛико_ЗаякаНаСклад(Ссылка, Движения);
		
КонецПроцедуры 


Процедура ПолучитьДвиженияПоДокументуЛико_ЗаякаНаСклад(Ссылка, Движения)
	
	Если ТипЗнч(Ссылка)<>Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаявкаНаСкладТовары.Ссылка.Дата КАК Период,
	|	Лико_ЗаявкаНаСкладТовары.Ссылка КАК ЗаявкаНаСклад,
	|	Лико_ЗаявкаНаСкладТовары.Серия КАК Серия,
	|	Лико_ЗаявкаНаСкладТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Документ.Лико_ЗаявкаНаСклад.Товары КАК Лико_ЗаявкаНаСкладТовары
	|ГДЕ
	|	Лико_ЗаявкаНаСкладТовары.Ссылка = &Ссылка
	|	И Лико_ЗаявкаНаСкладТовары.Ссылка.Статус В(&МассивСтатусов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗаявкаНаСкладТовары.Ссылка,
	|	Лико_ЗаявкаНаСкладТовары.Ссылка.Дата,
	|	Лико_ЗаявкаНаСкладТовары.Серия.ЯССМ_ОбъектНоменклатуры,
	|	Лико_ЗаявкаНаСкладТовары.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТовары.Период КАК Период,
	|	ВтТовары.ЗаявкаНаСклад КАК ЗаявкаНаСклад,
	|	ВтТовары.Серия КАК Серия,
	|	ВтТовары.ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|ГДЕ
	|	ВтТовары.ОбъектНоменклатуры.Уникальный";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	МассивСтатусов = Новый Массив();
	
	МассивСтатусов.Добавить(Перечисления.Лико_СтатусЗаявокНаСклад.Подготовлен);
	МассивСтатусов.Добавить(Перечисления.Лико_СтатусЗаявокНаСклад.ВОбработке);
	
	Запрос.УстановитьПараметр("МассивСтатусов",МассивСтатусов);
	
	Движения = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 






Процедура ПроверкаНаОшибки(Движения, Документ)
	
	Если Движения = Неопределено Тогда
		
		ВызватьИсключение(СтрШаблон("Документ: %1 не может отражать движения по регистру:""лк Резерв под заявку на склад""!",Документ)) ;
		
	КонецЕсли;
	
 КонецПроцедуры
 
 

#КонецОбласти

#КонецЕсли