
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УправлениеДоступностьюЭлементов();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностьюЭлементов()
	
	Параметры.Свойство("РазрешеноМенятьЗакрытуюЗаявку", РазрешеноМенятьЗакрытуюЗаявку);
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ РазрешеноМенятьЗакрытуюЗаявку Тогда
		ТолькоПросмотр = Истина;
		Элементы.ТоварыКонтекстноеМенюРазделитьСтроку.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = НЕ ПолныеПрава;
	Если Элементы.Статус.ТолькоПросмотр Тогда
		Элементы.Статус.МаксимальнаяШирина = Элементы.Статус.МаксимальнаяШирина + 2;
	КонецЕсли;
	Элементы.Номер.ТолькоПросмотр = НЕ ПолныеПрава;
	Элементы.Организация.ТолькоПросмотр = НЕ ПолныеПрава;
	Элементы.Менеджер.ТолькоПросмотр = НЕ ПолныеПрава; 
	Элементы.Дата.ТолькоПросмотр = НЕ ПолныеПрава;
	Элементы.ПодтвердитьЗаявку.Доступность = Объект.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан;
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если РазрешеноМенятьЗакрытуюЗаявку Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешеноМенятьЗакрытуюЗаявку", Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = НЕ ПолныеПрава;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = НЕ ПолныеПрава;	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьСтроку(Команда)
	
	Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ВвелиКоличествоДляРазделенияСтроки", ЭтотОбъект, Новый Структура("ИдСтроки", Элементы.Товары.ТекущаяСтрока)), Элементы.Товары.ТекущиеДанные.Количество, "Введите новое количество", 15, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвелиКоличествоДляРазделенияСтроки(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ДопПараметры.ИдСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат > ТекущаяСтрока.Количество Тогда
		Сообщить("Вы ввели большее количество, чем было в строке");
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.Товары.Вставить(Объект.Товары.Индекс(ТекущаяСтрока)+1);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока,, "Количество,НомерСтроки");
	НоваяСтрока.Количество = Результат;
	ТекущаяСтрока.Количество = ТекущаяСтрока.Количество - НоваяСтрока.Количество;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	
	Если Объект.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ ЗначениеЗаполнено(Объект.ДатаСписания) Тогда
		Объект.ДатаСписания = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьЗаявку(Команда)
	ПодтвердитьЗаявкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьЗаявкуНаСервере()
	
	Объект.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Подтвержден;
	Записать(Новый Структура("РежимЗаписи,ЗакрытьФорму", РежимЗаписиДокумента.Проведение, Истина));
	Если НЕ Модифицированность Тогда
		Элементы.ПодтвердитьЗаявку.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеДоступностьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОтменитьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ПолныеПрава
		И ТекущиеДанные.Отменить
		И ТекущиеДанные.ДатаВыпуска <= ДобавитьМесяц(Объект.Дата, -7) Тогда
		Сообщить("Строка №" + ТекущиеДанные.НомерСтроки + ": с момент выпуска данной позиции прошло больше 7 месяцев. Отмена запрещена");
		ТекущиеДанные.Отменить = Ложь;
	КонецЕсли;
	
КонецПроцедуры
