
&После("СформироватьСписокРегистровДляКонтроля")
Процедура Лико_СформироватьСписокРегистровДляКонтроля()
		Если Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ ТОгда
		Если ДополнительныеСвойства.ДляПроведения.Свойство("РегистрыДляКонтроля") Тогда
			Массив=ДополнительныеСвойства.ДляПроведения.РегистрыДляКонтроля;
			//Массив = Новый Массив();
			//РегистрДляКонтроля=Массив.Найти(Движения.ТоварыНаСкладах);
			//Если РегистрДляКонтроля<>Неопределено Тогда
			//	Массив.Удалить(РегистрДляКонтроля);
			//КонецЕсли;  			
			//РегистрДляКонтроля=Массив.Найти(Движения.ТоварыКОтгрузке);
			//Если РегистрДляКонтроля<>Неопределено Тогда
			//	Массив.Удалить(РегистрДляКонтроля);
			//КонецЕсли;
			//
			//РегистрДляКонтроля=Массив.Найти(Движения.ТОварыНаСкладах);
			//Если РегистрДляКонтроля<>Неопределено Тогда
			//	Массив.Удалить(РегистрДляКонтроля);
			//КонецЕсли;

			
			РегистрДляКонтроля=Массив.Найти(Движения.СвободныеОстатки);   
			Если РегистрДляКонтроля<>Неопределено Тогда
				Массив.Удалить(РегистрДляКонтроля);
			КонецЕсли;

			ДополнительныеСвойства.ДляПроведения.РегистрыДляКонтроля= Массив;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
