&НаКлиенте
Перем ДобавлениеСтроки;
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КорректировкаЦветов") Тогда	
		Элементы.ВидыРабот.Видимость=Ложь;
		Элементы.Цвета.ИзменятьСоставСтрок=Ложь;
	Иначе
		Элементы.Цвета.ИзменятьСоставСтрок=Истина;
		
		Если Параметры.Свойство("НомерПроката") Тогда
			НомерПроката =  Параметры.НомерПроката;
		КонецЕсли;
		
	КонецЕсли;
	ДобавитьУсловноеОформление();

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗаказ(Команда)
	неЗаписывать=Ложь;
	Для Каждого стр из Объект.Цвета Цикл
		Если стр.номерпроката = НомерПроката И ЗначениеЗаполнено(стр.ТипКраски) и Не ЗначениеЗаполнено(стр.ТипКраскиФакт) Тогда 
			неЗаписывать=Истина;
			
			НомерСтроки=Строка(Объект.Цвета.Индекс(стр));	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен тип краски в строке № "+ стр.номерстроки;
			Сообщение.Поле = "Объект.Цвета["+НомерСтроки+"].ТипКраскиФакт"; //имя реквизита 
			Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
			Сообщение.Сообщить();
			
			//Сообщить("Не заполнен тип краски в строке № "+ стр.номерстроки);
			//Возврат;
		КонецЕсли;
	КонецЦикла;	
	Для Каждого стр из Объект.ВидыРабот Цикл
		Если стр.номерпроката = НомерПроката И ЗначениеЗаполнено(стр.Клей) и Не ЗначениеЗаполнено(стр.КлейФакт) Тогда 
			
			неЗаписывать=Истина;
			
			НомерСтроки=Строка(Объект.ВидыРабот.Индекс(стр));	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен тип клей в строке № "+ стр.номерстроки;
			Сообщение.Поле = "Объект.ВидыРабот["+НомерСтроки+"].КлейФакт"; //имя реквизита 
			Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
			Сообщение.Сообщить();
			
			//Сообщить("Не заполнен тип клей в строке № "+ стр.номерстроки);
			//Возврат;
		КонецЕсли;
	КонецЦикла;
	Если неЗаписывать Тогда
		Возврат;
	КонецЕсли;
	
	Объект.УтвердилРаботы = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияРабот = ТекущаяДата();
	Объект.УтвердилЦвета = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияЦветов = ТекущаяДата();
	УстановкаПараметраЗагрузка();
	Модифицированность=ЛОжь;
	//Записать(Новый Структура("РежимЗаписи,Лико_Загрузка",РежимЗаписиДокумента.Запись,Истина));
	Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура УстановкаПараметраЗагрузка() //+Лико m.shenderov 12.10.2019
	
	РеквизитОбъект=РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ОбменДанными.Загрузка=Истина;
	РеквизитОбъект.Записать();
	
КонецПроцедуры  //-Лико m.shenderov 12.10.2019


&НаСервере
Процедура ДобавитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаТипКраскиФакт");
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.НомерПроката");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = НомерПроката; 
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.ТипКраски");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаТипКраски");
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.НомерПроката");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = НомерПроката; 
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.ТипКраски");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Укажите код в зеленом поле");
	
	//
	 ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаНомерСтроки");
	//
	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаНомерПроката");

	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаВидПечати");

	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаТипЦвета");

	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаТипКраски");

	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаТипКраскиФактКод");

	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаНазвание");
	//
	//
	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаПроцентЗаливки");

	//
	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаКлючСтроки");
	//
	
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Цвета");


	

	
	
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.НомерПроката");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = НомерПроката; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВидыРаботКлейФакт");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыРабот.НомерПроката");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = НомерПроката; 
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыРабот.Клей");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВидыРаботКлей");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыРабот.НомерПроката");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = НомерПроката; 
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыРабот.Клей");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Укажите код в зеленом поле");
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВидыРабот");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыРабот.НомерПроката");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = НомерПроката; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаПередУдалением(Элемент, Отказ)
	текстр = Элементы.цвета.текущиеданные;
	Если текстр.номерпроката <>НомерПроката Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботПередУдалением(Элемент, Отказ)
	текстр = Элементы.ВидыРабот.текущиеданные;
	Если текстр.номерпроката <>НомерПроката Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ДобавлениеСтроки=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ВидыРабот.ТекущиеДанные.НомерПроката=НомерПроката;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботПриАктивизацииСтроки(Элемент)
	ЕСли ДобавлениеСтроки Тогда
		ДобавлениеСтроки=Ложь;
		Элементы.ВидыРабот.ТекущиеДанные.НомерПроката=НомерПроката;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДобавлениеСтроки=Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЦветаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ДобавлениеСтроки=Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦветаПриАктивизацииСтроки(Элемент)
	ЕСли ДобавлениеСтроки Тогда
		ДобавлениеСтроки=Ложь;
		Элементы.Цвета.ТекущиеДанные.НомерПроката=НомерПроката;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦветаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Цвета
		.ТекущиеДанные.НомерПроката=НомерПроката;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЦветаТипКраскиФактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭтоПостоянноеИзменениеВидЦветаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Это постоянное изменение?",РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры
	 
	//Вынести в отдельную процедуру
	&НаКлиенте
	Процедура ЭтоПостоянноеИзменениеВидЦветаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Элементы.Цвета.ТекущиеДанные.ВременныеИзменения_ТипКраски=Ложь;
		Иначе
			Элементы.Цвета.ТекущиеДанные.ВременныеИзменения_ТипКраски=Истина;

		КонецЕсли; 
		
	КонецПроцедуры


&НаКлиенте
Процедура ВидыРаботКлейФактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭтоПостоянноеИзменениеКлеяЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Это постоянное изменение?",РежимДиалогаВопрос.ДаНет, 60);
КонецПроцедуры
	
	 
	//Вынести в отдельную процедуру
	&НаКлиенте
	Процедура ЭтоПостоянноеИзменениеКлеяЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Элементы.ВидыРабот.ТекущиеДанные.ВременныеИзменения_Клей=Ложь;
		Иначе
			Элементы.ВидыРабот.ТекущиеДанные.ВременныеИзменения_Клей=Истина;

		КонецЕсли; 
		
	КонецПроцедуры


