#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НайтиПоКоду(КодВидаПособия) Экспорт
	Если КодВидаПособия = "1" Тогда
		Возврат ПособиеПоВременнойНетрудоспособности;
	ИначеЕсли КодВидаПособия = "2" Тогда
		Возврат ПособиеПоБеременностиИРодам;
	ИначеЕсли КодВидаПособия = "4" Тогда
		Возврат ЕдиновременноеПособиеПриРожденииРебенка;
	ИначеЕсли КодВидаПособия = "5" Тогда
		Возврат ЕжемесячноеПособиеПоУходуЗаРебенком;
	ИначеЕсли КодВидаПособия = "6" Тогда
		Возврат ПособиеВСвязиСНесчастнымСлучаемНаПроизводстве;
	ИначеЕсли КодВидаПособия = "87" Тогда
		Возврат ПустаяСсылка();
	ИначеЕсли КодВидаПособия = "88" Тогда
		Возврат ПустаяСсылка();
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция НайтиПоПричинеНетрудоспособности(ПричинаНетрудоспособности) Экспорт
	Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
		Возврат ПособиеПоБеременностиИРодам;
	ИначеЕсли ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве
		Или ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.Профзаболевание Тогда
		Возврат ПособиеВСвязиСНесчастнымСлучаемНаПроизводстве;
	Иначе
		Возврат ПособиеПоВременнойНетрудоспособности;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли