#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеЧислом(Значение) Экспорт
	// Признак типа приказа страхователя/документа:
	Если Значение = ПриказОДосрочномВыходеНаРаботу Тогда
		Возврат 1; // О преждевременном выходе на работу.
	ИначеЕсли Значение = ПриказОбУвольнении Тогда
		Возврат 2; // О прекращении трудовых отношений.
	ИначеЕсли Значение = СвидетельствоОСмертиРебенка Тогда
		Возврат 3; // О смерти ребенка.
	ИначеЕсли Значение = ПрекращениеОснованийДляВыплатыПособия Тогда
		Возврат 4; // О прекращение оснований для выплаты пособия.
	ИначеЕсли Значение = ИнойПриказИлиДокумент Тогда
		Возврат 5; // Иное.
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли