
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДанныеВыбора = Новый СписокЗначений;
	
	СтатусыИсключения = Новый Массив;
	СтатусыИсключения.Добавить(	Перечисления.СтатусыПриглашений.УдалитьТребуетсяОтсоединить);
	Если Не НастройкиЭДО.ИспользуетсяПрямойОбменЭлектроннымиДокументами() Тогда
		СтатусыИсключения.Добавить(	Перечисления.СтатусыПриглашений.НеТребуется);
	КонецЕсли;
	
	Для Каждого Статус Из Перечисления.СтатусыПриглашений Цикл
		Если СтатусыИсключения.Найти(Статус) = Неопределено Тогда
			ДанныеВыбора.Добавить(Статус);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
