
&НаКлиенте
Процедура Лико_РасчетДляТендераПосле(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Спецификацию сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("Ссылка", Объект.Ссылка));
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "РасчетЗаказаДляТендера");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета);

КонецПроцедуры

&НаКлиенте
Процедура Лико_ЗаполнитьИзРаботВместо(Команда)
	
	Для каждого стр из объект.ВидыРабот Цикл 
		
		Если стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Печать") Тогда  
			Продолжить				
		КонецЕсли;  
		
		Если стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Ламинация") Тогда  
			Если ЗначениеРеквизита(стр.РабочийЦентр, "ПорядковыйНомер") = 300 Тогда
				СтрокиЛаминация = объект.Цвета.НайтиСтроки(новый структура("НомерПроката, НомерВарианта", стр.НомерПроката, стр.НомерВарианта)); 
				Если СтрокиЛаминация.Количество() <> 0 Тогда
					СтрокаЛаминация = СтрокиЛаминация[0]; 
					СтрокаЛаминация.Нарезка = стр.нарезка;
					СтрокаЛаминация.материал = стр.материал; 
					СтрокаЛаминация.ПроцентЗаливки = стр.ПроцентЗаливки; 
					Если не ЗначениеЗаполнено( СтрокаЛаминация.ТипКраски) Тогда
						Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
							СтрокаЛаминация.ТипКраски	 = стр.клей; 
							СтрокаЛаминация.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
						Иначе
							СтрокаЛаминация.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
							СтрокаЛаминация.Номенклатура = стр.клей;
						КонецЕсли; 
					КонецЕсли;
				КонецЕсли;

			Иначе 
				СтрокиЛаминация = объект.Цвета.НайтиСтроки(новый структура("НомерПроката, НомерВарианта, ВидСекции", стр.НомерПроката, стр.НомерВарианта, ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЛаминацияФлексо")));
				Если СтрокиЛаминация.Количество() = 0 Тогда  
					НоваяСтрока = объект.Цвета.Добавить();
					НоваяСтрока.Нарезка 	   = стр.нарезка;
					НоваяСтрока.материал	   = стр.материал; 
					НоваяСтрока.ПроцентЗаливки = стр.ПроцентЗаливки; 
					НоваяСтрока.НомерВарианта  = стр.НомерВарианта; 

					Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
						НоваяСтрока.ТипКраски	 = стр.клей; 
						НоваяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
					Иначе
						НоваяСтрока.ТипКраски	 = стр.клей.ЦеноваяГруппа;
						НоваяСтрока.Номенклатура = стр.клей;
					КонецЕсли;	
				
                    НоваяСтрока.ТипКраски 	   = стр.Клей;    
					НоваяСтрока.ВидСекции	   = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЛаминацияФлексо");  
					НоваяСтрока.РабочийЦентр   = стр.РабочийЦентр;  
					НоваяСтрока.НомерПроката   = стр.НомерПроката;  
					НоваяСтрока.КлючСтроки 	   = новый УникальныйИдентификатор;
				Иначе
					СтрокаЛаминация = СтрокиЛаминация[0]; 
					СтрокаЛаминация.Нарезка = стр.нарезка;
					СтрокаЛаминация.материал = стр.материал; 
					СтрокаЛаминация.ПроцентЗаливки = стр.ПроцентЗаливки; 
					Если не ЗначениеЗаполнено( СтрокаЛаминация.ТипКраски) Тогда
						Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
							СтрокаЛаминация.ТипКраски	 = стр.клей; 
							СтрокаЛаминация.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
						Иначе
							СтрокаЛаминация.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
							СтрокаЛаминация.Номенклатура = стр.клей;
						КонецЕсли; 
					КонецЕсли;
					
				КонецЕсли;

	        КонецЕсли;
			
		ИначеЕсли стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное") или стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное") Тогда	
			
			НоваяСтрокаГТ = объект.Цвета.Добавить();
			НоваяСтрокаГТ.Нарезка 	   	 = стр.нарезка;
			НоваяСтрокаГТ.материал	   	 = стр.материал; 
			НоваяСтрокаГТ.ПроцентЗаливки = стр.ПроцентЗаливки;   
			НоваяСтрокаГТ.НомерВарианта  = стр.НомерВарианта; 

			Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
				НоваяСтрокаГТ.ТипКраски	 = стр.клей; 
				НоваяСтрокаГТ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
			Иначе
				НоваяСтрокаГТ.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа") ;
				НоваяСтрокаГТ.Номенклатура = стр.клей;
			КонецЕсли;  
			НоваяСтрокаГТ.РабочийЦентр   = стр.РабочийЦентр;  
			НоваяСтрокаГТ.НомерПроката   = стр.НомерПроката;  
			НоваяСтрокаГТ.КлючСтроки 	 = новый УникальныйИдентификатор;  
			НоваяСтрокаГТ.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское"); 
			Если стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное") Тогда		
				НоваяСтрокаГТ.НаправлениеПротяжки = ПредопределенноеЗначение("Перечисление.Лико_НаправленияПротяжки.Поперечное"); 			
			ИначеЕсли  стр.ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное") Тогда	
				НоваяСтрокаГТ.НаправлениеПротяжки = ПредопределенноеЗначение("Перечисление.Лико_НаправленияПротяжки.Продольное");  			
			КонецЕсли;    
			
		Иначе
			ВидСекции = ЗначениеРеквизита(стр.ВидРабот, "Лико_ВидСекции");	
			СтрокиЦвета = объект.Цвета.НайтиСтроки(новый структура("НомерПроката, НомерВарианта, ВидСекции", стр.НомерПроката, стр.НомерВарианта, ВидСекции ));    
			Если СтрокиЦвета.Количество() = 0 Тогда  
				НоваяСтрока = объект.Цвета.Добавить();  
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
                НоваяСтрока.ВидСекции =  ВидСекции;
				
				Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
					НоваяСтрока.ТипКраски	 = стр.клей; 
					НоваяСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
				Иначе
					НоваяСтрока.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
					НоваяСтрока.Номенклатура = стр.клей;
				КонецЕсли;	
				
				НоваяСтрока.ТипКраски 	   = стр.Клей;    

				Если ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда
					НоваяСтрока.КоличествоРучьевНумератора  = стр.Дополнительно; 	
				Иначе 
					НоваяСтрока.Подача = стр.Дополнительно; 	
				КонецЕсли;
				
				НоваяСтрока.КлючСтроки 	   = новый УникальныйИдентификатор;
			Иначе
				СтрокаЦвета = СтрокиЦвета[0]; 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);

				Если не ЗначениеЗаполнено(СтрокаЦвета.ТипКраски) Тогда
					Если ТипЗнч(стр.клей) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
						СтрокаЦвета.ТипКраски	 = стр.клей; 
						СтрокаЦвета.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") 
					Иначе
						СтрокаЦвета.ТипКраски	 = ЗначениеРеквизита(стр.клей, "ЦеноваяГруппа");
						СтрокаЦвета.Номенклатура = стр.клей;
					КонецЕсли; 
				КонецЕсли;   
				 
				Если ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда
					НоваяСтрока.КоличествоРучьевНумератора  = стр.Дополнительно; 	
				Иначе 
					НоваяСтрока.Подача = стр.Дополнительно; 	
				КонецЕсли;

				
			КонецЕсли;

			
		КонецЕсли;  

		
	КонецЦикла;

КонецПроцедуры


//&НаСервере
//&Вместо("Лико_ЭтикеткиИТиражМетражНаСервере")
//Процедура Лико_Лико_ЭтикеткиИТиражМетражНаСервере()
//	Отбор = Новый Структура("НомерВарианта", НомерВарианта);	
//	
//	Для Каждого текСтрПараметра из Объект.ПараметрыШтампа.НайтиСтроки(Отбор) Цикл 
//		ТекВидВырубки = текСтрПараметра.ВидВырубки;
//		Если Не (ТекВидВырубки = 2 ИЛИ ТекВидВырубки = 6 ИЛИ ТекВидВырубки = 10) Тогда 
//			текЭтикетокНаЛистеПечати =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(текСтрПараметра, текСтрПараметра.ВидВырубки, Объект);
//			Если текЭтикетокНаЛистеПечати <> текСтрПараметра.ЭтикетокНаЛистеПечати Тогда
//				текСтрПараметра.ЭтикетокНаЛистеПечати 	= текЭтикетокНаЛистеПечати;
//				текБылиИзменения = Истина;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если Не (ТекВидВырубки = 1 ИЛИ ТекВидВырубки = 3 ИЛИ ТекВидВырубки = 4 ИЛИ ТекВидВырубки = 5
//			ИЛИ ТекВидВырубки = 7 ИЛИ ТекВидВырубки = 8 ИЛИ ТекВидВырубки = 11 ИЛИ ТекВидВырубки = 13 ИЛИ ТекВидВырубки = 14 ИЛИ ТекВидВырубки = 15) Тогда 
//			текЭтикетокНаЛистеИндиго =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(текСтрПараметра, текСтрПараметра.ВидВырубки, Объект);
//			Если текЭтикетокНаЛистеИндиго <> текСтрПараметра.ЭтикетокНаЛистеИндиго Тогда
//				текСтрПараметра.ЭтикетокНаЛистеИндиго 	= текЭтикетокНаЛистеИндиго;
//				текБылиИзменения = Истина;
//			КонецЕсли;
//		КонецЕсли;			
//	КонецЦикла;

//КонецПроцедуры

//&НаСервере
//&Вместо("ЗаполнитьПараметрыСтоимостиНаСервере")
//Процедура Лико_ЗаполнитьПараметрыСтоимостиНаСервере()
//	
//	Объект.Стоимость.Очистить();
//	Объект.Нормативы.Очистить();

//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	СпецификацииВариантыСпецификации.Ссылка КАК Ссылка,
//	|	СпецификацииВариантыСпецификации.НомерСтроки КАК НомерВарианта,
//	|	МАКСИМУМ(СпецификацииВидыРабот.РабочийЦентр) КАК РабочийЦентр,
//	|	МАКСИМУМ(Лико_СпецификацииПараметрыШтампа.Нарезка.Размер / 1000) КАК НарезкаРазмер
//	|ИЗ
//	|	Справочник.Лико_Спецификации.ВариантыСпецификации КАК СпецификацииВариантыСпецификации
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Спецификации.ВидыРабот КАК СпецификацииВидыРабот
//	|		ПО СпецификацииВариантыСпецификации.НомерСтроки = СпецификацииВидыРабот.НомерВарианта
//	|			И СпецификацииВариантыСпецификации.Ссылка = СпецификацииВидыРабот.Ссылка
//	|			И (СпецификацииВидыРабот.НомерПроката = 1)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Спецификации.ПараметрыШтампа КАК Лико_СпецификацииПараметрыШтампа
//	|		ПО СпецификацииВариантыСпецификации.Ссылка = Лико_СпецификацииПараметрыШтампа.Ссылка
//	|			И СпецификацииВариантыСпецификации.НомерСтроки = Лико_СпецификацииПараметрыШтампа.НомерВарианта
//	|ГДЕ
//	|	СпецификацииВариантыСпецификации.Ссылка = &спецификация
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СпецификацииВариантыСпецификации.НомерСтроки,
//	|	СпецификацииВариантыСпецификации.Ссылка";
//	Запрос.УстановитьПараметр("Спецификация", Объект.ссылка);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл		
//       	нстр = Объект.стоимость.Добавить();
//		нстр.ключстроки = Новый УникальныйИдентификатор;
//		нстр.НомерВарианта = Выборка.НомерВарианта;	
//        нстр.РабочийЦентр =  Выборка.РабочийЦентр;
//        нстр.количество = Объект.Товары.Итог("Количество");
//		нстр.ПогонныйМетраж = РассчитатьМетражНаСервере(нстр.количество*1000, нстр.НомерВарианта);
//		Если ЗначениеЗаполнено(Выборка.НарезкаРазмер) Тогда 
//			нстр.КвадратныйМетраж =нстр.погонныйметраж*Выборка.НарезкаРазмер; 
//	    КонецЕсли;		
//	КонецЦикла;

//КонецПроцедуры

//&НаКлиенте
//Процедура Лико_ПараметрыШтампаЭтМЭРПриИзмененииВместо(Элемент)
//	Заказ = Элементы.ПараметрыШтампа.ТекущиеДанные;
//	Если  Заказ.ВидВырубки = 6 Тогда
//		ЗаполнитьДлинуПечатиИндиго();		
//	КонецЕсли;
//КонецПроцедуры


