#Область ПрограммныйИнтерфейс   

Процедура НовыйСтатус (ЗаявкаНаРемонт,Статус,Дата=Неопределено) Экспорт //+Лико m.shenderov 25.03.2024
	
	УстановитьПривилегированныйРежим(Истина);
	Если Дата=Неопределено Тогда 
		
		Дата=ТекущаяДата();
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.Лико_СтатусыЗаявокНаРемонтПоЗакупкамЗапчастей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(ЗаявкаНаРемонт); 
	
	Если Статус<>Неопределено Тогда 	
		
		Запись=НаборЗаписей.Добавить();
		Запись.Период=Дата;
		Запись.ЗаявкаНаРемонт=ЗаявкаНаРемонт;
		Запись.Статус=Статус;
		
	КонецЕсли;
	
	
	НаборЗаписей.Записать(Истина);
	
	
КонецПроцедуры //-Лико m.shenderov 25.03.2024

#КонецОбласти

