
&НаКлиенте
&Вместо("СкопироватьВариант")
Процедура Лико_СкопироватьВариант(Команда)
	
	Если  ЭтаФорма.Модифицированность Тогда
		Ответ  = Вопрос("Перед копированием необходимо записать элемент." , РежимДиалогаВопрос.ОКОтмена);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ЭтаФорма.Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекВариантРасчета = Элементы.ТаблицаПоказателей.ОтборСтрок.ВариантРасчета;
	
	НомерВарианта = Элементы.РабочиеЦентры.ТекущиеДанные.НомерВарианта;
	Если Не ЗначениеЗаполнено(НомерВарианта) Тогда
		Сообщить("Укажите номер варианта, который нужно заполнить!!!");
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерВарианта", НомерВарианта);
	Отбор.Вставить("ВариантРасчета", ТекВариантРасчета);
	Если Команда.Имя  = "СкопироватьВариантПоказатели" Тогда  
		МассивСтрок = Объект.ТаблицаПоказателей.НайтиСтроки(Отбор);
		Для каждого  ЭлементМассива из МассивСтрок Цикл
			Объект.ТаблицаПоказателей.Удалить( ЭлементМассива);
		КонецЦикла;

	Иначе 
		МассивСтрок = Объект.ТаблицаЦветов.НайтиСтроки(Отбор);
		Для каждого  ЭлементМассива из МассивСтрок Цикл
			Объект.ТаблицаЦветов.Удалить( ЭлементМассива);
		КонецЦикла;

	КонецЕсли;
		
	//Определяем вариант расчета, который будем копировать
	КопируемыйВариантРасчета = 1;
	Если Не ВвестиЧисло(КопируемыйВариантРасчета, "Введите номер варианта расчета", 10, 0) Тогда
		Возврат;
	КонецЕсли;

	НомерКопии = 1;
	Если ВвестиЧисло(НомерКопии, "Введите номер копируемого варианта", 10, 0) Тогда
		СкопироватьВариантНаСервере(Команда.Имя, НомерВарианта, ТекВариантРасчета, НомерКопии, КопируемыйВариантРасчета);
	КонецЕсли;	

КонецПроцедуры


