#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция КодДляВыгрузки(ИспользованиеПроисхождениеТовара) Экспорт
	
	Если ИспользованиеПроисхождениеТовара = Перепродажа Тогда
		Возврат "1";
	ИначеЕсли ИспользованиеПроисхождениеТовара = Смешение Тогда
		Возврат "2";
	ИначеЕсли ИспользованиеПроисхождениеТовара = Переработка Тогда
		Возврат "3";
	ИначеЕсли ИспользованиеПроисхождениеТовара = Производство Тогда
		Возврат "4";
	ИначеЕсли ИспользованиеПроисхождениеТовара = Иное Тогда
		Возврат "5";
	Иначе
		Возврат "0";
	КонецЕсли;
	
КонецФункции

Функция НужноВыгружатьСведенияОСделке(ИспользованиеПроисхождениеТовара) Экспорт
	
	Возврат Не ИспользованиеПроисхождениеТовара = Переработка
		И Не  ИспользованиеПроисхождениеТовара = Производство
		И Не ИспользованиеПроисхождениеТовара = Иное;
	
КонецФункции

#КонецЕсли