#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получает предсталение значений перечисления на основном языке.
// Предсталения должны соответствовать синонимам значений
// 
// Параметры:
//  ТипОбъектаНазначения - ПеречислениеСсылка.ТипыОбъектовНазначений - Тип объекта назначения
// 
// Возвращаемое значение:
//  Строка - Тип объекта назначения на основном языке
Функция ТипОбъектаНазначенияНаОсновномЯзыке(ТипОбъектаНазначения) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	ПредставлениеТипаОбъектаНазначения = "";
	
	Если ТипОбъектаНазначения = Давалец Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Давалец';
													|en = 'Material provider'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = Переработчик Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Переработчик';
													|en = 'Subcontractor'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ДоговорСДавальцем Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Договор с давальцем';
													|en = 'Contract with material provider (for processing)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ДоговорСПереработчиком Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Договор с переработчиком';
													|en = 'Contract with subcontractor'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗакупкаПодПринципала Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Закупка под принципала';
													|en = 'Purchase for principal'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = НаправлениеДеятельности Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Направление деятельности';
													|en = 'Line of business'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказДавальца Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ давальца (2.4)';
													|en = 'Subcontracting sales order (2.4)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказДавальца2_5 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ давальца';
													|en = 'Subcontracting sales order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказМатериаловВПроизводство Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ материалов в производство';
													|en = 'Material order for shop floor stockroom'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаСборку Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на сборку (разборку)';
													|en = 'Kitting order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаПеремещение Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на перемещение';
													|en = 'Transfer order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаПроизводство Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на производство (2.1)';
													|en = 'Production order (2.1)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказПереработчику Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ переработчику (2.4)';
													|en = 'Subcontracting purchase order (2.4)'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказПереработчику2_5 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ переработчику';
													|en = 'Subcontracting purchase order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаРемонт Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на ремонт';
													|en = 'R&M order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаВнутреннееПотребление Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на внутреннее потребление';
													|en = 'Inventory consumption order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказКлиента Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ клиента';
													|en = 'Sales order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаказНаПроизводство2_2 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заказ на производство';
													|en = 'Production order'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЗаявкаНаВозвратТоваровОтКлиента Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Заявка на возврат товаров от клиента';
													|en = 'Sales return request'", КодОсновногоЯзыка);	
	ИначеЕсли ТипОбъектаНазначения = ЭтапПроизводства2_2 Тогда
		ПредставлениеТипаОбъектаНазначения = НСтр("ru = 'Этап производства';
													|en = 'Production stage'", КодОсновногоЯзыка);	
	КонецЕсли;	
	
	Возврат ПредставлениеТипаОбъектаНазначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли