
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Лико_РезультатыТестированияМатериалов
	Движения.Лико_РезультатыТестированияМатериалов.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
				
		СтрокиТестов = тесты.НайтиСтроки(новый структура("КлючСтроки", ТекСтрокаТовары.КлючСтроки));
		Для каждого стр из СтрокиТестов цикл  
			
			Движение = Движения.Лико_РезультатыТестированияМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.Партия = ТекСтрокаТовары.Партия;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура; 
			Движение.Серия = ТекСтрокаТовары.Серия;

			
			Движение.Тест = стр.Тест; 

			Движение.РезультатТеста = стр.Результат; 
			Движение.Примечание = стр.Примечание;
			Движение.Результат = ТекСтрокаТовары.Результат;
			Движение.ВидОперации = ВидОперации;
		КонецЦикла;
		
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Результат",Перечисления.Лико_ДаНет.Нет));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Результат = Перечисления.Лико_ДаНет.Нет;
	Иначе
		Результат = Перечисления.Лико_ДаНет.Да;
	КонецЕсли;
	
КонецПроцедуры
