
&НаКлиенте
Процедура Лико_НазадВместо(Команда)
	Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Инструкция,"Тип")=ПредопределенноеЗначение("Перечисление.ТС_ТипыИнструкцийИТестов.Тест") Тогда
		Попытка
			
			
			ПолучитьДокументHTML(Элементы.HTML.Документ.documentElement.innerHTML).ПолучитьЭлементыПоИмени("span");
			
			ДокументHTML =ПолучитьДокументHTML(Элементы.HTML.Документ.documentElement.innerHTML);	
			
			Для каждого Узел  Из ДокументHTML.ПолучитьЭлементыПоИмени("span")  Цикл
				Если Узел.ИмяКласса="freebirdFormviewerViewHeaderGradeFraction freebirdSolidBackground" Тогда
					Стр    =Узел.ТекстовоеСодержимое;
					Массив =СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"/");
					Если Массив.Количество()=2 Тогда
						Ответы   =Число(Массив[0]);
						Вопросы  =Число(Массив[1]);
					КонецЕсли;
					
					
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
	КонецЕсли;
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
&Вместо("ПросмотрКартинки")
Процедура Лико_ПросмотрКартинки()
	Тип=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Инструкция,"Тип");
	Если Тип=ПредопределенноеЗначение("Перечисление.ТС_ТипыИнструкцийИТестов.Инструкция") Тогда 

		Попытка
			ЕСли ИмяФайлаИсточник=ПутьКФайлу Тогда
				Возврат;
			КонецЕсли;

			HTML=Неопределено;
			ИмяФайлаИсточник	=ПутьКФайлу;
			ИмяФайла			=Неопределено;
			Расширение			=Неопределено;

			ПолучитьИмяРасширение(ИмяФайлаИсточник, ИмяФайла,Расширение);

			Если ВРег(Расширение)="PDF" Тогда
				Элементы.СтраницаHTML.Видимость		=Истина;
				Элементы.СтраницаРисуонк.Видимость	=Ложь;

				ИмяВременногоФайла = ПолучитьИмяВременногоФайла(); 
				КопироватьФайл(ПутьКФайлу,ИмяВременногоФайла);

				HTML = HttpАдресПросмотраPDF + ИмяВременногоФайла;
				//HTML="http://pdf.okil.ru/pdf-viewer?file="+ИмяВременногоФайла;

			Иначе

				Элементы.СтраницаHTML.Видимость		=Ложь;
				Элементы.СтраницаРисуонк.Видимость	=Истина;

				ЕстьСкан = ЗначениеЗаполнено(ИмяФайлаИсточник);
				Если ЕстьСкан Тогда
					/// Проверяем физическое наличие скана
					Фл = Новый Файл(ИмяФайлаИсточник);
					Если Не Фл.Существует() Тогда
						ЕстьСкан = Ложь;
					КонецЕсли;
				КонецЕсли;

				Если ЕстьСкан Тогда
					Картинка = Новый Картинка(ИмяФайлаИсточник); 
					Предпросмотр = ПоместитьВоВременноеХранилище(Картинка, ЭтаФорма.УникальныйИдентификатор);
				Иначе
					Предпросмотр = "";
				КонецЕсли; 	
			КонецЕсли;

		Исключение
			//ОписаниеОшибки()
		КонецПопытки;

	ИначеЕсли Тип=ПредопределенноеЗначение("Перечисление.ТС_ТипыИнструкцийИТестов.Тест") Тогда 
		урл=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Инструкция,"url");
		Массив=ПолучитьМассивПараметровТеста();
		ПерваяСтрока=Истина;
		Для каждого ЗнМассива Из Массив Цикл
			Если ПерваяСтрока Тогда
				ПерваяСтрока=Ложь;
				урл=урл+"?"+ЗнМассива;
			Иначе
				урл=урл+"&"+ЗнМассива;
			КонецЕсли;

		КонецЦикла;
		HTML=урл; 
		Элементы.СтраницаHTML.Видимость		 =Истина;
		Элементы.СтраницаРисуонк.Видимость	 =Ложь;
		Элементы.Назад.Видимость             =Ложь;		
	КонецЕсли;




КонецПроцедуры


&НаКлиенте
&Вместо("РазвернутьОкноФормыНаВесьЭкранКлиент")
Процедура Лико_РазвернутьОкноФормыНаВесьЭкранКлиент()
	Лико_ДополнительноКлиент.РазвернутьОкноФормыНаВесьЭкран();
	Элементы.Назад.Доступность = Истина;
КонецПроцедуры

