
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Ответсвенный = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаполнитьПоОрганизации(Команда)
	
	ЗаполнитьПоОрганизацииНаСервере();
	
КонецПроцедуры 


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоОрганизацииНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Ячейка.Помещение.Лико_Организация = &Организация) КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.Номенклатура.ЦеноваяГруппа.Лико_АвтоРасчетЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура.ЦеноваяГруппа";
	Запрос.УстановитьПараметр("Организация",Объект.Организация ); 
	Запрос.УстановитьПараметр("Дата",Объект.Дата );

	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ЦеновыеГруппы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


#КонецОбласти