#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ДанныеДляЗаполненияПоЦеновойГруппеСоо(ПлощадкаПоставщика,ПлощадкаПокупателя,Период = Неопределено, ЦеновыеГруппы=Неопределено ) Экспорт 
	
	Период=?(ЗначениеЗаполнено(Период),Период, Дата(3999, 12, 31, 23, 59, 59)); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Период КАК Период,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Регистратор КАК Регистратор,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.НомерСтроки КАК НомерСтроки,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Активность КАК Активность,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПлощадкаПоставщика КАК ПлощадкаПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПлощадкаПокупателя КАК ПлощадкаПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Работа КАК Работа,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Содержание КАК Содержание,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СтатьяРасходов КАК СтатьяРасходов,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ДоговорПоставщика КАК ДоговорПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ДоговорПокупателя КАК ДоговорПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СоглашениеПоставщика КАК СоглашениеПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СоглашениеПокупателя КАК СоглашениеПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Валюта КАК Валюта,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.Цена КАК Цена,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПартнерПоставщика КАК ПартнерПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.КонтрагентПоставщика КАК КонтрагентПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПартнерПокупателя КАК ПартнерПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.КонтрагентПокупателя КАК КонтрагентПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПодразделениеПоставщика КАК ПодразделениеПоставщика,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ПодразделениеПокупателя КАК ПодразделениеПокупателя,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.СрезПоследних(
	|			&Период,
	|			ПлощадкаПоставщика = &ПлощадкаПоставщика
	|				И ПлощадкаПокупателя = &ПлощадкаПокупателя
	|				И ВЫБОР
	|					КОГДА &ЕстьФильтрЦГ
	|						ТОГДА ЦеноваяГруппа В (&ЦеновыеГруппы)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("ПлощадкаПоставщика",ПлощадкаПоставщика ); 
	Запрос.УстановитьПараметр("ПлощадкаПокупателя",ПлощадкаПокупателя );
	Запрос.УстановитьПараметр("Период",Период );
	Запрос.УстановитьПараметр("ЦеновыеГруппы", ЦеновыеГруппы );
	Запрос.УстановитьПараметр("ЕстьФильтрЦГ", ЗначениеЗаполнено(ЦеновыеГруппы));
	
	
	ТЗ = Запрос.Выполнить().Выгрузить();; 
	
		
	Соответствие = Новый Соответствие;
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		
		
		Соответствие.Вставить(СтрокаТЗ.ЦеноваяГруппа,ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТЗ));
		
		
	КонецЦикла; 
	
	
	
	
	
Возврат Соответствие;	
	
	
	
КонецФункции 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли