
&НаСервереБезКонтекста
&Вместо("ЭтоСчетФактура")
Функция Лико_ЭтоСчетФактура(Док)
Массив = Новый Массив();
Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);
Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра);
Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра);
//Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра);
//Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра);


	Если ТипЗнч(Док)=Тип("ДокументСсылка.СчетФактураВыданный") И Не Док.Корректировочный И Массив.Найти(Док.Организация)<> Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;  		

КонецФункции

&НаКлиенте
&Вместо("ОбработатьВыборРаздела")
Процедура Лико_ОбработатьВыборРаздела(Элемент, ДопСведения)
	МассивРазделовНадписи = Новый Массив;
	МассивРазделовНадписи.Добавить(Элементы.нЖурналСеансов);
	МассивРазделовНадписи.Добавить(Элементы.нСтатистика);
	МассивРазделовНадписи.Добавить(Элементы.нПросмотрДокументов);
	МассивРазделовНадписи.Добавить(Элементы.нЭкспорт);
	МассивРазделовНадписи.Добавить(Элементы.нНастройки);
	Для Каждого ЭлементРаздела Из МассивРазделовНадписи Цикл		
		Если Элемент = Элементы.нЭкспорт Или Элемент = Элементы.нНастройки Тогда
			Продолжить;
		КонецЕсли;

		Если Элемент = ЭлементРаздела Тогда
			ЭлементРаздела.Шрифт = Новый Шрифт( , 8, Истина);
			ЭлементРаздела.ЦветТекста = WebЦвета.ТемноОранжевый;
		Иначе
			ЭлементРаздела.Шрифт = Новый Шрифт( , 8, Ложь);
			ЭлементРаздела.ЦветТекста = Новый Цвет(28, 85, 174);
		КонецЕсли;
	КонецЦикла;
	Если Элемент = Элементы.нЖурналСеансов Тогда
		УдалитьПустойСеанс(Элементы.Сеансы.ТекущаяСтрока); 		
		Если ПрочитатьЗначениеЭкспортнойПеременнойНаСервере("НовыйСеанс") = Истина Тогда 
			УдалитьТекущийСеансСервер();
		КонецЕсли;
		Попытка
		Элементы.Сеансы.Обновить();
		Исключение
		КонецПопытки;
		ПоказатьАктивнуюСтраницу(Элементы.ГруппаСеансыРаботы);
		ТекущийЭлемент = Элементы.Сеансы;
		Элементы.кСостояниеОбработки.Видимость = Ложь;
		Элементы.нСостояниеОбработки.Заголовок = "";
		УстановитьЗначениеЭкспортнойПеременнойНаСервере("пТекущийСеанс", Неопределено);
		Инфо.Очистить();

		//Процент = ПолучитьСтатистикуПроцентНаСервере();
		//Элементы.нОбщийПроцент.Заголовок = "Обработано " + Строка(Процент) + "%";
		//Элементы.ДокИнфо.Видимость = Ложь;
	ИначеЕсли Элемент = Элементы.нПросмотрДокументов Тогда
		Если ПрочитатьЗначениеЭкспортнойПеременнойНаСервере("НовыйСеанс") = Истина Тогда 
			УдалитьТекущийСеансСервер();
		КонецЕсли;	
		ЭлементЖурнал = СписокТиповОбъектов.Получить(0);
		ТипОбъекта = ЭлементЖурнал.Представление;		
		ТекЗначениеСписка = ЭлементЖурнал.Значение;
		ПоказатьАктивнуюСтраницу(Элементы.ГруппаЖурнал);
		//Элементы.ДокИнфо.Видимость = Ложь;
	ИначеЕсли Элемент = Элементы.нНастройки Тогда
		Форма = ПолучитьФорму("Обработка.СА_УправлениеСканАрхивом.Форма.ФормаНастройкиУправляемая",Новый Структура("Объект",Объект));
		Форма.СписокСканеров = Элементы.ТекущийСканер.СписокВыбора;
		Форма.ИндексТекущегоУстройства = Объект.ТекущийСканер;
		Форма.ТекСтраницаИмя = ?(ДопСведения = Неопределено, "",ДопСведения);
		Форма.ОткрытьМодально();
		ПерезаполнитьОбъект(Форма.Объект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Лико_ПрикрепитьСериюКПоследнемуДокументуВместо(Команда)
	УдалитьСчетФактуруВыданный();
	Если Объект.Образы.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	СА_ПроцедурыСканАрхиваКлиент.ПрикрепитьСериюКПоследнему(Объект.Образы);
	СеансИзменен = Истина;
	ОбновитьДоступностьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура Лико_РаспозатьПоПервомуВместо(Команда)
	УдалитьСчетФактуруВыданный();
	Если Объект.Образы.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	СА_ПроцедурыСканАрхиваКлиент.ПрикрепитьСериюКПоследнему(Объект.Образы);
	СеансИзменен = Истина;
	ОбновитьДоступностьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура Лико_ЗаменитьСчетФактуруНаРеализациюПосле(Команда)

	ЗаменитьСчетФактуруВыданный();
	ОбновитьДоступностьКнопок();

КонецПроцедуры 


&НаКлиенте
Процедура ЗаменитьСчетФактуруВыданный() //+Лико m.shenderov 22.02.2018
	Для каждого Образ Из Объект.Образы  Цикл
		Если ЭтоСчетФактураВсе(Образ.Объект) Тогда	
			//Образ.ОБъект=Неопределено;
			
			 Образ.ОБъект=Лико_Дополнительно.ЗначениеРеквизитаОбъекта( Образ.ОБъект,"ДокументОснование");
			 Образ.ДокументОтображение=Образ.ОБъект;
			 //Образ.ТипПечатнойФормы=Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //-Лико m.shenderov 22.02.2018


Функция ЭтоСчетФактураВсе(Док)
//Массив = Новый Массив();
//Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);
//Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра);
//Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра);
//Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияОкил.ЗначениеПараметра);
////Массив.Добавить(Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра);


	Если ТипЗнч(Док)=Тип("ДокументСсылка.СчетФактураВыданный") И Не Док.Корректировочный  Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;  		

КонецФункции

