

&НаКлиенте
Перем КэшированныеЗначения, QP Экспорт;

&НаСервере
Перем КэшированныеЗначения Экспорт;
 //используется механизмом обработки изменения реквизитов ТЧ
 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 

		ОтгрузкиИзРегистра.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		
		НормативынаОтгрузкиИзРегистра.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		НормативынаОтгрузкиИзРегистра.Параметры.УстановитьЗначениеПараметра("Регистратор", документы.РеализацияТоваровУслуг.ПустаяСсылка());  
		ЗатратыПоЗаказуДляОтгрузки.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		ЗатратыПоОтгрузке.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		ЗатратыПоОтгрузке.Параметры.УстановитьЗначениеПараметра("КлючСтроки", Новый УникальныйИдентификатор );
		ЗатратыПоОтгрузке.Параметры.УстановитьЗначениеПараметра("Регистратор", документы.РеализацияТоваровУслуг.ПустаяСсылка());
		ЗатратыПоБланкам.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		// <-- Начало Лико Яцун С. В. 21.02.2023
		ЗакрытыеМатериалы.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		Если ЗначениеЗаполнено(Объект.ДатаОтправкиВРаботу) И ПроверитьНаличиеЗакрытыхМатериалов() Тогда
			Элементы.ГруппаЗакрытыеМатериалы.Видимость = Истина;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 21.02.2023
		Возвраты.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		Возвраты.Параметры.УстановитьЗначениеПараметра("ДокументОтгрузки", Документы.РеализацияТоваровУслуг.ПустаяСсылка());

		УдаленныеОтгрузки.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		// --> Начало Лико Митюшин МФМ 29.09.2021
		ВыработкаФормщиков.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		// <-- Конец Лико Митюшин МФМ 29.09.2021
		
		ЗаполнитьНачалоПечати(); 
		// --> Начало Лико Ефимов ЕВВ 02.08.2021
	// Для пустой ссылки заполним связанные данные, т.к. для пустой ссылки не выполняется обработчик ПриЧтенииНаСервере
	Иначе
		ЗаполнитьСвязанныеДанныеНаСервере();
	// <-- Конец Лико Ефимов ЕВВ 02.08.2021
	КонецЕсли;

	//Если НЕ (Объект.ВидУпаковки=Справочники.Лико_ВидыУпаковки.Термопленка ИЛИ  Объект.ВидУпаковки=Справочники.Лико_ВидыУпаковки.ПакетыКоробки ИЛИ  Объект.ВидУпаковки=Справочники.Лико_ВидыУпаковки.Коробки
	//	ИЛИ  Объект.ВидУпаковки=Справочники.Лико_ВидыУпаковки.СтрейчПленкаКоробка  ИЛИ  Объект.ВидУпаковки=Справочники.Лико_ВидыУпаковки.ТермопленкаКоробки) Тогда 
	//КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда 
		Если ЗначениеЗаполнено(Объект.Площадка) Тогда
			Объект.Склад = Объект.Площадка.СкладГП;
		КонецЕсли;
	КонецЕсли;
	Если Не  Объект.Соглашение.Типовое Тогда
		Если (Объект.Партнер <> Объект.Соглашение.Партнер 
			// --> Начало Лико Ефимов ЕВВ 01.07.2019
			ИЛИ Объект.Соглашение.ПометкаУдаления
			ИЛИ Объект.Соглашение.Статус <> Перечисления.СтатусыСоглашенийСКлиентами.Действует) 
			// <-- Конец Лико Ефимов ЕВВ 01.07.2019
			// --> Начало Лико Ефимов ЕВВ 07.09.2021
			И НЕ ЗначениеЗаполнено(Объект.ДатаОтправкиВРаботу)
			// <-- Конец Лико Ефимов ЕВВ 07.09.2021
		Тогда
		    Объект.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснование", "Видимость", ЗначениеЗаполнено(Объект.ДокументОснование));
	 	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	      
	ИспользоватьСоглашенияСКлиентами                  = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	//ИспользоватьОтгрузкуБезПереходаПраваСобственности = ПолучитьФункциональнуюОпцию("ИспользоватьОтгрузкуБезПереходаПраваСобственности");
	ИспользоватьУпрощеннуюСхемуОплаты                 = ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВПродажах");
	ИспользоватьГрафикиОплаты                         = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты");
	//ИспользоватьНесколькоОрганизаций                  = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	//ИспользоватьНаправленияДеятельности               = ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности");

	
	ПоказатьДоходностьРентабельность();
	ПоказатьОбразцыЦвета();
	УтверждениеЦветов(); 
	//УтверждениеРабот();
	ЦветаРаботы(Истина);
	// <-- Начало Лико Яцун С. В. 13.09.2023 
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда
		Если Объект.ДопускМинус = 1 И Объект.ДопускПлюс = 0 Тогда
			ВариантыДопусков = 1;		
		ИначеЕсли Объект.ДопускМинус = 0.5 И Объект.ДопускПлюс = 0.5 Тогда
			ВариантыДопусков = 2;		
		ИначеЕсли Объект.ДопускМинус = 0 И Объект.ДопускПлюс = 1 Тогда
			ВариантыДопусков = 3;		
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 13.09.2023
	
	ПоказатьКодМатериала();
	
	//+ Лико m.shenderov 05.05.2021 	
	//Подсистема DFM
	DFMСервер.СтартDFM(ЭтаФорма);
	DFMСервер.СоздатьDFMКоманды(ЭтаФорма); 	
	//Подсистема DFM  
	//- Лико m.shenderov 05.05.2021

	// --> Начало Лико Митюшин МФМ 02.09.2021 "Кнопка 'Бога'"
	Если РольДоступна("Лико_ИзменениеПараметровВырубкиПечати") ИЛИ РольДоступна("ПолныеПрава") И ЭтаФорма.Элементы.Найти("ГруппаШтамп1") <> Неопределено Тогда 
		Команда = ЭтаФорма.Команды.Добавить("Лико_РедактироватьПараметрыШтампов");
		Команда.Заголовок = "Редактировать параметры штампов";
		Команда.Действие = "Лико_РедактироватьПараметрыШтампов";

		Элемент = ЭтаФорма.Элементы.Вставить("Лико_РедактироватьПараметрыШтампов", Тип("ДекорацияФормы"), ЭтаФорма.Элементы.ГруппаПараметрыШтампа,ЭтаФорма.Элементы.ГруппаШтамп1);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Гиперссылка = Истина;
		Элемент.Заголовок = "Редактировать параметры";
		Элемент.Шрифт = Новый Шрифт(,11);
		Элемент.ЦветТекста = WebЦвета.ТемноСерый;
		Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;  
		Элемент.УстановитьДействие("Нажатие", "Лико_РедактироватьПараметрыШтампов");
		//Элемент.ИмяКоманды = "Лико_РедактироватьПараметрыШтампов";
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 02.09.2021 "Кнопка 'Бога'"
	
	// <-- Начало Лико Яцун С. В. 04.12.2023
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке")) Тогда
		Элементы.РаппортМеняли.Видимость = Ложь;	
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 04.12.2023
	// <-- Начало Лико Яцун С. В. 06.05.2025 
	Если ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда
		ФормаШтампаМассив = Объект.ШтампВырубной.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОснасткаВидФормаШтампа")));
		Если ФормаШтампаМассив.Количество() <> 0 Тогда
			ФормаШтампа = ФормаШтампаМассив[0].Значение;	
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 06.05.2025
	УстановитьВидимостьЭлементов(); 
	
	// <-- Начало Лико Яцун С. В. 24.03.2025 
	СкрытьКомандыВПодменюЕЩЕ();
	// <-- Конец Лико Яцун С. В. 24.03.2025
		
	//субботин 06.06.23
	ЗаполнитьТипЗаливка(); 
    // <-- Начало Лико Яцун С. В. 18.10.2023 
	ЗаполнитьВидОснастка();
	//ЗаполнитьВалФорма();  
	// <-- Конец Лико Яцун С. В. 18.10.2023	
	ОтображатьОбъемДляКлиента = УправлениеСвойствами.ЗначениеСвойства(Объект.Партнер,"Стикер_ОтображатьОбъем");
	Для каждого стр из Объект.Товары Цикл
		Если ЗначениеЗаполнено(стр.цена) И ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
			ТекПроцентНДС = стр.СтавкаНДС.Ставка;
			стр.ЦенаБезНДС = стр.цена/(1+ТекПроцентНДС/100);
		КонецЕсли;	
	
		Если ЗначениеЗаполнено(ОтображатьОбъемДляКлиента) Тогда
			Если ОтображатьОбъемДляКлиента Тогда
				Элементы.ТоварыОбъем.Видимость = Истина;
				стр.Объем = УправлениеСвойствами.ЗначениеСвойства(стр.Номенклатура,"Стикер_Объем");
			Иначе
				Элементы.ТоварыОбъем.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		//СтруктураДействий = Новый Структура;
		//СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул",Новый Структура("Номенклатура", "Артикул"));
		//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стр, СтруктураДействий, КэшированныеЗначения);
		
		//Заполним Артикул по справочнику ВерсииНоменклатуры 
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			стр.Артикул = ПолучитьАртикулИзСправочникаВерсииНоменклатуры(стр.Номенклатура,стр.ВерсияНоменклатуры);
			стр.Версия = стр.ВерсияНоменклатуры.Версия;
			СкрытьЛишниеКнопкиДляНоменклатурыDFM(стр.Номенклатура);

			Стр.НаименованиеДляДокументов = Стр.Номенклатура.НаименованиеПолное;
		КонецЕсли;
		// --> Начало Лико Ефимов ЕВВ 13.05.2021
		//Если ЗначениеЗаполнено(Стр.ЧестныйЗнак) Тогда
		//	ЗаполнитьЗначенияСвойств(Стр, Стр.ЧестныйЗнак, "Gtin,ДатаЭмиссии");
		//КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 13.05.2021 
		
		// <-- Начало Лико Яцун С. В. 21.04.2025 
		стр.КартинкаНамотки = ПолучитьКартинкуНамотки(стр.Направление.Код);
		// <-- Конец Лико Яцун С. В. 21.04.2025
		// <-- Начало Лико Яцун С. В. 10.12.2025 
		Если НЕ ЗадатьВопросОбИзмененииСтавкиНДС И ТекущаяДата() >= Дата('20260101') Тогда
			Если Параметры.Свойство("ЗаказКопирования") Тогда
				Для каждого СтрНДС из Параметры.ЗаказКопирования.Товары Цикл 
					Если СтрНДС.СтавкаНДС.Ставка = 20 Тогда
						ЗадатьВопросОбИзмененииСтавкиНДС = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
				Для каждого СтрНДС из Параметры.ЗначениеКопирования.Товары Цикл 
					Если СтрНДС.СтавкаНДС.Ставка = 20 Тогда
						ЗадатьВопросОбИзмененииСтавкиНДС = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 10.12.2025
	КонецЦикла;	 
	
	Для каждого стр из Объект.РасчетТиражей Цикл 
		Если ЗначениеЗаполнено(стр.Цена) Тогда   
			стр.ЦенаБезНДС = стр.Цена*100/122;	
		КонецЕсли;
	КонецЦикла;

	// --> Начало Лико Яцун 26.04.2022
	ДоступностьУтилизироватьИзлишки();
	// <-- Конец Лико Яцун 26.04.2022
	
	Если НЕ (РольДоступна("Лико_ДобавлениеИзменениеГлубокойОснастки") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Элементы.ФормыГлубокой.Доступность = Ложь;	
	КонецЕсли;

	// <-- Начало Лико Яцун С. В. 24.09.2024 
	ВидимостьФормыГлубокой();
	// <-- Конец Лико Яцун С. В. 24.09.2024
	
	Если Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор И Объект.РабочийЦентр.ВидРабочегоЦентра <> Справочники.ВидыРабочихЦентров.MPS Тогда
		Элементы.Товары.ИзменятьСоставСтрок = Ложь;
	Иначе
		Элементы.Товары.ИзменятьСоставСтрок = Истина;
	КонецЕсли;
	
	ДобавитьУсловноеОформление();
	
	Если Объект.Цвета.Количество() >= 10 Тогда
		Элементы.Цвета.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
	Иначе
		Элементы.Цвета.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
	КонецЕсли;
		
	// --> Начало Лико Ефимов ЕВВ 15.09.2021
	Если РольДоступна("ПолныеПрава") Тогда
		Если Элементы.ТипЗаказа.СписокВыбора.НайтиПоЗначению(Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор) = Неопределено Тогда
			Элементы.ТипЗаказа.СписокВыбора.Добавить(Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор);
		КонецЕсли;
	КонецЕсли; 	
	// <-- Конец Лико Ефимов ЕВВ 15.09.2021 
	
	// --> Начало Лико Субботин 09.09.2022 
	//Проверка изменений материалов
	КонтрольныйХэш =  ВернутьКонтрольныйХэш();
	// <-- Конец Лико Субботин 09.09..2022 	   
	
	// <-- Начало Лико Яцун С. В.   
	К_Дох = Лико_Планирование.ПолучитьКоэффициентНалоговВДоходности(ТекущаяДата(), Объект.Площадка);
	// <-- Конец Лико Яцун С. В. 
	
	// --> Начало Лико Ефимов ЕВВ 17.09.2024
 	НовыйМеханизмСозданияФорм = Лико_Дополнительно.НовыйМеханизмСозданияФорм(Объект.Площадка.Организация, ТекущаяДата());
	Элементы.ЦветаКопироватьФормы.Видимость = НовыйМеханизмСозданияФорм;
	Элементы.ЦветаЗаказФорм.Видимость = НовыйМеханизмСозданияФорм;
	Элементы.ФормаСоздатьНовыйССохранениемФорм.Видимость = НовыйМеханизмСозданияФорм;
   	// <-- Конец Лико Ефимов ЕВВ 17.09.2024 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьСвязанныеДанныеНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.ГруппаСекции.Видимость = ПроверитьДоступностьНаСервере("ПолныеПрава");
	
	// --> Начало Лико Ефимов ЕВВ 31.07.2023
	ЗначениеПереключателяГруппыПроизводствоПриИзменении();
	// <-- Конец Лико Ефимов ЕВВ 31.07.2023 
	
	// <-- Начало Лико Яцун С. В. 24.03.2025 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьЗаголовокФормы(); 
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 24.03.2025
	// <-- Начало Лико Яцун С. В. 10.12.2025 
	Если ЗадатьВопросОбИзмененииСтавкиНДС Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииСтавкиНДС", ЭтотОбъект),"Меняется ставка НДС, увеличить цену?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 10.12.2025
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЗаписьПослеОтветаНаВопросОбИзмененииНДС") Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкиИОбработкиПередЗаписью(Отказ,ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	DFMКлиент.ПередЗаписью(ЭтаФорма,Отказ);
	////Подсистема DFM
					
	Если ЗначениеЗаполнено(Объект.ДатаОтправкиВРаботу) И НЕ ПроверитьДоступностьНаСервере("ПолныеПрава") Тогда 	
			//--> o.pukhova 05042021
			//Добавили возможность изменения собственных выполненных заказов Менеджера
			//Если Не (ПроверитьДоступностьНаСервере("Лико_ЗакрытиеОтгрузки") ИЛИ (ПроверитьДоступностьНаСервере("Лико_ИзменениеВыполненныхЗаказов") И ПользователиКлиентСервер.ТекущийПользователь() <> Объект.Менеджер)) Тогда 
			Если Не (ПроверитьДоступностьНаСервере("Лико_ЗакрытиеОтгрузки") ИЛИ ПроверитьДоступностьНаСервере("Лико_ИзменениеВыполненныхЗаказов")) Тогда 
				Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Выполнен") ИЛИ Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Закрыт") Тогда
					Сообщить("Данный заказ уже выполнен!");	
					Отказ = Истина;
				ИначеЕсли НЕ ПараметрыЗаписи.Свойство("БылВопросПередЗаписью") ТОгда
						Отказ = Истина;
						//Режим = РежимДиалогаВопрос.ДаНет;
						//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПереотправкеВРаботу", ЭтаФорма,Параметры);
						//ПоказатьВопрос(Оповещение, НСтр("ru = 'Данный заказ находится на производстве, 
						//|при его изменении необходимо направить его новую версию в работу. 
						//|Направить заказ в работу?'"), Режим,0);  
						
						//+ Субботин 11.10.22
						ВыполняемаяОбработка = НайтиВПФ("Обработка ""Причины замены заказов""");
						Если ВыполняемаяОбработка.Пустая() Тогда
							Возврат;
						КонецЕсли;
						ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
						ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияОбработкиПричиныЗаменыЗаказов", ЭтотОбъект);			
						ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма",  ,ЭтаФорма,,,,ОповещениеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						//-	Субботин 11.10.22
						
				КонецЕсли;	
			Иначе
				УсловиеНаправитьВработу = (Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.ВключенВПлан") ИЛИ Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Выполняется"));
	            Пересчитать_ПереотправитьЗаказВРаботу(Отказ,УсловиеНаправитьВработу,Ложь) ;
				Прочитать(); 
			КонецЕсли;
	КонецЕсли; 

КонецПроцедуры 

&НаСервере
Процедура ПроверкиИОбработкиПередЗаписью(Отказ,ПараметрыЗаписи)

	// --> Начало Субботин 01.02.23 
	Если Объект.Дата<'20241231' Тогда  
		Отказ = Истина;
		Возврат;
    КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.ДатаОтправкиВРаботу) Тогда
		
		Если НЕ ЗначениеЗаполнено(объект.ДатаУтвержденияЦветов) Тогда 
			Сообщить("Цвета не утверждены");
			Отказ = Истина;
			Возврат;
		КонецЕсли;  
		
	КонецЕсли;  
	
	// --> Начало Лико Митюшин МФМ 05.07.2021
	Если Объект.Цвета.Количество() > 1 Тогда 
		НайденныеСтрокиНомерПроката = Объект.Цвета.НайтиСтроки(Новый Структура("НомерПроката",1));
		Если НайденныеСтрокиНомерПроката.Количество() = 0 Тогда
			Сообщить("Должен быть указан 1й прокат!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;   
	
	ПроверятьВнахлест = Ложь;	 
	ПЗ_ТипЭтикеток_Кльр = Перечисления.Лико_ТипыЭтикеток.Кльр;
	Для каждого стр из Объект.Товары цикл 
		Если стр.Номенклатура.Лико_ТипЭтикетки = ПЗ_ТипЭтикеток_Кльр Тогда  
			ПроверятьВнахлест = Истина;	
			Прервать;
		КонецЕсли;			
	КонецЦикла;
	Если ПроверятьВнахлест И НЕ ЗначениеЗаполнено(объект.Внахлест) Тогда
		ОбщегоНазначения.СообщитьПользователю("поле ""Внахлест"" не заполнено", ,"Объект.Внахлест");		
		Отказ = Истина;	
		Возврат
	КонецЕсли;

	//Подсистема DFM                        
	Массив = Новый Массив(); 
	Для каждого Товар Из Объект.Товары Цикл
		Массив.Добавить(Товар.Номенклатура);
	КонецЦикла;
	
	Объект.НоменклатураDFM = DFMСервер.ЭтоНоменклатураDFM(
	Объект.РабочийЦентр,
	Объект.ТипЗаказа,
	ДатаНачалаСозданияНоменклатурыDFM,
	Объект.ДатаПервойОтправкиВРаботу,
	Массив,
	Объект.Партнер);	

	//DFMКлиент.ПередЗаписью(ЭтаФорма,Отказ);
	//Подсистема DFM

	
	// --> Начало Лико Ефимов ЕВВ 12.11.2019
	ВыполнитьПроверкуСоответствияНоменклатурыИЗаявокНаОтгрузку(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 12.11.2019

	// Кэшируем предопределенные значения, чтобы не дергать сервер в условиях и циклах
	ПЗ_ВидЗаказа_ПолныйПовтор  = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор;
	ПЗ_ВидЗаказа_ПовторСИзм    = Перечисления.Лико_ВидыЗаказов.ПовторСИзменением;
	ПЗ_ВидЗаказа_Пробник       = Перечисления.Лико_ВидыЗаказов.Пробник;
	ПЗ_ВидЗаказа_Шаблон        = Перечисления.Лико_ВидыЗаказов.Шаблон;
	ПЗ_ТипЗаказа_Термоусадка   = Перечисления.Лико_ТипыЗаказов.Термоусадка;
	ПЗ_ВидТМЦ_Краска           = Справочники.Лико_ВидыТМЦ.Краска;
	
	// --> Начало Лико Ефимов ЕВВ 29.12.2020
	Если Объект.ВидЗаказа = ПЗ_ВидЗаказа_Пробник И НЕ ЗначениеЗаполнено(Объект.ВариантОтгрузки) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для пробников необходимо заполнить вариант отгрузки", , "Объект.ВариантОтгрузки");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 29.12.2020
 	//--> o.pukhova 23042021	
	Если Объект.ТипЗаказа = ПЗ_ТипЗаказа_Термоусадка И Объект.ВидЗаказа <> ПЗ_ВидЗаказа_Пробник 
		И Объект.Цвета.Количество()>0 И НЕ Объект.ПоперечнаяРезкаТУ И Объект.Товары.Количество() > 0 И НЕ Объект.Товары[0].ПоперечнаяРезка Тогда
		Если Не ПроверитьКоректностьНаправленияТермоусадки() Тогда
			Сообщить("Для термоусадки необходимо выбирать напрвлене намотки, предназначенное только для термоусадки.");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	//<-- o.pukhova 23042021
	//--> o.pukhova 14052021	
	Если НЕ Объект.ЧестныйЗнак И ПроверитьНаличиеGTin() Тогда
		Сообщить("Вы заполнили GTin, необходимо поставить отметку Честный знак ");
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.Площадка = Справочники.Лико_Площадки.Ликофлекс И ВидРЦИндиго(Объект.РабочийЦентр) Тогда 
		МассивРазныхНоменклатур = Новый Массив;
		Для каждого Стр из Объект.Товары Цикл
			Если МассивРазныхНоменклатур.Найти(Стр.Номенклатура) = Неопределено Тогда
				МассивРазныхНоменклатур.Добавить(Стр.Номенклатура);	
			КонецЕсли;
		КонецЦикла;
		Если МассивРазныхНоменклатур.Количество() > 2 И Объект.ВидЗаказа <> ПЗ_ВидЗаказа_Шаблон И НЕ ПроверитьНаОдинаковыеGTin() Тогда
			Сообщить("Номера GTin в одном заказе должны быть одинаковыми!");
			Отказ = Истина;  
		КонецЕсли;
	КонецЕсли;
	//<-- o.pukhova 14052021
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ДокументНовый = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	
	Если ДокументНовый Тогда
			// <-- Начало Лико Яцун С. В. 21.01.2026
		Если НуженРасчетНарезки(Объект.ВидЗаказа) Тогда
			Если Объект.ВидЗаказа <> ПЗ_ВидЗаказа_ПолныйПовтор Тогда
				Объект.РучнойВводНарезки = Неопределено;
			КонецЕсли;
			//РучнойВводНарезкиПриИзменении(Неопределено);
			Если ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда
				Объект.НарезкаРасчетная = Неопределено;
				Объект.Нарезка = Неопределено;
			КонецЕсли;
			// <-- Конец Лико Яцун С. В. 21.01.2026
		КонецЕсли;
	КонецЕсли;

	УсловиеПоВидуЗаказа = (Объект.ВидЗаказа <> ПЗ_ВидЗаказа_ПолныйПовтор И Объект.ВидЗаказа <> ПЗ_ВидЗаказа_ПовторСИзм);
	Если (ДокументНовый И УсловиеПоВидуЗаказа) 
		ИЛИ НЕ Объект.ЧестныйЗнак 
		ИЛИ Объект.Цифровой Тогда
		Объект.ЗаказчикЭмиссииЧЗ = Неопределено;	
		Объект.ЭмитентЧЗ = Неопределено;	
		Объект.СтранаТовараЧЗ = Неопределено;	
		Объект.ТипКодаЧЗ = Неопределено;	
		Объект.ТипМаркировкиЧЗ = Неопределено;	
	КонецЕсли;
		
	СоответствиеВС = Новый Соответствие;
	
	Для каждого стр из Объект.Цвета Цикл
		// <-- Начало Лико Яцун С. В. 07.03.2024 
		//Если ЗначениеЗаполнено(Стр.ТипЗаливка) И Стр.ТипЗаливка = ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.Сплошная") 
		//	И ЗначениеРеквизита(Стр.ВидСекции,"Родитель") <> ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") 
		//	И НЕ Объект.Площадка = ГлЛико_Площадки.Урал Тогда
		//	стр.Форма = Неопределено;	
		//КонецЕсли;
		// <-- Конец Лико Яцун С. В. 07.03.2024
		Если стр.ВидСекции.ОтображатьВТЧРаботы Тогда 
			СоотвНомерПроката = СоответствиеВС[Стр.ВидСекции];
			Если СоотвНомерПроката = Неопределено Тогда
				СоотвНомерПроката = Новый Соответствие;
				СоответствиеВС.Вставить(Стр.ВидСекции, СоотвНомерПроката);
			КонецЕсли;
			
			НомерРаботы = СоотвНомерПроката[Стр.НомерПроката];
			НомерРаботы = ?(НомерРаботы = Неопределено, 1, НомерРаботы + 1);
			
			СоотвНомерПроката.Вставить(Стр.НомерПроката, НомерРаботы);
			Стр.НомерРаботы = НомерРаботы;       
		Иначе 
			стр.НомерРаботы = 1;
		КонецЕсли;                                                                                 
	КонецЦикла;
	
	// <-- Начало Лико Яцун С. В. 18.03.2024
	НоменклатураDatamatrix = Ложь; 
	Для Каждого Стр из Объект.Товары Цикл
		Если Найти(НРег(Строка(Стр.Номенклатура)),"datamatrix") <> 0 Тогда
			НоменклатураDatamatrix = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Объект.Datamatrix = НоменклатураDatamatrix;
	// <-- Конец Лико Яцун С. В. 18.03.2024 
	
	//ДоступностьУтилизироватьИзлишки(); //Выполняется в процедуре РасчитатьТиражМетраж()
	
	// <-- Начало Лико Яцун С. В. 28.10.2024 
	Если Объект.ЧестныйЗнак И НЕ Объект.ЧЗ И Объект.ШиринаЭтикетки <= 25 И Объект.ДлинаЭтикетки <= 25 Тогда
		НайденныеСтроки = Объект.Цвета.НайтиСтроки(Новый Структура("ВидТМЦ",ПЗ_ВидТМЦ_Краска));
		Если НайденныеСтроки.Количество() = 1 Тогда
			Объект.ЧЗ = Истина; 	
		КонецЕсли;
	ИначеЕсли Объект.ЧЗ Тогда
		НайденныеСтроки = Объект.Цвета.НайтиСтроки(Новый Структура("ВидТМЦ",ПЗ_ВидТМЦ_Краска));
		Если НЕ Объект.ЧестныйЗнак ИЛИ Объект.ШиринаЭтикетки > 25 ИЛИ Объект.ДлинаЭтикетки > 25 ИЛИ НайденныеСтроки.Количество() <> 1 Тогда
			Объект.ЧЗ = Ложь; 	
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 28.10.2024
	
	//250423 
	Если НЕ ДокументНовый 
		И (Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.ВключенВПлан 
		ИЛИ Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Выполняется
		ИЛИ Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Создан) Тогда
			
		ЗаказНаОснастку = ПолучитьЗаказНаОснастку(объект.Ссылка);
		МатериалДоЗамены = ПолучитьОсновнойМатериалДоЗамены(объект.Ссылка);
		Если МатериалДоЗамены <> объект.ОсновнойМатериал и ЗаказНаОснастку <> неопределено Тогда 
			ТекстПисьма = СтрШаблон("В заказе %1, по которому оформлены заявка на оснастку %2, изменился материал. Был %3, стал %4.",
									объект.НомерБезПрефикса, ЗаказНаОснастку, МатериалДоЗамены,  объект.ОсновнойМатериал);
			ТемаПисьма = СтрШаблон("Изменился материал в заказе %1", объект.НомерБезПрефикса);
			ОтправитьПисьмо(ТекстПисьма,ТемаПисьма,"ddavydov@okil-sato.ru");
		КонецЕсли;  
	КонецЕсли;
	// <-- Конец Субботин 01.02.23
	
	//+ Лико m.shenderov 29.12.2020
	СформироватьАвтоМонтаж(Отказ);
	//- Лико m.shenderov 29.12.2020
				
	Объект.НомерБезПрефикса = Прав(Объект.Номер,7);
	
	Объект.КоэффициентПеремотки = ПолучитьКоэффициентПеремотки();
	Если НЕ ДокументНовый Тогда
		Для каждого стр из Объект.Товары Цикл
			Если НоменклатураЯвляетсяГП(стр.номенклатура) Тогда 
				ЗаполнятьХарактеристику = ЛОжь;
				Если Не ЗначениеЗаполнено(стр.Характеристика) Тогда 
					заполнятьхарактеристику = истина; 
				Иначе
					ЗначенияРеквизитовХарактеристики = Лико_Дополнительно.ЗначенияРеквизитовОбъекта(стр.Характеристика,"Лико_ЗаказНоменклатуры,Владелец,Наименование");
					Если ЗначенияРеквизитовХарактеристики.Лико_ЗаказНоменклатуры <> Объект.Ссылка Тогда
						заполнятьхарактеристику = истина; 
					КонецЕсли;
					Если ЗначенияРеквизитовХарактеристики.Владелец <> стр.номенклатура Тогда 
						заполнятьхарактеристику = истина; 
					КонецЕсли;
				КонецЕсли;
				Если ЗаполнятьХарактеристику Тогда 
					стр.характеристика = ПолучитьХарактеристикуНаСервере(стр.номенклатура);
				Иначе 
					Если ЗначенияРеквизитовХарактеристики.Наименование <> "Заказ " + Объект.НомерБезПрефикса Тогда 
						УточнитьНаименованиеХарактеристики(стр.Характеристика, Объект.НомерБезПрефикса);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	РасчитатьТиражМетраж(); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ Отказ Тогда
		ПроверитьЧестныеЗнаки(ТекущийОбъект);
		Если ТекущийОбъект.ПоставщикМатериалаЛюбой Тогда
			ТекущийОбъект.СвойстваМатериала = Неопределено;
		ИначеЕсли ЗначениеЗаполнено(СвойстваМатериалаДляХранилища) Тогда
			ТекущийОбъект.СвойстваМатериала = Новый ХранилищеЗначения(СвойстваМатериалаДляХранилища.МассивОтборовСвойствМатериалов);
		КонецЕсли;	   
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
			Если ТекущийОбъект.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор 
				И ТекущийОбъект.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПовторСНовымОбъединением
				И ТекущийОбъект.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПовторСИзменением
				И ТекущийОбъект.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовторСПереводомНаДругуюМашину
				И ТекущийОбъект.ВидЗаказа <>Перечисления.Лико_ВидыЗаказов.СложныйПовтор Тогда
				ТекущийОбъект.СвойстваМатериала = Неопределено;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	// --> Начало Лико Субботин 23.05.2023 	
	сч = 1;      
	
	Для каждого стр из ТекущийОбъект.Цвета Цикл
    					
		Если не ЗначениеЗаполнено(стр.ВидПечати) И ЗначениеЗаполнено(стр.ВидСекции.ВидПечати) Тогда 
			стр.ВидПечати = стр.ВидСекции.ВидПечати.ВидПечати;			
		Конецесли; 
		Если стр.ВидСекции = Справочники.Лико_ВидыСекций.ТрафаретнаяПечать Тогда
			стр.ВидПечати = стр.ВидСекции.ВидПечати.ВидПечати;	
		КонецЕсли;
	
	КонецЦикла; 
	
   // <-- Конец Лико Субботин 23.05.2023         

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЭтаФорма.Прочитать();
	
	Если Не ЗначениеЗаполнено(Объект.НомерБезПрефикса) Тогда 
		Объект.НомерБезПрефикса = Прав(Объект.Номер,7);
	КонецЕсли;
	//ЗаполнитьСвязанныеДанныеНаСервере();
	//ЗатратыПоЗаказу.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);	
	//Элементы.ЗатратыПоЗаказу.Обновить(); 
	
	// <-- Начало Лико Яцун С. В. 24.03.2025 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьЗаголовокФормы(); 
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 24.03.2025 

КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииСтавкиНДС(РезультатВопроса, ДополнительныеПараметры) Экспорт // <-- Начало Лико Яцун С. В. 11.12.2025
    
	Результат = РезультатВопроса;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для каждого Стр из Объект.Товары Цикл
			Если ЗначениеРеквизита(Стр.СтавкаНДС, "Ставка") <> 0 Тогда
				Стр.СтавкаНДС = ПолучитьСтавкуНДС(22);
				Стр.Цена = (Стр.Цена/1.20)*1.22;
				Если Объект.ЦенаДляДокументовВключаетНДС Тогда
					Стр.ЦенаДляДокументов = (Стр.ЦенаДляДокументов/1.20)*1.22;	
				КонецЕсли;
				СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, КэшированныеЗначения);
			КонецЕсли;
		КонецЦикла;
		Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС") + Объект.СтоимостьОснастки;
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		ПоказатьДоходностьРентабельность();
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Записать(Новый Структура("ЗаписьПослеОтветаНаВопросОбИзмененииНДС",Истина));
		КонецЕсли;
	Иначе
		Для каждого Стр из Объект.Товары Цикл
			Если ЗначениеРеквизита(Стр.СтавкаНДС, "Ставка") <> 0 Тогда
				Стр.СтавкаНДС = ПолучитьСтавкуНДС(22);
				УстановитьЦенуБезНДС(Стр.ПолучитьИдентификатор());
				СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, КэшированныеЗначения);
			КонецЕсли;
		КонецЦикла;
		Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС") + Объект.СтоимостьОснастки;
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		ПоказатьДоходностьРентабельность();
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Записать(Новый Структура("ЗаписьПослеОтветаНаВопросОбИзмененииНДС",Истина));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 11.12.2025

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНДС(Процент,Основная = Истина)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = &Ставка
		|	И СтавкиНДС.Основная = &Основная";
	
	Запрос.УстановитьПараметр("Основная", Основная);
	Запрос.УстановитьПараметр("Ставка", Процент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтавкаНДССсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СтавкаНДССсылка;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиЗаказа(Форма)
		
	// Заполнение итогов по таблице "Товары"
	
	КоллекцияТовары = Форма.Объект.Товары;

	//Форма.СуммаЗаказаноСЗалоговойТарой = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
	//	КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"),
	//	КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
	//Форма.СуммаЗаказано     = КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары");
	//Форма.СуммаЗалогаЗаТару = ?(Форма.Объект.ТребуетсяЗалогЗаТару,(КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"))
	//		- (КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары")),0);
	//Форма.СуммаНДСЗаказано  = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
	//	КоллекцияТовары.Итог("СуммаНДС") - КоллекцияТовары.Итог("СуммаНДСОтменено"),
	//	КоллекцияТовары.Итог("СуммаНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаНДСОтмененоБезВозвратнойТары"));
	//Форма.СуммаАвтоСкидки   = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
	//	КоллекцияТовары.Итог("СуммаАвтоматическойСкидки") - КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиОтменено"),
	//	КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиОтмененоБезВозвратнойТары"));
	//Форма.СуммаРучнойСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
	//	КоллекцияТовары.Итог("СуммаРучнойСкидки") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтменено"),
	//	КоллекцияТовары.Итог("СуммаРучнойСкидкиБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтмененоБезВозвратнойТары"));
	//Форма.СуммаСкидки       = Форма.СуммаАвтоСкидки + Форма.СуммаРучнойСкидки;
	//Форма.СуммаОтменено     = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
	//	КоллекцияТовары.Итог("СуммаСНДСОтменено"),
	//	КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
	//
	//Если КоллекцияТовары.Итог("СуммаСНДСОтменено") = КоллекцияТовары.Итог("СуммаСНДС") Тогда
	//	Форма.ВсеСтрокиОтменены = Истина;
	//Иначе
	//	Форма.ВсеСтрокиОтменены = Ложь;
	//КонецЕсли;
	//
	//СуммаЗаказано = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
	//	КоллекцияТовары.Итог("Сумма") - КоллекцияТовары.Итог("СуммаОтменено"),
	//	КоллекцияТовары.Итог("СуммаБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаОтмененоБезВозвратнойТары"));
	//
	//Если СуммаЗаказано > 0 
	//	И (СуммаЗаказано + Форма.СуммаСкидки) <> 0 Тогда
	//	Форма.ПроцентАвтоСкидки   = Форма.СуммаАвтоСкидки * 100 / (СуммаЗаказано + Форма.СуммаСкидки);
	//	Форма.ПроцентРучнойСкидки = Форма.СуммаРучнойСкидки * 100 / (СуммаЗаказано + Форма.СуммаСкидки);
	//	Форма.ПроцентСкидки       = Форма.ПроцентАвтоСкидки + Форма.ПроцентРучнойСкидки;
	//ИначеЕсли Форма.СуммаСкидки > 0 Тогда
	//	Форма.ПроцентАвтоСкидки   = Форма.СуммаАвтоСкидки * 100 / Форма.СуммаСкидки;
	//	Форма.ПроцентРучнойСкидки = Форма.СуммаРучнойСкидки * 100 / Форма.СуммаСкидки;
	//	Форма.ПроцентСкидки       = 100;
	//Иначе
	//	Форма.ПроцентАвтоСкидки   = 0;
	//	Форма.ПроцентРучнойСкидки = 0;
	//	Форма.ПроцентСкидки       = 0;
	//КонецЕсли;
	//
	//// Заполнение итогов по этапам оплаты
	//
	//Форма.СуммаАвансаДоОбеспечения = 0;
	//Форма.СуммаПредоплатыДоОтгрузки = 0;
	//Форма.СуммаКредитаПослеОтгрузки = 0;
	//Форма.ПроцентАвансаДоОбеспечения = 0;
	//Форма.ПроцентПредоплатыДоОтгрузки = 0;
	//Форма.ПроцентКредитаПослеОтгрузки = 0;
	//
	//СоответствиеВариантовОплаты = Новый Соответствие;
	//СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения"),
	//	Новый Структура("Сумма, Проценты", "СуммаАвансаДоОбеспечения", "ПроцентАвансаДоОбеспечения"));
	//СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки"),
	//	Новый Структура("Сумма, Проценты", "СуммаПредоплатыДоОтгрузки", "ПроцентПредоплатыДоОтгрузки"));
	//СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки"),
	//	Новый Структура("Сумма, Проценты", "СуммаКредитаПослеОтгрузки", "ПроцентКредитаПослеОтгрузки"));
	//
	//Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
	//	ИменаЭлементов = СоответствиеВариантовОплаты[ТекСтрока.ВариантОплаты];
	//	Если ИменаЭлементов <> Неопределено Тогда
	//		Форма[ИменаЭлементов.Сумма] = Форма[ИменаЭлементов.Сумма] + ТекСтрока.СуммаПлатежа
	//			+ ?(Форма.Объект.ТребуетсяЗалогЗаТару, ТекСтрока.СуммаЗалогаЗаТару, 0);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//СуммаВсегоПоЭтапам = Форма.СуммаАвансаДоОбеспечения + Форма.СуммаПредоплатыДоОтгрузки + Форма.СуммаКредитаПослеОтгрузки;
	//Если СуммаВсегоПоЭтапам <> 0 Тогда
	//	Форма.ПроцентАвансаДоОбеспечения  = (Форма.СуммаАвансаДоОбеспечения/СуммаВсегоПоЭтапам)*100;
	//	Форма.ПроцентПредоплатыДоОтгрузки = (Форма.СуммаПредоплатыДоОтгрузки/СуммаВсегоПоЭтапам)*100;;
	//	Форма.ПроцентКредитаПослеОтгрузки = (Форма.СуммаКредитаПослеОтгрузки/СуммаВсегоПоЭтапам)*100;
	//КонецЕсли;
	//
	//// Выбор странцицы отображения НДС
	//
	//Если Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС")
	//	ИЛИ Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД") Тогда
	//	
	//	Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
	//	Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаБезНДС;
	//Иначе
	//	
	//	Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
	//	Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаСНДС;
	//КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизита(Объект, ИмяРеквизита)
	Возврат Объект[ИмяРеквизита]
КонецФункции

&НаСервереБезКонтекста
Функция ПустаяСсылка(НаименованиеСправочника);
	Возврат Справочники[НаименованиеСправочника].ПустаяСсылка();
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьСЗ(Ссылка, СЗ, КлючСтроки,ИмяТаблицы)
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаказКлиентаМашины.Значение
	//|ИЗ
	//|	Документ.ЗаказКлиента.Машины КАК ЗаказКлиентаМашины
	//|ГДЕ
	//|	ЗаказКлиентаМашины.Ссылка = &Ссылка
	//|	И ЗаказКлиентаМашины.КлючСтроки = &КлючСтроки";
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("КлючСтроки", КлючСтроки);
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//СЗ.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Значение"));
	//Возврат СЗ;
КонецФункции

&НаСервере
Процедура РассчитатьЗаказНаСервере(Заказ, Отказ= Ложь)
		УстановитьПривилегированныйРежим(Истина);
	Если Объект.Комбинированный Тогда 
		Лико_Планирование.РассчитатьСебестоимость_НормативыКомбинированногоЗаказа(Заказ, Отказ);
	Иначе	
		//Если Объект.СерийныйЗаказ Тогда 
		//	НачатьТранзакцию();
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ЗаказКлиента.ПервыйВСерии КАК ПервыйВСерии
		//	|ПОМЕСТИТЬ ВТ
		//	|ИЗ
		//	|	Документ.ЗаказКлиента КАК ЗаказКлиента
		//	|ГДЕ
		//	|	ЗаказКлиента.Ссылка = &Заказ
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ЗаказКлиента.ПервыйВСерии
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	ЗаказКлиента.Ссылка КАК Заказ,
		//	|	ВЫБОР
		//	|		КОГДА ВТ.ПервыйВСерии = ЗаказКлиента.Ссылка
		//	|			ТОГДА 0
		//	|		ИНАЧЕ 1
		//	|	КОНЕЦ КАК Порядок
		//	|ИЗ
		//	|	ВТ КАК ВТ
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		//	|		ПО ВТ.ПервыйВСерии = ЗаказКлиента.ПервыйВСерии
		//	|
		//	|УПОРЯДОЧИТЬ ПО
		//	|	Порядок,
		//	|	ЗаказКлиента.Дата";
		//	Запрос.УстановитьПараметр("Заказ", Объект.ссылка);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Пока Выборка.Следующий() Цикл
		//		Лико_Планирование.РассчитатьСебестоимость_НормативыЗаказа(Выборка.Заказ , Отказ);
		//		Если Отказ Тогда 
		//			Сообщить("Не рассчитан заказ в серии "+Выборка.Заказ );
		//			ОтменитьТранзакцию();
		//			Возврат;
		//		КонецЕсли;

		//	КонецЦикла;
		//	ЗафиксироватьТранзакцию();	
		//Иначе	
		Лико_Планирование.РассчитатьСебестоимость_НормативыЗаказа(Заказ, Отказ);
		//КонецЕсли;
	КонецЕсли;
	Если Заказ = Объект.Ссылка Тогда 
		Прочитать();
		ЗаполнитьСвязанныеДанныеНаСервере();
	КонецЕсли;
	
	// --> Начало Лико Яцун 16.12.2022 
	//ОбновитьРасчетТиражейНаСервере(Истина);
	// <-- Конец Лико Яцун 16.12.2022
	
КонецПроцедуры

&НаСервере
Процедура НаправитьВРаботуНаСервере(Заказ, Отказ = Ложь, ПодниматьВерсию = Истина, ПричиныЗамены = Неопределено)
	
	// --> Начало лк Субботин 10.03.22
	//Если ПлощадкаУрал() и Объект.ДоходностьПлан < 100  Тогда  
	//	КонтрольДоходности = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,ПользователиКлиентСервер.ТекущийПользователь() , "КонтрольДоходности",ложь) ; 
	//	Если  не КонтрольДоходности Тогда
	//		Сообщить("Заказ не проходит по доходности, требуется согласование руководителя");  
	//		Отказ = истина;
	//		Возврат
	//	КонецЕсли;
	//КонецЕсли;
	// <-- Конец лк Субботин 10.03.22
	
	Если Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
		КодТНВЭДТУ = Справочники.КлассификаторТНВЭД.НайтиПоКоду("4911990000");
		Для каждого Стр Из Объект.Товары Цикл
			Если Стр.Номенклатура.КодТНВЭД <> КодТНВЭДТУ Тогда
				Нобъект = Стр.Номенклатура.ПолучитьОбъект();
				Нобъект.КодТНВЭД = КодТНВЭДТУ;
				Нобъект.ОбменДанными.Загрузка = Истина;
				Нобъект.Записать();	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	// --> Начало Лико Субботин 09.09.2022 
	//Проверка изменений материалов   
	МенялисьМатериалы = ложь;

	Хэш = ВернутьКонтрольныйХэш(); 
	Если Хэш <> КонтрольныйХэш Тогда
		МенялисьМатериалы = Истина;
	КонецЕсли;
    // <-- Конец Лико Субботин 09.09.2022 
		
	Лико_Планирование.НаправитьВРаботу(Заказ, , Отказ, ПодниматьВерсию, МенялисьМатериалы, ПричиныЗамены);
	
КонецПроцедуры 

Функция ВернутьКонтрольныйХэш()
	
	СтруктураДляПроверки = новый Структура;
	СтруктураДляПроверки.Вставить("ОсновнойМатериал", Объект.ОсновнойМатериал);  
	СтруктураДляПроверки.Вставить("МетражПМ", Объект.МетражПМ);    
	СтруктураДляПроверки.Вставить("Нарезка", Объект.Нарезка);  
	СтрокаКодов = "";
	Для каждого стр из Объект.Цвета Цикл   
		СтрокаКодов = СтрокаКодов + СтрШаблон("%1%2", ?(ЗначениеЗаполнено( стр.КодМатериала), стр.КодМатериала, ""), ?(ЗначениеЗаполнено( стр.Нарезка), стр.Нарезка, "") );
	КонецЦикла;
    СтруктураДляПроверки.Вставить("СтрокаКодов", СтрокаКодов);

	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтруктураДляПроверки)

	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьПустуюЦеновуюГруппу()
	Возврат Справочники.ЦеновыеГруппы.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ПолучитьАртикулИзСправочникаВерсииНоменклатуры(Номенклатура, Версия)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Лико_ВерсииНоменклатуры.Номенклатура КАК Номенклатура,
	               |	Лико_ВерсииНоменклатуры.Версия КАК Версия,
	               |	Лико_ВерсииНоменклатуры.Артикул КАК Артикул
	               |ИЗ
	               |	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	               |ГДЕ
	               |	Лико_ВерсииНоменклатуры.Ссылка = &Версия
	               |	И Лико_ВерсииНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Версия", Версия);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() <> 1 Тогда
		Артикул = Номенклатура.Артикул;
	Иначе
		Артикул = Результат[0].Артикул;
	КонецЕсли;
	Возврат Артикул;
КонецФункции
	

&НаСервере
Процедура СкрытьЛишниеКнопкиДляНоменклатурыDFM(Номенклатура)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Если Номенклатура.Лико_DFM Тогда
			ОтображатьКнопки = Ложь;
			Предупреждение = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		Иначе
			ОтображатьКнопки = Истина;
			Предупреждение = ОтображениеПредупрежденияПриРедактировании.Авто;
		КонецЕсли;
	Иначе
		ОтображатьКнопки = Истина;
		Предупреждение = ОтображениеПредупрежденияПриРедактировании.Авто;
	КонецЕсли;
	Элементы.ТоварыНоменклатура.КнопкаВыбора = ОтображатьКнопки;
	Элементы.ТоварыНоменклатура.КнопкаВыпадающегоСписка = ОтображатьКнопки;
	Элементы.ТоварыНоменклатура.КнопкаОткрытия = ОтображатьКнопки;
	Элементы.ТоварыНоменклатура.КнопкаСоздания = ОтображатьКнопки;
	Элементы.ТоварыНоменклатура.АвтоВыборНезаполненного = ОтображатьКнопки;
	//Элементы.ТоварыНоменклатура.РедактированиеТекста = ОтображатьКнопки;
	Элементы.ТоварыНоменклатура.ОтображениеПредупрежденияПриРедактировании = Предупреждение;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	//Определить для оптимизации
	текВидЗаказа 	= Объект.ВидЗаказа;
	
	Комбинированный =  Объект.Комбинированный; 
	Элементы.ЗаказОсновногоМатериала.Видимость = Комбинированный;
	Элементы.НеПересчитыватьПФ.Видимость = Комбинированный;
	ЕстьКнижныйМодуль = Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.Книжка)).Количество() <> 0;
	Элементы.КоличествоЛистовКнижки.Видимость = (Объект.Книжка ИЛИ ЕстьКнижныйМодуль);	
		
	// --> Начало Лико Митюшин МФМ 19.05.2021
	Элементы.ГруппаОсновнойЗаказ.Видимость = (Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Полуфабрикат ИЛИ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор);
	// <-- Конец Лико Митюшин МФМ 19.05.2021

	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
		Элементы.ЦветаТребуетсяОтвердитель.Видимость = Истина;
		Элементы.ВидКонтактаСПищевойПродукцией.Видимость = Истина;
		Элементы.КомментрийОПП.Видимость = Истина;
	Иначе 
		Элементы.ЦветаТребуетсяОтвердитель.Видимость = Ложь;
		Элементы.ВидКонтактаСПищевойПродукцией.Видимость = Ложь;
		Элементы.КомментрийОПП.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.Площадка = Справочники.Лико_Площадки.Линкс Тогда
		Элементы.ЦветаФормаНомерЛинкс.Видимость = Истина;
		Элементы.ЦветаЗагрузитьИзВнешнегоФайла.Видимость = Истина;
		Элементы.ЦветаСоздатьФормы.Видимость = Истина;
	Иначе
		Элементы.ЦветаФормаНомерЛинкс.Видимость = Ложь;
		Элементы.ЦветаЗагрузитьИзВнешнегоФайла.Видимость = Ложь;
		Элементы.ЦветаСоздатьФормы.Видимость = Ложь;
	КонецЕсли;
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Если Не РольДоступна("ПолныеПрава") Тогда 	
		Элементы.ДатаОтправкиВРаботу.ТолькоПросмотр = Истина;
		Элементы.НомерБезПрефикса.ТолькоПросмотр = Истина;
		Элементы.Версия.Доступность = ЛОжь;
		Элементы.Состояние.Доступность = ЛОжь;
		Если Не (РОльДоступна("Лико_ЗакрытиеОтгрузки") ИЛИ РОльДоступна("Лико_ИзменениеВыполненныхЗаказов") )Тогда 
			Если Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Выполнен ИЛИ Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда 
				//Элементы.ГруппаОсновное.ТолькоПросмотр = Истина;
				Элементы.ГруппаШапка1.ТолькоПросмотр = Истина;
				Элементы.ГруппаШапка2.ТолькоПросмотр = Истина;
				Элементы.ПодобратьАналоги.Доступность = Ложь;
				Элементы.Ответственный.ТолькоПросмотр = Истина;
			КонецЕсли;	
		КонецЕсли;
		
		Если Не Пользователь.Лико_ПоказыватьЗакрытиеЗаказа Тогда 
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			Элементы.ГруппаОсновное.ОтображатьЗаголовок = Ложь;
			Элементы.ГруппаЗатраты.Видимость = Ложь;
			Элементы.ГруппаКартыСнятияПерерасхода.Видимость = Ложь;
			Элементы.ГруппаПроизводствоНовая.Видимость = Ложь;
			Элементы.ГруппаОтгрузки.Видимость = Ложь;			
		КонецЕсли;
		
		ПоказыватьЦеныВЗаказе = Пользователь.Лико_ПоказыватьЦеныВЗаказе;
		Если   ((текВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник ИЛИ текВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка) И Не Объект.ЗаДеньги) 
			ИЛИ текВидЗаказа = Перечисления.Лико_ВидыЗаказов.ЦифроваяПроба ИЛИ текВидЗаказа = Перечисления.Лико_ВидыЗаказов.ТестированиеМатериалов Тогда
			ПоказыватьЦеныВЗаказе = Ложь;
		КонецЕсли;
		
		Элементы.ГруппаСтоимость.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.НадписьСтоимость.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.Доход.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ЦенаКвМ.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.НадписьДоходность.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.НадписьРентабельность.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ТоварыЦена.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ТоварыЦенаДляДокументов.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ТоварыСумма.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ТоварыСуммаНДС.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ТоварыСуммаСНДС.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ТоварыСтавкаНДС.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ТоварыЦенаБезНДС.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.ОтгрузкиСтоимость.Видимость = ПоказыватьЦеныВЗаказе;
		Элементы.НадписьСтоимость1кг.Видимость = ПоказыватьЦеныВЗаказе;
		
		Если ПоказыватьЦеныВЗаказе Тогда 
			ДоступКИзменениюЦен = Ложь;
			Если Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Создан
				ИЛИ Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Заблокирован
				ИЛИ Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.ВключенВПлан Тогда
				ДоступКИзменениюЦен = Истина;
			КонецЕсли;
			Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = НЕ ДоступКИзменениюЦен;
			Элементы.ТоварыСтавкаНДС.ТолькоПросмотр = НЕ ДоступКИзменениюЦен;
			Элементы.ТоварыЦена.ТолькоПросмотр = НЕ ДоступКИзменениюЦен;
			Элементы.ТоварыЦенаБезНДС.ТолькоПросмотр = НЕ ДоступКИзменениюЦен;
			Элементы.ТоварыЦенаДляДокументов.ТолькоПросмотр = НЕ ДоступКИзменениюЦен;
			Элементы.ТоварыСумма.ТолькоПросмотр = НЕ ДоступКИзменениюЦен;
			Элементы.ТоварыСуммаНДС.ТолькоПросмотр = НЕ ДоступКИзменениюЦен;
			
		КонецЕсли;
		
//Иванова Переделать Площадку в пользователе!!!! 20241003		
		Если РОльДоступна("Лико_ЗакрытиеОтгрузки") И Не  РольДоступна("Лико_ДобавлениеИзменениеЗаказовПоПлощадке") 
			И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", Пользователь) = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра ТОгда
			Элементы.ФормаПровести1.Видимость = Истина;
			Элементы.ОсновнойМатериал.ТолькоПросмотр = Истина;
			Элементы.ПодобратьАналоги.Доступность = Ложь;
			Элементы.ЦветаМатериал.ТолькоПросмотр = Истина;
			Элементы.ДатаЗакрытия.ТолькоПросмотр = Истина;
			Элементы.ФормаЗаписать.Видимость = Ложь;
		Иначе
			Элементы.ФормаПровести1.Видимость = Ложь;
			Элементы.ФормаЗаписать.Видимость = Истина;
			
		КонецЕсли;
		Элементы.СлужебныеРеквизиты.Видимость = Ложь;			
	КонецЕсли;	
	
	Если Пользователь.Лико_ПоказыватьЦеныВЗаказе ИЛИ РольДоступна("ПолныеПрава") Тогда 	
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоНаименованию("EUR"),  ТекущаяДата());
		ЭтаФорма.НадписьКурсЕвро = СтруктураКурса.Курс; 
	КонецЕсли;
	
	Если Объект.Площадка <> Справочники.Лико_Площадки.Сибирь Тогда 
		Элементы.ФормаЗакрытьЗаказ.Видимость = Ложь;
	КонецЕсли;
	
	//Элементы.АльтернативноеНаименованиеМатериалаДляСертификата.Видимость = ВидимостьАльтернативныхНаименований();
	//Элементы.АльтернативноеНаименованиеМатериалаДляБирки.Видимость = ВидимостьАльтернативныхНаименований();
	 Элементы.АльтернативныйМатериал.Видимость = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.Партнер, "ПечатьДокументовСПаспортомКачестваХенкель_4e5e69eb3be24906936e75537dc40884", Ложь);

	
	
	Если Объект.Площадка <> Справочники.Лико_Площадки.Урал Тогда
		Элементы.ДлинаЭтикетки.Заголовок = "Высота этикетки";
	Иначе
		Элементы.ДлинаЭтикетки.Заголовок = "Длина этикетки";
	КонецЕсли;
	
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда
		Если Объект.ВидКонтактаСПищевойПродукцией = Справочники.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт Тогда
			Элементы.ОсновнойМатериалКонтактныйСлой.Видимость = Истина;
		Иначе
			Элементы.ОсновнойМатериалКонтактныйСлой.Видимость = Ложь;
		КонецЕсли;
		Элементы.Вес.Видимость = Истина;
		Элементы.ТоварыВес.Видимость = Истина;
		Элементы.НадписьСтоимость1кг.Видимость = Истина;
	Иначе
		Элементы.ОсновнойМатериалКонтактныйСлой.Видимость = Ложь;
		Элементы.Вес.Видимость = Ложь;
		Элементы.ТоварыВес.Видимость = Ложь;
		Элементы.НадписьСтоимость1кг.Видимость = Ложь;
	КонецЕсли;
	
	Если Не (текВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник ИЛИ текВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка) Тогда 
		Элементы.ЗаДеньги.Видимость = Ложь;
	Иначе 
		Элементы.ЗаДеньги.Видимость = Истина;
	КонецЕсли;
	Если Не РольДоступна("ПолныеПрава") Тогда 
		
		Элементы.ТоварыДиаметрРоликаФакт.КнопкаОчистки = Истина;
		Элементы.ТоварыДиаметрРоликаФакт.КнопкаВыбора = Ложь;
		Элементы.ТоварыДиаметрРоликаФакт.КнопкаВыпадающегоСписка = Ложь;
		Элементы.ТоварыДиаметрРоликаФакт.КнопкаОткрытия = Ложь;
		Элементы.ТоварыДиаметрРоликаФакт.КнопкаРегулирования = Ложь;
		Элементы.ТоварыДиаметрРоликаФакт.КнопкаСоздания = Ложь;
		Элементы.ТоварыДиаметрРоликаФакт.КнопкаСпискаВыбора = Ложь;
		Элементы.ТоварыДиаметрРоликаФакт.РедактированиеТекста = Ложь;
	КонецЕсли;
	Если Объект.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",9) Тогда
		Элементы.НоменклатураDFM.Видимость = Истина;
		Элементы.НоменклатураDFM.Доступность = Ложь;
		Элементы.НоменклатураDFM.Картинка = БиблиотекаКартинок.ЗеленаяГалка;
	ИначеЕсли Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка Тогда
		
		Элементы.НоменклатураDFM.Видимость = Истина;
		Элементы.НоменклатураDFM.Доступность = Истина;
		Если Объект.НоменклатураDFM Тогда
			Элементы.НоменклатураDFM.Картинка = БиблиотекаКартинок.ЗеленаяГалка;
		Иначе
			Элементы.НоменклатураDFM.Картинка = БиблиотекаКартинок.КрасныйКрест;
		КонецЕсли;
	Иначе
		Элементы.НоменклатураDFM.Видимость = Ложь;
	КонецЕсли;
	
	//Если ДатаНачалаСозданияНоменклатурыDFM Тогда 
	//	Элементы.ТоварыГруппаСоздания.Видимость=Истина;
	//Иначе
	//	Элементы.ТоварыГруппаСоздания.Видимость=Ложь;
	//КонецЕсли;
	
	//Подсистема DFM
	DFMСервер.УстановитьВидимость(ЭтаФорма);
	//Подсистема DFM
	//
	//--> o.pukhova 23042021
	Если Объект.ЧестныйЗнак Тогда
		Элементы.ТоварыGtin.Доступность = Истина;
		Элементы.ТоварыДатаЭмиссии.Доступность = Истина;
	Иначе
		Элементы.ТоварыGtin.Доступность = Ложь;
		Элементы.ТоварыДатаЭмиссии.Доступность = Ложь;
	КонецЕсли;
	//<-- o.pukhova 23042021  
			
	// --> Начало Лико Ефимов ЕВВ 28.07.2023
	ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК.ЗначениеПараметра;
	Если ЗначениеЗаполнено(ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК) И ТекущаяДата() >= ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК И Объект.Дата >= Дата('20230101') Тогда
		НовыйВидПроизводствоПрокаты = Истина;
	Иначе
		НовыйВидПроизводствоПрокаты = Ложь;
	КонецЕсли;

	Если Элементы.ГруппаПроизводствоНовая.Видимость Тогда
		Если Элементы.ГруппаЭлементовПеремотка.ПодчиненныеЭлементы.Количество() = 0 Тогда
			// Перенесем элементы перемотки со старой страницы
			Элементы.Переместить(Элементы.ГруппаЭлементыПроизводствоПеремоткаСтарая, Элементы.ГруппаЭлементовПеремотка);
		КонецЕсли;
		Если Элементы.ГруппаЭлементовФормщики.ПодчиненныеЭлементы.Количество() = 0 Тогда
			// Перенесем элементы формщиков со старой страницы
			Элементы.Переместить(Элементы.ГруппаЭлементыПроизводствоФормщикиСтарая, Элементы.ГруппаЭлементовФормщики);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПереключательГруппыПроизводство();
	// <-- Конец Лико Ефимов ЕВВ 28.07.2023 
	
	// <-- Начало Лико Яцун С. В. 24.04.2025
	ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода.ЗначениеПараметра;
	Если ЗначениеЗаполнено(ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода) И ТекущаяДата() >= ДатаНачалаИспользованияДокументовКартаСнятияПерерасхода 
		И (Объект.Площадка = Справочники.Лико_Площадки.Ликофлекс ИЛИ Объект.Площадка = Справочники.Лико_Площадки.Линкс ИЛИ Объект.Площадка = Справочники.Лико_Площадки.ИксПак) Тогда
		Элементы.ПроизводствоКартаСнятия.Видимость = Истина;
		Элементы.ПроизводствоКартаПерерасхода.Видимость = Истина;
		Элементы.ПроизводствоКартаПерерасходаПриПечатиНомер.Видимость = Истина;
		Элементы.ПроизводствоКартаПерерасходаПриПечати.Видимость = Истина;
	Иначе
		Элементы.ПроизводствоКартаСнятия.Видимость = Ложь;
		Элементы.ПроизводствоКартаПерерасхода.Видимость = Ложь;
		Элементы.ПроизводствоКартаПерерасходаПриПечатиНомер.Видимость = Ложь;
		Элементы.ПроизводствоКартаПерерасходаПриПечати.Видимость = Ложь;
	КонецЕсли; 
	// <-- Конец Лико Яцун С. В. 24.04.2025
	
	// <-- Начало Лико Яцун С. В. 25.03.2025 
	Если НЕ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка И НЕ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Пакеты Тогда
		Элементы.ПоказатьПараметрыТипа.Доступность = Ложь;
	Иначе
		Элементы.ПоказатьПараметрыТипа.Доступность = Истина;
	КонецЕсли;
	Если НЕ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
		Элементы.ГруппаТермоусадка.Видимость = Ложь;
		Элементы.ГруппаТермоусадка1.Видимость = Ложь;
	Иначе
		Элементы.ГруппаТермоусадка.Видимость = Истина;
		Элементы.ГруппаТермоусадка1.Видимость = Истина;
	КонецЕсли;
	Если НЕ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Пакеты Тогда
		Элементы.ГруппаПакеты.Видимость = Ложь;
		Элементы.ГруппаПакеты4.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПакеты.Видимость = Истина;
		Элементы.ГруппаПакеты4.Видимость = Истина;
	КонецЕсли;
	Если НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Шаблон И НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда
		Элементы.ПоказатьПараметрыВида.Доступность = Ложь;
	Иначе
		Элементы.ПоказатьПараметрыВида.Доступность = Истина;
	КонецЕсли;
	Если НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда
		Элементы.ГруппаПробник.Видимость = Ложь;
		Элементы.ГруппаПробник1.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПробник.Видимость = Истина;
		Элементы.ГруппаПробник1.Видимость = Истина;
	КонецЕсли;
	Если НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Шаблон Тогда
		Элементы.ГруппаШаблон.Видимость = Ложь;
	Иначе
		Элементы.ГруппаШаблон.Видимость = Истина;
	КонецЕсли;
	Если НЕ Объект.ЧестныйЗнак Тогда
		Элементы.ТипографскийАгрегат.Видимость = Ложь;
		Элементы.КоличествоКодовЧестногоЗнакаПлан.Видимость = Ложь;
		Элементы.БезОМ.Видимость = Ложь;
		Элементы.РазмерКода.Видимость = Ложь;
		Элементы.ГруппаЧестныйЗнак.Видимость = Ложь;
		Элементы.ПоказатьПараметрыЧестногоЗнака.Доступность = Ложь;
	Иначе
		Элементы.ТипографскийАгрегат.Видимость = Истина;
		Элементы.КоличествоКодовЧестногоЗнакаПлан.Видимость = Истина;
		Элементы.БезОМ.Видимость = Истина;
		Элементы.РазмерКода.Видимость = Истина;
		Элементы.ГруппаЧестныйЗнак.Видимость = Истина;
		Элементы.ПоказатьПараметрыЧестногоЗнака.Доступность = Истина;
	КонецЕсли;
	Если НЕ Объект.ЧестныйЗнак ИЛИ Объект.Цифровой Тогда
		Элементы.ГруппаЧестныйЗнак.Видимость = Ложь;
		Элементы.ПоказатьПараметрыЧестногоЗнака.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЧестныйЗнак.Видимость = Истина;
		Элементы.ПоказатьПараметрыЧестногоЗнака.Видимость = Истина;
		Если Объект.ЗаказчикЭмиссииЧЗ <> ПредопределенноеЗначение("Перечисление.Лико_ЗаказчикиЭмиссииЧЗ.Окил") Тогда
			Элементы.ЭмитентЧЗ.Видимость = Ложь;	
			Элементы.СтранаТовараЧЗ.Видимость = Ложь;	
			Элементы.ТипКодаЧЗ.Видимость = Ложь;	
			Элементы.ТипМаркировкиЧЗ.Видимость = Ложь;	
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 25.03.2025
		
КонецПроцедуры

&НаСервере
Процедура СкрытьКомандыВПодменюЕЩЕ() // <-- Начало Лико Яцун С. В. 25.03.2025
	
	//Команда Оплата по СБП
	КнопкаОплатаСБП = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ПодменюСБПОбычное__СБП");
	Если КнопкаОплатаСБП <> Неопределено Тогда
		КнопкаОплатаСБП.Видимость = Ложь;	
	КонецЕсли;
	//КомандыСоздатьНаОсновании
	Попытка
		КомандыСоздатьНаОсновании = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы.ПодменюСоздатьНаОснованииОбычное.ПодчиненныеЭлементы;
		Для каждого КомандаСоздатьНаОсновании Из КомандыСоздатьНаОсновании Цикл
			Если ТипЗНЧ(КомандаСоздатьНаОсновании) = Тип("КнопкаФормы") Тогда
				КомандаСоздатьНаОсновании.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;	
			КонецЕсли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Попытка
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы.ПодменюСоздатьНаОснованииВажное.ПодчиненныеЭлементы.ПодменюСоздатьНаОснованииВажное__Авто_6C5E5BED633285F6C654D9D7E25DC677.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	Исключение
	КонецПопытки;
	//ПодменюОтправить
	Попытка
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ПодменюОтправить.ПодчиненныеЭлементы.ПодменюОтправитьОбычное.ПодчиненныеЭлементы.ПодменюОтправитьОбычное__Авто_B96A274233001F6A66A357240DC09285.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	Исключение
	КонецПопытки;
	Попытка
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ПодменюОтправить.ПодчиненныеЭлементы.ПодменюОтправитьОбычное.ПодчиненныеЭлементы.ПодменюОтправитьОбычное__Авто_FD5076BDE292E7067013EEE6CDB8492C.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	Исключение
	КонецПопытки;
	//Обработка Редактировать тех карту
	Попытка
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ПодменюЗаполнитьСмТакже__Авто_7C4F4C891611653402FE23166BB9508E.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	Исключение
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 25.03.2025

&НаКлиенте
Процедура УстановитьЗаголовокФормы() // <-- Начало Лико Яцун С. В. 24.03.2025
	
	ЭтаФорма.АвтоЗаголовок = Ложь;
	Партнер = "__"+ЗначениеРеквизита(Объект.Партнер, "Наименование") +"__";
	ЭтаФорма.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1 %2 от %3 %4 %5'"),"Заказ клиента",Объект.НомерБезПрефикса,Формат(Объект.Дата,"ДФ=dd.MM.yyyy"),Партнер, 
	?(Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Шаблон"),Объект.НаименованиеШаблона,?(ЗначениеЗаполнено(Объект.Состояние),Объект.Состояние,"")));  
		
КонецПроцедуры // <-- Конец Лико Яцун С. В. 24.03.2025

&НаСервере
Функция ПроверитьНаличиеЗакрытыхМатериалов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы)
		|	КОНЕЦ КАК СтатьяЗатрат,
		|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
		|	Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя КАК Заказ,
		|	Лико_БланкЭтапаТовары.Ссылка КАК Бланк
		|ИЗ
		|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
		|ГДЕ
		|	Лико_БланкЭтапаТовары.Списать = ИСТИНА
		|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя = &Заказ
		|	И Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал = ИСТИНА
		|	И Лико_БланкЭтапаТовары.Ссылка.Проведен = ИСТИНА
		|	И Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_БланкЭтапаТовары.Номенклатура,
		|	Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя,
		|	Лико_БланкЭтапаТовары.Ссылка,
		|	ВЫБОР
		|		КОГДА Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы)
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтатьяЗатрат";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
	//Схема = Элементы.ЗакрытыеМатериалы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	//Настройки = Элементы.ЗакрытыеМатериалы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема,Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	//
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//
	//Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьПереключательГруппыПроизводство()
	
	Элементы.ЗначениеПереключателяГруппыПроизводство.СписокВыбора.Очистить();
	ЗначениеПереключателяГруппыПроизводство = Неопределено;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.НомерПроката КАК ЧИСЛО(10, 0)) КАК НомерПроката,
		|	ВЫРАЗИТЬ(ТЗ.РабочийЦентр КАК Справочник.РабочиеЦентры) КАК РабочийЦентр
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЗ.НомерПроката КАК НомерПроката,
		|	МАКСИМУМ(ВТ_ТЗ.РабочийЦентр.ВидРабочегоЦентра.Наименование) КАК ВидРЦНаименование
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТЗ.НомерПроката
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПроката";

	Запрос.УстановитьПараметр("ТЗ", Объект["Цвета"].Выгрузить(, "НомерПроката,РабочийЦентр"));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ЗначениеПереключателяГруппыПроизводство) Тогда
			ЗначениеПереключателяГруппыПроизводство = Выборка.НомерПроката;
		КонецЕсли;
		Элементы.ЗначениеПереключателяГруппыПроизводство.СписокВыбора.Добавить(Выборка.НомерПроката, "" + Выборка.НомерПроката + " " + СокрЛП(Выборка.ВидРЦНаименование)); 
	КонецЦикла;
	
	Элементы.ЗначениеПереключателяГруппыПроизводство.СписокВыбора.Добавить(90, "Перемотка"); 
	Элементы.ЗначениеПереключателяГруппыПроизводство.СписокВыбора.Добавить(91, "Формщики");

КонецПроцедуры

&НаСервере 
Процедура УстановитьЦенуБезНДС(Идентификатор)
	стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	ТекПроцентНДС = стр.СтавкаНДС.Ставка;
	стр.ЦенаБезНДС = стр.цена/(1+ТекПроцентНДС/100);
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦенуСНДС(Идентификатор)
	стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	ТекПроцентНДС = стр.СтавкаНДС.Ставка;
	стр.Цена = стр.ценаБезНДС*(1+ТекПроцентНДС/100);
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьНачалоПечати()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПооперационноеРасписание2_2.Начало КАК Начало
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование = &Заказ
	|	И ПооперационноеРасписание2_2.Этап.ВидЭтапа = ЗНАЧЕНИЕ(Справочник.Лико_ВидыЭтаповПроизводства.Прокат)
	|	И ПооперационноеРасписание2_2.Этап.НомерПроката = 1
	|	И ПооперационноеРасписание2_2.Моделирование = ЛОЖЬ
	|	И ПооперационноеРасписание2_2.Выполнено = 0";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Если ЗначениеЗаполнено(Результат.Начало) ТОгда
			НачалоПечати = Результат.Начало; 
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура КоличествоКликовНаСервере()
	Объект.КоличествоКликов = Лико_Планирование.УстановитьЧислоКликов(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление()
	//Цвета

	//Для вида печати Глубокая не доступно изменение грамматуры и процентазаливки
	Если Объект.Площадка <> Справочники.Лико_Площадки.ИксПак ТОгда 
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаГрамматура");
		ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	    ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.ВидСекции");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Справочники.Лико_ВидыСекций.ГлубокаяПечать;

		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Вал");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаПроцентЗаливки");	
		ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	    ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.ВидСекции");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Справочники.Лико_ВидыСекций.ГлубокаяПечать;
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Вал");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	КонецЕсли;	
	
	
	Если Объект.Площадка = Справочники.Лико_Площадки.Ликофлекс ТОгда 
		
		//20200401 - Для полного повтора  не меняем Направление намотки, т.к. для этого нужны новые формы   ТоварыНаправление

		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыНаправление");
		
		ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	    ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидЗаказа");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор;
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидРЦ");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Справочники.ВидыРабочихЦентров.MPS;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цифровой");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь;
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипЗаказа");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Перечисления.Лико_ТипыЗаказов.Термоусадка;

		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);


	КонецЕсли;   
	

	
	//Цветоделение и Перегравировка и Новый вал не доступны для Полного Повтора
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаЦветоделение");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидЗаказа");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);

	
	//ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	//ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаПерегравировка");
	//ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидЗаказа");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор;
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаНовыйВал");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидЗаказа");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);  
	
	
	//Для вида печати Инкджет не доступно поле Граматура
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаГрамматура");
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.ВидСекции");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение = Перечисления.Лико_ВидыПечати.Инкджет; 
	ЭлементОтбора.ПравоеЗначение = Справочники.Лико_ВидыСекций.Инкджет;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТОлькоПросмотр", Истина);  
		
	// <-- Начало Лико Яцун С. В. 19.10.2023
	ДобавитьУсловноеОформлениеЦветаВидОснастка();
	ДобавитьУсловноеОформлениеЦветаРабочийЦентр();
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	// <-- Конец Лико Яцун С. В. 19.10.2023
	
	// --> Начало Лико Ефимов ЕВВ 10.12.2025
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПроизводствоСотрудник");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПроизводствоСотрудникКод");
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Производство.СотрудникПоБланку");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Производство.СотрудникПоБланку");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Производство.Сотрудник");
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(Элементы.ПроизводствоСотрудник.Шрифт,,, Истина));  
	// <-- Конец Лико Ефимов ЕВВ 10.12.2025
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеЦветаВидОснастка() // <-- Начало Лико Яцун С. В. 19.10.2023
	
	МассивУсловногоОформленияВидОснастка = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ЦветаВидОснастка" Тогда
			МассивУсловногоОформленияВидОснастка.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияВидОснастка Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Для каждого Стр Из Объект.Цвета Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Оснастка) Тогда
			Продолжить;	
		КонецЕсли;
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаВидОснастка");
		ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.КлючСтроки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Стр.КлючСтроки; 
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Оснастка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Оснастка.Артикул);
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 19.10.2023

&НаСервере
Процедура ДобавитьУсловноеОформлениеЦветаВалФорма() // <-- Начало Лико Яцун С. В. 19.10.2023
	
	МассивУсловногоОформленияВалФорма = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ЦветаВал" ИЛИ Строка(Элемент.Поля) = "ЦветаФорма" Тогда
			МассивУсловногоОформленияВалФорма.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияВалФорма Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Для каждого Стр Из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(Стр.Вал) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаВал");
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.КлючСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.КлючСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Вал");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Вал.Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Форма) Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаФорма");
			Если Объект.Площадка = Справочники.Лико_Площадки.Линкс Тогда
				Стр.ФормаНомерЛинкс = Стр.Форма.КодЛинкс;
			КонецЕсли;
			ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.КлючСтроки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.КлючСтроки; 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.Форма");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.Форма.Код);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 19.10.2023

&НаСервере
Процедура ДобавитьУсловноеОформлениеЦветаРабочийЦентр() // <-- Начало Лико Яцун С. В. 19.10.2023
	
	МассивУсловногоОформленияРабочийЦентр = Новый Массив();	
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Строка(Элемент.Поля) = "ЦветаРабочийЦентр" Тогда
			МассивУсловногоОформленияРабочийЦентр.Добавить(Элемент);	
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементМассива Из МассивУсловногоОформленияРабочийЦентр Цикл
		УсловноеОформление.Элементы.Удалить(ЭлементМассива);	
	КонецЦикла;
	
	Для каждого Стр Из Объект.Цвета Цикл
		Если НЕ ЗначениеЗаполнено(Стр.РабочийЦентр) Тогда
			Продолжить;	
		КонецЕсли;
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветаРабочийЦентр");
		ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цвета.КлючСтроки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Стр.КлючСтроки; 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Стр.РабочийЦентр.Описание);
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 19.10.2023

&НаСервере
Процедура ЗаполнитьЭтапыОплатыСервер(ГрафикСоглашенияЗаполнен, ГрафикЗаполнен)
	
	ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПродажи(
		Объект,
		ГрафикСоглашенияЗаполнен,
		ГрафикЗаполнен,
		СуммаЗаказано,
		СуммаЗалогаЗаТару);
	
КонецПроцедуры

&НаСервере
Процедура ВалютаДляДокументовПриИзмененииНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьКодМатериала()
	Если ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда 
		Если ТипЗнч(Объект.ОсновнойМатериал)=Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
			ЭтаФорма.НадписьКодМатериала = Объект.ОсновнойМатериал.Код;
		ИначеЕсли ТипЗнч(Объект.ОсновнойМатериал)=Тип("СправочникСсылка.Номенклатура") Тогда
			Если ЗначениеЗаполнено(Объект.ОсновнойМатериал.ЦеноваяГруппа) Тогда
				ЭтаФорма.НадписьКодМатериала = Объект.ОсновнойМатериал.Код + " " + Объект.ОсновнойМатериал.ЦеноваяГруппа.Код;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЭтаФорма.НадписьКодМатериала = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПОлучитьКодМатериалаНаСервере(материал)	
	КодМатериала = "";
	Если ТипЗнч(Материал) = Тип("СправочникСсылка.Номенклатура") Тогда 
		Если ЗначениеЗаполнено (Материал.ЦеноваяГруппа) Тогда 
			КодМатериала = Материал.ЦеноваяГруппа.Код;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Материал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда 
		КодМатериала = Материал.Код;
	КонецЕсли;
	Возврат КодМатериала;
КонецФункции

&НаСервере
Процедура ПоказатьДоходностьРентабельность()
	Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС")+Объект.СтоимостьОснастки;
	ЭтаФорма.НадписьСтоимость = Объект.СуммаДокумента;
	Если ЗначениеЗаполнено(Объект.Вес) Тогда
		ЭтаФорма.НадписьСтоимость1Кг = Объект.СуммаДокумента/Объект.Вес;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(Лико_ПараметрыПроизводстваЗаказа.Доход) КАК Доход,
	|	МИНИМУМ(Лико_ПараметрыПроизводстваЗаказа.Доходность) КАК Доходность,
	|	МИНИМУМ(Лико_ПараметрыПроизводстваЗаказа.Рентабельность) КАК Рентабельность,
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ КАК Заказ,
	|	Лико_ПараметрыПроизводстваЗаказа.Себестоимость КАК Себестоимость
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|ГДЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	|	И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ,
	|	Лико_ПараметрыПроизводстваЗаказа.Себестоимость";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Если ЗначениеЗаполнено(Результат.Заказ) Тогда 
			ЭтаФорма.НадписьДоход = Результат.Доход;
			ЭтаФорма.НадписьДоходность = Результат.Доходность;
			ЭтаФорма.НадписьРентабельность =  Результат.Рентабельность;
			ЭтаФорма.НадписьСебестоимость = Результат.Себестоимость;			
			Если ЗначениеЗаполнено(Объект.МетражКВМ) Тогда 
				ЭтаФорма.НадписьЦенаКвМ =  Объект.Товары.Итог("СуммаСНДС")/Объект.МетражКВМ;
				//// --> Начало Лико Митюшин МФМ 09.03.2021
				////ЭтаФорма.НадписьШтКВМ = Объект.Тираж*1000/Объект.МетражКВМ;
				//Объект.ШтКВМ = Объект.Тираж*1000/Объект.МетражКВМ;
				//// <-- Конец Лико Митюшин МФМ 09.03.2021
				ЭтаФорма.НадписьСебестоимостьКВМ =  Результат.Себестоимость/Объект.МетражКВМ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОбразцыЦвета()
	Надпись = "";
	Для каждого стр из Объект.ОбразцыЦвета Цикл
		Надпись = Надпись+стр.ОбразецЦвета+ " ";
	КонецЦикла;
	Если Надпись = "" Тогда 
		Надпись = "Укажите образцы цвета.";
	КонецЕсли;	
	ЭтаФорма.НадписьОбразецЦвета = Надпись;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьТиражМетраж()
	
	МетражКвМ 		= 0;
	МетражПМ 		= 0;
	КоличествоОбщее = 0;
	ВесОбщий 		= 0;
	Нарезка 		= Объект.Нарезка.Размер/1000;
	ЕдиницаИзмеренияЗаказа = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	
	//Предопределенные значения
	МассивЛико_Предопределенные = Лико_ТиражМетраж.ПолучитьМассивЛико_Предопределенные();
	
	Для каждого стр из Объект.Товары Цикл
		Количество 			= 0;
		ПогонныйМетраж 		= 0;
		КвадратныйМетраж 	= 0;

		Если ЗначениеЗаполнено(Нарезка) Тогда 
			Лико_ТиражМетраж.ПолучитьМетражПоУсловиям(МассивЛико_Предопределенные, стр.Номенклатура.ЕдиницаИзмерения, Количество, ПогонныйМетраж, КвадратныйМетраж, Нарезка, стр.Количество, Объект);
		КонецЕсли;
		
		// <-- Начало Лико Яцун С. В. 05.12.2023
		//Только Омега с нумератором в режиме редактирования параметров (Вид вырубки = 0)
		текВидВырубки = Объект.ВидВырубки;
		Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И текВидВырубки = 0 И ОмегаСНумератором() Тогда
			Если стр.Номенклатура.ЕдиницаИзмерения = МассивЛико_Предопределенные[0] Тогда
				Количество = стр.Количество*1000;
				Если ВидРЦИндиго(Объект.РабочийЦентр) Тогда
					Если Объект.Ручьи = 0 ИЛИ Объект.ЭтикетокНаЛисте = 0  Тогда
						ПогонныйМетраж = 0;
					ИначеЕсли Объект.РучьиПечатиИндиго = 0 Тогда
						ПогонныйМетраж = Количество /Объект.ЭтикетокНаЛисте*Объект.ШагПечати;
					Иначе 
						ПогонныйМетраж = Количество /(Объект.ЭтикетокНаЛисте*Объект.РучьиПечатиИндиго/Объект.Ручьи)*Объект.ШагПечати;
					КонецЕсли;	
				Иначе
					Если Объект.Ручьи = 0 ИЛИ Объект.ЭтикетокНаЛисте = 0  Тогда
						ПогонныйМетраж = 0;
					ИначеЕсли Объект.РучьиПечати = 0 Тогда
						ПогонныйМетраж = Количество / Объект.ЭтикетокНаЛисте*Объект.ШагПечати;
					Иначе 
						ПогонныйМетраж = Количество /(Объект.ЭтикетокНаЛисте*Объект.РучьиПечати/Объект.Ручьи)*Объект.ШагПечати;
					КонецЕсли;
				КонецЕсли;
				КвадратныйМетраж = ПогонныйМетраж*Нарезка;
			ИначеЕсли стр.Номенклатура.ЕдиницаИзмерения = МассивЛико_Предопределенные[1] Тогда
				ПогонныйМетраж = стр.Количество;
				КвадратныйМетраж  = ПогонныйМетраж*Нарезка;
				Количество = ПогонныйМетраж; 
			ИначеЕсли  стр.Номенклатура.ЕдиницаИзмерения = МассивЛико_Предопределенные[2]  Тогда
				КвадратныйМетраж  = стр.Количество;
				ПогонныйМетраж = стр.Количество/Нарезка;
				Количество = КвадратныйМетраж;
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 05.12.2023	
			
		ВесОбщий 		= ВесОбщий + стр.Вес;		
		МетражКвМ 		= МетражКВМ + КвадратныйМетраж;
		МетражПМ 		= МетражПМ + ПогонныйМетраж;
		КоличествоОбщее = КоличествоОбщее + Количество;
		
		ЕдиницаИзмеренияЗаказа = стр.Номенклатура.ЕдиницаИзмерения;
		
	КонецЦикла;
	
	// --> Начало Лико Митюшин МФМ 29.03.2021
	текВидВырубки = Объект.ВидВырубки;
	ИзмененитьДоступностиПолейНаСервере(текВидВырубки);
	// <-- Конец Лико Митюшин МФМ 29.03.2021
	
	Если Объект.ЕдиницаИзмеренияЗаказа <> ЕдиницаИзмеренияЗаказа Тогда 
		Объект.ЕдиницаИзмеренияЗаказа = ЕдиницаИзмеренияЗаказа;
	КонецЕсли;
	
	Если Объект.МетражКВМ <> МетражКВМ Тогда 
		Объект.МетражКВМ = МетражКВМ;
	КонецЕсли;
	Если Объект.МетражПМ <> МетражПМ Тогда 
		Объект.МетражПМ = МетражПМ;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияЗаказа) ИЛИ ЕдиницаИзмеренияЗаказа = МассивЛико_Предопределенные[0] Тогда
		Если Объект.Тираж <> КоличествоОбщее/1000 Тогда 
			Объект.Тираж = КоличествоОбщее/1000;
		КонецЕсли;
	Иначе 
		 Если Объект.Тираж <> КоличествоОбщее Тогда 
			Объект.Тираж = КоличествоОбщее;
		КонецЕсли;
	КонецЕсли;

	Если Объект.Вес <> ВесОбщий Тогда
		Объект.Вес = ВесОбщий;
	КонецЕсли;
	
	текШтКВМ = Лико_ТиражМетраж.РассчитатьКВМ(Объект.ШТКВМ, МетражКВМ, КоличествоОбщее);
	Если текШтКВМ <> Неопределено И Объект.ШтКВМ <> текШтКВМ Тогда 
		Объект.ШтКВМ = текШтКВМ;
	КонецЕсли;
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		Объект.ДлинаПечатиИндиго = Лико_ТиражМетраж.ПолучитьДлинуПечатиИндиго(Объект, текВидВырубки);
	КонецЕсли;
	
	Если текВидВырубки = 5 ИЛИ (текВидВырубки = 6 И (Лико_ТиражМетраж.ЭтоТермоусадка(Объект)) ИЛИ Не ЗначениеЗаполнено(Объект.ЭтМЭР)) Тогда
		Объект.ЭтМЭР = Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, текВидВырубки);	
	КонецЕсли;
	
	Если текВидВырубки = 6 Тогда
		Объект.ДлинаПечатиИндиго = Лико_ТиражМетраж.ПолучитьДлинуПечатиИндиго(Объект, текВидВырубки);
		Объект.ЭтикетокНаЛистеИндиго =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(Объект, ТекВидВырубки);
	КонецЕсли;
	
	// --> Начало Лико Яцун 26.04.2022
	ДоступностьУтилизироватьИзлишки();
	// <-- Конец Лико Яцун 26.04.2022
	
КонецПроцедуры	

&НаСервере
Функция ЗаполнениеМассиваЭллементов(текВидВырубки)   // --> Начало Лико Митюшин МФМ 18.03.2021
	//Изменение доступности полей, если Добавлен в Массив значит Только просмотр.
	МассивЭлементов = Новый Массив;
	
	//Если нет Вырубного штампа, но есть вид работ вырубка – доступны все параметры печати/вырубки
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда 
		текПараметрыОтбора = Новый Структура;
		текПараметрыОтбора.Вставить("ВидСекции", Справочники.Лико_ВидыСекций.Вырубка);	
		текНайденныеСтроки = Объект.Цвета.НайтиСтроки(текПараметрыОтбора);

		Если текНайденныеСтроки.Количество() <> 0 Тогда
			Возврат МассивЭлементов;
		КонецЕсли;
	КонецЕсли;
	
	//Для всех
	МассивЭлементов.Добавить(Элементы.ШагПечати); 
	МассивЭлементов.Добавить(Элементы.ДлинаПечатиИндиго);
	МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	МассивЭлементов.Добавить(Элементы.Ручьи);
	МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛисте);
	
	Если текВидВырубки = 1 Тогда
		МассивЭлементов.Добавить(Элементы.Z);
		МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеПечати);
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
		МассивЭлементов.Добавить(Элементы.КоличествоШтамповПоДлинеПечатиИндиго);
		МассивЭлементов.Добавить(Элементы.КоличествоЭтПоДлинеПечатиИндиго);
		МассивЭлементов.Добавить(Элементы.КоличествоЭтПоДлинеПечати);
		МассивЭлементов.Добавить(Элементы.ЭтМЭР);
	ИначеЕсли текВидВырубки = 2 Тогда
		МассивЭлементов.Добавить(Элементы.Z);
		МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		МассивЭлементов.Добавить(Элементы.ЭтМЭР);
		МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
		//МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		//МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеПечати);
	ИначеЕсли текВидВырубки = 3 Тогда
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаПечати);
	ИначеЕсли текВидВырубки = 4 Тогда 
		МассивЭлементов.Добавить(Элементы.Z);
		//МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛисте);
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		//Если Лико_ТиражМетраж.ЭтоПечатьНаИндиго(Объект, текВидВырубки) Тогда
		//	МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		//КонецЕсли;
		МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеПечати);
	ИначеЕсли текВидВырубки = 5 Тогда
		//МассивЭлементов.Добавить(Элементы.Z); // по письму от Кристина Мальцева
	ИначеЕсли текВидВырубки = 6 Тогда
		//МассивЭлементов.Добавить(Элементы.ДлинаПечати);
	ИначеЕсли текВидВырубки = 7 Тогда
		МассивЭлементов.Добавить(Элементы.Z);
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		//МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		//МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеПечати);
	ИначеЕсли текВидВырубки = 8 Тогда
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);		
	ИначеЕсли текВидВырубки = 9 Тогда
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаПечати);
	ИначеЕсли текВидВырубки = 10 Тогда
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
	ИначеЕсли текВидВырубки = 11 Тогда
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
	ИначеЕсли текВидВырубки = 12 Тогда
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
	ИначеЕсли текВидВырубки = 13 Тогда
		МассивЭлементов.Добавить(Элементы.Z);
		МассивЭлементов.Добавить(Элементы.ДлинаПечати);
		МассивЭлементов.Добавить(Элементы.ДлинаПечатиИндиго);
		МассивЭлементов.Добавить(Элементы.ЭтМЭР);
		МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеПечати);
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
	// <-- Начало Лико Яцун С. В. 13.06.2023	
	//ИначеЕсли текВидВырубки = 16 Тогда
	//	МассивЭлементов.Добавить(Элементы.Z);
	//	МассивЭлементов.Добавить(Элементы.ДлинаПечати);
	//	МассивЭлементов.Добавить(Элементы.ЭтМЭР);
	//	МассивЭлементов.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	//	МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
	//	МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
	//ИначеЕсли текВидВырубки = 17 Тогда
	//	МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
	//	МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);		
	// <-- Конец Лико Яцун С. В. 13.06.2023
	Иначе 
		МассивЭлементов.Добавить(Элементы.ШиринаЭтикетки);
		МассивЭлементов.Добавить(Элементы.ДлинаЭтикетки);
	КонецЕсли;
	
	Возврат МассивЭлементов;

КонецФункции // <-- Конец Лико Митюшин МФМ 18.03.2021

&НаСервере
Процедура ИзменитьДоступностьОбъектаДляВидаВырубки(пМассивЭлементов) // --> Начало Лико Митюшин МФМ 18.03.2021
	//Не используется!	
	текМассивИзменяемыхЭлементов = Новый Массив;
	текМассивИзменяемыхЭлементов.Добавить(Элементы.Z);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ДлинаПечати);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ШагПечати);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ЭтикетокНаЛистеПечати);	//Только просмотр по умолчанию
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ЭтикетокНаЛисте);
	//текМассивИзменяемыхЭлементов.Добавить(Элементы.РучьиПечати);				//Всегда доступно			
	текМассивИзменяемыхЭлементов.Добавить(Элементы.Ручьи);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.Нарезка);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ШиринаЭтикетки);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ДлинаЭтикетки);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ДлинаПечатиИндиго);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ЭтМЭР);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.КоличествоЭтПоДлинеПечати);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.КоличествоЭтПоДлинеПечатиИндиго);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.КоличествоШтамповПоДлинеПечатиИндиго);
	текМассивИзменяемыхЭлементов.Добавить(Элементы.КоличествоЛистовКнижки);
	//текМассивИзменяемыхЭлементов.Добавить(Элементы.РучьиПечатиИндиго);
	
	Для каждого ЭлМассива из текМассивИзменяемыхЭлементов Цикл
		ЭлМассива.ТолькоПросмотр = (пМассивЭлементов.Найти(ЭлМассива) <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 18.03.2021

&НаСервере
Процедура ИзменитьДоступностьОбъектаПоЦвету()
	Если Объект.ВидВырубки = 0 Тогда
		Возврат;
	КонецЕсли;
	//Синий = WebЦвета.ГолубойСоСтальнымОттенком;
	Желтый = WebЦвета.Лимонный;
	Зеленый = WebЦвета.СветлоЗеленый;
	НейтральноЗеленый = WebЦвета.НейтральноЗеленый;
	//Коричневый = WebЦвета.Золотистый;
	ЦветАвто = Новый Цвет();
	
	Для Каждого элМассива Из МассивПараметровШтампа() Цикл
		Если элМассива.ЦветФона = Желтый ИЛИ элМассива.ЦветФона = Зеленый ИЛИ элМассива.ЦветФона = НейтральноЗеленый Тогда
			ЭлМассива.ТолькоПросмотр = Ложь;
		Иначе
			ЭлМассива.ТолькоПросмотр = Истина;
			// --> Начало Лико Митюшин МФМ 23.07.2021
			Если элМассива.ЦветФона = ЦветАвто Тогда
				Если элМассива = Элементы.ШтампВырубнойАртикул ИЛИ элМассива = Элементы.ФормаШтампа Тогда 
					Продолжить;
				КонецЕсли;
				ТекРеквизит = СтрЗаменить(элМассива.ПутьКДанным, "Объект.", "");
				Если ЗначениеЗаполнено(Объект[ТекРеквизит]) Тогда
					Если ТекРеквизит =  "ДлинаПечати" И Элементы.ДлинаПечатиВидимостьИндиго.Видимость Тогда 
						Продолжить;
					КонецЕсли;
					Если ТекРеквизит =  "Z" И Объект.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Weigang Тогда 
						Продолжить;
					КонецЕсли;
					Объект[ТекРеквизит] = Неопределено;
				КонецЕсли;
			КонецЕсли;
			// <-- Конец Лико Митюшин МФМ 23.07.2021
		КонецЕсли;
	КонецЦикла;
	// <-- Начало Лико Яцун С. В. 21.01.2026 
	Если НЕ Объект.РучнойВводНарезки И НуженРасчетНарезки(Объект.ВидЗаказа) Тогда
		Элем = Элементы.Найти("УтвердитьЦвета");
		Если Элем = Неопределено Тогда 
			Элементы.НарезкаРасчет.Гиперссылка = Ложь; 
		Иначе
			Элементы.НарезкаРасчет.Гиперссылка = Истина; 
		КонецЕсли;
		Элементы.Нарезка.ТолькоПросмотр = Истина;
		Элементы.РучнойВводНарезки.Видимость = Истина;
	ИначеЕсли НуженРасчетНарезки(Объект.ВидЗаказа) Тогда
		Элементы.НарезкаРасчет.Гиперссылка = Ложь;
		Элементы.Нарезка.ТолькоПросмотр = Ложь;
		Элементы.РучнойВводНарезки.Видимость = Истина;
	Иначе
		Элементы.НарезкаРасчет.Гиперссылка = Ложь;
		Элементы.РучнойВводНарезки.Видимость = Ложь;
		Элементы.Нарезка.ТолькоПросмотр = Ложь;
		Объект.РучнойВводНарезки = Ложь;   
		Объект.НарезкаРасчетная = Неопределено;	
	КонецЕсли;   
	// <-- Конец Лико Яцун С. В. 21.01.2026
	Если Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор ИЛИ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПовторСИзменением Тогда
		Элементы.ДлинаЭтикетки.ТолькоПросмотр = Истина;
		// <-- Начало Лико Яцун С. В. 27.09.2024
		Если НеобходимоЗаполнятьРаппортТУ() И НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
			Элементы.ДлинаЭтикетки.ТолькоПросмотр = Ложь;  
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 27.09.2024
		Элементы.ШиринаЭтикетки.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыВырубки);
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыПечати);
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыПечатиИндиго);
	ВидимостьГрупппараметровПечати(ЦветАвто, Элементы.ГруппаПараметрыПечатиОмет);

КонецПроцедуры

&НаСервере
Функция НеобходимоЗаполнятьРаппортТУ()

	Если Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
		ПорядковыйНомерРЦЗаказа = ?(ЗначениеЗаполнено(Объект.РабочийЦентр),Объект.РабочийЦентр.ПорядковыйНомер,Неопределено);
		Если ПорядковыйНомерРЦЗаказа <> Неопределено И (ПорядковыйНомерРЦЗаказа = 2 ИЛИ ПорядковыйНомерРЦЗаказа = 4 ИЛИ ПорядковыйНомерРЦЗаказа = 27 ИЛИ ПорядковыйНомерРЦЗаказа = 30) Тогда
			Возврат Истина;  
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ВидимостьГрупппараметровПечати(ЦветАвто, текГруппа)
	ЭтоВсеБелые = Истина;
	
	Для Каждого текЭлемент из текГруппа.ПодчиненныеЭлементы Цикл
		Если текЭлемент.ЦветФона <> ЦветАвто Тогда
			ЭтоВсеБелые = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если текГруппа.Видимость <> (Не ЭтоВсеБелые) Тогда
		текГруппа.Видимость = (Не ЭтоВсеБелые);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Функция ПолучитьСтрокиПечати(текВидПечать) // --> Начало Лико Митюшин МФМ 18.03.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЦвета.РабочийЦентр КАК РабочийЦентр
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Ссылка
		|	И ЗаказКлиентаЦвета.НомерПроката = 1
		|	И ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧЦвета
		|	И НЕ ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧРаботы
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаЦвета.РабочийЦентр";
	
	Запрос.УстановитьПараметр("Ссылка", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.РабочийЦентр;
	КонецЦикла;
		
КонецФункции // <-- Конец Лико Митюшин МФМ 18.03.2021

&НаСервере
Функция РассчитатьМетражНаСервере(количество, Нарезка = Неопределено, РабочийЦентр = Неопределено)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Возврат РеквизитОбъект.РассчитатьМетражНаСервере(количество, ?(РабочийЦентр = Неопределено, Неопределено, РабочийЦентр.ВидРабочегоЦентра));
	
 КонецФункции	
 
&НаСервере
Процедура ИзмененитьДоступностиПолейНаСервере(текВидВырубки = 0) 
 	//Изменение доступности полей, если Добавлен в Массив значит Только просмотр.
	//МассивЭлементов = ЗаполнениеМассиваЭллементов(текВидВырубки);
	
	текЭлемент = Элементы.ЭтикетокНаЛистеПечати;
	Если Не ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда
		Если текВидВырубки = 5 Тогда
			текЭлемент.ОтображениеПредупрежденияПриРедактировании 	= ОтображениеПредупрежденияПриРедактировании.Отображать;
			текЭлемент.ПредупреждениеПриРедактировании				= "Изменение данного параметра может повлиять на расчеты!";
		Иначе 
			текЭлемент.ОтображениеПредупрежденияПриРедактировании 	= ОтображениеПредупрежденияПриРедактировании.НеОтображать;	
		КонецЕсли;
	ИначеЕсли текЭлемент.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать Тогда 
		текЭлемент.ОтображениеПредупрежденияПриРедактировании 	= ОтображениеПредупрежденияПриРедактировании.НеОтображать;	
	КонецЕсли;
	
	
	//ИзменитьДоступностьОбъектаДляВидаВырубки(МассивЭлементов);
	ВыделениеЦветомПараметровВырубкиВЗависимостиОтТехнологии(текВидВырубки);
	ИзменитьДоступностьОбъектаПоЦвету();
	СделатьПараметрыШтампаНадписьюЕслиТолькоПросмотр();
КонецПроцедуры

&НаСервере
Функция МассивПараметровШтампа()
	МассивЭлементовПараметровШтампа = Новый Массив;
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ШтампВырубнойАртикул);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ФормаШтампа);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДлинаЭтикетки);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ШиринаЭтикетки);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Нарезка);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Z);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Ручьи);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.РучьиПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛисте);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛистеПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ШагПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДлинаПечати);
	
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДлинаПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтМЭР);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ЭтикетокНаЛистеИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоЭтПоДлинеПечати);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоЭтПоДлинеПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоШтамповПоДлинеПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.КоличествоЛистовКнижки);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.РучьиПечатиИндиго);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.Раппорт);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДопускМинус);
	МассивЭлементовПараметровШтампа.Добавить(Элементы.ДопускПлюс);
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда
		МассивЭлементовПараметровШтампа.Добавить(Элементы.ВариантыДопусков);
	КонецЕсли;	
	Возврат МассивЭлементовПараметровШтампа;	
	
КонецФункции

&Насервере
Процедура ТолькоПросмотрДляВсехПараметровШтампа()
	
	Для Каждого элМассива Из МассивПараметровШтампа() Цикл
		Если Элементы.ГруппаПараметрыШтампа.ТолькоПросмотр Тогда
			ЭлМассива.ТолькоПросмотр = Истина;
		Иначе
			Если элМассива = Элементы.ШтампВырубнойАртикул ИЛИ элМассива = Элементы.ФормаШтампа Тогда
				ЭлМассива.ТолькоПросмотр = Истина;
				Продолжить;
			КонецЕсли;
			
			ЭлМассива.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СделатьПараметрыШтампаНадписьюЕслиТолькоПросмотр()
		
	Для Каждого ЭлМассива Из МассивПараметровШтампа() Цикл
		ТекШирина = ЭлМассива.Ширина; 
		ТекЦвет = ЭлМассива.ЦветФона;
		Если ЭлМассива.ТолькоПросмотр И НЕ РазрешеноМенятьПараметрыШтампа Тогда
			ЭлМассива.Вид = ВидПоляФормы.ПолеНадписи;
			ЭлМассива.Рамка 	= Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
			ЭлМассива.Ширина 	= ?(ЭлМассива = Элементы.Z, 13, ТекШирина);
			ЭлМассива.ЦветФона 	= ТекЦвет;
		Иначе
			Если ЭлМассива.Вид <> ВидПоляФормы.ПолеВвода Тогда
				ЭлМассива.Вид = ВидПоляФормы.ПолеВвода;
				Если РазрешеноМенятьПараметрыШтампа И ЭлМассива.ТолькоПросмотр Тогда 
					ЭлМассива.ТолькоПросмотр = Ложь;
				КонецЕсли;
				ЭлМассива.Ширина 	= ?(ЭлМассива = Элементы.Z, 9, ТекШирина);
				ЭлМассива.ЦветФона 	= ТекЦвет;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомПараметровВырубкиВЗависимостиОтТехнологии(ВидВырубки)
	
	Синий 		= WebЦвета.ГолубойСоСтальнымОттенком;
	Желтый 		= WebЦвета.Лимонный;
	Зеленый 	= WebЦвета.СветлоЗеленый;
	Коричневый 	= WebЦвета.Золотистый;
	НейтральноЗеленый 	= WebЦвета.НейтральноЗеленый;	
	ЦветАвто 	= Новый Цвет();
	
	//Если нет Вырубного штампа, но есть вид работ вырубка – доступны все параметры печати/вырубки
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) ИЛИ РазрешеноМенятьПараметрыШтампа Тогда 
		текПараметрыОтбора = Новый Структура;
		текПараметрыОтбора.Вставить("ВидСекции", Справочники.Лико_ВидыСекций.Вырубка);	
		текНайденныеСтроки = Объект.Цвета.НайтиСтроки(текПараметрыОтбора);

		Если текНайденныеСтроки.Количество() <> 0 Тогда
			ВыделениеЦветомГруппаШтампа(Зеленый, Зеленый, Зеленый, Зеленый);
			ВыделениеЦветомГруппаПараметрыВырубки(Зеленый, Зеленый, Зеленый, Зеленый, Зеленый); 
			ВыделениеЦветомГруппаПараметрыПечати(Зеленый, Зеленый, Зеленый, Зеленый, Зеленый, Зеленый); 
			ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Зеленый, Зеленый, Зеленый, Зеленый);
			Если ВидВырубки = 18 ИЛИ ВидВырубки = 19 Тогда
				ВыделениеЦветомГруппаПараметрыПечатиОмет(Зеленый, Зеленый, Зеленый, Зеленый);
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ВидВырубки = 1 Тогда		   		
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, ЦветАвто, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Синий, Зеленый, Коричневый, Коричневый, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 2 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый,  ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 3 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Желтый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 4 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, ЦветАвто, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Зеленый, Коричневый, Зеленый, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 5 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, Коричневый, Желтый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Желтый, Коричневый, Желтый, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 6 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, ?(Лико_ТиражМетраж.ЭтоТермоусадка(Объект), Коричневый, Зеленый), Желтый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Желтый, Коричневый, Коричневый, Зеленый, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 7 Тогда	
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Синий, Зеленый, Зеленый, Синий, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 8 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Зеленый, Зеленый, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 9 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Желтый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 10 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, ЦветАвто, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Зеленый, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Зеленый, ЦветАвто,  Зеленый);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 11 Тогда		
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Зеленый, Коричневый, Желтый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 12 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Коричневый, Зеленый, Коричневый, Желтый, Зеленый, ЦветАвто);  
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 13 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, ЦветАвто, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(Синий, Коричневый, Коричневый, Коричневый, ЦветАвто, Желтый); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 14 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Зеленый, Коричневый, Желтый, Зеленый, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	ИначеЕсли ВидВырубки = 15 Тогда
		ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Синий, Синий); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	// <-- Начало Лико Яцун С. В. 13.06.2023	
	//ИначеЕсли ВидВырубки = 16 Тогда
	//	ВыделениеЦветомГруппаШтампа(Синий, Синий, Коричневый, Зеленый);
	//	ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Коричневый, Синий); 
	//	ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	//	ВыделениеЦветомГруппаПараметрыПечатиИндиго(Зеленый, Зеленый, Коричневый, Коричневый, Зеленый,  ЦветАвто);
	//	ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	//ИначеЕсли ВидВырубки = 17 Тогда
	//	ВыделениеЦветомГруппаШтампа(Синий, Синий, НейтральноЗеленый, Зеленый);
	//	ВыделениеЦветомГруппаПараметрыВырубки(Желтый, Синий, Синий, Коричневый, Синий); 
	//	ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Зеленый, Зеленый, ЦветАвто, ЦветАвто, ЦветАвто); 
	//	ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	//	ВыделениеЦветомГруппаПараметрыПечатиОмет(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
	// <-- Конец Лико Яцун С. В. 13.06.2023	
	ИначеЕсли ВидВырубки = 18 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, ЦветАвто, НейтральноЗеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Желтый, Коричневый, Коричневый, Коричневый, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(Коричневый, Коричневый, Коричневый, Желтый);
	ИначеЕсли ВидВырубки = 19 Тогда		
		ВыделениеЦветомГруппаШтампа(Желтый, Желтый, ЦветАвто, НейтральноЗеленый);
		ВыделениеЦветомГруппаПараметрыВырубки(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечати(ЦветАвто, Желтый, Коричневый, Коричневый, Коричневый, ЦветАвто); 
		ВыделениеЦветомГруппаПараметрыПечатиИндиго(ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто, ЦветАвто);
		ВыделениеЦветомГруппаПараметрыПечатиОмет(Коричневый, Коричневый, Коричневый, Желтый);
	КонецЕсли;		
	
	Если ВидВырубки = 6 Тогда 
		Элементы.ДлинаПечатиВидимостьИндиго.Видимость = Истина;
	ИначеЕсли Элементы.ДлинаПечатиВидимостьИндиго.Видимость Тогда
		Элементы.ДлинаПечатиВидимостьИндиго.Видимость = Ложь;	
	КонецЕсли;
	
	Если (ВидВырубки = 3 ИЛИ ВидВырубки = 8 ИЛИ ВидВырубки = 11 ИЛИ ВидВырубки = 12) И 
		Объект.Ручьи = Объект.ЭтикетокНаЛисте Тогда 
		Элементы.ШагПечати.ЦветФона = Зеленый;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомГруппаШтампа(пШиринаЭтикетки, пДлинаЭтикетки, пЭтМЭР, пНарезка)
	Элементы.ШиринаЭтикетки.ЦветФона	= пШиринаЭтикетки;
	Элементы.ДлинаЭтикетки.ЦветФона		= пДлинаЭтикетки;
	Элементы.ЭтМЭР.ЦветФона				= пЭтМЭР;
	Элементы.Нарезка.ЦветФона			= пНарезка;
	// <-- Начало Лико Яцун С. В. 21.01.2026 
	Если НуженРасчетНарезки(Объект.ВидЗаказа) Тогда
		Элементы.Нарезка.ЦветФона			= WebЦвета.НейтральноЗеленый;; 
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 21.01.2026
КонецПроцедуры	

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыВырубки(пШтампВырубнойАртикул, пРучьи, пЭтикетокНаЛисте, пШагПечати, пФормаШтампа)
	Элементы.ШтампВырубнойАртикул.ЦветФона	= пШтампВырубнойАртикул;
	Элементы.Ручьи.ЦветФона					= пРучьи;
	Элементы.ЭтикетокНаЛисте.ЦветФона		= пЭтикетокНаЛисте;
	Элементы.ШагПечати.ЦветФона				= пШагПечати;
	Элементы.ФормаШтампа.ЦветФона			= пФормаШтампа;
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыПечати(пZ, пРучьиПечати, пЭтикетокНаЛистеПечати, пДлинаПечати, пКоличествоЭтПоДлинеПечати, пКоличествоЛистовКнижки)
	Элементы.Z.ЦветФона							= пZ;
	Элементы.РучьиПечати.ЦветФона				= пРучьиПечати;
	Элементы.ЭтикетокНаЛистеПечати.ЦветФона		= пЭтикетокНаЛистеПечати;
	// <-- Начало Лико Яцун С. В. 27.09.2024
	//Элементы.ДлинаПечати.ЦветФона				= пДлинаПечати;
	Если НеобходимоЗаполнятьРаппортТУ() Тогда
		Элементы.ДлинаПечати.ЦветФона		= WebЦвета.Золотистый;
	Иначе
		Элементы.ДлинаПечати.ЦветФона				= пДлинаПечати;  
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 27.09.2024
	Элементы.КоличествоЭтПоДлинеПечати.ЦветФона	= пКоличествоЭтПоДлинеПечати;
	Элементы.КоличествоЛистовКнижки.ЦветФона	= пКоличествоЛистовКнижки;	
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыПечатиИндиго(пКоличествоКликов, пРучьиПечати, пЭтикетокНаЛисте, пДлинаПечати, пКоличествоЭтПоДлинеПечати, пКоличествоШтамповПоДлинеПечати)
	Элементы.КоличествоКликов.ЦветФона						= пКоличествоКликов;
	Элементы.РучьиПечатиИндиго.ЦветФона						= пРучьиПечати;
	Элементы.ЭтикетокНаЛистеИндиго.ЦветФона					= пЭтикетокНаЛисте;
	Элементы.ДлинаПечатиИндиго.ЦветФона						= пДлинаПечати;
	Элементы.КоличествоЭтПоДлинеПечатиИндиго.ЦветФона		= пКоличествоЭтПоДлинеПечати;
	Элементы.КоличествоШтамповПоДлинеПечатиИндиго.ЦветФона	= пКоличествоШтамповПоДлинеПечати;		
КонецПроцедуры

&НаСервере
Процедура ВыделениеЦветомГруппаПараметрыПечатиОмет(пРаппорт, пДопускМинус, пДопускПлюс, пВариантыДопусков) // <-- Начало Лико Яцун С. В. 05.07.2023
	// <-- Начало Лико Яцун С. В. 27.09.2024
	//Элементы.Раппорт.ЦветФона		= пРаппорт;
	Если НеобходимоЗаполнятьРаппортТУ() Тогда
		Элементы.Раппорт.ЦветФона		= WebЦвета.Золотистый;
	Иначе
		Элементы.Раппорт.ЦветФона		= пРаппорт;
	КонецЕсли;  
	// <-- Конец Лико Яцун С. В. 27.09.2024
	Элементы.ДопускМинус.ЦветФона	= пДопускМинус;
	Элементы.ДопускПлюс.ЦветФона	= пДопускПлюс;
	Элементы.ВариантыДопусков.ЦветФона	= пВариантыДопусков;
КонецПроцедуры // <-- Конец Лико Яцун С. В. 05.07.2023

&НаСервере
Функция РассчитатьТиражНаСервере(ПогонныйМетраж, Нарезка = Неопределено, РабочийЦентр = Неопределено)	
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Возврат РеквизитОбъект.РассчитатьТиражНаСервере(ПогонныйМетраж, ?(РабочийЦентр = Неопределено, Неопределено, РабочийЦентр.ВидРабочегоЦентра));
	
КонецФункции 	

&НаСервере
Процедура ПроверкаИзмененияВидВырубки(ПересчитыватьМетраж = Истина)
	// --> Начало Лико Митюшин МФМ 19.05.2021
	текБылиИзменения = Ложь;
	
	ЗаполнитьЭтикеткиПечати(Объект.ВидВырубки, текБылиИзменения);	
	
	текДлинаПечати = Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, Объект.ВидВырубки);
	Если текДлинаПечати <> Объект.ДлинаПечати Тогда
		Объект.ДлинаПечати 				= текДлинаПечати;
		текБылиИзменения = Истина;
	КонецЕсли;
	
	Если ПересчитыватьМетраж Тогда  
		Если текБылиИзменения Тогда
			РасчитатьТиражМетраж();
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 19.05.2021
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтикеткиПечати(ТекВидВырубки, текБылиИзменения = Неопределено)
	
	Если Не (ТекВидВырубки = 2 ИЛИ ТекВидВырубки = 6 ИЛИ ТекВидВырубки = 10 ИЛИ (ТекВидВырубки = 0 И ОмегаСНумератором())) Тогда 
		текЭтикетокНаЛистеПечати =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, ТекВидВырубки);
		Если текЭтикетокНаЛистеПечати <> Объект.ЭтикетокНаЛистеПечати Тогда
			Объект.ЭтикетокНаЛистеПечати 	= текЭтикетокНаЛистеПечати;
			текБылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не (ТекВидВырубки = 1 ИЛИ ТекВидВырубки = 3 ИЛИ ТекВидВырубки = 4 ИЛИ ТекВидВырубки = 5
 		ИЛИ ТекВидВырубки = 7 ИЛИ ТекВидВырубки = 8 ИЛИ ТекВидВырубки = 11 ИЛИ ТекВидВырубки = 13 ИЛИ ТекВидВырубки = 14 ИЛИ ТекВидВырубки = 15 ИЛИ ТекВидВырубки = 18 ИЛИ ТекВидВырубки = 19 
		ИЛИ (ТекВидВырубки = 0 И ОмегаСНумератором())) Тогда 
		текЭтикетокНаЛистеИндиго =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(Объект, ТекВидВырубки);
		Если текЭтикетокНаЛистеИндиго <> Объект.ЭтикетокНаЛистеИндиго Тогда
			Объект.ЭтикетокНаЛистеИндиго 	= текЭтикетокНаЛистеИндиго;
			текБылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
	
&НаСервере
Процедура УтверждениеЦветов()
	
	Если ЗначениеЗаполнено(Объект.ДатаУтвержденияЦветов) Тогда 
		//Проверяем, есть ли кнопка утверждения и убираем ее
		Элем = Элементы.Найти("УтвердитьЦвета");
		Если Элем <> Неопределено Тогда 
			Элементы.Удалить(Элем);
		КонецЕсли;	
	
		ОтменитьУтверждениеЦветов=Элементы.Добавить("ОтменитьУтверждениеЦветов", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
    	ОтменитьУтверждениеЦветов.Заголовок="Утвердил: "+  Объект.УтвердилЦвета.Наименование+ " "+Строка(Объект.ДатаУтвержденияЦветов);
    	ОтменитьУтверждениеЦветов.ИмяКоманды="ОтменитьУтверждениеЦветов";
		ОтменитьУтверждениеЦветов.Отображение = ОтображениеКнопки.КартинкаИТекст;
		ОтменитьУтверждениеЦветов.Картинка = БиблиотекаКартинок.ОтметитьОперациюВыполненной;
				
		//Устанавливаем запрет на изменение работ
		Элементы.Цвета.ТолькоПросмотр = Истина;
		Элементы.ЦветаДобавитьЦМИК.Доступность = Ложь;
		Элементы.Переместить(Элементы.ОтменитьУтверждениеЦветов, Элементы.Цвета.КоманднаяПанель);
		Элементы.ГруппаПараметрыШтампа.ТолькоПросмотр = Истина;
		Элементы.ГруппаТермоусадка.ТолькоПросмотр = Истина;
		Элементы.ГруппаТермоусадка1.ТолькоПросмотр = Истина;
		Элементы.ЦветаСоздатьВал.Доступность = Ложь;
		Элементы.ЦветаКопироватьФормы.Доступность = Ложь;
		Элементы.ЦветаСоздатьФормы.Доступность = Ложь;
		Элементы.ЦветаЗагрузитьИзВнешнегоФайла.Доступность = Ложь;
		Элементы.ЦветаЗаполнитьПантоны.Доступность = Ложь;
		Элементы.НарезкаРасчет.Гиперссылка = Ложь;
		// --> Начало Лико Митюшин МФМ 07.09.2021
		ЗаполнениеРеквизитовПриУтвержденииЦветов(Объект.ВидВырубки);
		// <-- Конец Лико Митюшин МФМ 07.09.2021
		ТолькоПросмотрДляВсехПараметровШтампа();
		СделатьПараметрыШтампаНадписьюЕслиТолькоПросмотр();
		ВыделениеЦветомПараметровВырубкиВЗависимостиОтТехнологии(Объект.ВидВырубки);
		ИзменитьДоступностьОбъектаПоЦвету();
	Иначе
		Элем = Элементы.Найти("ОтменитьУтверждениеЦветов");
		Если Элем <> Неопределено Тогда 
			Элементы.Удалить(Элем);
		КонецЕсли;	
		УтвердитьЦвета=Элементы.Добавить("УтвердитьЦвета", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
    	УтвердитьЦвета.Заголовок="Утвердить";
    	УтвердитьЦвета.ИмяКоманды="УтвердитьЦвета";
		УтвердитьЦвета.Картинка = БиблиотекаКартинок.Успешно;
		Элементы.Цвета.ТолькоПросмотр = Ложь;
		Элементы.ЦветаДобавитьЦМИК.Доступность = Истина;
		Элементы.Переместить(Элементы.УтвердитьЦвета, Элементы.Цвета.КоманднаяПанель); 
		Элементы.ГруппаПараметрыШтампа.ТолькоПросмотр = Ложь;
		Элементы.ГруппаТермоусадка.ТолькоПросмотр = Ложь;
		Элементы.ГруппаТермоусадка1.ТолькоПросмотр = Ложь;
		Если Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
			Элементы.ЦветаСоздатьВал.Доступность = Ложь;
		Иначе
			Элементы.ЦветаСоздатьВал.Доступность = Истина;
		КонецЕсли;
		Элементы.ЦветаЗагрузитьИзВнешнегоФайла.Доступность = Истина;
		Элементы.ЦветаКопироватьФормы.Доступность = Истина;
		Элементы.ЦветаСоздатьФормы.Доступность = Истина;
		Элементы.ЦветаЗаполнитьПантоны.Доступность = Истина;
		Если Объект.РучнойВводНарезки Тогда
			Элементы.НарезкаРасчет.Гиперссылка = Ложь;
		Иначе
			Элементы.НарезкаРасчет.Гиперссылка = Истина;
		КонецЕсли;

		ТолькоПросмотрДляВсехПараметровШтампа();
		// --> Начало Лико Митюшин МФМ 07.04.2021
		ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
		// <-- Конец Лико Митюшин МФМ 07.04.2021
		Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда
			Элементы.ВариантыДопусков.КнопкаВыпадающегоСписка = Истина;
			Если НЕ ЗначениеЗаполнено(Элементы.ВариантыДопусков.СписокВыбора) Тогда
				Элементы.ВариантыДопусков.СписокВыбора.Добавить(1,"1 : 0"); 
				Элементы.ВариантыДопусков.СписокВыбора.Добавить(2,"0,5 : 0,5");
				Элементы.ВариантыДопусков.СписокВыбора.Добавить(3,"0 : 1");  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда
		Элементы.ДопускМинус.Формат = "ЧН=0";
		Элементы.ДопускПлюс.Формат = "ЧН=0";
	КонецЕсли;
    Если ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		ВидРЦ = Объект.РабочийЦентр.ВидРабочегоЦентра; 
	КонецЕсли;
	
КонецПроцедуры  

Процедура ЦветаРаботы(Создание)
	
	Если НЕ Объект.Комбинированный Тогда
		Элементы.ЦветаЗаказМатериала.Видимость = Ложь;	
	КонецЕсли;
	Если Создание Тогда
		КнопкаСортировки = Элементы.Добавить("ВыдвинутьКолонкиРабот", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
		КнопкаСортировки.Заголовок = "Работы";
		КнопкаСортировки.ИмяКоманды = "ВыдвинутьКолонкиРабот";
		КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;  
		КнопкаСортировки.Картинка  	 = БиблиотекаКартинок.НастроитьСписок;  
        Элементы.Переместить(Элементы.ВыдвинутьКолонкиРабот, Элементы.Цвета.КоманднаяПанель, Элементы.ЦветаНумератор);
	Иначе 
		Элем = Элементы.Найти("ВыдвинутьКолонкиРабот");
		Если Элем <> Неопределено Тогда 
			Элементы.Удалить(Элем);
			КнопкаСортировки = Элементы.Добавить("ВернутьСортировкуКолонок", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
			КнопкаСортировки.Заголовок 	 = "Цвета";
			КнопкаСортировки.ИмяКоманды  = "ВернутьСортировкуКолонок"; 
			КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;
			КнопкаСортировки.Картинка  	 = БиблиотекаКартинок.НастроитьСписок; 
			
			
			//Элементы.Переместить(Элементы.ЦветаНомерПроката,  			Элементы.Цвета, Элементы.ЦветаНомерСекции);   
			//Элементы.Переместить(Элементы.ЦветаРабочийЦентр, 			Элементы.Цвета, Элементы.ЦветаНомерСекции);    
			//Элементы.Переместить(Элементы.ЦветаВидСекции, 	  			Элементы.Цвета, Элементы.ЦветаНомерСекции);  
			Элементы.Переместить(Элементы.ЦветаЗаказНовойОснастки, 		Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаНаправлениеПротяжки,		Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
		//	Элементы.Переместить(Элементы.ЦветаВидОснастка, 			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаПодача, 					Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаЭтикетокВПодаче,     	Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаКодМатериала,  			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаМатериал,  	  			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаЗаказМатериала,  	  	Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаНарезка,  	 			Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевМатериала,  	 	Элементы.Цвета, Элементы.ЦветаТипКраскиКод);
		
			Элементы.Переместить(Элементы.ВернутьСортировкуКолонок, Элементы.Цвета.КоманднаяПанель, Элементы.ЦветаНумератор);
			
			Элементы.Переместить(Элементы.ЦветаТипНумератора,  				Элементы.Цвета);   
			Элементы.Переместить(Элементы.ЦветаТипКода, 	   				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаГрамматураНаРЦ, 				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаТрафаретнаяСетка,			Элементы.Цвета);
		Иначе
			
			Элем = Элементы.Найти("ВернутьСортировкуКолонок");
			Элементы.Удалить(Элем);
			КнопкаСортировки = Элементы.Добавить("ВыдвинутьКолонкиРабот", Тип("КнопкаФормы"), Элементы.Цвета.КоманднаяПанель);
			КнопкаСортировки.Заголовок 	 = "Работы";
			КнопкаСортировки.ИмяКоманды  = "ВыдвинутьКолонкиРабот";    
			КнопкаСортировки.Отображение = ОтображениеКнопки.КартинкаИТекст;
			КнопкаСортировки.Картинка 	 = БиблиотекаКартинок.НастроитьСписок;  
			
			Элементы.Переместить(Элементы.ЦветаКодМатериала,  			Элементы.Цвета, Элементы.ЦветаФормулаПантона);
			Элементы.Переместить(Элементы.ЦветаМатериал,  	  			Элементы.Цвета, Элементы.ЦветаФормулаПантона);
			Элементы.Переместить(Элементы.ЦветаНаправлениеПротяжки,	  Элементы.Цвета);
		//	Элементы.Переместить(Элементы.ЦветаВидОснастка, 			  Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаЗаказНовойОснастки, 		Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаПодача, 					Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаЭтикетокВПодаче,     	Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаЗаказМатериала,  	  	Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаНарезка,  	 			Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевМатериала,  	Элементы.Цвета);
						
			Элементы.Переместить(Элементы.ВыдвинутьКолонкиРабот, Элементы.Цвета.КоманднаяПанель, Элементы.ЦветаНумератор);
			
			Элементы.Переместить(Элементы.ЦветаТипНумератора,  				Элементы.Цвета);   
			Элементы.Переместить(Элементы.ЦветаТипКода, 	   				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаЗаказНовойОснастки, 			Элементы.Цвета);
			Элементы.Переместить(Элементы.ЦветаГрамматураНаРЦ, 				Элементы.Цвета); 
			Элементы.Переместить(Элементы.ЦветаТрафаретнаяСетка,			Элементы.Цвета);
		КонецЕсли;	
		
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ВыдвинутьКолонкиРабот(Команда)
	
	ЦветаРаботы(ложь);		
	
КонецПроцедуры  

&НаКлиенте
Процедура ВернутьСортировкуКолонок(Команда)
	
	ЦветаРаботы(ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗатратыНаСервере()
	Лико_Планирование.ЗаполнениеЗатратИзЗакрытиеБланка(Объект.Ссылка, Ложь);
	Прочитать();

КонецПроцедуры


&НаСервере
Функция ПолучитьРЦПоНомеруНаСервере(ПорядковыйНомер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РабочиеЦентры.Ссылка, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РЦ
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ПорядковыйНомер = &ПорядковыйНомер";
	Запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.РЦ) Тогда
		Возврат Результат.РЦ
	Иначе
		Возврат Справочники.РабочиеЦентры.ПустаяСсылка();
	КонецЕсли;

КонецФункции

&НаСервере
Процедура РассчитатьНормативыПоОтгрузкеНаСервере(Идентификатор)
	текстр = Объект.Отгрузки.НайтиПоИдентификатору(Идентификатор);
	количество = текстр.количество*1000;

		
	ТаблицаРЦ =Лико_Планирование.ПолучитьРЦПоПеределам(Объект.Ссылка, текстр.РабочийЦентр);
	
	МетрыНаБрак = 0;
	МетрыНаНастройку = 0;
	МойкаСекций = 0;
	ОбщееВремяВыполненияЗаказа = 0;
	БракНастройкаГалакси = 0;
	БракНастройкаНьюФойл =0;
	ВремяИзготовления = 0;
	ВремяВыполненияЗаказаВЧасах=0;
	ВремяВыполненияНФ =0;
	ЗатратыНаМатериалы = 0;
	РасчетЗП=Ложь;
	РасчетноеКоличествоКликов = 0;
	//Необходимо очистить параметры
	Для каждого ТекРЦ из ТаблицаРЦ Цикл 
		КоличествоНастроек = текстр.Настройка;
		НормативыДляРЦ=  Лико_Планирование.РассчитатьНормативыДляРЦ(Объект.ссылка, текстр.ПогонныйМетраж,ТекРЦ.РЦ, МетрыНаБрак, МетрыНаНастройку, текРЦ.НомерПроката, количество);	
		стрНормативы = Объект.Нормативы.Добавить();
		стрНормативы.НомерОтгрузки =  текстр.ключстроки;
		стрНормативы.НомерПроката = текРЦ.НомерПроката;
		стрНормативы.РабочийЦентр = ТекРЦ.РЦ; //ТекРЦ.Значение;
	//	
	//	Если ТипЗнч(НормативыДляРЦ) <>Тип("Строка") Тогда
	//			
			МетрыНаБрак = МетрыНаБрак +НормативыДляРЦ.МетрыНаБрак;
			МетрыНаНастройку = МетрыНаНастройку+НормативыДляРЦ.МетрыНаНастройку*КоличествоНастроек;
			МойкаСекций = МойкаСекций+НормативыДляРЦ.МойкаСекций;
			//Т.к. настроек может быть несколько!
			ОбщееВремяВыполненияЗаказа =ОбщееВремяВыполненияЗаказа+НормативыДляРЦ.ВремяПечати+НормативыДляРЦ.ВремяНаНастройку*КоличествоНастроек;
					

			стрНормативы.МетрыНаНастройку = НормативыДляРЦ.МетрыНаНастройку*КоличествоНастроек;
			стрНормативы.МетрыНаБрак = НормативыДляРЦ.МетрыНаБрак;
			стрНормативы.ВремяПечати = Окр(НормативыДляРЦ.ВремяПечати/60,2);
			стрНормативы.ВремяНаНастройку = Окр(НормативыДляРЦ.ВремяНаНастройку/60,2)*КоличествоНастроек;
			стрНормативы.ВремяНаСменуРоликов = Окр(НормативыДляРЦ.ВремяНаСменуРоликов/60,2);

			стрНормативы.СкоростьПечати = НормативыДляРЦ.СкоростьПечати;
			стрНормативы.МетражДляРЦ = текстр.ПогонныйМетраж+ МетрыНаБрак+МетрыНаНастройку;
			стрНормативы.ПроцентНаБрак = НормативыДляРЦ.ПроцентНаБрак*100;

			ВремяВыполненияЗаказаВЧасах = ВремяВыполненияЗаказаВЧасах+Окр(НормативыДляРЦ.ВремяПечати/60,2)+Окр(НормативыДляРЦ.ВремяНаНастройку/60,2)*КоличествоНастроек+Окр(НормативыДляРЦ.ВремяНаСменуРоликов/60,2);
			ВремяИзготовления = ВремяИзготовления+НормативыДляРЦ.ВремяПечати+НормативыДляРЦ.ВремяНаНастройку *КоличествоНастроек+НормативыДляРЦ.ВремяНаСменуРоликов;
			//Если ТекРЦ.РЦ.ВидРабочегоЦентра= Справочники.ВидыРабочихЦентров.NewFoil Тогда 
			//ВремяВыполненияНФ = ВремяВыполненияНФ+НормативыДляРЦ.ВремяПечати+НормативыДляРЦ.ВремяНаНастройку*КоличествоНастроек;	
			//КонецЕсли;
			
	        Нарезка =  ?(ЗначениеЗаполнено(Объект.НарезкаФакт), Объект.НарезкаФакт.Размер, Объект.Нарезка.Размер)/1000;
			текстр.общийметраж = стрНормативы.МетражДляРЦ * Нарезка; 
		Если НормативыДляРЦ.Свойство("ВсегоКликов") Тогда
			РасчетноеКоличествоКликов = НормативыДляРЦ.ВсегоКликов+РасчетноеКоличествоКликов;
		КонецЕсли;

	КонецЦикла;
	Если текстр.РабочийЦентр.видРабочегоЦентра = Справочники.видырабочихцентров.Indigo Тогда 
		текстр.РасчетноеКоличествоКликов = НормативыДляРЦ.ВсегоКликов;
	КонецЕсли;
	
	текстр.времяизготовления = ВремяВыполненияЗаказаВЧасах;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДопМатериалов(ГруппаРабот)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧЦвета
	|				И НЕ ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧРаботы
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|		ИНАЧЕ ЗаказКлиентаЦвета.ВидСекции
	|	КОНЕЦ КАК ВидРабот,
	|	ЗаказКлиентаЦвета.Материал КАК Материал,
	|	ЗаказКлиентаЦвета.Нарезка КАК Нарезка,
	|	ЗаказКлиентаЦвета.ПроцентЗаливки КАК ПроцентЗаливки,
	|	ЗаказКлиентаЦвета.Подача КАК Дополнительно,
	|	ЗаказКлиентаЦвета.ЭтикетокВПодаче КАК ЭтикетокВПодаче,
	|	ЕСТЬNULL(Лико_ПараметрыШтампа.ЭтикетокНаЛисте, 0) КАК ЭтикетокНаЛисте
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ЗаказКлиентаЦвета.Оснастка = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	ЗаказКлиентаЦвета.Ссылка = &Ссылка
	|	И ЗаказКлиентаЦвета.ВидСекции.ВидРабот.Родитель = &ГруппаРабот
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиентаЦвета.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ГруппаРабот", ГруппаРабот);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьФормуНаСервере(Текст)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Формы.Ссылка  
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|ГДЕ
	|	Лико_Формы.Код = &Код";
	
	// <-- Начало Лико Яцун С. В. 23.01.2025
	Если Объект.Площадка = Справочники.Лико_Площадки.Линкс Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Лико_Формы.Код = &Код","Лико_Формы.КодЛинкс = &Код 
																		|ИЛИ Лико_Формы.КодЛинкс = ""0"" + &Код      
																		|ИЛИ Лико_Формы.КодЛинкс = ""00"" + &Код      
																		|ИЛИ Лико_Формы.КодЛинкс = ""000"" + &Код
																		|ИЛИ Лико_Формы.КодЛинкс = ""0000"" + &Код
																		|ИЛИ Лико_Формы.КодЛинкс = ""00000"" + &Код
																		|ИЛИ Лико_Формы.КодЛинкс = ""000000"" + &Код
																		|ИЛИ Лико_Формы.КодЛинкс = ""0000000"" + &Код
																		|ИЛИ Лико_Формы.КодЛинкс = ""00000000"" + &Код
																		|ИЛИ Лико_Формы.КодЛинкс = ""000000000"" + &Код");		
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 23.01.2025
	
	Запрос.УстановитьПараметр("Код",Текст);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.ссылка) Тогда
		Возврат Результат.ссылка;
	Иначе 
		Возврат Справочники.Лико_Формы.ПустаяСсылка();
	КонецЕсли;

КонецФункции	


&НаСервере
Функция СоздатьОМНаСервере(номенклатура)
	СпрОбъект = Справочники.Лико_ОригиналМакеты.СоздатьЭлемент();
	СпрОбъект.Наименование = номенклатура.Наименование;
	СпрОбъект.Записать();
	Спр = СпрОбъект.Ссылка;
	Возврат спр;
КонецФункции

&НаСервере
Функция ПолучитьХарактеристикуНаСервере(номенклатура)
	СоздаватьХарактеристику = Ложь;
	ЗапросХарактеристики = Новый Запрос;
	ЗапросХарактеристики.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Номенклатура
	|	И ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ";
	ЗапросХарактеристики.УстановитьПараметр("Номенклатура", Номенклатура);
	ЗапросХарактеристики.УстановитьПараметр("Заказ", Объект.Ссылка);
	РезультатЗапросаХ = ЗапросХарактеристики.Выполнить();
	Если РезультатЗапросаХ.Пустой() Тогда 
		СоздаватьХарактеристику = Истина;
	Иначе
		РезультатХ = РезультатЗапросаХ.Выбрать();
		РезультатХ.Следующий();
		Если ЗначениеЗаполнено(РезультатХ.Ссылка) Тогда 
			Возврат РезультатХ.Ссылка;
		Иначе 
			СоздаватьХарактеристику = Истина;
		КонецЕсли;
	КонецЕсли;	
	Если СоздаватьХарактеристику Тогда 
		СпрХар = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		СпрХар.Владелец = Номенклатура;
		СпрХар.Лико_ЗаказНоменклатуры = Объект.ссылка;
		//Василий сказал, что наименование заполнять не надо (заполнится по шаблону)
		//СпрХар.Наименование = "Заказ" + Прав(Объект.Номер,7);
		СпрХар.Записать();
		Возврат СпрХар.Ссылка;
	КонецЕсли;
			
	
КонецФункции

	
&НаСервере
Функция	УточнитьНаименованиеХарактеристики(Характеристика, Номер)
	СпрХар = Характеристика.ПолучитьОбъект();
	СпрХар.Наименование = "Заказ " + Номер;
	СпрХар.Записать();
КонецФункции

&НаСервере
Функция ПолучитьКоэффициентПеремотки()  
	Коэффициент = 1;
	Если ЗначениеЗаполнено(Объект.Ручьи) Тогда 
		Если Объект.Ручьи >2 И Объект.Ручьи<6 Тогда 
			Коэффициент = Коэффициент+0.2;
		ИначеЕсли Объект.ручьи >5 Тогда 
			Коэффициент = Коэффициент+0.5;
		КонецЕсли;
		
		Если Объект.ТОвары.Количество()>0 Тогда 
			Если Объект.Товары[0].МаксимальныйДиаметрРулона<100 Тогда 
				Коэффициент = Коэффициент+0.5;
			КонецЕсли;
		КонецЕсли;
			Если Объект.СпособНаклейки = Перечисления.Лико_СпособыНаклейки.Этикеровщик Тогда 
				Коэффициент = Коэффициент+0.5;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ОсновнойМатериалФакт) Тогда 
				ЦГ = Объект.ОсновнойМатериалФакт;
			Иначе	
				Если ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") Тогда
					ЦГ =  Объект.ОсновнойМатериал.ЦеноваяГруппа;
				Иначе
					ЦГ = Объект.ОсновнойМатериал;
				КонецЕсли;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ЦГ) Тогда
				КодЦГ = СокрЛП(ЦГ.Код);
				Если Прав(КодЦГ,2)="30" ИЛИ Прав(КодЦГ,2)="70" ИЛИ Прав(КодЦГ,2)="71" Тогда
					Коэффициент = 3;
				КонецЕсли;
			КонецЕсли;
	
	КонецЕсли;	
	

	
	Если Объект.Площадка = Справочники.Лико_Площадки.Сибирь Тогда 
		ДлинаГотовогоРоликаПМ = ПОлучитьДлинуГотовогоРОлика();
		Если ЗначениеЗаполнено(ДлинаГотовогоРоликаПМ) Тогда 
			Если ДлинаГотовогоРоликаПМ<20 Тогда 
				Коэффициент = Коэффициент+7;
			ИначеЕсли ДлинаГотовогоРоликаПМ<40 Тогда 
				Коэффициент = Коэффициент+4;
			ИначеЕсли ДлинаГотовогоРоликаПМ<80 Тогда 
				Коэффициент = Коэффициент+2;
			ИначеЕсли ДлинаГотовогоРоликаПМ<120 Тогда 
				Коэффициент = Коэффициент+1;
			ИначеЕсли ДлинаГотовогоРоликаПМ<160 Тогда 
				Коэффициент = Коэффициент+0.5;
			КонецЕсли;
		КонецЕсли;
			
	//	Если весь тираж по заказу пог. м.:
	    МетражПМЧистый = Объект.МетражПМ;
		Если МетражПМЧистый<100 Тогда 
	//меньше 100
			Коэффициент = Коэффициент+7;
		ИначеЕсли МетражПМЧистый<200 Тогда 
			Коэффициент = Коэффициент+4;
		ИначеЕсли МетражПМЧистый<300 Тогда 
			Коэффициент = Коэффициент+2;
		ИначеЕсли МетражПМЧистый<500 Тогда 
			Коэффициент = Коэффициент+1;
		ИначеЕсли МетражПМЧистый<800 Тогда 
			Коэффициент = Коэффициент+0.5;
		КонецЕсли;
		
		Если Объект.ЧестныйЗнак Тогда
			Коэффициент = Коэффициент+1;
		КонецЕсли;
		// <-- Начало Лико Яцун С. В. 03.09.2025 
		Если Объект.ЧестныйЗнак Тогда
			Коэффициент = Коэффициент * 2 
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 03.09.2025 
		
	КонецЕсли;
	
	Возврат коэффициент;



	
КонецФункции

Функция ПОлучитьДлинуГотовогоРОлика()
	ДлинаГотовогоРоликаПМ=0;
	Если Объект.Товары.Количество() > 0 Тогда 
		стрТОвары = Объект.ТОвары[0];
		Ручьи = Объект.Ручьи;

		МаксимальныйДиаметр = стрТОвары.МаксимальныйДиаметрРулона;
		КоличествоЭтикетокВРолике = стрТовары.КоличествоЭтикетокВРолике +  стрТовары.ДопЭтикетокВРолике;
		Если ЗначениеЗаполнено(МаксимальныйДиаметр) И ЗначениеЗаполнено(стрТовары.ВнутреннийДиаметр) Тогда 
			ВнутреннийДиаметр = стрТовары.ВнутреннийДиаметр.Размер;				
			ДлинаГотовогоРоликаПМ= (Pow(МаксимальныйДиаметр/2,2)-Pow((ВнутреннийДиаметр+6)/2,2))*3.14/125   ;
		КонецЕсли;

		РЦЦифры = Справочники.РабочиеЦентры.ПустаяСсылка();
		Для каждого стр из Объект.Цвета Цикл
			Если стр.рабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Indigo Тогда 
				РЦЦифры = стр.РабочийЦентр;
			КонецЕсли;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(РЦЦифры) ТОгда 
			Если Не ЗначениеЗаполнено(ДлинаГотовогоРоликаПМ) И значениеЗаполнено(Объект.ЭтикетокНаЛисте)  Тогда 
				ДлинаГотовогоРоликаПМ = КоличествоЭтикетокВРолике *Объект.Z.КоличествоЗубьев * 3.175 * ручьи / (Объект.ЭтикетокНаЛисте*1000);
			КонецЕсли;
		Иначе 
			Если ЗначениеЗаполнено(Объект.ЭтикетокНаЛисте) И ЗначениеЗаполнено(Ручьи) ТОгда  
				ДлинаПечати = 0;
				КоличествоЭтикетокВРаппорте = 0;
				ДлинаЭтикеткиСПрипуском = Объект.ШагПечати / (Объект.ЭтикетокНаЛисте / Ручьи);
				Если  РЦЦифры.Раппорт= 0.45 Тогда
					ДлинаПечати = Окр(Цел(0.45/ДлинаЭтикеткиСПрипуском)*ДлинаЭтикеткиСПрипуском,3);
					КоличествоЭтикетокВРаппорте = Цел(0.45/ДлинаЭтикеткиСПрипуском)* Ручьи;
				ИначеЕсли  РЦЦифры.Раппорт= 0.98   Тогда
					ДлинаПечати = Окр(Цел(0.98/ДлинаЭтикеткиСПрипуском)*ДлинаЭтикеткиСПрипуском,3);
					КоличествоЭтикетокВРаппорте = Цел(0.98/ДлинаЭтикеткиСПрипуском)* Ручьи;
				КонецЕсли;

				Если Не ЗначениеЗаполнено(ДлинаГотовогоРоликаПМ) Тогда 
					ДлинаГотовогоРоликаПМ = (КоличествоЭтикетокВРолике *ДлинаПечати * Ручьи) /КоличествоЭтикетокВРаппорте;
				КонецЕсли;	
			КонецЕсли;	

			
		КонецЕсли;	

		Возврат ДлинаГотовогоРоликаПМ;
	КонецЕсли;				
КонецФункции

&НаСервере 
Процедура ЗаполнитьСвязанныеДанныеНаСервере()

	Лико_Планирование.ЗаполнитьСвязанныеДанные(Объект.Ссылка);
	Для каждого стр из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(стр.Материал) Тогда 
			стр.кодматериала = стр.материал.Код;
		КонецЕсли;
		//Если ЗначениеЗаполнено(стр.Клей) Тогда 
		//	стр.кодКлея = стр.клей.Код;
		//КонецЕсли;	
	КонецЦикла; 
	
	ЗаполнитьТипЗаливка(); 
	ЗаполнитьВидОснастка();
	//ЗаполнитьВалФорма();
	
	ОтображатьОбъемДляКлиента = УправлениеСвойствами.ЗначениеСвойства(Объект.Партнер,"Стикер_ОтображатьОбъем");
	Для каждого стр из Объект.Товары Цикл
		Если ЗначениеЗаполнено(стр.цена) И ЗначениеЗаполнено(стр.ставкаНДС) Тогда 
			ТекПроцентНДС = стр.СтавкаНДС.Ставка;
			стр.ЦенаБезНДС = стр.цена/(1+ТекПроцентНДС/100);
		КонецЕсли;	
	
		Если ЗначениеЗаполнено(ОтображатьОбъемДляКлиента) Тогда
			Если ОтображатьОбъемДляКлиента Тогда
				стр.Объем = УправлениеСвойствами.ЗначениеСвойства(стр.Номенклатура,"Стикер_Объем");
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стр.Номенклатура) Тогда
			стр.Артикул = ПолучитьАртикулИзСправочникаВерсииНоменклатуры(стр.Номенклатура,стр.ВерсияНоменклатуры);
			стр.НаименованиеДляДокументов = стр.Номенклатура.НаименованиеПолное;
		КонецЕсли;
		
		// --> Начало Лико Ефимов ЕВВ 13.05.2021
		Если ЗначениеЗаполнено(Стр.ЧестныйЗнак) Тогда
			ЗаполнитьЗначенияСвойств(Стр, Стр.ЧестныйЗнак, "Gtin,ДатаЭмиссии");
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 13.05.2021
		
		//+ Лико m.shenderov 25.07.2021
		   Если ЗначениеЗаполнено(стр.Номенклатура) Тогда
			стр.АртикулСтарый = стр.Номенклатура.Лико_АртикулСтарый;   			
		КонецЕсли; 
		//- Лико m.shenderov 25.07.2021
		
		// <-- Начало Лико Яцун С. В. 21.04.2025 
		стр.КартинкаНамотки = ПолучитьКартинкуНамотки(стр.Направление.Код);
		// <-- Конец Лико Яцун С. В. 21.04.2025
	КонецЦикла;	 
	
 	ОбработатьТаблицуПроизводство(Объект.Производство);
	
	ОбновитьИтогиВыпуска();
	
	// --> Начало Лико Ефимов ЕВВ 24.05.2024
	Если ЗначениеЗаполнено(Объект.ПовторЗаказа) Тогда
		ПовторЗаказаНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПовторЗаказа, "НомерБезПрефикса", Истина);
		Если НЕ ЗначениеЗаполнено(ПовторЗаказаНомер) Тогда 
			Если РольДоступна("Лико_ЗаказыКлиентов") Тогда
				УстановитьПривилегированныйРежим(Истина);
				Сообщить("В заказе был указан номер повтора " + Объект.ПовторЗаказа.НомерБезПрефикса + " (клиент """ + Объект.ПовторЗаказа.Партнер + """, менеджер """ + Объект.ПовторЗаказа.Менеджер + """), но у вас нет доступа к этому заказу. При записи заказа номер повтора очистится");
				Объект.ПовторЗаказа = Неопределено; 
				Модифицированность = Истина;
				УстановитьПривилегированныйРежим(Ложь);
			Иначе 
				// --> Начало Лико Ефимов ЕВВ 23.07.2025
				// Если это не менеджер, то у него очищать ПовторЗаказа не нужно
				УстановитьПривилегированныйРежим(Истина);
				ПовторЗаказаНомер = Объект.ПовторЗаказа.НомерБезПрефикса; 
				УстановитьПривилегированныйРежим(Ложь);
				// <-- Конец Лико Ефимов ЕВВ 23.07.2025
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 24.05.2024

КонецПроцедуры 

Процедура ЗаполнитьТипЗаливка() 
	
	Для каждого стр из Объект.Цвета Цикл
		Если стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Краска Тогда
			стр.ТипЗаливка = стр.Типцвета1;
		ИначеЕсли  стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Лак или стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Праймер или стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Клей или стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.БесцветнаяМасса  Тогда
			стр.ТипЗаливка = стр.ВидЗаливки;
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(стр.Материал) Тогда 
			стр.КодМатериала = стр.Материал.Код;
		КонецЕсли;

	КонецЦикла;

	
КонецПроцедуры

Процедура ЗаполнитьВидОснастка() 
	
	Для каждого стр из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(стр.Оснастка) Тогда
			стр.ВидОснастка = стр.Оснастка;
		ИначеЕсли ЗначениеЗаполнено(стр.ВидТМЦ) Тогда
			стр.ВидОснастка = стр.ВидТМЦ;
		ИначеЕсли Стр.ВидСекции.Оснастка Тогда
			стр.ВидОснастка = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;  
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьВалФорма() 
	
	Для каждого стр из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(стр.Вал) Тогда
			стр.ВалФорма = стр.Вал;
		ИначеЕсли ЗначениеЗаполнено(стр.Форма) Тогда
			стр.ВалФорма = стр.Форма;
		ИначеЕсли стр.ВидСекции.Родитель = Справочники.Лико_ВидыСекций.Глубокая ИЛИ стр.ВидСекции = Справочники.Лико_ВидыСекций.БессольвентнаяЛаминация Тогда   
			стр.ВалФорма = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		Иначе
			стр.ВалФорма = ПредопределенноеЗначение("Справочник.Лико_Формы.ПустаяСсылка");
		КонецЕсли;  
	КонецЦикла;
	
КонецПроцедуры

//Создадим номенклатуру по названию

&НаСервере 
Функция СоздатьНоменклатуруНаСервере (Текст, ТипЭтикетки)
	ТипЗаказаДляКодаТНВЭД = Объект.ТипЗаказа;
	НоваяНоменклатура = Лико_Планирование.СоздатьНоменклатуруНаСервере (Текст, ТипЭтикетки, Объект.Регион, Объект.Партнер,,,ТипЗаказаДляКодаТНВЭД);	
	Возврат НоваяНоменклатура;		
КонецФункции

&НаСервере 
Функция СоздатьНовуюФорму(ВидСекции, типцвета, типкраски, название, КодЛинкс = Неопределено)
	
	ВидПечати = ВидСекции.ВидПечати ;
	
	НоваяФормаЦвета = Справочники.Лико_Формы.СоздатьЭлемент(); 
	НоваяФормаЦвета.Контрагент = объект.Контрагент; 
	НоваяФормаЦвета.Заказ = Объект.Ссылка;
	НоваяФормаЦвета.ВидПечати = ВидПечати; 
	НоваяФормаЦвета.ВидСекции = ВидСекции;
	Если ВидПечати = Справочники.Лико_ВидыПечати.Флексо ИЛИ ВидПечати = Справочники.Лико_ВидыПечати.Трафарет ИЛИ ВидСекции = Справочники.Лико_ВидыСекций.ГлубокаяПечать Тогда
		НоваяФормаЦвета.ТипЦвета = ТипЦвета; 
		НоваяФормаЦвета.ТипКраски = ТипКраски; 
		НоваяФормаЦвета.Название = Название;
		НоваяФормаЦвета.Наименование = ?(ЗначениеЗаполнено(ТипЦвета), Строка(ТипЦвета)+ " ", "")+?(ЗначениеЗаполнено(ТипКраски), Строка(ТипКраски)+ " ", "")+ ?(ЗначениеЗаполнено(Название), Строка(Название), "");
	ИначеЕсли ВидПечати = Справочники.Лико_ВидыПечати.Цифровая Тогда 
		НоваяФормаЦвета.Наименование = Строка(ВидСекции) + " " + Объект.НомерБезПрефикса;
	КонецЕсли;	
	//Это надо переделать Площадки Иванова 20241003
	НоваяФормаЦвета.Организация = Объект.Площадка.Организация;
	
	Для каждого Эт из  Объект.Товары Цикл
		стрЭт = НоваяФормаЦвета.Этикетки.Добавить();
		стрэт.Номенклатура =  Эт.Номенклатура;
	КонецЦикла;
	
	Если КодЛинкс <> Неопределено Тогда
		НоваяФормаЦвета.КодЛинкс = КодЛинкс;
	КонецЕсли;
	
	НоваяФормаЦвета.Записать();  
	
	Возврат НоваяФормаЦвета.Ссылка	
	
КонецФункции

&НаСервере 
Функция НайтиЦифровуюФормуПоЗаказу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Формы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|ГДЕ
	|	Лико_Формы.Заказ = &Заказ
	|	И Лико_Формы.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Цифровая)";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Если ЗначениеЗаполнено(Результат.Ссылка) Тогда 
			Возврат Результат.Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Справочники.Лико_Формы.ПустаяСсылка()
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьОтгрузкиНаСервере(УчитыватьИмеющиеся = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Если УчитыватьИмеющиеся Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОрганизацийОбороты.Период КАК Дата,
		|	ТоварыОрганизацийОбороты.Регистратор КАК ДокументОтгрузки,
		|	СУММА(ТоварыОрганизацийОбороты.КоличествоРасход) КАК Количество,
		|	ЗаказКлиентаОтгрузки.Ссылка КАК Заказ,
		|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			АналитикаУчетаНоменклатуры.СкладскаяТерритория В
		|					(ВЫБРАТЬ
		|						СкладыДополнительныеРеквизиты.Ссылка КАК Ссылка
		|					ИЗ
		|						Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|					ГДЕ
		|						СкладыДополнительныеРеквизиты.Свойство.Имя = ""ЭтоСкладГППроизводства_ca46fd8cfd3e427a9bf2e96f26c71661""
		|						И СкладыДополнительныеРеквизиты.Значение = ИСТИНА)
		|				И АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры = &Заказ) КАК ТоварыОрганизацийОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Отгрузки КАК ЗаказКлиентаОтгрузки
		|		ПО ТоварыОрганизацийОбороты.Регистратор = ЗаказКлиентаОтгрузки.ДокументОтгрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО (ВЫБОР
		|				КОГДА ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ТОГДА ТоварыОрганизацийОбороты.Регистратор.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
		|							И ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация""
		|							И ПартнерыДополнительныеРеквизиты.Значение В
		|								(ВЫБРАТЬ
		|									Лико_ПредопределенныеЗначения.ЗначениеПараметра КАК ЗначениеПараметра
		|								ИЗ
		|									Справочник.Лико_ПредопределенныеЗначения КАК Лико_ПредопределенныеЗначения
		|								ГДЕ
		|									(Лико_ПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияОкил)
		|										ИЛИ Лико_ПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж)))
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	ЗаказКлиентаОтгрузки.ДокументОтгрузки ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка = &ИксПак
		|					И ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
		|			ИНАЧЕ ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ИЛИ ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|				ТОГДА ТоварыОрганизацийОбороты.Регистратор.СкладОтправитель.Родитель <> ТоварыОрганизацийОбороты.Регистратор.СкладПолучатель.Родитель
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОрганизацийОбороты.Период,
		|	ТоварыОрганизацийОбороты.Регистратор,
		|	ЗаказКлиентаОтгрузки.Ссылка,
		|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Заказ КАК Заказ,
		|	ВТ.Дата КАК Дата,
		|	ВТ.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ.Количество КАК Количество,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродаж.СуммаВыручки, 0)) КАК Стоимость
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		|		ПО ВТ.ДокументОтгрузки = ВыручкаИСебестоимостьПродаж.Регистратор
		|			И ВТ.Заказ = ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Заказ,
		|	ВТ.Дата,
		|	ВТ.ДокументОтгрузки,
		|	ВТ.Количество,
		|	ВТ.ЕдиницаИзмерения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродаж.Период,
		|	ВыручкаИСебестоимостьПродаж.Регистратор,
		|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
		|	СУММА(ВыручкаИСебестоимостьПродаж.Количество),
		|	СУММА(ВыручкаИСебестоимостьПродаж.СуммаВыручки)
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Отгрузки КАК ЗаказКлиентаОтгрузки
		|		ПО ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента = ЗаказКлиентаОтгрузки.Ссылка
		|ГДЕ
		|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента = &Заказ
		|	И ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента.Площадка = &ИксПак
		|	И ЗаказКлиентаОтгрузки.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродаж.Период,
		|	ВыручкаИСебестоимостьПродаж.Регистратор,
		|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения";	
	Иначе
		Объект.Отгрузки.Очистить();
		Объект.Нормативы.Очистить();
		Запрос.Текст =		
		
		"ВЫБРАТЬ
		|	СУММА(ТоварыОрганизацийОбороты.КоличествоРасход) КАК Количество,
		|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
		|	ТоварыОрганизацийОбороты.Регистратор КАК ДокументОтгрузки,
		|	ТоварыОрганизацийОбороты.Период КАК Дата,
		|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			АналитикаУчетаНоменклатуры.СкладскаяТерритория В
		|					(ВЫБРАТЬ
		|						СкладыДополнительныеРеквизиты.Ссылка КАК Ссылка
		|					ИЗ
		|						Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|					ГДЕ
		|						СкладыДополнительныеРеквизиты.Свойство.Имя = ""ЭтоСкладГППроизводства_ca46fd8cfd3e427a9bf2e96f26c71661""
		|						И СкладыДополнительныеРеквизиты.Значение = ИСТИНА)
		|				И АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры = &Заказ) КАК ТоварыОрганизацийОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО (ВЫБОР
		|				КОГДА ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ТОГДА ТоварыОрганизацийОбороты.Регистратор.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
		|							И ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""Лико_СобственнаяОрганизация""
		|							И ПартнерыДополнительныеРеквизиты.Значение В
		|								(ВЫБРАТЬ
		|									Лико_ПредопределенныеЗначения.ЗначениеПараметра КАК ЗначениеПараметра
		|								ИЗ
		|									Справочник.Лико_ПредопределенныеЗначения КАК Лико_ПредопределенныеЗначения
		|								ГДЕ
		|									(Лико_ПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияОкил)
		|										ИЛИ Лико_ПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж)))
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И ВЫБОР
		|			КОГДА ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры.Площадка = &ИксПак
		|					И ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА ПартнерыДополнительныеРеквизиты.Значение ЕСТЬ NULL
		|			ИНАЧЕ ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ИЛИ ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|				ТОГДА ТоварыОрганизацийОбороты.Регистратор.СкладОтправитель.Родитель <> ТоварыОрганизацийОбороты.Регистратор.СкладПолучатель.Родитель
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры,
		|	ТоварыОрганизацийОбороты.Регистратор,
		|	ТоварыОрганизацийОбороты.Период,
		|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Заказ КАК Заказ,
		|	ВТ.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ.Дата КАК Дата,
		|	ВТ.Количество КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА ВыручкаИСебестоимостьПродаж.СуммаВыручки
		|			КОГДА ВТ.ДокументОтгрузки ССЫЛКА Документ.ПеремещениеТоваров
		|				ТОГДА ВТ.Количество * ВТ.Заказ.ЦенаСредняя
		|		КОНЕЦ) КАК Стоимость
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		|		ПО ВТ.ДокументОтгрузки = ВыручкаИСебестоимостьПродаж.Регистратор
		|			И ВТ.Заказ = ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Характеристика.Лико_ЗаказНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Заказ,
		|	ВТ.ДокументОтгрузки,
		|	ВТ.Дата,
		|	ВТ.Количество,
		|	ВТ.ЕдиницаИзмерения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродаж.Регистратор,
		|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
		|	ВыручкаИСебестоимостьПродаж.Период,
		|	СУММА(ВыручкаИСебестоимостьПродаж.Количество),
		|	СУММА(ВыручкаИСебестоимостьПродаж.СуммаВыручки)
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		|ГДЕ
		|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента = &Заказ
		|	И ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента.Площадка = &ИксПак
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Лико_ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродаж.Период,
		|	ВыручкаИСебестоимостьПродаж.Регистратор,
		|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения";	
		
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Площадка);
	Запрос.УстановитьПараметр("ИксПак",Справочники.Лико_Площадки.ИксПак); 
	СписокСкладов = Новый СписокЗначений;
	СписокСкладов.Добавить(Справочники.Лико_ПредопределенныеЗначения.СкладМеталлостройГП.ЗначениеПараметра);
	Запрос.УстановитьПараметр("СписокСкладов",СписокСкладов); 

	//Предопределенные значения
	МассивЛико_Предопределенные = Лико_ТиражМетраж.ПолучитьМассивЛико_Предопределенные();
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоОтгружено = 0;
	Пока Выборка.Следующий() Цикл
		нстр = Объект.Отгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, Выборка);
		нстр.ключстроки = Новый УникальныйИдентификатор;
		
		// <-- Начало Лико Яцун С. В. 04.04.2023 
		Если Выборка.ЕдиницаИзмерения = МассивЛико_Предопределенные[0] Тогда 
			НарезкаМ = Объект.Нарезка.Размер/1000;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 04.04.2023
		
		ВсегоЗаказано = 0;
		Лико_ТиражМетраж.ПолучитьМетражПоУсловиям(МассивЛико_Предопределенные, Выборка.ЕдиницаИзмерения, ВсегоЗаказано, нстр.ПогонныйМетраж, нстр.КвадратныйМетраж, 
		НарезкаМ, Выборка.Количество, Объект);
			
		нстр.ОсновнойМатериал = Объект.ОсновнойМатериал;
		Если ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда 
			нстр.рабочийЦентр = Объект.рабочийцентр;
		КонецЕсли;
		нстр.КодПостпечатныхРабот =   Лико_Планирование.ПолучитьКодПостПечатныхработ(Объект.Ссылка);
		
		Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак  И ТипЗнч(нстр.ДокументОтгрузки) = Тип("ДокументСсылка.ОтчетДавальцу") Тогда 
		//Настройку ставим для первой строки
		    Если нстр.номерстроки = 1 Тогда 
				нстр.Настройка = 1;
			КонецЕсли;	
		
		Иначе
		    ВсегоОтгружено = ВсегоОтгружено+ нстр.Количество;

			Если (ВсегоЗаказано-ВсегоОтгружено)*100/ВсегоЗаказано<=5 Тогда 
				нстр.Настройка = 1;
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	// --> Начало Лико Митюшин МФМ 29.03.2021
	ИзмененитьДоступностиПолейНаСервере(Лико_ТиражМетраж.ПолучитьВидВырубки(Объект));
	// <-- Конец Лико Митюшин МФМ 29.03.2021
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаСервере
Функция НайтиВПФ(Наименование)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование);
	Возврат ВПФ;

КонецФункции

&НаСервере
Функция ПроверкаЗаполненияЗаказаНаСервере()
	Возврат Лико_Планирование.ПроверкаЗаполненияЗаказа(Объект.Ссылка);
КонецФункции

&НаСервере
Функция ПроверкаЗаполненияЦветовРабот()
	Цвета = Объект.Цвета.Выгрузить();
	РезультатПроверкиЦветов = Лико_Планирование.ПроверитьЗаполнениеЦветов(Цвета);

	Возврат РезультатПроверкиЦветов;
	
КонецФункции 

&НаСервере
Функция ПроверитьЗаполнениеРабот()	
	//направляем письмо, если не заполнены параметры штампа тиснения
	ПроверитьЗаполнениеПараметровШтампа();
	Цвета = Объект.Цвета.Выгрузить();
		
	ТекстОшибки = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Работы.НомерСтроки КАК НомерСтроки,
	|	Работы.ВидСекции КАК ВидРабот,
	|	Работы.Оснастка КАК Оснастка,
	|	Работы.Материал КАК Материал,
	|	Работы.РабочийЦентр КАК РабочийЦентр,
	|	Работы.Нарезка КАК Нарезка,
	|	Работы.КоличествоРучьевНумератора КАК КоличествоРучьевНумератора,
	|	Работы.ЗаказНовойОснастки КАК ЗаказНовойОснастки
	|ПОМЕСТИТЬ ВТРаботы
	|ИЗ
	|	&Работы КАК Работы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРаботы.НомерСтроки КАК НомерСтроки,
	|	ВТРаботы.ВидРабот КАК ВидРабот,
	|	ВЫБОР
	|		КОГДА ВТРаботы.ВидРабот ЕСТЬ NULL
	|			ТОГДА ""указан не корректный вид работ, ""
	|		КОГДА ВТРаботы.ВидРабот.Оснастка = ИСТИНА
	|				И ВТРаботы.Оснастка = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ""не указана оснастка, ""
	|		КОГДА ВТРаботы.ВидРабот.Материал = ИСТИНА
	|				И (ВТРаботы.Материал = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ИЛИ ВТРаботы.Материал = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|					ИЛИ ВТРаботы.Материал = НЕОПРЕДЕЛЕНО)
	|			ТОГДА ""не указан материал, ""
	|		КОГДА ВТРаботы.ВидРабот.Материал = ИСТИНА
	|				И ВТРаботы.Нарезка = ЗНАЧЕНИЕ(Справочник.ЯССМ_Нарезки.ПустаяСсылка)
	|			ТОГДА ""не указана нарека, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОписаниеОшибки,
	|	ВТРаботы.Оснастка КАК Оснастка,
	|	ВТРаботы.РабочийЦентр В
	|		(ВЫБРАТЬ
	|			РабочиеЦентры.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.РабочиеЦентры КАК РабочиеЦентры
	|		ГДЕ
	|			РабочиеЦентры.ПорядковыйНомер = 2) КАК Поле1
	|ИЗ
	|	ВТРаботы КАК ВТРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ВТРаботы.Оснастка = Лико_ПараметрыШтампа.Номенклатура";

		
	Запрос.УстановитьПараметр("Работы", Цвета);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОписаниеОшибки) Тогда 
			ТекстОшибки = ТекстОшибки+	"В строке "+ Выборка.НомерСтроки+ " "+Выборка.ОписаниеОшибки;
		Иначе
			Если ЗначениеЗаполнено(Выборка.Оснастка) Тогда
				Если Выборка.Оснастка.Лико_НеИспользовать Тогда
					ТекстОшибки = ТекстОшибки + "В строке "+ Выборка.НомерСтроки+ " указана оснастка, которая не используется!"+ Выборка.Оснастка.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	Если ТекстОШибки <> "" Тогда 
		Возврат ТекстОшибки;
	Иначе 
		Возврат Истина;
		
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеПараметровШтампа() 
	
	Цвета = Объект.Цвета.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Работы.ВидСекции КАК ВидРабот,
	|	Работы.Оснастка КАК Оснастка,
	|	Работы.Подача КАК Подача,
	|	Работы.ЭтикетокВПодаче КАК ЭтикетокВПодаче
	|ПОМЕСТИТЬ ВТРаботы
	|ИЗ
	|	&Работы КАК Работы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРаботы.Оснастка КАК Оснастка,
	|	Лико_ПараметрыШтампа.ЭтикетокВПодаче КАК ЭтикетокВПодаче,
	|	Лико_ПараметрыШтампа.Подача КАК Подача
	|ИЗ
	|	ВТРаботы КАК ВТРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ВТРаботы.Оснастка = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	ВТРаботы.ВидРабот = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское)
	|	И ВТРаботы.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Работы", Цвета);
	Выборка = Запрос.Выполнить().Выбрать();
	Текст = "";
	Пока Выборка.Следующий() Цикл
		Если Не (ЗначениеЗаполнено(Выборка.Подача) И ЗначениеЗаполнено(Выборка.ЭтикетокВПодаче)) Тогда 
			Текст = Текст+ " "+Выборка.Оснастка.Артикул;
		КонецЕсли;		
	КонецЦикла;
	Если ЗначениеЗаполнено(Текст) Тогда 
		Текст= "Не заполнены параметры штампа тиснения (подача, этикеток в подаче) для штампов: "+Текст;
		Тема = Текст;
		Адресат = Справочники.Лико_ПредопределенныеЗначения.ПользовательОтветственныйЗаОснастку.ЗначениеПараметра;
		ОтправитьПисьмо(текст, Тема, Адресат) ;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаВТабашНаСервере(Заказ, Ключстроки=  Неопределено , ПечатьПоПрокатам = Ложь, Регистратор= Неопределено,ИксПакНовая = Ложь)
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Обработка ""Выгрузка в табаш""");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ВПФ);
	ВнешняяОбработкаОбъект.Заказ = Заказ;
	Если КлючСтроки = Неопределено Тогда 
		ВнешняяОбработкаОбъект.КлючСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Иначе   
		ВнешняяОбработкаОбъект.КлючСтроки = ключСтроки;
	КонецЕсли;       
	ВнешняяОбработкаОбъект.ПечатьПоПрокатам = ПечатьПоПрокатам;
	Если ПечатьПоПрокатам Тогда 
		ВнешняяОбработкаОбъект.СписокПрокатов = СписокПрокатов;
	КонецЕсли;
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
		Если ИксПакНовая Тогда
			ТабДокумент = ВнешняяОбработкаОбъект.ПечатьИксПакНовый();
		Иначе
			ТабДокумент = ВнешняяОбработкаОбъект.ПечатьИксПак();
		КонецЕсли;
	Иначе  
		ВнешняяОбработкаОбъект.Регистратор_Отгрузка = Регистратор;
		ТабДокумент = ВнешняяОбработкаОбъект.ПечатьВыпусков("ОтгрузкиИзРегистра");
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции

&НаСервере
Функция ПолучитьНарезкуНасервере(Нарезка)
	Если ЗначениеЗаполнено(Нарезка) Тогда 
		Возврат нарезка.размер/1000 ;
	Иначе Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьКодПостПечатныхработ()
	Возврат Лико_Планирование.ПолучитьКодПостПечатныхработ(Объект.Ссылка);	
КонецФункции


&НаСервере
Процедура ОчиститьПараметрыОтВидаЗаказа(ВидЗаказа, ЗаказОбъект) // --> Начало Лико Митюшин МФМ 09.03.2021
	
	Если ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Новый Тогда
		ЗаказОбъект.УдалитьНомерПовторЗаказа = "";
		ЗаказОбъект.ПовторЗаказа = Неопределено;
	КонецЕсли;
	
	Если ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
		ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
		ЗаказОбъект.МонтажСхема.Очистить();
		ЗаказОбъект.МонтажСоответствия.Очистить();
		Для каждого стр из Объект.Цвета Цикл
			Стр.Анилокс = ПустаяНоменклатура;
			стр.ВидПолимера = Справочники.Лико_ВидыПолимеров.ПустаяСсылка();	
		КонецЦикла;
	
	КонецЕсли;
	
	Если ЗаказОбъект.Товары.Количество()>0 Тогда 
		//20200712 - пробник, пф, цифровая проба - без цены
		Если    ((ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник ИЛИ ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка) И Не ЗаказОбъект.ЗаДеньги) ИЛИ  ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ЦифроваяПроба ИЛИ ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ТестированиеМатериалов Тогда
			Для каждого стр из ЗаказОбъект.Товары Цикл
				стр.Цена = 0;
				стр.сумма = 0;
				стр.суммаСНДС = 0;
				стр.СуммаНДС = 0 ;
				Стр.ЦенаДляДокументов = 0;
			КонецЦикла;
			//ЦенаДляДокументовСредняя = 0			
		КонецЕсли;
		СуммаДокумента = ЗаказОбъект.Товары.Итог("СуммаСНДС")+ЗаказОбъект.СтоимостьОснастки;
	КонецЕсли;
	
	
		
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 09.03.2021

&НаСервере
Функция ПроверитьДоступностьНаСервере(Роль)
	Если РольДоступна(Роль) Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

//--> o.pukhova 24032020
&НаСервере
Функция ВидимостьАльтернативныхНаименований()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	ПартнерыДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ПартнерыДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ВыводитьНаПечатьАльтернативноеНаименованиеМатериала_9fa72ba86d9444b3a2c8a4ac11d226b2""
	|	И ПартнерыДополнительныеРеквизиты.Значение = Истина
	|	И ПартнерыДополнительныеРеквизиты.Ссылка = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	ВыборкаДопРеквизита = Запрос.Выполнить().Выбрать();
	Если ВыборкаДопРеквизита.Количество()  = 1 Тогда
	
		ВыборкаДопРеквизита.Следующий();
		Возврат ВыборкаДопРеквизита.Значение;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьАльтернативныеНаименования()
	
	Если ВидимостьАльтернативныхНаименований() Тогда
		
		Если ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда 
			Если ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
			    ЦеноваяГруппа = Объект.ОсновнойМатериал;
			ИначеЕсли ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") Тогда
				ЦеноваяГруппа = Объект.ОсновнойМатериал.ЦеноваяГруппа;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЦеноваяГруппа.Лико_НаименованиеДляПечати) Тогда
			
					Объект.АльтернативноеНаименованиеМатериалаДляБирки = ЦеноваяГруппа.Лико_НаименованиеДляПечати;
					Объект.АльтернативноеНаименованиеМатериалаДляСертификата = ЦеноваяГруппа.Лико_НаименованиеДляПечати;
			Иначе
				
				Объект.АльтернативноеНаименованиеМатериалаДляБирки = ЦеноваяГруппа.Наименование;
			    Объект.АльтернативноеНаименованиеМатериалаДляСертификата = ЦеноваяГруппа.Наименование;
			КонецЕсли
		Иначе
			Объект.АльтернативноеНаименованиеМатериалаДляБирки = "";
			Объект.АльтернативноеНаименованиеМатериалаДляСертификата = "";
		КонецЕсли; 
	КонецЕсли;	

КонецПроцедуры
//<-- o.pukhova 24032020

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Партнер = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда 
		Выборка.Следующий();
		Объект.Контрагент = Выборка.Ссылка;
	Иначе Сообщить("Уточните контрагента");
	КонецЕсли;
	Если Не Объект.Соглашение.Типовое Тогда
		Объект.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();		
	КонецЕсли;
	//--> o.pukhova 24032020
	//Элементы.АльтернативноеНаименованиеМатериалаДляСертификата.Видимость = ВидимостьАльтернативныхНаименований();
	//Элементы.АльтернативноеНаименованиеМатериалаДляБирки.Видимость = ВидимостьАльтернативныхНаименований();
	//<-- o.pukhova 24032020
	
	Элементы.АльтернативныйМатериал.Видимость = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.Партнер, "ПечатьДокументовСПаспортомКачестваХенкель_4e5e69eb3be24906936e75537dc40884", Ложь);
	Если ЗначениеЗаполнено(Объект.АльтернативныйМатериал) И Не Элементы.АльтернативныйМатериал.Видимость Тогда 
		Объект.АльтернативныйМатериал =  Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПараметрыПеремотки(Идентификатор, Результат);
	текстр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	Текстр.Город = Результат.Город;
	Текстр.Направление				= Результат.Направление;
	Текстр.МаксимальныйДиаметрРулона= Результат.МаксимальныйДиаметрРулона;
	Текстр.ВнутреннийДиаметр		= Результат.ВнутреннийДиаметр;
	Текстр.ПродольнаяРезка 			= Результат.ПродольнаяРезка;
	Текстр.ПоперечнаяРезка 			= Результат.ПоперечнаяРезка;
	Текстр.Кромка 					= Результат.Кромка;
	Текстр.ПодрезкаКромки 			= Результат.ПодрезкаКромки;
КонецПроцедуры	

&НаСервере
Процедура ПоказатьКартинкуНамотки(Идентификатор)
	текстр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	
	Если ЗначениеЗаполнено(текстр.Направление) Тогда
		
		Если Не текстр.Направление.ФайлКартинки.Пустая() Тогда
			//АдресКартинкиНамотки = НавигационнаяСсылкаКартинки(текстр.Направление.ФайлКартинки, УникальныйИдентификатор);
			АдресКартинкиНамотки = ПолучитьКартинкуНамотки(текстр.Направление.Код);
		Иначе
			//АдресКартинкиНамотки = "";
			АдресКартинкиНамотки = Неопределено;
		Конецесли;
		текстр.КартинкаНамотки = ПолучитьКартинкуНамотки(текстр.Направление.Код);
	Иначе		
		текстр.КартинкаНамотки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКартинкуНамотки(КодНамотки)
	
	Если КодНамотки = "394" Тогда 
		Возврат БиблиотекаКартинок.Лико_Намотка1;	
	ИначеЕсли КодНамотки = "1" Тогда
		Возврат БиблиотекаКартинок.Лико_Намотка2;	
	ИначеЕсли КодНамотки = "393" Тогда
		Возврат БиблиотекаКартинок.Лико_Намотка3;	
	ИначеЕсли КодНамотки = "395" Тогда
		Возврат БиблиотекаКартинок.Лико_Намотка4;	
	ИначеЕсли КодНамотки = "397" Тогда
		Возврат БиблиотекаКартинок.Лико_Намотка1Внутр;	
	ИначеЕсли КодНамотки = "398" Тогда
		Возврат БиблиотекаКартинок.Лико_Намотка2Внутр;	
	ИначеЕсли КодНамотки = "399" Тогда
		Возврат БиблиотекаКартинок.Лико_Намотка3Внутр;	
	ИначеЕсли КодНамотки = "400" Тогда
		Возврат БиблиотекаКартинок.Лико_Намотка4Внутр;	
	ИначеЕсли КодНамотки = "401" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаЛюбая;	
	ИначеЕсли КодНамотки = "719" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаПоПриложению;	
	ИначеЕсли КодНамотки = "703" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка1А;	
	ИначеЕсли КодНамотки = "707" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка1Б;	
	ИначеЕсли КодНамотки = "711" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка1В;	
	ИначеЕсли КодНамотки = "715" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка1Г;	
	ИначеЕсли КодНамотки = "705" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка3А;	
	ИначеЕсли КодНамотки = "709" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка3Б;	
	ИначеЕсли КодНамотки = "713" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка3В;	
	ИначеЕсли КодНамотки = "717" Тогда
		Возврат БиблиотекаКартинок.Лико_НамоткаТермоусадка3Г;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервере
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

&НаСервере
Функция ПолучитьРабочееМестоНаСервере();
	Возврат ПараметрыСеанса.Лико_РабочееМесто;
КонецФункции

&НаСервере
Функция ПолучитьОМНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	|	ЗаказКлиентаТовары.ОригиналМакет КАК ОригиналМакет,
	|	Лико_ОригиналМакетыФайлы.ИдентификаторФайла КАК ИдентификаторФайла,
	|	Лико_ОригиналМакетыФайлы.ИмяФайла КАК ИмяФайла
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ОригиналМакеты.Файлы КАК Лико_ОригиналМакетыФайлы
	|		ПО ЗаказКлиентаТовары.ОригиналМакет = Лико_ОригиналМакетыФайлы.Ссылка
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	СП = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура();
		Структура.Вставить("ОригиналМакет", Выборка.ОригиналМакет);
		Структура.Вставить("ИдентификаторФайла", Выборка.ИдентификаторФайла);
		Структура.Вставить("ИмяФайла", Выборка.ИмяФайла);

		СП.Добавить(Структура);
	КонецЦикла;	
	Возврат СП;
КонецФункции

&НаСервере	
Функция ПолучитьИмяФайла(ИмяКаталога, ИмяФайла) Экспорт

	Если Не ПустаяСтрока(ИмяФайла) Тогда
		
		Возврат ИмяКаталога + ?(Прав(ИмяКаталога, 1) = "\", "", "\") + ИмяФайла;	
		
	Иначе
		
		Возврат ИмяКаталога;
		
	КонецЕсли;

КонецФункции 

&НаСервере
Функция ЗначениеВСтрокуВнутрНаСервере(Значение)
	возврат  ЗначениеВСтрокуВнутр(Значение)
КонецФункции		

&НаСервере
Функция ОМСКартинкойНаСервере(файл)
	ВыполняемаяОбработка=НайтиВПФ("Печатная форма ""Оригинал макет""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);

	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатная форма ""Оригинал макет""");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ВПФ);
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);
	МассивТабДок = ВнешняяОбработкаОбъект.ПечатьОМ(МассивОбъектов, ,Файл);
	Если МассивТабДок.количество()>0 Тогда 
		ТабДокумент = МассивТабДок[0].ТабДок;
		Если ТабДокумент<>Неопределено Тогда
			ТабДокумент.ТолькоПросмотр = Истина;
			ТабДокумент.АвтоМасштаб=Истина;
			ТабДокумент.ЭкземпляровНаСтранице=1;
			ТабДокумент.ОтображатьЗаголовки = Ложь;
			Возврат ТабДокумент;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПоказатьИзмененияНаСервере(ПоказыватьЦвета=Ложь, ПоказыватьРаботы = Ложь)
	ВПФ=НайтиВПФ("Печатная форма ""Изменения заказа""");
	Если ВПФ.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);

	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ВПФ);
	ВнешняяОбработкаОбъект.ЗаказКлиента = Объект.Ссылка;
	ВнешняяОбработкаОбъект.ПоказыватьЦвета = ПоказыватьЦвета;
	ВнешняяОбработкаОбъект.ПоказыватьРаботы =  ПоказыватьРаботы;


	ТабличныеДокументы  = ВнешняяОбработкаОбъект.СравнитьВерсии(); 
	Возврат ТабличныеДокументы;
	
КонецФункции



&НаСервере
Функция НоменклатураЯвляетсяГП(номенклатура)
	Возврат номенклатура.ВидНоменклатуры.Лико_НоменклатураЭтикеток;
КонецФункции	


Функция ПолучитьОсновнойМатериалДоЗамены(Ссылка) 
	
	Возврат Ссылка.ОсновнойМатериал  
	
КонецФункции   

&НаСервереБезКонтекста
Функция ПолучитьЗаказНаОснастку(Заказ)  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаказОснасткиОснастка.Ссылка КАК Ссылка,
		|	Лико_ЗаказОснасткиОснастка.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
		|ГДЕ
		|	Лико_ЗаказОснасткиОснастка.Заказ = &Заказ
		|	И Лико_ЗаказОснасткиОснастка.ВнутреннийЗаказ = ИСТИНА
		|	И Не Лико_ЗаказОснасткиОснастка.Ссылка.ПометкаУдаления 
		|	И Лико_ЗаказОснасткиОснастка.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда		
		возврат РезультатЗапроса.Номер 	
	Иначе 
		возврат Неопределено
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияОбработкиПричиныЗаменыЗаказов(Результат, ДопПараметры)  Экспорт
	
	Если Результат = "ОтменаОтправки" или Результат =  неопределено Тогда
        Возврат;
	Иначе
		НомерВерсии = 0;
		для каждого стр из Объект.ПричиныЗамены цикл
			НомерВерсии = Макс(НомерВерсии, стр.НомерВерсии); 
		конеццикла; 
		
		НомерВерсии = НомерВерсии + 1;
		
		Для каждого стр из Результат Цикл
			НовСтр = Объект.ПричиныЗамены.Добавить();
			НовСтр.Дата = ТекущаяДата();
			НовСтр.Автор = ПользователиКлиентСервер.ТекущийПользователь();  
			НовСтр.НомерВерсии = НомерВерсии;  
			Если стр.Ключ = "Другое" Тогда
				НовСтр.ПричинаЗамены = ПредопределенноеЗначение("Справочник.Лико_ПричиныЗамены.другое") ;
				Новстр.Комментарий = стр.Значение;
			Иначе
				НовСтр.ПричинаЗамены = стр.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Отказ = Ложь;
		Пересчитать_ПереотправитьЗаказВРаботу(Отказ,,, Результат);
		
		Если Не Отказ Тогда 
			ЭтаФорма.Закрыть();
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПроверитьНаОдинаковыеGTin() //--> o.pukhova 14052021	
	ТекущийGTin = "";
	Для Каждого стр Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(стр.GTin) Тогда
			Если ТекущийGTin = "" Тогда
				ТекущийGTin = стр.GTin;
				Продолжить;
			КонецЕсли;	
			Если ТекущийGTin <> стр.GTin Тогда
				Возврат Ложь
			Иначе
				ТекущийGTin = стр.GTin;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции  //<-- o.pukhova 14052021

&НаСервере
Функция ПроверитьНаличиеGTin()//--> o.pukhova 14052021	

	
	Для Каждого стр Из Объект.Товары Цикл
		
		Если ЗначениеЗаполнено(стр.GTin) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции   //<-- o.pukhova 14052021


&НаСервере
Функция ПроверитьКоректностьНаправленияТермоусадки()
	
	Для каждого стр Из Объект.Товары Цикл
		Если стр.Направление.Термоусадка = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
		
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	Отказ = Истина;
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Сначала нужно записать заказ!");
		Возврат;
		//Записать();
	КонецЕсли;
	
	РассчитатьЗаказНаСервере(Объект.Ссылка, Отказ);
	
	Если Отказ Тогда 
		Сообщить("Заказ не рассчитан!")
	Иначе
		ПоказатьДоходностьРентабельность();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСписокЗначений(ИмяТЧ, КлючСтроки);
	НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки));	
	Для Каждого Строка из НайденныеСтроки Цикл	
		Объект[ИмяТЧ].Удалить(Строка);		
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступностьПовтора(НомерПовтора) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.НомерБезПрефикса = &НомерБезПрефикса";
	
	Запрос.УстановитьПараметр("НомерБезПрефикса", НомерПовтора);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат  РезультатЗапроса.Следующий()    
	
КонецФункции

&НаКлиенте
Функция ПроверкаПробникаПройдена() //Субботин 220323

	Возврат Объект.СклейкаРукаваНужна 	  или  Объект.СклейкаРукаваНеНужна
			И Объект.ОстатокРоликаХранить или  Объект.ОстатокРоликаНеХранить 
			И Объект.ПеремоткаНужна 	  или  Объект.ПеремоткаНеНужна 
			И Объект.ОтгрузкаНужна  	  или  Объект.ОтгрузкаНеНужна

КонецФункции 

&НаКлиенте
Процедура НаправитьВРаботу(Команда)
	
	Отказ = Ложь;
	ЭтоПерваяОтправкаВРаботу = Ложь;
	// <-- Начало Лико Яцун С. В. 19.05.2025 
	Если объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Шаблон") Тогда
		Сообщить("Данный вид заказа используется как шаблон для выписки других заказов");
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 19.05.2025
	// <-- Начало Лико Яцун С. В. 26.06.2025 
	РезультатПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре = ОтличаетсяGtinИКодЭтикеткиЗаказчикаВНоменклатуре();
	Если РезультатПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре.ЕстьОтличия Тогда
		Возврат;
	КонецЕсли;
	Если НЕ БылОтветНаВопросПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре Тогда
		Если ЗначениеЗаполнено(РезультатПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре.НеЗаполненоВНоменклатуре) Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросЗаписатьДанныеВНоменклатуры", ЭтаФорма);
			ПоказатьВопрос(Оповещение, РезультатПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре.НеЗаполненоВНоменклатуре,РежимДиалогаВопрос.ДаНетОтмена);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 26.06.2025 
	
	//+ Лико m.shenderov 11.03.2021
	Если Объект.Площадка = ГлЛико_Площадки.Урал Тогда
        СоздатьМонтаж(); 		
	КонецЕсли;
	//- Лико m.shenderov 11.03.2021
	
	ПЗ_ТипЗаказа_Термоусадка = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Если ЭтаФорма.Модифицированность Тогда
			Сообщить("Необходимо записать документ!");
			Возврат;
		КонецЕсли;  
		
		// --> Начало Лико Ефимов ЕВВ 14.10.2025
		//Если Объект.Площадка = ГлЛико_Площадки.Линкс
		//	И Объект.Товары.Количество() > 1
		//	И НЕ (Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Пробник")
		//		И Объект.ПеремоткаНеНужна
		//		И Объект.ОтгрузкаНеНужна)
		//	Тогда
		//	// Проверим количество так, как проверяем в обработке "Рабочее место перемотка"
		//	КоличествоРучьев = ?(ЗначениеЗаполнено(Объект.РучьиПечати), Объект.РучьиПечати, Объект.Товары.Количество());
		//	КолНаОдинРучей = Объект.Товары.Итог("Количество") / КоличествоРучьев;
		//	// Каждое из количеств этикеток должно делится на КолНаОдинРучей без остатка
		//	Для каждого ТекСтрокаТЧ из Объект.Товары Цикл
		//		Если ТекСтрокаТЧ.Количество / КолНаОдинРучей <> Цел(ТекСтрокаТЧ.Количество / КолНаОдинРучей) Тогда
		//			Сообщить("Количество в строке №" + ТекСтрокаТЧ.НомерСтроки + " не делится без остатка на количество в одном ручье");
		//			Возврат;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 14.10.2025
		ПЗ_ВидЗаказа_Пробник       						= ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Пробник");
		ПЗ_ВидЗаказа_ПеределЗаказаПереборкаПереупаковка = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка");
		ПЗ_ТипЗаказа_Полуфабрикат       				= ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Полуфабрикат");
		// --> Начало Лико Ефимов ЕВВ 01.04.2024
		Если НЕ ЗначениеЗаполнено(Объект.ДействиеСИзлишками)
			И Объект.ТипЗаказа <> ПЗ_ТипЗаказа_Полуфабрикат
			И Объект.ВидЗаказа <> ПЗ_ВидЗаказа_Пробник 
			И Объект.ВидЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ЦифроваяПроба") 
			И Объект.ВидЗаказа <> ПЗ_ВидЗаказа_ПеределЗаказаПереборкаПереупаковка 
			И Объект.ВидЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Оснастка") 
			Тогда
			Сообщениие = Новый СообщениеПользователю;
			Сообщениие.Текст = "Не заполнено поле ""Действие с излишками""";
			Сообщениие.Поле = "ДействиеСИзлишками";
			Сообщениие.ПутьКДанным = "Объект";
			Сообщениие.Сообщить();
			Возврат;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 01.04.2024
		
		// --> Начало Субботин 220323
		Если объект.ВидЗаказа = ПЗ_ВидЗаказа_Пробник 
			//+ ---> Лико m.shenderov 03.07.2023
			И Объект.ТипЗаказа <> ПЗ_ТипЗаказа_Полуфабрикат
			//- <--- Лико m.shenderov 03.07.2023  
			Тогда
			Если не ПроверкаПробникаПройдена() Тогда  
				Сообщить("Заказ не отправлен в работу. Укажите необходимость склейки, перемотки, хранения пробника"); 
				Возврат
			КонецЕсли;
		КонецЕсли;   
		
		Если Объект.ТипЗаказа = ПЗ_ТипЗаказа_Термоусадка Тогда
			ПроверкаТермоусадки();	
        КонецЕсли;
		// <-- Конец Субботин 220323
		
        // <-- Начало Лико Яцун С. В. 22.04.2025 
		//Если Объект.Площадка = ГлЛико_Площадки.Ликофлекс И Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка") И ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда
		//	НоменклатураОснМатериала = ?(ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура"),Объект.ОсновнойМатериал,Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ОсновнойМатериал,"ОсновнаяНоменклатура"));
		//	СвойстваОснМатериала = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НоменклатураОснМатериала,"Лико_СвойстваМатериала");
		//	Если НЕ ЗначениеЗаполнено(СвойстваОснМатериала) Тогда
		//		Сообщить("В заказе выбран основной материал с не заполненными доп. свойствами, обратитесь к закупщикам");
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		// <-- Конец Лико Яцун С. В. 22.04.2025
		
		Если Не ЗначениеЗаполнено(объект.Менеджер) Тогда   
			Сообщить("Менеджер не заполнен");
			Возврат	
		КонецЕсли;		
 		// <-- Конец Субботин 17.01.22
		
		// <-- Начало Лико Яцун С. В. 06.05.2025 
		Если Объект.ЧестныйЗнак И НЕ ЗначениеЗаполнено(Объект.РазмерКода) Тогда
			Сообщениие = Новый СообщениеПользователю;
			Сообщениие.Текст = "Не заполнено поле ""Размер""";
			Сообщениие.Поле = "РазмерКода";
			Сообщениие.ПутьКДанным = "Объект";
			Сообщениие.Сообщить();
			Возврат	
		КонецЕсли;
		// <-- Начало Лико Яцун С. В. 06.05.2025
			
		// --> Начало Субботин 08.09.22  
		Для каждого стр из объект.Цвета цикл
			//Если стр.ВидПечати = ПредопределенноеЗначение("Перечисление.Лико_ВидыПечати.Траф") Тогда 
			Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ТрафаретнаяПечать") Тогда

				Если не ТрафаретнаяСеткаСоответствуетРЦ(Объект.Ссылка, стр.НомерПроката, стр.ТрафаретнаяСетка) Тогда  
					Сообщить( СтрШаблон("выбранная трафаретная сетка не соответсвует доступным для текущей машины в строке %1", стр.НомерСтроки));
					Возврат;	
				КонецЕсли;  				
			КонецЕсли;
		КонецЦикла;
        // <-- Конец  Субботин 08.09.22
		
	 	Если Объект.Состояние= ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Закрыт") Тогда
			Сообщить ("Данный заказ уже выполнен!");
			Возврат;
		КонецЕсли;      
		Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Выполнен") И Не (ПроверитьДоступностьНаСервере("Лико_ИзменениеВыполненныхЗаказов") Или ПроверитьДоступностьНаСервере("ПолныеПрава")) Тогда 
        	Сообщить ("Данный заказ уже выполнен!");
			Возврат;
		КонецЕсли;     
		
		// --> Начало Лико Митюшин МФМ 02.06.2021
		ТекВидВырубки = Объект.ВидВырубки;
		ПроставитьВидВырубки(Ложь);
		Если Объект.ВидВырубки <> ТекВидВырубки Тогда
			Сообщить("Изменен Вид вырубки. Необходимо записать документ!");
			Модифицированность = Истина;
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		// <-- Конец Лико Митюшин МФМ 02.06.2021
		// --> Начало Лико Митюшин МФМ 13.09.2021
		Если Объект.ВидЗаказа = ПЗ_ВидЗаказа_ПеределЗаказаПереборкаПереупаковка Тогда
			Если Не РазрешеноМенятьПараметрыШтампа Тогда
				РазрешеноМенятьПараметрыШтампа = Истина;
			КонецЕсли;
			Модифицированность = ЗаполнитьПараметрыПоИсходномуЗаказу();
			Если Модифицированность Тогда
				Записать(Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный));
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Митюшин МФМ 13.09.2021
		// --> Начало Лико Митюшин МФМ 25.03.2021
		Если Объект.ЕдиницаИзмеренияЗаказа = ПолучитьЕИТысШтСервер() Тогда  
			Если ПроверкаЗаполненияПоВидуВырубки() Тогда 
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		Иначе
			Если Не ЗначениеЗаполнено(Объект.Нарезка) Тогда 
				Сообщить("Не заполнено поле Нарезка");
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		// <-- Конец Лико Митюшин МФМ 25.03.2021
		// --> Начало Лико Митюшин МФМ 02.06.2021
		Если ЗначениеЗаполнено(Объект.ШтампВырубной) И НЕ РазрешеноМенятьПараметрыШтампа Тогда 
			Если Не (Объект.ВидВырубки = 5 ИЛИ Объект.ВидВырубки = 6) Тогда
				Если НЕ ПроверкаПараметровВурыбкиСовпадает(Объект.ШтампВырубной, Объект.ВидВырубки) Тогда
					Сообщить("Различаются параметры вырубки в заказе и в штампере. Перевыберите вырубной штамп!");
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли
		КонецЕсли;
		// <-- Конец Лико Митюшин МФМ 02.06.2021
		// <-- Начало Лико Митюшин МФМ 29.07.2021
		СтруктураСНормативом = Новый Структура;
		Если ПроверкаПробеговШтампов(СтруктураСНормативом) Тогда 
			СоздатьЗаявкуНаОснастку(СтруктураСНормативом);
		КонецЕсли;
		// <-- Конец Лико Митюшин МФМ 29.07.2021
		Если Не Объект.ВидЗаказа = ПЗ_ВидЗаказа_ПеределЗаказаПереборкаПереупаковка Тогда 
			Если Объект.ДатаУтвержденияЦветов = '00010101' Тогда 
				Сообщить("Необходимо утвердить цвета!");
				Возврат;
			КонецЕсли;
			РезультатПроверки = ПроверкаЗаполненияЗаказаНаСервере();
			Если РезультатПроверки<>Истина Тогда 
				Сообщить(РезультатПроверки+ " "+ "Заказ не отправлен в работу!!!");
				Отказ = Истина;
				Возврат
			КонецЕсли;
		КонецЕсли;
		// --> Начало Лико Ефимов ЕВВ 20.06.2025
		Если НЕ Отказ Тогда
			ПроверитьСплошныеФормыПриОтправкеВРаботу();
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 20.06.2025
		Если Не Объект.Проведен  Тогда 
			Записать(Новый Структура("РежимЗаписи, РежимПроведения", РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный));
		КонецЕсли;		
		
		РассчитатьЗаказНаСервере(Объект.Ссылка, Отказ);
		Если Не Отказ Тогда  
			// <-- Начало Лико Яцун С. В. 26.01.2026 
			ЭтоПерваяОтправкаВРаботу = (Объект.ДатаПервойОтправкиВРаботу = '00010101');
			// <-- Конец Лико Яцун С. В. 26.01.2026
			НаправитьВРаботуНаСервере(Объект.Ссылка, Отказ); 
		Иначе 
			Сообщить("Заказ не рассчитан и не отправлен в работу");
			Возврат;
		КонецЕсли;	 
		
			
	Иначе
		Сообщить("Необходимо записать заказ!");
		Возврат;
	КонецЕсли;
	
	// <-- Начало Лико Яцун С. В. 26.01.2026 
	Если НЕ Отказ И ЭтоПерваяОтправкаВРаботу И Объект.РучнойВводНарезки И НЕ (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) И НуженРасчетНарезки(Объект.ВидЗаказа) И Объект.Нарезка <> Объект.НарезкаРасчетная Тогда
		РасчетнаяНарезкаДанные = ПолучитьРасчетнуюНарезку();
		Тема = "В заказе " + Объект.НомерБезПрефикса + " менеджера " + Объект.Менеджер + " указана нарезка " + Объект.Нарезка + ". Расчетная нарезка " + Объект.НарезкаРасчетная + ".";
		ТекстПисьма = "В заказе " + Объект.НомерБезПрефикса + " менеджера " + Объект.Менеджер + " указана нарезка " + Объект.Нарезка + ". Расчетная нарезка " + Объект.НарезкаРасчетная + "." + Символы.ПС + РасчетнаяНарезкаДанные.ТекстПараметры;
		Кому = "";
		Для каждого стр из объект.Цвета цикл
			Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка") Тогда
				Если ЗначениеРеквизита(стр.РабочийЦентр,"ВидРабочегоЦентра") = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Drent") 
					ИЛИ ЗначениеРеквизита(стр.РабочийЦентр,"ВидРабочегоЦентра") = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MO3300") Тогда
					Кому = "gkan@okil-sato.ru";
				КонецЕсли;
				ОтветственныйЗаМашину = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, стр.РабочийЦентр, "Лико_ОтветственныйЗаМашину", "");
				Если ЗначениеЗаполнено(ОтветственныйЗаМашину) Тогда
					АдресаОтветственного = ВзаимодействияВызовСервера.НаименованиеИАдресаЭлектроннойПочтыКонтакта(ОтветственныйЗаМашину).Адреса;
					Если АдресаОтветственного.Количество() > 0 Тогда
						Для каждого ЗначениеСтруктуры из АдресаОтветственного Цикл
							Кому = Кому + ?(ЗначениеЗаполнено(Кому),";", "") + ЗначениеСтруктуры.Значение;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Кому = Кому + ";aivanova@okil-sato.ru;OlegPak@okil.ru;yacun@okil-sato.ru";
		ОтправитьПисьмо(ТекстПисьма, Тема, Кому);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 26.01.2026
	
	// <-- Начало Лико Яцун С. В. 12.02.2024	
	Если НЕ Отказ И Объект.ТипЗаказа = ПЗ_ТипЗаказа_Термоусадка 
		И Объект.Площадка = ГлЛико_Площадки.Ликофлекс 
		И ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда
		МассивМатериаловОПС = Новый Массив();
		МассивМатериаловОПС.Добавить("12170");
		МассивМатериаловОПС.Добавить("14770");
		МассивМатериаловОПС.Добавить("16770");
		МассивМатериаловОПС.Добавить("14270");
		МассивМатериаловОПС.Добавить("14770");
		КодЦГОсновногоМатериала = СокрЛП(ПолучитьКодМатериалаНаСервере(Объект.ОсновнойМатериал));
		Если ЗначениеЗаполнено(КодЦГОсновногоМатериала) И МассивМатериаловОПС.Найти(КодЦГОсновногоМатериала) <> Неопределено Тогда
			ВидРЦ = ЗначениеРеквизита(Объект.РабочийЦентр,"ВидРабочегоЦентра");
			Если (ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Drent")
				ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPS")
				ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPSOfset")
				ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Omet")
				ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MO3300")
				ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Gallus")
				ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusGranitic")) Тогда
				ОтправитьПисьмо("В работу отправлен заказ " + Объект.НомерБезПрефикса + ", в котором указана машина " + Объект.РабочийЦентр + " и материал " + КодЦГОсновногоМатериала + " " + Объект.ОсновнойМатериал,
				"В работу отправлен заказ " + Объект.НомерБезПрефикса + ", в котором указана машина " + Объект.РабочийЦентр + " и материал " + КодЦГОсновногоМатериала + " " + Объект.ОсновнойМатериал,
				"OPP@okil-sato.ru;azjukov@okil-sato.ru");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 12.02.2024 
	
	// <-- Начало Лико Яцун С. В. 29.10.2024  
	Если Не Отказ Тогда
		СтрокиФормОтсутствующих = "";
		ПЗ_Лико_ВидыСекций_Глубокая = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая");
		Для каждого Стр Из Объект.Цвета Цикл
			Если ЗначениеЗаполнено(Стр.Форма) И НЕ Стр.Цветоделение И ЗначениеРеквизита(Стр.ВидСекции,"Родитель") = ПЗ_Лико_ВидыСекций_Глубокая Тогда
				ЕстьВалСТакойФормой = ЕстьВалСТакойФормой(Стр.Форма);
				Если НЕ ЕстьВалСТакойФормой Тогда
					СтрокиФормОтсутствующих = СтрокиФормОтсутствующих + Символы.ПС + "На складе отсутствует Вал с указанной Формой(" + ЗначениеРеквизита(Стр.Форма,"Код") + ")";	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если СтрокиФормОтсутствующих <> "" Тогда
			ЗаблокироватьЗаказИОтправитьПисьмо("На складе отсутствует вал с указанной формой",СтрокиФормОтсутствующих);
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 29.10.2024
	
	Если Не Отказ Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОтличаетсяGtinИКодЭтикеткиЗаказчикаВНоменклатуре()
	
	Лико_GtinВНоменклатуре = Объект.Партнер.Лико_GtinВНоменклатуре;
	Лико_КодЭтЗаказчикаВНоменклатуре = Объект.Партнер.Лико_КодЭтЗаказчикаВНоменклатуре;
	ЕстьОтличия = Ложь;
    НеЗаполненоВНоменклатуре = "";
	НеЗаполненоВНоменклатуреGtin = ""; 
	НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика = "";
	Если Лико_GtinВНоменклатуре ИЛИ Лико_КодЭтЗаказчикаВНоменклатуре Тогда
		Для каждого Стр Из Объект.Товары Цикл
			Если Лико_GtinВНоменклатуре И ЗначениеЗаполнено(СокрЛП(Стр.Gtin)) И СокрЛП(Стр.Gtin) <> СокрЛП(Стр.Номенклатура.Лико_Gtin) Тогда
				Если ЗначениеЗаполнено(СокрЛП(Стр.Номенклатура.Лико_Gtin)) Тогда
					Сообщить("Не совпадает ""Gtin"" в строке №" + Стр.НомерСтроки + " (" + СокрЛП(Стр.Gtin) + ")" + " и Номенклатуре (" + СокрЛП(Стр.Номенклатура.Лико_Gtin) + ")");	
					ЕстьОтличия = Истина; 
				Иначе
					НеЗаполненоВНоменклатуреGtin = ?(ЗначениеЗаполнено(НеЗаполненоВНоменклатуреGtin),НеЗаполненоВНоменклатуреGtin + ", " + Стр.НомерСтроки,Стр.НомерСтроки);	
				КонецЕсли;
			КонецЕсли;
			Если Лико_КодЭтЗаказчикаВНоменклатуре И ЗначениеЗаполнено(СокрЛП(Стр.КодЭтикеткиЗаказчика)) И СокрЛП(Стр.КодЭтикеткиЗаказчика) <> СокрЛП(Стр.Номенклатура.Лико_КодЭтикеткиЗаказчика) Тогда
				Если ЗначениеЗаполнено(СокрЛП(Стр.Номенклатура.Лико_КодЭтикеткиЗаказчика)) Тогда
					Сообщить("Не совпадает ""Код этикетки заказчика"" в строке №" + Стр.НомерСтроки + " (" + СокрЛП(Стр.КодЭтикеткиЗаказчика) + ")" + " и Номенклатуре (" + СокрЛП(Стр.Номенклатура.Лико_КодЭтикеткиЗаказчика) + ")");	
					ЕстьОтличия = Истина;
				Иначе
					НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика = ?(ЗначениеЗаполнено(НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика),НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика + ", " + Стр.НомерСтроки,Стр.НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьОтличия Тогда
			Возврат Новый Структура("ЕстьОтличия,НеЗаполненоВНоменклатуре",ЕстьОтличия,НеЗаполненоВНоменклатуре);;	
		Иначе
			Если Лико_GtinВНоменклатуре И Лико_КодЭтЗаказчикаВНоменклатуре И ЗначениеЗаполнено(НеЗаполненоВНоменклатуреGtin) И ЗначениеЗаполнено(НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика) Тогда
				ТекстВопроса = "Записать ""Gtin"" и ""Код этикетки заказчика"" в Номенклатуры?";	
			ИначеЕсли Лико_GtinВНоменклатуре И ЗначениеЗаполнено(НеЗаполненоВНоменклатуреGtin) Тогда
				ТекстВопроса = "Записать ""Gtin"" в Номенклатуры?";	
			ИначеЕсли ЗначениеЗаполнено(НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика) Тогда
				ТекстВопроса = "Записать ""Код этикетки заказчика"" в Номенклатуры?";	
			КонецЕсли;
			Если ЗначениеЗаполнено(НеЗаполненоВНоменклатуреGtin) ИЛИ ЗначениеЗаполнено(НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика) Тогда
				НеЗаполненоВНоменклатуре = ?(ЗначениеЗаполнено(НеЗаполненоВНоменклатуреGtin),"Не заполнен ""Gtin"" в Номенклатуре" + Символы.ПС + "в строках: " + НеЗаполненоВНоменклатуреGtin,"") + Символы.ПС 
				+ ?(ЗначениеЗаполнено(НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика),"Не заполнен ""Код этикетки заказчика"" в Номенклатуре" + Символы.ПС + "в строках: " + НеЗаполненоВНоменклатуреКодЭтикеткиЗаказчика,"")
				+ Символы.ПС + Символы.ПС;
				ЧастиСтроки = Новый Массив;
				ЧастиСтроки.Добавить(НеЗаполненоВНоменклатуре);
				ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(ТекстВопроса,Новый Шрифт(,,Истина)));
				СтрокаРезультат = Новый ФорматированнаяСтрока(ЧастиСтроки);
				Возврат Новый Структура("ЕстьОтличия,НеЗаполненоВНоменклатуре",ЕстьОтличия,СтрокаРезультат);
			Иначе
				Возврат Новый Структура("ЕстьОтличия,НеЗаполненоВНоменклатуре",ЕстьОтличия,НеЗаполненоВНоменклатуре);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Новый Структура("ЕстьОтличия,НеЗаполненоВНоменклатуре",ЕстьОтличия,НеЗаполненоВНоменклатуре);	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросЗаписатьДанныеВНоменклатуры(РезультатВопроса, ДополнительныеПараметры) Экспорт 
    
	Результат = РезультатВопроса;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьGtinИКодЭтикеткиЗаказчикаВНоменклатуре();
		БылОтветНаВопросПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре = Истина;
		НаправитьВРаботу(Неопределено);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		БылОтветНаВопросПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре = Истина;
		НаправитьВРаботу(Неопределено);
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьGtinИКодЭтикеткиЗаказчикаВНоменклатуре()
	
		Для каждого Стр Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(СокрЛП(Стр.Gtin)) И НЕ ЗначениеЗаполнено(СокрЛП(Стр.Номенклатура.Лико_Gtin)) 
				ИЛИ ЗначениеЗаполнено(СокрЛП(Стр.КодЭтикеткиЗаказчика)) И НЕ ЗначениеЗаполнено(СокрЛП(Стр.Номенклатура.Лико_КодЭтикеткиЗаказчика)) Тогда
				НоменкклатураОбъект = Стр.Номенклатура.ПолучитьОбъект();
				Если Объект.Партнер.Лико_GtinВНоменклатуре Тогда
					НоменкклатураОбъект.Лико_Gtin = СокрЛП(Стр.Gtin);
				КонецЕсли;
				Если Объект.Партнер.Лико_КодЭтЗаказчикаВНоменклатуре Тогда
					НоменкклатураОбъект.Лико_КодЭтикеткиЗаказчика = СокрЛП(Стр.КодЭтикеткиЗаказчика);
				КонецЕсли;
				НоменкклатураОбъект.ОбменДанными.Загрузка = Истина;   
				НоменкклатураОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПроверитьСплошныеФормыПриОтправкеВРаботу()
	
	НужноЗаписатьЗаказ = Ложь;
	Для каждого Стр Из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(Стр.Форма) И Лико_Дополнительно.ЭтоСтрокаСплошнойФормы(Стр) Тогда
			// Если форма не соответствует, то она очистится, значит нужно будет записать заказ
			Если НЕ Лико_Дополнительно.ПроверитьСплошнуюФормуНаСоответствиеПараметрамЗаказа(Объект, Стр) Тогда
				НужноЗаписатьЗаказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НужноЗаписатьЗаказ Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьВалСТакойФормой(ФормаВала)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВалыФормыСрезПоследних.Вал КАК Вал,
	|	Лико_ВалыФормыСрезПоследних.Форма КАК Форма,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток
	|ИЗ
	|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(, ) КАК Лико_ВалыФормыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ВалыФормыСрезПоследних.Вал = ТоварыВЯчейкахОстатки.Номенклатура
	|ГДЕ
	|	Лико_ВалыФормыСрезПоследних.Форма = &Форма";
	
	Запрос.УстановитьПараметр("Форма", ФормаВала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВНаличииОстаток > 0 Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаблокироватьЗаказИОтправитьПисьмо(ПричинаБлокировкиНаименование,ТекстПисьма)  
	
	Запись = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.Заказ = Объект.Ссылка;
	Запись.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.Заблокирован;
	Запись.Площадка = Объект.Площадка;
	Запись.НомерБланка = 1;
	Запись.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	Запись.ПричинаБлокировки = Справочники.Лико_ПричиныБлокировки.НайтиПоНаименованию(ПричинаБлокировкиНаименование);
	Текст = "";
	Тема = "Заблокирован заказ N " + Объект.НомерБезПрефикса + Символы.ПС + " Этикетки:" + Объект.Этикетки;
	ЗаказОб = Объект.Ссылка.ПолучитьОбъект();
	ЗаказОб.Заблокирован = Истина;
	ЗаказОб.Состояние = Перечисления.Лико_СостоянияЗаказов.Заблокирован;
	Попытка 
		ЭтапДоБлокировки = РегистрыСведений.Лико_ЭтапыЗаказа.ПолучитьПоследнее(,Новый Структура("Заказ",Объект.Ссылка)).Этап;
		
		ЗаказОб.Записать(РежимЗаписиДокумента.Запись);
		Запись.Записать();
		//Отправляем письмо менеджеру
		Текст = Тема + Символы.ПС + ПричинаБлокировкиНаименование + ":" + Символы.ПС + ТекстПисьма;
		Лико_Планирование.ОтправитьПисьмо(текст, Тема, Объект.Менеджер);
		
		// Нужно найти записи с пустой ДатаОбработкиЭтапа и заполнить дату
		Если ЭтапДоБлокировки = Справочники.Лико_ЭтапыВыполненияЗаказа.ОПП ИЛИ ЭтапДоБлокировки = Справочники.Лико_ЭтапыВыполненияЗаказа.КонтрольОТК Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Лико_ЭтапыЗаказа.Период КАК Период,
			|	Лико_ЭтапыЗаказа.Заказ КАК Заказ,
			|	Лико_ЭтапыЗаказа.Площадка КАК Площадка
			|ИЗ
			|	РегистрСведений.Лико_ЭтапыЗаказа КАК Лико_ЭтапыЗаказа
			|ГДЕ
			|	Лико_ЭтапыЗаказа.Заказ = &Заказ
			|	И Лико_ЭтапыЗаказа.Этап = &Этап
			|	И Лико_ЭтапыЗаказа.Период >= &ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа
			|	И Лико_ЭтапыЗаказа.ДатаОбработкиЭтапа = ДАТАВРЕМЯ(1, 1, 1)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
			
			Запрос.УстановитьПараметр("ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа", Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыЭтаповЗаказа.ЗначениеПараметра);
			Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
			Запрос.УстановитьПараметр("Этап", ЭтапДоБлокировки);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.ДатаОбработкиЭтапа = ТекущаяДата();
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	Исключение
		Сообщить(ПричинаБлокировкиНаименование = ". Заблокировать заказ не удалось");
	КонецПопытки;
			
КонецПроцедуры

&НаСервере
Процедура ПроверкаТермоусадки() 
		
	МассивПричин = новый массив;
	
	Причина1 = " с белилами 3361 с грамматурой вала больше 10 ";   
	Причина2 = " с белилами 3411 с грамматурой вала больше 10 ";
	Причина3 = " с несколькими белилами 3361 ";	
    Причина4 = " с несколькими белилами грамматурой больше 15 ";
	
	Массив3361 = Объект.Цвета.НайтиСтроки(Новый Структура("ТипКраски", Справочники.ЦеновыеГруппы.НайтиПоКоду("3361")));
    Массив3411 = Объект.Цвета.НайтиСтроки(Новый Структура("ТипКраски", Справочники.ЦеновыеГруппы.НайтиПоКоду("3411")));
	
	//«с белилами с грамматурой вала больше 10» 
	Триггер = Ложь;
	Для каждого стр из Массив3361 Цикл	
		Если  стр.Грамматура > 10 Тогда 
			Триггер = Истина;	
		КонецЕсли; 
	КонецЦикла;	
	Если Триггер Тогда  
		МассивПричин.Добавить(Причина1);
	КонецЕсли;

	Триггер = Ложь;	
	Для каждого стр из Массив3411 Цикл
		Если  стр.Грамматура > 10 Тогда 
			Триггер = Истина;		
		КонецЕсли; 	
	КонецЦикла;
	Если Триггер Тогда  
		МассивПричин.Добавить(Причина2);
	КонецЕсли;
	
	//«с несколькими белилами 3361» 
	Если Массив3361.Количество() > 1  Тогда 
		МассивПричин.Добавить(Причина3);
	КонецЕсли;  
		
	
	//«с несколькими белилами грамматурой больше 15» 
	Если Массив3411.Количество() > 1  Тогда 
		СуммаГрамматура = 0;
		Для каждого стр из Массив3411 Цикл 
			СуммаГрамматура = СуммаГрамматура + стр.Грамматура;	 
		КонецЦикла;
		Если СуммаГрамматура > 15 Тогда
			МассивПричин.Добавить(Причина4);
		КонецЕсли;
	КонецЕсли;
	
	Если МассивПричин.Количество() > 0 Тогда
		ОтправитьПисьмо(СтрШаблон("Выписан заказ на термоусадку %1, %2", объект.НомерБезПрефикса, СтрСоединить(МассивПричин, Символы.ПС))
		,СтрШаблон("Выписан заказ на термоусадку %1 ", объект.НомерБезПрефикса)
		,"azjukov@okil-sato.ru"); 
	КонецЕсли;

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТрафаретнаяСеткаСоответствуетРЦ(Заказ,НомерПроката, ТрафСетка)
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЦвета.РабочийЦентр.ВидРабочегоЦентра КАК РабочийЦентрВидРабочегоЦентра
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Ссылка
		|	И ЗаказКлиентаЦвета.НомерПроката = &НомерПроката
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.РабочийЦентрВидРабочегоЦентра КАК РабочийЦентрВидРабочегоЦентра
		|ИЗ
		|	Справочник.Лико_ТрафаретныеСетки.ВидыРабочихЦентров КАК Лико_ТрафаретныеСеткиВидыРабочихЦентров,
		|	ВТ КАК ВТ
		|ГДЕ
		|	Лико_ТрафаретныеСеткиВидыРабочихЦентров.Ссылка = &ТрафСетка
		|	И ВТ.РабочийЦентрВидРабочегоЦентра В (Лико_ТрафаретныеСеткиВидыРабочихЦентров.ВидРабочегоЦентра)";
	
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	Запрос.УстановитьПараметр("ТрафСетка", ТрафСетка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Истина
	 Иначе
		 Возврат Ложь
	КонецЕсли;

	
	
	
	
КонецФункции


&НаСервере
Процедура СоздатьЗаявкуНаОснастку(СтруктураСНормативом)// <-- Начало Лико Митюшин МФМ 29.07.2021

	Лико_Планирование.СозданиеЗаказовОснасткиПоЗаказуКлиента(Объект.Ссылка, СтруктураСНормативом);
	
КонецПроцедуры		// <-- Конец Лико Митюшин МФМ 29.07.2021

&НаСервере
Функция ПроверкаПараметровВурыбкиСовпадает(ВырубнойШтамп, ВидВырубки)
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.ШагПечати КАК ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи КАК Ручьи,
	|	Лико_ПараметрыШтампа.Z КАК Z
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", ВырубнойШтамп);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ВидВырубки = 1 ИЛИ ВидВырубки = 7 ИЛИ ВидВырубки = 13 Тогда
			Если Объект.Z <> Выборка.Z Тогда
				Возврат Ложь;
			КонецЕсли;
		ИначеЕсли НЕ (ВидВырубки = 1 ИЛИ ВидВырубки = 5 ИЛИ ВидВырубки = 6 ИЛИ ВидВырубки = 7 ИЛИ ВидВырубки = 13) Тогда
			Если Объект.ШагПечати <> Выборка.ШагПечати Тогда
				Если (ВидВырубки = 3 ИЛИ ВидВырубки = 8 ИЛИ ВидВырубки = 11 ИЛИ ВидВырубки = 12) И Объект.Ручьи = Объект.ЭтикетокНаЛисте Тогда 

				Иначе
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Объект.Ручьи <> Выборка.Ручьи Тогда 
			Возврат Ложь;
		КонецЕсли;
		Если НЕ(ВидВырубки = 4 ИЛИ ВидВырубки = 6 ИЛИ ВидВырубки = 10) Тогда
			текРазница = Объект.ЭтМЭР - Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, ВидВырубки);
			Если Макс(текРазница, -текРазница) > 0.0001 Тогда
				Если (ВидВырубки = 3 ИЛИ ВидВырубки = 8 ИЛИ ВидВырубки = 11 ИЛИ ВидВырубки = 12) И Объект.Ручьи = Объект.ЭтикетокНаЛисте Тогда 

				Иначе
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

//+ Лико m.shenderov 11.03.2021
&НаСервере
Функция ПолучитьОрганизациюАвантажСервер() //+Лико m.shenderov 11.03.2021  
	Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияАвантаж.ЗначениеПараметра;
КонецФункции  //-Лико m.shenderov 11.03.2021   



//- Лико m.shenderov 11.03.2021

&НаСервере
Функция ПолучитьЕИТысШтСервер() // --> Начало Лико Митюшин МФМ  31.03.2021  
	Возврат Справочники.Лико_ПредопределенныеЗначения.ЕИТысШт.ЗначениеПараметра;
КонецФункции  // <-- Конец Лико Митюшин МФМ  31.03.2021

&НаСервере
Функция ПроверкаЗаполненияПоВидуВырубки()		// --> Начало Лико Митюшин МФМ 25.03.2021
	
		ВидВырубки = ПолучитьВидВырубкиНаСервере();
	
	Если ВидВырубки = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЦветАвто 	= Новый Цвет();
	Коричневый = WebЦвета.Золотистый;
	
	текОшибка = Ложь;
	Для Каждого элМассива Из МассивПараметровШтампа() Цикл
		Если элМассива = Элементы.ШтампВырубнойАртикул ИЛИ элМассива = Элементы.ФормаШтампа ИЛИ элМассива = Элементы.Раппорт ИЛИ элМассива = Элементы.ВариантыДопусков ИЛИ элМассива = Элементы.ДопускМинус ИЛИ элМассива = Элементы.ДопускПлюс Тогда 
			Продолжить;
		КонецЕсли; 
		
		
		Если элМассива.ЦветФона <> ЦветАвто Тогда
			Если Не ЗначениеЗаполнено(Объект[СтрЗаменить(элМассива.ПутьКДанным, "Объект.", "")]) Тогда
				Если элМассива = Элементы.Z Тогда
					Если элМассива.ЦветФона = Коричневый ИЛИ ВидВырубки = 7 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				текОшибка = Истина;
				Сообщить("Не заполнено поле " + элМассива.Заголовок);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат текОшибка;

КонецФункции		// <-- Конец Лико Митюшин МФМ 25.03.2021

&НаСервере
Функция ПолучитьВидВырубкиНаСервере()		// --> Начало Лико Митюшин МФМ 25.03.2021
	
	Возврат Лико_ТиражМетраж.ПолучитьВидВырубки(Объект);
	
КонецФункции		// <-- Конец Лико Митюшин МФМ 25.03.2021

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда 
		ПартнерПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	ПараметрыВыбораСоглашения.ДатаДокумента               = Объект.Дата;
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);

КонецПроцедуры


#Область ОбработчикиСобытийТЧТовары 

//Товары
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	
	УстановитьЦенуБезНДС(ТекущаяСтрока.ПолучитьИдентификатор());

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПоказатьДоходностьРентабельность();
	
	//СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаБезНДСПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	УстановитьЦенуСНДС(ТекущаяСтрока.ПолучитьИдентификатор());
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПоказатьДоходностьРентабельность();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);	
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ПересчитатьКоличествоВесНаСервере(ТекущаяСтрока.ПолучитьИдентификатор(),Элемент.Имя);
	
	РасчитатьТиражМетраж();

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПоказатьДоходностьРентабельность();
	//СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;	
	Если СтавкаНДСТекущейСтроки<> ТекущаяСтрока.СтавкаНДС Тогда 
		ПроцентНДС = ЗначениеРеквизита(СтавкаНДСТекущейСтроки, "Ставка");
		ТекПроцентНДС = ЗначениеРеквизита(ТекущаяСтрока.СтавкаНДС, "Ставка");
		ТекущаяСтрока.ЦенаБезНДС = ТекущаяСтрока.цена/(1+ПроцентНДС/100);
		ТекущаяСтрока.Цена = 	ТекущаяСтрока.ЦенаБезНДС*(1+ТекПроцентНДС/100);
	КонецЕсли;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПоказатьДоходностьРентабельность();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект, 
	Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	УстановитьЦенуБезНДС(ТекущаяСтрока.ПолучитьИдентификатор());
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	//СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	ПоказатьДоходностьРентабельность();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекущаяСтрока.КодСтроки = 0;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(текущаяСтрока.ВариантОбеспечения) Тогда 
		текущаяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РасчитатьТиражМетраж();
	ПоказатьДоходностьРентабельность();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	РасчитатьТиражМетраж();
	ПоказатьДоходностьРентабельность();
КонецПроцедуры

#КонецОбласти

//Основной материал
&НаКлиенте
Процедура ОсновнойМатериалПриИзменении(Элемент)
	ПоказатьКодМатериала();
	//--> o.pukhova 24032020
	//ЗаполнитьАльтернативныеНаименования();
	//<-- o.pukhova 24032020
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак И Объект.ОсновнойМатериалКонтактныйСлой И ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда
		ЗаполненВидКонтакта = ПроверитьЗаполнениеВидаКонтактаВОсновномМатериале(Объект.ОсновнойМатериал);
		Если Не ЗаполненВидКонтакта Тогда
			Объект.ОсновнойМатериалКонтактныйСлой = Ложь;
		КонецЕсли;
	КонецЕсли;
	Для каждого стр Из Объект.Товары Цикл
		
		стр.ДиаметрРоликаФакт = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидКонтактаМатериала(Материал)
	
	Если ТипЗнч(Материал) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидКонтакта = Материал.Лико_ВидКонтактаСПищевойПродукцией
	Иначе
		ВидКонтакта = Материал.ОсновнаяНоменклатура.Лико_ВидКонтактаСПищевойПродукцией;
	КонецЕсли;
	
	Возврат ВидКонтакта;
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеВидаКонтактаВОсновномМатериале(Материал)
	Прямой = Справочники.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт;
	//НеПрямой = Справочники.Лико_ВидыКонтактовСПищевойПродукцией.НепрямойКонтакт;
	ВидКонтакта = ПолучитьВидКонтактаМатериала(Материал);
	Если Объект.ВидКонтактаСПищевойПродукцией = Прямой И ВидКонтакта <> Прямой Тогда
		Сообщить("Данный материал не может быть контактным слоем");
		Возврат Ложь;
	//ИначеЕсли Объект.ВидКонтактаСПищевойПродукцией = НеПрямой И ВидКонтакта <> Прямой И ВидКонтакта <> НеПрямой Тогда
	//	Сообщить("Данный материал не может быть контактным слоем");
	//	Возврат Ложь;
	КонецЕсли;	
	Возврат Истина
КонецФункции
	
//Виды работ
&НаКлиенте
Процедура Утвердить(Команда)
	//Если Не ЗначениеЗаполнено(Объект.ДатаОтправкиВРаботу) Тогда 
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Сообщить("Необходимо записать заказ!");
		Возврат;
	КонецЕсли;	
	
	// <-- Начало Лико Яцун С. В. 05.10.2023 
	РезультатПроверкиЦветов = ПроверкаЗаполненияЦветовКлиент();
	Если РезультатПроверкиЦветов <> Истина Тогда 
		Сообщить(РезультатПроверкиЦветов);
		Отказ = Истина;
		Возврат
	КонецЕсли;   
	
	РезультатПроверки = ПроверкаЗаполненияЦветовРабот();
	Если РезультатПроверки<>Истина Тогда 
		Сообщить(РезультатПроверки+ " "+ Команда.имя+" не утверждены!!!");
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	РезультатПроверкиРабот = ПроверитьЗаполнениеРабот();
	Если РезультатПроверкиРабот<>Истина Тогда 
		Сообщить(РезультатПроверкиРабот+ " "+ Команда.имя+" не утверждены!!!");
		Отказ = Истина;
		Возврат
	КонецЕсли;

	// <-- Начало Лико Яцун С. В. 27.02.2024
	НуженРасчетНарезки = НуженРасчетНарезки(Объект.ВидЗаказа);
	Если (Объект.РучнойВводНарезки И НуженРасчетНарезки) ИЛИ НЕ НуженРасчетНарезки Тогда
		Если Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка") И Объект.ШиринаЭтикетки > ПолучитьРазмерНарезки() 
			И (Объект.Площадка <> ГлЛико_Площадки.Урал) Тогда
			Сообщить("Нарезка не должна быть меньше Ширины этикетки для данного типа заказа. " + Команда.имя+" не утверждены!!!");
			Отказ = Истина;
			Возврат;
		ИначеЕсли Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка") И Объект.ДлинаЭтикетки > ПолучитьРазмерНарезки() 
			И (Объект.Площадка <> ГлЛико_Площадки.Урал) Тогда
			Сообщить("Нарезка не должна быть меньше Высоты этикетки для данного типа заказа. " + Команда.имя+" не утверждены!!!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 27.02.2024

	// <-- Начало Лико Яцун С. В. 01.12.2023   
	ВРежимеРедактированияПараметров = Ложь;
	Если Объект.ВидВырубки = 0 Тогда
		ВРежимеРедактированияПараметров = Истина;	
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 01.12.2023
		
	ПроставитьВидВырубки(Истина);
	// <-- Конец Лико Яцун С. В. 05.10.2023
	
		
	// --> Начало лк Субботин 20.01.22
	РезультатПроверкиРабот = ПроверкаЗаполненияРаботКлиент();
	Если РезультатПроверкиРабот <> Истина Тогда 
		Сообщить(РезультатПроверкиРабот);
		Отказ = Истина;
		Возврат
	КонецЕсли;
	// <-- Конец лк Субботин 20.01.22
	
	// --> Начало Лико Яцун 21.12.2022 
	ВЗаказеУказанВырубнойШтамп = Ложь;
	ВидРЦ = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.РабочийЦентр,"ВидРабочегоЦентра");
	Для Каждого Стр Из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(Стр.Оснастка) И (Объект.Площадка = ГлЛико_Площадки.Ликофлекс ИЛИ Объект.Площадка = ГлЛико_Площадки.Линкс) Тогда
			Если ПолучитьВидШтампа(Стр.Оснастка) = ПредопределенноеЗначение("Справочник.Лико_ВидШтампа.Вырубной") 
				И Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Стр.РабочийЦентр,"ВидРабочегоЦентра") <> ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Schober") Тогда
				Штамп = Стр.Оснастка;
				ВЗаказеУказанВырубнойШтамп = Истина;
				ШагПоНарезке = ПолучитьШагПоНарезкеШтампа(Штамп);
				Если ШагПоНарезке = 0 Тогда
					ВЗаказеУказанВырубнойШтамп = Ложь;
					Если Объект.Площадка = ГлЛико_Площадки.Ликофлекс Тогда
						АдресатыРассылки = "VMakarenko@okil-sato.ru"; 
					ИначеЕсли Объект.Площадка = ГлЛико_Площадки.Линкс Тогда
						АдресатыРассылки = "AShigarev@okil-sato.ru"; 
					КонецЕсли;
					ТекстПисьма = "Не заполнен шаг по нарезке у штампа: " + Строка(Стр.Оснастка) + " " + Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Стр.Оснастка,"Артикул");
					ОтправитьПисьмо(ТекстПисьма, ТекстПисьма, АдресатыРассылки);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	// <-- Начало Лико Яцун С. В. 26.01.2026 
	Если НЕ Объект.РучнойВводНарезки И НуженРасчетНарезки(Объект.ВидЗаказа) Тогда
		РасчетнаяНарезкаДанные = ПолучитьРасчетнуюНарезку();
		Объект.НарезкаРасчетная = РасчетнаяНарезкаДанные.РасчетнаяНарезкаСсылка;
		Объект.Нарезка = Объект.НарезкаРасчетная;
		РасчитатьТиражМетраж();
		ПоказатьДоходностьРентабельность();
		Для каждого стр из Объект.Отгрузки Цикл
			стр.КвадратныйМетраж = стр.ПогонныйМетраж* ПолучитьНарезкуНасервере(Объект.Нарезка);
		КонецЦикла;
	ИначеЕсли Объект.РучнойВводНарезки И НуженРасчетНарезки(Объект.ВидЗаказа) Тогда
		РасчетнаяНарезкаДанные = ПолучитьРасчетнуюНарезку();
		Объект.НарезкаРасчетная = РасчетнаяНарезкаДанные.РасчетнаяНарезкаСсылка;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 26.01.2026
	
	// <-- Начало Лико Яцун С. В. 25.01.2026 //расчетная нарезка заполняется теперь по умолчанию, если менеджер не укажет вручную с признаком РучнойВводНарезки
	//Если Объект.Площадка = ГлЛико_Площадки.Ликофлекс 
	//	И ВЗаказеУказанВырубнойШтамп И Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка") Тогда
	//	
	//	//ШагПоНарезке = ПолучитьШагПоНарезкеШтампа(Штамп);
	//	
	//	Если Объект.Цифровой Тогда
	//		Ручьи = Объект.РучьиПечатиИндиго;
	//	Иначе
	//		Ручьи = Объект.РучьиПечати;
	//	КонецЕсли;	
	//	
	//	ШиринаПоНожам = ?(Ручьи = 1, Объект.ДлинаЭтикетки, ШагПоНарезке * (Ручьи - 1) + Объект.ДлинаЭтикетки);
	//	
	//	РасчетнаяНарезка = ШиринаПоНожам + 15; //Стандарт
	//	СтрНарезка = "Шаг по нарезке: " + ШагПоНарезке + ", Высота эт.: " + Объект.ДлинаЭтикетки + ", Ручьи: " + Ручьи;
	//	
	//	РасчетныеНарезки = Новый Массив;
	//	
	//	РасчетныеНарезки.Добавить(РасчетнаяНарезка); 
	//	//Расчет нарезки по условиям
	//	Для Каждого СтрВР Из Объект.Цвета Цикл
	//		//Если есть Плоское тиснение – Горячее Плоское поперечное, Горячее Плоское продольное, Горячее тиснение в Регистр Плоское
	//		Если СтрВР.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское") 
	//			ИЛИ СтрВР.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеВРегистрПлоское") Тогда
	//			РасчетнаяНарезка = ШиринаПоНожам + 15 + 5;
	//			СтрНарезка = СтрНарезка + Символы.ПС + " Плоское тиснение";
	//			РасчетныеНарезки.Добавить(РасчетнаяНарезка); 
	//		КонецЕсли;
	//		//Если есть Нумератор
	//		Если СтрВР.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда
	//			РасчетнаяНарезка = ШиринаПоНожам + 15 + 5;
	//			СтрНарезка = СтрНарезка + Символы.ПС + " Нумератор";
	//			РасчетныеНарезки.Добавить(РасчетнаяНарезка); 
	//		КонецЕсли;
	//		//Если есть Конгрев и оснастка наименование <> "Штамп для ротационного конгрева" и если осн. материал (Икс-фойл или Буфойл)
	//		Если СтрВР.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Конгрев") И Строка(СтрВР.Оснастка) <> "Штамп для ротационного конгрева" Тогда
	//			Если Найти(НРег(Строка(Объект.ОсновнойМатериал)),"икс-фойл") > 0 ИЛИ Найти(НРег(Строка(Объект.ОсновнойМатериал)),"буфойл") > 0 Тогда
	//				РасчетнаяНарезка = ШиринаПоНожам + 15 + 15;
	//				СтрНарезка = "Основной материал: " + Объект.ОсновнойМатериал + Символы.ПС + СтрНарезка+ Символы.ПС + " Конгрев";
	//				РасчетныеНарезки.Добавить(РасчетнаяНарезка); 
	//			Иначе	
	//				РасчетнаяНарезка = ШиринаПоНожам + 15 + 5;
	//				СтрНарезка = СтрНарезка + Символы.ПС + " Конгрев";
	//				РасчетныеНарезки.Добавить(РасчетнаяНарезка);
	//			КонецЕсли;
	//		КонецЕсли;
	//		//Если 2 прокат цифра, а 1 - основной цех 
	//		Если СтрВР.НомерПроката > 1
	//			И (Лико_Дополнительно.ЗначениеРеквизитаОбъекта(СтрВР.РабочийЦентр,"ВидРабочегоЦентра") = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") 
	//			ИЛИ Лико_Дополнительно.ЗначениеРеквизитаОбъекта(СтрВР.РабочийЦентр,"ВидРабочегоЦентра") = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Omega"))
	//			И (ВидРЦ <> ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") 
	//			И ВидРЦ <> ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Omega"))
	//			И Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.РабочийЦентр,"Лико_ОсновнаяМашина") = Истина Тогда
	//			РасчетнаяНарезка = ?(Ручьи = 1, Объект.ДлинаЭтикетки, ШагПоНарезке * (Ручьи - 1) + Объект.ДлинаЭтикетки) + 15 + 5;
	//			СтрНарезка = СтрНарезка + Символы.ПС + " Цифра после основной машины";
	//			РасчетныеНарезки.Добавить(РасчетнаяНарезка); 
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Для Каждого Н Из РасчетныеНарезки Цикл
	//		Если Н > РасчетнаяНарезка Тогда
	//			РасчетнаяНарезка = Н;	
	//		КонецЕсли;					
	//	КонецЦикла;
	//	
	//	РасчетнаяНарезкаБезОкругления = РасчетнаяНарезка;
	//	РасчетнаяНарезка = ЗарплатаКадрыКлиентСервер.Округлить(Цел(РасчетнаяНарезка), 5,ПредопределенноеЗначение("Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону"));
	//	Если (РасчетнаяНарезкаБезОкругления - ПолучитьРазмерНарезки()) >= 2 И РасчетнаяНарезка < Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ВидРЦ,"лкМаксимальнаяНарезка") 
	//		И (ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Gallus")
	//		ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusGranitic")
	//		ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet")
	//		ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPS")
	//		ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPSOfset")
	//		ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Drent")
	//		ИЛИ ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MO3300")) Тогда
	//		Если ДлинаКонтрКолье(Штамп).ДлинаКонтрЭтикетки <> 0 ИЛИ ДлинаКонтрКолье(Штамп).ДлинаКольеретки <> 0 Тогда
	//			ЗначениеДлинаКонтрКолье = ?(ДлинаКонтрКолье(Штамп).ДлинаКонтрЭтикетки = 0, ДлинаКонтрКолье(Штамп).ДлинаКольеретки, ДлинаКонтрКолье(Штамп).ДлинаКонтрЭтикетки);
	//			Если Объект.ДлинаЭтикетки = ЗначениеДлинаКонтрКолье Тогда
	//				ПоказатьВопрос(
	//				Новый ОписаниеОповещения("ПослеОтветаНаВопросОНарезке", ЭтотОбъект,Новый Структура("РасчетнаяНарезка,ТекстПараметры,ВидРЦ,Ручьи,ШагПоНарезке,Штамп",РасчетнаяНарезка,СтрНарезка,ВидРЦ,Ручьи,ШагПоНарезке,Штамп)), 
	//				"Указанная нарезка меньше, чем расчетная " + РасчетнаяНарезка + ". Заменить нарезку на расчетную?",
	//				РежимДиалогаВопрос.ДаНетОтмена);
	//				Возврат;
	//			КонецЕсли;
	//		Иначе
	//			ПоказатьВопрос(
	//			Новый ОписаниеОповещения("ПослеОтветаНаВопросОНарезке", ЭтотОбъект,Новый Структура("РасчетнаяНарезка,ТекстПараметры,ВидРЦ,Ручьи,ШагПоНарезке,Штамп",РасчетнаяНарезка,СтрНарезка,ВидРЦ,Ручьи,ШагПоНарезке,Штамп)), 
	//			"Указанная нарезка меньше, чем расчетная " + РасчетнаяНарезка + ". Заменить нарезку на расчетную?",
	//			РежимДиалогаВопрос.ДаНетОтмена);
	//			Возврат;
	//		КонецЕсли;
	//	КонецЕсли;        
	//	
	//	Если Объект.Площадка = ГлЛико_Площадки.Ликофлекс 
	//		И Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Полуфабрикат")
	//		И Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка") 
	//		И ПолучитьРазмерНарезки() - РасчетнаяНарезка >= ШагПоНарезке
	//		И Ручьи <> Объект.Ручьи Тогда
	//		Если ДлинаКонтрКолье(Штамп).ДлинаКонтрЭтикетки <> 0 ИЛИ ДлинаКонтрКолье(Штамп).ДлинаКольеретки <> 0 Тогда
	//			ЗначениеДлинаКонтрКолье = ?(ДлинаКонтрКолье(Штамп).ДлинаКонтрЭтикетки = 0, ДлинаКонтрКолье(Штамп).ДлинаКольеретки, ДлинаКонтрКолье(Штамп).ДлинаКонтрЭтикетки);
	//			Если Объект.ДлинаЭтикетки = ЗначениеДлинаКонтрКолье Тогда
	//				ПоказатьВопрос(
	//				Новый ОписаниеОповещения("ПослеОтветаНаВопросОНарезкеИРучьяхПечати", ЭтотОбъект,Новый Структура("РасчетнаяНарезка,Ручьи,ШагПоНарезке,ВидРЦ",РасчетнаяНарезка,Ручьи,ШагПоНарезке,ВидРЦ)), 
	//				"Некорректно указана нарезка или количество ручьев печати. Заменить нарезку на расчетную " + РасчетнаяНарезка + " мм?",
	//				РежимДиалогаВопрос.ДаНетОтмена);
	//				//Сообщить("Не корректно указана нарезка или количество ручьев печати");	
	//				Возврат;
	//			КонецЕсли;
	//		Иначе
	//			ПоказатьВопрос(
	//			Новый ОписаниеОповещения("ПослеОтветаНаВопросОНарезкеИРучьяхПечати", ЭтотОбъект,Новый Структура("РасчетнаяНарезка,Ручьи,ШагПоНарезке,ВидРЦ",РасчетнаяНарезка,Ручьи,ШагПоНарезке,ВидРЦ)), 
	//			"Некорректно указана нарезка или количество ручьев печати. Заменить нарезку на расчетную " + РасчетнаяНарезка + " мм?",
	//			РежимДиалогаВопрос.ДаНетОтмена);
	//			//Сообщить("Не корректно указана нарезка или количество ручьев печати");	
	//			Возврат;	
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	// <-- Конец Лико Яцун 21.12.2022 
	
	// <-- Начало Лико Яцун С. В. 01.11.2023 
	Если ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.Площадка = ГлЛико_Площадки.Ликофлекс Тогда 
		ШтампМатериал = ВРег(Сред(ЗначениеРеквизита(Объект.ШтампВырубной,"Артикул"),8,1));
		Если ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЦГОсновногоМатериала = ЗначениеРеквизита(Объект.ОсновнойМатериал,"ЦеноваяГруппа");
		Иначе
			ЦГОсновногоМатериала = Объект.ОсновнойМатериал;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЦГОсновногоМатериала) Тогда
			Если ШтампМатериал = "П" И НЕ ЭлементПринадлежитИерархии(ЦГОсновногоМатериала,ПредопределенноеЗначение("Справочник.ЦеновыеГруппы.Пленки")) И Найти(ВРег(Объект.ОсновнойМатериал),"BUMELEN") = 0 Тогда 
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОШтампеМатериале", ЭтотОбъект), 
				"Указан штамп с буквой " + ШтампМатериал + ", не соответствующий материалу " + Объект.ОсновнойМатериал + ", отменить утверждение?",
				РежимДиалогаВопрос.ДаНет);
				Возврат;
			ИначеЕсли ШтампМатериал = "Б" И НЕ ЭлементПринадлежитИерархии(ЦГОсновногоМатериала,ПредопределенноеЗначение("Справочник.ЦеновыеГруппы.Бумага")) Тогда
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОШтампеМатериале", ЭтотОбъект), 
				"Указан штамп с буквой " + ШтампМатериал + ", не соответствующий материалу " + Объект.ОсновнойМатериал + ", отменить утверждение?",
				РежимДиалогаВопрос.ДаНет);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 01.11.2023
	
	// <-- Начало Лико Яцун С. В. 29.12.2023
	Если (Объект.Ручьи > 0 И Объект.РучьиПечати > 0 И Объект.Ручьи <> Объект.РучьиПечати) ИЛИ (Объект.Ручьи > 0 И Объект.РучьиПечатиИндиго > 0 И Объект.Ручьи <> Объект.РучьиПечатиИндиго) Тогда
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ПослеОтветаНаВопросКоличествоРучьевПечатиМеньшеЧемВШтампе", ЭтотОбъект), 
		"Количество ручьев печати меньше, чем в штампе. Утвердить цвета?",
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 29.12.2023 
	
	Объект.УтвердилЦвета = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияЦветов = ТекущаяДата();
	ИзменитьПриСменеВидаВырубки(,,ВРежимеРедактированияПараметров);
	УтверждениеЦветов();
	
	
	Объект.ДатаУтвержденияЗаказа = '0001.01.01'; 
	Объект.УтвердилЗаказ = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЭлементПринадлежитИерархии(Элемент,Группа)  
	
	Возврат Элемент.ПринадлежитЭлементу(Группа);
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросОШтампеМатериале(РезультатВопроса, ДополнительныеПараметры) Экспорт 
    
	Результат = РезультатВопроса;
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если (Объект.Ручьи > 0 И Объект.РучьиПечати > 0 И Объект.Ручьи <> Объект.РучьиПечати) ИЛИ (Объект.Ручьи > 0 И Объект.РучьиПечатиИндиго > 0 И Объект.Ручьи <> Объект.РучьиПечатиИндиго) Тогда
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ПослеОтветаНаВопросКоличествоРучьевПечатиМеньшеЧемВШтампе", ЭтотОбъект), 
		"Количество ручьев печати меньше, чем в штампе. Утвердить цвета?",
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
		
	Объект.УтвердилЦвета = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияЦветов = ТекущаяДата();
	ИзменитьПриСменеВидаВырубки();
	УтверждениеЦветов();
	
	Объект.ДатаУтвержденияЗаказа = '0001.01.01'; 
	Объект.УтвердилЗаказ = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаНаВопросКоличествоРучьевПечатиМеньшеЧемВШтампе(РезультатВопроса, ДополнительныеПараметры) Экспорт 
    
	Результат = РезультатВопроса;
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	Объект.УтвердилЦвета = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияЦветов = ТекущаяДата();
	ИзменитьПриСменеВидаВырубки();
	УтверждениеЦветов();
	
	Объект.ДатаУтвержденияЗаказа = '0001.01.01'; 
	Объект.УтвердилЗаказ = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЕстьВидТМЦвПараметрах(ВидСекции)  
	
	Возврат ВидСекции.ПараметрыСекций.НайтиСтроки(новый структура("ПараметрСекции", справочники.Лико_ПараметрыСекций.ВидТМЦ)).количество() <> 0
	
КонецФункции


&НаКлиенте
//при утвердить цвета
Функция ПроверкаЗаполненияЦветовКлиент()
	
	ЕстьЦветоделение = Ложь;  
	БезЛака = Истина;
	ТолькоСплошнаяЗаливка = Истина;
	СписокНеЦифровыхФорм = Новый СписокЗначений;
	
	Для каждого стр из объект.Цвета цикл  
		
		ТипКраски = стр.ТипКраски;   
		ВидСекции = стр.ВидСекции;
		ВидПечати = ЗначениеРеквизита(ВидСекции, "ВидПечати"); 
		ТипЦвета  = стр.ТипЦвета1;
		НомерСтроки = стр.НомерСтроки;  
		
		Если стр.Цветоделение Тогда
			ЕстьЦветоделение = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидСекции) Тогда
			Возврат СтрШаблон("Не указан Вид работ в строке %1. Цвета не утверждены", НомерСтроки)       
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(стр.РабочийЦентр) Тогда
			Возврат СтрШаблон("Не указан Рабочий Центр в строке %1. Цвета не утверждены", НомерСтроки)       
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(стр.РабочийЦентр,"Лико_ДатаОкончания")) 
			И Лико_Дополнительно.ЗначениеРеквизитаОбъекта(стр.РабочийЦентр,"Лико_ДатаОкончания") < ТекущаяДата() Тогда
			Возврат СтрШаблон("Указан не действующий Рабочий Центр в строке %1. Цвета не утверждены", НомерСтроки)       
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(стр.НомерПроката) Тогда
			Возврат СтрШаблон("Не указан Номер проката в строке %1. Цвета не утверждены", НомерСтроки)       
		КонецЕсли;  
		//В заказе не может быть одинаковых форм если они не цифровые
		Если ЗначениеЗаполнено(Стр.Форма)
			И Стр.ВидСекции <> ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая")
			// --> Начало Лико Ефимов ЕВВ 14.07.2025
			// Сплошные тоже не проверяем
			И НЕ Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Стр.Форма, "Сплошная")
			// <-- Конец Лико Ефимов ЕВВ 14.07.2025
			Тогда
			Если СписокНеЦифровыхФорм.НайтиПоЗначению(Стр.Форма) = Неопределено Тогда
				СписокНеЦифровыхФорм.Добавить(Стр.Форма);
			Иначе
				Возврат СтрШаблон("Дублируется номер формы %1 в строке %2. Цвета не утверждены",ЗначениеРеквизита(Стр.Форма, "Код"),НомерСтроки);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеРеквизита(стр.видсекции, ("ИспользоватьВидТМЦ")) Тогда
			Если НЕ ЗначениеЗаполнено(стр.ВидТМЦ) Тогда
				Возврат СтрШаблон("Не указан Вид ТМЦ в строке %1. Цвета не утверждены", НомерСтроки)       
			КонецЕсли; 
			///////////////////////////////////
			Если стр.ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска") Тогда 
				
				ТолькоСплошнаяЗаливка = ложь;
				
				Если НЕ ЗначениеЗаполнено(ТипЦвета) Тогда
					Возврат СтрШаблон("Не указан Тип цвета в строке %1. Цвета не утверждены", НомерСтроки);
				КонецЕсли;   
				
				Если ТипЦвета = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Спецкраска")  Тогда 
					Если  НЕ ЗначениеЗаполнено(ТипКраски) Тогда
						Возврат СтрШаблон("Не указан Тип краски в строке %1. Цвета не утверждены", НомерСтроки); 
					КонецЕсли;   
					Если Не ЗначениеЗаполнено(стр.ПроцентЗаливки) Тогда 
						Возврат СтрШаблон(" Не указан процент заливки в строке %1.", НомерСтроки);
					КонецЕсли;
					Если ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ФлексоПечать") Тогда 
						Если Не ЗначениеЗаполнено(стр.Грамматура) Тогда 
							Возврат СтрШаблон(" Не указана грамматура белил в строке %1. Цвета не утверждены", НомерСтроки); 
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли     ТипЦвета = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Белый") Тогда 
					
					Если ВидСекции <>  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Инкджет") И ВидСекции <>  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ОфсетнаяПечать")  Тогда
						Если  НЕ ЗначениеЗаполнено(ТипКраски) Тогда
							Возврат СтрШаблон("Не указан Тип краски в строке %1. Цвета не утверждены", НомерСтроки); 
						КонецЕсли;   
						Если Не ЗначениеЗаполнено(стр.ПроцентЗаливки) Тогда 
							Возврат СтрШаблон(" Не указан процент заливки в строке %1.", НомерСтроки);
						КонецЕсли;
					КонецЕсли;
					
					Если ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ФлексоПечать") Тогда 
						Если Не ЗначениеЗаполнено(стр.Грамматура) Тогда 
							Возврат СтрШаблон(" Не указана грамматура белил в строке %1. Цвета не утверждены", НомерСтроки); 
						КонецЕсли; 
						
						Если стр.Грамматура < 2 Тогда 
							Возврат СтрШаблон(" Грамматура белил не может быть меньше 2, строка %1", НомерСтроки);
						КонецЕсли; 
					КонецЕсли; 
					
				Иначе	
					Если ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ФлексоПечать") Тогда
						ОсновнойВидПечати = ПолучитьОсновнойВидПечати(стр.НомерПроката); 
						Если ОсновнойВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Офсет")  Тогда 
							Если Не ЗначениеЗаполнено(стр.Грамматура) Тогда
								Возврат СтрШаблон( " Не указана грамматура краски флексо на офсетной машине")
							КонецЕсли;
							Если  Не ЗначениеЗаполнено(стр.ПроцентЗаливки) Тогда
								Возврат СтрШаблон(" Не указан процент заливки для флексо цвета на офсетной машине")
							КонецЕсли;
						КонецЕсли; 					
						
					ИначеЕсли 	ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда 
						Если ТипЦвета =  ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Золото") ИЛИ ТипЦвета =  ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Серебро") 
							ИЛИ ТипЦвета =  ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Черный") Тогда 
							
							Возврат СтрШаблон(" Не корректно указан основной цвет в строке №%1, основные цвета для цифры не используются", НомерСтроки)	
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				
			Иначе  
				
				Если стр.ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Лак") Тогда  
					БезЛака = Ложь;	
				КонецЕсли; 
				
				Если НЕ ЗначениеЗаполнено(ТипКраски) Тогда
					Возврат СтрШаблон("Не указан Тип краски в строке %1. Цвета не утверждены", НомерСтроки)
				КонецЕсли; 		
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТипКраски) Тогда 
				
				Если ЗначениеРеквизита(ТипКраски, "Лико_ВидТМЦ") <> стр.ВидТМЦ Тогда 
					Возврат СтрШаблон("Выбранный тип не соответствует указанному Виду ТМЦ в строке %1. Цвета не утверждены", НомерСтроки) 
				КонецЕсли;
				
				Если Не ПроверитьСоответствиеЦеновойГруппыВидуСекции(стр.ТипКраски, стр.ВидСекции, Объект.Площадка, стр.ТипЦвета1) Тогда 
					Возврат СтрШаблон("Выбранный тип не соответствует Виду работ или типу цвета (для краски) в строке %1. Цвета не утверждены", НомерСтроки)  
				КонецЕсли;  		
				
			КонецЕсли;
			
			
			Если НужноЗаполнятьВидЗаливки(стр.ВидТМЦ) Тогда 
				
				Если НЕ ЗначениеЗаполнено(стр.ВидЗаливки) Тогда
					Возврат СтрШаблон("Не указан Вид заливки в строке %1. Цвета не утверждены", НомерСтроки)
				КонецЕсли; 
				
				Если стр.ВидЗаливки = ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.НеСплошная") Тогда 
					Если Не ЗначениеЗаполнено(стр.ПроцентЗаливки) Тогда 
						Возврат СтрШаблон(" Не указан процент заливки в строке %1.", НомерСтроки)
					КонецЕсли;  
					
					ТолькоСплошнаяЗаливка = ложь;
					
				ИначеЕсли   стр.Цветоделение И ЗначениеРеквизита(Стр.ВидСекции,"Родитель") <> ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") тогда
					Возврат СтрШаблон( " Для сплошной заливки указано цветоделение в строке %1 ", НомерСтроки)
					
				КонецЕсли; 
				
				
			КонецЕсли;  
			
			Если ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ТрафаретнаяПечать") Тогда 
				
				Если Не ЗначениеЗаполнено(стр.ПроцентЗаливки) Тогда
					Возврат СтрШаблон(" Не указан процент заливки для секции трафаретной печати в строке %1", НомерСтроки)
				КонецЕсли; 
				
				Если Не ЗначениеЗаполнено(стр.трафаретнаяСетка) Тогда 
					Возврат СтрШаблон(" Не указана трафаретная сетка в строке %1", НомерСтроки)
				КонецЕсли; 			
				
				Если  Не ЗначениеЗаполнено(стр.Грамматура) Тогда 
					Возврат СтрШаблон( " Не заполнена грамматура в строке %1", НомерСтроки)
				КонецЕсли;	
				
				
				
			ИначеЕсли 	ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Глубокая") Тогда 			
				
				//Если Не ЗначениеЗаполнено(стр.Вал) ТОгда 
				//	Возврат СтрШаблон( " Не указан вал для секции глубокой печати в строке %1", НомерСтроки)
				//КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(стр.грамматура) ТОгда 
					Возврат СтрШаблон( " Не указана грамматура для секции глубокой печати в строке %1", НомерСтроки)
				КонецЕсли;	 
				
			ИначеЕсли 	ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЦифровоеТиснение" ) или ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЦифровойЛак" )  Тогда 
				Если Не ЗначениеЗаполнено(стр.ГрамматураНаРЦ) Тогда 
					Возврат СтрШаблон(" Не указана грамматура на РЦ для цифрового лака")
				КонецЕсли;	
				
			КонецЕсли;
			
		
						
		КонецЕсли;   
		
		Если ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда 
			Если ЗначениеРеквизита(стр.Рабочийцентр, "ВидРабочегоЦентра")  <>  ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") И  ЗначениеРеквизита(стр.Рабочийцентр, "ВидРабочегоЦентра")  <>  ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet") Тогда  

				Если Не ЗначениеЗаполнено(стр.ТипНумератора) Тогда
					Возврат  СтрШаблон("не заполнен Тип нумератора в строке %1", стр.НомерСтроки) 					
				КонецЕсли;	

				Если Не  ЗначениеЗаполнено(стр.ТипКраски) Тогда
					Возврат СтрШаблон("не заполнены Чернила в строке %1", стр.НомерСтроки)				
				КонецЕсли;  

				Если Не  ЗначениеЗаполнено(стр.ТипКода) Тогда
					Возврат СтрШаблон("не заполнен Тип кода в строке %1", стр.НомерСтроки)				
				КонецЕсли;   

				Если Не  ЗначениеЗаполнено(стр.КоличествоКодовНаЛисте)  Тогда
					Возврат СтрШаблон("не заполнено количество кодов на листе в строке %1", стр.НомерСтроки)			
				КонецЕсли;

				Если Не  ЗначениеЗаполнено(стр.КоличествоРучьевНумератора)  Тогда
					Возврат СтрШаблон("не заполнено количество ручьев нумератора) в строке %1", стр.НомерСтроки)				
				КонецЕсли;   			
			КонецЕсли; 
			
		// <-- Начало Лико Яцун С. В. 01.11.2024 
		Если ЗначениеЗаполнено(Стр.ТипНумератора) Тогда
			Если НЕ ПроверкаТипНумератораСоответствует(Стр.ТипНумератора,Стр.Рабочийцентр) Тогда
				Возврат СтрШаблон("указанный Тип нумератора не соответствует выбранному Рабочему центру в строке %1", стр.НомерСтроки)				
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 01.11.2024  
		
		КонецЕсли; 
		
		
	КонецЦикла;
	
	//Если ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда 
	//	Если ЗначениеРеквизита(стр.Рабочийцентр, "ВидРабочегоЦентра")  =  ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") Тогда  
	// 		Продолжить; 
	//	КонецЕсли;
	//ИначеЕсли ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.СклейкаТУ") Тогда 
	//     Продолжить;			
	// КонецЕсли; 
	
	ВидЗаказа = объект.ВидЗаказа;  
	ТипЗаказа = объект.ТипЗаказа; 
	
	Если Не объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.Линкс") Тогда 
		Если Не ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Полуфабрикат") Тогда 	
			Если ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПолныйПовтор") Тогда 
				Если ЕстьЦветоделение Тогда 
					Возврат "Для вида заказа Полный повтор не должно быть указано цветоделение";
				КонецЕсли;		
			ИначеЕсли 	ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Новый")
				ИЛИ ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.СложныйПовтор")
				ИЛИ ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПовторСНовымОбъединением") Тогда 
				Если ТолькоСплошнаяЗаливка Тогда
					Если ЕстьЦветоделение И ЗначениеРеквизита(Стр.ВидСекции,"Родитель") <> ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") Тогда
						Возврат "В данном заказе только сплошная заливка, цветоделение не должно быть указано "
					КонецЕсли;
				Иначе
					Если Не ЕстьЦветоделение Тогда 
						Возврат  " Для вида заказа Повтор с изменением, Новый или Сложный повтор должно быть указано цветоделение ";
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	Возврат Истина
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверкаТипНумератораСоответствует(ТипНумератора,РЦ)
	
	СтрокаВидРЦ = ТипНумератора.РабочиеЦентры.НайтиСтроки(Новый Структура("РабочийЦентр",РЦ.ВидРабочегоЦентра));
	СтрокиРЦ = ТипНумератора.РабочиеЦентры.НайтиСтроки(Новый Структура("РабочийЦентр",РЦ));
	Если СтрокаВидРЦ.Количество() = 0 И СтрокиРЦ.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОсновнойВидПечати(НомерПроката) 
	
	РабочийЦентр = объект.Цвета.НайтиСтроки(новый структура("НомерПроката", НомерПроката ))[0].РабочийЦентр;
	
	Возврат РабочийЦентр.ВидРабочегоЦентра.лкОсновнойВидПечати
	
КонецФункции

&НаКлиенте
Функция НужноЗаполнятьВидЗаливки(ВидТМЦ) 
	
	Возврат  ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Лак") 
			 или ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Клей")
			 или ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Праймер") 
			 или ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.БесцветнаяМасса") 
	
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполненияРаботКлиент()// --> Начало Субботин
	
	Если (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) И НЕ ЗначениеЗаполнено(Объект.ДопускМинус) И НЕ ЗначениеЗаполнено(Объект.ДопускПлюс) Тогда
		Возврат СтрШаблон("Не указан вариант допусков в параметрах печати и вырубки. Работы не утверждены")       
	КонецЕсли; 
	
	// <-- Начало Лико Яцун С. В. 01.10.2024 
	Если НеобходимоЗаполнятьРаппортТУ() И НЕ ЗначениеЗаполнено(Объект.Раппорт) И НЕ Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПолныйПовтор") Тогда
		Возврат СтрШаблон("Не заполнено поле Раппорт в параметрах печати и вырубки. Введите Высоту этикетки для заполнения Раппорта. Работы не утверждены")       
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 01.10.2024
	
	Для каждого стр из объект.Цвета цикл  

		Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(стр.ВидСекции, "ОтображатьВТЧЦвета") И НЕ Лико_Дополнительно.ЗначениеРеквизитаОбъекта(стр.ВидСекции, "ОтображатьВТЧРаботы") И ВидРЦИндиго(стр.РабочийЦентр) Тогда 

			Если не ЗначениеЗаполнено(Объект.Праймер) Тогда  
				Возврат СтрШаблон("Не указан праймер для цифровой печати. Работы не утверждены")
			КонецЕсли;

		КонецЕсли;

			//28.06.22 
		//Если ЭтоЛико_ШтампСЛаминацией(стр.Оснастка) Тогда  
		//	Возврат СтрШаблон("При использовании указанного вырубного штампа (""%1"") требуется ламинация для поднятия облоя или консультация технолога", стр.Оснастка);
		//КонецЕсли;  

		//16.09.22
		Если  стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Конгрев")  Тогда

			Если ЗначениеЗаполнено(стр.Оснастка) Тогда

				Если ВидРЦОмега(стр.РабочийЦентр) и  объект.ВидЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Пробник") Тогда

					ЧислоУдаров = ПолучитьСкоростьРино(стр.РабочийЦентр);
					Если ЧислоУдаров = 0 Тогда
						Возврат "не заполнена скорость рино на РЦ, обратитесь к программистам" 			
					КонецЕсли;
					ДлинаШтампа = ДлинаКонгревногоШтампа(стр.Оснастка, объект.ЭтМЭР);	

					СтоимостьЧаса = 100;
					ЦенаШтампа = ПолучитьЦенуШтампа(стр.Оснастка, стр.РабочийЦентр, стр.ВидСекции );   


					Если  ДлинаШтампа < 70 Тогда 
						Если (объект.МетражПМ/(ДлинаШтампа * ЧислоУдаров)*СтоимостьЧаса)/2 > ЦенаШтампа Тогда
							Возврат СтрШаблон("Длина конгревного штампа менее 70 мм (%1 мм), требуется заказать другой штамп", ДлинаШтампа) 

						КонецЕсли;
					КонецЕсли;  

				КонецЕсли;  

			КонецЕсли; 

		КонецЕсли;

	КонецЦикла;	  

	Возврат Истина
		
КонецФункции // <-- Конец Субботин

&НаСервереБезКонтекста
Функция ДлинаКонтрКолье(Штамп) // --> Начало Лико Яцун 20.01.2023
	
	Выборка = РегистрыСведений.Лико_ПараметрыШтампа.Выбрать(Новый Структура("Номенклатура",Штамп));
	
	Пока Выборка.Следующий() Цикл
		Размеры = Новый Структура("ДлинаКонтрЭтикетки,ДлинаКольеретки",Выборка.ДлинаКонтрЭтикетки,Выборка.ДлинаКольеретки);
		Возврат Размеры;
	КонецЦикла;
	
КонецФункции // <-- Конец Лико Яцун 20.01.2023

&НаСервереБезКонтекста
Функция ПолучитьВидШтампа(Штамп) // --> Начало Лико Яцун 22.12.2022
	
	Возврат Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,Штамп,"ОстасткаВидШтампа",Неопределено);
	
КонецФункции // <-- Конец Лико Яцун 22.12.2022

&НаСервереБезКонтекста
Функция ПолучитьШагПоНарезкеШтампа(Штамп) // --> Начало Лико Яцун 22.12.2022
	
	Выборка = РегистрыСведений.Лико_ПараметрыШтампа.Выбрать(Новый Структура("Номенклатура",Штамп));
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ШагПоНарезке;
	КонецЦикла;
	
КонецФункции // <-- Конец Лико Яцун 22.12.2022 

&НаСервереБезКонтекста
Функция ПолучитьЦенуШтампа(Штамп, РабочийЦентр, ВидСекции) // --> Начало Лико Субботин 01.02.23	
	
	Цена = 0;
	
	Выборка = РегистрыСведений.Лико_ПараметрыШтампа.Выбрать(Новый Структура("Номенклатура", Штамп));
	
	Пока Выборка.Следующий() Цикл
		Цена = Выборка.Цена
	КонецЦикла;  
	
	Если Цена = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРабочихЦентровЛико_СтоимостьОснастки.Стоимость КАК Стоимость
		|ИЗ
		|	Справочник.ВидыРабочихЦентров.Лико_СтоимостьОснастки КАК ВидыРабочихЦентровЛико_СтоимостьОснастки
		|ГДЕ
		|	ВидыРабочихЦентровЛико_СтоимостьОснастки.ВидСекции = &ВидСекции
		|	И ВидыРабочихЦентровЛико_СтоимостьОснастки.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидСекции", ВидСекции);
		Запрос.УстановитьПараметр("Ссылка", РабочийЦентр.ВидРабочегоЦентра);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Цена = Выборка.Стоимость;	
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Цена
	
КонецФункции // <-- Конец Лико Субботин 01.02.23	

&НаКлиенте
Процедура ПослеОтветаНаВопросОНарезке(РезультатВопроса, ДополнительныеПараметры) Экспорт // --> Начало Лико Яцун 22.12.2022
    
	Результат = РезультатВопроса;
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Нарезка = ПолучитьНарезку(ДополнительныеПараметры.РасчетнаяНарезка);
		ЭтаФорма.Модифицированность = Истина;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Тема = "В заказе " + Объект.НомерБезПрефикса + " менеджера " + Объект.Менеджер + " указана нарезка " + Объект.Нарезка + ". Расчетная нарезка " + ДополнительныеПараметры.РасчетнаяНарезка + ".";
		ТекстПисьма = "В заказе " + Объект.НомерБезПрефикса + " менеджера " + Объект.Менеджер + " указана нарезка " + Объект.Нарезка + ". Расчетная нарезка " + ДополнительныеПараметры.РасчетнаяНарезка + "." + Символы.ПС + ДополнительныеПараметры.ТекстПараметры;
		Если ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Gallus")
			ИЛИ ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusGranitic") Тогда
			Кому = "IMachula@okil-sato.ru;OlegPak@okil.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet") Тогда
			Кому = "AChirva@okil-sato.ru;OlegPak@okil.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPS") Тогда
			Кому = "MBaranov@okil-sato.ru;OlegPak@okil.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPSOfset") Тогда
			Кому = "inabatov@okil-sato.ru;OlegPak@okil.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Drent") 
			ИЛИ ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MO3300") Тогда
			Кому = "gkan@okil-sato.ru;inabatov@okil-sato.ru";
		КонецЕсли;
		ОтправитьПисьмо(ТекстПисьма, Тема, Кому);
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Сообщить("Указанная нарезка меньше, чем расчетная " + ДополнительныеПараметры.РасчетнаяНарезка + ". Заменить нарезку на расчетную?");
		Возврат;
	КонецЕсли;
	
	Если Объект.Площадка = ГлЛико_Площадки.Ликофлекс 
		И Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Полуфабрикат")
		И Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка") 
		И ПолучитьРазмерНарезки() - ДополнительныеПараметры.РасчетнаяНарезка >= ДополнительныеПараметры.ШагПоНарезке
		И ДополнительныеПараметры.Ручьи <> Объект.Ручьи Тогда
		Если ДлинаКонтрКолье(ДополнительныеПараметры.Штамп).ДлинаКонтрЭтикетки <> 0 ИЛИ ДлинаКонтрКолье(ДополнительныеПараметры.Штамп).ДлинаКольеретки <> 0 Тогда
			ЗначениеДлинаКонтрКолье = ?(ДлинаКонтрКолье(ДополнительныеПараметры.Штамп).ДлинаКонтрЭтикетки = 0, ДлинаКонтрКолье(ДополнительныеПараметры.Штамп).ДлинаКольеретки, ДлинаКонтрКолье(ДополнительныеПараметры.Штамп).ДлинаКонтрЭтикетки);
			Если Объект.ДлинаЭтикетки = ЗначениеДлинаКонтрКолье Тогда
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОНарезкеИРучьяхПечати", ЭтотОбъект,Новый Структура("РасчетнаяНарезка,Ручьи,ШагПоНарезке,ВидРЦ",ДополнительныеПараметры.РасчетнаяНарезка,ДополнительныеПараметры.Ручьи,ДополнительныеПараметры.ШагПоНарезке,ВидРЦ)), 
				"Некорректно указана нарезка или количество ручьев печати. Заменить нарезку на расчетную " + ДополнительныеПараметры.РасчетнаяНарезка + " мм?",
				РежимДиалогаВопрос.ДаНетОтмена);
				//Сообщить("Не корректно указана нарезка или количество ручьев печати");	
				Возврат;
			КонецЕсли;
		Иначе
			ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеОтветаНаВопросОНарезкеИРучьяхПечати", ЭтотОбъект,Новый Структура("РасчетнаяНарезка,Ручьи,ШагПоНарезке,ВидРЦ",ДополнительныеПараметры.РасчетнаяНарезка,ДополнительныеПараметры.Ручьи,ДополнительныеПараметры.ШагПоНарезке,ВидРЦ)), 
			"Некорректно указана нарезка или количество ручьев печати. Заменить нарезку на расчетную " + ДополнительныеПараметры.РасчетнаяНарезка + " мм?",
			РежимДиалогаВопрос.ДаНетОтмена);
			//Сообщить("Не корректно указана нарезка или количество ручьев печати");	
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.Площадка = ГлЛико_Площадки.Ликофлекс Тогда 
		ШтампМатериал = ВРег(Сред(ЗначениеРеквизита(Объект.ШтампВырубной,"Артикул"),8,1));
		Если ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЦГОсновногоМатериала = ЗначениеРеквизита(Объект.ОсновнойМатериал,"ЦеноваяГруппа");
		Иначе
			ЦГОсновногоМатериала = Объект.ОсновнойМатериал;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЦГОсновногоМатериала) Тогда
			Если ШтампМатериал = "П" И НЕ ЭлементПринадлежитИерархии(ЦГОсновногоМатериала,ПредопределенноеЗначение("Справочник.ЦеновыеГруппы.Пленки")) И Найти(ВРег(Объект.ОсновнойМатериал),"BUMELEN") = 0 Тогда 
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОШтампеМатериале", ЭтотОбъект), 
				"Указан штамп с буквой " + ШтампМатериал + ", не соответствующий материалу " + Объект.ОсновнойМатериал + ", отменить утверждение?",
				РежимДиалогаВопрос.ДаНет);
				Возврат;
			ИначеЕсли ШтампМатериал = "Б" И НЕ ЭлементПринадлежитИерархии(ЦГОсновногоМатериала,ПредопределенноеЗначение("Справочник.ЦеновыеГруппы.Бумага")) Тогда
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОШтампеМатериале", ЭтотОбъект), 
				"Указан штамп с буквой " + ШтампМатериал + ", не соответствующий материалу " + Объект.ОсновнойМатериал + ", отменить утверждение?",
				РежимДиалогаВопрос.ДаНет);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если (Объект.Ручьи > 0 И Объект.РучьиПечати > 0 И Объект.Ручьи <> Объект.РучьиПечати) ИЛИ (Объект.Ручьи > 0 И Объект.РучьиПечатиИндиго > 0 И Объект.Ручьи <> Объект.РучьиПечатиИндиго) Тогда
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ПослеОтветаНаВопросКоличествоРучьевПечатиМеньшеЧемВШтампе", ЭтотОбъект), 
		"Количество ручьев печати меньше, чем в штампе. Утвердить цвета?",
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Объект.УтвердилЦвета = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияЦветов = ТекущаяДата();
	ИзменитьПриСменеВидаВырубки();
	УтверждениеЦветов();
	
	Объект.ДатаУтвержденияЗаказа = '0001.01.01'; 
	Объект.УтвердилЗаказ = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецПроцедуры // <-- Конец Лико Яцун 22.12.2022

&НаКлиенте
Процедура ПослеОтветаНаВопросОНарезкеИРучьяхПечати(РезультатВопроса, ДополнительныеПараметры) Экспорт // --> Начало Лико Яцун 30.01.2023
    
	Результат = РезультатВопроса;
    Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Нарезка = ПолучитьНарезку(ДополнительныеПараметры.РасчетнаяНарезка);
		ЭтаФорма.Модифицированность = Истина;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Тема = "В заказе " + Объект.НомерБезПрефикса + " некорректно указана нарезка " + Объект.Нарезка + " мм. или ручьи печати " + ДополнительныеПараметры.Ручьи 
		+ ". Шаг по нарезке " + ДополнительныеПараметры.ШагПоНарезке + ", расчетное значение нарезки " + ДополнительныеПараметры.РасчетнаяНарезка + " мм.";
		ТекстПисьма = "В заказе " + Объект.НомерБезПрефикса + " некорректно указана нарезка " + Объект.Нарезка + " мм. или ручьи печати " + ДополнительныеПараметры.Ручьи 
		+ ". Шаг по нарезке " + ДополнительныеПараметры.ШагПоНарезке + ", расчетное значение нарезки " + ДополнительныеПараметры.РасчетнаяНарезка + " мм.";
		Если ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPS") Тогда
			Кому = "MBaranov@okil-sato.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPSOfset") Тогда
			Кому = "inabatov@okil-sato.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Gallus")
			ИЛИ ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusGranitic") Тогда
			Кому = "IMachula@okil-sato.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Drent") Тогда
			Кому = "gkan@okil-sato.ru;inabatov@okil-sato.ru";
		ИначеЕсли ДополнительныеПараметры.ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet") Тогда
			Кому = "AChirva@okil-sato.ru";
		КонецЕсли;	
		Если ЗначениеЗаполнено(Кому) Тогда
			ОтправитьПисьмо(ТекстПисьма, Тема, Кому);
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Сообщить("Некорректно указана нарезка или количество ручьев печати. Заменить нарезку на расчетную " + ДополнительныеПараметры.РасчетнаяНарезка + " мм?");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.Площадка = ГлЛико_Площадки.Ликофлекс Тогда 
		ШтампМатериал = ВРег(Сред(ЗначениеРеквизита(Объект.ШтампВырубной,"Артикул"),8,1));
		Если ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЦГОсновногоМатериала = ЗначениеРеквизита(Объект.ОсновнойМатериал,"ЦеноваяГруппа");
		Иначе
			ЦГОсновногоМатериала = Объект.ОсновнойМатериал;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЦГОсновногоМатериала) Тогда
			Если ШтампМатериал = "П" И НЕ ЭлементПринадлежитИерархии(ЦГОсновногоМатериала,ПредопределенноеЗначение("Справочник.ЦеновыеГруппы.Пленки")) И Найти(ВРег(Объект.ОсновнойМатериал),"BUMELEN") = 0 Тогда 
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОШтампеМатериале", ЭтотОбъект), 
				"Указан штамп с буквой " + ШтампМатериал + ", не соответствующий материалу " + Объект.ОсновнойМатериал + ", отменить утверждение?",
				РежимДиалогаВопрос.ДаНет);
				Возврат;
			ИначеЕсли ШтампМатериал = "Б" И НЕ ЭлементПринадлежитИерархии(ЦГОсновногоМатериала,ПредопределенноеЗначение("Справочник.ЦеновыеГруппы.Бумага")) Тогда
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОШтампеМатериале", ЭтотОбъект), 
				"Указан штамп с буквой " + ШтампМатериал + ", не соответствующий материалу " + Объект.ОсновнойМатериал + ", отменить утверждение?",
				РежимДиалогаВопрос.ДаНет);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если (Объект.Ручьи > 0 И Объект.РучьиПечати > 0 И Объект.Ручьи <> Объект.РучьиПечати) ИЛИ (Объект.Ручьи > 0 И Объект.РучьиПечатиИндиго > 0 И Объект.Ручьи <> Объект.РучьиПечатиИндиго) Тогда
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ПослеОтветаНаВопросКоличествоРучьевПечатиМеньшеЧемВШтампе", ЭтотОбъект), 
		"Количество ручьев печати меньше, чем в штампе. Утвердить цвета?",
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Объект.УтвердилЦвета = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияЦветов = ТекущаяДата();
	ИзменитьПриСменеВидаВырубки();
	УтверждениеЦветов();
	
	Объект.ДатаУтвержденияЗаказа = '0001.01.01'; 
	Объект.УтвердилЗаказ = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецПроцедуры // <-- Конец Лико Яцун 30.01.2023

&НаСервере
Процедура ОтправитьПисьмо(ТекстПисьма, Тема, Кому)
	Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, Тема, Кому);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНарезку(РазмерНарезки) // --> Начало Лико Яцун 22.12.2022
	
	НарезкаСсылка = Справочники.ЯССМ_Нарезки.НайтиПоРеквизиту("Размер",РазмерНарезки);
	
	Возврат НарезкаСсылка;
	
КонецФункции // <-- Конец Лико Яцун 22.12.2022

&НаСервереБезКонтекста
Функция ВидРЦОмега(РабочийЦентр)
	
	ВидРЦентра = ЗначениеРеквизита(РабочийЦентр, "ВидРабочегоЦентра");     	
	
	Возврат ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Omega") 
	
КонецФункции   

&НаСервереБезКонтекста
Функция ПолучитьСкоростьРино(РабочийЦентр)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийЦентр, "Лико_СкоростьРино");
	
КонецФункции



&НаСервереБезКонтекста
Функция ДлинаКонгревногоШтампа(Оснастка, ЭтМЭР)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПараметрыШтампа.Ручьи КАК Ручьи,
		|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
		|ГДЕ
		|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Оснастка);
	
	Выборка = Запрос.Выполнить().Выбрать();;
	
	Пока Выборка.Следующий() Цикл  
		Результат = Выборка.ЭтикетокНаЛисте/Выборка.Ручьи * ЭтМЭР * 1000;			
	КонецЦикла;
	
	Возврат Результат
	
	//Если Результат < 70  Тогда
	//	Возврат Ложь
	//Иначе 
	//	Возврат Истина
	//КонецЕсли;
	
		
КонецФункции

&НаСервереБезКонтекста
Функция  ЭтоЛико_ШтампСЛаминацией(Оснастка)  
	Возврат Оснастка.Лико_ШтампСЛаминацией
КонецФункции

&НаКлиенте
Процедура УтвердитьЗаказ(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если ЭтаФорма.Модифицированность Тогда
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("БылВопросПередЗаписью", Истина);
			Записать(ПараметрыЗаписи);
		КонецЕсли;
	Иначе
		Сообщить("Необходимо записать заказ!");
		Возврат;
	КонецЕсли;
	
	// --> Начало лк Субботин 18.04.22
	Для каждого стр из объект.Цвета цикл  
		Если  стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.СклейкаТУ") и Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда 
			
			Если Не ЗначениеЗаполнено(стр.ТипКраски) Тогда
				Сообщить("Для термоусадки необходимо запонить клей (компонент клея) в строке " + стр.НомерСтроки);	
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
    // <-- Конец Лико Субботин 18.04.2022
	
	//Если Не ПроверитьДоступностьНаСервере("Лико_ЗакрытиеОтгрузки") Тогда
		РезультатПроверки = ПроверкаЗаполненияЦветовРабот();
		Если РезультатПроверки<>Истина Тогда 
			Сообщить(РезультатПроверки+ " "+ "Цвета/работы заполнены не корректно!!!");
			Отказ = Истина;
			Возврат
		КонецЕсли;
	//КонецЕсли;
		Объект.ДатаУтвержденияЗаказа =  ТекущаяДата();
		Объект.УтвердилЗаказ =  ПользователиКлиентСервер.ТекущийПользователь(); 
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("БылВопросПередЗаписью", Истина);
		Записать(ПараметрыЗаписи);

КонецПроцедуры


&НаКлиенте
Процедура ОтменитьУтверждение(Команда)
	Объект.УтвердилЦвета = ПользователиКлиентСервер.ТекущийПользователь(); 
	Объект.ДатаУтвержденияЦветов =Дата(1,1,1);
	УтверждениеЦветов();
	Объект.ДатаУтвержденияЗаказа = '0001.01.01'; 
	Объект.УтвердилЗаказ = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПлощадкаИксПак(Площадка) 
	
	Возврат Площадка = Справочники.Лико_Площадки.ИксПак; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПлощадкаУрал(Площадка)
	
	Возврат Площадка = Справочники.Лико_Площадки.Урал;  
	
КонецФункции

&НаСервереБезКонтекста
Функция ПлощадкаСибирь(Площадка)
	
	Возврат Площадка = Справочники.Лико_Площадки.Сибирь;  
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПлощадкаЛикофлекс(Площадка)
	
	Возврат Площадка = Справочники.Лико_Площадки.Ликофлекс;  
	
КонецФункции

&НаСервереБезКонтекста
Функция ПлощадкаЛинкс(Площадка)
	
	Возврат Площадка = Справочники.Лико_Площадки.Линкс;  
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьФормулуПантона(ТД) //+Лико m.shenderov 24.08.2021
	
	СтруктураПантона = ПолучитьСтруктуруПантонаСервер(ЗначениеРеквизита(ТД.РабочийЦентр, "Лико_Площадка"),ТД.ТипКраски);	
	ТД.ФормулаПантона= СтруктураПантона.ФормулаПантона;
	ТД.Номенклатура  = СтруктураПантона.Номенклатура; 
	ТД.Название = ЗначениеРеквизита(ТД.ФормулаПантона,"Наименование");
	
КонецПроцедуры //-Лико m.shenderov 24.08.2021

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПантонаСервер(Площадка,ЦеноваяГруппа) //+Лико m.shenderov 24.08.2021
	Структура = Новый Структура;
	Структура.Вставить("ФормулаПантона");
	Структура.Вставить("Номенклатура");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ФормулыПантонов.Ссылка КАК ФормулаПантона,
	|	Лико_ФормулыПантонов.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.Лико_ФормулыПантонов КАК Лико_ФормулыПантонов
	|ГДЕ
	|	Лико_ФормулыПантонов.Площадка = &Площадка
	|	И Лико_ФормулыПантонов.ЦеноваяГруппа = &ЦеноваяГруппа";
	Запрос.УстановитьПараметр("ЦеноваяГруппа",ЦеноваяГруппа );
	Запрос.УстановитьПараметр("Площадка",Площадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.08.2021


&НаКлиенте
Процедура ПослеВыбораПантона(Результат, Параметры) Экспорт  
	
	Если Результат <> Неопределено Тогда 
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_Пантоны") ТОгда 
			текстр = Элементы.Цвета.ТекущиеДанные;
			Если Текстр<>Неопределено Тогда 
				текстр.название = Результат;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФорм(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;	
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	УдалитьСписокЗначений("Формы", ТекущиеДанные.КлючСтроки);
	Если Результат.Количество() > 0 Тогда
		ТекущиеДанные.Форма = результат[0];
		//ТекущиеДанные.ВалФорма = результат[0];
		Для каждого элемент из результат Цикл
			стр = Объект.Формы.Добавить();
			стр.Значение =  Элемент;
			стр.КлючСтроки = ТекущиеДанные.КлючСтроки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаОчистка(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	УдалитьСписокЗначений("Формы", ТекущиеДанные.КлючСтроки);
	ТекущиеДанные.ФормаНомерЛинкс = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текст) Тогда 
		СпрФорма = ПолучитьФормуНаСервере(Текст);
		Если ЗначениеЗаполнено(СпрФорма) Тогда 
			УдалитьСписокЗначений("Формы", ТекущиеДанные.КлючСтроки);
			стр = Объект.Формы.Добавить();
			стр.Значение = СпрФорма;
			стр.КлючСтроки = ТекущиеДанные.КлючСтроки;
			текущиеДанные.Форма = СпрФорма;
			ТекущиеДанные.ФормаНомерЛинкс = Текст;
			ДобавитьУсловноеОформлениеЦветаВалФорма();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаНаВопросОСозданииНовойФормыЛинкс(Результат, ДопПараметры)  Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		текстр = Объект.Цвета.НайтиПоИдентификатору(ДопПараметры.Идентификатор);
		ВидПечати = ЗначениеРеквизита(ТекСтр.ВидСекции,"ВидПечати");  
		Если ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Флексо") 
			ИЛИ ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Трафарет")
			ИЛИ ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Офсет") 
			ИЛИ ЗначениеРеквизита(ТекСтр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") Тогда 
			НоваяФорма = СоздатьНовуюФорму(ТекСтр.ВидСекции, ТекСтр.типцвета1, ТекСтр.типкраски, ТекСтр.название,ДопПараметры.КодЛинкс);
			ТекСтр.форма = НоваяФорма;
			//Необходимо записать значение в табличную часть "Формы"
			УдалитьСтрокиПоКлючу(текстр.КлючСтроки,"Формы","КлючСтроки");  
			стрФ = Объект.Формы.Добавить();
			стрФ.Ключстроки = ТекСтр.ключстроки;
			стрФ.Значение = НоваяФорма;  
			//стрФ.Цветоделение = Истина;
		ИначеЕсли ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Цифровая") Тогда
			НоваяФорма = СоздатьНовуюФорму(ТекСтр.ВидСекции, ТекСтр.типцвета1, ТекСтр.типкраски, ТекСтр.название,ДопПараметры.КодЛинкс);
			Для каждого стр из Объект.Цвета Цикл
				Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда
					Если стр.форма <> НоваяФорма Тогда 
						стр.форма = НоваяФорма;
						УдалитьСтрокиПоКлючу(текстр.КлючСтроки,"Формы","КлючСтроки"); 
						стриндиго = Объект.Формы.добавить();
						стриндиго.КлючСтроки = стр.ключстроки;	
						стриндиго.Значение = НоваяФорма;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;        
	КонецЕсли;
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры	


&НаКлиенте
Процедура ПараметрыШтампаПриИзменении()
	
	Если ЗначениеЗаполнено(Объект.Z) И 
		НЕ (ЗначениеЗаполнено(Объект.ШтампВырубной) И ЗначениеЗаполнено(Объект.ШагПечати)) Тогда
		текКоличествоЗубьев = ПолучитьКоличествоЗубьев(Объект.Z) * 3.175 / 1000;
		Если Объект.ШагПечати <> текКоличествоЗубьев Тогда
			текПараметрыОтбора = Новый Структура;
			текПараметрыОтбора.Вставить("ВидСекции", ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка"));	
			текНайденныеСтроки = Объект.Цвета.НайтиСтроки(текПараметрыОтбора);
			Если текНайденныеСтроки.Количество() = 0 Тогда
				Объект.ШагПечати =  текКоличествоЗубьев;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	РасчитатьТиражМетраж();
	ЗаполнитьПлощадьКлишеНаСервере(Объект.ВидВырубки);
	ПоказатьДоходностьРентабельность();
	Для каждого стр из Объект.Отгрузки Цикл
		стр.КвадратныйМетраж = стр.ПогонныйМетраж* ПолучитьНарезкуНасервере(Объект.Нарезка);
	КонецЦикла;
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		ЗаполнитьПлощадьКлишеНаСервере(Объект.ВидВырубки);
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли;
	
КонецПроцедуры


//Общее для связанных ТЧ
&НаКлиенте
Процедура ТЧПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		КлючСтроки = Новый УникальныйИдентификатор;
		Элемент.ТекущиеДанные.КлючСтроки = КлючСтроки;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьСтрокиПоКлючу(КлючСтроки, ИмяТЧ, ИмяКолонки)  
	МассивСтрок =Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяКолонки,  КлючСтроки));
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект[ИмяТЧ].Удалить(ЭлементМассива);
	КонецЦикла;	
КонецПроцедуры


//Отгрузки

&НаКлиенте
Процедура ЗаполнитьОтгрузки(Команда)
	ЗаполнитьОтгрузкиНаСервере(ЛОжь);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтгрузки(Команда)
	ЗаполнитьОтгрузкиНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиПередУдалением(Элемент, Отказ)
	Ключстроки = Элементы.Отгрузки.ТекущиеДанные.КлючСтроки;
	УдалитьСтрокиПоКлючу(КлючСтроки, "Нормативы", "НомерОтгрузки");
   КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиПриАктивизацииСтроки(Элемент)
	стр = Элементы.Отгрузки.ТекущиеДанные;
	Если стр<>Неопределено Тогда 
		КлючСтроки =стр.КлючСтроки;
		Элементы.Нормативы.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерОтгрузки", КлючСтроки); 
		ЗатратыПоОтгрузке.Параметры.УстановитьЗначениеПараметра("КлючСтроки", КлючСтроки);
		Если ЗначениеЗаполнено(стр.ДокументОтгрузки) Тогда 
			Возвраты.Параметры.УстановитьЗначениеПараметра("ДокументОтгрузки", стр.ДокументОтгрузки);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры



&НаКлиенте
Процедура РассчитатьНормативыПоОтгрузке(Команда)
	текстр = Элементы.Отгрузки.ТекущиеДанные;
	Если текстр<>Неопределено Тогда 
		//Удалим строки нормативов по этой отгрузке
   		УдалитьСтрокиПоКлючу(текстр.КлючСтроки, "Нормативы", "НомерОтгрузки");
		
		Идентификатор = текстр.ПолучитьИдентификатор();
	    РассчитатьНормативыПоОтгрузкеНаСервере(Идентификатор);
		//ЗаполнитьФактическиеДопМатериалы (текстр);
		//ЗаполнитьФактическиеДопМатериалы (Идентификатор);
		Записать();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиКоличествоПриИзменении(Элемент)
	текстр = Элементы.Отгрузки.ТекущиеДанные;
	текстр.погонныйМетраж = РассчитатьМетражНаСервере(текстр.количество*1000, Объект.Нарезка); 
	текстр.КвадратныйМетраж = текстр.погонныйМетраж*ПолучитьНарезкуНасервере( Объект.Нарезка);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиПогонныйМетражПриИзменении(Элемент)
	текстр = Элементы.Отгрузки.ТекущиеДанные;
	текстр.КвадратныйМетраж = текстр.погонныйМетраж*ПолучитьНарезкуНасервере(Объект.Нарезка);
КонецПроцедуры


 &НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПринудительноЗакрытьФорму = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗатраты(Команда)
	ЗаполнитьЗатратыНаСервере();
	ЗаполнитьСвязанныеДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДляДокументовПриИзменении(Элемент)
	ВалютаДляДокументовПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявкуНаЦветоделение(Команда)
	ПараметрыФормы    = новый Структура("Ключ", Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаЗаявкиНаЦветоделение", ПараметрыФормы);	
КонецПроцедуры


&НаКлиенте
Процедура ОригиналМакет(Команда)
	текстр = Элементы.Товары.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Текстр.оригиналМакет) Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОМ", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Добавить новый набор оригинал макетов?'"), Режим,0);
	Иначе
		ПараметрыФормы    = новый Структура("Ключ",текстр.оригиналмакет);
		ОткрытьФорму("Справочник.Лико_ОригиналМакеты.Форма.ФормаЭлемента", ПараметрыФормы);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Номенклатура = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Если ЗначениеРеквизита(Номенклатура, "Лико_DFM") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыПолученияДанных.СтрокаПоиска = "";
			Если ДанныеВыбора <> Неопределено Тогда
				ДанныеВыбора.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
	//	Если ЗначениеРеквизита(ТекущиеДанные.Номенклатура,"Лико_DFM") Тогда
	//		СтандартнаяОбработка = Ложь;
	//		РедактироватьНаименованиеНоменклатурыНаСервере(ТекущиеДанные.Номенклатура, Текст);
	//		СтруктураДействий = Новый Структура;
	//		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущиеДанные.Характеристика);
	//		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
	//	КонецЕсли;
	//КонецЕсли;
	
	//Наименование = Текст;
	//Ном = ПолучитьНоменклатуруПоНазванию(Наименование);
	//Если Не ЗначениеЗаполнено(Ном) тогда
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	ДопПараметры = Новый Структура("ТекущиеДанные, Элемент, Текст", ТекущиеДанные, Элемент, Текст); 
	//	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОНоменклатуре", ЭтаФорма, ДопПараметры);
	//	ПоказатьВопрос(Оповещение, НСтр("ru = 'В базе 1С нет номенклатуры (товара) с таким названием? Добавить новую позицию?'"), Режим,0);
	//Иначе 
	//	Значение = Ном;
	//	
	//КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОНоменклатуре(Результат, ДопПараметры)  Экспорт
   Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
   Иначе	
		Если Не ЗначениеЗаполнено(Объект.ссылка) Тогда 
			Сообщить("Необходимо записать заказ") ;
			Возврат;
		КонецЕсли;
		Список = Новый СписокЗначений;
		Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.КЭ"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.Кльр"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.Комплект"));
		//ВыбНач = Список.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораТипаЭтикетки", ЭтотОбъект, ДопПараметры);
		ПоказатьВыборИзСписка(ОписаниеОповещения, Список );
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОМ(Результат, Параметры) Экспорт
	текстр =  Элементы.Товары.ТекущиеДанные;
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Спр = СоздатьОМНаСервере(текстр.номенклатура);
		текстр.оригиналмакет = Спр;
		ПараметрыФормы    = новый Структура("Ключ", Спр);
		ОткрытьФорму("Справочник.Лико_ОригиналМакеты.Форма.ФормаЭлемента", ПараметрыФормы);	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораТипаЭтикетки(Знач ВыбранныйЭлемент, ДопПараметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		типЭтикетки = ВыбранныйЭлемент.Значение;
		Номенклатура = СоздатьНоменклатуруНаСервере(ДопПараметры.Текст, типэтикетки);
		ДопПараметры.ТекущиеДанные.Номенклатура = Номенклатура;
		ДопПараметры.ТекущиеДанные.НаименованиеДляДокументов = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Номенклатура, "НаименованиеПолное");
		ДопПараметры.ТекущиеДанные.Артикул = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Номенклатура, "Артикул");
	КонецЕсли; 		
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураСоздание(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Сообщить("Сначала необходимо записать заказ!");
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	индексстроки =  ТекущиеДанные.НомерСтроки - 1;
	Наименование = Элемент.ТекстРедактирования;
	//Ном = ПолучитьНоменклатуруПоНазванию(Наименование);
	//Если Не ЗначениеЗаполнено(Ном) тогда
	Если Не ЗначениеЗаполнено(Объект.ссылка) Тогда 
		Сообщить("Необходимо записать заказ") ;
		Возврат;
	КонецЕсли;
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.КЭ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.Кльр"));
	ДопПараметры = Новый Структура("ТекущиеДанные, Элемент, Текст", ТекущиеДанные, Элемент, Наименование); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораТипаЭтикетки", ЭтотОбъект, ДопПараметры);
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = "Выберите тип создаваемого товара (эт, контр или колье)";
	//Сообщение.Поле ="Объект.Товары["+ИндексСтроки+"]Номенклатура";
	//Сообщение.УстановитьДанные(ЭтотОбъект);
	//Сообщение.Сообщить();
	//ПоказатьВыборИзСписка(ОписаниеОповещения, Список );
	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаВыбораТипаЭтикетки",,, Новый УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура КоличествоКликов(Команда)
	КоличествоКликовНаСервере();
КонецПроцедуры

&НаКлиенте
// Заполняет список значений
// Параметры
//  НомерРаздела  - номер строки по которой ищатся данные из ТЧ
//  ТаблицаСпискаЗначений  - подчиненная табличная часть
//
Функция ПолучитьМассивЗначений(Ключстроки,ТаблицаСпискаЗначений)
	СтруктураПоиска = Новый Структура("КлючСтроки");
	СтруктураПоиска.КлючСтроки	= КлючСтроки;
	МассивСтрок	= ТаблицаСпискаЗначений.НайтиСтроки(СтруктураПоиска);
	Возврат МассивСтрок;
КонецФункции // УдалитьСписокЗначений()


&НаКлиенте
Процедура ЦветаЦветоделениеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Сообщить("Сначала необходимо записать заказ!");
		Возврат
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НомерБезПрефикса) Тогда 
		Сообщить("Не установлен номер заказа");
		Возврат
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 24.07.2024
	Если Лико_Дополнительно.НовыйМеханизмСозданияФорм(ЗначениеРеквизита(Объект.Площадка, "Организация"), ТекущаяДата()) Тогда
		Возврат;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 24.07.2024
	
	текстр = Элементы.Цвета.ТекущиеДанные;   
	ВидПечати = ЗначениеРеквизита(ТекСтр.ВидСекции, "ВидПечати"); 
	ЗаменаЦГ = Ложь;
	Если ТекСтр.Цветоделение = Истина Тогда
		Если ЗначениеЗаполнено(ТекСтр.ВидСекции)  Тогда
			// <-- Начало Лико Яцун С. В. 02.12.2025 
			Если Объект.Площадка = ГлЛико_Площадки.Сибирь 
				И ЭтоЦМИК(ТекСтр.типцвета1) 
				И ЗначениеЗаполнено(ТекСтр.типкраски) 
				И ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Флексо")
				И СокрЛП(ЗначениеРеквизита(ТекСтр.типкраски,"Код")) <> "3081" Тогда
				ЗаменаЦГ = Истина;
				ТекСтр.Цветоделение = Ложь;
			Иначе	
				СоздатьФорму(ТекСтр,ЗаменаЦГ,Ложь);
			КонецЕсли;
			Если ЗаменаЦГ И НЕ ТекСтр.типцвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.K") Тогда
				Для каждого СтрЦМИК Из Объект.Цвета Цикл
					Если ЭтоЦМИК(СтрЦМИК.типцвета1) 
						И ЗначениеЗаполнено(СтрЦМИК.типкраски) 
						И ЗначениеРеквизита(СтрЦМИК.ВидСекции, "ВидПечати") = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Флексо")
						И СокрЛП(ЗначениеРеквизита(СтрЦМИК.типкраски,"Код")) <> "3081" Тогда
						СтрЦМИК.Цветоделение = Истина;
						СоздатьФорму(СтрЦМИК,ЗаменаЦГ,Истина);	
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ЗаменаЦГ И ТекСтр.типцвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.K") Тогда
				СоздатьФорму(ТекСтр,ЗаменаЦГ,Ложь);	
			КонецЕсли;
			// <-- Конец Лико Яцун С. В. 02.12.2025
			ДобавитьУсловноеОформлениеЦветаВалФорма();
		Иначе 
			Сообщить("Укажите вид печати для данной строки!");
			ТекСтр.Цветоделение  = Ложь;
		КонецЕсли;
		//Если ТекСтрока.ВидПечати = Перечисления.Лико_ВидыПечати.Флексо  Тогда 
		//	МассивСтрок = Формы.НайтиСтроки(Новый Структура("Раздел",  ТекСтрока.КлючСтроки));
		//	Для каждого ЭлементМассива Из МассивСтрок Цикл
		//		ЭлементМассива.Цветоделение = ТекСтрока.Цветоделение;
		//	КонецЦикла;
		//КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьФорму(ТекСтр,ЗаменаЦГ,ЗаменаКомплектаЦМИК)
	
	ВидПечати = ЗначениеРеквизита(ТекСтр.ВидСекции, "ВидПечати"); 
	
	Если  (Объект.Площадка = ГлЛико_Площадки.Урал ИЛИ Объект.Площадка = ГлЛико_Площадки.Сибирь) И ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Флексо") Тогда	
		Если ЗначениеЗаполнено(ТекСтр.форма) И НЕ ЗаменаЦГ Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Идентификатор", текстр.ПолучитьИдентификатор() );
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСозданииНовойФормы", ЭтаФорма,ДопПараметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Создать новый элемент справочника Формы?'"), Режим,0);
			// <-- Начало Лико Яцун С. В. 02.12.2025	
		ИначеЕсли ЗаменаЦГ И ТекСтр.типцвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.K") И НЕ ЗаменаКомплектаЦМИК Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Идентификатор", текстр.ПолучитьИдентификатор() );
			ДопПараметры.Вставить("ЗаменаЦГТипК", ЗаменаЦГ);
			Режим = РежимДиалогаВопрос.ДаНетОтмена;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСозданииНовойФормы", ЭтаФорма,ДопПараметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Если форма К используется для печати растра, необходимо перевывести весь комплект СМУК. Перевывести комплект?'"), Режим,0);
			// <-- Конец Лико Яцун С. В. 02.12.2025
		Иначе
			Если ЗаменаЦГ Тогда
				ТекСтр.типкраски = ПолучитьЦГПоКоду("3081");
			КонецЕсли;
			НоваяФорма = СоздатьНовуюФорму(ТекСтр.ВидСекции, ТекСтр.типцвета1, ТекСтр.типкраски, ТекСтр.название);
			текстр.форма = НоваяФорма;
			//Необходимо записать значение в табличную часть "Формы"
			УдалитьСтрокиПоКлючу(текстр.КлючСтроки,"Формы","КлючСтроки");  
			стрФ = Объект.Формы.Добавить();
			стрФ.Ключстроки = текстр.ключстроки;
			стрФ.Значение = НоваяФорма;  
			стрФ.Цветоделение = Истина;	
		КонецЕсли;
	ИначеЕсли ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Флексо") ИЛИ  ВидПечати =  ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Трафарет")  ИЛИ  ВидПечати =  ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Офсет") 
		ИЛИ ЗначениеРеквизита(ТекСтр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") Тогда 
		ДатаГлубокихФорм = ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм"),"ЗначениеПараметра");
		Если (ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() И ЗначениеРеквизита(ТекСтр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая"))
			ИЛИ ЗначениеРеквизита(ТекСтр.ВидСекции,"Родитель") <> ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") Тогда
			НоваяФорма = СоздатьНовуюФорму(ТекСтр.ВидСекции, ТекСтр.типцвета1, ТекСтр.типкраски, ТекСтр.название);
			текстр.форма = НоваяФорма;
			//Необходимо записать значение в табличную часть "Формы"
			УдалитьСтрокиПоКлючу(текстр.КлючСтроки,"Формы","КлючСтроки");  
			стрФ = Объект.Формы.Добавить();
			стрФ.Ключстроки = текстр.ключстроки;
			стрФ.Значение = НоваяФорма;  
			стрФ.Цветоделение = Истина;
		КонецЕсли;	
	КонецЕсли;
	Если ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Цифровая") И Не Объект.Площадка = ГлЛико_Площадки.Урал Тогда	 
		//Проверим, есть ли уже форма для этого заказа
		НоваяФорма = НайтиЦифровуюФормуПоЗаказу();
		Если Не ЗначениеЗаполнено(НоваяФорма)  Тогда
			НоваяФорма = СоздатьНовуюФорму(ТекСтр.ВидСекции, ТекСтр.типцвета1, ТекСтр.типкраски, ТекСтр.название);
		КонецЕсли;
		Для каждого стр из Объект.Цвета Цикл
			Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда
				Если стр.форма <> НоваяФорма Тогда 
					стр.форма = НоваяФорма;
					УдалитьСтрокиПоКлючу(стр.КлючСтроки,"Формы","КлючСтроки");  
					стриндиго = Объект.Формы.добавить();
					стриндиго.КлючСтроки = стр.ключстроки;	
					стриндиго.Значение = НоваяФорма;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСозданииНовойФормы(Результат, ДопПараметры)  Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		Если НЕ ДопПараметры.Свойство("ЗаменаЦГТипК") Тогда
			текстр = Объект.Цвета.НайтиПоИдентификатору(ДопПараметры.Идентификатор);
			НоваяФорма = СоздатьНовуюФорму(ТекСтр.ВидСекции, ТекСтр.типцвета1, ТекСтр.типкраски, ТекСтр.название);
			текстр.форма = НоваяФорма;
			//Необходимо записать значение в табличную часть "Формы"
			УдалитьСтрокиПоКлючу(текстр.КлючСтроки,"Формы","КлючСтроки");  
			стрФ = Объект.Формы.Добавить();
			стрФ.Ключстроки = текстр.ключстроки;
			стрФ.Значение = НоваяФорма;  
			стрФ.Цветоделение = Истина;
			// <-- Начало Лико Яцун С. В. 02.12.2025 
		КонецЕсли;
		Если ДопПараметры.Свойство("ЗаменаЦГТипК") Тогда
			Для каждого СтрЦМИК Из Объект.Цвета Цикл
				Если ЭтоЦМИК(СтрЦМИК.типцвета1) 
					И ЗначениеЗаполнено(СтрЦМИК.типкраски) 
					И ЗначениеРеквизита(СтрЦМИК.ВидСекции, "ВидПечати") = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Флексо")
					И СокрЛП(ЗначениеРеквизита(СтрЦМИК.типкраски,"Код")) <> "3081" Тогда
					СтрЦМИК.Цветоделение = Истина;
					СтрЦМИК.типкраски = ПолучитьЦГПоКоду("3081");
					ДопПараметры = Новый Структура;
					ДопПараметры.Вставить("Идентификатор", СтрЦМИК.ПолучитьИдентификатор());
					ПослеЗакрытияВопросаОСозданииНовойФормы(КодВозвратаДиалога.Да, ДопПараметры);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет И ДопПараметры.Свойство("ЗаменаЦГТипК") Тогда
		текстр = Объект.Цвета.НайтиПоИдентификатору(ДопПараметры.Идентификатор);
		текстр.Цветоделение = Истина;
		текстр.типкраски = ПолучитьЦГПоКоду("3081");
		НоваяФорма = СоздатьНовуюФорму(ТекСтр.ВидСекции, ТекСтр.типцвета1, ТекСтр.типкраски, ТекСтр.название);
		текстр.форма = НоваяФорма;
		//Необходимо записать значение в табличную часть "Формы"
		УдалитьСтрокиПоКлючу(текстр.КлючСтроки,"Формы","КлючСтроки");  
		стрФ = Объект.Формы.Добавить();
		стрФ.Ключстроки = текстр.ключстроки;
		стрФ.Значение = НоваяФорма;  
		стрФ.Цветоделение = Истина;	
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена И ДопПараметры.Свойство("ЗаменаЦГТипК") Тогда	
		текстр = Объект.Цвета.НайтиПоИдентификатору(ДопПараметры.Идентификатор);
		текстр.Цветоделение = Истина;
		// <-- Конец Лико Яцун С. В. 02.12.2025
	КонецЕсли;
    ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры	


&НаКлиенте
Процедура ОтгрузкиДокументОтгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Заказ", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПОслеВыбораОтгрузки", ЭтаФорма);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаВыбораДокументаОтгрузки", ДопПараметры, ЭтаФорма, ,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура  ПОслеВыбораОтгрузки(Результат, Параметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		стр = Элементы.Отгрузки.текущиеданные;
		стр.документотгрузки = результат;
		стр.дата = ЗначениеРеквизита(результат, "Дата");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОБЗ(Команда)
	ВыполняемаяОбработка=НайтиВПФ("Печатная форма ""Офисный бланк заказа""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ПечатнаяФормаОфисныйБланкЗаказа";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия); 

КонецПроцедуры

&НаКлиенте
Процедура ВБЗ(Команда)
	ВыполняемаяОбработка=НайтиВПФ("Печатная форма ""Внутренний бланк заказа""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
	ОбъектыНазначения = Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОбъектыНазначения", ОбъектыНазначения);
	
	
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыОткрытия);

КонецПроцедуры   

&НаКлиенте
Процедура ВБЗпросмотр(Команда)
	
	ИдентификаторКоманды = "ПечатнаяФормаВнутреннийБланкЗаказа"; 
	
	ОбъектыНазначения = Новый Массив;       
	ОбъектыНазначения.Добавить(Объект.Ссылка);

	
	ВыполняемаяОбработка=НайтиВПФ("Печатная форма ""Внутренний бланк заказа""");
	
	ПараметрыОткрытия                                         = Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных                          = ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника                      = Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды = ИдентификаторКоманды;
    ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения 	  = ОбъектыНазначения;


	ФормаПечатиВБЗ = ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия);
	ФормаПечатиВБЗ.Заголовок = "ВБЗ - " + Объект.НомерБезПрефикса;
		
КонецПроцедуры


&НаКлиенте
Процедура ПеремоткаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		текстр = Элементы.Перемотка.ТекущиеДанные;
		текстр.ТипОперации = ПредопределенноеЗначение("Перечисление.Лико_ТипыОперацийПеремотки.Перемотка");
		текстр.коэффициентперемотки = Объект.КоэффициентПеремотки;
		текстр.Нарезка = ?(ЗначениеЗаполнено(Объект.НарезкаФакт), Объект.НарезкаФакт, Объект.Нарезка);

	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПеремоткаКоличествоПМПриИзменении(Элемент)
	текстр = Элементы.Перемотка.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.нарезка) Тогда 
		текстр.количество = текстр.КоличествоПМ*ПОлучитьНарезкуНаСервере(текстр.нарезка);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаОснасткаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	текстр = Элементы.Цвета.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	Обработка = НайтиВПФ("Обработка ""Штампер""");
	Если Обработка <> Неопределено Тогда 
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		Если ЗначениеЗаполнено(текстр.ВидСекции) Тогда 
			ПараметрыОткрытия.Вставить("ВидРабот",ЗначениеРеквизита(текстр.ВидСекции, "ВидРабот"));
		КонецЕсли;
		Если ЗначениеЗаполнено(текстр.Рабочийцентр) Тогда 
			ПараметрыОткрытия.Вставить("РабочийЦентр", текстр.Рабочийцентр);
		КонецЕсли;
		
//Надо поменять на Площадку новую Иванова 20241003		
		Если ЗначениеЗаполнено(Объект.Площадка) Тогда 
			ПараметрыОткрытия.Вставить("Площадка", Объект.Площадка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(текстр.Оснастка) Тогда 
			ПараметрыОткрытия.Вставить("Оснастка",текстр.Оснастка );
		КонецЕсли;
				 
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаУпр", ПараметрыОткрытия,Элементы.ЦветаОснастка ,,,, Новый ОписаниеОповещения("ВыборЗавершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	текстр = Элементы.Цвета.ТекущиеДанные;
    ВидРабот = ЗначениеРеквизита(текстр.ВидСекции, "ВидРабот");
	Если РезультатЗакрытия <> Неопределено Тогда
		текстр.оснастка = РезультатЗакрытия;
		текстр.ВидОснастка = РезультатЗакрытия;
		ЗаписатьЦветаВРаботы(); 
		Если текстр.ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка")
			ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское")
			ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеСНумератором")
			ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Конгрев") Тогда 
			ЗаполнениеПараметровОснастки();
		КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузкаВТабаш(Команда)
	текстр = Элементы.Отгрузки.ТекущиеДанные;
	//Если текстр
	ТабДокумент = ВыгрузкаВТабашНаСервере(Объект.Ссылка, текстр.ключстроки);
	Если ТабДокумент<>Неопределено Тогда
		ТабДокумент.ТолькоПросмотр = Истина;
		ТабДокумент.АвтоМасштаб=Истина;
		ТабДокумент.ЭкземпляровНаСтранице=1;
		ТабДокумент.ОтображатьЗаголовки = Ложь;
		ТабДокумент.Показать();		
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ВыгрузкаВТабашПоПрокатам(Команда)
	текстр = Элементы.Отгрузки.ТекущиеДанные;
	//Если текстр
	ТабДокумент = ВыгрузкаВТабашНаСервере(Объект.Ссылка, текстр.ключстроки, Истина);
	Если ТабДокумент<>Неопределено Тогда
		ТабДокумент.ТолькоПросмотр = Истина;
		ТабДокумент.АвтоМасштаб=Истина;
		ТабДокумент.ЭкземпляровНаСтранице=1;
		ТабДокумент.ОтображатьЗаголовки = Ложь;
		ТабДокумент.Показать();		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыШтампа(Оснастка)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Номенклатура,
	|	Лико_ПараметрыШтампа.ТипШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка,
	|	Лико_ПараметрыШтампа.ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи,
	|	Лико_ПараметрыШтампа.Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.Цена,
	|	Лико_ПараметрыШтампа.Артикул
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Оснастка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.ШтампВырубной = Оснастка;
		Объект.ЭтикетокНаЛисте = Выборка.ЭтикетокНаЛисте;
		// <-- Начало Лико Яцун С. В. 21.01.2026
		Если НЕ НуженРасчетНарезки(Объект.ВидЗаказа) Тогда
		// <-- Конец Лико Яцун С. В. 21.01.2026	
			Объект.Нарезка = Выборка.Нарезка;
		ИначеЕсли НЕ (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) Тогда
			Объект.Нарезка = Неопределено;
		КонецЕсли;
		Объект.Ручьи = Выборка.Ручьи;
		Объект.Z = Выборка.Z;
		Объект.ДлинаЭтикетки = Выборка.ДлинаЭтикетки;
		Объект.ШиринаЭтикетки = Выборка.ШиринаЭтикетки;
		Объект.ШагПечати = Выборка.ШагПечати;
		// --> Начало Лико Митюшин МФМ 07.04.2021
		//Автоматическая замена ручьёв Печати при изменение параметров Штампа
		Объект.РучьиПечати = Выборка.Ручьи;
		// <-- Конец Лико Митюшин МФМ  07.04.2021
	КонецЦикла;	
	// --> Начало Лико Митюшин МФМ 31.03.2021
	ПроставитьВидВырубки(Ложь);
	текВидВырубки = Объект.ВидВырубки;
	Лико_ТиражМетраж.ОчиститьНеИспользуемыПараметрыШтампа(Объект ,текВидВырубки);	
	
	Если текВидВырубки = 1 ИЛИ текВидВырубки = 2 ИЛИ текВидВырубки = 4 ИЛИ текВидВырубки = 7 ИЛИ текВидВырубки = 8 ИЛИ текВидВырубки = 10 Тогда  
		ТекКоэфДеления = ?(Лико_ТиражМетраж.ЭтоКомлект(Объект), 0.5, 1);
		Объект.ЭтикетокНаЛисте = Объект.ЭтикетокНаЛисте * ТекКоэфДеления;
	КонецЕсли;
		
	Объект.ДлинаПечати 				= Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, текВидВырубки);

	// <-- Конец Лико Митюшин МФМ 31.03.2021
	Если Лико_ТиражМетраж.ЭтоПечатьНаИндиго(Объект, текВидВырубки) Тогда
		Объект.РучьиПечатиИндиго 	= Объект.РучьиПечати;
		Если Не(текВидВырубки = 9 ИЛИ текВидВырубки = 12) Тогда 
			Объект.РучьиПечати 			= 0;
		КонецЕсли;
	КонецЕсли;
	
	Если текВидВырубки = 13 Тогда 
		Объект.РучьиПечати 			= 	Объект.Ручьи * Объект.КоличествоЛистовКнижки;
	КонецЕсли;
	
	Если Не (текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 10 ИЛИ текВидВырубки = 15) Тогда
		Объект.ЭтикетокНаЛистеПечати 	= Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, текВидВырубки);
	КонецЕсли;
	
	//Если текВидВырубки <> 13 Тогда
		Объект.ЭтМЭР = Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, текВидВырубки);
	//КонецЕсли;
	
	Если текВидВырубки = 3 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 12  ИЛИ текВидВырубки = 14 Тогда
		Объект.КоличествоЭтПоДлинеПечати = Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечатиФлексо(Объект);
	КонецЕсли;
	
	
	//Если текВидВырубки = 13 Тогда
	//	Объект.ЭтМЭР = Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, текВидВырубки);
	//КонецЕсли;
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		Объект.КоличествоЭтПоДлинеПечатиИндиго = Лико_ТиражМетраж.ПолучитьЭтикетокПоДлинеПечатиИндиго(Объект, текВидВырубки);
	КонецЕсли;	
	
	Если текВидВырубки = 10 Тогда  
		Объект.КоличествоШтамповПоДлинеПечатиИндиго = ?(Объект.ШагПечати = 0, 0, Цел(0.98 / Объект.ШагПечати));
	КонецЕсли;	
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 10 ИЛИ текВидВырубки = 12 Тогда 
		Объект.ДлинаПечатиИндиго =  Лико_ТиражМетраж.ПолучитьДлинуПечатиИндиго(Объект, текВидВырубки)
	КонецЕсли;
	
	Если Не (текВидВырубки = 1 ИЛИ текВидВырубки = 3 ИЛИ текВидВырубки = 4 ИЛИ текВидВырубки = 5
		ИЛИ текВидВырубки = 7 ИЛИ текВидВырубки = 8 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 13 ИЛИ текВидВырубки = 14 ИЛИ текВидВырубки = 15) Тогда
		Объект.ЭтикетокНаЛистеИндиго 	= Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(Объект, текВидВырубки);
	КонецЕсли;

	Объект.ПлощадьКлише = Лико_ТиражМетраж.ПолучитьПлощадьКлише(Объект, текВидВырубки);
		
КонецПроцедуры	
 
&НаСервере
Процедура ЗаполнитьПараметрыШтампаТиснения(ДопПараметры)
	текстр = Объект.Цвета.НайтиПоИдентификатору(ДопПараметры.Идентификатор);
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Номенклатура КАК Номенклатура,
	|	Лико_ПараметрыШтампа.Нарезка КАК Нарезка,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.Подача = 0
	|			ТОГДА Лико_ПараметрыШтампа.ШагПечати
	|		ИНАЧЕ Лико_ПараметрыШтампа.Подача
	|	КОНЕЦ КАК Подача,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыШтампа.ЭтикетокВПодаче = 0
	|			ТОГДА Лико_ПараметрыШтампа.ЭтикетокНаЛисте
	|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокВПодаче
	|	КОНЕЦ КАК ЭтикетокВПодаче
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", ДопПараметры.Оснастка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текстр.Нарезка = Выборка.Нарезка;
		текстр.Подача = Выборка.Подача;
		Если Лико_ТиражМетраж.ЭтоКомлект(Объект.Ссылка) Тогда 
			текстр.ЭтикетокВПодаче = Выборка.ЭтикетокВПодаче/2;
		Иначе
			текстр.ЭтикетокВПодаче = Выборка.ЭтикетокВПодаче;
		КонецЕсли;
	КонецЦикла;	 

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПоверитьСоответствиеОснасткиВидыРабот(Оснастка, ВидРабот)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СправочникНоменклатура.Ссылка КАК Номенклатура,
	 |	Лико_ПараметрыШтампа.ВидРабот КАК ВидРабот
	 |ИЗ
	 |	Справочник.Номенклатура КАК СправочникНоменклатура
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	 |		ПО СправочникНоменклатура.Ссылка = Лико_ПараметрыШтампа.Номенклатура
	 |ГДЕ
	 |	СправочникНоменклатура.Ссылка = &Оснастка" ;
	Запрос.УстановитьПараметр("Оснастка", Оснастка);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.ВидРабот) Тогда 
		Если Результат.ВидРабот<>ВидРабот Тогда 
			Сообщить("Данный штамп не соответствует выбранному виду работ! Он предназначен для работы  "+ Результат.ВидРабот);
		    Возврат Ложь;
		Иначе 
			Возврат Истина;
		КонецЕсли;
	Иначе	
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаполненииПараметровШтампа(Результат, ДопПараметры)  Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЗаполнитьПараметрыШтампа(ДопПараметры);	
		РасчитатьТиражМетраж();
		ПоказатьДоходностьРентабельность();
	ИначеЕсли НуженРасчетНарезки(Объект.ВидЗаказа) И НЕ (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) Тогда 
		Объект.Нарезка = Неопределено;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаполненииПараметровШтампаТиснения(Результат, ДопПараметры)  Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЗаполнитьПараметрыШтампаТиснения(ДопПараметры);
	КонецЕсли;	
КонецПроцедуры	


&НаСервере
Процедура ЗаполнитьКоличествоКликов(текстр)
	////по просьбе Королевой К. если настройки нет, то фактические клики = расчетным
	////если настройка есть, то указываем все оставшиеся клики
	//ТекСтр.КоличествоКликов =0;
	//Если Не ЗначениеЗаполнено(текстр.Настройка) Тогда 
	//	текстр.количествокликов = текстр.РасчетноеКоличествоКликов;
	//Иначе
	//	ВсегоКликов = Объект.ПервыйПрокат.Итог("ВсегоКликов");
	//	УчтеноКликов = Объект.Отгрузки.Итог("КоличествоКликов");
	//	КликовКУчету = ВсегоКликов - УчтеноКликов;
	//    текстр.количествокликов = кликовкучету;
	//КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция ПолучитьФактическиеМетры()
	Количество = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Лико_ЗатратыПоОтгрузке.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.Лико_ЗатратыПоОтгрузке КАК Лико_ЗатратыПоОтгрузке
	|ГДЕ
	|	Лико_ЗатратыПоОтгрузке.ЗаказКлиента = &Заказ
	|	И Лико_ЗатратыПоОтгрузке.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)";
	Запрос.УстановитьПараметр("Заказ", Объект.ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Количество = Выборка.Количество;
	КонецЦикла;
	Возврат Количество;
		
КонецФункции	

&НаСервере 
Процедура ОбновитьИтогиВыпуска()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Лико_ВыпускГП.Количество) КАК Количество,
	|	СУММА(Лико_ВыпускГП.МетражКВМ) КАК МетражКВМ,
	|	СУММА(Лико_ВыпускГП.МетражПМ) КАК МетражПМ
	|ИЗ
	|	РегистрНакопления.Лико_ВыпускГП КАК Лико_ВыпускГП
	|ГДЕ
	|	Лико_ВыпускГП.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Объект.ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		ВыпускКВМ = Результат.МетражКВМ;
		ВыпускКоличество = Результат.Количество;
		ВыпускПМ =  Результат.МетражПМ;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьИтоги(Команда = Неопределено)
	ФактическиеКвМ =  ПолучитьФактическиеМетры();
	РасчетныеКвМ =    Объект.Отгрузки.Итог("ОбщийМетраж");
	Если ЗначениеЗаполнено(РасчетныеКвМ) Тогда 
		ПроцентПерерасхода = ФактическиеКвМ*100/РасчетныеКвМ-100; 
	КонецЕсли;	
	
	//Для каждого стр из Объект.Отгрузки Цикл 
	//	идентификатор = стр.ПолучитьИдентификатор();
	//	ЗаполнитьФактическиеДопМатериалы (идентификатор);
	//КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул",Новый Структура("Номенклатура", "Артикул"));
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		ТекущаяСтрока.НаименованиеДляДокументов = ЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "НаименованиеПолное");
		// <-- Начало Лико Яцун С. В. 26.06.2025 
		Если ЗначениеРеквизита(Объект.Партнер, "Лико_GtinВНоменклатуре") Тогда
			Лико_Gtin = СокрЛП(ЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "Лико_Gtin"));
			Если ЗначениеЗаполнено(Лико_Gtin) Тогда
				ТекущаяСтрока.Gtin = Лико_Gtin;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеРеквизита(Объект.Партнер, "Лико_КодЭтЗаказчикаВНоменклатуре") Тогда
			Лико_КодЭтикеткиЗаказчика = СокрЛП(ЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "Лико_КодЭтикеткиЗаказчика"));
			Если ЗначениеЗаполнено(Лико_КодЭтикеткиЗаказчика) Тогда
				ТекущаяСтрока.КодЭтикеткиЗаказчика = Лико_КодЭтикеткиЗаказчика;	
			КонецЕсли;
		КонецЕсли;
		БылОтветНаВопросПроверкиGtinИКодЭтикеткиЗаказчикаВНоменклатуре = Ложь;
		// <-- Конец Лико Яцун С. В. 26.06.2025  
	Иначе
		ТекущаяСтрока.НаименованиеДляДокументов = "";
		ТекущаяСтрока.Артикул = "";
	КонецЕсли;
	СкрытьЛишниеКнопкиДляНоменклатурыDFM(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.ДиаметрРоликаФакт = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	текстр = Элементы.Отгрузки.ТекущиеДанные;
	Если НоваяСтрока Тогда
		КлючСтроки = Новый УникальныйИдентификатор;
		текстр.КлючСтроки = КлючСтроки;
		текстр.рабочийцентр = объект.рабочийЦентр;
		Если ЗначениеЗаполнено(Объект.ОсновнойМатериалФакт) Тогда 
			текстр.ОсновнойМатериал = Объект.ОсновнойМатериалФакт;
		Иначе	
			текстр.ОсновнойМатериал = Объект.ОсновнойМатериал;
		КонецЕсли;	
	КонецЕсли;
	Если Не Копирование Тогда 
		Если Не ЗначениеЗаполнено(текстр.КодПостпечатныхРабот) Тогда 
			текстр.КодПостпечатныхРабот = ПолучитьКодПостПечатныхработ();
		КонецЕсли;	
	КонецЕсли;
	ОтгрузкиПриАктивизацииСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПоОтгрузкеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	текстр = Элементы.Отгрузки.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		Элемент.ТекущиеДанные.НомерОтгрузки = текстр.ключстроки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормыТрафаретыПолотнаНаСервере(Идентификатор)
	текстр = Объект.Отгрузки.НайтиСтроки(Новый Структура("КлючСтроки", Идентификатор))[0];
	аналоговые = 0;
	Цифровые = 0;
	ВысокаяПечать = 0;
	ОфсетнаяПечать = 0;
	ГлубокаяПечать = 0;
	НовыхСеток = 0;
	ПолотноОфсетное = 0;
	ПолотноДляТиснения = 0;
	Для каждого стр из Объект.ИзготовлениеФорм Цикл
		Если стр.ВидФормы = перечисления.Лико_ВидыФорм.Аналоговые Тогда 
			аналоговые  = аналоговые+стр.КоличествоНовых+стр.КоличествоПеределок;
		ИначеЕсли стр.ВидФормы = перечисления.Лико_ВидыФорм.Цифровые Тогда 
			Цифровые  = Цифровые+стр.КоличествоНовых+стр.КоличествоПеределок;
		ИначеЕсли стр.ВидФормы = перечисления.Лико_ВидыФорм.ВысокаяПечать Тогда 
			ВысокаяПечать  = ВысокаяПечать+стр.КоличествоНовых+стр.КоличествоПеределок;
		ИначеЕсли стр.ВидФормы = перечисления.Лико_ВидыФорм.ОфсетнаяПечать Тогда 
			ОфсетнаяПечать  = ОфсетнаяПечать+стр.КоличествоНовых+стр.КоличествоПеределок;
		ИначеЕсли стр.ВидФормы = перечисления.Лико_ВидыФорм.ГлубокаяПечать Тогда 
			ГлубокаяПечать  = ГлубокаяПечать+стр.КоличествоНовых+стр.КоличествоПеределок;
		КонецЕсли;
	КонецЦикла;
	КоличествоЗасветок = 0;
	Для каждого стр из Объект.ЗасветкаStork Цикл
		Если стр.Засветка Тогда
			КоличествоЗасветок = КоличествоЗасветок+1;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого стр из Объект.ТрафСетки Цикл
		НовыхСеток = НовыхСеток+ стр.НовыхСеток;
	КонецЦикла;
	

	// --> Начало Лико Ефимов ЕВВ 28.06.2018
	ЗаполнитьКоличествоКоробокИРоликовИзДокументовОтгрузок();	
	// <-- Конец Лико Ефимов ЕВВ 28.06.2018
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаОтгрузки" Тогда 
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
			ОбновитьИтогиОтгрузки();
			ОбновитьИтоги();
			Для каждого стр из Объект.Отгрузки Цикл
				стр.кодматериала =ПОлучитьКодМатериалаНаСервере(стр.ОсновнойМатериал);

			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Процедура ОбновитьИтогиОтгрузки()
	Заказано    = Объект.Товары.Итог("Количество");
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Лико_Отгрузки.Количество) КАК Количество,
	|	СУММА(Лико_Отгрузки.МетражКВМ) КАК МетражКВМ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.Лико_Отгрузки КАК Лико_Отгрузки
	|ГДЕ
	|	Лико_Отгрузки.Заказ = &Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Лико_Отгрузки2Обороты.КоличествоОборот + Лико_Отгрузки2Обороты.КоличествоСписаноОборот),
	|	СУММА(Лико_Отгрузки2Обороты.МетражКВМОборот + Лико_Отгрузки2Обороты.МетражКВМСписаноОборот)
	|ИЗ
	|	РегистрНакопления.Лико_Отгрузки2.Обороты(, , , Заказ = &Заказ) КАК Лико_Отгрузки2Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.Количество) КАК Количество,
	|	СУММА(ВТ.МетражКВМ) КАК МетражКВМ
	|ИЗ
	|	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Отгружено    	= Результат.Количество;
    	ОтгруженоКвМ = Результат.МетражКВМ;
	КонецЕсли;	
		
КонецПроцедуры


&НаСервере  
Функция НайтиЗаказНаОснастку()
	ЗаказНаОснастку = Документы.Лико_ЗаказОснастки.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ЗаказОснасткиОснастка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
	|ГДЕ
	|	Лико_ЗаказОснасткиОснастка.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Если ЗначениеЗаполнено(Результат.Ссылка) ТОгда
			ЗаказНаОснастку =  Результат.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат ЗаказНаОснастку;		
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеРеквизитовДляЗаказаНаОснастку()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказКлиентаЦвета.Оснастка КАК Оснастка,
	               |	ЗаказКлиентаЦвета.ЗаказНовойОснастки КАК ЗаказНовойОснастки
	               |ИЗ
	               |	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	               |ГДЕ
	               |	ЗаказКлиентаЦвета.Ссылка = &Заказ
	               |	И (НЕ ЗаказКлиентаЦвета.Оснастка ЕСТЬ NULL
	               |				И ЗаказКлиентаЦвета.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ИЛИ ЗаказКлиентаЦвета.ЗаказНовойОснастки)"	;
	Запрос.УстановитьПараметр("Заказ",Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Ложь
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура СоздатьЗаказНаОснастку(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли;	
	Если ПроверитьЗаполнениеРеквизитовДляЗаказаНаОснастку() Тогда
		ЗаказНаОснастку = НайтиЗаказНаОснастку();
		Если ЗначениеЗаполнено(ЗаказНаОснастку) ТОгда		
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОНаличииЗаказаНаОснастку", ЭтаФорма, Параметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Для данного заказ покупателя уже есть заказ оснастки. Создать еще один?'"), Режим,0);
		Иначе	
			ПараметрыЗаполнения = Новый Структура("Основание", Объект.Ссылка);
			ОткрытьФорму("Документ.Лико_ЗаказОснастки.Форма.ФормаДокумента", ПараметрыЗаполнения);
		КонецЕсли;
	Иначе
		Сообщить("Для заказа Оснастки заполните поле ""Оснастка"" (для Перезаказа), либо поле ""Нов"" (для заказа Новой оснастки)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОНаличииЗаказаНаОснастку(Результат, ДопПараметры)  Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
   	Иначе	
		ПараметрыЗаполнения = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.Лико_ЗаказОснастки.Форма.ФормаДокумента", ПараметрыЗаполнения);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьНаличиеОснастки(Команда)
	ВыполняемаяОбработка=НайтиВПФ("Отчет ""Проверка оснастки""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
	ДопПараметры = Новый Структура("Заказ", Объект.Ссылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма",ДопПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказыОснастки(Команда)
	ПараметрыФормы    = новый Структура("Заказ", Объект.Ссылка);
	ОткрытьФорму("Документ.Лико_ЗаказОснастки.ФормаСписка", ПараметрыФормы,,,,,,
						РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокОтличийПланФакт() 
	
	СписокОтличий = "";
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	
	"ВЫБРАТЬ
	|	Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.Ссылка КАК Заказ,
	|	ВЫБОР
	|		КОГДА Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.ОсновнойМатериал.ЦеноваяГруппа.Код
	|		ИНАЧЕ Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента.ОсновнойМатериал.Код
	|	КОНЕЦ КАК ЦГКодПлан,
	|	"" основного материала "" КАК Описание,
	|	"""" КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|			ТОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа.Код
	|		ИНАЧЕ Лико_ЗатратыПоЗаказуОбороты.Затрата.Код
	|	КОНЕЦ КАК ЦГКодФакт
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиентаОМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
	|				,
	|				,
	|				,
	|				ЗаказКлиента = &заказ
	|					И ВидНастроечногоМатериала = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)) КАК Лико_ЗатратыПоЗаказуОбороты
	|		ПО ЗаказКлиентаОМ.Ссылка = Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента
	|			И (ВЫБОР
	|				КОГДА ЗаказКлиентаОМ.ОсновнойМатериал ССЫЛКА Справочник.ЦеновыеГруппы
	|					ТОГДА ВЫБОР
	|							КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|								ТОГДА ЗаказКлиентаОМ.ОсновнойМатериал <> Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа
	|							ИНАЧЕ ЗаказКлиентаОМ.ОсновнойМатериал <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|							ТОГДА ЗаказКлиентаОМ.ОсновнойМатериал <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|						ИНАЧЕ ЗаказКлиентаОМ.ОсновнойМатериал.ЦеноваяГруппа <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|					КОНЕЦ
	|			КОНЕЦ)
	|ГДЕ
	|	ЗаказКлиентаОМ.Ссылка = &Заказ
	|	И ВЫБОР
	|			КОГДА ЗаказКлиентаОМ.ОсновнойМатериал ССЫЛКА Справочник.ЦеновыеГруппы
	|				ТОГДА ВЫБОР
	|						КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|							ТОГДА ЗаказКлиентаОМ.ОсновнойМатериал <> Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа
	|						ИНАЧЕ ЗаказКлиентаОМ.ОсновнойМатериал <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ЗаказКлиентаОМ.ОсновнойМатериал <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|					ИНАЧЕ ЗаказКлиентаОМ.ОсновнойМатериал.ЦеноваяГруппа <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|				КОНЕЦ
	|		КОНЕЦ
	|	И Лико_ЗатратыПоЗаказуОбороты.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаВидыРабот.Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаВидыРабот.Материал ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЗаказКлиентаВидыРабот.Материал.ЦеноваяГруппа.Код
	|		ИНАЧЕ ЗаказКлиентаВидыРабот.Материал.Код
	|	КОНЕЦ,
	|	"" материалов"",
	|	ЗаказКлиентаВидыРабот.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|			ТОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа.Код
	|		ИНАЧЕ Лико_ЗатратыПоЗаказуОбороты.Затрата.Код
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
	|				,
	|				,
	|				,
	|				ЗаказКлиента = &заказ
	|					И ВидНастроечногоМатериала = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПустаяСсылка)) КАК Лико_ЗатратыПоЗаказуОбороты
	|		ПО ЗаказКлиентаВидыРабот.Ссылка = Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента
	|			И ЗаказКлиентаВидыРабот.ВидСекции = Лико_ЗатратыПоЗаказуОбороты.ВидСекции
	|			И ЗаказКлиентаВидыРабот.НомерРаботы = Лико_ЗатратыПоЗаказуОбороты.НомерРаботы
	|			И (ВЫБОР
	|				КОГДА ЗаказКлиентаВидыРабот.Материал ССЫЛКА Справочник.ЦеновыеГруппы
	|					ТОГДА ВЫБОР
	|							КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|								ТОГДА ЗаказКлиентаВидыРабот.Материал <> Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа
	|							ИНАЧЕ ЗаказКлиентаВидыРабот.Материал <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Лико_ЗатратыПоЗаказуОбороты.Затрата ССЫЛКА Справочник.Номенклатура
	|							ТОГДА ЗаказКлиентаВидыРабот.Материал <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|						ИНАЧЕ ЗаказКлиентаВидыРабот.Материал.ЦеноваяГруппа <> Лико_ЗатратыПоЗаказуОбороты.Затрата
	|					КОНЕЦ
	|			КОНЕЦ)
	|			И ЗаказКлиентаВидыРабот.НомерПроката = Лико_ЗатратыПоЗаказуОбороты.НомерПроката
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	|	И ЗаказКлиентаВидыРабот.Материал <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|	И ЗаказКлиентаВидыРабот.Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ЗаказКлиентаВидыРабот.Материал <> НЕОПРЕДЕЛЕНО
	|	И Лико_ЗатратыПоЗаказуОбороты.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы)";

	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ЦГКодПлан <> Выборка.ЦГКодФакт Тогда
			СписокОтличий = СписокОтличий + "Различаются плановая "+ СокрЛП(Выборка.ЦГКодПлан)+ " и фактическая ценовая группа " + СокрЛП(Выборка.ЦГКодФакт) + Выборка.Описание  + символы.ПС;
		КонецЕсли;		
	КонецЦикла;	
	
	

	Возврат  СписокОтличий
	
КонецФункции	

&НаСервере
Функция СоздатьПовторЗаказаНаСервере(ВидЗаказа, Регион = Неопределено, ЗаменитьКоды = Ложь,Различия)
	УстановитьПривилегированныйРежим(Истина);
	НовыйЗаказ = Объект.Ссылка.скопировать();
	НовыйЗаказ.Руководитель = Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка();
	НовыйЗаказ.ГлавныйБухгалтер = Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка();
	
	//ОчиститьПараметрыНамотки(НовыйЗаказ);
	//НовыйЗаказ.Версия = 0;
	// <-- Начало Лико Яцун С. В. 30.10.2025 
	Если ВидЗаказа = "ПолныйПовторСТекНомером" Тогда
		НовыйЗаказ.ПовторЗаказа = Объект.Ссылка;
		ВидЗаказа = "ПолныйПовтор";
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 30.10.2025 
	НовыйЗаказ.ВидЗаказа =  Перечисления.Лико_ВидыЗаказов[ВидЗаказа];

	Если НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор 
		И НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПовторСНовымОбъединением
		И НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПовторСИзменением
		И НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовторСПереводомНаДругуюМашину
		И НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.СложныйПовтор Тогда
		НовыйЗаказ.СвойстваМатериала = Неопределено;	
	КонецЕсли;
	Если НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор 
		И НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПовторСИзменением Тогда
		НовыйЗаказ.ЗаказчикЭмиссииЧЗ = Неопределено;	
		НовыйЗаказ.ЭмитентЧЗ = Неопределено;	
		НовыйЗаказ.СтранаТовараЧЗ = Неопределено;	
		НовыйЗаказ.ТипКодаЧЗ = Неопределено;	
		НовыйЗаказ.ТипМаркировкиЧЗ = Неопределено;	
	КонецЕсли;

    // <-- Начало Лико Яцун С. В. 21.01.2026
	Если НуженРасчетНарезки(НовыйЗаказ.ВидЗаказа) Тогда
		Если НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
			НовыйЗаказ.РучнойВводНарезки = Неопределено;	
		КонецЕсли;
		Если ЗначениеЗаполнено(НовыйЗаказ.ШтампВырубной) Тогда 
			НовыйЗаказ.НарезкаРасчетная = Неопределено;
			НовыйЗаказ.Нарезка = Неопределено;
		КонецЕсли; 
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 21.01.2026
	
	// <-- Начало Лико Яцун С. В. 28.08.2024   
	Если НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Новый ИЛИ НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Шаблон Тогда
		НовыйЗаказ.Формы.Очистить();
		Для каждого Стр Из НовыйЗаказ.Цвета Цикл
			// --> Начало Лико Ефимов ЕВВ 20.06.2025
			Если Лико_Дополнительно.ЭтоСтрокаСплошнойФормы(Стр) Тогда
				Продолжить;
			КонецЕсли; 
			// <-- Конец Лико Ефимов ЕВВ 20.06.2025
			Стр.Вал = Неопределено;
			Стр.Форма = Неопределено;
		КонецЦикла;
	// --> Начало Лико Ефимов ЕВВ 16.09.2024
	ИначеЕсли НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.НовыйССохранениемФорм Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_БланкЭтапа.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Лико_БланкЭтапа КАК Лико_БланкЭтапа
			|ГДЕ
			|	Лико_БланкЭтапа.ЗаказПокупателя = &ЗаказПокупателя
			|	И Лико_БланкЭтапа.Проведен
			|	И НЕ Лико_БланкЭтапа.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", Объект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		ПоЗаказуНетЗакрытий = РезультатЗапроса.Пустой();

		Для каждого Стр из НовыйЗаказ.Цвета Цикл
			Стр.ЗаказФорм = Объект.Ссылка;
			Если ПоЗаказуНетЗакрытий Тогда 
				Стр.Форма = Неопределено;
			КонецЕсли;
		КонецЦикла;
	// <-- Конец Лико Ефимов ЕВВ 16.09.2024
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 28.08.2024
	// --> Начало Лико Ефимов ЕВВ 03.04.2024
	Если НовыйЗаказ.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
		НовыйЗаказ.ДействиеСИзлишками = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(НовыйЗаказ.ДействиеСИзлишками) И ЗначениеЗаполнено(Объект.ДействиеСИзлишками) Тогда // Для полного повтора заполним обратно, если при копировании очистили
		НовыйЗаказ.ДействиеСИзлишками = Объект.ДействиеСИзлишками;
	КонецЕсли;
	Если НовыйЗаказ.ЧестныйЗнак И Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(,НовыйЗаказ.Партнер,"УтилизироватьИзлишкиДляЧЗ",Ложь) Тогда
		НовыйЗаказ.ДействиеСИзлишками = Перечисления.Лико_ДействияСИзлишками.Утилизировать;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 03.04.2024
	
	// --> Начало Лико Митюшин МФМ 09.03.2021
	//ОчиститьПараметрыОтВидаЗаказа(НовыйЗаказ.ВидЗаказа);
	// <-- Конец Лико Митюшин МФМ 09.03.2021
	//НовыйЗаказ.РазрешитьОтрицательнуюДоходность = Ложь;

	Если Регион<>Неопределено Тогда 
		НовыйЗаказ.Регион = Регион;
	КонецЕсли;
	
	Если НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПричинаРекламация Тогда
		НовыйЗаказ.Номер = Лев(Объект.Номер, 6)+"7"+Прав(Объект.Номер, 4);
		НовыйЗаказ.Менеджер = Объект.Менеджер;
		НовыйЗаказ.ИсходныйЗаказ = Объект.Ссылка;
	ИначеЕсли НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка Тогда
		НовыйЗаказ.Номер = Лев(Объект.Номер, 6)+"8"+Прав(Объект.Номер, 4);	
		НовыйЗаказ.Менеджер = Объект.Менеджер;
		НовыйЗаказ.ИсходныйЗаказ = Объект.Ссылка;
	КонецЕсли;	
	//НовыйЗаказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	//НовыйЗаказ.способдоставки = Перечисления.СпособыДоставки.Самовывоз;
	Если Не ЗначениеЗаполнено(НовыйЗаказ.НалогообложениеНДС) Тогда 
		НовыйЗаказ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; 
	КонецЕсли;	
	Если ЗаменитьКоды Тогда 
		
		//+ Субботин 11.01.2022
		//Различия - массив Структур("Название, НомерСтроки, Факт"); 
		Для Каждого стр из Различия цикл 
			  
			Если стр.Название = "Основной материал" Тогда 
				НовыйЗаказ.ОсновнойМатериал = стр.Факт;				
			КонецЕсли;   
			
			Если стр.Название = "Тип краски (Цвета)" Тогда 
				НовыйЗаказ.Цвета[стр.НомерСтроки-1].ТипКраски = стр.Факт;
				//НовыйЗаказ.Цвета[стр.НомерСтроки-1].ТипКраскиФакт = Неопределено;
			КонецЕсли;		
			
			Если лев(стр.Название, 8) = "Материал" Тогда 
				НовыйЗаказ.Цвета[стр.НомерСтроки-1].Материал = стр.Факт; 
				//НовыйЗаказ.Цвета[стр.НомерСтроки-1].МатериалФакт = Неопределено;
			КонецЕсли;   
			
			Если лев(стр.Название, 4) = "Клей" Тогда 
				//НовыйЗаказ.ВидыРабот[стр.НомерСтроки-1].Клей = стр.Факт;
				//НовыйЗаказ.ВидыРабот[стр.НомерСтроки-1].КлейФакт = Неопределено;
			КонецЕсли;
			
		КонецЦикла;
		//- Субботин 11.01.2022
		
	КонецЕсли;
	//Подсистема DFM
	НовыйЗаказ.НоменклатураDFM=DFMСервер.ЭтоНоменклатураDFM(
	НовыйЗаказ.РабочийЦентр,
	НовыйЗаказ.ТипЗаказа,
	ДатаНачалаСозданияНоменклатурыDFM И Объект.Цвета.Количество()>0,
	НовыйЗаказ.ДатаПервойОтправкиВРаботу,
	Объект.Товары.Выгрузить(),
	НовыйЗаказ.Партнер);
	ПроверитьНоменклатуруDFM(НовыйЗаказ.Товары,НовыйЗаказ.РабочийЦентр);  
	//Подсистема DFM
	
	НовыйЗаказ.Записать();
	НовыйЗаказ.НомерБезПрефикса = Прав(НовыйЗаказ.Номер,7);
	НовыйЗаказ.Записать();
	Возврат НовыйЗаказ.ссылка;
	УстановитьПривилегированныйРежим(Ложь);

КонецФункции


&НаКлиенте
Процедура СоздатьПовторЗаказа(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли;	

	ВидПовтора = Сред(Команда.Имя, 8);
	//ПодключитьОбработчикОжидания("ПредупредитьОбИзменениях", 0.1, Истина);
	
	СписокОтличий = ПолучитьСписокОтличийПланФакт();
	Если ЗначениеЗаполнено(СписокОтличий)  Тогда 
		//Режим = РежимДиалогаВопрос.ДаНет;
		//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаменеКодов", ЭтотОбъект, ВидПовтора);
		//ПоказатьВопрос(Оповещение,СписокОтличий+  НСтр("ru = 'Заменить плановые значения на фактические?';"), Режим, 0);
		
		//+ Субботин 11.01.22
		ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СписокОтличийПовтор""");
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
		ПараметрыНаФорму = Новый Структура;  
////Надо поменять на Площадку новую Иванова 20241003		
		ПараметрыНаФорму.Вставить("Площадка", Объект.Площадка);	
		ПараметрыНаФорму.Вставить("Ссылка", Объект.Ссылка);
		ОбработкаЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияОбработкиСписокОтличийПовтор", ЭтотОбъект, ВидПовтора);			
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыНаФорму ,ЭтаФорма,,,,ОбработкаЗакрытия);
		//-	Субботин 11.01.22
				
	Иначе
	
		Если ПроверитьДоступностьНаСервере("Лико_ДобавлениеИзменениеЗаказовПоПлощадке")
			ИЛИ ПроверитьДоступностьНаСервере("ПолныеПрава")
			// --> Начало Лико Ефимов ЕВВ 17.09.2024
			// письмо 17.09.24 15:13
			ИЛИ Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("ПараметрыСеанса.ТекущийПользователь.Наименование") = "Горе Марина Вадимовна"
			ИЛИ Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("ПараметрыСеанса.ТекущийПользователь.Наименование") = "Сергеева Марина"
			// <-- Конец Лико Ефимов ЕВВ 17.09.2024
			Тогда 
			ПараметрыСоздания = Новый Структура;
			ПараметрыСоздания.Вставить("ВидПовтора",ВидПовтора);
			ПараметрыСоздания.Вставить("ЗаменитьКоды",Ложь);  
			ПараметрыСоздания.Вставить("Различия", Неопределено);

			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРегионаДляСозданияПовтора",ЭтотОбъект,ПараметрыСоздания);
			ПоказатьВводЗначения(ОписаниеОповещения, Неопределено, , Тип("СправочникСсылка.БизнесРегионы"));
		Иначе
			Повтор = СоздатьПовторЗаказаНаСервере(ВидПовтора, ,Ложь,);	
			ПараметрыФормы    = новый Структура("Ключ,ЗаказКопирования",Повтор,Объект.Ссылка);
			ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);
		//ЭтаФорма.Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияОбработкиСписокОтличийПовтор(Результат, ВидПовтора) Экспорт
	
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если  Результат.Количество() <> 0 Тогда 
		ЗаменитьКоды = Истина;
	Иначе
		ЗаменитьКоды = Ложь;
	КонецЕсли;

	Если ПроверитьДоступностьНаСервере("Лико_ДобавлениеИзменениеЗаказовПоПлощадке")
		ИЛИ ПроверитьДоступностьНаСервере("ПолныеПрава")
		// --> Начало Лико Ефимов ЕВВ 17.09.2024
		// письмо 17.09.24 15:13
		ИЛИ Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("ПараметрыСеанса.ТекущийПользователь.Наименование") = "Горе Марина Вадимовна"
		ИЛИ Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("ПараметрыСеанса.ТекущийПользователь.Наименование") = "Сергеева Марина"
		// <-- Конец Лико Ефимов ЕВВ 17.09.2024
		Тогда 
		ПараметрыСоздания = Новый Структура;
		ПараметрыСоздания.Вставить("ВидПовтора", ВидПовтора);
		ПараметрыСоздания.Вставить("ЗаменитьКоды", ЗаменитьКоды); 
		ПараметрыСоздания.Вставить("Различия", Результат);

		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРегионаДляСозданияПовтора",ЭтотОбъект, ПараметрыСоздания);
		ПоказатьВводЗначения(ОписаниеОповещения, Неопределено, , Тип("СправочникСсылка.БизнесРегионы"));
	Иначе
		Повтор = СоздатьПовторЗаказаНаСервере(ВидПовтора,, ЗаменитьКоды,Результат);	                               
		ПараметрыФормы    = новый Структура("Ключ,ЗаказКопирования",Повтор,Объект.Ссылка);
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);
	КонецЕсли;


КонецПроцедуры


&НаСервере
Процедура ОчиститьПараметрыНамотки(Заказ)
	Если Заказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник И Заказ.Площадка.Организация = Справочники.Лико_Площадки.Ликофлекс.Организация Тогда
		Для Каждого стр Из Заказ.Товары Цикл
			стр.Направление = Справочники.Лико_Намотка.ПустаяСсылка();
			стр.ВнутреннийДиаметр = Справочники.Лико_Втулки.ПустаяСсылка();
			стр.МаксимальныйДиаметрРулона = 0;
			стр.КоличествоЭтикетокВРолике = 0;
			стр.ДиаметрРоликаФакт = 0;
			стр.ПродольнаяРезка = Ложь;
			стр.ПоперечнаяРезка = Ложь;
			стр.Кромка = 0;
			стр.БезКромки = Ложь;
			стр.ПодрезкаКромки = Ложь;
			стр.Город = "";
			стр.ДопЭтикетокВРолике = 0;
		КонецЦикла;				
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьОбИзменениях()
	СписокОтличий = ПолучитьСписокОтличийПланФакт();
	Если ЗначениеЗаполнено(СписокОтличий)  Тогда 
		ПоказатьПредупреждение(, СписокОтличий);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаменеКодов(Результат, ВидПовтора) Экспорт
	Если  Результат =  КодВозвратаДиалога.Да Тогда 
		ЗаменитьКоды = Истина;
	Иначе
		ЗаменитьКоды = Ложь;
	КонецЕсли;

	Если ПроверитьДоступностьНаСервере("Лико_ДобавлениеИзменениеЗаказовПоПлощадке")
		ИЛИ ПроверитьДоступностьНаСервере("ПолныеПрава")
		// --> Начало Лико Ефимов ЕВВ 17.09.2024
		// письмо 17.09.24 15:13
		ИЛИ Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("ПараметрыСеанса.ТекущийПользователь.Наименование") = "Горе Марина Вадимовна"
		ИЛИ Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("ПараметрыСеанса.ТекущийПользователь.Наименование") = "Сергеева Марина"
		// <-- Конец Лико Ефимов ЕВВ 17.09.2024
		Тогда 
		ПараметрыСоздания = Новый Структура;
		ПараметрыСоздания.Вставить("ВидПовтора", ВидПовтора);
		ПараметрыСоздания.Вставить("ЗаменитьКоды",ЗаменитьКоды);

		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРегионаДляСозданияПовтора",ЭтотОбъект, ПараметрыСоздания);
		ПоказатьВводЗначения(ОписаниеОповещения, Неопределено, , Тип("СправочникСсылка.БизнесРегионы"));
	Иначе
		Повтор = СоздатьПовторЗаказаНаСервере(ВидПовтора,, ЗаменитьКоды,);	                               
		ПараметрыФормы    = новый Структура("Ключ,ЗаказКопирования",Повтор,Объект.Ссылка);
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);
	////ЭтаФорма.Закрыть();
	КонецЕсли;


КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораРегионаДляСозданияПовтора(ВыбЗнач, Параметры) Экспорт
    Если ВыбЗнач <> Неопределено Тогда
       	Повтор = СоздатьПовторЗаказаНаСервере(Параметры.ВидПовтора, ВыбЗнач, Параметры.ЗаменитьКоды, Параметры.Различия);	
		ПараметрыФормы    = новый Структура("Ключ,ЗаказКопирования",Повтор,Объект.Ссылка);
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОМ(Команда)
	ВыполняемаяОбработка=НайтиВПФ("Печатная форма ""Оригинал макет""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ПечатнаяФормаОригиналМакет";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия); 

КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиОсновнойМатериалПриИзменении(Элемент)
	Текстр = Элементы.Отгрузки.ТекущиеДанные;
 	Текстр.КодМатериала = ПОлучитьКодМатериалаНаСервере(Текстр.КодМатериала);
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Текстр = Элементы.Отгрузки.ТекущиеДанные;
 	Текстр.КодМатериала = ПОлучитьКодМатериалаНаСервере(Текстр.ОсновнойМатериал);
КонецПроцедуры

&НаСервере
Процедура ПроставитьВидВырубки(ПересчетПараметров)		// --> Начало Лико Митюшин МФМ 19.05.2021
	// <-- Начало Лико Яцун С. В. 01.12.2023   
	ВРежимеРедактированияПараметров = Ложь;
	Если Объект.ВидВырубки = 0 Тогда
		ВРежимеРедактированияПараметров = Истина;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 01.12.2023
	текВидВырубки = ПолучитьВидВырубкиНаСервере();
	Если Объект.ВидВырубки <> текВидВырубки Тогда
		Объект.ВидВырубки = текВидВырубки;
		ЗаполнитьПараметрыИРасчитатьМетражНаСервере(текВидВырубки, ПересчетПараметров, ВРежимеРедактированияПараметров); 
		Сообщить("Изменен вид вырубки, проверьте параметры вырубки / печати", СтатусСообщения.Информация); 
		// <-- Начало Лико Яцун С. В. 08.12.2023
		Если РазрешеноМенятьПараметрыШтампа И Объект.ВидВырубки <> 0 Тогда
			РазрешеноМенятьПараметрыШтампа = Ложь;
			Элементы.Лико_РедактироватьПараметрыШтампов.ЦветТекста = WebЦвета.ТемноСерый;
			ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 08.12.2023
	КонецЕсли;
КонецПроцедуры 		// <-- Конец Лико Митюшин МФМ 19.05.2021

&НаСервере
Процедура ЗаполнитьПараметрыИРасчитатьМетражНаСервере(текВидВырубки, ПересчетПараметров, ВРежимеРедактированияПараметров = Ложь)
	ЗаполнитьПараметрыПечати(Объект, текВидВырубки,, ПересчетПараметров,НЕ ВРежимеРедактированияПараметров);
	Лико_ТиражМетраж.РассчитатьМетражСВидомВырубки(Объект.Тираж*1000, Объект, текВидВырубки);	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВырубнойШтамп()
	Если ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда 
		строки = Объект.Цвета.НайтиСтроки(Новый Структура("Оснастка", Объект.ШтампВырубной));
		Если строки.количество() = 0 Тогда 
			Объект.ШтампВырубной = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			//ОчиститьВсеПараметрыШтампа();		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПечати(Заказ, текВидВырубки = Неопределено, СпецификацияСсылка = Неопределено, ПересчетПараметров = Ложь, ПересчитатьНарезку = Истина) Экспорт // --> Начало Лико Митюшин МФМ 18.05.2021

	Если текВидВырубки = 0 ИЛИ (РазрешеноМенятьПараметрыШтампа И ОмегаСНумератором()) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПересчетПараметров Тогда
		Лико_ТиражМетраж.ОчиститьНеИспользуемыПараметрыШтампа(Заказ, текВидВырубки)
	КонецЕсли;
	
	ДлинаСПрипуском = Неопределено;
	КоличествоПоДлинеРапорта = Неопределено;
	Если НЕ (текВидВырубки = 5 И ПересчетПараметров = Ложь ИЛИ текВидВырубки = 18 ИЛИ текВидВырубки = 19) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ШагПечати) И текВидВырубки = 7 И ЗначениеЗаполнено(Объект.ШтампВырубной) Тогда
			ПараметрыШтампаВырубки = ПолучитьВсеПараметрыШтампа(Объект.ШтампВырубной);
			Если ПараметрыШтампаВырубки.Количество() <> 0 И ЗначениеЗаполнено(ПараметрыШтампаВырубки.ШагПечати) Тогда
				Объект.ШагПечати = ПараметрыШтампаВырубки.ШагПечати;
			КонецЕсли;
		КонецЕсли;
		Объект.ДлинаПечати 				= Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, Объект.ВидВырубки);
	КонецЕсли;
	Если текВидВырубки = 18 ИЛИ текВидВырубки = 19 Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДопускМинус) И НЕ ЗначениеЗаполнено(Объект.ДопускПлюс) Тогда
			ВариантыДопусков = Неопределено;		
		КонецЕсли;
		РасчетнаяНарезкаДанные = ПолучитьРасчетнуюНарезку();
		Объект.НарезкаРасчетная = РасчетнаяНарезкаДанные.РасчетнаяНарезкаСсылка;
		Если НЕ ЗначениеЗаполнено(Объект.Нарезка) Тогда
			Объект.Нарезка = РасчетнаяНарезкаДанные.РасчетнаяНарезкаСсылка;
		КонецЕсли;
		ЗаполнитьРаппорт();
		Если ПересчитатьНарезку И НЕ Объект.РучнойВводНарезки Тогда
			Объект.Нарезка = РасчетнаяНарезкаДанные.РасчетнаяНарезкаСсылка;
			ЗаполнитьРаппорт();
		КонецЕсли;
		Если текВидВырубки = 18 Тогда
			Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ШиринаЭтикетки/1000)); 
		ИначеЕсли текВидВырубки = 19 Тогда
			Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ДлинаЭтикетки/1000)); 
		КонецЕсли;
		Объект.ПлощадьКлише = Лико_ТиражМетраж.ПолучитьПлощадьКлише(Объект, текВидВырубки);
	КонецЕсли;
	Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере();
	
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 18.05.2021 

&НаСервереБезКонтекста
Функция ПолучитьВсеПараметрыШтампа(Оснастка)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Номенклатура,
	|	Лико_ПараметрыШтампа.ТипШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка,
	|	Лико_ПараметрыШтампа.ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи,
	|	Лико_ПараметрыШтампа.Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.Цена,
	|	Лико_ПараметрыШтампа.Артикул
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Оснастка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	ПараметрыШтампаструктура = Новый Структура;
	Пока Выборка.Следующий() Цикл
		ПараметрыШтампаструктура.Вставить("ЭтикетокНаЛисте",Выборка.ЭтикетокНаЛисте);
		ПараметрыШтампаструктура.Вставить("Нарезка",Выборка.Нарезка);
		ПараметрыШтампаструктура.Вставить("Ручьи",Выборка.Ручьи);
		ПараметрыШтампаструктура.Вставить("Z",Выборка.Z);
		ПараметрыШтампаструктура.Вставить("ДлинаЭтикетки",Выборка.ДлинаЭтикетки);
		ПараметрыШтампаструктура.Вставить("ШиринаЭтикетки",Выборка.ШиринаЭтикетки);
		ПараметрыШтампаструктура.Вставить("ШагПечати",Выборка.ШагПечати);
		ПараметрыШтампаструктура.Вставить("РучьиПечати",Выборка.Ручьи);
	КонецЦикла;
	
	Возврат ПараметрыШтампаструктура;

КонецФункции	

&НаСервере
Процедура ЗаполнитьРаппорт()
	Если Объект.РаппортМеняли Тогда
		Возврат;	
	КонецЕсли;
	РаппортДлинаПечати = Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, Объект.ВидВырубки);
	Если РаппортДлинаПечати <> Неопределено Тогда
		Объект.Раппорт = РаппортДлинаПечати.Раппорт;
		Объект.ДлинаПечати = РаппортДлинаПечати.ДлинаПечати;
	Иначе
		Объект.Раппорт = Неопределено;
		Объект.ДлинаПечати = 0;
		Объект.КоличествоЭтПоДлинеПечати = 0;
		Объект.ЭтикетокНаЛистеПечати = 0;
		Объект.ПлощадьКлише = 0; 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьРасчетнуюНарезку() // <-- Начало Лико Яцун С. В. 26.01.2026
	
	ДанныеВозврата = Новый Структура();
	текВидВырубки = Объект.ВидВырубки;
	РасчетнаяНарезкаСсылка = Справочники.ЯССМ_Нарезки.ПустаяСсылка();
	//ОМЕТ без вырубки
	Если текВидВырубки = 18 ИЛИ текВидВырубки = 19 Тогда
		
		Если текВидВырубки = 18 Тогда
			РасчетнаяНарезкаЗначениеБезОкругления = (Объект.ДлинаЭтикетки/1000) * Объект.РучьиПечати + 0.02;
		ИначеЕсли текВидВырубки = 19 Тогда
			РасчетнаяНарезкаЗначениеБезОкругления = (Объект.ШиринаЭтикетки/1000) * Объект.РучьиПечати + 0.025;
		КонецЕсли;
		
		РасчетнаяНарезкаЗначение = ЗарплатаКадрыКлиентСервер.Округлить(Цел(РасчетнаяНарезкаЗначениеБезОкругления*1000), 5,Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону);
		РасчетнаяНарезкаСсылка = Справочники.ЯССМ_Нарезки.НайтиПоНаименованию(РасчетнаяНарезкаЗначение);
		
		ДанныеВозврата.Вставить("РасчетнаяНарезкаСсылка",РасчетнаяНарезкаСсылка);
		ДанныеВозврата.Вставить("ТекстПараметры","");
		
		Возврат ДанныеВозврата;
	КонецЕсли;	
		
	//Другие варианты расчета с вырубкой
	
	СтрВырубка = Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.Вырубка));
	Для каждого ЗначМ Из СтрВырубка Цикл
		РЦВырубки = ЗначМ.РабочийЦентр;
		ВидРЦВырубки = РЦВырубки.ВидРабочегоЦентра;
	КонецЦикла;		
	
	
	ЭтоЦифровой = Ложь;
	ЕстьОмега = Ложь;
	ЕстьКартес = Ложь;
	ИксФойлБуфойлУчтено = Ложь;
	ВидРЦИндигоИЛИОмега = (ВидРЦ = Справочники.ВидыРабочихЦентров.Indigo ИЛИ ВидРЦ = Справочники.ВидыРабочихЦентров.Omega);
	ЦифраПослеОсновногоЦеха = Ложь;
	ЕстьГорячееТиснениеПлоское = Ложь;
	ЕстьГорячееТиснениеВРегистрПлоское = Ложь;
	ЕстьНумератор = Ложь;
	ЕстьКонгрев = Ложь;
	
	МатериалСтр = НРег(Строка(Объект.ОсновнойМатериал));
	ИксФойл = Найти(МатериалСтр,"икс-фойл") > 0;
	Буфойл = Найти(МатериалСтр,"буфойл") > 0;

	Для каждого СтрЦ из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(СтрЦ.РабочийЦентр) Тогда
			СтрЦВидРЦ = СтрЦ.РабочийЦентр.ВидРабочегоЦентра;
			Если СтрЦВидРЦ = Справочники.ВидыРабочихЦентров.Indigo Тогда  
				ЭтоЦифровой = Истина;
			КонецЕсли;  
			Если СтрЦВидРЦ = Справочники.ВидыРабочихЦентров.Omega Тогда  
				ЕстьОмега = Истина;
			КонецЕсли;  
			Если СтрЦВидРЦ = Справочники.ВидыРабочихЦентров.Cartes Тогда  
				ЕстьКартес = Истина;
			КонецЕсли;  
			Если СтрЦ.НомерПроката > 1
				И (СтрЦВидРЦ = Справочники.ВидыРабочихЦентров.Indigo 
				ИЛИ СтрЦВидРЦ = Справочники.ВидыРабочихЦентров.Omega)
				И (ВидРЦ <> Справочники.ВидыРабочихЦентров.Indigo 
				И ВидРЦ <> Справочники.ВидыРабочихЦентров.Omega)
				И Объект.РабочийЦентр.Лико_ОсновнаяМашина Тогда
				ЦифраПослеОсновногоЦеха = Истина; 
			КонецЕсли;
			Если СтрЦ.ВидСекции = Справочники.Лико_ВидыСекций.ГорячееТиснениеПлоское Тогда  
				ЕстьГорячееТиснениеПлоское = Истина;
			КонецЕсли;  
			Если СтрЦ.ВидСекции = Справочники.Лико_ВидыСекций.ГорячееТиснениеВРегистрПлоское Тогда  
				ЕстьГорячееТиснениеВРегистрПлоское = Истина;
			КонецЕсли;  
			Если СтрЦ.ВидСекции = Справочники.Лико_ВидыСекций.Нумератор Тогда  
				ЕстьНумератор = Истина;
			КонецЕсли;  
			Если СтрЦ.ВидСекции = Справочники.Лико_ВидыСекций.Конгрев И Строка(СтрЦ.Оснастка) <> "Штамп для ротационного конгрева" Тогда  
				ЕстьКонгрев = Истина;
			КонецЕсли;  
		КонецЕсли;
	КонецЦикла;
	Если Объект.Цифровой <> ЭтоЦифровой Тогда 
		Объект.Цифровой = ЭтоЦифровой;
	КонецЕсли;
	
	Ручьи = ?(ЭтоЦифровой, Объект.РучьиПечатиИндиго, Объект.РучьиПечати);
	ШагПоНарезке = ПолучитьШагПоНарезкеШтампа(Объект.ШтампВырубной);
	ШиринаПоНожам = ?(Ручьи = 1, Объект.ДлинаЭтикетки, ШагПоНарезке * (Ручьи - 1) + Объект.ДлинаЭтикетки);
	
	РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15; //Стандарт
	СтрНарезка = "Шаг по нарезке: " + ШагПоНарезке + ", Высота эт.: " + Объект.ДлинаЭтикетки + ", Ручьи: " + Ручьи;
	
	РасчетныеНарезки = Новый Массив;
	РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления); 
	
	//Расчет нарезки по условиям
	//Индиго или Омега (+ Картес) и осн. материал Икс-фойл или Буфойл
	Если ВидРЦИндигоИЛИОмега Тогда
		Если (ИксФойл И НЕ (ЕстьОмега И НЕ ЕстьКартес)) ИЛИ Буфойл Тогда
			РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15 + ?(ЕстьКартес,15,?(ЕстьОмега,5,10));
			СтрНарезка = "Основной материал: " + Объект.ОсновнойМатериал + ". " + СтрНарезка  + ?(ЕстьКартес,". Cartes",?(ЕстьОмега,". Omega",""));
			РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления);
			ИксФойлБуфойлУчтено = Истина;
		КонецЕсли;
	КонецЕсли;
	//Если 2 прокат цифра, а 1 - основной цех 
	Если ЦифраПослеОсновногоЦеха Тогда
		РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15 + 5;
		СтрНарезка = СтрНарезка + ". Цифра после основной машины";
		РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления); 
	КонецЕсли;
	Если НЕ ВидРЦИндигоИЛИОмега Тогда
		//Если есть Горячее тиснение плоское или Горячее тиснение в Регистр Плоское
		Если ЕстьГорячееТиснениеПлоское ИЛИ ЕстьГорячееТиснениеВРегистрПлоское Тогда
			РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15 + 5;
			СтрНарезка = СтрНарезка + ?(ЕстьГорячееТиснениеПлоское,". Горячее тиснение плоское",". Горячее тиснение в регистр плоское");
			РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления); 
		КонецЕсли;
		//Если есть Нумератор
		Если ЕстьНумератор Тогда
			РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15 + 5;
			СтрНарезка = СтрНарезка + ". Нумератор";
			РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления); 
		КонецЕсли;
		//Если есть Конгрев и оснастка наименование <> "Штамп для ротационного конгрева" или ГорячееТиснениеПлоское или есть Картес
		Если ЕстьКонгрев ИЛИ ЕстьГорячееТиснениеПлоское ИЛИ ЕстьКартес Тогда
			//если осн. материал (Икс-фойл или Буфойл)
			Если (ИксФойл И НЕ (ЕстьОмега И НЕ ЕстьКартес)) ИЛИ Буфойл Тогда
				НаименованиеСекции = "";
				Если ЕстьКонгрев Тогда
					НаименованиеСекции = НаименованиеСекции + ". " + "Конгрев";
				КонецЕсли;
				РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15 + ?(ЕстьКартес,15,?(ЕстьОмега,5,10));
				СтрНарезка = "Основной материал: " + Объект.ОсновнойМатериал + ". " + СтрНарезка + НаименованиеСекции + ?(ЕстьКартес,". Cartes",?(ЕстьОмега,". Omega",""));
				РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления);
				ИксФойлБуфойлУчтено = Истина;
			ИначеЕсли ЕстьКонгрев Тогда	
				РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15 + 5;
				СтрНарезка = СтрНарезка + ". Конгрев";
				РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ИксФойлБуфойлУчтено Тогда
		Если (ИксФойл И НЕ (ЕстьОмега И НЕ ЕстьКартес)) ИЛИ Буфойл Тогда
			РасчетнаяНарезкаБезОкругления = ШиринаПоНожам + 15 + 5;
			СтрНарезка = "Основной материал: " + Объект.ОсновнойМатериал + ". " + СтрНарезка;
			РасчетныеНарезки.Добавить(РасчетнаяНарезкаБезОкругления);
		КонецЕсли;
	КонецЕсли;
	
	//Выбирается максимальное значение нарезки
	Для Каждого ВариантРасчетнойНарезки Из РасчетныеНарезки Цикл
		Если ВариантРасчетнойНарезки > РасчетнаяНарезкаБезОкругления Тогда
			РасчетнаяНарезкаБезОкругления = ВариантРасчетнойНарезки;	
		КонецЕсли;					
	КонецЦикла;
	
	РасчетнаяНарезкаЗначение = ЗарплатаКадрыКлиентСервер.Округлить(Цел(РасчетнаяНарезкаБезОкругления), 5,Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону);
	
	//Если расчетная наоезка больше Максимальной для Вида РЦ, то выбираем максимальную для Вида РЦ
	Если ЗначениеЗаполнено(ВидРЦВырубки.лкМаксимальнаяНарезка) Тогда
		РасчетнаяНарезкаЗначение = Мин(РасчетнаяНарезкаЗначение,ВидРЦВырубки.лкМаксимальнаяНарезка);		
	КонецЕсли;
	
	//Для Цифры минимальная нарезка 190
	Если Объект.Цифровой И РасчетнаяНарезкаЗначение < 190 Тогда
		РасчетнаяНарезкаЗначение = 190;	
	КонецЕсли;
	РасчетнаяНарезкаСсылка = Справочники.ЯССМ_Нарезки.НайтиПоНаименованию(РасчетнаяНарезкаЗначение);
	
	//На случай, если получится нарезка больше существующей и никак не ограничена максимальной в Виде РЦ
	Если НЕ ЗначениеЗаполнено(РасчетнаяНарезкаСсылка) Тогда
		СтрНарезка = "Расчетная нарезка " + Строка(РасчетнаяНарезкаЗначение) + ". " + СтрНарезка;	
	КонецЕсли;
	
	ДанныеВозврата.Вставить("РасчетнаяНарезкаСсылка",РасчетнаяНарезкаСсылка);
	ДанныеВозврата.Вставить("ТекстПараметры",СтрНарезка);
	
	Возврат ДанныеВозврата;
			
КонецФункции // <-- Конец Лико Яцун С. В. 26.01.2026	


&НаКлиенте
Процедура ОчиститьВсеПараметрыШтампа()
	ОчиститьПараметрыШтампа();
	ОчиститьПараметрыВырубки();
	ОчиститьПараметрыПечати();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметрыШтампа()
	//Параметры Штампа
	Объект.ДлинаЭтикетки 	= 0;
	Объект.ШиринаЭтикетки 	= 0;
	Объект.Z 				= ПредопределенноеЗначение("Справочник.Лико_ZКоличествоЗубьев.ПустаяСсылка");
	Объект.Нарезка 			= ПредопределенноеЗначение("Справочник.ЯССМ_Нарезки.ПустаяСсылка");
	//Объект.КоличествоКликов // Убрано
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметрыВырубки()
	//Параметры Вырубки
	Объект.Ручьи 			= 0;
	Объект.ЭтикетокНаЛисте 	= 0;
	Объект.ШагПечати 		= 0;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметрыПечати()
	//Параметры Печати
	Объект.РучьиПечати				= 0;
	Объект.ЭтикетокНаЛистеПечати	= 0;
	Объект.ЭтикетокНаЛистеИндиго 	= 0;
	Объект.ДлинаПечати				= 0;
КонецПроцедуры

&НаСервере
Процедура ОчиститьПараметрыВырубкиНаСервере() //Процедура нужна потому что с Сервера не вызвать Клиент
	//Параметры Вырубки
	Объект.Ручьи 			= 0;
	Объект.ЭтикетокНаЛисте 	= 0;
	Объект.ШагПечати 		= 0;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНамотку(Команда)
	стр = Элементы.Товары.ТекущиеДанные;
	Если стр<>Неопределено Тогда 
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Партнер",Объект.Партнер);
		//Если ЗначениеЗаполнено(стр.Город) Тогда 
		//	ДопПараметры.Вставить("Город",стр.Город);
		//КонецЕсли;	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПОслеВыбораНамотки", ЭтаФорма);
		ОткрытьФорму("Справочник.Лико_Перемотка.Форма.ФормаВыбора", ДопПараметры, ЭтаФорма, ,,,ОписаниеОповещения);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНамоткуПоНоменклатуре(Команда)
	стр = Элементы.Товары.ТекущиеДанные;
	Если стр<>Неопределено Тогда 
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Партнер",Объект.Партнер);
		Если ЗначениеЗаполнено(стр.Номенклатура) Тогда 
			ДопПараметры.Вставить("Номенклатура", стр.Номенклатура);
		КонецЕсли;	
		//Если ЗначениеЗаполнено(стр.Город) Тогда 
		//	ДопПараметры.Вставить("Город",стр.Город);
		//КонецЕсли;	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПОслеВыбораНамотки", ЭтаФорма);
		ОткрытьФорму("Справочник.Лико_Перемотка.Форма.ФормаВыбора", ДопПараметры, ЭтаФорма, ,,,ОписаниеОповещения);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПОслеВыбораНамотки(Результат, Параметры) Экспорт
	Если Результат<>Неопределено Тогда 
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_Перемотка") ТОгда 
			текстр = Элементы.Товары.ТекущиеДанные;
			Если Текстр<>Неопределено Тогда 
				Идентификатор = текстр.ПолучитьИдентификатор();
				ЗаполнитьПараметрыПеремотки(Идентификатор, Результат);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНамоткиНаСервере()
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Партнер,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Направление КАК Направление,
		|	ЗаказКлиентаТовары.МаксимальныйДиаметрРулона КАК МаксимальныйДиаметрРулона,
		|	ЗаказКлиентаТовары.ВнутреннийДиаметр КАК ВнутреннийДиаметр,
		|	ЗаказКлиентаТовары.ПродольнаяРезка КАК ПродольнаяРезка,
		|	ЗаказКлиентаТовары.ПоперечнаяРезка КАК ПоперечнаяРезка,
		|	ЗаказКлиентаТовары.Кромка КАК Кромка,
		|	ЗаказКлиентаТовары.ПодрезкаКромки КАК ПодрезкаКромки,
		|	ЗаказКлиентаТовары.Город КАК Город,
		|	Лико_Перемотка.Ссылка КАК Перемотка,
		|	ЗаказКлиентаТовары.КоличествоЭтикетокВРолике КАК КоличествоЭтикетокВРолике
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Перемотка КАК Лико_Перемотка
		|		ПО ЗаказКлиентаТовары.Ссылка.Партнер = Лико_Перемотка.Партнер
		|			И ЗаказКлиентаТовары.Номенклатура = Лико_Перемотка.Номенклатура
		|			И ЗаказКлиентаТовары.Направление = Лико_Перемотка.Направление
		|			И ЗаказКлиентаТовары.МаксимальныйДиаметрРулона = Лико_Перемотка.МаксимальныйДиаметрРулона
		|			И ЗаказКлиентаТовары.ВнутреннийДиаметр = Лико_Перемотка.ВнутреннийДиаметр
		|			И ЗаказКлиентаТовары.КоличествоЭтикетокВРолике = Лико_Перемотка.КоличествоЭтикетокВРолике
		|			И ЗаказКлиентаТовары.ПродольнаяРезка = Лико_Перемотка.ПродольнаяРезка
		|			И ЗаказКлиентаТовары.ПоперечнаяРезка = Лико_Перемотка.ПоперечнаяРезка
		|			И ЗаказКлиентаТовары.Кромка = Лико_Перемотка.Кромка
		|			И ЗаказКлиентаТовары.ПодрезкаКромки = Лико_Перемотка.ПодрезкаКромки
		|			И ЗаказКлиентаТовары.Город = Лико_Перемотка.Город
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ
		|	И Лико_Перемотка.Ссылка ЕСТЬ NULL";
		Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СпрОбъект = Справочники.Лико_Перемотка.СоздатьЭлемент();
			СпрОбъект.Партнер 					= Выборка.Партнер;
			СпрОбъект.Номенклатура				= Выборка.Номенклатура;
			СпрОбъект.Направление				= Выборка.Направление;
			СпрОбъект.МаксимальныйДиаметрРулона	= Выборка.МаксимальныйДиаметрРулона;
			СпрОбъект.ВнутреннийДиаметр			= Выборка.ВнутреннийДиаметр;
			СпрОбъект.КоличествоЭтикетокВРолике = Выборка.КоличествоЭтикетокВРОлике;
			СпрОбъект.ПродольнаяРезка 			= Выборка.ПродольнаяРезка;
			СпрОбъект.ПоперечнаяРезка 			= Выборка.ПоперечнаяРезка;
			СпрОбъект.Кромка 					= Выборка.Кромка;
			СпрОбъект.ПодрезкаКромки 			= Выборка.ПодрезкаКромки;
			СпрОбъект.Город 					= Выборка.Город;
			СпрОбъект.Записать();
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНамотки(Команда)
	ЗаписатьНамоткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьОснасткиПриИзменении(Элемент)
	ПоказатьДоходностьРентабельность();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	текстр = Элементы.Товары.ТекущиеДанные;
	Если текстр<> Неопределено Тогда
		ВерсияНоменклатуры = текстр.ВерсияНоменклатуры;
		Если ЗначениеЗаполнено(текстр.Направление) Тогда 
			идентификатор = текстр.ПолучитьИдентификатор();
			ПоказатьКартинкуНамотки(идентификатор);
		КонецЕсли;	
		СтавкаНДСТекущейСтроки = текстр.ставкаНДС;
		
	КонецЕсли; 
	
	DFMКлиент.ОригиналМакет(ЭтаФорма);	
	
		
	
КонецПроцедуры 




&НаКлиенте
Процедура НадписьСтоимостьНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
	Если ЭтаФорма.Модифицированность Тогда
		Записать();
	КонецЕсли;
	РассчитатьЗаказНаСервере(Объект.Ссылка, Отказ);
	Если Отказ Тогда 
		Сообщить("Заказ не рассчитан!")
	Иначе
		ПоказатьДоходностьРентабельность();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОМСКартинкой(Команда)
	РабочееМесто = ПолучитьРабочееМестоНаСервере();
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда 
		Сообщить("Не указано рабочее место!");
	КонецЕсли;
	//ИмяПринтера = "\\spb-srv-print01\it";   
	//ИмяПрограммыПечатиPDF = "C:\Foxit Software\Foxit Reader\FoxitReader.exe";
	ИмяПринтера = ЗначениеРеквизита(РабочееМесто,"ИмяПринтераДляЦветнойПечати");  
	ИмяПрограммыПечатиPDF = ЗначениеРеквизита(РабочееМесто,"ИмяПрограммыПечатиPDF");  
	Если Не (ЗначениеЗаполнено(ИмяПринтера) Или  ЗначениеЗаполнено(ИмяПрограммыПечатиPDF)) Тогда 
		Сообщить("Для рабочего места указана программа для печати PDF или принтер цветной печати!");
		Возврат;
	КонецЕсли;
	
	ОригиналМакеты = ПолучитьОМНаСервере();
	МассивФайлов= Новый Массив;
	Для каждого ОМ ИЗ ОригиналМакеты Цикл
		Файл = ПолучитьФайлИзБазыSQL(ОМ.Значение.ОригиналМакет, ОМ.Значение.ИдентификаторФайла);
		Если Файл <>Неопределено Тогда 
			Если Прав(ОМ.Значение.ИмяФайла,3)="pdf"  Тогда
				ИмяКаталога = КаталогВременныхФайлов();
				//ИмяФайла = "vrem"+Строка(Счетчик) ; 
				ИмяФайла = "vrem" ; 	
				Попытка
					ИмяФайла = ПолучитьИмяФайла(ИмяКаталога, ИмяФайла);
					Файл.Записать(ИмяФайла);
					//НомерЗаказаВПДФ(ИмяФайла,Объект.Версия,Счетчик,КоличествоСтраниц);
					МассивФайлов.Добавить(ИмяФайла);
					Команда=ИмяПрограммыПечатиPDF+" /t """+ИмяФайла+""" "+ИмяПринтера;	
					ЗапуститьПриложение(Команда,,);
					
					ТекДата = ТекущаяДата();
					
					Пока НЕ ТекущаяДата() = ТекДата + 4 Цикл 
						//.... думаем 4 секунд :) 
					КонецЦикла;
					
					Команда="TASKKILL /FI ""IMAGENAME eq FoxitReader*""";
					ЗапуститьПриложение(Команда,,); 												
				Исключение					
				КонецПопытки;
			Иначе
				ТабДокумент = ОМСКартинкойНаСервере(файл);
				ТабДокумент.ИмяПринтера = ИмяПринтера;
				//ТабДокумент.Напечатать(); 		
				ТабДокумент.Напечатать(Истина);
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФайлИзБазыSQL(ОригиналМакет, ИдентификаторФайла) Экспорт
	ПараметрыСоединения =   Лико_ДополнительноКлиент.УстановитьСоединениеССервером();
	Подключение = ПараметрыСоединения.ADOConnection;
	
	Если Подключение = Неопределено Тогда
		Сообщить("Отсутствует подключение к SQL серверу! Обратитесь, пожалуйста, в IT - отдел.");
		Возврат Неопределено;
	КонецЕсли;
	
	Файл = Неопределено;
	ИмяТаблицы = "FileStore";
	Замещать = Истина;
	
	ИДСсылки = ЗначениеВСтрокуВнутрНаСервере(ОригиналМакет);
	ИДСсылкиМакета = ЗначениеВСтрокуВнутрНаСервере(ИдентификаторФайла);
	
	
	Stream = Новый COMОбъект("ADODB.Stream");
	Stream.Type = 1;
	Stream.Open();
	
	RecordSet = Новый COMОбъект("ADODB.RecordSet");
	RecordSet.CursorLocation = 3;
	RecordSet.LockType = 2;
	
	//Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUID = '" + ИДСсылки + "' AND GUIDMaket  = '" + ИДСсылкиМакета + "'";
	Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUIDOM = '" + ИДСсылки + "' AND GUIDRow  = '" + ИДСсылкиМакета + "'";

	RecordSet.Open(Запрос,Подключение);
	
	
	Если RecordSet.RecordCount > 0 Тогда
		//Попытка
		RecordSet.MoveFirst();
		Stream.Write(RecordSet.Fields("Data").Value);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Stream.SaveToFile(ИмяВременногоФайла);
		
		Stream.Close();
		RecordSet.Close();
		Файл = Новый ДвоичныеДанные(ИмяВременногоФайла);
		Возврат Файл;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НомерЗаказаВПДФ(ИмяФайла,Версия,Страница,ВсегоСтраниц)
	Если QP=Неопределено Тогда
		ClassName 	= "DebenuPDFLibraryLite1114.PDFLibrary";
		QP 			= Новый COMОбъект(ClassName);
	КонецЕсли;
	FileName 	= ИмяФайла;
	FileName2 	= ИмяФайла; 
	QP.AddStandardFont(11);
	QP.SelectFont(11);
	QP.SetTextSize(6);
	QP.LoadFromFile(FileName,"");
	
	XPos = 400;
	YPos = 800;
	Text1 = "ZAKAZ N "+Объект.НомерБезПрефикса +"/"+Строка(Версия);  					
	QP.DrawText(xpos, ypos, text1); 
	XPos = 450;
	YPos = 20;
	Text1 = "Page "+Строка(Страница) +" of "+Строка(ВсегоСтраниц);  					
	QP.DrawText(xpos, ypos, text1); 	
	//Если QP.SaveToFile(FileName2) = 1 Тогда 						
	//	ЭлементыФормы.ОсновноеИзоброжениеPDF.LoadFile(ИмяФайла);		
	//Иначе 
	//	Сообщить("Error, file could not be written");
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСпецификацию(Команда)
	ПараметрыЗаполнения = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Справочник.Лико_Спецификации.Форма.ФормаЭлемента", ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура ПеремоткаТипОперацииПриИзменении(Элемент)
	стр = Элементы.Перемотка.ТекущиеДанные;
	Если стр <> Неопределено Тогда 
		Если стр.типоперации = ПредопределенноеЗначение("Перечисление.Лико_ТипыОперацийПеремотки.СнятиеОблоя") Тогда 
			стр.КоэффициентПеремотки = 5;
		ИначеЕсли  стр.типоперации = ПредопределенноеЗначение("Перечисление.Лико_ТипыОперацийПеремотки.ПеремоткаПослеНФ") Тогда
			стр.КоэффициентПеремотки = 5;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПОСпецификацииНаСервере(Спецификация, НомерВарианта);
	//Если Спецификация.ВариантыСпецификации.Найти(НомерВарианта, "НомерСтроки")<>Неопределено Тогда
		Объект.ОсновнойМатериал = Спецификация.ОсновнойМатериал;
		// --> Начало Лико Митюшин МФМ 10.09.2021
		Объект.СпособНаклейки 	= Спецификация.СпособНаклейки;
		Объект.ВидУпаковки 		= Спецификация.ВидУпаковки;
		Объект.Дизайнер			= Спецификация.Дизайнер;
		Объект.ОбразецЦвета 	= Спецификация.ОбразецЦвета;
		// <-- Конец Лико Митюшин МФМ 10.09.2021
		
		Объект.Товары.Очистить();
		Объект.цвета.Очистить();
		//Объект.ВидыРабот.Очистить();
		Объект.Формы.Очистить();
		Для каждого стртовары Из Спецификация.Товары Цикл
			стрТоварыновая = Объект.Товары.добавить();
			ЗаполнитьЗначенияСвойств(стрТоварыновая, стртовары);	
			стрТоварыновая.КоличествоУпаковок  =стрТовары.Количество;
		КонецЦикла;

		ОтборПоВарианту = Новый Структура("НомерВарианта", НомерВарианта);
		МассивСтрок = Спецификация.Цвета.НайтиСтроки(ОтборПоВарианту);
		Для каждого ЭлементМассива Из МассивСтрок Цикл
			СтрЦвета = Объект.цвета.Добавить();
			ЗаполнитьЗначенияСвойств(стрцвета,ЭлементМассива, , "НомерВарианта, Ключстроки");
			стрЦвета.НомерВарианта = 1;
			стрЦвета.КлючСтроки = Новый УникальныйИдентификатор;
			СтрокиФорм = Объект.Формы.НайтиСтроки(Новый Структура("КлючСтроки", ЭлементМассива.КлючСтроки)) ;
			Для Каждого стрФорм из СтрокиФорм Цикл
				новаястрформ = Объект.Формы.добавить();
				ЗаполнитьЗначенияСвойств(новаястрформ, стрформ);
				новаястрформ.КлючСтроки = СтрЦвета.ключстроки;
			КонецЦикла;	
		КонецЦикла;
		
		//МассивСтрок = Спецификация.ВидыРабот.НайтиСтроки(ОтборПоВарианту);
		//Для каждого ЭлементМассива Из МассивСтрок Цикл
		//	стрработы = Объект.ВидыРабот.Добавить();
		//	ЗаполнитьЗначенияСвойств(стрработы,ЭлементМассива, , "НомерВарианта");
		//	стрработы.НомерВарианта = 1;
		//	стрработы.КлючСтроки = Новый УникальныйИдентификатор;
		//КонецЦикла;
	ЗаполнитьЗначенияСвойств(Объект, Спецификация, "ШиринаЭтикетки,ДлинаЭтикетки,ЭтМЭР,Нарезка,ПлощадьКлише,ДопускМинус,ДопускПлюс,Раппорт,ШтампВырубной,
											|Ручьи,ЭтикетокНаЛисте,ШагПечати,Z,РучьиПечати,ЭтикетокНаЛистеПечати,ДлинаПечати,КоличествоЭтПоДлинеПечати,
											|КоличествоЛистовКнижки,КоличествоКликов,РучьиПечатиИндиго,ЭтикетокНаЛистеИндиго,ДлинаПечатиИндиго,
											|КоличествоЭтПоДлинеПечатиИндиго,КоличествоШтамповПоДлинеПечатиИндиго,ВидВырубки,РабочийЦентр,Книжка,КнижныйМодуль,Цифровой,
											|ЧестныйЗнак,ТипографскийАгрегат");
		//стрШтамп = Спецификация.ПараметрыШтампа.НайтиСтроки(ОтборПоВарианту)[0];
		//ЗаполнитьЗначенияСвойств(Объект, стрШтамп);
	//КонецЕсли;
КонецПроцедуры                                    

&НаКлиенте
Процедура ЗаполнитьПоСпецификации(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСпецификации", ЭтотОбъект);
	ПоказатьВводЗначения(ОписаниеОповещения, Неопределено,"Выберите спецификацию" , Тип("СправочникСсылка.Лико_Спецификации"));
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпецификации(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВарианта", ЭтотОбъект,ВыбЗнач);
		//ПоказатьВводЧисла(ОписаниеОповещения, 1,"Выберите вариант" ,10,0);
		ЗаполнитьПОСпецификацииНаСервере(ВыбЗнач, 1);
		ЗаписатьЦветаВРаботы();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВарианта(ВыбЗнач, Параметры) Экспорт
	Если ВыбЗнач<>Неопределено Тогда
		ЗаполнитьПОСпецификацииНаСервере(Параметры, ВыбЗнач);
		ЗаписатьЦветаВРаботы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПереотправкеВРаботу(Результат, ДопПараметры)  Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Отказ = Ложь;
		Пересчитать_ПереотправитьЗаказВРаботу(Отказ);
        Если Не Отказ Тогда 
			ЭтаФорма.Закрыть();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Пересчитать_ПереотправитьЗаказВРаботу(Отказ, НаправитьВработу = Истина, ПодниматьВерсию = Истина, ПричиныЗамены = Неопределено)
	НачатьТранзакцию();
	ВидЗаказа = Объект.ВидЗаказа;
	ПредыдущийВидЗаказа = Объект.Ссылка.ВидЗаказа;
	Записать();
	Если ВидЗаказа <> ПредыдущийВидЗаказа И Объект.Площадка <> Справочники.Лико_Площадки.Линкс Тогда 
		Если ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПовторСИзменением ИЛИ ВидЗаказа = Перечисления.Лико_ВидыЗаказов.СложныйПовтор ИЛИ ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Новый Тогда
			Если Не ( ПредыдущийВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПовторСИзменением ИЛИ ПредыдущийВидЗаказа = Перечисления.Лико_ВидыЗаказов.СложныйПовтор ИЛИ ПредыдущийВидЗаказа = Перечисления.Лико_ВидыЗаказов.Новый) Тогда
				Лико_Планирование.ПереписатьАртикулыНоменклатуры(Объект.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Не (рольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ЗакрытиеОтгрузки")) Тогда
		РезультатПроверки = ПроверкаЗаполненияЗаказаНаСервере();
		Если РезультатПроверки<>Истина Тогда 
			Сообщить(РезультатПроверки+ " "+ "Заказ не отправлен в работу!!!");
			ОтменитьТранзакцию();
			Отказ = Истина;
			Прочитать();
			Возврат
		КонецЕсли;
	КонецЕсли;

	РассчитатьЗаказНаСервере(Объект.Ссылка, Отказ);
	Если  Отказ Тогда
		ОтменитьТранзакцию();
		Сообщить("Заказ не отправлен в работу!!!");
		Прочитать();
		Возврат;
	КонецЕсли;
	
	Если НаправитьВРаботу Тогда 
		НаправитьВРаботуНаСервере(Объект.Ссылка, Отказ,ПодниматьВерсию, ПричиныЗамены);
		Если Отказ Тогда 
			ОтменитьТранзакцию();
			Сообщить("Заказ не отправлен в работу!!!");
			Прочитать();
			Возврат;
		КонецЕсли;
	КонецЕсли;	

	ЗафиксироватьТранзакцию();	
КонецПроцедуры

&НаСервере
Процедура ВидЗаказаПриИзмененииНаСервере()
	
	Если Объект.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
		Объект.ДатаУтвержденияЦветов = '0001.01.01';
		Объект.УтвердилЦвета = Справочники.Пользователи.ПустаяСсылка();
		Если Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Новый Тогда
			Объект.УдалитьНомерПовторЗаказа = "";
			Объект.ПовторЗаказа = Неопределено;
		КонецЕсли;
		Для каждого стр из Объект.Цвета Цикл
			стр.Анилокс = Справочники.Номенклатура.ПустаяСсылка();
		КонецЦикла;
	Иначе
		//Для каждого стр из Объект.Цвета Цикл
		//	Если стр.цветоделение = Истина Тогда 
		//		стр.Цветоделение = Ложь;
		//	КонецЕсли;
		//	Если стр.перегравировка = Истина Тогда 
		//		стр.перегравировка = Ложь;
		//	КонецЕсли;
		//КонецЦикла;

	КонецЕсли;  
	
	// <-- Начало Лико Яцун С. В. 25.03.2025
	Если НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Шаблон И НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда
		Элементы.ПоказатьПараметрыВида.Доступность = Ложь;
	Иначе
		Элементы.ПоказатьПараметрыВида.Доступность = Истина;
	КонецЕсли;
	Если НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда
		Элементы.ГруппаПробник.Видимость = Ложь;
		Элементы.ГруппаПробник1.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПробник.Видимость = Истина;
		Элементы.ГруппаПробник1.Видимость = Истина;
	КонецЕсли;
	Если НЕ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Шаблон Тогда
		Элементы.ГруппаШаблон.Видимость = Ложь;
	Иначе
		Элементы.ГруппаШаблон.Видимость = Истина;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 25.03.2025
	
	// --> Начало Лико Митюшин МФМ 07.07.2021
	//Если Не Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник Тогда
	Если Не (Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Пробник ИЛИ Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка) Тогда
	// <-- Конец Лико Митюшин МФМ 07.07.2021
		Элементы.ЗаДеньги.Видимость = Ложь;
	Иначе 
	    Элементы.ЗаДеньги.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
		Элементы.ЦветаСоздатьВал.Доступность = Ложь;
		Элементы.Товары.ИзменятьСоставСтрок = Ложь;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.ДатаУтвержденияЦветов) Тогда
			Элементы.ЦветаСоздатьВал.Доступность = Истина;
		КонецЕсли;
		Элементы.Товары.ИзменятьСоставСтрок = Истина;
	КонецЕсли;
	//ОчиститьПараметрыНамотки(Объект);
	ОчиститьПараметрыОтВидаЗаказа(Объект.ВидЗаказа, Объект);
	
	// --> Начало Лико Ефимов ЕВВ 03.04.2024
	//Если Объект.ВидЗаказа <> Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
	//	Объект.ДействиеСИзлишками = Неопределено;
	//КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 03.04.2024

КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	ВидЗаказаПриИзмененииНаСервере();	
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛико_НесоответствующаяПродукция(Команда)
	ПараметрыЗаполнения = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.Лико_НесоответствующаяПродукция.Форма.ФормаДокумента", ПараметрыЗаполнения);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзмененияЦветов(Команда)
	ТабличныеДокументы = ПоказатьИзмененияНаСервере(Истина);
	Для каждого СтрокаМассива из ТабличныеДокументы Цикл
		СтрокаМассива.ТабДок.Показать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзмененияРабот(Команда)
	ТабличныеДокументы = ПоказатьИзмененияНаСервере(,Истина);
	Для каждого СтрокаМассива из ТабличныеДокументы Цикл
		СтрокаМассива.ТабДок.Показать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСостояниеЗаказа(Команда) // --> Начало Лико Ефимов ЕВВ 31.05.2018
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("ЗаказКлиента", Объект.Ссылка));
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "Лико_СостояниеЗаказа");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета,, Новый УникальныйИдентификатор);

КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 31.05.2018

&НаКлиенте
Процедура ОткрытьОтчетОтгрузки(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("ЗаказКлиента", Объект.Ссылка));
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "Лико_ОтчетПоЗатратамНаОтгрузки");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета);

КонецПроцедуры


&НаКлиенте
Процедура КартаСнятияРасходаВыборИзСпискаЗавершение(Знач ВыбранныйЭлемент, Параметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		Текстр = Элементы[Параметры.ИмяТЧ].ТекущиеДанные;
		Текстр[Параметры.ИмяРеквизита] = ВыбранныйЭлемент.Значение;	
	КонецЕсли;	
КонецПроцедуры	


Процедура ЗаполнитьКоличествоКоробокИРоликовИзДокументовОтгрузок() // --> Начало Лико Ефимов ЕВВ 28.06.2018
	
	Объект.КоличествоРоликов = 0;
	Объект.КоличествоКоробок = 0;
	МассивДокументов = Новый Массив;
	Для каждого Строка из Объект.Отгрузки Цикл
		Если ЗначениеЗаполнено(Строка.ДокументОтгрузки) И МассивДокументов.Найти(Строка.ДокументОтгрузки) = Неопределено Тогда
			МассивДокументов.Добавить(Строка.ДокументОтгрузки);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия.Лико_КоличествоРоликов) КАК КоличествоРоликов,
		|	СУММА(1) КАК КоличествоКоробок
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
		|		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка
		|			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура
		|			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика = РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение В(&МассивДокументов)
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика.Лико_ЗаказНоменклатуры = &Заказ";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Объект.КоличествоРоликов = ВыборкаДетальныеЗаписи.КоличествоРоликов;
		Объект.КоличествоКоробок = ВыборкаДетальныеЗаписи.КоличествоКоробок;
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 28.06.2018


&НаСервере
Функция ВыходноеИзделиеЗаказаНаСервере(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Возврат Результат.Номенклатура;
	Иначе 
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьНаПолуфабрикатНаСервере(Заказ, ОсновнойМатериал = Ложь)
	// --> Начало Лико Ефимов ЕВВ 15.09.2021
	// дописал ПолуфабрикатПодАппликатор
	
	Если Заказ.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.Полуфабрикат И Заказ.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор Тогда
		Сообщить("Вы можете указывать только заказ с типом """ + Перечисления.Лико_ТипыЗаказов.Полуфабрикат + """ или """ + Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор);
		Возврат Ложь;
	ИначеЕсли Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор И Заказ.ВидПолуфабрикатаПодАппликтор <> ?(ОсновнойМатериал, Перечисления.Лико_ВидыПолуфабрикатаПодАппликтор.Нижний, Перечисления.Лико_ВидыПолуфабрикатаПодАппликтор.Верхний) Тогда
		Сообщить("Вы можете указывать только заказ с " + ?(ОсновнойМатериал, "нижним", "верхним") + " видом полуфабриката под аппликатор");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаказОсновногоМатериалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ЗаказОсновногоМатериала) Тогда 
		Если НЕ ПроверитьНаПолуфабрикатНаСервере(Объект.ЗаказОсновногоМатериала, Истина) Тогда
			Объект.ЗаказОсновногоМатериала = Неопределено;
		КонецЕсли;
		
		Объект.ОсновнойМатериал = ВыходноеИзделиеЗаказаНаСервере(Объект.ЗаказОсновногоМатериала);		
	Иначе
		Объект.ОсновнойМатериал = ПустаяСсылка("Номенклатура");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОМВЭску(Команда)
	ОригиналМакеты = ПолучитьОМНаСервере();
	МассивФайлов= Новый Массив;
	сч = 1;
	Для каждого ОМ ИЗ ОригиналМакеты Цикл
		Файл = ПолучитьФайлИзБазыSQL(ОМ.Значение.ОригиналМакет, ОМ.Значение.ИдентификаторФайла);
		Если Файл <>Неопределено Тогда 
			//ИмяКаталога = КаталогВременныхФайлов();			
            //ИмяКаталога = "F:\Юность";
			ИмяКаталога = "\\eskoautomation\PrintFolder\incoming\";
			ИмяФайла = Объект.НомерБезПрефикса+"_"+сч; 	
			Попытка
				ИмяФайла = ПолучитьИмяФайла(ИмяКаталога, ИмяФайла);
				Файл.Записать(ИмяФайла);
							
			Исключение					
			КонецПопытки;
			сч = сч+1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомбинированныйПриИзменении(Элемент)
	Если Объект.Комбинированный  Тогда
		Элементы.ЗаказОсновногоМатериала.Видимость = Истина;
		Элементы.НеПересчитыватьПФ.Видимость = Истина;
        Элементы.ЦветаЗаказМатериала.Видимость = Истина;
	Иначе
		Элементы.ЗаказОсновногоМатериала.Видимость = Ложь;
		Объект.НеПересчитыватьПФ = Ложь;
		Элементы.НеПересчитыватьПФ.Видимость = Ложь;
        Элементы.ЦветаЗаказМатериала.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаказНаСервере()
	РезультатПроверки = ПроверкаЗаполненияЗаказаНаСервере();
	Если РезультатПроверки<>Истина Тогда 
		Сообщить(РезультатПроверки);
	Иначе
		Сообщить("Проверка прошла успешно");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаказ(Команда)
	ПроверитьЗаказНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПланФактныйАнализЗатрат(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("Заказ", Объект.Ссылка));
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	//Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "ПланФактныйАнализЗатратПоЗаказу");
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,"Отчет ""Отчет лк План-фактный анализ затрат по заказу""");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетРасчетНормативовПоЗаказу(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	СтруктураОтбора = Новый Структура("Заказ", Объект.Ссылка);
	СтруктураОтбора.Вставить("ВариантРасчета", 1);
	ПараметрыФормыОтчета.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "РасчетНормативовПоЗаказу");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ВедущийТехнологНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокВыбора= ПолучитьСписокТехнологов();
	ОписаниеОповещения = Новый ОписаниеОповещения("ВедущийТехнологВыборИзСпискаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТехнологов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользователиДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	|ГДЕ
	|	ПользователиДополнительныеРеквизиты.Свойство.Имя = ""ВедущийТехнолог""
	|	И ПользователиДополнительныеРеквизиты.Значение = ИСТИНА";
	СП = Новый СписокЗначений;
	СП.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СП;
КонецФункции
	
&НаКлиенте
Процедура ВедущийТехнологВыборИзСпискаЗавершение(Знач ВыбранныйЭлемент, Параметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		Объект.ВедущийТехнолог= ВыбранныйЭлемент.Значение;	
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура ОбразецЦветаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.ТекущийЭлемент = Элемент;
	//ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеОбразцовЦвета", ЭтотОбъект);
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ТипЗначения", Новый ОписаниеТипов("ПеречислениеСсылка.Лико_ОбразцыЦвета"));
	//ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор образцов цвета'"));
	//Массив= Новый Массив;
	//Для каждого стр из Объект.ОбразцыЦвета Цикл
	//	Массив.Добавить(стр.ОбразецЦвета);
	//КонецЦикла;	
	//ПараметрыФормы.Вставить("Значения", Массив);
	//ОткрытьФорму("ОбщаяФорма.РедактированиеСпискаЗначений", ПараметрыФормы , , , , , ОписаниеОповещения);
	
	Сп = Новый СписокЗначений;
	СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.ВнешнийОбразец"));
	СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.ЦветоПроба"));
	СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.БезОбразца"));
	СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.ПредыдущийТираж"));
	СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.ЭтикеткаВОМ"));
	СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.КаталогПантонов"));
	СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.ЭтикеткаВКнигеОбразцов"));
	Если Объект.Площадка = ГлЛико_Площадки.Урал Тогда
		// <-- Начало Лико Яцун С. В. 26.12.2023 сделать не доступным для выбора в Ликофлексе, Икс-Паке, Сибири
		СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.УтверждениеОбразцаПриПечати"));
		// <-- Конец Лико Яцун С. В. 26.12.2023
		СП.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ОбразцыЦвета.КонтрольныйОттиск"));
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеОбразцовЦвета", ЭтаФорма);
	СП.ПоказатьОтметкуЭлементов(Оповещение, "Выберите образцы цвета");
	
	



	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеОбразцовЦвета(Результат, ДополнительныеПараметры) Экспорт
	//Если ТипЗнч(Результат) <> Тип("Массив") Тогда
	//	Возврат;
	//КонецЕсли;	
	//Объект.ОбразцыЦвета.Очистить();
	//Если Результат.Количество() > 0 Тогда
	//	Для каждого элемент из результат Цикл
	//		Если ЗначениеЗаполнено(Элемент) Тогда 
	//			стр = Объект.ОбразцыЦвета.Добавить();
	//			стр.ОбразецЦвета =  Элемент;
	//		КонецЕсли;	
	//	КонецЦикла;
	//КонецЕсли;
	//ПоказатьОбразцыЦвета();
	
	Если Результат <>Неопределено Тогда 
		Объект.ОбразцыЦвета.Очистить();
		
		Для каждого Элемент из Результат Цикл
			Если Элемент.Пометка Тогда 
				стр = Объект.ОбразцыЦвета.Добавить();
				стр.ОбразецЦвета =  Элемент.Значение;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	ПоказатьОбразцыЦвета();


КонецПроцедуры

&НаСервере
Функция ПолучитьНомерТелефонаОтветственного();
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Ответственный, 
                                                    Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
КонецФункции	

&НаКлиенте
Процедура ПозвонитьПоТелефону(Команда)
	НомерТелефона = ПолучитьНомерТелефонаОтветственного();
	Если ЗначениеЗаполнено(НомерТелефона) Тогда 
		ИмяПротокола = "tel";
		СтрокаЗапуска = ИмяПротокола + ":" + НомерТелефона;
		Оповещение = Новый ОписаниеОповещения;

		НачатьЗапускПриложения(Оповещение,СтрокаЗапуска);

	//	УправлениеКонтактнойИнформациейКлиент.ПозвонитьПоТелефону(НомерТелефона);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ГрамматураПриИзмененииНаСервере(ключстроки)
	Отбор = Новый Структура("КлючСтроки", КлючСтроки);
	стрцвета = Объект.Цвета.НайтиСтроки(Отбор)[0];
	Если ЗначениеЗаполнено(стрцвета.грамматура) Тогда
		Если ТипЗнч(стрцвета.грамматура) = Тип("Число") Тогда 
			ВсегоГрамматура = стрцвета.грамматура;
			стрцвета.процентвсмеси = 100*стрцвета.грамматура/ВсегоГрамматура;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьМассивРеквизитовТЧ()
	
	реквизитыТЧ = новый массив;
	
	Для каждого ТекПараметр из Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Цвета.Реквизиты Цикл

		 реквизитыТЧ.Добавить(ТекПараметр.Имя)  ;
		
	 КонецЦикла;		
	 
	 возврат реквизитыТЧ;

 КонецФункции
 
&НаКлиенте
Процедура ОчиститьНоменклатураФормулаПантона(стр) 

	стр.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	стр.ФормулаПантона = ПредопределенноеЗначение("Справочник.Лико_ФормулыПантонов.ПустаяСсылка");

Конецпроцедуры

&НаСервере
Функция ПолучитьСписокВидовЗаказов()  
	СписокВидовЗаказов = Новый СписокЗначений;
	Для Сч = 0 По 12 Цикл
        СписокВидовЗаказов.Добавить(Перечисления.Лико_ВидыЗаказов.Получить(Сч));
	КонецЦикла;
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если Не РольДоступна("ПолныеПрава") Тогда 
			СписокВидовЗаказов.Удалить(1);
		КонецЕсли;
	КонецЕсли; 
	// <-- Начало Лико Яцун С. В. 29.05.2024
	ПолныйповторСПеревыводомВСпискеВидовЗаказов = СписокВидовЗаказов.НайтиПоЗначению(Перечисления.Лико_ВидыЗаказов.ПолныйповторСПеревыводом);
	Если ПолныйповторСПеревыводомВСпискеВидовЗаказов <> Неопределено Тогда
		СписокВидовЗаказов.Удалить(ПолныйповторСПеревыводомВСпискеВидовЗаказов);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 29.05.2024
	СписокВидовЗаказов.Добавить(Перечисления.Лико_ВидыЗаказов.ВнутренниеНужды);
	Возврат СписокВидовЗаказов  ;
КонецФункции

&НаКлиенте
Процедура ВидЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = ПолучитьСписокВидовЗаказов(); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВидЗаказаВыборИзСпискаЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент);
		

КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаВыборИзСпискаЗавершение(Знач ВыбранныйЭлемент, Параметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда    
		Объект.ВидЗаказа =  ВыбранныйЭлемент.Значение;
		ВидЗаказаПриИзмененииНаСервере();
		ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ВыполнитьПроверкуСоответствияНоменклатурыИЗаявокНаОтгрузку(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивНоменклатурыВСсылке = Объект.Ссылка.Товары.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатурыВСсылке = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНоменклатурыВСсылке);
	
	МассивНоменклатурыВОбъекте = Объект.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатурыВОбъекте = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНоменклатурыВОбъекте);
	
	МассивыНоменклатурыИдентичны = ОбщегоНазначения.КоллекцииИдентичны(МассивНоменклатурыВСсылке, МассивНоменклатурыВОбъекте);
	
	Если НЕ МассивыНоменклатурыИдентичны Тогда
		// Будем проверять, содержатся ли предыдущие номенклатуры в заявках на отгрузку
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ЗаявкаНаОтгрузкуТовары.Ссылка КАК Ссылка,
			|	Лико_ЗаявкаНаОтгрузкуТовары.НомерСтроки КАК НомерСтроки,
			|	Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Номер КАК Номер,
			|	Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Дата КАК Дата
			|ИЗ
			|	Документ.Лико_ЗаявкаНаОтгрузку.Товары КАК Лико_ЗаявкаНаОтгрузкуТовары
			|ГДЕ
			|	НЕ Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.ПометкаУдаления
			|	И Лико_ЗаявкаНаОтгрузкуТовары.ЗаказКлиента = &ЗаказКлиента
			|	И Лико_ЗаявкаНаОтгрузкуТовары.Номенклатура В(&МассивНоменклатур)
			|	И Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.СостояниеЗаявки <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаявокНаТранспортировку.Закрыт)
			|
			|СГРУППИРОВАТЬ ПО
			|	Лико_ЗаявкаНаОтгрузкуТовары.Ссылка,
			|	Лико_ЗаявкаНаОтгрузкуТовары.НомерСтроки,
			|	Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Номер,
			|	Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Дата";
		
		Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатурыВСсылке);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СтрокаЗаявок = "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаЗаявок = СтрокаЗаявок + ?(ЗначениеЗаполнено(СтрокаЗаявок), ", ", "") + ВыборкаДетальныеЗаписи.Номер + " от " + Формат(ВыборкаДетальныеЗаписи.Дата, "ДФ=dd.MM.yy") + " (строка " + ВыборкаДетальныеЗаписи.НомерСтроки + ")";	
		КонецЦикла;

		Если ЗначениеЗаполнено(СтрокаЗаявок) Тогда
			Отказ = Истина;
			Сообщить("Вы изменили номенклатуру в заказе, которая уже содержится в заявке на отгрузку. Чтобы записать заказ, сначала нужно удалить заявку на отгрузку. Список заявок: " + СтрокаЗаявок);
		КонецЕсли;
	
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАвтоМонтаж(Отказ)
	ЕстьИзмениеия=Ложь;
	
	Если Объект.Площадка=Справочники.Лико_Площадки.Урал Тогда
		Если Объект.Ручьи<>Объект.Ссылка.Ручьи Или
			 Объект.ЭтикетокНаЛисте<>Объект.Ссылка.ЭтикетокНаЛисте Или Объект.Товары.Количество()<>Объект.Ссылка.Товары.Количество() Тогда
			 ЕстьИзмениеия=Истина;
		 КонецЕсли;
		 	Индекс=0; 
		 Если Не ЕстьИзмениеия Тогда 
		 Для каждого Товар Из Объект.Товары Цикл
			 
			 Если Товар.Количество<>Объект.Ссылка.Товары[Индекс].Количество Или 
				 Товар.Номенклатура<>Объект.Ссылка.Товары[Индекс].Номенклатура Тогда
				 ЕстьИзмениеия=Истина;
				 Прервать;
			КонецЕсли;
			Индекс=Индекс+1;
	
		КонецЦикла;
	КонецЕсли;	 
			 
	КонецЕсли;
	Если ЕстьИзмениеия Тогда
		СоздатьМонтаж();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СоздатьМонтаж()
	Отказ=Ложь;
	Тираж=Объект.Товары.итог("Количество");
	Если ЗначениеЗаполнено(Объект.РучьиПечатиИндиго) Тогда
		лРучьи=Объект.РучьиПечатиИндиго;
	ИначеЕсли ЗначениеЗаполнено(Объект.РучьиПечати) Тогда
		лРучьи=Объект.РучьиПечати;
	Иначе
		лРучьи=Объект.Ручьи;
	КонецЕсли;

	тираж_на_руч=Тираж/лРучьи;
	НомерТекущегоМонтажа=1;

	Для каждого Товар Из Объект.Товары Цикл
		//ручьев_эт= Товар.Количество/тираж_на_руч;
		ручьев_эт= Окр(Товар.Количество/тираж_на_руч,2);
		Если  ручьев_эт-Цел(ручьев_эт)<>0  Тогда
			Сообщить("По номенклатуре: "+Товар.Номенклатура.Наименование+" количество ручьев на этикетку дробное:"+Строка( ручьев_эт)+"."); 
			Отказ=Истина;
		КонецЕсли;
	КонецЦикла;

	Если Отказ Тогда
		Сообщить("Автозаполнение монтажа не выполнено!");
		Возврат;
	КонецЕсли;
	Объект.МонтажСхема.Очистить();
	Объект.МонтажСоответствия.Очистить();

	КоличествоСтрокМонтажа=Цел(Объект.ЭтикетокНаЛисте / лРучьи);
	Для каждого Товар Из Объект.Товары Цикл
		НовыйТовар= Объект.МонтажСоответствия.Добавить();
		НовыйТовар.Номенклатура= Товар.Номенклатура;
	КонецЦикла;
	Для Лист=1 По КоличествоСтрокМонтажа Цикл

		Ручей=0;
		Индекс=0;
		Для каждого Товар Из Объект.Товары Цикл
			Индекс=Индекс+1;
			//ручьев_эт= Товар.Количество/тираж_на_руч;
			ручьев_эт= Окр(Товар.Количество/тираж_на_руч,2);
			Если  ручьев_эт-Цел(ручьев_эт)<>0  Тогда
				//Сообщить("Количество ручьев рсчитано не првильно!"); 
				//Отказ=Истина;
			Иначе
				//Если Не Отказ Тогда
				Для Сч=1  По ручьев_эт Цикл
					Ручей=Ручей+1;
					//Индекс=Товар.ПолучитьИдентификатор()+1;

					ТекущийИндексСтроки = НомерТекущегоМонтажа*1000000 + Лист*1000 +Ручей;

					НовыйМС=Объект.МонтажСхема.Добавить();
					НовыйМС.ИндексСтроки=ТекущийИндексСтроки;
					НовыйМС.ИндексНоменклатуры=Индекс; 				 
				КонецЦикла;
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОповещений(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заказ", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
	ПараметрыОткрытия.Вставить("ПолныеПрава", ПроверитьДоступностьНаСервере("ПолныеПрава"));
	ОткрытьФорму("РегистрСведений.Лико_НастройкиОпововещенияОбЭтапахЗаказа.Форма.Форма", ПараметрыОткрытия);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьОтгрузкиНаСервере()
УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Отгрузки2Обороты.Регистратор КАК Регистратор,
	|	МИНИМУМ(Лико_Отгрузки2Обороты.Период) КАК Период,
	|	ВЫБОР
	|		КОГДА Лико_Отгрузки2Обороты.Регистратор ССЫЛКА Документ.ВнутреннееПотреблениеТоваров
	|			ТОГДА 2
	|		КОГДА Лико_Отгрузки2Обороты.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА 4
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ТипРегистратора
	|ИЗ
	|	РегистрНакопления.Лико_Отгрузки2.Обороты(, , Регистратор, Заказ = &Заказ) КАК Лико_Отгрузки2Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_Отгрузки2Обороты.Регистратор,
	|	ВЫБОР
	|		КОГДА Лико_Отгрузки2Обороты.Регистратор ССЫЛКА Документ.ВнутреннееПотреблениеТоваров
	|			ТОГДА 2
	|		КОГДА Лико_Отгрузки2Обороты.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА 4
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Заказ", Объект.ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл
		НаборЗаписейЗатратыПоЗаказу = РегистрыНакопления.Лико_ЗатратыПоЗаказуДляОтгрузки.СоздатьНаборЗаписей();
    	НаборЗаписейЗатратыПоЗаказу.Отбор.Регистратор.Установить(Выборка.Регистратор);
    	НаборЗаписейЗатратыПоЗаказу.Записать();
		
		НаборЗаписейОтгрузки = РегистрыНакопления.Лико_Отгрузки2.СоздатьНаборЗаписей();
	    НаборЗаписейОтгрузки.Отбор.Регистратор.Установить(Выборка.Регистратор);
	    НаборЗаписейОтгрузки.Записать();
	    
	    НаборЗаписейНормативы = РегистрыСведений.Лико_НормативыОтгрузки.СоздатьНаборЗаписей();
	    НаборЗаписейНормативы.Отбор.Регистратор.Установить(Выборка.Регистратор);
	    НаборЗаписейНормативы.Записать();


	КонецЦикла;
	Выборка.Сбросить();		
	Пока Выборка.Следующий() Цикл
		Отказ = Ложь;
		Если Выборка.ТипРегистратора = 1 Тогда
			Лико_Планирование.ЗаполнениеПараметровОтгрузки(Выборка.Регистратор.ПолучитьОбъект(), Отказ);
		иначеЕсли Выборка.ТипРегистратора = 2 Тогда
			Лико_Планирование.ЗаполнениеПараметровСписания(Выборка.Регистратор.ПолучитьОбъект(), Отказ);
		ИначеЕсли Выборка.ТипРегистратора = 4 Тогда
			Лико_Планирование.ЗаполнениеПродажпоАктамРабот(Выборка.Регистратор.ПолучитьОбъект(), Отказ);
		КонецЕсли;
		
		Если Отказ Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЦикла;
	ЗафиксироватьТранзакцию();

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОтгрузки(Команда)
	ПересчитатьОтгрузкиНаСервере();
	Элементы.ОтгрузкиИзРегистра.Обновить();


КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкиИзРегистраПриАктивизацииСтроки(Элемент)
	стр = Элементы.ОтгрузкиИзРегистра.ТекущиеДанные;
	Если стр<>Неопределено Тогда 
		Регистратор = стр.регистратор;
		НормативыНаОтгрузкиИзРегистра.Параметры.УстановитьЗначениеПараметра("Регистратор", Регистратор);
		ЗатратыПоОтгрузке.Параметры.УстановитьЗначениеПараметра("Регистратор", Регистратор);
		Если ЗначениеЗаполнено(стр.ДокументОтгрузки) Тогда 
			Возвраты.Параметры.УстановитьЗначениеПараметра("ДокументОтгрузки", стр.ДокументОтгрузки);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаВТабаш2(Команда)
	текстр = Элементы.ОтгрузкиИзРегистра.ТекущиеДанные;
	Если текстр<>Неопределено Тогда 
		ТабДокумент = ВыгрузкаВТабашНаСервере(Объект.Ссылка, ,,текстр.Регистратор,Истина);
		Если ТабДокумент<>Неопределено Тогда
			ТабДокумент.ТолькоПросмотр = Истина;
			ТабДокумент.АвтоМасштаб=Истина;
			ТабДокумент.ЭкземпляровНаСтранице=1;
			ТабДокумент.ОтображатьЗаголовки = Ложь;
			ТабДокумент.Показать();		
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗакрытьЗаказНаСервере()
	Если Не Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт;
		Объект.ДатаЗакрытия = ТекущаяДата();
		Записать();
		Лико_Планирование.ПеренестиЗаказ(Объект.ссылка, Справочники.Лико_ЭтапыВыполненияЗаказа.ЗакрытиеЗаказа);
		УстановитьПривилегированныйРежим(Истина);
		Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаказ(Команда)
	ЗакрытьЗаказНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьОтгрузку(Команда)
	текстр = Элементы.ОтгрузкиИзРегистра.ТекущиеДанные;
	ПоказатьЗначение(, текстр.регистратор);

КонецПроцедуры


&НаКлиенте
Процедура СкопироватьОтгрузку(Команда)
	текстр = Элементы.ОтгрузкиИзРегистра.ТекущиеДанные;
	Если текстр<> Неопределено Тогда 
		стр = Объект.отгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(стр, текстр);
		стр.документОтгрузки = текстр.регистратор;
		стр.дата = текстр.период;
		стр.КвадратныйМетраж = текстр.МетражКВМ;
		стр.ПогонныйМетраж = текстр.МетражПМ;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьОбразецЦветаКонтрольныйОттискЕслиНеУрал()
	
	Если Объект.Площадка <> Справочники.Лико_Площадки.Урал Тогда
		Для каждого стр Из Объект.ОбразцыЦвета Цикл
			Если стр.ОбразецЦвета = Перечисления.Лико_ОбразцыЦвета.КонтрольныйОттиск Тогда
				Объект.ОбразцыЦвета.Удалить(стр);
				ПоказатьОбразцыЦвета();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Площадка) Тогда
		Объект.Склад = ЗначениеРеквизита(Объект.Площадка, "СкладГП");
		// <-- Начало Лико Яцун С. В.   
		ОбновитьК_Дох();
		// <-- Конец Лико Яцун С. В.  
	КонецЕсли;
	ОчиститьОбразецЦветаКонтрольныйОттискЕслиНеУрал();
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьК_Дох() // <-- Начало Лико Яцун С. В.
	
	К_Дох = Лико_Планирование.ПолучитьКоэффициентНалоговВДоходности(ТекущаяДата(), Объект.Площадка);

КонецПроцедуры // <-- Конец Лико Яцун С. В.

&НаКлиенте
Процедура ЗаказОсновногоМатериалаОткрытие(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ЗаказосновногоМатериала) Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ДопПараметры = Новый Структура("ОсновнойМатериал", Истина);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСозданииЗаказаОсновногоМатериала", ЭтаФорма,ДопПараметры);
		ПоказатьВопрос(Оповещение, "Создать Заказ на основание?", Режим,0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСозданииЗаказаОсновногоМатериала(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		ЗаказПФ = СоздатьЗаказНаполуфабрикат(ДопПараметры);
		ПараметрыФормы = новый Структура("Ключ", ЗаказПФ);
		ФормаЗаказа = ПолучитьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);
		ФормаЗаказа.Открыть();
		Объект.ЗаказОсновногоМатериала = ЗаказПФ;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  СоздатьЗаказНаполуфабрикат(ДопПараметры)
	НовыйЗаказ =  Документы.ЗаказКлиента.СоздатьДокумент();
	НовыйЗаказ.ИнициализироватьНачальныеПараметры(Неопределено);
	НовыйЗаказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Полуфабрикат;
	НовыйЗаказ.Партнер = Объект.Партнер;
	НовыйЗаказ.Контрагент = Объект.Контрагент;
	НовыйЗаказ.Соглашение = Объект.Соглашение;
	НовыйЗаказ.Договор = Объект.Договор;
	НовыйЗаказ.Организация = Объект.Организация;
	НовыйЗаказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.Новый;
	НовыйЗаказ.Регион = Объект.Регион;
	НовыйЗаказ.Площадка = Объект.Площадка;
	НовыйЗаказ.Валюта = Объект.Валюта;
	НовыйЗаказ.ВалютаДляДокументов = Объект.ВалютаДляДокументов;
	НовыйЗаказ.Дата = ТекущаяДата();
	НоменклатураИсходногоЗаказа = Объект.Товары[0].Номенклатура;
	
	ТЧТовары = НовыйЗаказ.Товары;
	НоваяСтрокаПФ = ТЧТовары.Добавить();
	НоваяСтрокаПФ.Номенклатура = Лико_Планирование.СоздатьНоменклатуруНаСервере(?(ДопПараметры.ОсновнойМатериал, "Оснаование ", "Вклейка ") + НоменклатураИсходногоЗаказа.Наименование, Перечисления.Лико_ТипыЭтикеток.ЭТ, Объект.Регион, Объект.Партнер);
	НоваяСтрокаПФ.КоличествоУпаковок = Объект.Товары[0].КоличествоУпаковок;
	НоваяСтрокаПФ.Количество = Объект.Товары[0].Количество;
	НовыйЗаказ.Записать();
	Возврат НовыйЗаказ.Ссылка;	
КонецФункции


&НаКлиенте
Процедура ОткрытьБланк(Команда)
	текстр = Элементы.ЗатратыПоБланкам.ТекущиеДанные;
	ПоказатьЗначение(, текстр.Бланк);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъемПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	ТекущийОбъем = Элементы.Товары.ТекущиеДанные.Объем;
	ЗаписатьОбъемВДопСвойствоНоменклатуры(ТекущаяСтрока, ТекущийОбъем);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъемВДопСвойствоНоменклатуры(ТекущаяСтрока, ТекущийОбъем)
	
	стр = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	ТЗСвойстваИЗначения = Новый ТаблицаЗначений;
	ТЗСвойстваИЗначения.Колонки.Добавить("Свойство");
	ТЗСвойстваИЗначения.Колонки.Добавить("Значение");
	НоваяСтрока = ТЗСвойстваИЗначения.Добавить();
	НоваяСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","Стикер_Объем");
	НоваяСтрока.Значение = ТекущийОбъем;
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(стр.Номенклатура, ТЗСвойстваИЗначения);
КонецПроцедуры

&НаСервере
Процедура РабочийЦентрПриИзмененииНаСервере()
	ВидРЦ = Объект.РабочийЦентр.ВидРабочегоЦентра;
КонецПроцедуры

&НаКлиенте
Процедура РабочийЦентрПриИзменении(Элемент)
	РабочийЦентрПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаДеньгиПриИзменении(Элемент)
	// --> Начало Лико Митюшин МФМ 07.07.2021
	ОчисткаЦенВТоварахНеЗаДеньги();
	// <-- Конец Лико Митюшин МФМ 07.07.2021
	УстановитьВидимостьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЗатратыПоЗаказу(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("Заказ", Объект.Ссылка));
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	//Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "ПланФактныйАнализЗатратПоЗаказу");
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,"Отчет ""Отчет лк Затраты по заказу""");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСозданииЗаказаМатериала(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		ЗаказПФ = СоздатьЗаказНаполуфабрикат(ДопПараметры);
		ПараметрыФормы = новый Структура("Ключ", ЗаказПФ);
		ФормаЗаказа = ПолучитьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента", ПараметрыФормы);
		ФормаЗаказа.Открыть();
		Элементы.Цвета.ТекущиеДанные.ЗаказМатериала = ЗаказПФ;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьНоменклатуруНаСервере(ОставитьНоменклатуру=Ложь)
	Если Объект.РабочийЦентр = Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",9) Тогда
		Объект.НоменклатураDFM = Истина;
	//ИначеЕсли Объект.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка Тогда
	//	Объект.НоменклатураDFM = Ложь;
	Иначе
		Объект.НоменклатураDFM = Ложь;
	КонецЕсли;
	
	Если Объект.НоменклатураDFM Тогда
		
		Элементы.ТоварыНоменклатура.ТолькоПросмотр = Истина;
		
		Если Не ОставитьНоменклатуру ТОгда
		Для каждого Товар Из Объект.Товары Цикл		
			Товар.Номенклатура = Неопределено;							
		КонецЦикла;
		КонецЕсли;
	Иначе
		Элементы.ТоварыНоменклатура.ТолькоПросмотр = Ложь;
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьРц9Насервере () //+Лико m.shenderov 05.05.2021
	Возврат Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер",9);
КонецФункции //-Лико m.shenderov 05.05.2021 

Функция ВыполнитьПроверкуТехнологииПродукта(РЦ) //+Лико m.shenderov 05.05.2021
	Отказ=Ложь;
	ТехнологияПечати=РЦ.ВидРабочегоЦентра.лкТехнологияПечати;
	Если ТехнологияПечати=Справочники.Лико_ТехнологияПечати.GallusInkjet Тогда
		НомерСтроки=0;
		Для Каждого Товар Из Объект.Товары Цикл
			Если Товар.ВерсияНоменклатуры.ТехнологияПечати<>ТехнологияПечати Тогда
				Отказ=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Продукт: %1 не соответсвует технологии! Создатйте версиию продукта с технологией:%2.",Товар.Номенклатура,ТехнологияПечати);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита 
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить(); 			
			КонецЕсли;
			НомерСтроки=НомерСтроки+1	
		КонецЦикла;
	КонецЕсли;
	Если  Отказ Тогда
			Возврат Ложь;		
	КонецЕсли;
	
	Объект.РабочийЦентр = РЦ;
	ЗаблокироватьНоменклатуруНаСервере(Истина);
	Возврат Истина;
КонецФункции //-Лико m.shenderov 05.05.2021




&НаСервере 
Функция ПолучитьНоменклатуруИВерсиюПоАртикулуНаСервере(Артикул)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Лико_ВерсииНоменклатуры.Номенклатура КАК Номенклатура,
	               |	Лико_ВерсииНоменклатуры.Артикул КАК Артикул,
	               |	Лико_ВерсииНоменклатуры.Версия КАК НомерВерсии,
	               |	Лико_ВерсииНоменклатуры.Ссылка КАК Версия
	               |ИЗ
	               |	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	               |ГДЕ
	               |	Лико_ВерсииНоменклатуры.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 1 Тогда 
		Версия = Новый Структура("Номенклатура,Версия,НомерВерсии", Результат[0].Номенклатура, Результат[0].Версия, Результат[0].НомерВерсии);
	ИначеЕсли Результат.Количество() = 0 Тогда
		Версия = "В 1С версия Номенклатуры с данным Артикулом не обнаружена. Обратитесь к программистам.";
	ИначеЕсли Результат.Количество() > 1 Тогда
		Версия = "В 1С обнаружено несколько версий Номенклатуры с данным артикулом. Обратитесь к программистам.";
	КонецЕсли;
	
	Возврат Версия;	
КонецФункции

&НаСервере 
Функция ЗаполнитьСписокВидовНоменклатурыНасервере()
	
	
КонецФункции

&НаКлиенте
Асинх Процедура ТоварыАртикулПриИзменении180621(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Артикул) Тогда
		ВерсияНоменклатуры = ПолучитьНоменклатуруИВерсиюПоАртикулуНаСервере(ТекущаяСтрока.Артикул);
	КонецЕсли;
	
	Если ТипЗнч(ВерсияНоменклатуры) = Тип("Строка") Тогда
		Сообщить(ВерсияНоменклатуры);
		ТекущаяСтрока.Артикул=ПолучитьАртикулИзСправочникаВерсииНоменклатуры(ТекущаяСтрока.Номенклатура,ТекущаяСтрока.ВерсияНоменклатуры);
		Возврат;
	Иначе
		Партнер=ПолучитьСвойствоОбъектаПартнерСервер(ВерсияНоменклатуры.Номенклатура);
		ЕСли Объект.Партнер<>Партнер Тогда 
			 ТекущаяСтрока.Артикул=ПолучитьАртикулИзСправочникаВерсииНоменклатуры(ТекущаяСтрока.Номенклатура,ТекущаяСтрока.ВерсияНоменклатуры); 
			ТекстВопроса=СтрШаблон("Указанный продукт принадлежит другому клиенту: %1, Создать одноименный продукт для текущего клиента? ",Партнер);
			СЗ = Новый СписокЗначений;
			Сз.Добавить("Создать","Создать");
			Сз.Добавить("Отменить","Отменить");
			Ответ =Ждать ВопросАсинх(ТекстВопроса,Сз,0);
			  Если Ответ = "Создать" Тогда
                 СоздатьНоменклатуруDFM2(Неопределено);
			  КонецЕсли; 			
              Возврат;
		КонецЕсли;	 
		ТекущаяСтрока.Номенклатура = ВерсияНоменклатуры.Номенклатура;
		ТекущаяСтрока.ВерсияНоменклатуры = ВерсияНоменклатуры.Версия;
		ТекущаяСтрока.Версия = ВерсияНоменклатуры.НомерВерсии;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		СкрытьЛишниеКнопкиДляНоменклатурыDFM(ТекущаяСтрока.Номенклатура);
		ТекущаяСтрока.НаименованиеДляДокументов=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура,"НаименованиеПолное");
	Иначе
		ТекущаяСтрока.НаименованиеДляДокументов = "";
		//  Список = Новый СписокЗначений;
		//Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
		//Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.КЭ"));
		//Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.Кльр"));
		//Позиция = Список.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
		//ОписаниеОповещения= Новый ОписаниеОповещения("ВыборТипаЭтикеткиЗавершение",ЭтаФорма);
		//ПоказатьВыборИзСписка(ОписаниеОповещения,Список,,Позиция);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ТоварыАртикулПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Артикул) Тогда
		лВерсияНоменклатуры = ПолучитьНоменклатуруИВерсиюПоАртикулуНаСервере(ТекущаяСтрока.Артикул);
	КонецЕсли;
	
	Если ТипЗнч(лВерсияНоменклатуры) = Тип("Строка") Тогда
		Сообщить(лВерсияНоменклатуры);
		ТекущаяСтрока.Артикул=ПолучитьАртикулИзСправочникаВерсииНоменклатуры(ТекущаяСтрока.Номенклатура,ТекущаяСтрока.ВерсияНоменклатуры);
		Возврат;
	Иначе
		Партнер=ПолучитьСвойствоОбъектаПартнерСервер(лВерсияНоменклатуры.Номенклатура);
		ЕСли Объект.Партнер<>Партнер Тогда 
			Номенклатура=лВерсияНоменклатуры.Номенклатура;
			Артикул=ТекущаяСтрока.Артикул;
			ТекущаяСтрока.Артикул=ПолучитьАртикулИзСправочникаВерсииНоменклатуры(ТекущаяСтрока.Номенклатура,ТекущаяСтрока.ВерсияНоменклатуры); 
			ТекстВопроса=СтрШаблон("Вы пытаетесь вставить в текущий заказ следующий продукт:
			|
			|Артикул: %1
			|
			|Наименование: %2
			|
			|Однако, указанный продукт принадлежит другому клиенту, 
			|Создать одноименный продукт для текущего клиента? ",Артикул,Номенклатура);
			//СЗ = Новый СписокЗначений;
			//Сз.Добавить("Создать","Создать");
			//Сз.Добавить("Отменить","Отменить");
			//Ответ =Ждать ВопросАсинх(ТекстВопроса,Сз,0);
			Ответ =Ждать ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет,0);

			//Если Ответ = "Создать" Тогда
			 Если Ответ = КодВозвратаДиалога.Да Тогда
	
                 СоздатьНоменклатуруDFM22(лВерсияНоменклатуры.Номенклатура);
			  КонецЕсли; 			
              Возврат;
		КонецЕсли;	 
		ТекущаяСтрока.Номенклатура = лВерсияНоменклатуры.Номенклатура;
		ТекущаяСтрока.ВерсияНоменклатуры = лВерсияНоменклатуры.Версия;
		ТекущаяСтрока.Версия = лВерсияНоменклатуры.НомерВерсии;
		ТекущаяСтрока.АртикулСтарый=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура,"Лико_АртикулСтарый");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		СкрытьЛишниеКнопкиДляНоменклатурыDFM(ТекущаяСтрока.Номенклатура);
		ТекущаяСтрока.НаименованиеДляДокументов=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура,"НаименованиеПолное");
	Иначе
		ТекущаяСтрока.НаименованиеДляДокументов = "";
		//  Список = Новый СписокЗначений;
		//Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
		//Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.КЭ"));
		//Список.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.Кльр"));
		//Позиция = Список.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.Лико_ТипыЭтикеток.ЭТ"));
		//ОписаниеОповещения= Новый ОписаниеОповещения("ВыборТипаЭтикеткиЗавершение",ЭтаФорма);
		//ПоказатьВыборИзСписка(ОписаниеОповещения,Список,,Позиция);
		
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура СоздатьНоменклатуруDFM22(НоменклатураНаименование)
	DFMКлиент.СоздатьНоменклатуруВерсию2(ЭтаФорма,,НоменклатураНаименование); 	
КонецПроцедуры


//&НаКлиенте
//Процедура ВыборТипаЭтикеткиЗавершение(РезультатФормы, ПараметрыФормы) Экспорт
//	Если РезультатФормы = Неопределено Тогда		
//		Возврат;
//	КонецЕсли;
//	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
//	ТипЭтикетки = РезультатФормы.Значение;
//	Структура = Новый Структура("ТипЭтикетки", ТипЭтикетки);
//	ОписаниеОповещения= Новый ОписаниеОповещения("ВводНаименованияНоменклатурыЗавершение",ЭтаФорма,Структура);
//	ПоказатьВводСтроки(ОписаниеОповещения,ЗначениеРеквизита(ТекущаяСтрока.Номенклатура,"Наименование"),"Введите наименование новой номенклатуры");
//КонецПроцедуры

//&НаКлиенте
//Процедура ВводНаименованияНоменклатурыЗавершение(РезультатФормы, ПараметрыФормы) Экспорт
//	    			
//	Если РезультатФормы <> Неопределено Тогда    
//		Номенклатура = СоздатьНоменклатуруНаСервере(РезультатФормы, ПараметрыФормы.ТипЭтикетки);
//		Элементы.Товары.ТекущиеДанные.Номенклатура = Номенклатура;
//	КонецЕсли; 	
//		
//КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Номенклатура = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Если ЗначениеРеквизита(Номенклатура, "Лико_DFM") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыПолученияДанных.СтрокаПоиска = "";
			Если ДанныеВыбора <> Неопределено Тогда
				ДанныеВыбора.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаименованиеНаСервере(ТекущаяСтрока, Наименование, Реквизит)
	Строка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	ОбъектНом = Строка.Номенклатура.ПолучитьОбъект();
	ОбъектНом[Реквизит] = Наименование;
	ОбъектНом.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаименованиеДляДокументовПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	ТекущееНаименование = Элементы.Товары.ТекущиеДанные.НаименованиеДляДокументов;
	Если ЗначениеЗаполнено(ТекущееНаименование) Тогда
		ЗаписатьНаименованиеНаСервере(ТекущаяСтрока, ТекущееНаименование, "НаименованиеПолное");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Поле = Элементы.ТоварыНоменклатура Тогда
		Если ЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "Лико_DFM") Тогда
			СтандартнаяОбработка = Ложь;		
			// --> Начало Лико Ефимов ЕВВ 26.05.2021
			// Проверим, содержится ли эта позиция в других заказах. Если содержится, то запретим ее менять:
			//	- если 9-ка, то просто напишем соопщение о запрете;
			//	- если не 9-ка, то спросим нужно ли ее очистить. Если нужно очистить, то очищаем и убираем
			НомерПредыдущегоЗаказа = ПроверитьИспользованиеНоменклатурыВДругихЗаказах(ТекущаяСтрока.Номенклатура, Объект.Ссылка);
			Если ЗначениеЗаполнено(НомерПредыдущегоЗаказа) Тогда
				Если Объект.НоменклатураDFM Тогда
					// Просто запретим менять
					Сообщить("Номенклатура """ + ТекущаяСтрока.Номенклатура + """ является номенклатурой DFM и уже используется в заказе " + НомерПредыдущегоЗаказа + ". Изменять название запрещено");
				Иначе
					// Спросим, нужно ли очищать номенклатуру
					ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросОНеобходимостиОчищатьНоменклатуру", ЭтотОбъект);
					ПоказатьВопрос(ОписаниеОповещения, "Номенклатура """ + ТекущаяСтрока.Номенклатура + """ является номенклатурой DFM, она используется в другом заказе (" + НомерПредыдущегоЗаказа + "). Очистить номенклатуру?", РежимДиалогаВопрос.ДаНетОтмена);
				КонецЕсли;
			Иначе
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаНаименованияНоменклатурыDFM",ЭтаФорма); 
				ПоказатьВводСтроки(ОписаниеОповещения,ЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "Наименование"),"Введите новое наименование для Номенклатуры");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьИспользованиеНоменклатурыВДругихЗаказах(Номенклатура, Заказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Ссылка.НомерБезПрефикса КАК НомерБезПрефикса
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура = &Номенклатура
		|	И ЗаказКлиентаТовары.Ссылка <> &Ссылка
		|	И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерБезПрефикса;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтветНаВопросОНеобходимостиОчищатьНоменклатуру(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		ТекущаяСтрока.Номенклатура = Неопределено;
		ТоварыНоменклатураПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНаименованияНоменклатурыDFM(РезультатФормы, ПараметрыФормы) Экспорт
	Если РезультатФормы <> Неопределено Тогда
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		ИдентификторСтроки = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		ЗаписатьНаименованиеНаСервере(ИдентификторСтроки, РезультатФормы, "Наименование");
		ЗаписатьНаименованиеНаСервере(ИдентификторСтроки, Строка(ЗначениеРеквизита(ТекущаяСтрока.Номенклатура,"Лико_ТипЭтикетки")) + " " + РезультатФормы, "НаименованиеПолное");
		ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));
		ТекущаяСтрока.НаименованиеДляДокументов = ЗначениеРеквизита(ТекущаяСтрока.Номенклатура, "НаименованиеПолное");
		Элементы.Товары.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуСДругойНамоткой(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВВодаКоличестваЭтикеток", ЭтаФорма);
	ПоказатьВводЧисла(ОписаниеОповещения,,"Укажите количество этикеток в тыс. шт.",15,0);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаменуНаправления(ТекущаяНамотка)
	Намотка1 = Справочники.Лико_Намотка.НайтиПоНаименованию("1");
	Намотка2 = Справочники.Лико_Намотка.НайтиПоНаименованию("2");
	Намотка3 = Справочники.Лико_Намотка.НайтиПоНаименованию("3");
	Намотка4 = Справочники.Лико_Намотка.НайтиПоНаименованию("4");
	ЗаменаНаправления = Новый Соответствие;
	ЗаменаНаправления.Вставить("1",Намотка2);
	ЗаменаНаправления.Вставить("2",Намотка1);
	ЗаменаНаправления.Вставить("3",Намотка4);
	ЗаменаНаправления.Вставить("4",Намотка3);
	
	Замена = ЗаменаНаправления.Получить(ТекущаяНамотка);
	
	Возврат Замена;
КонецФункции

&НаКлиенте
Процедура ПослеВВодаКоличестваЭтикеток(Результат, Параметры) Экспорт
	
	ПогонныйМетраж = РассчитатьМетражНаСервере(Результат*1000, Объект.Нарезка);
	Если ПогонныйМетраж > 15000 Тогда
		Сообщить("Количество превышает допустимое для перемотки, для него нужно выписать новый заказ!");
	//+ Лико Субботин 03.12.2021	
	ИначеЕсли ПогонныйМетраж > 3000 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Оповещение = Новый ОписаниеОповещения("ВопросНеобходимостиДопПеремотки", ЭтаФорма, Результат);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Для выполнения заказа c указанным комплектом форм потребуется дополнительная перемотка. 
						|Производство может на своё усмотрение изготовить полный комплект форм с необходимым направлением печати.
						|Добавить строку с другим направлением?'"), Режим,0);
			
	Иначе
		
		ДобавитьСтрокуСДругимНаправлением(Результат);
	//- Лико Субботин 03.12.2021
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуСДругимНаправлением(Результат)
	
		НоваяСтрокаТЧТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧТовары,Элементы.Товары.ТекущиеДанные);
		НоваяСтрокаТЧТовары.КоличествоУпаковок = Результат;
		ТекущаяНамотка = ЗначениеРеквизита(Элементы.Товары.ТекущиеДанные.Направление,"Наименование");
		НоваяСтрокаТЧТовары.Направление = ПолучитьЗаменуНаправления(ТекущаяНамотка); 
		СтруктураДействий = Новый Структура;
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);	
	
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрокаТЧТовары, СтруктураДействий, КэшированныеЗначения);
	
		РасчитатьТиражМетраж();

		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		ПоказатьДоходностьРентабельность();


КонецПроцедуры

&НаКлиенте
Процедура ВопросНеобходимостиДопПеремотки(Результат, ДопПараметры ) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Или Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;		
	Иначе 		
		ДобавитьСтрокуСДругимНаправлением(ДопПараметры);		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура УдалитьСтрокуПолногоПовтора(Команда)
	Если Объект.ВидЗаказа =  ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПолныйПовтор") Тогда 
		Если ЗначениеРеквизита(Объект.РабочийЦентр,"ВидРабочегоЦентра")    <> ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPS") Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	текстр = Элементы.Товары.ТекущиеДанные;
	Объект.Товары.Удалить(текстр.номерстроки-1);
КонецПроцедуры


&НаКлиенте
Процедура ВидКонтактаСПищевойПродукциейПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
	Если Объект.ВидКонтактаСПищевойПродукцией <> ПредопределенноеЗначение("Справочник.Лико_ВидыКонтактовСПищевойПродукцией.ПрямойКонтакт") ИЛИ Не ЗначениеЗаполнено(Объект.ВидКонтактаСПищевойПродукцией) Тогда
		Объект.ОсновнойМатериалКонтактныйСлой = Ложь;
		Для Каждого стр Из Объект.Цвета Цикл
			стр.КонтактныйСлой = Ложь;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
//<-- o.pukhova

//--> o.pukhova 13102020
&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.ВключенВПлан") ИЛИ  Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Создан") Тогда
		НомерЗаказа = "";
		Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераЗаказа", ЭтаФорма,);
		ПоказатьВводСтроки(Оповещение,НомерЗаказа,"Введите номер заказа.",7);
	Иначе
		Сообщить("Данные копируются только для заказов со статусом Создан или Включен в план!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераЗаказа(РезультатФормы, ПараметрыФормы) Экспорт
	Если РезультатФормы <> Неопределено Тогда
		Заказ = ПолучитьЗаказПоНомеру(РезультатФормы);
		Если Заказ <> Неопределено Тогда		
			ДопПараметры  = Новый Структура("Заказ", Заказ);
			СписокЗаполнения = Новый СписокЗначений;
			СписокЗаполнения.Добавить("Этикетки");
			СписокЗаполнения.Добавить("Цвета");
			//СписокЗаполнения.Добавить("Виды работ");
			//СписокЗаполнения.Добавить("Параметры штампа"); 
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораТЧДляЗаполненияЗаказа", ЭтаФорма, ДопПараметры);
			СписокЗаполнения.ПоказатьОтметкуЭлементов(Оповещение,"Выберите ТЧ для копирования.");
		Иначе
			Сообщить("Заказа с данным номером нет в базе данных!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТЧДляЗаполненияЗаказа(Список, ПараметрыФормы) Экспорт
	Для Каждого Элемент Из Список Цикл
		Если Элемент.Пометка Тогда
			Если Элемент.Значение = "Этикетки" Тогда
				СкопироватьДанныеИзЗаказаНаСервере(ПараметрыФормы.Заказ,"Товары");
			ИначеЕсли Элемент.Значение = "Цвета" Тогда
				СкопироватьДанныеИзЗаказаНаСервере(ПараметрыФормы.Заказ,Элемент.Значение);
				СкопироватьДанныеИзЗаказаНаСервере(ПараметрыФормы.Заказ,"Формы");
				ЗаписатьЦветаВРаботы();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаказПоНомеру(Номер)
	Заказ = Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерБезПрефикса", Номер);
	Возврат Заказ;
КонецФункции

&НаСервере
Процедура СкопироватьДанныеИзЗаказаНаСервере (Заказ, ТЧ)
	Если ТЧ = "ПараметрыШтампа" Тогда
		Объект.Нарезка = Заказ.Нарезка;
		Объект.ДлинаЭтикетки = Заказ.ДлинаЭтикетки;
		Объект.Ручьи = Заказ.Ручьи;
		Объект.ШагПечати = Заказ.ШагПечати;
		Объект.ЭтикетокНаЛистеИндиго = Заказ.ЭтикетокНаЛистеИндиго;
		Объект.ШтампВырубной = Заказ.ШтампВырубной;
		Объект.ЭтикетокНаЛисте = Заказ.ЭтикетокНаЛисте;
		Объект.ШиринаЭтикетки = Заказ.ШиринаЭтикетки;
		Объект.Z = Заказ.Z;
		Объект.ДлинаПечати = Заказ.ДлинаПечати;
		Объект.КоличествоКликов = Заказ.КоличествоКликов;
		// --> Начало Лико Митюшин МФМ 07.04.2021
		//Автоматическая замена ручьёв Печати при изменение параметров Штампа
		Объект.РучьиПечати = Заказ.РучьиПечати;
		// <-- Конец Лико Митюшин МФМ  07.04.2021
	Иначе
		ТЗОбъектаКопирования = Заказ[ТЧ].Выгрузить();
		Объект[ТЧ].Очистить();
		Объект[ТЧ].Загрузить(ТЗОбъектаКопирования);
	КонецЕсли;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры
//--> o.pukhova 13102020

//--> o.pukhova 29102020
&НаКлиенте
Процедура ОператорыТУКартаСнятияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого стр из Объект.КартаСнятия Цикл
		СписокВыбора.Добавить(стр.НомерКарты);
	КонецЦикла;	
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяТЧ", "ОператорыТУ");
	ДопПараметры.вставить("ИмяРеквизита","КартаСнятия"); 
	ОписаниеОповещения = Новый ОписаниеОповещения("КартаСнятияРасходаВыборИзСпискаЗавершение", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ОператорыТУКартаРасходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого стр из Объект.КартаПерерасхода Цикл
		СписокВыбора.Добавить(стр.НомерКарты);
	КонецЦикла;	
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяТЧ", "ОператорыТУ");
	ДопПараметры.вставить("ИмяРеквизита","КартаРасхода"); 
	ОписаниеОповещения = Новый ОписаниеОповещения("КартаСнятияРасходаВыборИзСпискаЗавершение", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВнутреннийДиаметрПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.ДиаметрРоликаФакт = 0;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоЭтикетокВРоликеПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.ДиаметрРоликаФакт = 0;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаИзмененияШтКВМ()
	Возврат Объект.ШтКВМ <> ПолучитьШтКВМИзЗаказа(Объект.Ссылка);
КонецФункции

&НаСервере
Функция ПолучитьШтКВМИзЗаказа(Заказ)
	Возврат Заказ.ШтКВМ;
КонецФункции

&НаСервере
Функция УдельныйВесПоЦеновымГруппамЗаказа()
	УдельныйВесОсновногоМатериала = 0;
	УдельныйВесМатериалаВидовРабот = 0;
	УдельныйВес = 0;
	Если ЗначениеЗаполнено(Объект.ОсновнойМатериал) Тогда
		Если ТипЗнч(Объект.ОсновнойМатериал) = ТИП("СправочникСсылка.ЦеновыеГруппы") Тогда
			ОсновнойМатериал = Объект.ОсновнойМатериал
		Иначе
			ОсновнойМатериал = Объект.ОсновнойМатериал.ЦеноваяГруппа;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОсновнойМатериал.Лико_УдельныйВес) Тогда
			УдельныйВесОсновногоМатериала = ОсновнойМатериал.Лико_УдельныйВес;
			УдельныйВесМатериалаВидовРабот = 0;
			Для каждого стр Из Объект.Цвета Цикл
				Если ЗначениеЗаполнено(стр.Материал) Тогда
					МатериалВидовРабот = стр.Материал;
					Если ТипЗнч(МатериалВидовРабот) = ТИП("СправочникСсылка.ЦеновыеГруппы") И ЗначениеЗаполнено(МатериалВидовРабот.Лико_УдельныйВес) Тогда
						УдельныйВесМатериалаВидовРабот = УдельныйВесМатериалаВидовРабот + МатериалВидовРабот.Лико_УдельныйВес;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	УдельныйВес = УдельныйВесОсновногоМатериала + УдельныйВесМатериалаВидовРабот; 
	Возврат УдельныйВес;
КонецФункции

&НаСервере
Функция ПолучитьСухойОстаток(Вал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Лико_ПараметрыШтампа.СухойОстаток КАК СухойОстаток,
	               |	Лико_ПараметрыШтампа.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	               |ГДЕ
	               |	Лико_ПараметрыШтампа.Номенклатура = &Вал";
	Запрос.УстановитьПараметр("Вал",Вал);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].СухойОстаток
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УдельныйВесКраскиЗаказа()
	
	УдельныйВесКраски = 0;
	Для каждого стрЦвета Из Объект.Цвета Цикл
		
		Если ЗначениеЗаполнено(стрЦвета.Грамматура) Тогда
			Грамматура = стрЦвета.Грамматура
		Иначе
			Грамматура = 1;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрЦвета.ПроцентЗаливки) Тогда
			ПроцентЗаливки = стрЦвета.ПроцентЗаливки/100;
		Иначе
			ПроцентЗаливки = 100/100;
		КонецЕсли;
		
		Если стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ГлубокаяПечать ИЛИ стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ГлубокаяЛаминация Тогда	
			Если ЗначениеЗаполнено(стрЦвета.ТипКраски.Лико_УдельныйВес) Тогда
				УдельныйВесКраски = УдельныйВесКраски + (стрЦвета.ТипКраски.Лико_УдельныйВес * ПроцентЗаливки);
			КонецЕсли;
			Продолжить;
		ИначеЕсли стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ФлексоПечать Тогда
			КоэффициентКраскопереносаФлексоКраскиДляВеса = РегистрыСведений.Лико_ЗначенияКоэффициентовПереноса.СрезПоследних(ТекущаяДата(),Новый Структура("Площадка,Коэффициент",Объект.Площадка.Организация,Справочники.Лико_КоэффициентыДляРасчетов.КоэффициентКраскопереносаФлексоКраскиДляВеса));
			Если КоэффициентКраскопереносаФлексоКраскиДляВеса.Количество() > 0 Тогда
				КоэффициентКраскопереносаФлексоКраскиДляВеса = КоэффициентКраскопереносаФлексоКраскиДляВеса[0].Значение;
			Иначе
				Сообщить("Для организации " + Объект.Площадка.Организация + " не установлено значение ""Коэффициент краскопереноса флексо краски для веса""");
			КонецЕсли;
			УдельныйВесКраски = УдельныйВесКраски + (Грамматура * ПроцентЗаливки * КоэффициентКраскопереносаФлексоКраскиДляВеса);
			Продолжить;
		ИначеЕсли стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.ОфсетнаяПечать ИЛИ стрЦвета.ВидСекции = Справочники.Лико_ВидыСекций.БессольвентнаяЛаминация Тогда	
			УдельныйВесКраски = УдельныйВесКраски + (Грамматура * ПроцентЗаливки);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат УдельныйВесКраски;
	
КонецФункции

&НаСервере
Функция МетражКвМПоУдельномуВесу(стрВес,ШагПечати)
	УдельныйВес = УдельныйВесПоЦеновымГруппамЗаказа();
	УдельныйВесКраски = УдельныйВесКраскиЗаказа();
	МетражКвМ = 0;
	Если ЗначениеЗаполнено(стрВес) И УдельныйВес <> 0 Тогда
		МетражКвМ = стрВес/(((УдельныйВес + УдельныйВесКраски)/1000)+ ВесЗиппера(ШагПечати));
	КонецЕсли;
	
	Возврат МетражКвМ;
КонецФункции

&НаСервере
Функция ВесЗиппера(ШагПечати)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаЦвета.Ссылка КАК Ссылка,
	               |	ЗаказКлиентаЦвета.ВидСекции КАК ВидРабот
	               |ИЗ
	               |	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	               |ГДЕ
	               |	ЗаказКлиентаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.УстановкаЗиппера)
	               |	И ЗаказКлиентаЦвета.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	КоличествоЗип = Результат.Количество();
	Вес = КоличествоЗип*(4*Объект.Ручьи/1000)*ШагПечати;
	Возврат Вес;
КонецФункции

&НаСервере
Процедура ПересчитатьКоличествоВесНаСервере(Идентификатор,Имя) 
	стр = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	
	Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда
		Если Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Пакеты Тогда
			ШагПечати = Объект.ЭтМЭР;
			ШиринаН = Объект.ДлинаЭтикетки*2/1000 + Объект.ГлубинаДнаПакета*2/1000
		ИначеЕсли Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда
			ШагПечати = Объект.ЭтМЭР;
			ШиринаН = Объект.ШиринаЭтикетки/1000;
		Иначе
			ШагПечати = Объект.ЭтМЭР;
			ШиринаН = Объект.ДлинаЭтикетки/1000;
		КонецЕсли;
		
		лРучьи = ?(ЗначениеЗаполнено(Объект.РучьиПечати),Объект.РучьиПечати,Объект.РучьиПечатиИндиго);
			
		Если ЗначениеЗаполнено(ШиринаН) И ЗначениеЗаполнено(ШагПечати) И ЗначениеЗаполнено(лРучьи) Тогда
			Если Имя = "ТоварыКоличествоУпаковок" Тогда
				Если ЗначениеЗаполнено(стр.Количество) Тогда
					МетражПМПоКоличеству = стр.Количество*1000*ШагПечати/лРучьи;
					МетражКвМПоКоличеству = МетражПМПоКоличеству*(ШиринаН)*лРучьи;
					стр.Вес = Окр(МетражКвМПоКоличеству*((((УдельныйВесПоЦеновымГруппамЗаказа() + УдельныйВесКраскиЗаказа())/1000)+ ВесЗиппера(ШагПечати))),3);
					//ШтукВОдномМетреКвадратном = ШагПечати * ШиринаН;
					//ВесОдногоИзделия = ((УдельныйВесПоЦеновымГруппамЗаказа() + УдельныйВесКраскиЗаказа())/1000) * ШтукВОдномМетреКвадратном;
					//стр.Вес = Окр(ВесОдногоИзделия * стр.Количество * 1000,3);
				КонецЕсли;
			ИначеЕсли Имя = "ТоварыВес" Тогда
				Если ЗначениеЗаполнено(стр.Вес) Тогда
					МетражКвМПоВесу = МетражКвМПоУдельномуВесу(стр.Вес,ШагПечати);
					МетражПМПоВесу = МетражКвМПоВесу/((ШиринаН)*лРучьи);
					КоличествоПоВесу = Окр(МетражПМПоВесу/ШагПечати*лРучьи,3);
					стр.Количество = КоличествоПоВесу/1000;
					стр.КоличествоУпаковок = КоличествоПоВесу/1000;
				КонецЕсли;                                                      
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВесПриИзменении(Элемент)
	ИдентификторСтроки = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	Имя = Элемент.Имя;
	ПересчитатьКоличествоВесНаСервере(ИдентификторСтроки,Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПустойОтветственный = ПустаяСсылка("ОтветственныеЛицаОрганизаций");
	Объект.Руководитель = ПустойОтветственный;
	Объект.ГлавныйБухгалтер = ПустойОтветственный;
КонецПроцедуры

&НаСервере
Процедура DFMНаСервере()
	Объект.НоменклатураDFM = Не Объект.НоменклатураDFM;
	ЗаблокироватьНоменклатуруНаСервере();
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура DFM(Команда)
	DFMНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	// --> Начало Лико Митюшин МФМ 07.07.2021
	ОчисткаЦенВТоварахНеЗаДеньги();
	// <-- Конец Лико Митюшин МФМ 07.07.2021

	ИзменитьПриСменеВидаВырубки();
	//ЗаблокироватьНоменклатуруНаСервере();
	//Подсистема DFM
	DFMКлиент.ЗаблокироватьНоменклатуру(ЭтаФорма,ДатаНачалаСозданияНоменклатурыDFM И Объект.Цвета.Количество()>0);
	//Подсистема DFM

	УстановитьВидимостьЭлементов();
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
	
	// --> Начало Лико Ефимов ЕВВ 15.09.2021
	ТипЗаказаПриИзменииНаСервере();
	// <-- Конец Лико Ефимов ЕВВ 15.09.2021
	
КонецПроцедуры

&НаСервере
Процедура ТипЗаказаПриИзменииНаСервере() // --> Начало Лико Ефимов ЕВВ 15.09.2021
	
	Если Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ПолуфабрикатПодАппликатор Тогда
		Лико_Дополнительно.ОчиститьВЗаказеПараметрыПеремотки(Объект);
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 15.09.2021

&НаКлиенте
Процедура ОчисткаЦенВТоварахНеЗаДеньги() // --> Начало Лико Митюшин МФМ 07.07.2021
	Если Не Объект.ЗаДеньги Тогда
		Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Пробник") 
			ИЛИ Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка") Тогда
			ОчисткаЦенВТоварахНеЗаДеньгиНаСервере();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 07.07.2021

&НаСервере
Процедура ОчисткаЦенВТоварахНеЗаДеньгиНаСервере() // --> Начало Лико Митюшин МФМ 07.07.2021
	Для каждого ТекСтрТовары из Объект.Товары Цикл
		Лико_Дополнительно.ОчищениеЦенВТоварыНеЗаДеньги(ТекСтрТовары);	
	КонецЦикла;
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 07.07.2021

&НаКлиенте
Процедура ШтампВырубнойПриИзменении(Элемент)
	// --> Начало Лико Митюшин МФМ 07.04.2021
	ИзменитьПриСменеВидаВырубки(Истина, Истина);
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки)
	// <-- Конец Лико Митюшин МФМ 07.04.2021
КонецПроцедуры

&НаСервере
Процедура ИзменитьПриСменеВидаВырубки(ПересчитыватьМетраж = Истина, ПересчитатьПоля = Ложь, ВРежимеРедактированияПараметров = Ложь)
	
	текБылиИзменения = Лико_ТиражМетраж.ИзменитьПриСменеВидаВырубки(Объект, ПересчитыватьМетраж, ПересчитатьПоля);
	// <-- Начало Лико Яцун С. В. 06.07.2023 
	Если текБылиИзменения И (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) Тогда
		ЗаполнитьПараметрыПечати(Объект, Объект.ВидВырубки,,,НЕ ВРежимеРедактированияПараметров);
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 06.07.2023
	Если ПересчитыватьМетраж Тогда
		Если текБылиИзменения Тогда
			РасчитатьТиражМетраж();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьКоличествоЗубьев(Элемент)
	Возврат Объект.Z.КоличествоЗубьев;
КонецФункции

&НаКлиенте
Процедура ЭтикетокНаЛистеПечатиПриИзменении(Элемент)
	Если Объект.ВидВырубки = 5 Тогда
		ПараметрыШтампаПриИзменении();
	КонецЕсли;
КонецПроцедуры

//--> o.pukhova 23042021
&НаСервере
Функция ПолучитьСписокНамотокДляТУ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Лико_Намотка.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Намотка КАК Лико_Намотка
	|ГДЕ
	|	Лико_Намотка.Термоусадка = Истина";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокНамотокДляТУ = Новый СписокЗначений;
	СписокНамотокДляТУ.ЗагрузитьЗначения(Результат);
	Возврат СписокНамотокДляТУ;
КонецФункции

&НаСервере
Функция ЗаполнитьПараметрыПоИсходномуЗаказу()  // --> Начало Лико Митюшин МФМ 13.09.2021
	
	текБылиИзменения = Ложь;
	ИсходныйЗаказ = Объект.ИсходныйЗаказ;
	
	Если НЕ ЗначениеЗаполнено(Объект.РучьиПечати) Тогда 
		Объект.РучьиПечати 				= ?(ЗначениеЗаполнено(ИсходныйЗаказ.РучьиПечати), ИсходныйЗаказ.РучьиПечати, 
		?(ЗначениеЗаполнено(ИсходныйЗаказ.Ручьи), ИсходныйЗаказ.Ручьи, ИсходныйЗаказ.РучьиПечатиИндиго)); 
		текБылиИзменения = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДлинаПечати) Тогда 
		Объект.ДлинаПечати 				= ?(ЗначениеЗаполнено(ИсходныйЗаказ.ДлинаПечати), ИсходныйЗаказ.ДлинаПечати, 
		?(ЗначениеЗаполнено(ИсходныйЗаказ.ШагПечати), ИсходныйЗаказ.ШагПечати, ИсходныйЗаказ.ДлинаПечатиИндиго));
		текБылиИзменения = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭтикетокНаЛистеПечати) Тогда 
		Объект.ЭтикетокНаЛистеПечати 	= ?(ЗначениеЗаполнено(ИсходныйЗаказ.ЭтикетокНаЛистеПечати), ИсходныйЗаказ.ЭтикетокНаЛистеПечати, 
		?(ЗначениеЗаполнено(ИсходныйЗаказ.ЭтикетокНаЛисте), ИсходныйЗаказ.ЭтикетокНаЛисте, ИсходныйЗаказ.ЭтикетокНаЛистеИндиго)); 
		текБылиИзменения = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭтМЭР) Тогда
		Объект.ЭтМЭР = ПолучитьЭтМЭРНаСервере();
	КонецЕсли;	
	Возврат текБылиИзменения;
КонецФункции		// <-- Конец Лико Митюшин МФМ 13.09.2021

&НаКлиенте
Процедура ТоварыНаправлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка") И Объект.ВидЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Пробник") И Объект.Цвета.Количество()>0 И Объект.ПоперечнаяРезкаТУ = Ложь
		И Элементы.Товары.ТекущиеДанные.ПоперечнаяРезка = Ложь Тогда
		СтандартнаяОбработка = Ложь;
    	ФиксНастройки = Новый НастройкиКомпоновкиДанных;
    	Отбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Термоусадка");
    	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    	Отбор.ПравоеЗначение = Истина;
    	Отбор.Использование = Истина;
    	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    	ПараметрыФормы = Новый Структура;
    	ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
  
  		ОткрытьФорму("Справочник.Лико_Намотка.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

//<-- o.pukhova 23042021

//+ Лико m.shenderov 28.04.2021

&НаКлиенте
Процедура СоздатьНоменклатуруDFM(Команда)
	СоздатьНоменклатуруВерсию();
	
КонецПроцедуры
&НаКлиенте
Процедура СоздатьНоменклатуруВерсию(СоздатьВерсию=Ложь) //+Лико m.shenderov 04.05.2021
	Тд=Элементы.Товары.ТекущиеДанные;
	Если Тд=Неопределено Тогда
		Сообщить("Не выбран продукт!");
	КонецЕсли;
	
	Структура = Новый Структура;
		Если СоздатьВерсию Тогда
	Структура.Вставить("Номенклатура",Тд.Номенклатура);	
	КонецЕсли;

	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("НаименованиеНоменклатуры",Строка(Тд.Номенклатура));
	Структура.Вставить("Контрагент",Объект.Контрагент);
	Структура.Вставить("ТипЭтикетки",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_ТипЭтикетки"));
	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("Менеджер",Объект.Менеджер);
	Структура.Вставить("Дизайнер",Объект.Дизайнер);
	Структура.Вставить("Регион",Объект.Регион);
	Структура.Вставить("Версия",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.ВерсияНоменклатуры,"Версия"));
	ВидРЦентра=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.РабочийЦентр,"ВидРабочегоЦентра");
	Технология=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ВидРЦентра,"лкТехнологияПечати");
	Структура.Вставить("Технология",Технология);
    ОписаниеОповещение= Новый ОписаниеОповещения("СоздатьНоменклатуруDFMЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_ВерсииНоменклатуры.Форма.ФормаСозданияНоменклатуры",
				Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры //-Лико m.shenderov 04.05.2021

&НаКлиенте
Процедура СоздатьНоменклатуруDFMЗавершение(Результат,Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Тд                     =Элементы.Товары.ТекущиеДанные;
		Тд.ВерсияНоменклатуры  =Результат.ВерсияНоменклатуры;
		Тд.Номенклатура        =Результат.Номенклатура;
		Тд.Версия              =Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ВерсияНоменклатуры,"Версия");
		Тд.Артикул             =Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ВерсияНоменклатуры,"Артикул");
		Элементы.Товары.Обновить();
	КонецЕсли;  
	
КонецПроцедуры			

&НаКлиенте
Процедура СоздатьВерсию(Команда)
	СоздатьНоменклатуруВерсию(Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьРезерв(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &Заказ
	|	И Лико_ПодготовкаМатериалов.Проведен
	|	И НЕ Лико_ПодготовкаМатериалов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой()   
	
КонецФункции

//- Лико m.shenderov 28.04.2021

&НаСервере
Процедура ПроверитьЧестныеЗнаки(ТекущийОбъект) // --> Начало Лико Ефимов ЕВВ 13.05.2021
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим gtin
	МассивЧестныхЗнаковЗаказа = Новый Массив;
	Для каждого Строка из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Строка.ЧестныйЗнак) Тогда
			МассивЧестныхЗнаковЗаказа.Добавить(Строка.ЧестныйЗнак);
		КонецЕсли;
	КонецЦикла;
	МассивЧестныхЗнаковЗаказа = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЧестныхЗнаковЗаказа);
	//Если МассивЧестныхЗнаковЗаказа.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.ЧестныйЗнак КАК ЧестныйЗнак
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка <> &Ссылка
		|	И ЗаказКлиентаТовары.ЧестныйЗнак В(&МассивЧестныхЗнаков)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.ЧестныйЗнак";
	
	Запрос.УстановитьПараметр("МассивЧестныхЗнаков", МассивЧестныхЗнаковЗаказа);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	МассивЧестныхЗнаковИспользуютсяВДругихЗаказах = Новый Массив;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивЧестныхЗнаковИспользуютсяВДругихЗаказах.Добавить(ВыборкаДетальныеЗаписи.ЧестныйЗнак);
	КонецЦикла;
	МассивЧестныхЗнаковИспользуютсяВДругихЗаказах = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЧестныхЗнаковИспользуютсяВДругихЗаказах);
	МассивЧестныхЗнаковИзмененных = Новый Массив;
	МассивЧестныхЗнаковПройденных = Новый Массив;
	
	Для каждого Строка из Объект.Товары Цикл
		СтрокаТекущегоОбъекта = ТекущийОбъект.Товары[Строка.НомерСтроки-1];
		Если НЕ ЗначениеЗаполнено(Строка.Gtin) Тогда
			// Уберем честный знак
			СтрокаТекущегоОбъекта.ЧестныйЗнак = Неопределено;
		ИначеЕсли Строка.Gtin <> Строка.ЧестныйЗнак.Gtin ИЛИ Строка.ДатаЭмиссии <> Строка.ЧестныйЗнак.ДатаЭмиссии Тогда
			// Нужно обновлять данные. Причем если данный честный знак используется в других местах, то нужно создать новый честный знак
			Если ЗначениеЗаполнено(Строка.ЧестныйЗнак) И МассивЧестныхЗнаковИспользуютсяВДругихЗаказах.Найти(Строка.ЧестныйЗнак) = Неопределено И МассивЧестныхЗнаковПройденных.Найти(Строка.ЧестныйЗнак) = Неопределено Тогда
				// Сначала попробуем найти этот знак
				НайденныйЧестныйЗнак = Лико_Дополнительно.НайтиСоздатьЧестныйЗнак(Строка.Gtin, Строка.ДатаЭмиссии, Ложь);
				Если ЗначениеЗаполнено(НайденныйЧестныйЗнак) Тогда
					СтрокаТекущегоОбъекта.ЧестныйЗнак = НайденныйЧестныйЗнак;
				Иначе
					// Этот честный знак нигде не используется и его не меняли, изменим значение прямо в нем
					ЧестныйЗнакОбъект = СтрокаТекущегоОбъекта.ЧестныйЗнак.ПолучитьОбъект();
					ЗаполнитьЗначенияСвойств(ЧестныйЗнакОбъект, Строка, "Gtin,ДатаЭмиссии");
					ЧестныйЗнакОбъект.Наименование = Лико_ДополнительноКлиентСервер.ПолучитьНаименованиеЧестногоЗнака(ЧестныйЗнакОбъект);
					ЧестныйЗнакОбъект.Записать();
				КонецЕсли;
			Иначе
				// Этот честный знак используется в других заказах, нужно создать новый
				СтрокаТекущегоОбъекта.ЧестныйЗнак = Лико_Дополнительно.НайтиСоздатьЧестныйЗнак(Строка.Gtin, Строка.ДатаЭмиссии);
			КонецЕсли;			
		КонецЕсли;
		МассивЧестныхЗнаковПройденных.Добавить(СтрокаТекущегоОбъекта.ЧестныйЗнак);
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 13.05.2021


&НаКлиенте
Процедура ЧестныйЗнакПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(); 
	ДоступностьУтилизироватьИзлишки();
КонецПроцедуры

&НаКлиенте
Процедура РучьиПечатиПриИзменении(Элемент)
	
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	
	ЭтикеткиИТиражМетражНаКлиенте();

	Если Объект.ВидВырубки = 1 Тогда
		Объект.ЭтМЭР = ПолучитьЭтМЭРНаСервере();	
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ВидРЦИндиго(Объект.РабочийЦентр) И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтикеткиИТиражМетражНаКлиенте()
	Лико_ЭтикеткиИТиражМетражНаСервере(Объект.ВидВырубки);
	ПараметрыШтампаПриИзменении();
КонецПроцедуры	

&НаСервере
Процедура Лико_ЭтикеткиИТиражМетражНаСервере(ТекВидВырубки)
	ЗаполнитьПлощадьКлишеНаСервере(ТекВидВырубки);
	ЗаполнитьЭтикеткиПечати(ТекВидВырубки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадьКлишеНаСервере(текВидВырубки)
	текПлощадьКлише = Лико_ТиражМетраж.ПолучитьПлощадьКлише(Объект, текВидВырубки);
	Если Объект.ПлощадьКлише <> текПлощадьКлише Тогда 
		Объект.ПлощадьКлише = текПлощадьКлише;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЭтикетокНаЛистеПечатиНаСервере(ВидВырубкиДляРасчета = Неопределено)
	Если ВидВырубкиДляРасчета = Неопределено Тогда
		Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, Объект.ВидВырубки);
	Иначе
		Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Объект, ВидВырубкиДляРасчета);
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьДлинуПечатиНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьДлинуПечати(Объект, Объект.ВидВырубки);
КонецФункции

&НаСервере
Функция ПолучитьЭтМЭРНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьМежэтикеточноеРасстояние(Объект, Объект.ВидВырубки);
КонецФункции

&НаСервере
Функция ПолучитьЭтикетокПоДлинеПечатиИндигоНаСервере(текВидВырубки)
	Возврат Лико_ТиражМетраж.ПолучитьЭтикетокПоДлинеПечатиИндиго(Объект, текВидВырубки);
КонецФункции

&НаСервере
Функция ПолучитьZНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьZ(Объект, Объект.ВидВырубки);
КонецФункции

&НаСервере
Функция ПолучитьЭтикетокНаЛистеПечатиФлексоНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечатиФлексо(Объект);
КонецФункции

&НаКлиенте
Процедура ZПриИзменении(Элемент)
	// --> Начало Лико Митюшин МФМ 19.05.2021
	Если Не ЗначениеЗаполнено(Объект.ВидВырубки) Тогда
		Объект.ВидВырубки = ПолучитьВидВырубкиНаСервере();	
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 19.05.2021

	Если Объект.ВидВырубки = 1 ИЛИ  Объект.ВидВырубки = 7 ИЛИ Объект.ВидВырубки = 13 Тогда
		ЗаполнитьДлинаПечатиНаКлиенте();
	ИначеЕсли Объект.ВидВырубки = 3 ИЛИ Объект.ВидВырубки = 9 Тогда 
		ЗаполнитьДлинаПечатиНаКлиенте();
	    ЗаполнитьЭтМЭР();
		ЗаполнитьЭтикетокНаЛистеПечатиФлексо();
		Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере();
	КонецЕсли;
	ПараметрыШтампаПриИзменении();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЭтикетокНаЛистеПечатиФлексо()
	текКоличествоЭтПоДлинеПечати = ПолучитьЭтикетокНаЛистеПечатиФлексоНаСервере();
	Если Объект.КоличествоЭтПоДлинеПечати <> текКоличествоЭтПоДлинеПечати Тогда 
		Объект.КоличествоЭтПоДлинеПечати = текКоличествоЭтПоДлинеПечати;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтМЭР()
	
	текЭтМЭР = ПолучитьЭтМЭРНаСервере();
	Если Объект.ЭтМЭР <> текЭтМЭР Тогда
		Объект.ЭтМЭР = текЭтМЭР;		
	КонецЕсли;

	текВидВырубки = Объект.ВидВырубки;
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		текКоличествоЭтПоДлинеПечатиИндиго = ПолучитьЭтикетокПоДлинеПечатиИндигоНаСервере(текВидВырубки);
		Если текКоличествоЭтПоДлинеПечатиИндиго <> Объект.КоличествоЭтПоДлинеПечатиИндиго Тогда 
			Объект.КоличествоЭтПоДлинеПечатиИндиго = текКоличествоЭтПоДлинеПечатиИндиго;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДлинаПечатиНаКлиенте()
	текДлинаПечати = ПолучитьДлинуПечатиНаСервере();
	Если текДлинаПечати <> Объект.ДлинаПечати Тогда
		Объект.ДлинаПечати = текДлинаПечати;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьZ()
	текZ = ПолучитьZНаСервере();
	Если Объект.Z <> текZ Тогда
		Объект.Z = текZ;
	КонецЕсли;
КонецПроцедуры
	
	
&НаКлиенте
Процедура ДлинаЭтикеткиПриИзменении(Элемент)
	Если Объект.ВидВырубки = 5 ИЛИ (Объект.ВидВырубки = 6 И Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка")) Тогда
		ЗаполнитьЭтМЭР();
		ЭтикеткиИТиражМетражНаКлиенте();
		ЗаполнитьДлинаПечатиНаСервере();
	ИначеЕсли Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	// <-- Начало Лико Яцун С. В. 27.09.2024 
	Если НеобходимоЗаполнятьРаппортТУ() Тогда
		ПредлагаемыеВариантыРаппортов = ПредложитьВариантыИлиЗаполнитьРаппортФлексо();
		//Если точный Раппорт не найден, выбирают из предложенных вариантов
		Если ПредлагаемыеВариантыРаппортов <> Неопределено Тогда
			ПараметыФормы = Новый Структура("Заголовок,ФормаОтбор,ВысотаЭтикетки,Заказ","Выберие размеры",ПредлагаемыеВариантыРаппортов,Объект.ДлинаЭтикетки,Объект);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПредложенногоРаппорта", ЭтаФорма);
			ОткрытьФорму("Справочник.Лико_Раппорты.Форма.ФормаПредложенияРазмераЭтикетки",ПараметыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		Иначе
			ПараметрыШтампаПриИзменении();	
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 27.09.2024
КонецПроцедуры

&НаСервере
Функция ПредложитьВариантыИлиЗаполнитьРаппортФлексо() 
	
	РазмерЭтикетки = Объект.ДлинаЭтикетки;
	
	ПодобранТочныйРаппорт = Ложь; 
	
	Для КоличествоЭтикеток = 1 По Цел(800/РазмерЭтикетки) Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_РаппортыРабочиеЦентры.Ссылка КАК Ссылка,
		|	ОКР(Лико_РаппортыРабочиеЦентры.Ссылка.ДлинаПечати, 2) КАК ДлинаПечати,
		|	Лико_РаппортыРабочиеЦентры.Ссылка.Z КАК Z
		|ИЗ
		|	Справочник.Лико_Раппорты.РабочиеЦентры КАК Лико_РаппортыРабочиеЦентры
		|ГДЕ
		|	Лико_РаппортыРабочиеЦентры.РабочийЦентр = &РабочийЦентр
		|	И ОКР(ОКР(Лико_РаппортыРабочиеЦентры.Ссылка.ДлинаПечати, 2) / &КоличествоЭтикеток, 2) = &ВысотаЭтикетки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДлинаПечати";
		
		Запрос.УстановитьПараметр("РабочийЦентр", Объект.РабочийЦентр);
		Запрос.УстановитьПараметр("ВысотаЭтикетки", РазмерЭтикетки);
		Запрос.УстановитьПараметр("КоличествоЭтикеток", КоличествоЭтикеток);

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Объект.Раппорт = ВыборкаДетальныеЗаписи.Ссылка;
			Объект.Z = ВыборкаДетальныеЗаписи.Z;
			Объект.ДлинаПечати = ВыборкаДетальныеЗаписи.ДлинаПечати/1000;
			Объект.ПлощадьКлише = Лико_ТиражМетраж.ПолучитьПлощадьКлише(Объект, Объект.ВидВырубки);
			текЭтМЭР = ПолучитьЭтМЭРНаСервере();
			Если Объект.ЭтМЭР <> текЭтМЭР Тогда
				Объект.ЭтМЭР = текЭтМЭР;		
			КонецЕсли;
			Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере(); 
			ПодобранТочныйРаппорт = Истина;
			//Нашелся точный Раппорт, варианты предлагать не нужно
			Возврат Неопределено;
		КонецЦикла;
		Если ПодобранТочныйРаппорт Тогда
			Прервать;	
		КонецЕсли;
	КонецЦикла;

	Если НЕ ПодобранТочныйРаппорт Тогда
		ВозможныеРаппорты = Новый Массив;
		НайденыВариантыМинимумМаксимум = Ложь;
		ВозможныйМаксимальныйРаппорт = Неопределено;
		ВозможныйМинимальныйРаппорт = Неопределено;
		Для КоличествоЭтикеток = 1 По Цел(800/РазмерЭтикетки) Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лико_РаппортыРабочиеЦентры.Ссылка.Ссылка КАК Ссылка,
			|	Лико_РаппортыРабочиеЦентры.Ссылка.ДлинаПечати КАК ДлинаПечати,
			|	Лико_РаппортыРабочиеЦентры.Ссылка.Z КАК Z
			|ПОМЕСТИТЬ ВТРаппортМинимум
			|ИЗ
			|	Справочник.Лико_Раппорты.РабочиеЦентры КАК Лико_РаппортыРабочиеЦентры
			|ГДЕ
			|	Лико_РаппортыРабочиеЦентры.РабочийЦентр = &РабочийЦентр
			|	И ОКР(Лико_РаппортыРабочиеЦентры.Ссылка.ДлинаПечати, 2) <= &ВысотаЭтикетки
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДлинаПечати УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лико_РаппортыРабочиеЦентры.Ссылка КАК Ссылка,
			|	Лико_РаппортыРабочиеЦентры.Ссылка.ДлинаПечати КАК ДлинаПечати,
			|	Лико_РаппортыРабочиеЦентры.Ссылка.Z КАК Z
			|ПОМЕСТИТЬ ВРРаппортМаксимум
			|ИЗ
			|	Справочник.Лико_Раппорты.РабочиеЦентры КАК Лико_РаппортыРабочиеЦентры
			|ГДЕ
			|	Лико_РаппортыРабочиеЦентры.РабочийЦентр = &РабочийЦентр
			|	И ОКР(Лико_РаппортыРабочиеЦентры.Ссылка.ДлинаПечати, 2) >= &ВысотаЭтикетки
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДлинаПечати
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРаппортМинимум.Ссылка КАК РаппортСсылкаМинимум,
			|	ЕСТЬNULL(ОКР(ВТРаппортМинимум.ДлинаПечати, 2), 0) КАК ДлинаПечатиМинимум,
			|	ВТРаппортМинимум.Z КАК ZМинимум,
			|	ВРРаппортМаксимум.Ссылка КАК РаппортСсылкаМаксимум,
			|	ЕСТЬNULL(ОКР(ВРРаппортМаксимум.ДлинаПечати, 2), 0) КАК ДлинаПечатиМаксимум,
			|	ВРРаппортМаксимум.Z КАК ZМаксимум
			|ИЗ
			|	ВТРаппортМинимум КАК ВТРаппортМинимум
			|		ПОЛНОЕ СОЕДИНЕНИЕ ВРРаппортМаксимум КАК ВРРаппортМаксимум
			|		ПО ВТРаппортМинимум.Ссылка <> ВРРаппортМаксимум.Ссылка";
			
			Запрос.УстановитьПараметр("ВысотаЭтикетки", РазмерЭтикетки * КоличествоЭтикеток);
			Запрос.УстановитьПараметр("РабочийЦентр", Объект.РабочийЦентр);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДлинаПечатиМинимум = ВыборкаДетальныеЗаписи.ДлинаПечатиМинимум;
				ДлинаПечатиМаксимум = ВыборкаДетальныеЗаписи.ДлинаПечатиМаксимум;
				РазницаМеньшийРаппорт = РазмерЭтикетки * КоличествоЭтикеток - ДлинаПечатиМинимум;
				РазницаБольшийРаппорт = ДлинаПечатиМаксимум - РазмерЭтикетки * КоличествоЭтикеток;
				Если ДлинаПечатиМинимум <> 0 И ДлинаПечатиМаксимум <> 0 Тогда
					ВозможныеРаппорты = Новый Массив;
					НайденыВариантыМинимумМаксимум = Истина;	
					ВозможныеРаппорты.Добавить(Новый Структура("Раппорт,РазницаРазмера,КоличествоЭтикеток",ВыборкаДетальныеЗаписи.РаппортСсылкаМинимум,РазницаМеньшийРаппорт,КоличествоЭтикеток));
					ВозможныеРаппорты.Добавить(Новый Структура("Раппорт,РазницаРазмера,КоличествоЭтикеток",ВыборкаДетальныеЗаписи.РаппортСсылкаМаксимум,РазницаБольшийРаппорт,КоличествоЭтикеток));
				КонецЕсли;
				Если ДлинаПечатиМинимум = 0 Тогда
					Если ВозможныйМаксимальныйРаппорт = Неопределено ИЛИ (РазницаБольшийРаппорт < ВозможныйМаксимальныйРаппорт.РазницаРазмера) Тогда
						ВозможныйМаксимальныйРаппорт = Новый Структура("Раппорт,РазницаРазмера,КоличествоЭтикеток",ВыборкаДетальныеЗаписи.РаппортСсылкаМаксимум,РазницаБольшийРаппорт,КоличествоЭтикеток);
					КонецЕсли;
				ИначеЕсли ДлинаПечатиМаксимум = 0 Тогда
					Если ВозможныйМинимальныйРаппорт = Неопределено ИЛИ (РазницаМеньшийРаппорт < ВозможныйМинимальныйРаппорт.РазницаРазмера) Тогда
						ВозможныйМинимальныйРаппорт = Новый Структура("Раппорт,РазницаРазмера,КоличествоЭтикеток",ВыборкаДетальныеЗаписи.РаппортСсылкаМинимум,РазницаМеньшийРаппорт,КоличествоЭтикеток);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если НайденыВариантыМинимумМаксимум Тогда
				Прервать;	
			КонецЕсли;
		КонецЦикла;
		Если НЕ НайденыВариантыМинимумМаксимум Тогда
			Если ВозможныйМаксимальныйРаппорт <> Неопределено Тогда
				ВозможныеРаппорты.Добавить(ВозможныйМаксимальныйРаппорт);
			КонецЕсли;
			Если ВозможныйМинимальныйРаппорт <> Неопределено Тогда
				ВозможныеРаппорты.Добавить(ВозможныйМинимальныйРаппорт);
			КонецЕсли;
		КонецЕсли;
		Если ВозможныеРаппорты.Количество() <> 0 Тогда
			Возврат ВозможныеРаппорты;
		Иначе
			Сообщить("Не удалось подобрать Раппорт"); 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораПредложенногоРаппорта(Результат, Параметры) Экспорт  
	
	Если Результат <> Неопределено Тогда 
		Объект.ДлинаЭтикетки = Результат.ВысотаЭтикетки;
		Объект.Раппорт = Результат.Раппорт;
		Объект.Z = ЗначениеРеквизита(Результат.Раппорт,"Z");
		Объект.ДлинаПечати = ЗначениеРеквизита(Результат.Раппорт,"ДлинаПечати")/1000;
		ЗаполнитьПлощадьКлишеНаСервере(Объект.ВидВырубки); 
		ЗаполнитьЭтМЭР();
		Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере();  
		ПараметрыШтампаПриИзменении();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаЭтикеткиПриИзменении(Элемент)
	
	Если Объект.ВидВырубки = 5 ИЛИ (Объект.ВидВырубки = 6 И Объект.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка"))  Тогда
		ЗаполнитьЭтМЭР();
		ЭтикеткиИТиражМетражНаКлиенте();
		ЗаполнитьДлинаПечатиНаСервере();
	ИначеЕсли Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДлинаПечатиНаСервере() 
	текДлинаПечати = ПолучитьДлинуПечатиНаСервере();
	Если Не ЗначениеЗаполнено(текДлинаПечати) И Объект.Ссылка.ВидВырубки = Объект.ВидВырубки Тогда
		Возврат;
	КонецЕсли;
	Если текДлинаПечати <> Объект.ДлинаПечати Тогда
		Объект.ДлинаПечати = текДлинаПечати;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеРеквизитовПриУтвержденииЦветов(текВидВырубки) 		// --> Начало Лико Митюшин МФМ 07.09.2021
	
	ЗаполнитьПлощадьКлишеНаСервере(Объект.ВидВырубки);
	Если Не ЗначениеЗаполнено(Объект.ДлинаПечати) И текВидВырубки = 6 Тогда 
		ЗаполнитьДлинаПечатиНаСервере();	
	КонецЕсли;
	
КонецПроцедуры		// <-- Конец Лико Митюшин МФМ 07.09.2021

&НаКлиенте
Процедура ДлинаПечатиПриИзменении(Элемент)
	текВидВырубки = Объект.ВидВырубки;
	Если текВидВырубки = 5 ИЛИ текВидВырубки = 4 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 12 Тогда
		Если текВидВырубки = 5 Тогда
			ЗаполнитьЭтМЭР();
			ЗаполнитьZ();
		ИначеЕсли текВидВырубки = 11 ИЛИ текВидВырубки = 12 ИЛИ текВидВырубки = 14 Тогда  
			ЗаполнитьZ();
			ЗаполнитьЭтикетокНаЛистеПечатиФлексо();
			ЗаполнитьЭтикеткиПечати(текВидВырубки);
		ИначеЕсли текВидВырубки = 4 Тогда
			ЗаполнитьZ();
		КонецЕсли;
		ЭтикеткиИТиражМетражНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтМЭРПриИзменении(Элемент)
	текВидВырубки = Объект.ВидВырубки;
	Если текВидВырубки = 6 Тогда
		ЗаполнитьДлинуПечатиИндиго();		
	КонецЕсли;	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		текКоличествоЭтПоДлинеПечатиИндиго = ПолучитьЭтикетокПоДлинеПечатиИндигоНаСервере(текВидВырубки);
		Если текКоличествоЭтПоДлинеПечатиИндиго <> Объект.КоличествоЭтПоДлинеПечатиИндиго Тогда 
			Объект.КоличествоЭтПоДлинеПечатиИндиго = текКоличествоЭтПоДлинеПечатиИндиго;	
		КонецЕсли;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И текВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором(Объект.ЭтМЭР);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РассчитатьМетражПФНаСервере()
	
	Если Объект.Товары.Количество()>0 Тогда 
		стр = Объект.Товары[0];
		//Если  стр.ЕдиницаИзмерения = Справочники.Лико_ПредопределенныеЗначения.ЕИКвадрМетр.ЗначениеПараметра Тогда 
			Если Объект.ВидРЦГП = Справочники.ВидыРабочихЦентров.Ламинатор Тогда 
				КоличествоНастроек = ?(Объект.КоличествоЗаказовГП>1, Объект.КоличествоЗаказовГП/2, Объект.КоличествоЗаказовГП) ;
				стр.Количество =  Объект.МетражКВМЗаказовГП*1.02+(300* КоличествоНастроек+300)* Объект.Нарезка.Размер/1000;
				стр.КоличествоУпаковок = стр.Количество;
			ИначеЕсли Объект.ВидРЦГП = Справочники.ВидыРабочихЦентров.Аппликатор Тогда 
				стр.Количество =  Объект.МетражКВМЗаказовГП*1.02+300*Объект.Нарезка.Размер/1000 * Объект.КоличествоЗаказовГП;
				стр.КоличествоУпаковок = стр.Количество;
			КонецЕсли;
		//КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМетражПФ(Команда)
	//Если ЭтаФорма.Модифицированность Тогда
	//	Сообщить("Сначала нужно записать заказ!");
	//	Возврат;
	//	//Записать();
	//КонецЕсли;

	РассчитатьМетражПФНаСервере();
	ТоварыКоличествоУпаковокПриИзменении(Элементы.ТоварыКоличествоУпаковок);

КонецПроцедуры

&НаКлиенте
Процедура КоличествоЛистовКнижкиПриИзменении(Элемент)
	Если Объект.ВидВырубки = 13 Тогда
		Объект.РучьиПечати = Объект.КоличествоЛистовКнижки * Объект.Ручьи;
		Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере();
		ЗаполнитьЭтМЭР();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭтПоДлинеПечатиИндигоПриИзменении(Элемент)
	ЗаполнитьЭтикетокНаЛистеИндиго();
	ЗаполнитьДлинуПечатиИндиго();
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором(Объект.ЭтМЭР);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДлинуПечатиИндигоНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьДлинуПечатиИндиго(Объект, Объект.ВидВырубки);	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДлинуПечатиИндиго()
	текДлинаПечати = ПолучитьДлинуПечатиИндигоНаСервере();
	Если текДлинаПечати <> Объект.ДлинаПечатиИндиго Тогда
		Объект.ДлинаПечатиИндиго = текДлинаПечати;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЭтикетокНаЛистеИндигоНаСервере()
	Возврат Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеИндиго(Объект, Объект.ВидВырубки);	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЭтикетокНаЛистеИндиго()
	текьЭтикетокНаЛисте = ПолучитьЭтикетокНаЛистеИндигоНаСервере();
	Если текьЭтикетокНаЛисте <> Объект.ЭтикетокНаЛистеИндиго Тогда
		Объект.ЭтикетокНаЛистеИндиго = текьЭтикетокНаЛисте;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТиражЗаказовГППриИзмененииНаСервере()
	МетражПМЗаказовГП  = Лико_ТиражМетраж.РассчитатьМетражСВидомВырубки(Объект.ТиражЗаказовГП*1000, Объект, Объект.ВидВырубки);
	Объект.МетражКВМЗаказовГП = МетражПМЗаказовГП*Объект.Нарезка.Размер/1000;
КонецПроцедуры

&НаКлиенте
Процедура ТиражЗаказовГППриИзменении(Элемент)
	ТиражЗаказовГППриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УведомитьДизайнера(Команда)
	Массив = Новый Массив();
	
	НомерСтроки = 0;
	Для Каждого Товар Из Объект.Товары Цикл
		
		Если ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) ТОгда
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура", Товар.Номенклатура);
			Структура.Вставить("ВерсияНоменклатуры", Товар.ВерсияНоменклатуры);
			Массив.Добавить(Структура);	
		КонецЕсли;	
	КонецЦикла;
	Если Массив.Количество()=0 Тогда
		ПоказатьПредупреждение(,"В заказе нет продукта с созданной версией. Создайте версию продукта!");
		Возврат;
	КонецЕсли;
	
	ОО  = Новый ОписаниеОповещения("УведомитьДизайнераЗавершение", ЭтаФорма);
	Структура = Новый Структура;
	СТруктура.Вставить("Дизайнер", Объект.Дизайнер);
	Структура.Вставить("Товары", Массив);
	ОткрытьФорму("Справочник.Лико_ВерсииНоменклатуры.Форма.ФормаВопросаОтправкиУведомления", Структура,,,,,
	ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	
КонецПроцедуры

&НаКлиенте
Процедура УведомитьДизайнераЗавершение(Результат,Параметры)  Экспорт //+Лико m.shenderov 10.06.2021
	
	ЕСли  ТипЗнч(Результат)=Тип("Структура") И Результат.МассивВерсий.Количество()>0 Тогда
		
		ОтправитьУведомлениеВDFMНаСервере(Результат.МассивВерсий,Результат.Дизайнер);

		//Справочники.Лико_ВерсииНоменклатуры.ОтправитьУведомлениеВDFM(Результат.МассивВерсий,Результат.Дизайнер);
		
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 10.06.2021

&НаСервере
Функция ПроверкаПробеговШтампов(СтруктураСНормативом)		// <-- Начало Лико Митюшин МФМ 29.07.2021
	
	УстановитьПривилегированныйРежим(Истина);


	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидСекции", Справочники.Лико_ВидыСекций.Вырубка);	
	НайденныеСтроки = Объект.Цвета.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;
		
	текТабЗначений = Новый ТаблицаЗначений;
	текТабЗначений.Колонки.Добавить("Оснастка", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	текТабЗначений.Колонки.Добавить("РабочийЦентр", Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры"));
	
	МассивШтампов = Новый Массив;
	Для каждого ТекСтр из НайденныеСтроки Цикл  
		Если ЗначениеЗаполнено(ТекСтр.Оснастка) Тогда 
			НовСтр = текТабЗначений.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
			МассивШтампов.Добавить(ТекСтр.Оснастка);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивШтампов.Количество() = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование) = ТИП(Документ.ЗаказДавальца)
	|			ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
	|		ИНАЧЕ ВЫРАЗИТЬ(ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование КАК Документ.ЗаказКлиента)
	|	КОНЕЦ КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Моделирование = ЛОЖЬ
	|	И ПооперационноеРасписание2_2.Выполнено = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Состояние = ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.ВключенВПлан)
	|	И НЕ ЗаказКлиента.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ КАК Заказ,
	|	СУММА(ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0)) КАК МетражДляРЦ,
	|	ЗаказКлиентаЦвета.Оснастка КАК Штамп
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ПО Лико_ПараметрыПроизводстваЗаказа.Заказ = ЗаказКлиентаЦвета.Ссылка
	|			И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = ЗаказКлиентаЦвета.НомерПроката
	|ГДЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	|	И ЗаказКлиентаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Вырубка)
	|	И ЕСТЬNULL(ЗаказКлиентаЦвета.Оснастка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ,
	|	ЗаказКлиентаЦвета.Оснастка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаЦвета.Ссылка.Ссылка,
	|	СУММА(ЕСТЬNULL(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ, 0)),
	|	ЗаказКлиентаЦвета.Оснастка
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ПО ЗаказКлиентаЦвета.Ссылка = Лико_ПараметрыПроизводстваЗаказа.Заказ
	|			И ЗаказКлиентаЦвета.НомерПроката = Лико_ПараметрыПроизводстваЗаказа.НомерПроката
	|ГДЕ
	|	ЗаказКлиентаЦвета.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Заказы.Ссылка
	|			ИЗ
	|				ВТ_Заказы КАК ВТ_Заказы)
	|	И ЗаказКлиентаЦвета.Ссылка <> &Заказ
	|	И ЗаказКлиентаЦвета.Оснастка В(&Штампы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаЦвета.Ссылка.Ссылка,
	|	ЗаказКлиентаЦвета.Оснастка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Лико_ПараметрыШтампа.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Вырубка)
	|					И ЕСТЬNULL(Лико_ПараметрыШтампа.ШагПечати, 0) <> 0
	|				ТОГДА ЕСТЬNULL(ВТ_Итог.МетражДляРЦ, 0) / Лико_ПараметрыШтампа.ШагПечати
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ПробегПлан,
	|	ВТ_Итог.Штамп КАК Штамп
	|ПОМЕСТИТЬ ВТ_ПробегПлан
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ВТ_Итог.Штамп = Лико_ПараметрыШтампа.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итог.Штамп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.Оснастка КАК Штамп,
	|	Лико_ПараметрыШтампа.РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТ_ДанныеПоШтампу
	|ИЗ
	|	&ТЗ КАК Лико_ПараметрыШтампа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_НормативыПробеговОснастки.Ссылка КАК Ссылка,
	|	Лико_НормативыПробеговОснастки.ТипМатериала КАК ТипМатериала,
	|	Лико_НормативыПробеговОснасткиВидыРЦ.ВидРЦ КАК ВидРЦ
	|ПОМЕСТИТЬ ВТ_Норматив
	|ИЗ
	|	Справочник.Лико_НормативыПробеговОснастки КАК Лико_НормативыПробеговОснастки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_НормативыПробеговОснастки.ВидыРЦ КАК Лико_НормативыПробеговОснасткиВидыРЦ
	|		ПО Лико_НормативыПробеговОснастки.Ссылка = Лико_НормативыПробеговОснасткиВидыРЦ.Ссылка
	|ГДЕ
	|	НЕ Лико_НормативыПробеговОснастки.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТ_ДанныеПоШтампу.Штамп КАК Справочник.Номенклатура) КАК Штамп,
	|	ВТ_Норматив.Ссылка КАК НормативПробега,
	|	ВТ_Норматив.ТипМатериала = """" КАК ПоискНеПоАртикулу
	|ПОМЕСТИТЬ ВТ_ПоискНорматива
	|ИЗ
	|	ВТ_ДанныеПоШтампу КАК ВТ_ДанныеПоШтампу
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Норматив КАК ВТ_Норматив
	|		ПО (ВЫБОР
	|				КОГДА ВТ_Норматив.ВидРЦ = ВЫРАЗИТЬ(ВТ_ДанныеПоШтампу.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра
	|					ТОГДА ИСТИНА
	|				КОГДА ВТ_Норматив.ТипМатериала <> """"
	|						И ВЫРАЗИТЬ(ВТ_ДанныеПоШтампу.Штамп КАК Справочник.Номенклатура).Артикул ПОДОБНО ""%"" + ВТ_Норматив.ТипМатериала + ""%""
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ ВТ_ДанныеПоШтампу.Штамп ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоискНорматива.Штамп КАК Штамп,
	|	МАКСИМУМ(ВТ_ПоискНорматива.ПоискНеПоАртикулу) КАК ПоискНеПоАртикулу
	|ПОМЕСТИТЬ ВТ_МаксимальныйШтамп
	|ИЗ
	|	ВТ_ПоискНорматива КАК ВТ_ПоискНорматива
	|ГДЕ
	|	НЕ ВТ_ПоискНорматива.НормативПробега ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоискНорматива.Штамп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаксимальныйШтамп.Штамп КАК Штамп,
	|	ВТ_МаксимальныйШтамп.ПоискНеПоАртикулу КАК ПоискНеПоАртикулу,
	|	ВТ_ПоискНорматива.НормативПробега КАК НормативПробега
	|ПОМЕСТИТЬ ВТ_МаксимальныйНорматив
	|ИЗ
	|	ВТ_МаксимальныйШтамп КАК ВТ_МаксимальныйШтамп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоискНорматива КАК ВТ_ПоискНорматива
	|		ПО ВТ_МаксимальныйШтамп.Штамп = ВТ_ПоискНорматива.Штамп
	|			И ВТ_МаксимальныйШтамп.ПоискНеПоАртикулу = ВТ_ПоискНорматива.ПоискНеПоАртикулу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_НормативыПробеговОснасткиСрезПоследних.НормативШтампа КАК НормативШтампа,
	|	Лико_НормативыПробеговОснасткиСрезПоследних.НормативВУдарах КАК НормативПробега,
	|	ВТ_МаксимальныйНорматив.Штамп КАК Штамп
	|ПОМЕСТИТЬ ВТ_НаработкиИзРегистра
	|ИЗ
	|	РегистрСведений.Лико_НормативыПробеговОснастки.СрезПоследних(
	|			,
	|			Площадка = &Площадка
	|				И НормативШтампа В
	|					(ВЫБРАТЬ
	|						ВТ_МаксимальныйНорматив.НормативПробега КАК Штамп
	|					ИЗ
	|						ВТ_МаксимальныйНорматив КАК ВТ_МаксимальныйНорматив)) КАК Лико_НормативыПробеговОснасткиСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_МаксимальныйНорматив КАК ВТ_МаксимальныйНорматив
	|		ПО Лико_НормативыПробеговОснасткиСрезПоследних.НормативШтампа = ВТ_МаксимальныйНорматив.НормативПробега
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК СерияЯССМ_ОбъектНоменклатуры,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВТ_ШтампыОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ_МаксимальныйНорматив.Штамп
	|				ИЗ
	|					ВТ_МаксимальныйНорматив КАК ВТ_МаксимальныйНорматив)) КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ШтампыОстатки.СерияЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	ВТ_ШтампыОстатки.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НаработкиИзРегистра.НормативПробега ЕСТЬ NULL
	|				И ВТ_НаработкиИзРегистра.НормативПробега <= ВЫБОР
	|					КОГДА Лико_ПараметрыШтампа.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Вырубка)
	|							И ЕСТЬNULL(Лико_ПараметрыШтампа.ШагПечати, 0) <> 0
	|						ТОГДА ЕСТЬNULL(Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка, 0) / Лико_ПараметрыШтампа.ШагПечати
	|					ИНАЧЕ ВТ_НаработкиИзРегистра.НормативПробега
	|				КОНЕЦ
	|			ТОГДА ВТ_НаработкиИзРегистра.НормативПробега
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_ПараметрыШтампа.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Вырубка)
	|						И ЕСТЬNULL(Лико_ПараметрыШтампа.ШагПечати, 0) <> 0
	|					ТОГДА ЕСТЬNULL(Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка, 0) / Лико_ПараметрыШтампа.ШагПечати
	|				ИНАЧЕ NULL
	|			КОНЕЦ
	|	КОНЕЦ КАК ОбщаяНаработка
	|ПОМЕСТИТЬ ВТ_НачальныйМетраж
	|ИЗ
	|	ВТ_ШтампыОстатки КАК ВТ_ШтампыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НаработкиОбъектовНоменклатуры.СрезПоследних(
	|				,
	|				ОбъектНоменклатуры.Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_МаксимальныйНорматив.Штамп
	|					ИЗ
	|						ВТ_МаксимальныйНорматив КАК ВТ_МаксимальныйНорматив)) КАК Лико_НаработкиОбъектовНоменклатурыСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаработкиИзРегистра КАК ВТ_НаработкиИзРегистра
	|			ПО Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбъектНоменклатуры.Номенклатура = ВТ_НаработкиИзРегистра.Штамп
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|			ПО Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбъектНоменклатуры.Номенклатура = Лико_ПараметрыШтампа.Номенклатура
	|		ПО ВТ_ШтампыОстатки.СерияЯССМ_ОбъектНоменклатуры = Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбъектНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачальныйМетраж.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	ВТ_НачальныйМетраж.Номенклатура КАК Номенклатура,
	|	ВТ_НаработкиИзРегистра.НормативПробега - ЕСТЬNULL(ВТ_НачальныйМетраж.ОбщаяНаработка, 0) КАК ОстаточтныйПробег
	|ПОМЕСТИТЬ ВТ_ОстаточтныйПробег
	|ИЗ
	|	ВТ_НаработкиИзРегистра КАК ВТ_НаработкиИзРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачальныйМетраж КАК ВТ_НачальныйМетраж
	|		ПО ВТ_НаработкиИзРегистра.Штамп = ВТ_НачальныйМетраж.Номенклатура
	|ГДЕ
	|	НЕ ВТ_НаработкиИзРегистра.НормативПробега ЕСТЬ NULL
	|	И НЕ ВТ_НачальныйМетраж.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаточтныйПробег.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_ОстаточтныйПробег.ОстаточтныйПробег) КАК ОстаточтныйПробег
	|ПОМЕСТИТЬ ВТ_ОбщийОстаточныйПробег
	|ИЗ
	|	ВТ_ОстаточтныйПробег КАК ВТ_ОстаточтныйПробег
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаточтныйПробег.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ЗаказОснасткиОснастка.Ссылка) КАК КоличествоЗаказОснастка,
	|	Лико_ЗаказОснасткиОснастка.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Оснастки
	|ИЗ
	|	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
	|ГДЕ
	|	Лико_ЗаказОснасткиОснастка.Номенклатура В(&Штампы)
	|	И Лико_ЗаказОснасткиОснастка.Статус В (ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаказовНаОснастку.Подтвержден), ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаказовНаОснастку.Размещен))
	|	И НЕ Лико_ЗаказОснасткиОснастка.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ЗаказОснасткиОснастка.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщийОстаточныйПробег.Номенклатура КАК Номенклатура,
	|	ВТ_ОбщийОстаточныйПробег.ОстаточтныйПробег - ЕСТЬNULL(ВТ_ПробегПлан.ПробегПлан, 0) + ЕСТЬNULL(ВТ_Оснастки.КоличествоЗаказОснастка, 0) * ЕСТЬNULL(ВТ_НаработкиИзРегистра.НормативПробега, 0) КАК ОстаточныйРесурс,
	|	ВТ_НаработкиИзРегистра.НормативШтампа КАК НормативПробега
	|ИЗ
	|	ВТ_ОбщийОстаточныйПробег КАК ВТ_ОбщийОстаточныйПробег
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПробегПлан КАК ВТ_ПробегПлан
	|		ПО ВТ_ОбщийОстаточныйПробег.Номенклатура = ВТ_ПробегПлан.Штамп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оснастки КАК ВТ_Оснастки
	|		ПО ВТ_ОбщийОстаточныйПробег.Номенклатура = ВТ_Оснастки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаработкиИзРегистра КАК ВТ_НаработкиИзРегистра
	|		ПО ВТ_ОбщийОстаточныйПробег.Номенклатура = ВТ_НаработкиИзРегистра.Штамп
	|ГДЕ
	|	ВТ_ОбщийОстаточныйПробег.ОстаточтныйПробег - ЕСТЬNULL(ВТ_ПробегПлан.ПробегПлан, 0) + ЕСТЬNULL(ВТ_Оснастки.КоличествоЗаказОснастка, 0) * ЕСТЬNULL(ВТ_НаработкиИзРегистра.НормативПробега, 0) < 0
	|	И ЕСТЬNULL(ВТ_НаработкиИзРегистра.НормативПробега, 0) <> 0";
	
	Запрос.УстановитьПараметр("Штампы", 	МассивШтампов);
	Запрос.УстановитьПараметр("Заказ", 		Объект.Ссылка);
	Запрос.УстановитьПараметр("ТЗ",			текТабЗначений);   
////Надо разобраться, что это за Площадка Иванова 20241003	
	Запрос.УстановитьПараметр("Площадка",	Объект.Площадка.Организация);
	Выборка = Запрос.Выполнить();	
	
	Если Выборка.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТабВыгрузки = Выборка.Выгрузить();
    Для каждого КолонкаТЗ Из ТабВыгрузки.Колонки Цикл
    	СтруктураСНормативом.Вставить(КолонкаТЗ.Имя, ТабВыгрузки[0][КолонкаТЗ.Имя]);
	КонецЦикла; 
	
	Если ТабВыгрузки.Количество() > 0 Тогда 
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции		// <-- Конец Лико Митюшин МФМ 29.07.2021

&НаКлиенте
Процедура Лико_РедактироватьПараметрыШтампов()
	РазрешеноМенятьПараметрыШтампа = Не РазрешеноМенятьПараметрыШтампа;
	Если РазрешеноМенятьПараметрыШтампа Тогда  
		Объект.ВидВырубки = 0;
		Элементы.Лико_РедактироватьПараметрыШтампов.ЦветТекста = WebЦвета.Зеленый;
	Иначе 
		ПроставитьВидВырубки(Ложь);
		Элементы.Лико_РедактироватьПараметрыШтампов.ЦветТекста = WebЦвета.ТемноСерый;
	КонецЕсли;
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗаказаПлан(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	
	ТабличныеДокументы = 	ОткрытиеРасчетЗаказа();
	Если ТабличныеДокументы = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	Для каждого СтрокаМассива из ТабличныеДокументы Цикл
		СтрокаМассива.ТабДок.Показать();
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция  ОткрытиеРасчетЗаказа()
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);
	//СсылкаНаВнешнююОбработку.ПечатьВнешнейПечатнойФормы(МассивОбъектов);

	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("РасчетЗаказа");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("Не найдена дополнительная обработка с именем объекта РасчетЗаказа");
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
	
	ПечатьБезСуммы = Истина;
	Если  (РольДоступна("ПолныеПрава")  ИЛИ  РольДоступна("Лико_ЗаказыКлиентов")) Тогда 
		ПечатьБезСуммы = Ложь;
	КонецЕсли;	
	
	ТабличныеДокументы = ВнешняяОбработка.ПечатьВнешнейПечатнойФормы(МассивОбъектов, ПечатьБезСуммы);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;

	Возврат ТабличныеДокументы;

КонецФункции

&НаСервере
Процедура УстановитьВидимостьКолонокСекций()
	
	//Если Не РольДоступна("ПолныеПрава") Тогда
	//	Возврат;
	//КонецЕсли;
	
	//УсловноеОформление.Элементы.Очистить();  	
	//текВидыСекции = Объект.Секции.Выгрузить(,"ВидСекции").ВыгрузитьКолонку("ВидСекции");
    ////////////Секции                    		
	//Если текВидыСекции.Количество() <> 0 Тогда 	
	//	Запрос.УстановитьПараметр("ПараметрыСекции", текВидыСекции);	
	//	текВыборка = Запрос.Выполнить();	
	//	Если Не текВыборка.Пустой() Тогда
	//		текПараметрыСекции = текВыборка.Выгрузить().ВыгрузитьКолонку("ПараметрСекции");		
	//		Для каждого ТекПараметр из Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Секции.Реквизиты Цикл
	//			ИмяПараметра = ТекПараметр.Имя;  
	//			Если ИмяПараметра = "НомерФормы"  Тогда  
	//				ИмяПараметра = "Форма";
	//			КонецЕсли;
	//			Если МассивИменКоторыеВидныВсегда.Найти(ТекПараметр.Имя) <> Неопределено Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			//Элементы["Секции" + ТекПараметр.Имя].Видимость = (текПараметрыСекции.Найти(ТекПараметр.Имя) <> Неопределено);  
	//			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Секции" + ИмяПараметра,   "Видимость",    (текПараметрыСекции.Найти(ТекПараметр.Имя) <> Неопределено));	
	//		КонецЦикла;   		
	//	КонецЕсли;				
	//КонецЕсли;
	
	МаксНомерПроката = 0;
	для каждого стр из Объект.Цвета цикл
		МаксНомерПроката = Макс(МаксНомерПроката, стр.НомерПроката); 
	конеццикла; 
	
	Если МаксНомерПроката > 0 Тогда
		Для Сч = 1 По МаксНомерПроката Цикл
			СоздатьГруппуПроката(Сч);  
			СоздатьКопиюЭлемента(Элементы.Секции, "Прокат" + сч, Элементы["ГруппаПрокат"+сч]);
			РазбитьСекцииНаПрокаты(Сч); 		
		КонецЦикла;  
	КонецЕсли;

			
КонецПроцедуры        

Процедура СоздатьГруппуПроката(Прокат)
	Если Элементы.Найти("ГруппаПрокат" + Прокат) <> неопределено Тогда   
		Возврат
	КонецЕсли; 
	ГруппаПроката = Элементы.Добавить("ГруппаПрокат" + Прокат, Тип("ГруппаФормы"), Элементы.ГруппаСекции);	
    ГруппаПроката.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПроката.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение; 
    ГруппаПроката.ОтображатьЗаголовок = Истина; 
	
КонецПроцедуры


&НаСервере
Процедура СоздатьКопиюЭлемента(ЭлементИсточника, ПрефиксКопии, ГруппаЭлементов = Неопределено)
	
	Если Элементы.Найти(ПрефиксКопии + ЭлементИсточника.Имя ) <> неопределено Тогда  
		Возврат
    КонецЕсли;
	 
	Тип = ТипЗнч(ЭлементИсточника);
    
    ЭлементПриемника = Элементы.Добавить(ПрефиксКопии + ЭлементИсточника.Имя , Тип, ГруппаЭлементов);
    
    Если Тип = Тип("ГруппаФормы") Тогда
        
        ЭлементПриемника.Вид = ЭлементИсточника.Вид;
        
        Если ЭлементИсточника.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДаннымЗаголовка");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.Страницы Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ТекущаяСтраница");
            
            СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.Страница Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымЗаголовка");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымШапки");
            
        Иначе
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
            
        КонецЕсли; 
        
        СкопироватьПодчиненныеЭлементы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
        
    ИначеЕсли Тип = Тип("ПолеФормы") Тогда
        
        ЭлементПриемника.Вид = ЭлементИсточника.Вид;
        
        ЭлементПриемника.ПутьКДанным = ЭлементИсточника.ПутьКДанным;
        
        Если ЭлементИсточника.Вид = ВидПоляФормы.ПолеВвода Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ВыделенныйТекст, СвязьПоТипу, ПутьКДанным");
            
            Если  ЭлементИсточника.СвязьПоТипу.ПутьКДанным <> "" Тогда
                ПутьКДаннымСвязиПриемника = СтрЗаменить(ЭлементИсточника.СвязьПоТипу.ПутьКДанным, "Элементы." , "Элементы." + ПрефиксКопии);
                ЭлементПриемника.СвязьПоТипу = Новый СвязьПоТипу(ПутьКДаннымСвязиПриемника, ЭлементИсточника.СвязьПоТипу.ЭлементСвязи);    
            КонецЕсли; 
            ЗаполнитьКоллекциюСвойств(ЭлементПриемника.СписокВыбора, ЭлементИсточника.СписокВыбора);
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеПереключателя Тогда
            
            ЗаполнитьКоллекциюСвойств(ЭлементПриемника.СписокВыбора, ЭлементИсточника.СписокВыбора);
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеТекстовогоДокумента Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным, ВыделенныйТекст");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеФорматированногоДокумента Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным, ВыделенныйТекст");
            
        Иначе
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным");
            
        КонецЕсли; 
        
        СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
		
	ИначеЕсли Тип = Тип("ТаблицаФормы") Тогда
        
        ЭлементПриемника.ПутьКДанным = ЭлементИсточника.ПутьКДанным;
        
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымКартинкиСтроки, ПутьКДанным, ДополнительныеПараметрыСоздания, ЗапросОбновления");
        
        СкопироватьПодчиненныеЭлементы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
                
        СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);	   
		
		ЭлементПриемника.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;        
    Иначе
        
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
        
    КонецЕсли; 
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьПодчиненныеЭлементы(Приемник, Источник, ПрефиксКопии) 
    
    Для Каждого ЭлементИсточника Из Источник.ПодчиненныеЭлементы Цикл
        СоздатьКопиюЭлемента(ЭлементИсточника, ПрефиксКопии, Приемник);
    КонецЦикла; 
    
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаполнитьКоллекциюСвойств(КоллекцияПриемник, КоллекцияИсточник) 
    
    Для Каждого Элемент Из КоллекцияИсточник Цикл
        ЗаполнитьЗначенияСвойств(КоллекцияПриемник.Добавить(), Элемент);
    КонецЦикла;
    
КонецПроцедуры


&НаСервере
Процедура СкопироватьСобытия(ЭлементПриемник, ЭлементИсточник) 
    
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриИзменении");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "НачалоВыбора");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "НачалоВыбораИзСписка");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Очистка");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Выбор");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Регулирование");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Открытие");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ОбработкаВыбора");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "АвтоПодбор");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ОкончаниеВводаТекста");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриОбновленииСоставаПользовательскихНастроекНаСервере");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриНачалеРедактирования");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПередНачаломДобавления");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПередНачаломИзменения");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриАктивизацииСтроки");
    
КонецПроцедуры 

&НаСервере
Процедура СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, ИмяСобытия) 
    
    Действие = ЭлементИсточник.ПолучитьДействие(ИмяСобытия);
    
    Если Действие <> "" Тогда
        ЭлементПриемник.УстановитьДействие(ИмяСобытия, Действие);
    КонецЕсли; 
    
КонецПроцедуры

Процедура РазбитьСекцииНаПрокаты(НомерПроката) 
	
		
	ОтборПоНомерПроката = Объект.Секции.НайтиСтроки(новый Структура("НомерПроката", НомерПроката));	
	
	Если ОтборПоНомерПроката.Количество() <> 0 Тогда      
		
		МассивВидныВсегда = Новый Массив;
		МассивВидныВсегда.Добавить("ВидСекции"); 
		МассивВидныВсегда.Добавить("НомерСекции");
		МассивВидныВсегда.Добавить("ТипСекции");
		МассивВидныВсегда.Добавить("Подача");
		МассивВидныВсегда.Добавить("ЭтикетокВПодаче");
		
	
		Элементы["Прокат" + НомерПроката + "Секции"].ОтборСтрок = новый ФиксированнаяСтруктура("НомерПроката", НомерПроката);  		
		Элементы["ГруппаПрокат" + НомерПроката].Заголовок = "Прокат " + НомерПроката + " "  + строка(ОтборПоНомерПроката[0].РабочийЦентр);  
		//Элементы["ГруппаПрокат" + стрНомерПроката].Видимость = Истина;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Лико_ВидыСекцийПараметрыСекций.ПараметрСекции.Наименование КАК ПараметрСекции
		|ИЗ
		|	Справочник.Лико_ВидыСекций.ПараметрыСекций КАК Лико_ВидыСекцийПараметрыСекций
		|ГДЕ
		|	Лико_ВидыСекцийПараметрыСекций.Ссылка В(&ПараметрыСекции)"; 
		
		ВидыСекцийПрокат = новый массив;
		Для Каждого стр из ОтборПоНомерПроката цикл  
			ВидыСекцийПрокат.Добавить(стр.ВидСекции);	
		КонецЦикла;
		
		Если ВидыСекцийПрокат.Количество() <>  0 Тогда 
					
			Запрос.УстановитьПараметр("ПараметрыСекции", ВидыСекцийПрокат);  
			
			текВыборка = Запрос.Выполнить();
			
			Если не  текВыборка.Пустой() Тогда
				
				текПараметрыСекции = текВыборка.Выгрузить().ВыгрузитьКолонку("ПараметрСекции");
				
				Для каждого ТекПараметр из Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Секции.Реквизиты Цикл
					
					ИмяПараметра = ТекПараметр.Имя;  
					
					Если МассивВидныВсегда.Найти(ИмяПараметра) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Прокат" + НомерПроката +"Секции" + ИмяПараметра,   "Видимость", (текПараметрыСекции.Найти(ИмяПараметра) <> Неопределено));	
						
				КонецЦикла;	
				//    вр. изм.видимость = типпродукта.видимость 
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Прокат" + НомерПроката + "СекцииВременныеИзмененияТипаПродукта",  "Видимость", Элементы["Прокат" + НомерПроката + "СекцииТипПродукта"].Видимость);
			
				//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СекцииТипПродуктаКод" + НомерПроката,   "Видимость",    Элементы["СекцииТипПродукта" + стрНомерПроката].Видимость);	
					
			КонецЕсли;		
		КонецЕсли; 
		
	КонецЕсли;  

	
	
КонецПроцедуры

#Область DFM2

&НаСервере
Процедура ОтправитьУведомлениеВDFMНаСервере(МассивВерсий,Дизайнер) //+Лико m.shenderov 10.06.2021

	Ответ=Справочники.Лико_ВерсииНоменклатуры.ОтправитьУведомлениеВDFM(МассивВерсий,Дизайнер);

КонецПроцедуры  //-Лико m.shenderov 10.06.2021

&НаКлиенте
Процедура ТаблицаТоварыПриИзменении () Экспорт //+Лико m.shenderov 14.06.2021
	ТоварыНоменклатураПриИзменении(Неопределено);	
КонецПроцедуры //-Лико m.shenderov 14.06.2021

//Подсистема DFM

&НаКлиенте
Процедура СоздатьНоменклатуруDFM2(Команда)
	DFMКлиент.СоздатьНоменклатуруВерсию(ЭтаФорма); 	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВерсиюDFM2(Команда)
	DFMКлиент.СоздатьНоменклатуруВерсию(ЭтаФорма, Истина); 	
КонецПроцедуры

&НаКлиенте
Процедура УведомитьДизайнераDFM2(Команда)
	DFMКлиент.УведомитьДизайнера(ЭтаФорма); 	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПродуктDFM2(Команда)
	DFMКлиент.СоздатьНоменклатуруВерсию(ЭтаФорма, Ложь,Истина);
КонецПроцедуры

  &НаКлиенте
Процедура ОригиналМакетDFM2(Команда)
	
	DFMКлиент.ПоказатьОригиналМакет(ЭтаФорма);
	
КонецПроцедуры



//Подсистема DFM


&НаСервереБезКонтекста
Функция  ПолучитьСвойствоОбъектаПартнерСервер(Объект) //+Лико m.shenderov 17.06.2021
	Возврат УправлениеСвойствами.ЗначениеСвойства(Объект, "Партнер");
КонецФункции  //-Лико m.shenderov 17.06.2021

&НаСервере
Процедура ПроверитьНоменклатуруDFM(Товары,РабочийЦентр)//+Лико m.shenderov 28.05.2021
	Технология=РабочийЦентр.ВидРабочегоЦентра.лкТехнологияПечати;
	Для каждого Товар Из Товары Цикл
		
		Если Товар.Номенклатура.Лико_DFM И  Не ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) Тогда                                   
			Товар.ВерсияНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.НайтиМаксВерсиюНоменклатуры(Товар.Номенклатура, Технология);
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 28.05.2021

&НаКлиенте
Процедура РасчетДляТендера(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("Ссылка", Объект.Ссылка));
	ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "РасчетЗаказаДляТендера");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета);
КонецПроцедуры


#КонецОбласти

#Область МастерЗаполненияЗаказа

&НаКлиенте
Процедура ЗаполнитьПрокат(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Площадка) Тогда
		Сообщить("Необходимо заполнить поле ""Площадка""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	текПараметрыВыбора = Новый Структура;
	текПараметрыВыбора.Вставить("Площадка", Объект.Площадка);	
	текПараметрыВыбора.Вставить("НомерПроката", ?(Объект.Секции.Количество() = 0, 0, ПолучитьМаксимумНомераПроката()));	
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыЛико_МастерЗаполненияПоПрокату", ЭтотОбъект, "Подбор");
			
    //ЗаполнитьЗначенияСвойств(Парам, Объект);
	ФормаНастроек = ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_МастерЗаполненияПоПрокату", текПараметрыВыбора, ЭтаФорма, , , , ОбработкаВыбора);
	//ФормаНастроек.ОткрытьМодально();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПрокат(Команда)
 	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Площадка) Тогда
		Сообщить("Необходимо заполнить поле ""Площадка""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	текДанные = ЭтаФорма.Элементы.Секции.ТекущиеДанные;
	
	Если текДанные = Неопределено Тогда 
		Сообщить("Не выбрана строка для редактирования", СтатусСообщения.Важное);
		Возврат;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		Сообщить("Необходимо заполнить поле ""Рабочий центр""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(текДанные.НомерПроката) Тогда
		Сообщить("Необходимо заполнить поле ""Номер проката""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	текПараметрыВыбора = Новый Структура;
	текПараметрыВыбора.Вставить("Площадка", Объект.Площадка);
	текПараметрыВыбора.Вставить("НомерПроката", текДанные.НомерПроката);	
	текПараметрыВыбора.Вставить("РабочийЦентр", текДанные.РабочийЦентр);


	//текПараметрыВыбора.Вставить("ТЗСекции", Объект.Секции.Выгрузить(НайденныеСтроки));
	текТЗСекции = ПолучитьТаблицуДляпередачиДанныхПоПрокату(текДанные.НомерПроката, текПараметрыВыбора);
	текПараметрыВыбора.Вставить("ТЗСекции", текТЗСекции);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыЛико_МастерЗаполненияПоПрокату", ЭтотОбъект, "Подбор");
			
    //ЗаполнитьЗначенияСвойств(Парам, Объект);
	ФормаНастроек = ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_МастерЗаполненияПоПрокату", текПараметрыВыбора, ЭтаФорма, , , , ОбработкаВыбора);
	//ФормаНастроек.ОткрытьМодально();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияПараметров(Элемент)
	//+ код Феди
	//СтандартнаяОбработка = Ложь;
	//
	//текПараметрыВыбора = Новый Структура;
	//текПараметрыВыбора.Вставить("РежимВыбора", Истина);
	//текПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);	
	//текПараметрыВыбора.Вставить("Секция", Элемент.ТекущиеДанные.ВидСекции);
	//МассивНеПараметров = Новый Массив;
	//МассивНеПараметров.Добавить("ВидСекции");
	//МассивНеПараметров.Добавить("НомерПроката");
	//МассивНеПараметров.Добавить("НомерВарианта");

	//текПараметрыВыбора.Вставить("ПараметрыСекции", ЗаписатьВХранилище(Элемент.ТекущиеДанные.ВидСекции, Элемент.ТекущиеДанные.НомерСтроки));
	//ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированиеПараметровСекции", ЭтотОбъект,"Подбор");

	//ОткрытьФорму("Справочник.Лико_ВидыСекций.Форма.Лико_РедактированиеПараметровСекции",текПараметрыВыбора,
	//        ЭтаФорма, , , , ОбработкаВыбора);   
	//- код Феди      
	
	ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");
	
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);

	//ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.РедактированиеПараметровСекции",,ЭтаФорма,,,,ОбработкаЗакрытия);
	ТекСтр = Элемент.ТекущиеДанные;
	
	ПараметрыДляОбработки = Новый Структура;
	ПараметрыДляОбработки.Вставить("РежимВыбора", Истина);
	ПараметрыДляОбработки.Вставить("Секция", ТекСтр.ВидСекции); 
	ПараметрыДляОбработки.Вставить("ИмяСекции", ТекСтр.ИмяСекции);
	ПараметрыДляОбработки.Вставить("ПараметрыСекции", ТекСтр.ПараметрыСекции);  
	ПараметрыДляОбработки.Вставить("РабочийЦентр", ТекСтр.РабочийЦентр); 
	ПараметрыДляОбработки.Вставить("Ссылка", Объект.Ссылка); 

////Надо поменять Площадку в обработке Иванова 20241003		
	ПараметрыДляОбработки.Вставить("Площадка", Объект.Площадка);  
	
	
	допПараметры = Новый Структура;
	допПараметры.Вставить("КлючСтроки",  ТекСтр.КлючСтроки);
	допПараметры.Вставить("НомерПроката", ТекСтр.НомерПроката);

	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированиеПараметровСекции", ЭтаФорма, допПараметры);

	ФормаРедактированияСтрока =  ЗначениеРеквизита(ТекСтр.ВидСекции, "ИмяФормыРедактированияПараметров");
	                      	
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.РедактированиеПараметровСекции" + ФормаРедактированияСтрока, ПараметрыДляОбработки, ЭтаФорма, , , , ОбработкаЗакрытия);


			
КонецПроцедуры

&НаСервере
Функция ЗаписатьВХранилище(Секция, НомерСтроки)
	СтруктураЭлементов = Новый Структура;
	текСтрокаСекции = Объект.Секции.Выгрузить().Получить(НомерСтроки-1);
	Для каждого Эллемент из Секция.ПараметрыСекций Цикл
		//Если МассивНеПараметров.Найти(Эллемент.Имя) <> Неопределено Тогда 
		//	Продолжить;
		//КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Эллемент.ПараметрСекции) Тогда 
			Сообщить("Имеется строка с не заполненным параметром секции!");
			Продолжить;
		КонецЕсли;
		текПутьКДанным = Эллемент.ПараметрСекции.Наименование;
		СтруктураЭлементов.Вставить(текПутьКДанным, текСтрокаСекции[текПутьКДанным]); 	
	КонецЦикла;

    Возврат ЗначениеВСтрокуВнутр(СтруктураЭлементов); 
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированиеПараметровСекции(Значение, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат;
	КонецЕсли;
	
	//Модифицированность = Истина;
	
   // Элементы.ТаблицаСекции.ТекущиеДанные.Параметры = Значение;
	СтруктураПараметров = ПреобразоватьДанныеРедактирования(Значение, ДопПараметры.НомерПроката );
	
	ТекущаяСтрока = Объект.Секции.НайтиСтроки(новый Структура("КлючСтроки", ДопПараметры.КлючСтроки));
	Если ТекущаяСтрока.Количество() > 0 Тогда   		
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока[0], СтруктураПараметров);
		ТекущаяСтрока[0].ПараметрыСекции = Значение;
	КонецЕсли;    
	
КонецПроцедуры

&НаСервере
Функция  ПреобразоватьДанныеРедактирования(Значение, НомерПроката)
	//достать из структуры таблицы и удалить [удаление таблиц]
	СтруктураПараметров =  ЗначениеИзСтрокиВнутр(Значение); 
	Если СтруктураПараметров.Свойство("ТаблицаЦветов") Тогда  
		Для каждого стр из СтруктураПараметров.ТаблицаЦветов Цикл
			ТекСтр = Объект.Секции.НайтиСтроки(новый Структура("КлючСтроки", стр.КлючСтроки));	
			Если ТекСтр.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТекСтр[0], стр);  
				СтруктураДоЗаменыТаблицы = ЗначениеИзСтрокиВнутр(ТекСтр[0].ПараметрыСекции);
				СтруктураДоЗаменыТаблицы.Вставить("ТаблицаЦветов",СтруктураПараметров.ТаблицаЦветов );
				ТекСтр[0].ПараметрыСекции = ЗначениеВСтрокуВнутр(СтруктураДоЗаменыТаблицы);
				
			Иначе
				новСтр = Объект.Секции.Добавить();
				ЗаполнитьЗначенияСвойств(новСтр, стр);  
				новСтр.ВидСекции = Справочники.Лико_ВидыСекций.Цифровая;
                новСтр.ПараметрыСекции = Значение;
				новСтр.НомерПроката = НомерПроката; 
				новСтр.РабочийЦентр = СтруктураПараметров.РабочийЦентр;
			КонецЕсли;
		КонецЦикла;		
		СтруктураПараметров.Удалить("ТаблицаЦветов"); 

	КонецЕсли;      
	
	Если СтруктураПараметров.Свойство("ТаблицаЦветовИнкджет") Тогда  
		Для каждого стр из СтруктураПараметров.ТаблицаЦветовИнкджет Цикл
			ТекСтр = Объект.Секции.НайтиСтроки(новый Структура("КлючСтроки", стр.КлючСтроки));	
			Если ТекСтр.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТекСтр[0], стр);  
				СтруктураДоЗаменыТаблицы = ЗначениеИзСтрокиВнутр(ТекСтр[0].ПараметрыСекции);
				СтруктураДоЗаменыТаблицы.Вставить("ТаблицаЦветовИнкджет",СтруктураПараметров.ТаблицаЦветовИнкджет );
				ТекСтр[0].ПараметрыСекции = ЗначениеВСтрокуВнутр(СтруктураДоЗаменыТаблицы);
			Иначе
				новСтр = Объект.Секции.Добавить();
				ЗаполнитьЗначенияСвойств(новСтр, стр);  
				новСтр.ВидСекции = Справочники.Лико_ВидыСекций.Инкджет;
                новСтр.ПараметрыСекции = Значение;
				новСтр.НомерПроката = НомерПроката; 
				новСтр.РабочийЦентр = СтруктураПараметров.РабочийЦентр;
			КонецЕсли;
		КонецЦикла;

		СтруктураПараметров.Удалить("ТаблицаЦветовИнкджет"); 
				
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ВидыСекций.Ссылка КАК Ссылка,
		|	Лико_ВидыСекций.ИмяПредопределенныхДанных КАК ИмяСекции
		|ИЗ
		|	Справочник.Лико_ВидыСекций КАК Лико_ВидыСекций
		|ГДЕ
		|	Лико_ВидыСекций.Многострочный = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СтруктураПараметров.Свойство("ТаблицаРабот_" + Выборка.ИмяСекции) Тогда  
			Для каждого стр из СтруктураПараметров["ТаблицаРабот_" + Выборка.ИмяСекции] Цикл
				ТекСтр = Объект.Секции.НайтиСтроки(новый Структура("КлючСтроки", стр.КлючСтроки));	
				Если ТекСтр.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(ТекСтр[0], стр);  
					СтруктураДоЗаменыТаблицы = ЗначениеИзСтрокиВнутр(ТекСтр[0].ПараметрыСекции);
					СтруктураДоЗаменыТаблицы.Вставить("ТаблицаРабот_"+ Выборка.ИмяСекции,СтруктураПараметров["ТаблицаРабот_" + Выборка.ИмяСекции] );
					ТекСтр[0].ПараметрыСекции = ЗначениеВСтрокуВнутр(СтруктураДоЗаменыТаблицы);
				Иначе
					новСтр = Объект.Секции.Добавить();
					ЗаполнитьЗначенияСвойств(новСтр, стр);  
					новСтр.ВидСекции = Выборка.Ссылка;
					новСтр.ПараметрыСекции = Значение;
					новСтр.НомерПроката = НомерПроката; 
					новСтр.РабочийЦентр = СтруктураПараметров.РабочийЦентр;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураПараметров.Удалить("ТаблицаРабот_" + Выборка.ИмяСекции); 
			
		КонецЕсли;  
			
	КонецЦикла;
	

	
	
	Если СтруктураПараметров.Свойство("КлючиУдаленныхСтрок")  Тогда
		Для каждого эл из СтруктураПараметров.КлючиУдаленныхСтрок Цикл
			УдаляемыеСтроки = Объект.Секции.НайтиСтроки(новый Структура("КлючСтроки",  эл.Значение));
			Для каждого стр из УдаляемыеСтроки Цикл 
				Объект.Секции.Удалить(стр);
			КонецЦикла;
		КонецЦикла;	     
		СтруктураПараметров.Удалить("КлючиУдаленныхСтрок");
	КонецЕсли;


		
	Возврат СтруктураПараметров;
КонецФункции

&НаСервере
Функция ПолучитьТаблицуДляпередачиДанныхПоПрокату(НомерПроката, текПараметрыВыбора)  

	НайденныеСтроки = Объект.Секции.НайтиСтроки(Новый Структура("НомерПроката", НомерПроката));	
	Возврат ЗначениеВСтрокуВнутр(Объект.Секции.Выгрузить(,"ПараметрыСекции")); 
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) экспорт	
	Если Значение = Неопределено Тогда
		ЭтаФорма.Закрыть();
        Возврат;
    КонецЕсли;
     
    РабочийЦентр = Значение;
	
	Если Не ЗначениеЗаполнено(Значение.НомерПроката) Тогда
		НомерПроката = 1;
	КонецЕсли;
	
	ЭтоОшибка = Ложь;
	ЗаполнитьТаблицуСекцийНаСервере(РабочийЦентр, ЭтоОшибка);
	
	Если ЭтоОшибка Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСекцийНаСервере(РабочийЦентр, ЭтоОшибка = Ложь)	
	
	Если РабочийЦентр.ВидыСекций.Количество() = 0 Тогда
		ЭтоОшибка = Истина;
		Сообщить("Для данного РЦ не указанны Секции");
		Возврат;
	КонецЕсли;
	
	ТекНомер = 1;
	//Для каждого ТекВид из РабочийЦентр.ВидыСекций Цикл
	//	Для Итератор = 1 По ТекВид.Количество Цикл
	//		ТекСтр = ТаблицаСекции.Добавить();
	//		ТекСтр.Секция 	= ТекВид.Секция;
	//		ТекСтр.Номер 	= ТекНомер;
	//		ТекСтр.Используется = Истина;
	//		
	//		ТекНомер = ТекНомер + 1;
	//	КонецЦикла;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМаксимумНомераПроката()
	
	//МаксНомерПроката = 2; 
	//
	//Для каждого ТекСтр из Объект.Секции Цикл
	//	Если ТекСтр.НомерПроката > МаксНомерПроката Тогда
	//		МаксНомерПроката = ТекСтр.НомерПроката;
	//	КонецЕсли;
	//КонецЦикла;  
	
	МаксНомерПроката = 0;
	для каждого стр из Объект.Секции цикл
		МаксНомерПроката = Макс(МаксНомерПроката, стр.НомерПроката); 
	конеццикла;
	
	Возврат МаксНомерПроката;		
		
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыЛико_МастерЗаполненияПоПрокату(Значение, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("РабочийЦентр", Значение[0].РабочийЦентр);
	ПараметрыОтбора.Вставить("НомерПроката", Значение[0].НомерПроката);
	НайденныеСтроки = Объект.Секции.НайтиСтроки(ПараметрыОтбора);

	Для каждого ТекСтр из НайденныеСтроки Цикл
		Объект.Секции.Удалить(ТекСтр); 
	КонецЦикла;
	
	Для Каждого СтрМассива из Значение Цикл
		Если Не ЗначениеЗаполнено(СтрМассива.ВидСекции) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрокаСекций = Объект.Секции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСекций, СтрМассива);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СекцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Заголовок = "Ред." Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуРедактированияПараметров(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СекцииВидСекцииПриИзменении(Элемент, МассивНеПараметров)
	//МассивНеПараметров = Новый Массив;
	//
	//МассивНеПараметров.Добавить("ВидСекции");
	//МассивНеПараметров.Добавить("НомерПроката");
	//МассивНеПараметров.Добавить("НомерВарианта");
	//МассивНеПараметров.Добавить("РабочийЦентр");

	//МассивРеквизитов = ПолучитьИменаПолейСекции(МассивНеПараметров);
	//
	//текТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	//Для каждого ИмяРеквизита из МассивРеквизитов Цикл
	//	текТекущиеДанные[ИмяРеквизита] = Неопределено;
	//КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИменаПолейСекции(МассивНеПараметров)

	МассивРеквизитов = Новый Массив;
	Для каждого Реквизит из Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Секции.Реквизиты Цикл
		Если МассивНеПараметров.Найти(Реквизит.Имя) = Неопределено Тогда 
			МассивРеквизитов.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРеквизитов
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидСекцииИзРЦ(пРЦ) Экспорт
	МассивСекций = Новый Массив;
	
	//Для каждого текСекция из пРЦ.ВидыСекций Цикл 
	//	МассивСекций.Добавить(текСекция.Секция);
	//КонецЦикла;
	Возврат МассивСекций;
КонецФункции

&НаКлиенте
Процедура СекцииВидСекцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СписокВыбораДляЭлемента(Элемент.СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораДляЭлемента(пСписокВыбора)
	пСписокВыбора.Очистить();
	Если Элементы.Секции.ТекущиеДанные <> Неопределено Тогда
		Для Каждого ТекСекция из ПолучитьВидСекцииИзРЦ(Элементы.Секции.ТекущиеДанные.РабочийЦентр) Цикл
			пСписокВыбора.Добавить(ТекСекция);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСекцииНаСервере()
		
	ВнешняяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Обработка ""лк Заполнить секции""");   
	ДвоичныеДанные = ВнешняяОбработка.ХранилищеОбработки.Получить();
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);
	ВнешняяОбработка.ЗаполнитьСекцииНаСервереМодуль(Объект); 
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСекции(Команда)
	
	ЗаполнитьСекцииНаСервере();  	

	УстановитьВидимостьКолонокСекций();  
	
КонецПроцедуры                           

&НаКлиенте
Процедура ВыработкаФормщиковОткрытьРегистратор(Команда)
	текстр = Элементы.ВыработкаФормщиков.ТекущиеДанные;
	Если текстр <> Неопределено Тогда
		ПоказатьЗначение(, текстр.Регистратор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СхемаМашины(Команда)
	
	ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
   
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииСхемыМашины", ЭтаФорма);
	
		
	ПараметрыНаФорму = Новый Структура;
	ПараметрыНаФорму.Вставить("ПараметрыСекции", "");
    ПараметрыНаФорму.Вставить("Ссылка", Объект.Ссылка); 

    ПараметрыНаФорму.Вставить("НомерПроката", ?(Объект.Секции.Количество() = 0, 1, ПолучитьМаксимумНомераПроката()));	

	

	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыНаФорму ,ЭтаФорма,,,,ОбработкаЗакрытия); 
	
	
КонецПроцедуры  

 &НаКлиенте
Процедура ПриЗакрытииСхемыМашины(ВозвращенноеЗначение, ДопПараметры) Экспорт
	
	Если ВозвращенноеЗначение = Неопределено Тогда 
		Возврат;	
	КонецЕсли;   
	
	РЦ = ВозвращенноеЗначение.РабочийЦентр;
	НомерПроката = ВозвращенноеЗначение.НомерПроката; 

	НайденныеСтроки = Объект.Секции.НайтиСтроки(новый структура("РабочийЦентр, НомерПроката", РЦ, НомерПроката));

	Для каждого ТекСтр из НайденныеСтроки Цикл
		Объект.Секции.Удалить(ТекСтр); 
	КонецЦикла;    
		
	ДесериализованныйМассив = ДесериализоватьМассив(ВозвращенноеЗначение.МассивПараметровСекций); 
	сч = 0;
	Для каждого стр из ВозвращенноеЗначение.МассивПараметровСекций Цикл 
		новаяСтрока = Объект.Секции.Добавить();	 
		ЗаполнитьЗначенияСвойств(новаяСтрока, ДесериализованныйМассив[сч]); 
		новаяСтрока.ПараметрыСекции = стр;
		новаяСтрока.РабочийЦентр = РЦ;   
		новаяСтрока.НомерПроката = НомерПроката; 
        сч = сч + 1;
	КонецЦикла;  
	
	
	  //Десериализовать(ВозвращенноеЗначение);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ДесериализоватьМассив(СериализованныйМассив)
	
		

	ДесериализованныйМассив = новый Массив;
	Для каждого стр из СериализованныйМассив цикл 
		СтруктураМассива = ЗначениеИзСтрокиВнутр(стр);   
		Если  СтруктураМассива.Свойство("ТаблицаЦветовИнкджет") Тогда
			СтруктураМассива.Удалить("ТаблицаЦветовИнкджет");    
		КонецЕсли;  
		Если  СтруктураМассива.Свойство("ТаблицаЦветов") Тогда
			СтруктураМассива.Удалить("ТаблицаЦветов");    
		КонецЕсли;
		ДесериализованныйМассив.Добавить(СтруктураМассива);
	КонецЦикла;
	
	Возврат ДесериализованныйМассив;
	
КонецФункции

//замена РедактироватьПрокат 
&НаКлиенте
Процедура РедактироватьСхемуМашины(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Площадка) Тогда
		Сообщить("Необходимо заполнить поле ""Площадка""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	текДанные = ЭтаФорма.Элементы.Секции.ТекущиеДанные;
	
	Если текДанные = Неопределено Тогда 
		Сообщить("Не выбрана строка для редактирования", СтатусСообщения.Важное);
		Возврат;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		Сообщить("Необходимо заполнить поле ""Рабочий центр""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;   
	
	//+ повторяющийся код, надо будет улучшить
	ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
	//-	
	
	

		
	ПараметрыНаФорму = Новый Структура;
	ПараметрыНаФорму.Вставить("Площадка", Объект.Площадка);  
	ПараметрыНаФорму.Вставить("Ссылка", Объект.Ссылка); 
	ПараметрыНаФорму.Вставить("НомерПроката", текДанные.НомерПроката);	
	ПараметрыНаФорму.Вставить("РабочийЦентр", текДанные.РабочийЦентр);  
		текТЗСекции = ПолучитьТаблицуДляпередачиДанныхПоПрокату(текДанные.НомерПроката, ПараметрыНаФорму);

	ПараметрыНаФорму.Вставить("ТЗСекции", текТЗСекции);
	
	
		
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииСхемыМашины", ЭтотОбъект, "");
			
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.Лико_СхемаМашины", ПараметрыНаФорму ,ЭтаФорма,,,,ОбработкаЗакрытия);


	
КонецПроцедуры	



#КонецОбласти 


#Область Нумераторы 

&НаСервереБезКонтекста
Функция ПолучитьТипыКодов(ТипНумератора)
	Возврат ТипНумератора.РасходЧернил.ВыгрузитьКолонку("ТипКода");
КонецФункции
 
&НаСервереБезКонтекста
Функция ПолучитьТипыНумератора(РабочийЦентр) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТРЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеЦентры.ВидРабочегоЦентра
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Ссылка = &РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ТипыНумераторовРабочиеЦентры.Ссылка КАК ТипНумератора
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ТипыНумераторов.РабочиеЦентры КАК Лико_ТипыНумераторовРабочиеЦентры
	|		ПО ВТРЦ.РабочийЦентр = Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр";
	
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);  
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипНумератора")    
		
КонецФункции   

&НаСервереБезКонтекста
Функция ПолучитьКоличествоРучьев(Нумератор, РабочийЦентр) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&РабочийЦентр КАК РабочийЦентр
	|ПОМЕСТИТЬ ВТРЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеЦентры.ВидРабочегоЦентра
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.Ссылка = &РабочийЦентр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ТипыНумераторовРабочиеЦентры.МаксимальноеКоличествоРучьев КАК МаксимальноеКоличествоРучьев,
	|	Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр.Родитель КАК РабочийЦентрРодитель
	|ИЗ
	|	ВТРЦ КАК ВТРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ТипыНумераторов.РабочиеЦентры КАК Лико_ТипыНумераторовРабочиеЦентры
	|		ПО ВТРЦ.РабочийЦентр = Лико_ТипыНумераторовРабочиеЦентры.РабочийЦентр
	|ГДЕ
	|	Лико_ТипыНумераторовРабочиеЦентры.Ссылка = &Нумератор
	|	И Лико_ТипыНумераторовРабочиеЦентры.МаксимальноеКоличествоРучьев > 0
	|	И Лико_ТипыНумераторовРабочиеЦентры.Ссылка.ПометкаУдаления <> ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийЦентрРодитель УБЫВ";
	
	Запрос.УстановитьПараметр("Нумератор", Нумератор);  
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);    
	
	Результат = Запрос.Выполнить();  
	

	
	Возврат ?(Результат.Пустой(), 0, Результат.Выгрузить()[0].МаксимальноеКоличествоРучьев) 
		
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораЦГ(ВыбранноеЗначение, Доп) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда 
		Возврат	
	КонецЕсли;
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	ТекСтр.ТипКраски = ВыбранноеЗначение.Ссылка; 
	
КонецПроцедуры

Функция ПолучитьОсновныеЧернила(ВыбранноеЗначение) 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ТипыНумераторов.ОсновныеЧернила КАК ОсновныеЧернила
		|ИЗ
		|	Справочник.Лико_ТипыНумераторов КАК Лико_ТипыНумераторов
		|ГДЕ
		|	Лико_ТипыНумераторов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение);
	
	Результат = Запрос.Выполнить();
	
	Возврат ?(Результат.Пустой(), 0, Результат.Выгрузить()[0].ОсновныеЧернила) 
	
КонецФункции	

#КонецОбласти

&НаСервереБезКонтекста
Функция ЭтоЦифра(РабочийЦентр)
	
	ВидРЦентра = ЗначениеРеквизита(РабочийЦентр, "ВидРабочегоЦентра");
	
	Возврат ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") или ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet") 

	
КонецФункции   

&НаСервереБезКонтекста
Функция РЦИнкджет()
		
	Возврат Справочники.РабочиеЦентры.НайтиПоРеквизиту("ПорядковыйНомер", 9); 

	
КонецФункции 

&НаСервереБезКонтекста
Функция ВидРЦИндиго(РабочийЦентр)
	
	ВидРЦентра = ЗначениеРеквизита(РабочийЦентр, "ВидРабочегоЦентра");
	
	Возврат ВидРЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo")
	
КонецФункции
   
&НаКлиенте
Процедура ИзменитьСоглашение(Команда)  
	
	//ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	//
	//ПараметрыВыбораСоглашения.Элемент                     = Элементы.Соглашение;
	//ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
	//ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	//ПараметрыВыбораСоглашения.ДатаДокумента               = Объект.Дата;
	//ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	//ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, ложь);  
	
	Если не Модифицированность  тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ДатаДокумента",                    Объект.Дата);
		ПараметрыФормы.Вставить("Партнер",                         	Объект.Партнер);
		//ПараметрыФормы.Вставить("ТолькоТиповые",                    СтруктураПараметров.ТолькоТиповые);
		//ПараметрыФормы.Вставить("ТолькоИспользуемыеВРаботеТП",      СтруктураПараметров.ТолькоИспользуемыеВРаботеТП);
		ПараметрыФормы.Вставить("ТекущаяСтрока",                    Объект.Соглашение);
		//ПараметрыФормы.Вставить("ХозяйственнаяОперация",            СтруктураПараметров.ХозяйственнаяОперация);
		//ПараметрыФормы.Вставить("ИспользуютсяДоговорыКонтрагентов", СтруктураПараметров.ИспользуютсяДоговорыКонтрагентов);
		//ПараметрыФормы.Вставить("Контрагент",                       СтруктураПараметров.Контрагент);
		//ПараметрыФормы.Вставить("Организация",                      СтруктураПараметров.Организация);
		
		ДополнительныйОтбор = Новый Структура;
		
		Для Каждого ПараметрВыбора Из Элементы.Соглашение.ПараметрыВыбора Цикл
			ДополнительныйОтбор.Вставить(СтрЗаменить(ПараметрВыбора.Имя, "Отбор.", ""), ПараметрВыбора.Значение);
		КонецЦикла;
		
		ПараметрыФормы.Вставить("Отбор", ДополнительныйОтбор);
		
		ОткрытьФорму("Справочник.СоглашенияСКлиентами.ФормаВыбора",
		ПараметрыФормы,
		Элементы.Соглашение,,,,Новый ОписаниеОповещения("ВыбраноСоглашениеСКлиентом", ЭтотОбъект));
	иначе
		сообщить("менять соглашение таким образом можно только если нет других изменений (запишите документ, попробуйте снова, не изменяя других реквизитов) ") 
	КонецЕсли;


КонецПроцедуры 

Процедура ВыбраноСоглашениеСКлиентом(Результат, ДополнительныеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);  
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокОбъект.ОбменДанными.Загрузка = Истина;   
	ДокОбъект.Соглашение = Результат;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись,); 
	//Прочитать();
	//Сообщить("Соглашение изменено");
	Модифицированность = Ложь; 
	
	
		
КонецПроцедуры

&НаСервере
Процедура ДоступностьУтилизироватьИзлишки() // --> Начало Лико Яцун 26.04.2022
	//ВидРЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущееЗначениеРЦ, "ВидРабочегоЦентра").ВидРабочегоЦентра;
	//Если ВидРЦ = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") И ЗначениеМетражПМ <= 500 или Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка Тогда
	Если Объект.Datamatrix ИЛИ Объект.ЧестныйЗнак ИЛИ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка ИЛИ Объект.МетражПМ <= 5000 Тогда
		Элементы.УтилизироватьИзлишки.Доступность = Истина;
	Иначе
		//Объект.УтилизироватьИзлишки = Ложь;
		Элементы.УтилизироватьИзлишки.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры // <-- Конец Лико Яцун 26.04.2022 

&НаКлиенте
Процедура РасчетЦеныПоДоходности(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Заказ сначала нужно записать.");
		Возврат;	
	КонецЕсли;
	ПараметрыФормыОтчета = Новый Структура;
	ПараметрыФормыОтчета.Вставить("Отбор", Новый Структура("Заказ", Объект.Ссылка));
	//ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Отчет = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнегоОтчета(,, "РасчетЦеныПоДоходности");
	Если Отчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Отчет.ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормыОтчета);

КонецПроцедуры       

&НаКлиенте
Процедура СоздатьПолуфабрикат(Команда)
		Тд=Элементы.Товары.ТекущиеДанные;
	Если Тд=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено поле: Клиент";
		Сообщение.Поле = "Объект.Партнер"; //имя реквизита 
		//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	НаименованиеПолуфабриката="";
	ОписаниеОповещение= Новый ОписаниеОповещения("СозданиеПолуфабрикатаЗавершение",ЭтаФорма);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаСозданияПолуфабриката",,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

 &НаКлиенте
Процедура СозданиеПолуфабрикатаЗавершение(Результат, Параметры) Экспорт
	Если ТипЗнч(Результат)=Тип("Структура") Тогда
		Номенклатура=СоздатьНоменклатуруПолуфабриката(Результат.Наименование,Результат.Артикул);
		Тд=Элементы.Товары.ТекущиеДанные;
		Тд.Номенклатура=Номенклатура;
		Тд.ВерсияНоменклатуры = Неопределено;
		Тд.ДатаЭмиссии = Неопределено;
		Тд.Gtin = Неопределено;
		Тд.ЧестныйЗнак = Неопределено;
		Тд.КодЭтикеткиЗаказчика = Неопределено;
		Тд.NКонтракта = Неопределено;
		Тд.ВерсияНоменклатуры = Неопределено;
		Тд.ВерсияНоменклатуры = Неопределено;
		
		ТоварыНоменклатураПриИзменении(Неопределено);
		
		
	КонецЕсли;
КонецПроцедуры

Функция СоздатьНоменклатуруПолуфабриката(НаименованиеПолуфабриката,Артикул) //+Лико m.shenderov 19.05.2021
	
	НоваяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	НачатьТранзакцию();
	
	НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	НоваяНоменклатура.Наименование =НаименованиеПолуфабриката;
	//НоваяНоменклатура.НаименованиеПолное = Текст;
	НоваяНоменклатура.Артикул = Артикул;
	ВидНоменклатуры = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыПолуфабрикат.ЗначениеПараметра;
	НоваяНоменклатура.ВидНоменклатуры = ВидНоменклатуры;
	НоваяНоменклатура.ГруппаФинансовогоУчета = ВидНоменклатуры.ГруппаФинансовогоУчета;
	НоваяНоменклатура.ГруппаАналитическогоУчета = ВидНоменклатуры.ГруппаАналитическогоУчета;
	//НоваяНоменклатура.Код = Выборка.НоменклатураКод;
	НоваяНоменклатура.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
	//НоваяНоменклатура.ЕдиницаИзмерения =  Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("тыс.шт");
	НоваяНоменклатура.ЕдиницаИзмерения =  ВидНоменклатуры.ЕдиницаИзмерения;
	НоваяНоменклатура.ЕдиницаДляОтчетов = ВидНоменклатуры.ЕдиницаДляОтчетов;
	НоваяНоменклатура.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	НоваяНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	НоваяНоменклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры;
	НоваяНоменклатура.ВладелецХарактеристик =Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра;
	НоваяНоменклатура.ИспользоватьУпаковки = Истина;
	//НоваяНоменклатура.НаборУпаковок =  Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("тыс.шт");
	НоваяНоменклатура.НаборУпаковок = ВидНоменклатуры.НаборУпаковок;
	НоваяНоменклатура.ГруппаДоступа = Справочники.ГруппыДоступаНоменклатуры.НайтиПоНаименованию("Материалы товары");
	НоваяНоменклатура.СкладскаяГруппа =  Справочники.Лико_ПредопределенныеЗначения.СкладскаяГруппаНоменклатурыДляГП.ЗначениеПараметра;
	//НоваяНоменклатура.Лико_ТипЭтикетки = ТипЭтикетки;
	
	
	
	
	
	
	НоваяНоменклатура.Записать();
	//Если  Не ЗначениеЗаполнено(Артикул) Тогда 
	//	НоваяНоменклатура.Артикул =  Лико_Планирование.КодБезНулей(НоваяНоменклатура.Код) + "-0";
	//	НоваяНоменклатура.Записать();
	//КонецЕсли;
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Партнер", Истина),Объект.Партнер));
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(НоваяНоменклатура.Ссылка,МассивСтруктур);
	
	ЗафиксироватьТранзакцию();
	
	
	Возврат НоваяНоменклатура.Ссылка; 
	
	
КонецФункции //-Лико m.shenderov 19.05.2021

&НаКлиенте
Процедура СекцииТипНумератораПриИзменении(Элемент)
	ТекСтр = Элементы.Секции.ТекущиеДанные;
	ТекСтр.ТипКода = ПредопределенноеЗначение("Справочник.Лико_ТипыКодов.ПустаяСсылка");
	ТекСтр.Дополнительно = 0;
КонецПроцедуры

&НаКлиенте
Процедура СекцииТипНумератораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтр = Элементы.Секции.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекСтр.РабочийЦентр) Тогда 
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьТипыНумератора(ТекСтр.РабочийЦентр))  ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСекции(Команда)
	
	Если Элементы.ПоказатьСекции.Заголовок = "Показать секции" Тогда	
		элементы.Секции.Видимость = Истина;
		Элементы.ПоказатьСекции.Заголовок = "Скрыть секции";   
	Иначе
		элементы.Секции.Видимость = Ложь;
		Элементы.ПоказатьСекции.Заголовок = "Показать секции"; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НомераСекций(Команда)

	Для каждого стр из Объект.Секции Цикл
		Если стр.НомерСекции <> ПолучитьСвойствоИзСтрочнойСтруктуры(стр.ПараметрыСекции, "НомерСекции") и стр.НомерСекции <> 0 Тогда
			Если ВозможноУстановитьЭтотНомер(стр.РабочийЦентр, стр.НомерСекции, стр.ВидСекции ) Тогда  
				
				
				стр.ПараметрыСекции = ЗаменитьСвойствоВСтрочнойСтруктуре(стр.ПараметрыСекции, "НомерСекции", стр.НомерСекции) ;
				стр.ИмяСекции = ПолучитьИмяПоНомеруСекции(стр.РабочийЦентр, стр.НомерСекции);   
				стр.ПараметрыСекции = ЗаменитьСвойствоВСтрочнойСтруктуре(стр.ПараметрыСекции, "ИмяСекции", стр.ИмяСекции) ;  
			Иначе
				Сообщить("невозможно установить "+  стр.ВидСекции + " в секцию " + стр.НомерСекции );	
				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры    
 
&НаСервереБезКонтекста
Функция ПолучитьСвойствоИзСтрочнойСтруктуры(строка, Свойство)

	СтруктураИзСтроки = ЗначениеИзСтрокиВнутр(строка); 
	
	Возврат СтруктураИзСтроки[Свойство]

КонецФункции 

&НаСервереБезКонтекста
Функция ЗаменитьСвойствоВСтрочнойСтруктуре(строка, Свойство, Замена)

	СтруктураИзСтроки = ЗначениеИзСтрокиВнутр(строка); 
	СтруктураИзСтроки.Вставить(Свойство, Замена);
	
	Возврат ЗначениеВСтрокуВнутр(СтруктураИзСтроки);
	
КонецФункции    

&НаСервереБезКонтекста
Функция ПолучитьИмяПоНомеруСекции(РЦ, НомерСекции)


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеЦентрыСекции.Имя КАК Имя
		|ИЗ
		|	Справочник.РабочиеЦентры.Секции КАК РабочиеЦентрыСекции
		|ГДЕ
		|	РабочиеЦентрыСекции.Ссылка.Ссылка = &Ссылка
		|	И РабочиеЦентрыСекции.НомерСтроки = &НомерСтроки";
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСекции);
	Запрос.УстановитьПараметр("Ссылка", РЦ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ИмяСекции = "";
	
	Пока Выборка.Следующий() Цикл
		 ИмяСекции = Выборка.Имя; 
	КонецЦикла;
	
	Возврат ИмяСекции
	
КонецФункции    

&НаСервереБезКонтекста
Функция ВозможноУстановитьЭтотНомер(РЦ, НомерСекции, ВидСекции)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеЦентрыВидыСекций.ВидСекции КАК ВидСекции
		|ИЗ
		|	Справочник.РабочиеЦентры.Секции КАК РабочиеЦентрыСекции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры.ВидыСекций КАК РабочиеЦентрыВидыСекций
		|		ПО РабочиеЦентрыСекции.КлючСтроки = РабочиеЦентрыВидыСекций.КлючСтроки
		|ГДЕ
		|	РабочиеЦентрыСекции.НомерСтроки = &НомерСтроки
		|	И РабочиеЦентрыСекции.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСекции);  
	Запрос.УстановитьПараметр("Ссылка", РЦ);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидСекции");
	

	Если РезультатЗапроса.Найти(ВидСекции) <> Неопределено или РезультатЗапроса.Найти(ВидСекции.родитель) <> Неопределено  Тогда
		Возврат Истина
	Иначе
		возврат Ложь
	КонецЕсли;

	
КонецФункции


&НаСервере
Процедура ОбновитьРасчетТиражейНаСервере(ТолькоОбновитьТЧНормативовИЗатрат = Неопределено)
		
	Если ТолькоОбновитьТЧНормативовИЗатрат = Неопределено ИЛИ ТолькоОбновитьТЧНормативовИЗатрат = Ложь Тогда
		объект.РасчетТиражей.Очистить();
		РасчетТиражейНормативы.Очистить();
		РасчетТиражейЗатраты.Очистить();
	ИначеЕсли ТолькоОбновитьТЧНормативовИЗатрат Тогда
		РасчетТиражейНормативы.Очистить();
		РасчетТиражейЗатраты.Очистить();
	КонецЕсли;
	
	//Тираж = Объект.Тираж;
	//ШТКВМ = Объект.ШтКВМ;    
	//НарезкаРазмер = Объект.Нарезка.Размер/1000;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧЦвета
	|				И НЕ ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧРаботы
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|		ИНАЧЕ ЗаказКлиентаЦвета.ВидСекции
	|	КОНЕЦ КАК ВидРабот,
	|	ЗаказКлиентаЦвета.НомерРаботы КАК НомерРаботы,
	|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказКлиентаЦвета.ВидСекции.ВидРабот.Родитель <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Тиснение)
	|				ТОГДА 1
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЗаказКлиентаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеРотационное)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК КоличествоМатериалов,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказКлиентаЦвета.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеРотационное)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоТиснений,
	|	ЗаказКлиентаЦвета.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТМатериалы
	|ИЗ
	|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|ГДЕ
	|	ЗаказКлиентаЦвета.Ссылка = &Заказ
	|	И ЗаказКлиентаЦвета.Материал <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|	И ЗаказКлиентаЦвета.Материал <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ЗаказКлиентаЦвета.Материал <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧЦвета
	|				И НЕ ЗаказКлиентаЦвета.ВидСекции.ОтображатьВТЧРаботы
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|		ИНАЧЕ ЗаказКлиентаЦвета.ВидСекции
	|	КОНЕЦ,
	|	ЗаказКлиентаЦвета.НомерРаботы,
	|	ЗаказКлиентаЦвета.Ссылка,
	|	ЗаказКлиентаЦвета.НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВТМатериалы.КоличествоМатериалов) КАК КоличествоМатериалов,
	|	ВТМатериалы.Заказ КАК Заказ,
	|	ВТМатериалы.НомерПроката КАК НомерПроката
	|ПОМЕСТИТЬ ВТКоличествоматериалов
	|ИЗ
	|	ВТМатериалы КАК ВТМатериалы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТМатериалы.Заказ,
	|	ВТМатериалы.НомерПроката
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПроката,
	|	Лико_ПараметрыПроизводстваЗаказа.Тираж КАК Тираж,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражКвМ КАК МетражКвМ,
	|	Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку КАК МетрыНаНастройку,
	|	Лико_ПараметрыПроизводстваЗаказа.ПроцентНаБрак КАК ПроцентНаБрак,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК МетражДляРЦ,
	|	Лико_ПараметрыПроизводстваЗаказа.ВремяПечати КАК ВремяПечати,
	|	Лико_ПараметрыПроизводстваЗаказа.ВремяНаНастройку КАК ВремяНаНастройку,
	|	Лико_ПараметрыПроизводстваЗаказа.ДлинаРолика КАК ДлинаРолика,
	|	Лико_ПараметрыПроизводстваЗаказа.ВремяНаСменуРоликов КАК ВремяНаСменуРоликов,
	|	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.Лико_КоэффициентВремениДоходности КАК КоэффициентВремени,
	|	ЕСТЬNULL(ВТКоличествоматериалов.КоличествоМатериалов, 0) + 1 КАК КоличествоМатериалов,
	|	Лико_ПараметрыПроизводстваЗаказа.СкоростьПечати КАК Скорость
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоматериалов КАК ВТКоличествоматериалов
	|		ПО Лико_ПараметрыПроизводстваЗаказа.Заказ = ВТКоличествоматериалов.Заказ
	|			И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = ВТКоличествоматериалов.НомерПроката
	|ГДЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	|	И ВЫБОР
	|			КОГДА &Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПроката УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ КАК Заказ,
	|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПроката,
	|	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр КАК РабочийЦентр,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражКвМ КАК МетражКвМ,
	|	Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ КАК МетражДляРЦ,
	|	Лико_ПараметрыПроизводстваЗаказа.Доход / Лико_ПараметрыПроизводстваЗаказа.Доходность КАК Время,
	|	Лико_ПараметрыПроизводстваЗаказа.Стоимость КАК Стоимость,
	|	Лико_ПараметрыПроизводстваЗаказа.Себестоимость КАК Себестоимость,
	|	Лико_ПараметрыПроизводстваЗаказа.Рентабельность КАК Рентабельность,
	|	Лико_ПараметрыПроизводстваЗаказа.Доходность КАК Доходность,
	|	Лико_ПараметрыПроизводстваЗаказа.Доход КАК Доход,
	|	Лико_ПараметрыПроизводстваЗаказа.Тираж КАК Тираж,
	|	Лико_ПараметрыПроизводстваЗаказа.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА Лико_ПараметрыПроизводстваЗаказа.МетражКвМ > 0
	|			ТОГДА Лико_ПараметрыПроизводстваЗаказа.Стоимость / Лико_ПараметрыПроизводстваЗаказа.МетражКвМ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаМ2
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|ГДЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	|	И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = 1
	|	И ВЫБОР
	|			КОГДА &Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПроката УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_Затраты.НомерПроката КАК НомерПроката,
	|	Лико_Затраты.РабочийЦентр КАК РабочийЦентр,
	|	Лико_Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Лико_Затраты.Затрата КАК Затрата,
	|	Лико_Затраты.НомерРаботы КАК НомерРаботы,
	|	Лико_Затраты.ВидРабот КАК ВидРабот,
	|	Лико_Затраты.Количество КАК Количество,
	|	Лико_Затраты.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Лико_Затраты.Затрата = ЗНАЧЕНИЕ(Справочник.ценовыеГруппы.ЧестныйЗнак)
	|				ИЛИ Лико_Затраты.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Упаковка)   
	|				ИЛИ Лико_Затраты.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Втулки) 
	|				ИЛИ Лико_Затраты.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
	|					И Лико_Затраты.РабочийЦентр.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Omega)
	|			ТОГДА 2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Факторинг))
	|					ТОГДА 4
	|				КОГДА Лико_Затраты.СтатьяЗатрат В (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ДополнительныеМатериалы))
	|					ТОГДА ВЫБОР
	|							КОГДА Лико_Затраты.НомерПроката =2 ИЛИ Лико_Затраты.НомерПроката =3 
	|								ТОГДА 5
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОГДА Лико_Затраты.СтатьяЗатрат В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Чернила), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ПолотноДляТиснения), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ПолотноОфсетное), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Краска), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ЛакиКлеи), ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.Клики))
	|					ТОГДА 1
	|				ИНАЧЕ 3
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидЗатрат
	|ИЗ
	|	РегистрСведений.Лико_Затраты КАК Лико_Затраты
	|ГДЕ
	|	Лико_Затраты.ЗаказКлиента = &Заказ
	|	И ВЫБОР
	|			КОГДА &Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сумма УБЫВ"  ;
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);   
	
	ВыборкаЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаНормативы = ВыборкаЗапросов.Получить(2).Выбрать();
	Пока ВыборкаНормативы.Следующий() Цикл
		стр  = РасчетТиражейНормативы.Добавить();
		ЗаполнитьЗначенияСвойств(стр, выборкаНормативы); 
		Если ВыборкаНормативы.НомерПроката = 1 Тогда 
			РасчетТиражейМетражДляРЦ = ВыборкаНормативы.МетраждляРЦ
		КонецЕсли;
	КонецЦикла; 
	
	Если ТолькоОбновитьТЧНормативовИЗатрат = Неопределено ИЛИ ТолькоОбновитьТЧНормативовИЗатрат = Ложь Тогда
		ВыборкаПараметры = ВыборкаЗапросов.Получить(3).Выбрать();
		Пока ВыборкаПараметры.Следующий() Цикл
			стр = объект.РасчетТиражей.Добавить();
			ЗаполнитьЗначенияСвойств(стр, выборкаПараметры); 
			стр.ЦенаБезНДС = стр.Цена*100/122; 
		КонецЦикла;  
	КонецЕсли;
	
	К_Факторинг = 0;
	ВыборкаЗатраты = ВыборкаЗапросов.Получить(4).Выбрать();
	Пока ВыборкаЗатраты.Следующий() Цикл
		стр = РасчетТиражейЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(стр, выборкаЗатраты); 
		Если стр.ВидЗатрат = 4 Тогда 
			К_Факторинг = ВыборкаЗатраты.Сумма/Объект.СуммаДокумента;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетаПересчитатьДанные(стр) // --> Начало Лико Яцун 14.12.2022

	стр.стоимость = стр.Цена*стр.тираж;     
	Если ЗначениеЗаполнено(стр.МетражКВМ) Тогда 
		стр.ЦенаМ2 = стр.стоимость/стр.МетражКВМ;
    КонецЕсли;
	стр.Доход = стр.стоимость*К_Дох - стр.себестоимость;   
	Если ЗначениеЗаполнено(стр.Время) Тогда 
		стр.Доходность = стр.Доход/стр.Время;    
	Иначе
		стр.Доходность  = 0;
	КонецЕсли; 
	Если ЗначениеЗаполнено(стр.стоимость) Тогда 
   		стр.рентабельность= Окр(стр.Доход/стр.стоимость*100,2);  
	Иначе
		стр.рентабельность = 0;
	КонецЕсли; 
	
	стр.ЦенаБезНДС = стр.Цена*100/122; 
	
КонецПроцедуры // <-- Конец Лико Яцун 14.12.2022 

&НаКлиенте
Процедура РасчетТиражейТиражПриИзменении(Элемент) // --> Начало Лико Яцун 14.12.2022  
	
	ОбновитьРасчетТиражейНаСервере(Истина);
	
	ТекСтр = Элементы.РасчетТиражей.ТекущиеДанные;
	РасчетТиражейПересчет(ТекСтр);
	
КонецПроцедуры // <-- Конец Лико Яцун 14.12.2022

&НаКлиенте
Процедура РасчетТиражейПересчет(текстр) // --> Начало Лико Яцун 20.12.2022
	
	Если ЗначениеЗаполнено(текстр.Тираж) И ЗначениеЗаполнено(Объект.ШтКВМ) Тогда 
		ТекСтр.МетражКВМ = текСтр.Тираж/Объект.ШтКВМ *1000;                      
		
		МетражДляРЦТек = текстр.МетражКВМ/(ПолучитьРазмерНарезки()/1000);   
		Время = 0;
		текстр.стоимость = текстр.Цена*текстр.тираж;  
		//Рассчитываем метраж для РЦ   
		КоэффициентТиража =  текСтр.Тираж/Объект.Тираж;
		КоэффициентСтоимость = текСтр.Стоимость/Объект.СуммаДокумента; 
		ВремяОсновнойМашины = 0;
		Для каждого стрНом из РасчетТиражейНормативы Цикл  
			МетражПечатиТек = МетражДляРЦТек*(1+стрНом.ПроцентНаБрак) ;
			МетражДляРЦТек = МетражПечатиТек + стрНом.МетрыНаНастройку;              
			//ВремяРЦ  = стрНом.ВремяНаНастройку + стрНом.ВремяПечати*КоэффициентТиража; 
			Если ЗначениеЗаполнено(стрНом.Скорость) Тогда
				ВремяРЦ  = стрНом.ВремяНаНастройку + МетражПечатиТек/стрНом.Скорость;         
				Если ЗначениеЗаполнено(стрНом.ДлинаРолика) И МетражДляРЦТек> стрНом.ДлинаРолика Тогда 
					ВремяРЦ  = ВремяРЦ +Окр(МетражДляРЦТек/стрНом.ДлинаРолика+0.4999)*5;
				КонецЕсли;
			Иначе 
				ВремяРЦ = 0;
			КонецЕсли;  
			Если стрНом.КоэффициентВремени = 1 Тогда 
				ВремяОсновнойМашины = ВремяОсновнойМашины+ ВремяРЦ;
			КонецЕсли; 
			//Если в заказе нет основных машин, не применяем коэффициент времени
			Если стрНом.НомерПроката >1 Тогда  
				Время = Время+ВремяРЦ*стрНом.КоэффициентВремени;   
				Если  стрНом.НомерПроката =2 Тогда  
					КоэффициентМетражРЦ2 = МетражДляРЦТек/стрНом.МетражДляРЦ; 
				ИначеЕсли стрНом.НомерПроката =3 Тогда  
					КоэффициентМетражРЦ3 = МетражДляРЦТек/стрНом.МетражДляРЦ;
				КонецЕсли;				
			Иначе
				Если ЗначениеЗаполнено(ВремяОсновнойМашины) Тогда 	
					Время = Время+ВремяРЦ*стрНом.КоэффициентВремени; 
				Иначе
					Время = Время+ВремяРЦ; 
				КонецЕсли; 
				
			КонецЕсли;
			
			
		КонецЦикла;      
		текстр.Время = Время/60;
		текстр.МетражДляРЦ = МетражДляРЦТек;  
		Себестоимость = 0;
		КоэффициентМетражРЦ = МетражДляРЦТек/РасчетТиражейМетражДляРЦ;
		Для каждого стрЗатраты из РасчетТиражейЗатраты Цикл      
			Если стрЗатраты.ВидЗатрат = 1 Тогда 
				Себестоимость = Себестоимость+стрЗатраты.Сумма* КоэффициентМетражРЦ; 
			ИначеЕсли стрЗатраты.ВидЗатрат = 2 Тогда
				Себестоимость = Себестоимость+стрЗатраты.Сумма* КоэффициентТиража;  
			ИначеЕсли стрЗатраты.ВидЗатрат = 4 Тогда
				Себестоимость = Себестоимость+стрЗатраты.Сумма* КоэффициентСтоимость;  
			ИначеЕсли стрЗатраты.ВидЗатрат = 5 Тогда 
				Если  стрЗатраты.Номерпроката = 2 Тогда 
					Себестоимость = Себестоимость+стрЗатраты.Сумма* КоэффициентМетражРЦ2;
				ИначеЕсли  стрЗатраты.Номерпроката = 3 Тогда 
					Себестоимость = Себестоимость+стрЗатраты.Сумма* КоэффициентМетражРЦ3;
				КонецЕсли;
			Иначе
				Себестоимость = Себестоимость+стрЗатраты.Сумма;
			КонецЕсли;
		КонецЦикла;    
		текстр.себестоимость = Себестоимость;
		//            текстр.стоимость = текстр.Цена*текстр.тираж;
		ПараметрыРасчетаПересчитатьДанные(ТекСтр); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерНарезки() // --> Начало Лико Яцун 14.12.2022
	Возврат Объект.Нарезка.Размер;	
КонецФункции // <-- Конец Лико Яцун 14.12.2022

&НаСервере
Функция НуженРасчетНарезки(ВизЗаказаПроверки) // <-- Начало Лико Яцун С. В. 21.01.2026
	
	Если (ВизЗаказаПроверки = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор ИЛИ ВизЗаказаПроверки = Перечисления.Лико_ВидыЗаказов.ПовторСНовымОбъединением) И НЕ (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) Тогда
		НуженРасчетНарезки = Ложь;                  
		Возврат НуженРасчетНарезки;
	КонецЕсли;

	Если ((Объект.Площадка = Справочники.Лико_Площадки.Ликофлекс ИЛИ Объект.Площадка = Справочники.Лико_Площадки.Линкс) 
		И Объект.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.Термоусадка 
		И ЗначениеЗаполнено(Объект.ШтампВырубной))
		ИЛИ (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) Тогда
		СтрВырубка = Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.Вырубка));
		НуженРасчетНарезки = Истина;
		Для каждого ЗначМ Из СтрВырубка Цикл
			Если ЗначМ.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Schober Тогда
				НуженРасчетНарезки = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла
	Иначе
		НуженРасчетНарезки = Ложь;                  
	КонецЕсли;
	
	Если НуженРасчетНарезки И НЕ (Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19) Тогда
		ШагПоНарезке = ПолучитьШагПоНарезкеШтампа(Объект.ШтампВырубной);
		Если ШагПоНарезке = 0 Тогда
			НуженРасчетНарезки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НуженРасчетНарезки;	
		
КонецФункции // <-- Конец Лико Яцун С. В. 21.01.2026

&НаКлиенте
Процедура РасчетТиражейЦенаПриИзменении(Элемент) // --> Начало Лико Яцун 14.12.2022  
	
	ТекСтр = Элементы.РасчетТиражей.ТекущиеДанные;
//	текстр.стоимость = текстр.Цена*текстр.тираж;
	ПараметрыРасчетаПересчитатьДанные(ТекСтр);     //.ПолучитьИдентификатор()

КонецПроцедуры // <-- Конец Лико Яцун 14.12.2022

&НаКлиенте
Процедура РасчетТиражейДоходностьПриИзменении(Элемент) // --> Начало Лико Яцун 14.12.2022
	
	ТекСтр = Элементы.РасчетТиражей.ТекущиеДанные;
	текстр.доход = текстр.доходность*текстр.время; 
	текстр.стоимость = (текстр.доход+текстр.себестоимость)/К_Дох;
	текстр.Цена = текстр.стоимость/текстр.тираж; 
	текстр.ЦенаБезНДС = текстр.Цена *100/122; 
	Если ЗначениеЗаполнено(текстр.МетражКВМ) Тогда 
		текстр.ЦенаМ2 = текстр.стоимость/текстр.МетражКВМ;
    КонецЕсли;

	текстр.рентабельность = Окр(текстр.Доход/текстр.стоимость*100,2);
	
КонецПроцедуры // <-- Конец Лико Яцун 14.12.2022

&НаКлиенте
Процедура РасчетТиражейРентабельностьПриИзменении(Элемент) // --> Начало Лико Яцун 14.12.2022
	
	ТекСтр = Элементы.РасчетТиражей.ТекущиеДанные; 
	СтоимостьФакторинга = К_Факторинг*текстр.стоимость;
	текстр.стоимость = (текстр.Себестоимость-СтоимостьФакторинга) / (К_Дох -К_Факторинг-текстр.рентабельность / 100)  ;	
	текстр.Цена = текстр.стоимость/текстр.тираж; 
	текстр.ЦенаБезНДС = текстр.Цена*100/122;	
	Если ЗначениеЗаполнено(текстр.МетражКВМ) Тогда 
		текстр.ЦенаМ2 = текстр.стоимость/текстр.МетражКВМ;
    КонецЕсли;
    текстр.себестоимость =  текстр.себестоимость-СтоимостьФакторинга +К_Факторинг*текстр.стоимость;
	текстр.Доход = текстр.стоимость*К_Дох - текстр.себестоимость;   
	Если ЗначениеЗаполнено(текстр.Время) Тогда 
		текстр.Доходность = текстр.Доход/текстр.Время;
	КонецЕсли;  
	
КонецПроцедуры // <-- Конец Лико Яцун 14.12.2022

&НаКлиенте
Процедура РасчетТиражейЦенаБезНДСПриИзменении(Элемент) // <-- Начало Лико Яцун С. В. 16.05.2023
	ТекСтр = Элементы.РасчетТиражей.ТекущиеДанные; 
	текстр.цена = текстр.ЦенаБезНДС *122/100;
	ПараметрыРасчетаПересчитатьДанные(ТекСтр);     //.ПолучитьИдентификатор()
КонецПроцедуры // <-- Конец Лико Яцун С. В. 16.05.2023

&НаКлиенте
Процедура ОбновитьРасчетТиражей(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 	
		Если ЭтаФорма.Модифицированность Тогда
			Сообщить("Необходимо записать документ");
			Возврат
		ИначеЕсли Команда.Имя = "ЗаполнитьРасчетТиражей" Тогда
			ОбновитьРасчетТиражейНаСервере();
		Иначе
			ОбновитьРасчетТиражейНаСервере(Истина);
			Для Каждого СтрТ Из Объект.РасчетТиражей Цикл
				РасчетТиражейПересчет(СтрТ)	
			КонецЦикла;
		КонецЕсли; 
	иначе  
		Сообщить("Необходимо записать заказ");
		Возврат	
		
	КонецЕсли;
			
	
КонецПроцедуры

&НаКлиенте
Процедура ПробникПриИзмененииУстановкаТехнолога(Элемент)
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 
КонецПроцедуры


&НаКлиенте
Процедура СклейкаРукаваНеНужнаПриИзменении(Элемент)
	Объект.СклейкаРукаваНужна = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 
КонецПроцедуры   

&НаКлиенте
Процедура СклейкаРукаваНужнаПриИзменении(Элемент)
	Объект.СклейкаРукаваНеНужна = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 
КонецПроцедуры



&НаКлиенте
Процедура ПеремоткаНеНужнаПриИзменении(Элемент)
	
	Объект.ПеремоткаНужна = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 

КонецПроцедуры  

&НаКлиенте
Процедура ПеремоткаНужнаПриИзменении(Элемент)
	
	Объект.ПеремоткаНеНужна = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 

КонецПроцедуры



&НаКлиенте
Процедура ОстатокРоликаНеХранитьПриИзменении(Элемент)
	
	Объект.ОстатокРоликаХранить = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 

КонецПроцедуры


&НаКлиенте
Процедура ОстатокРоликаХранитьПриИзменении(Элемент)
	
	Объект.ОстатокРоликаНеХранить = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 

КонецПроцедуры


&НаКлиенте
Процедура ОтгрузкаНужнаПриИзменении(Элемент)
	Объект.ОтгрузкаНеНужна = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 
КонецПроцедуры


&НаКлиенте
Процедура ОтгрузкаНеНужнаПриИзменении(Элемент)
	
	Объект.ОтгрузкаНужна = Ложь;
	Объект.Технолог = ПользователиКлиентСервер.ТекущийПользователь(); 

КонецПроцедуры


&НаКлиенте
Процедура РедактироватьТехКарту(Команда)

	Обработка = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнейОбработки(,, "РедакторТехКарты");

	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка.Ссылка); 
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияОбработкиРедакторТехКарты", ЭтотОбъект);
	СтруктураПараметров = Новый Структура("Заказ, РабочийЦентр", Объект.Ссылка, Объект.РабочийЦентр);
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", СтруктураПараметров, ЭтаФорма,,,,ОповещениеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияОбработкиРедакторТехКарты(Результат, ДопПараметры)  Экспорт
	
	Если Результат = неопределено Тогда
        Возврат 
	КонецЕсли;
	
	ЗаписатьВРежимеОбмена(Результат);
	
КонецПроцедуры 

Процедура ЗаписатьВРежимеОбмена(Результат) 
	
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект(); 
	ЗаполнитьЗначенияСвойств(ДокОбъект, Результат);
	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись,);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыРаботЦвета() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ВидыСекций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ВидыСекций КАК Лико_ВидыСекций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_ВидыСекций КАК Лико_ВидыСекций1
	|		ПО Лико_ВидыСекций.Ссылка = Лико_ВидыСекций1.Родитель
	|ГДЕ
	|	Лико_ВидыСекций.Ссылка <> ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	|	И Лико_ВидыСекций1.Ссылка ЕСТЬ NULL";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")    
		
КонецФункции   


&НаСервереБезКонтекста  
//не нужна, если видпечати удален
Функция ПолучитьВидПечатиПеречисление(ВидСекции) 
	
	ВидПечати = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ВидыСекций.ВидПечати.ВидПечати КАК ВидПечати
		|ИЗ
		|	Справочник.Лико_ВидыСекций КАК Лико_ВидыСекций
		|ГДЕ
		|	Лико_ВидыСекций.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидСекции);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Выборка.Следующий();  
		
	ВидПечати = Выборка.ВидПечати;
	 
	Возврат ВидПечати 

	
	
КонецФункции


&НаКлиенте
Процедура ОткрытьФормуРедактированияПараметровЦвета(Элемент)

	ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");	
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат
	КонецЕсли;
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);

	ТекСтр = Элемент.ТекущиеДанные; 
	
	РеквизитыЦвета = ПолучитьМассивРеквизитовТЧ();
	
	СтруктураПраметрыСекции = Новый Структура;

	Для каждого рек из РеквизитыЦвета Цикл  
		СтруктураПраметрыСекции.Вставить(рек, ТекСтр[рек]); 	
	КонецЦикла;
	
	СтруктураПраметрыСекции.Вставить("ТипЦвета",	 	ТекСтр.ТипЦвета1); 
	СтруктураПраметрыСекции.Вставить("НазваниеПантона", ТекСтр.Название);

	СтруктураПраметрыСекции.Вставить("ТипПродукта", 	ЗначениеРеквизита(текстр.Номенклатура,"ЦеноваяГруппа"));   


 
	СтруктураРедактирования = Новый Структура;
	СтруктураРедактирования.Вставить("РежимВыбора", Истина);
	СтруктураРедактирования.Вставить("Секция", ТекСтр.ВидСекции); 
	СтруктураРедактирования.Вставить("ИмяСекции", ТекСтр.НомерСекции);
	СтруктураРедактирования.Вставить("ПараметрыСекцииЦвета", СтруктураПраметрыСекции);  
	СтруктураРедактирования.Вставить("РабочийЦентр", ТекСтр.РабочийЦентр); 
	СтруктураРедактирования.Вставить("Ссылка", Объект.Ссылка); 
	СтруктураРедактирования.Вставить("Площадка", Объект.Площадка); 
	СтруктураРедактирования.Вставить("Комбинированный", Объект.Комбинированный); 



	допПараметры = Новый Структура;
	допПараметры.Вставить("КлючСтроки",  ТекСтр.КлючСтроки);
	допПараметры.Вставить("НомерПроката", ТекСтр.НомерПроката);

	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированиеПараметровЦвета", ЭтаФорма, допПараметры);

	ФормаРедактированияСтрока =  ЗначениеРеквизита(ТекСтр.ВидСекции, "ИмяФормыРедактированияПараметров");

	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.РедактированиеПараметровСекции" + ФормаРедактированияСтрока, СтруктураРедактирования, ЭтаФорма, , , , ОбработкаЗакрытия);

КонецПроцедуры  


&НаКлиенте
Процедура ПриЗакрытииФормыРедактированиеПараметровЦвета(Результат, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		Возврат
	КонецЕсли;
	
	СтруктураПараметров = Результат;
	
	ТекСтр = Объект.Цвета.НайтиСтроки(новый Структура("КлючСтроки", ДопПараметры.КлючСтроки));
	
	Если ТекСтр.Количество() > 0 Тогда   		
		
		ЗаполнитьЗначенияСвойств(ТекСтр[0], СтруктураПараметров);  
		
		Если НЕ (ЗначениеРеквизита(ТекСтр[0].ВидСекции,"ОтображатьВТЧЦвета") И НЕ ЗначениеРеквизита(ТекСтр[0].ВидСекции,"ОтображатьВТЧРаботы")) Тогда
			ЗаписатьЦветаВРаботы();
			Если ТекСтр[0].ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка")   Тогда 
		 		ЗаполнениеПараметровОснастки();			
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры


&НаСервереБезКонтекста  
Функция ПолучитьТипыЦвета() 
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ТипыЦвета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лико_ТипыЦвета КАК Лико_ТипыЦвета";
	

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") 		
	
	
КонецФункции

#Область ОбработчикиСобытийТЧЦвета 

&НаКлиенте
Процедура ЦветаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;	
	Если НоваяСтрока Тогда
		КлючСтроки = Новый УникальныйИдентификатор;
		ТекущиеДанные.КлючСтроки = КлючСтроки;
		ТекущиеДанные.НомерВарианта = 1; 
		Если Не ЗначениеЗаполнено(ТекущиеДанные.номерпроката) Тогда 
			ТекущиеДанные.номерпроката =1;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(ТекущиеДанные.НомерРаботы) Тогда 
			ТекущиеДанные.НомерРаботы = 1;
		КонецЕсли;
		Если Копирование И ТекущиеДанные.ВидСекции <> ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда
			ТекущиеДанные.Форма = Неопределено;
			//Если ТипЗнч(ТекущиеДанные.ВалФорма) = Тип("СправочникСсылка.Лико_Формы") Тогда
			//	ТекущиеДанные.ВалФорма = Неопределено;
			//КонецЕсли;
		КонецЕсли;
		Если Копирование Тогда
			ДобавитьУсловноеОформлениеЦветаВалФорма();
			ДобавитьУсловноеОформлениеЦветаВидОснастка();
			ДобавитьУсловноеОформлениеЦветаРабочийЦентр();
		КонецЕсли;
		Если Объект.Цвета.Количество() >= 10 Тогда
			Элементы.Цвета.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
		Иначе
			Элементы.Цвета.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЦветаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Текстр = Элементы.Цвета.ТекущиеДанные;	
	Если ЗначениеЗаполнено(Текстр.Материал) Тогда 
 		Текстр.КодМатериала = ЗначениеРеквизита(Текстр.Материал, "Код");
	КонецЕсли;
	
	ПроверитьВырубнойШтамп();
	ПроставитьВидВырубки(Истина); 
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);
	
КонецПроцедуры


&НаКлиенте
Процедура ЦветаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Заголовок = "Ред." Тогда  
		Если не ЗначениеЗаполнено(Объект.ДатаУтвержденияЦветов) Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьФормуРедактированияПараметровЦвета(Элемент);  
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ЦветаПриИзменении(Элемент)
	
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда	
		текстр = Элементы.Цвета.ТекущиеДанные;
		Если ЗначениеЗаполнено(текстр.формулапантона) Тогда 
			ЦГ = ЗначениеРеквизита(текстр.ФормулаПантона,"ЦеноваяГруппа");
			Номенклатура =  ЗначениеРеквизита(текстр.ФормулаПантона,"Номенклатура");
			//Если ЗначениеЗаполнено(ЦГ) Тогда  
				текстр.ТипКраски = ЦГ;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(Номенклатура) Тогда  
				текстр.Номенклатура = Номенклатура;
			//КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипЗаливкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекСтр.ВидТМЦ) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		
		Если ТекСтр.ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска") Тогда   
			ДанныеВыбора.ЗагрузитьЗначения(ПолучитьТипыЦвета());	
		Иначе    
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.Сплошная"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.НеСплошная"));
		КонецЕсли;  
	Иначе
		Сообщить("заполните Вид ТМЦ");
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЦветаТипЗаливкаПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;
	Если ТипЗнч(стр.ТипЗаливка) = Тип("ПеречислениеСсылка.Лико_ВидЗаливки") Тогда 
		
		//Если  стр.ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Лак") Тогда 
		//	Если  стр.ТипЗаливка = ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.Сплошная") Тогда
		//		стр.ТипЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.ЛакСплошной");
		//	Иначе
		//		стр.ТипЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.ЛакВыборочный");
		//	КонецЕсли; 				
		//КонецЕсли;
		
			
    	стр.ВидЗаливки = стр.ТипЗаливка;
	Иначе
		стр.ТипЦвета1 = стр.ТипЗаливка;  
		стр.ВидЗаливки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВидСекцииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекстПоиска = ВРег(Текст);
	
	Пока СтрНайти(ТекстПоиска, "  ") > 0 Цикл
		ТекстПоиска = СтрЗаменить(ТекстПоиска, "  ", " ");
	КонецЦикла;
	
	ТекстПоиска = СокрЛП(ТекстПоиска);
	
	ДлинаТекста = СтрДлина(ТекстПоиска);
	Если ДлинаТекста = 0 Тогда
		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Шрифт = Новый Шрифт(,,Истина);
	Цвет = WebЦвета.Зеленый;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	МассивПодстрок = СтрРазделить(ТекстПоиска, " ");
	
	СП = Новый СписокЗначений;
	СП.ЗагрузитьЗначения(ПолучитьВидыРаботЦвета());	
	
	//Для Каждого Стр Из Элемент.СписокВыбора Цикл 
	Для Каждого Стр Из СП Цикл
			
		Строка = Стр.Значение;
		СтрокаВРег = ВРег(Строка);
		
		ВхожденияНайдены = Истина;
		
		Для Каждого Подстрока Из МассивПодстрок Цикл
			Если Найти(СтрокаВРег, Подстрока) = 0 Тогда
				ВхожденияНайдены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ВхожденияНайдены Тогда
			Продолжить
		КонецЕсли;
		
		ДлинаСтроки = СтрДлина(Строка);
		Массив = Новый Массив(ДлинаСтроки);
		
		Для Каждого Подстрока Из МассивПодстрок Цикл
			ДлинаПодстроки = СтрДлина(Подстрока);
			НачалоПоиска = 1;			
			Пока Истина Цикл
				ПозицияПодстроки = СтрНайти(СтрокаВРег, Подстрока, , НачалоПоиска);
				Если ПозицияПодстроки = 0 Тогда
					Прервать;
				КонецЕсли;
				
				НачалоПоиска = ПозицияПодстроки + ДлинаПодстроки;
				
				Для Сч = ПозицияПодстроки По НачалоПоиска - 1 Цикл
					Массив[Сч - 1] = Истина;
				КонецЦикла;				
				
				Если НачалоПоиска > ДлинаСтроки Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;			
		КонецЦикла;
		
		МассивСтрок = Новый Массив;		
		Для Сч = 0 По Массив.ВГраница() Цикл
			Символ = Сред(Строка, Сч + 1, 1);
			Если Массив[Сч] = Неопределено Тогда
				МассивСтрок.Добавить(Символ);
			Иначе
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символ, Шрифт, Цвет));
			КонецЕсли;
		КонецЦикла;
		
		ДанныеВыбора.Добавить(Строка, Новый ФорматированнаяСтрока(МассивСтрок));
		
		Если ДанныеВыбора.Количество() = 50 Тогда
			Прервать
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЦветаВидСекцииПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;	 
	 
	
	Если стр.ВидСекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГлубокаяПечать") Тогда
		Элементы.ЦветаГрамматура.Доступность = Ложь;
	Иначе
		Элементы.ЦветаГрамматура.Доступность = Истина;		
	КонецЕсли;
	
	ВидимостьФормыГлубокой();
	
	//Лико Субботин СЮВ 22.10.2021 
	реквизитыТЧ = ПолучитьМассивРеквизитовТЧ();
	//очистка строки
	для Каждого текРек из реквизитыТЧ цикл
		
		Если текРек = "ВидСекции"  ИЛИ  текРек = "КлючСтроки" ИЛИ  текРек = "НомерПроката" ИЛИ  текРек = "НомерВарианта" ИЛИ  текРек = "РабочийЦентр" ИЛИ  текРек = "НомерРаботы" Тогда 
			Продолжить; 
		ИначеЕсли 
			ЗначениеРеквизита(стр.ВидСекции,"Печать") И текРек = "ВидТМЦ" ИЛИ текРек = "ТипЦвета1"  ИЛИ  текРек = "Название" Тогда 
			стр.ТипЗаливка = стр.ТипЦвета1;
			Продолжить				
		Иначе
			стр[текРек] = неопределено;
		КонецЕсли;
		Если текРек = "Оснастка" И ЗначениеРеквизита(стр.ВидСекции,"Оснастка") Тогда
			Стр.ВидОснастка = стр[текРек];
		//ИначеЕсли текРек = "Вал" ИЛИ текРек = "Форма" Тогда
		//    Стр.ВалФорма = стр[текРек];
		КонецЕсли;
	КонецЦикла;   
	
	стр.ВидПечати = ПолучитьВидПечатиПеречисление(стр.ВидСекции);
	
	ВидТМЦ = ЗначениеРеквизита(стр.ВидСекции, "ВидТМЦ");
	Если ЗначениеЗаполнено(ВидТМЦ) Тогда
		Если стр.ВидТМЦ <> ВидТМЦ Тогда 
			стр.ВидТМЦ = ВидТМЦ;
			стр.ТипЦвета1 = Неопределено;
			стр.Название = Неопределено;
			стр.ТипЗаливка =Неопределено;
		КонецЕсли;	
	КонецЕсли; 
	
	ВидЗаливки = ПолучитьВидЗаливкиПоУмолчанию(стр.ВидСекции, стр.ВидТМЦ);
	Если ЗначениеЗаполнено(ВидЗаливки) Тогда 

		стр.ВидЗаливки = ВидЗаливки;
		стр.ТипЗаливка = ВидЗаливки;  
	КонецЕсли;
	
	Если ЗначениеРеквизита(стр.ВидСекции,"Оснастка") И (НЕ ЗначениеЗаполнено(стр.ВидОснастка) ИЛИ ТипЗнч(стр.ВидОснастка) <> Тип("СправочникСсылка.Номенклатура")) Тогда
		стр.ВидОснастка = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");	
	ИначеЕсли ЗначениеРеквизита(стр.ВидСекции,"ИспользоватьВидТМЦ") И ТипЗнч(стр.ВидОснастка) <> Тип("СправочникСсылка.Лико_ВидыТМЦ") 
		ИЛИ (НЕ ЗначениеРеквизита(стр.ВидСекции,"Оснастка") И НЕ ЗначениеРеквизита(стр.ВидСекции,"ИспользоватьВидТМЦ")) Тогда 
		стр.ВидОснастка = Неопределено;
	КонецЕсли;	
	//Если (ЗначениеРеквизита(стр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") ИЛИ стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.БессольвентнаяЛаминация")) 
	//	И (НЕ ЗначениеЗаполнено(стр.ВалФорма) ИЛИ ТипЗнч(стр.ВалФорма) <> Тип("СправочникСсылка.Номенклатура")) Тогда   
	//	стр.ВалФорма = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	//ИначеЕсли НЕ ЗначениеЗаполнено(стр.ВалФорма) Тогда
	//	стр.ВалФорма = ПредопределенноеЗначение("Справочник.Лико_Формы.ПустаяСсылка");
	//КонецЕсли;
	ЗаписатьЦветаВРаботы();   
	
	Если  Не (Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Аннулирован") 
		ИЛИ Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Создан")) Тогда 
		стр = Элементы.Цвета.ТекущиеДанные;
		Если ЗначениеЗаполнено(стр.Материал) Тогда
			Если ЕстьРезерв(объект.Ссылка) Тогда 
				Сообщить("Вы изменили вид работ на который ранее был зарезервирован материал. Оповестите об изменении планировщика или бригадира");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПроверкаВидСекцииВидТМЦ(ВидСекции,ВидТМЦ ) 
	Отбор =Новый Структура("ПараметрСекции", ВидТМЦ); 
	Если ВидСекции.ЗначенияПараметров.НайтиСтроки(Отбор)<> Неопределено Тогда 
		Возврат Истина;
	Иначе Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЦветаВидТМЦПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;  
	
	реквизитыТЧ = ПолучитьМассивРеквизитовТЧ();
	//очистка строки
	для Каждого текРек из реквизитыТЧ цикл
		
		Если текРек = "РабочийЦентр" ИЛИ текРек = "Номерработы" ИЛИ текРек = "ВидПечати" ИЛИ  текРек = "ВидСекции" ИЛИ текРек = "ВидТМЦ" ИЛИ  текРек = "КлючСтроки" ИЛИ  текРек = "НомерПроката" ИЛИ  текРек = "НомерВарианта" Тогда 
			Продолжить;
		Иначе
			стр[текРек] = неопределено;
		КонецЕсли;
		//Если текРек = "Вал" ИЛИ текРек = "Форма" Тогда
		//    Стр.ВалФорма = стр[текРек];
		//КонецЕсли;
	КонецЦикла;
	
	ВидЗаливки = ПолучитьВидЗаливкиПоУмолчанию(стр.ВидСекции, стр.ВидТМЦ);

	стр.ВидЗаливки = ВидЗаливки;
	стр.ТипЗаливка = ВидЗаливки;
	
	стр.ВидОснастка = стр.ВидТМЦ;
	
КонецПроцедуры


&НаСервереБезКонтекста 
Функция ПроверитьСоответствиеЦеновойГруппыВидуСекции(ЦГ, ВидСекции, Площадка, ТипЦвета);    
	Запрос = Новый  Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеновыеГруппыЛико_ВидыСекций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦеновыеГруппы.Лико_ВидыСекций КАК ЦеновыеГруппыЛико_ВидыСекций
	|ГДЕ
	|	ЦеновыеГруппыЛико_ВидыСекций.Ссылка = &ЦГ
	|	И ЦеновыеГруппыЛико_ВидыСекций.ВидСекции = &ВидСекции
	|	И ВЫБОР
	|			КОГДА ЦеновыеГруппыЛико_ВидыСекций.Площадка = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЦеновыеГруппыЛико_ВидыСекций.Площадка = &Площадка
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ЦеновыеГруппыЛико_ВидыСекций.Ссылка.Лико_ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Краска)
	|				ТОГДА ЦеновыеГруппыЛико_ВидыСекций.ТипЦвета = &ТипЦвета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";  
	Запрос.УстановитьПараметр("ЦГ", ЦГ);
	Запрос.УстановитьПараметр("ВидСекции", ВидСекции);
	Запрос.УстановитьПараметр("Площадка", Площадка.Организация);
	Запрос.УстановитьПараметр("ТипЦвета", ТипЦвета);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;   
	
КонецФункции	

&НаКлиенте
Процедура ЦветаТипКраскиПриИзменении(Элемент)   
	текстр = Элементы.Цвета.ТекущиеДанные;  

	Если ЗначениеЗаполнено(текстр.типкраски) Тогда  

			
		Если ЗначениеРеквизита(текстр.ТипКраски, "Лико_ВидТМЦ") <> текстр.ВидТМЦ Тогда 
			Сообщить("Выбранный тип не соответствует указанному Виду ТМЦ"); 
			текстр.типкраски = Неопределено;   
			Возврат ;
		КонецЕсли;
		
		Если Не ПроверитьСоответствиеЦеновойГруппыВидуСекции(текстр.ТипКраски,текстр.ВидСекции, Объект.Площадка,текстр.ТипЦвета1) Тогда 
            Сообщить("Выбранный тип не соответствует Виду работ или типу цвета (для краски)"); 
			текстр.типкраски = Неопределено; 
			Возврат ;
		КонецЕсли;

			
		
		ВидПечати = ЗначениеРеквизита(текстр.ВидСекции, "ВидПечати");
		Если (ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Глубокая") ИЛИ ВидПечати = ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Бессольвент")) 
			И ЗначениеРеквизита(текстр.РабочийЦентр, "Лико_Площадка") = ГлЛико_Площадки.ИксПак Тогда
			текстр.Грамматура = ЗначениеРеквизита(текстр.типкраски, "КоэффициентКраскоПереноса");
			ЗаполнитьФормулуПантона(ТекСтр);	
		ИначеЕсли (текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ОфсетнаяПечать") ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ФлексоПечать")) 
			И ЗначениеРеквизита(текстр.РабочийЦентр, "Лико_Площадка") = ГлЛико_Площадки.ИксПак И НЕ ЗначениеЗаполнено(текстр.ФормулаПантона) Тогда
			текстр.Название = ЗначениеРеквизита(текстр.типкраски,"Наименование")	
		КонецЕсли;
		
	КонецЕсли;  
	
	Если  ЗначениеРеквизита(текстр.Номенклатура, "ЦеноваяГруппа") <> текстр.ТипКраски Тогда 
		текстр.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЦветаНазваниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	
	Если Текстр.типЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Pmc") Тогда 
		Если Текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			//ПараметрыФормы.Вставить("ВидПечати", текстр.видпечати);  
			ПараметрыФормы.Вставить("ВидСекции", текстр.ВидСекции);

			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПантона", ЭтаФорма);
			ОткрытьФорму("Справочник.Лико_Пантоны.Форма.ФормаВыбора", ПараметрыФормы , , , , , ОписаниеОповещения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаНазваниеПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;

	Если ЗначениеЗаполнено(стр.ФормулаПантона) Тогда 
		стр.ФормулаПантона =  ПустаяСсылка("Лико_ФормулыПантонов");
	КонецЕсли;
	
	ОчиститьНоменклатураФормулаПантона(стр) ;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ЦветаПередУдалением(Элемент, Отказ)
//	
//	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
//	УдалитьСписокЗначений("Формы", ТекущиеДанные.КлючСтроки);


//КонецПроцедуры

&НаКлиенте
Процедура ЦветаПослеУдаления()
	ПроверитьВырубнойШтамп();
	ПроставитьВидВырубки(Истина); 
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);

	DFMКлиент.ЗаблокироватьНоменклатуру(ЭтаФорма,ДатаНачалаСозданияНоменклатурыDFM И Объект.Цвета.Количество()>0);
	ЗаписатьЦветаВРаботы();
	Если Объект.Цвета.Количество() >= 10 Тогда
		Элементы.Цвета.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
	Иначе
		Элементы.Цвета.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
	КонецЕсли;
	ВидимостьФормыГлубокой();
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормулаПантонаПриИзменении(Элемент)
	
	текстр = Элементы.Цвета.ТекущиеДанные;

	Если (текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГлубокаяПечать") ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГлубокаяЛаминация") 
		ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.БессольвентнаяЛаминация")) И ЗначениеРеквизита(текстр.РабочийЦентр, "Лико_Площадка") = ГлЛико_Площадки.ИксПак Тогда
		текстр.Название = ЗначениеРеквизита(текстр.ФормулаПантона,"Наименование")	
	ИначеЕсли (текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ОфсетнаяПечать") ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ФлексоПечать")) 
		И ЗначениеРеквизита(текстр.РабочийЦентр, "Лико_Площадка") = ГлЛико_Площадки.ИксПак Тогда
		текстр.Название = ?(ЗначениеЗаполнено(текстр.ФормулаПантона),ЗначениеРеквизита(текстр.ФормулаПантона,"Наименование"),ЗначениеРеквизита(текстр.ТипКраски,"Наименование"));	
	КонецЕсли;
	
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда
		
		Если ЗначениеЗаполнено(текстр.формулапантона) Тогда 
			ЦГ = ЗначениеРеквизита(текстр.ФормулаПантона,"ЦеноваяГруппа");
			Номенклатура =  ЗначениеРеквизита(текстр.ФормулаПантона,"Номенклатура");
			//Если ЗначениеЗаполнено(ЦГ) Тогда  
			текстр.ТипКраски = ЦГ;
			//КонецЕсли;   
			//Если ЗначениеЗаполнено(Номенклатура) Тогда  
			текстр.Номенклатура = Номенклатура;
			//КонецЕсли;   
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТрафаретнаяСеткаПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(стр.ТрафаретнаяСетка) Тогда
		ГрамматураСетки =  ЗначениеРеквизита(стр.ТрафаретнаяСетка,"Грамматура");
		Если ЗначениеЗаполнено(ГрамматураСетки)  Тогда
			стр.Грамматура = ГрамматураСетки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипЦвета1ПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные; 
	
	Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЛаминацияСамоклейкой") тогда 		
		стр.ВидТМЦ = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.ПустаяСсылка");  		
	Иначе 		
		стр.ВидТМЦ = ЗначениеРеквизита( стр.ТипЦвета1, "ВидТМЦ") ;     
	КонецЕсли;    
	
	Если стр.ТипЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.ПустаяСсылка") Тогда
		стр.ТипЗаливка = Неопределено;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВидЗаливкиПриИзменении(Элемент)    
	
	стр = Элементы.Цвета.ТекущиеДанные;
	
	Если стр.ВидЗаливки = ПредопределенноеЗначение("Перечисление.Лико_ВидЗаливки.ПустаяСсылка") Тогда
		стр.ТипЗаливка = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаНоменклатураПриИзменении(Элемент)
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.номенклатура) Тогда
		//20230531 Проверяем соответствие реквизитов  
		ЦеноваяГруппа =  ЗначениеРеквизита(текстр.Номенклатура,"ЦеноваяГруппа");
		Если ЗначениеРеквизита(ЦеноваяГруппа, "Лико_ВидТМЦ") <> текстр.ВидТМЦ Тогда 
			Сообщить("Выбранная номенклатура не соответствует указанному Виду ТМЦ"); 
			текстр.номенклатура = Неопределено;  
			Возврат;
		КонецЕсли;	
		//20190715 - меняем не "Тип краски", а "Тип краски факт"  
		//20230317 - убираем тип краски Факт из конфигурации, меняем Тип краски
		текстр.типкраски = ЦеноваяГруппа; 
		//20181213 - Оля Артамонова и В. Ли просили сделать так
		//текстр.Название = ЗначениеРеквизита(текстр.ТипКраски, "Наименование");
		Если Объект.Площадка = ГлЛико_Площадки.ИксПак Тогда
			текстр.Название = ЗначениеРеквизита(текстр.Номенклатура, "Артикул");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеФорм", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.Лико_Формы"));
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор форм'"));
	Массив= Новый Массив;
	НайденныеСтроки = Объект.Формы.НайтиСтроки(Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки));
	Для каждого стр из НайденныеСтроки Цикл
		Массив.Добавить(стр.Значение);
	КонецЦикла;	
	ПараметрыФормы.Вставить("Значения", Массив);
	ОткрытьФорму("ОбщаяФорма.РедактированиеСпискаЗначений", ПараметрыФормы , , , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ЦветаВалПриИзменении(Элемент)
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаГрамматураНаРЦПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(стр.ГрамматураНаРЦ) Тогда 
		стр.Грамматура = ЗначениеРеквизита(стр.ГрамматураНаРЦ, "Грамматура");		
	Иначе 
		стр.Грамматура = 0;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте 
//не нужна, если видпечати удален
Процедура ЦветаВидПечатиПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные; 
	ВидПечати = ЗначениеРеквизита(стр.ВидСекции, "ВидПечати"); 

	Если ВидПечати =  ПредопределенноеЗначение("Справочник.Лико_ВидыПечати.Глубокая") Тогда
		Элементы.ЦветаГрамматура.Доступность = Ложь;
	Иначе
		Элементы.ЦветаГрамматура.Доступность = Истина;		
	КонецЕсли;
	
	//Лико Субботин СЮВ 22.10.2021 
	реквизитыТЧ = ПолучитьМассивРеквизитовТЧ();
	//очистка строки
	для Каждого текРек из реквизитыТЧ цикл
		
		Если текРек = "ВидПечати" ИЛИ  текРек = "ВидСекции" ИЛИ  текРек = "ТипЦвета1"  ИЛИ  текРек = "Название" ИЛИ  текРек = "КлючСтроки" ИЛИ  текРек = "НомерПроката" ИЛИ  текРек = "НомерВарианта" Тогда 
			Продолжить;
		Иначе
			стр[текРек] = неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаМатериалПриИзменении(Элемент) 
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
 	ТекСтр.КодМатериала = ЗначениеРеквизита(ТекСтр.Материал,"Код"); 
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак И Текстр.КонтактныйСлой И ЗначениеЗаполнено(Текстр.Материал) Тогда
		ЗаполненВидКонтакта = ПроверитьЗаполнениеВидаКонтактаВОсновномМатериале(Текстр.Материал);
		Если Не ЗаполненВидКонтакта Тогда
			Текстр.КонтактныйСлой = Ложь;
		КонецЕсли;
	КонецЕсли;
	Для каждого стр Из Объект.Товары Цикл
		
		стр.ДиаметрРоликаФакт = 0;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти   

#Область СлужебныеПроцедурыИФункцииЦвета  


&НаСервереБезКонтекста 
Функция ПолучитьВидЗаливкиПоУмолчанию(ВидСекции, ВидТМЦ) 
	
	
	СтрокаЗаливки = ВидСекции.ВидыЗаливки.найтиСтроки(новый структура("ВидТМЦ", ВидТМЦ));	
	Если СтрокаЗаливки.Количество() <> 0 Тогда 
		Возврат СтрокаЗаливки[0].ВидЗаливки 
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ДобавитьЦМИК(Команда)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда
		
		ТекСтр.ТипЦвета1 = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.C"); 
		ТекСтр.ТипЗаливка = ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.C");
		ВидСекции = ТекСтр.ВидСекции;
		НомерПроката = ТекСтр.НомерПроката;
		ВидПечати = ТекСтр.ВидПечати;
		ВидТМЦ = ТекСтр.ВидТМЦ; 
		ТекСтрРабочийЦентр = ТекСтр.РабочийЦентр;
		
		
		МассивЦМИК = новый Массив;
		МассивЦМИК.Добавить(ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.M")); 
		МассивЦМИК.Добавить(ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.Y"));
		МассивЦМИК.Добавить(ПредопределенноеЗначение("Справочник.Лико_ТипыЦвета.K"));
		
		
		Для сч = 0 По МассивЦМИК.ВГраница() Цикл
			
			Нстр = Объект.Цвета.Добавить();
			Нстр.НомерВарианта = 1;
			Нстр.НомерПроката = НомерПроката;
			КлючСтроки = Новый УникальныйИдентификатор;
			Нстр.КлючСтроки = КлючСтроки;
			Нстр.ВидСекции = ВидСекции;
			Нстр.ВидПечати = ВидПечати;
			Нстр.ВидТМЦ     = ВидТМЦ;
			Нстр.РабочийЦентр = ТекСтрРабочийЦентр;
			Нстр.ВидОснастка = ВидТМЦ;

			Нстр.ТипЦвета1 = МассивЦМИК[сч];
			Нстр.ТипЗаливка = МассивЦМИК[сч]; 
			
			
		КонецЦикла;
		ДобавитьУсловноеОформлениеЦветаРабочийЦентр();
	Иначе
		Сообщить("Укажите первую строку и заполните в ней Вид работ!");
	КонецЕсли;
	


КонецПроцедуры

&НаСервереБезКонтекста 
Функция ЭтоЦМИК(ТипЦвета) 
	
	ЭтоЦМИК = ТипЦвета = Справочники.Лико_ТипыЦвета.C 
		ИЛИ ТипЦвета = Справочники.Лико_ТипыЦвета.M 
		ИЛИ ТипЦвета = Справочники.Лико_ТипыЦвета.Y 
		ИЛИ ТипЦвета = Справочники.Лико_ТипыЦвета.K;
	
	Возврат ЭтоЦМИК 	
	
КонецФункции 

&НаСервереБезКонтекста 
Функция ПолучитьЦГПоКоду(КодЦГ) 
	
	ЦГСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеновыеГруппы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
		|ГДЕ
		|	ЦеновыеГруппы.Код = &КодЦГ
		|	И НЕ ЦеновыеГруппы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КодЦГ", КодЦГ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЦГСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ЦГСсылка 	
	
КонецФункции 
 
Функция ПолучитьГрамматуруВала(Номенклатура)
	
	Грамматура = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПараметрыШтампа.ГрамматураВала КАК ГрамматураВала,
	|	Лико_ПараметрыШтампа.ПроцентЗаливки КАК ПроцентЗаливки
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|ГДЕ
	|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура"; 
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		Если ЗначениеЗаполнено(Результат.ГрамматураВала) Тогда
			Если Объект.Площадка = Справочники.Лико_Площадки.ИксПак Тогда 
				Грамматура =  Результат.ГрамматураВала ;
			Иначе
				Грамматура = Результат.ГрамматураВала * 0.5;
			КонецЕсли;
			ПроцентЗаливки = Результат.ПроцентЗаливки;
		КонецЕсли;
	КонецЕсли;
	ПараметрыВала = Новый Структура("Грамматура,ПроцентЗаливки", Грамматура, ПроцентЗаливки);  
	
	Возврат ПараметрыВала
	
КонецФункции

&НаКлиенте
Процедура ДопускМинусПриИзменении(Элемент)
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДопускПлюсПриИзменении(Элемент)
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗначениеПереключателяГруппыПроизводствоПриИзменении(Элемент = Неопределено)
	Элементы.Производство.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерПроката", ЗначениеПереключателяГруппыПроизводство);
	
	Элементы.ГруппаЭлементовПеремотка.Видимость = ЗначениеПереключателяГруппыПроизводство = 90;
	Элементы.ГруппаЭлементовФормщики.Видимость = ЗначениеПереключателяГруппыПроизводство = 91;
	Элементы.ГруппаЭлементовПроизводствоПрокаты.Видимость = НЕ Элементы.ГруппаЭлементовПеремотка.Видимость И НЕ Элементы.ГруппаЭлементовФормщики.Видимость; 
	Элементы.ГруппаПроизводствоВыпуски.Видимость = ЗначениеПереключателяГруппыПроизводство = 1;
	
	Если ЗначениеПереключателяГруппыПроизводство = 90 Тогда
		СтрокиПервыйПрокат = Объект.Производство.НайтиСтроки(Новый Структура("НомерПроката", 1));
		ВсегоЗасчитано = 0;
		Для каждого Строка из СтрокиПервыйПрокат Цикл
			ВсегоЗасчитано = ВсегоЗасчитано + Строка.ПогМетровЗасчитано;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьТаблицуПроизводство(ТЧ)

	ТЧ.Сортировать("НомерПроката,НомерБланка,Дата,Сотрудник");
	ПредыдущийНомерПроката = Неопределено;
	Для каждого Строка из ТЧ Цикл
		Если ПредыдущийНомерПроката = Неопределено ИЛИ ПредыдущийНомерПроката <> Строка.НомерПроката Тогда
			ПредыдущийНомерПроката = Строка.НомерПроката;
			СчВПределахПроката = 1;
		КонецЕсли;
		Строка.НомерСтрокиВПределахПроката = СчВПределахПроката;
		СчВПределахПроката = СчВПределахПроката + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.НомерПроката = ЗначениеПереключателяГруппыПроизводство;
		Элемент.ТекущиеДанные.НомерСтрокиВПределахПроката = Объект.Производство.НайтиСтроки(Новый Структура("НомерПроката", ЗначениеПереключателяГруппыПроизводство)).Количество();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоПослеУдаления(Элемент)
	ОбработатьТаблицуПроизводство(Объект.Производство);
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗатратыПроизводстваНаСервере(ТолькоНовые)
	
	// --> Начало Лико Ефимов ЕВВ 27.02.2025 перенес в модуль объекта, смотри конец функции
	
	//Если НЕ ЗначениеЗаполнено(ЗначениеПереключателяГруппыПроизводство) ИЛИ ЗначениеПереключателяГруппыПроизводство > 10 Тогда
	//	Сообщить("Выберите номер проката от 1 до 10 в переключателе");
	//	Возврат;
	//КонецЕсли; 

	//Если НЕ ТолькоНовые Тогда
	//	// Перед заполнением очистим уже заполненные затраты по текущему прокату
	//	НайденныеСтроки = Объект.Производство.НайтиСтроки(Новый Структура("НомерПроката", ЗначениеПереключателяГруппыПроизводство));
	//	Для каждого Строка из НайденныеСтроки Цикл
	//		Объект.Производство.Удалить(Строка);
	//	КонецЦикла;
	//КонецЕсли;

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	//|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка КАК Нарезка,
	//|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник КАК Сотрудник,
	//|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник2 КАК Сотрудник2,
	//|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка КАК НомерБланка,
	//|	Лико_БланкЭтапаТовары.Ссылка.НомерПриложения КАК НомерПриложения,
	//|	НАЧАЛОПЕРИОДА(Лико_БланкЭтапаТовары.Ссылка.Дата, ДЕНЬ) КАК ДатаРасхода,
	//|	СУММА(ВЫБОР
	//|			КОГДА Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка <> ЗНАЧЕНИЕ(Документ.Лико_БланкЭтапа.ПустаяСсылка)
	//|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя = Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	//|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.НомерПроката = Лико_БланкЭтапаТовары.Ссылка.НомерПроката
	//|				ТОГДА 0
	//|			ИНАЧЕ Лико_БланкЭтапаТовары.КоличествоРасходУУ
	//|		КОНЕЦ) КАК Количество,
	//|	СУММА(ВЫБОР
	//|			КОГДА Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка <> ЗНАЧЕНИЕ(Документ.Лико_БланкЭтапа.ПустаяСсылка)
	//|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.ЗаказПокупателя = Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	//|					И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка.НомерПроката = Лико_БланкЭтапаТовары.Ссылка.НомерПроката
	//|				ТОГДА 0
	//|			ИНАЧЕ Лико_БланкЭтапаТовары.КоличествоРасход
	//|		КОНЕЦ) КАК КоличествоПМ,
	//|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр КАК РабочийЦентр,
	//|	Лико_БланкЭтапаТовары.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	//|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката КАК НомерПроката,
	//|	Лико_БланкЭтапаТовары.Ссылка КАК Бланк,
	//|	ВЫБОР
	//|		КОГДА Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	//|		ИНАЧЕ Лико_БланкЭтапаТовары.ВидСекции
	//|	КОНЕЦ КАК ВидРабот,
	//|	ВЫБОР
	//|		КОГДА Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	//|				И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала В (ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.БесплатныйНастроечный), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПлатныйНастроечный))
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК НастроечныйМатериал
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	//|ГДЕ
	//|	Лико_БланкЭтапаТовары.Списать
	//|	И Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя = &Заказ
	//|	И (Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	//|			ИЛИ Лико_БланкЭтапаТовары.Номенклатура.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.CLICKS))
	//|	И Лико_БланкЭтапаТовары.Ссылка.Проведен
	//|	И Лико_БланкЭтапаТовары.Ссылка.НомерПроката = &НомерПроката
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Лико_БланкЭтапаТовары.Номенклатура,
	//|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка,
	//|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник,
	//|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник2,
	//|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка,
	//|	Лико_БланкЭтапаТовары.Ссылка.НомерПриложения,
	//|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр,
	//|	Лико_БланкЭтапаТовары.Номенклатура.ЦеноваяГруппа,
	//|	Лико_БланкЭтапаТовары.Ссылка.НомерПроката,
	//|	Лико_БланкЭтапаТовары.Ссылка,
	//|	НАЧАЛОПЕРИОДА(Лико_БланкЭтапаТовары.Ссылка.Дата, ДЕНЬ),
	//|	ВЫБОР
	//|		КОГДА Лико_БланкЭтапаТовары.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	//|				И Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала В (ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.БесплатныйНастроечный), ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.ПлатныйНастроечный))
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА Лико_БланкЭтапаТовары.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать)
	//|		ИНАЧЕ Лико_БланкЭтапаТовары.ВидСекции
	//|	КОНЕЦ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ВТ.Нарезка) КАК Нарезка,
	//|	ВТ.Сотрудник КАК Сотрудник,
	//|	ВТ.Сотрудник2 КАК Сотрудник2,
	//|	ВТ.НомерБланка КАК НомерБланка,
	//|	ВТ.НомерПриложения КАК НомерПриложения,
	//|	МИНИМУМ(ВТ.ДатаРасхода) КАК ДатаРасхода,
	//|	СУММА(ВТ.Количество) КАК Количество,
	//|	СУММА(ВТ.КоличествоПМ) КАК КоличествоПМ,
	//|	ВТ.РабочийЦентр КАК РабочийЦентр,
	//|	ВТ.НомерПроката КАК НомерПроката,
	//|	ВТ.ВидРабот КАК ВидРабот
	//|ПОМЕСТИТЬ ВТРасход
	//|ИЗ
	//|	ВТ КАК ВТ
	//|ГДЕ
	//|	ВТ.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	//|	И ВТ.РабочийЦентр.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Прочее)
	//|	И ВТ.РабочийЦентр.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Перемотка)
	//|	И НЕ ВТ.НастроечныйМатериал
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ.Сотрудник,
	//|	ВТ.Сотрудник2,
	//|	ВТ.НомерБланка,
	//|	ВТ.НомерПриложения,
	//|	ВТ.РабочийЦентр,
	//|	ВТ.НомерПроката,
	//|	ВТ.ВидРабот
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ВТ.Нарезка),
	//|	ВТ.Сотрудник,
	//|	МАКСИМУМ(ВТ.Сотрудник2),
	//|	ВТ.НомерБланка,
	//|	ВТ.НомерПриложения,
	//|	ВТ.ДатаРасхода,
	//|	0,
	//|	0,
	//|	ВТ.РабочийЦентр,
	//|	ВТ.НомерПроката,
	//|	ВТ.ВидРабот
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ1
	//|		ПО ВТ.Сотрудник = ВТ1.Сотрудник
	//|			И ВТ.НомерБланка = ВТ1.НомерБланка
	//|			И ВТ.НомерПроката = ВТ1.НомерПроката
	//|			И ВТ.НомерПриложения = ВТ1.НомерПриложения
	//|			И ВТ.ДатаРасхода = ВТ1.ДатаРасхода
	//|			И ВТ.РабочийЦентр = ВТ1.РабочийЦентр
	//|			И (НЕ ВТ1.НастроечныйМатериал)
	//|ГДЕ
	//|	ВТ.НастроечныйМатериал
	//|	И ВТ1.Сотрудник ЕСТЬ NULL
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ.Сотрудник,
	//|	ВТ.НомерБланка,
	//|	ВТ.НомерПриложения,
	//|	ВТ.ДатаРасхода,
	//|	ВТ.РабочийЦентр,
	//|	ВТ.НомерПроката,
	//|	ВТ.ВидРабот
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТРасход.Нарезка КАК Нарезка,
	//|	ВТРасход.Сотрудник КАК Сотрудник,
	//|	ВТРасход.Сотрудник2 КАК Сотрудник2,
	//|	ВТРасход.НомерБланка КАК НомерБланка,
	//|	ВТРасход.НомерПриложения КАК НомерПриложения,
	//|	МИНИМУМ(ВТРасход.ДатаРасхода) КАК ДатаРасхода,
	//|	СУММА(ВТРасход.Количество) КАК Количество,
	//|	СУММА(ВТРасход.КоличествоПМ) КАК КоличествоПМ,
	//|	ВТРасход.РабочийЦентр КАК РабочийЦентр,
	//|	ВТРасход.НомерПроката КАК НомерПроката,
	//|	ВТРасход.ВидРабот КАК ВидРабот
	//|ПОМЕСТИТЬ ВТРасходСгруппирован
	//|ИЗ
	//|	ВТРасход КАК ВТРасход
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТРасход.Нарезка,
	//|	ВТРасход.Сотрудник,
	//|	ВТРасход.Сотрудник2,
	//|	ВТРасход.НомерБланка,
	//|	ВТРасход.НомерПриложения,
	//|	ВТРасход.РабочийЦентр,
	//|	ВТРасход.НомерПроката,
	//|	ВТРасход.ВидРабот
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МИНИМУМ(НАЧАЛОПЕРИОДА(Лико_БланкЭтапаВыпуск.Ссылка.Дата, ДЕНЬ)) КАК ДатаПроизводства,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр КАК РабочийЦентр,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.Сотрудник КАК Сотрудник,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката КАК НомерПроката,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.НомерБланка КАК НомерБланка,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПриложения КАК НомерПриложения,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА Лико_БланкЭтапаВыпуск.Ссылка.МестоВалидации = ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.Печать)
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ ЛОЖЬ
	//|		КОНЕЦ) КАК Валидация,
	//|	СУММА(Лико_БланкЭтапаВыпуск.Количество) КАК КоличествоПМ,
	//|	СУММА(Лико_БланкЭтапаВыпуск.КоличествоУУ) КАК Количество,
	//|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	//|				КОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ЕдиницаИзмеренияЗаказа = ТысШт.ЗначениеПараметра
	//|					ТОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ШтКВМ * Лико_БланкЭтапаВыпуск.КоличествоУУ / 1000
	//|				КОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ЕдиницаИзмеренияЗаказа = ПМ.ЗначениеПараметра
	//|					ТОГДА Лико_БланкЭтапаВыпуск.Количество
	//|				КОГДА Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя.ЕдиницаИзмеренияЗаказа = КВМ.ЗначениеПараметра
	//|					ТОГДА Лико_БланкЭтапаВыпуск.КоличествоУУ
	//|			КОНЕЦ КАК ЧИСЛО(15, 4))) КАК КоличествоВыпуск
	//|ПОМЕСТИТЬ ВТВыпуск
	//|ИЗ
	//|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	//|		ПО Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя = Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя
	//|			И Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката = Лико_БланкЭтапаТовары.Ссылка.НомерПроката
	//|			И Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр = Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр
	//|			И Лико_БланкЭтапаВыпуск.Серия.ЯССМ_ОбъектНоменклатуры = Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры,
	//|	Справочник.Лико_ПредопределенныеЗначения КАК ТысШт,
	//|	Справочник.Лико_ПредопределенныеЗначения КАК ПМ,
	//|	Справочник.Лико_ПредопределенныеЗначения КАК КВМ
	//|ГДЕ
	//|	Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя = &Заказ
	//|	И Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката = &НомерПроката
	//|	И ТысШт.ИмяПредопределенныхДанных = ""ЕИТысШт""
	//|	И ПМ.ИмяПредопределенныхДанных = ""ЕИПогМетр""
	//|	И КВМ.ИмяПредопределенныхДанных = ""ЕИКвадрМетр""
	//|	И Лико_БланкЭтапаТовары.Ссылка ЕСТЬ NULL
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Лико_БланкЭтапаВыпуск.Ссылка.РабочийЦентр,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.Сотрудник,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.НомерБланка,
	//|	Лико_БланкЭтапаВыпуск.Ссылка.НомерПриложения
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТЗ_Учтено.Сотрудник КАК Сотрудник,
	//|	ТЗ_Учтено.РабочийЦентр КАК РабочийЦентр,
	//|	ТЗ_Учтено.НомерБланка КАК НомерБланка,
	//|	ТЗ_Учтено.НомерПроката КАК НомерПроката,
	//|	ТЗ_Учтено.Дата КАК Дата
	//|ПОМЕСТИТЬ ВТУчтено
	//|ИЗ
	//|	&ТЗ_Учтено КАК ТЗ_Учтено
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.Сотрудник КАК Сотрудник,
	//|	ВТ.НомерПроката КАК НомерПроката,
	//|	ВТ.НомерБланка КАК НомерБланка,
	//|	ВТ.НомерПриложения КАК НомерПриложения,
	//|	СУММА(ВТ.Количество) КАК КоличествоКликов,
	//|	ВТ.РабочийЦентр КАК РабочийЦентр
	//|ПОМЕСТИТЬ ВТКликов
	//|ИЗ
	//|	ВТ КАК ВТ
	//|ГДЕ
	//|	ВТ.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.CLICKS)
	//|	И ВТ.НомерПроката = &НомерПроката
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ.Сотрудник,
	//|	ВТ.НомерПроката,
	//|	ВТ.НомерБланка,
	//|	ВТ.НомерПриложения,
	//|	ВТ.РабочийЦентр
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТРасходСгруппирован.ДатаРасхода КАК Дата,
	//|	ВТРасходСгруппирован.Сотрудник КАК Сотрудник,
	//|	МАКСИМУМ(ВТРасходСгруппирован.Сотрудник2) КАК Сотрудник2,
	//|	ВТРасходСгруппирован.РабочийЦентр КАК РабочийЦентр,
	//|	ВТРасходСгруппирован.НомерБланка КАК НомерБланка,
	//|	ВТРасходСгруппирован.НомерПриложения КАК НомерПриложения,
	//|	МАКСИМУМ(ВТРасходСгруппирован.Нарезка) КАК Нарезка,
	//|	СУММА(ВТРасходСгруппирован.Количество) КАК Количество,
	//|	СУММА(ВТРасходСгруппирован.КоличествоПМ) КАК КоличествоПМ,
	//|	СУММА(ВТВыпуск.КоличествоПМ) КАК КоличествоВыпускПМ,
	//|	СУММА(ВТВыпуск.Количество) КАК КоличествоВыпускКВМ,
	//|	СУММА(ВТКликов.КоличествоКликов) КАК КоличествоКликов,
	//|	ВТРасходСгруппирован.НомерПроката КАК НомерПроката,
	//|	СУММА(ВТВыпуск.КоличествоВыпуск) КАК ЭтикетокНапечатано,
	//|	МАКСИМУМ(ВТВыпуск.Валидация) КАК Валидация
	//|ИЗ
	//|	ВТРасходСгруппирован КАК ВТРасходСгруппирован
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыпуск КАК ВТВыпуск
	//|		ПО ВТРасходСгруппирован.Сотрудник = ВТВыпуск.Сотрудник
	//|			И ВТРасходСгруппирован.РабочийЦентр = ВТВыпуск.РабочийЦентр
	//|			И ВТРасходСгруппирован.НомерПроката = ВТВыпуск.НомерПроката
	//|			И ВТРасходСгруппирован.НомерБланка = ВТВыпуск.НомерБланка
	//|			И ВТРасходСгруппирован.НомерПриложения = ВТВыпуск.НомерПриложения
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчтено КАК ВТУчтено
	//|		ПО ВТРасходСгруппирован.Сотрудник = ВТУчтено.Сотрудник
	//|			И ВТРасходСгруппирован.РабочийЦентр = ВТУчтено.РабочийЦентр
	//|			И ВТРасходСгруппирован.НомерПроката = ВТУчтено.НомерПроката
	//|			И ВТРасходСгруппирован.НомерБланка = ВТУчтено.НомерБланка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКликов КАК ВТКликов
	//|		ПО ВТРасходСгруппирован.Сотрудник = ВТКликов.Сотрудник
	//|			И ВТРасходСгруппирован.НомерПроката = ВТКликов.НомерПроката
	//|			И ВТРасходСгруппирован.НомерБланка = ВТКликов.НомерБланка
	//|			И ВТРасходСгруппирован.НомерПриложения = ВТКликов.НомерПриложения
	//|			И ВТРасходСгруппирован.РабочийЦентр = ВТКликов.РабочийЦентр
	//|ГДЕ
	//|	ВТУчтено.Сотрудник ЕСТЬ NULL
	//|	И (ВТРасходСгруппирован.ВидРабот = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ПустаяСсылка)
	//|			ИЛИ ВТРасходСгруппирован.ВидРабот = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Печать))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТРасходСгруппирован.ДатаРасхода,
	//|	ВТРасходСгруппирован.Сотрудник,
	//|	ВТРасходСгруппирован.РабочийЦентр,
	//|	ВТРасходСгруппирован.НомерБланка,
	//|	ВТРасходСгруппирован.НомерПриложения,
	//|	ВТРасходСгруппирован.НомерПроката
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерПроката,
	//|	НомерБланка,
	//|	НомерПриложения,
	//|	Дата,
	//|	ВТРасходСгруппирован.Сотрудник.Наименование";
	//Запрос.УстановитьПараметр("Заказ", Объект.ссылка);
	//Запрос.УстановитьПараметр("НомерПроката", ЗначениеПереключателяГруппыПроизводство);
	//Запрос.УстановитьПараметр("ТЗ_Учтено", Объект.Производство.Выгрузить(Новый Структура("НомерПроката", ЗначениеПереключателяГруппыПроизводство)));

	//// Нужно заполнять засчитанные этикетки в том случае, если сейчас заполняют последний прокат.
	//// Чтобы определить, последний ли это прокат, поищем НомерПроката+1 в цветах и работах. Если найдем, значит прокат не последний
	//НужноЗаполнятьЗасчитанныеЭтикетки = Ложь;
	//НайденныеСтрокиПоТекущемуПрокату = Объект.Цвета.НайтиСтроки(Новый Структура("НомерПроката", ЗначениеПереключателяГруппыПроизводство));
	//ТекРЦ = Неопределено;
	//Для каждого ТекСтрокаЦвета из НайденныеСтрокиПоТекущемуПрокату Цикл
	//	Если ЗначениеЗаполнено(ТекСтрокаЦвета.РабочийЦентр) Тогда
	//		ТекРЦ = ТекСтрокаЦвета.РабочийЦентр;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Если ЗначениеЗаполнено(ТекРЦ) И ТекРЦ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Comexi Тогда
	//	// Суп задача № 4324
	//	// Для комекси считаем по выпуску самой комекси 
	//	НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
	//	СоответствиеБланковИЗасчЭт = СформироватьСоответствиеЗасчитанныхЭтикетокПоВыпускуТекущегоПроката(ЗначениеПереключателяГруппыПроизводство);
	//Иначе
	//	ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК.ЗначениеПараметра;
	//	Если ЗначениеЗаполнено(ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК) И ТекущаяДата() >= ДатаНачалаЗаполненияЗасчитанныхЭтикетокПоДаннымВК Тогда
	//		СтруктураПоиска = Новый Структура("НомерПроката", ЗначениеПереключателяГруппыПроизводство+1);
	//		Если Объект.Цвета.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
	//			НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если НужноЗаполнятьЗасчитанныеЭтикетки Тогда
	//		СоответствиеБланковИЗасчЭт = Лико_Дополнительно.ПолучитьКоличествоЗасчитанныхЭтикетокПоЗаказу(Объект.Ссылка);
	//	Иначе
	//		// Суп задача № 3378
	//		// Это не последний прокат, поэтому засчитанные этикетки будем искать в зависимости от типа заказа
	//		Если Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка ИЛИ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Упаковка Тогда
	//			// Тоже по ВК
	//			НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
	//			СоответствиеБланковИЗасчЭт = Лико_Дополнительно.ПолучитьКоличествоЗасчитанныхЭтикетокПоЗаказу(Объект.Ссылка);
	//		ИначеЕсли Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка
	//			ИЛИ Объект.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка Тогда
	//			НужноЗаполнятьЗасчитанныеЭтикетки = Истина;
	//			СоответствиеБланковИЗасчЭт = СформироватьСоответствиеЗасчитанныхЭтикетокПоПотреблениюСледующегоПроката(ЗначениеПереключателяГруппыПроизводство);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;

	//БылаНастройка = Ложь;
	//Если ТолькоНовые Тогда
	//	Для каждого Строка из Запрос.Параметры.ТЗ_Учтено Цикл
	//		Если Строка.КоличествоНастроек <> 0 Тогда
	//			БылаНастройка = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;

	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	стрпп = Объект.Производство.Добавить();
	//	Если Выборка.НомерПроката = 1 Тогда 
	//		Если ЗначениеЗаполнено(Выборка.количествоКликов) Тогда 
	//			стрпп.ВсегоКликов = Выборка.КоличествоКликов;
	//		КонецЕсли;
	//		стрпп.Сотрудник2 = Выборка.Сотрудник2;
	//	КонецЕсли;       
	//	заполнитьЗначенияСвойств(стрпп, Выборка,, "Сотрудник2");
	//	Если НЕ БылаНастройка Тогда
	//		Стрпп.КоличествоНастроек = 1;
	//		БылаНастройка = Истина;
	//	КонецЕсли;
	//	стрпп.КлючСтроки =  Новый УникальныйИдентификатор;
	//	стрпп.НарезкаРазмер = ?(стрпп.КоличествоПМ = 0, 0, стрпп.Количество / стрпп.КоличествоПМ) * 1000;
	//	Если стрпп.НарезкаРазмер = 0 Тогда
	//		стрпп.НарезкаРазмер = Выборка.Нарезка.Размер;
	//	КонецЕсли;

	//	// --> Начало Лико Ефимов ЕВВ 07.07.2023
	//	Если НужноЗаполнятьЗасчитанныеЭтикетки Тогда
	//		ЗначениеСоответствияТекБланк = СоответствиеБланковИЗасчЭт.Получить(Выборка.НомерБланка);
	//		Если ЗначениеСоответствияТекБланк <> Неопределено Тогда
	//			Если ТипЗнч(ЗначениеСоответствияТекБланк) = Тип("Структура") И ЗначениеСоответствияТекБланк.ТипДанных = "ПогМетры" Тогда
	//				стрпп.ПогМетровЗасчитано = ЗначениеСоответствияТекБланк.Значение;
	//				Если стрпп.КоличествоПМ <> 0 И стрпп.Количество <> 0 Тогда
	//					стрпп.КвМетровЗасчитано = стрпп.ПогМетровЗасчитано * стрпп.НарезкаРазмер / 1000;
	//					стрпп.ЭтикетокЗасчитано = РассчитатьТиражНаСервере(стрпп.ПогМетровЗасчитано);
	//				КонецЕсли;
	//			ИначеЕсли ТипЗнч(ЗначениеСоответствияТекБланк) = Тип("Соответствие") Тогда 
	//				Если Выборка.НомерПриложения = 0 Тогда
	//					// Нужно просуммировать ??? ИЛИ НЕ НУЖНО ЭТО? пока решил оставить
	//					стрпп.ЭтикетокЗасчитано = 0;
	//					Для каждого ЭлементСоответствияТекПриложение из ЗначениеСоответствияТекБланк Цикл
	//						стрпп.ЭтикетокЗасчитано = стрпп.ЭтикетокЗасчитано + ЭлементСоответствияТекПриложение.Значение;
	//					КонецЦикла;
	//				Иначе
	//					// Нужно найти свое приложение
	//					ЗначениеСоответствияТекПриложение = ЗначениеСоответствияТекБланк.Получить(Выборка.НомерПриложения);
	//					Если ЗначениеСоответствияТекПриложение <> Неопределено Тогда
	//						стрпп.ЭтикетокЗасчитано = ЗначениеСоответствияТекПриложение;
	//						ЗначениеСоответствияТекБланк.Удалить(Выборка.НомерПриложения);
	//					КонецЕсли;
	//				КонецЕсли;
	//				Если стрпп.КоличествоПМ <> 0 И стрпп.Количество <> 0 И стрпп.ЭтикетокЗасчитано <> 0 Тогда
	//					стрпп.ПогМетровЗасчитано = РассчитатьМетражНаСервере(стрпп.ЭтикетокЗасчитано * 1000);
	//					стрпп.КвМетровЗасчитано = стрпп.ПогМетровЗасчитано * стрпп.НарезкаРазмер / 1000; 
	//				КонецЕсли;
	//			Иначе
	//				стрпп.ЭтикетокЗасчитано = ЗначениеСоответствияТекБланк;
	//				Если стрпп.КоличествоПМ <> 0 И стрпп.Количество <> 0 И стрпп.ЭтикетокЗасчитано <> 0 Тогда
	//					стрпп.ПогМетровЗасчитано = РассчитатьМетражНаСервере(стрпп.ЭтикетокЗасчитано * 1000);
	//					стрпп.КвМетровЗасчитано = стрпп.ПогМетровЗасчитано * стрпп.НарезкаРазмер / 1000; 
	//				КонецЕсли;
	//			КонецЕсли;
	//			Если Выборка.НомерПриложения = 0 Тогда // Если номер приложения не равен 0, то строки уже удалились выше по номеру приложения
	//				// Удалим из соответствия, чтобы данные не попали в другие строки по этому же номеру бланка
	//				СоответствиеБланковИЗасчЭт.Удалить(Выборка.НомерБланка);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	// <-- Конец Лико Ефимов ЕВВ 07.07.2023
	//КонецЦикла;

	Если НЕ ЗначениеЗаполнено(ЗначениеПереключателяГруппыПроизводство) ИЛИ ЗначениеПереключателяГруппыПроизводство > 10 Тогда
		Сообщить("Выберите номер проката от 1 до 10 в переключателе");
		Возврат;
	КонецЕсли; 

    РеквизитОбъект = РеквизитФормыВЗначение("Объект"); 
	РеквизитОбъект.ЗаполнитьЗатратыПроизводства(ТолькоНовые, ЗначениеПереключателяГруппыПроизводство);
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	ЗаполнитьСвязанныеДанныеНаСервере();
	
	ОбработатьТаблицуПроизводство(Объект.Производство);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗатратыПроизводства(Команда)
	ЗаполнитьЗатратыПроизводстваНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗатратыПроизводстваНовые(Команда)
	ЗаполнитьЗатратыПроизводстваНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоЭтикетокЗасчитаноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Производство.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ПогМетровЗасчитано = 0;
		ТекущиеДанные.КвМетровЗасчитано = 0;
		Если ТекущиеДанные.КоличествоПМ <> 0 И ТекущиеДанные.Количество <> 0 И ТекущиеДанные.ЭтикетокЗасчитано <> 0 Тогда
			ТекущиеДанные.ПогМетровЗасчитано = РассчитатьМетражНаСервере(ТекущиеДанные.ЭтикетокЗасчитано * 1000,, ТекущиеДанные.РабочийЦентр);
			ТекущиеДанные.КвМетровЗасчитано = ТекущиеДанные.ПогМетровЗасчитано * ТекущиеДанные.НарезкаРазмер / 1000; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоПогМетровЗасчитаноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Производство.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ЭтикетокЗасчитано = 0;
		ТекущиеДанные.КвМетровЗасчитано = 0;
		Если ТекущиеДанные.КоличествоПМ <> 0 И ТекущиеДанные.Количество <> 0 Тогда
			ТекущиеДанные.КвМетровЗасчитано = ТекущиеДанные.ПогМетровЗасчитано * ТекущиеДанные.НарезкаРазмер / 1000;
			ТекущиеДанные.ЭтикетокЗасчитано = РассчитатьТиражНаСервере(ТекущиеДанные.ПогМетровЗасчитано,, ТекущиеДанные.РабочийЦентр);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоКвМетровЗасчитаноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Производство.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ЭтикетокЗасчитано = 0;
		ТекущиеДанные.ПогМетровЗасчитано = 0;
		Если ТекущиеДанные.КоличествоПМ <> 0 И ТекущиеДанные.Количество <> 0 Тогда
			ТекущиеДанные.ПогМетровЗасчитано = ТекущиеДанные.КвМетровЗасчитано / ТекущиеДанные.НарезкаРазмер * 1000;
			ТекущиеДанные.ЭтикетокЗасчитано = РассчитатьТиражНаСервере(ТекущиеДанные.ПогМетровЗасчитано,, ТекущиеДанные.РабочийЦентр);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоПриАктивизацииСтроки(Элемент)
	УстановитьПараметрыДинамическогоСпискаПроизводствоДетальныеЗаписи(Элементы.Производство.ТекущаяСтрока);		
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСпискаПроизводствоДетальныеЗаписи(ТекущаяСтрока = Неопределено)

	Если ТекущаяСтрока = Неопределено Тогда
		ТекущийДанные = Неопределено;
	Иначе
		ТекущиеДанные = Объект.Производство.НайтиПоИдентификатору(ТекущаяСтрока);
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("НомерПроката", Неопределено);
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("НомерБланка", Неопределено);
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("Сотрудник", Неопределено);
	Иначе
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("НомерПроката", ТекущиеДанные.НомерПроката);
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("НомерБланка", ТекущиеДанные.НомерБланка);
		ПроизводствоДетальныеЗаписи.Параметры.УстановитьЗначениеПараметра("Сотрудник", ?(ЗначениеЗаполнено(ТекущиеДанные.СотрудникПоБланку), ТекущиеДанные.СотрудникПоБланку, ТекущиеДанные.Сотрудник));
	КонецЕсли;
	Элементы.ПроизводствоДетальныеЗаписи.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоДетальныеЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПроизводствоДетальныеЗаписи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.ЗакрытиеБланка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаРабочийЦентрПриИзменении(Элемент)
	текстр = Элементы.Цвета.ТекущиеДанные;	
	Для каждого стр из Объект.Цвета Цикл
		Если стр.номерпроката =текстр.номерпроката и  стр.рабочийЦентр <> текстр.рабочийЦентр Тогда 
			стр.рабочийЦентр = текстр.рабочийЦентр;
		КонецЕсли;
		//Если Стр.РабочийЦентр.ВидРабочегоЦентра = ВидРЦIndigo Тогда  
		//	ЭтоЦифровой = Истина;	
		//КонецЕсли;
	КонецЦикла;
	
  
	ЗаписатьЦветаВРаботы();
	
	//Подсистема DFM
	Если текстр.НомерПроката = 1 Тогда 			
		Объект.РабочийЦентр = текстр.РабочийЦентр;			
		DFMКлиент.ЗаблокироватьНоменклатуру(ЭтаФорма,ДатаНачалаСозданияНоменклатурыDFM И Объект.Цвета.Количество()>0);
		Если ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
			ВидРЦ = ЗначениеРеквизита(Объект.РабочийЦентр,"ВидРабочегоЦентра"); 
		КонецЕсли;
	КонецЕсли;
	//Подсистема DFM
	
	// <-- Начало Лико Яцун С. В. 19.10.2023
	ДобавитьУсловноеОформлениеЦветаРабочийЦентр();
	// <-- Конец Лико Яцун С. В. 19.10.2023
КонецПроцедуры  

&НаКлиенте
Процедура ЦветаОснасткаПриИзменении(Элемент)  
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	ТекСтр.ВидОснастка = ТекСтр.Оснастка;
	ДобавитьУсловноеОформлениеЦветаВидОснастка();
	ЗаписатьЦветаВРаботы(); 
    ЗаполнениеПараметровОснастки();
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнениеПараметровОснастки()
	текстр = Элементы.Цвета.ТекущиеДанные;   
	Если ЗначениеЗаполнено(текстр.Оснастка) Тогда 
		//Если ЗначениеЗаполнено(Текстр.ВидРабот) Тогда 
		//	РезультатПроверки = ПоверитьСоответствиеОснасткиВидыРабот(текстр.Оснастка, Текстр.ВидРабот);
		//	Если Не РезультатПроверки Тогда 
		//		текстр.Оснастка =  ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		//Иначе		
		ЭтоТиснение = ЗначениеРеквизита(текстр.ВидСекции, "Тиснение");
		Если текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Вырубка") Тогда 
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииПараметровШтампа", ЭтаФорма, текстр.Оснастка);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить параметры основного вырубного штампа?'"), Режим,0);
		ИначеЕсли ЭтоТиснение ИЛИ текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Конгрев") Тогда	
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Оснастка", текстр.Оснастка);
			ДопПараметры.Вставить("Идентификатор", текстр.ПолучитьИдентификатор() );
			ЗаполнитьПараметрыШтампаТиснения(ДопПараметры);	
					
		КонецЕсли;

	Иначе
		ПроверитьВырубнойШтамп();
		РасчитатьТиражМетраж();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЦветаВРаботы()   
	Объект.ВидыРабот.Очистить();
	Для каждого стр Из объект.Цвета Цикл 
		ВидРабот =   ЗначениеРеквизита(стр.ВидСекции, "ВидРабот");
		Если стр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское")  Тогда 
			Если стр.направлениепротяжки = ПредопределенноеЗначение("Перечисление.Лико_НаправленияПротяжки.Поперечное") Тогда 
				ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное");
			Иначе
				ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное");
			КонецЕсли;
		КонецЕсли;
			
		Отбор = Новый Структура("ВидРабот", ВидРабот); 
		Отбор.Вставить("НомерПроката", стр.НомерПроката);  
		Отбор.Вставить( "НомерРаботы", стр.НомерРаботы);

		строкиРабот = Объект.ВидыРабот.НайтиСтроки(Отбор);
		Если строкиРабот.Количество() = 0 Тогда    
			стрработа = Объект.ВидыРабот.Добавить();
			ЗаполнитьЗначенияСвойств(стрработа, стр); 
			Если Не ВидРабот = ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Печать") Тогда 
				стрработа.Клей = стр.типкраски;  
			КонецЕсли;
			стрработа.видработ = видработ;
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор")  Тогда 
				стрработа.дополнительно = стр.количестворучьевнумератора;
			Иначе
				стрработа.дополнительно = стр.подача;    
			Конецесли;
			стрработа.подача = стр.подачафакт;	
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Инкджет") Тогда 
				стрработа.расходкраски = объект.расходкраски;       
			КонецЕсли;  
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда 
				стрработа.клей = ЗначениеРеквизита(объект.Праймер, "ЦеноваяГруппа");      
			КонецЕсли;  
		Иначе
			стрработа = строкиРабот[0];
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Инкджет") Тогда 
				стрработа.расходкраски = объект.расходкраски;       
			КонецЕсли; 
			Если стр.видсекции =  ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Цифровая") Тогда 
				стрработа.клей = ЗначениеРеквизита(объект.Праймер, "ЦеноваяГруппа");      
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	ПроставитьВидВырубки(Истина); 
	
	ИзмененитьДоступностиПолейНаСервере(Объект.ВидВырубки);

КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоКоличествоКоличествоПМПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Производство.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.НарезкаРазмер = ?(ТекущиеДанные.КоличествоПМ = 0, 0, ТекущиеДанные.Количество / ТекущиеДанные.КоличествоПМ) * 1000; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходКраскиПриИзменении(Элемент)
	// Отбор = Новый Структура("ВидРабот", ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Печать")); 
	//Отбор.Вставить("РабочийЦентр", РЦИнкджет());  
	//строкиРабот = Объект.ВидыРабот.НайтиСтроки(Отбор);
	//Если строкиРабот.Количество() > 0 Тогда  
	//	строкиработ[0].расходкраски = объект.РасходКраски;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПраймерПриИзменении(Элемент)
	//Отбор = Новый Структура("ВидРабот", ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Печать")); 
	//строкиРабот = Объект.ВидыРабот.НайтиСтроки(Отбор);  
	//Для каждого  стр из СтрокиРабот Цикл
	//	стр.клей = ЗначениеРеквизита(объект.Праймер, "ЦеноваяГруппа");
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаНомерПрокатаПриИзменении(Элемент)
	текстр = Элементы.Цвета.ТекущиеДанные;
	Для каждого стр из Объект.Цвета Цикл
		Если стр.номерпроката =текстр.номерпроката и  стр.рабочийЦентр <> текстр.рабочийЦентр Тогда 
			стр.рабочийЦентр = текстр.рабочийЦентр;
		КонецЕсли;
	КонецЦикла;
	
	//Для каждого стр из Объект.ВидыРабот Цикл
	//	Если стр.номерпроката =текстр.номерпроката и  стр.рабочийЦентр <> текстр.рабочийЦентр Тогда 
	//		стр.рабочийЦентр = текстр.рабочийЦентр;
	//	КонецЕсли;
	//КонецЦикла;   
	ЗаписатьЦветаВРаботы()  ;

КонецПроцедуры

&НаКлиенте
Процедура Нумератор(Команда)
	
	ПереместитьКолонкиДляНумератора();
				
КонецПроцедуры 

Процедура ПереместитьКолонкиДляНумератора()
	
	Если Элементы.Найти("ВыдвинутьКолонкиРабот") = Неопределено Тогда
		Элементы.Переместить(Элементы.ЦветаТипНумератора,  Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);   
		Элементы.Переместить(Элементы.ЦветаТипКода, 	   Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки); 
		Элементы.Переместить(Элементы.ЦветаТипКраскиКод,   Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);  
		Элементы.Переместить(Элементы.ЦветаТипКраски, 	   Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);   
		
		Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки); 
		Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета, Элементы.ЦветаНаправлениеПротяжки);
	Иначе
		Элементы.Переместить(Элементы.ЦветаТипНумератора,  Элементы.Цвета, Элементы.ЦветаВидОснастка);   
		Элементы.Переместить(Элементы.ЦветаТипКода, 	   Элементы.Цвета, Элементы.ЦветаВидОснастка); 
		Элементы.Переместить(Элементы.ЦветаТипКраскиКод,   Элементы.Цвета, Элементы.ЦветаВидОснастка);  
		Элементы.Переместить(Элементы.ЦветаТипКраски, 	   Элементы.Цвета, Элементы.ЦветаВидОснастка);   
		
		Элементы.Переместить(Элементы.ЦветаКоличествоРучьевНумератора, 	Элементы.Цвета, Элементы.ЦветаВидОснастка); 
		Элементы.Переместить(Элементы.ЦветаКоличествоКодовНаЛисте,		Элементы.Цвета, Элементы.ЦветаВидОснастка);
	КонецЕсли;
	
КонецПроцедуры 


&НаКлиенте
Процедура ЦветаТипНумератораПриИзменении(Элемент)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	ТекСтр.ТипКода = ПредопределенноеЗначение("Справочник.Лико_ТипыКодов.ПустаяСсылка");
	ТекСтр.КоличествоРучьевНумератора = 0;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипНумератораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;  
	Номенклатура = ПолучитьОсновныеЧернила(ВыбранноеЗначение) ;
	Если Номенклатура <> 0 Тогда
		ТекСтр.Номенклатура = Номенклатура;   
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипНумератораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(текстр.РабочийЦентр) Тогда 
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьТипыНумератора(текстр.РабочийЦентр))  ;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипКодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(текстр.ТипНумератора) Тогда 
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьТипыКодов(текстр.ТипНумератора))  ;   
	Иначе
		Сообщить("Необходимо сначала заполнить Тип нумератора в этой строке");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаКоличествоРучьевНумератораПриИзменении(Элемент)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;   
	
	Если не ЗначениеЗаполнено(ТекСтр.ВидСекции) и не ЗначениеЗаполнено(ТекСтр.РабочийЦентр) Тогда		
		Сообщить("Необходимо сперва заполнить Вид работ и Рабочий центр");
		ТекСтр.КоличествоРучьевНумератора = 0;
		Возврат		
	КонецЕсли;
	
	Если ТекСтр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор") Тогда
						
		Если  Не ЭтоЦифра(ТекСтр.РабочийЦентр)  Тогда  
			Если не ЗначениеЗаполнено(ТекСтр.ТипНумератора) Тогда  
	
				Сообщить( "Необходимо заполнить Тип нумератора");
				ТекСтр.КоличествоРучьевНумератора  = 0 ;

				Возврат
			КонецЕсли;

			МаксКолРучьев =  ПолучитьКоличествоРучьев(текстр.ТипНумератора, текстр.РабочийЦентр); 
			Если МаксКолРучьев = 0 Тогда  
				Сообщить(СтрШаблон("в спр ""Типы нумераторов"" для нумератора %1 не заполнено максимальное количество ручьев для рабочего цетнра %2",  
				текстр.ТипНумератора,  текстр.РабочийЦентр ));   
				ТекСтр.КоличествоРучьевНумератора  = 0 ;
				Возврат
			КонецЕсли; 
			
			Если  ТекСтр.КоличествоРучьевНумератора > МаксКолРучьев	Тогда 
				ТекСтр.КоличествоРучьевНумератора  = МаксКолРучьев;
				Сообщить(СтрШаблон("Максимум ручьев для РЦ %2 при нумераторе %3 - %1", МаксКолРучьев, текстр.РабочийЦентр, текстр.ТипНумератора ));			
			КонецЕсли; 				
		КонецЕсли;  
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрокат(Команда)
	
	ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат
	КонецЕсли;    
	
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
   
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииСхемыМашиныЦвета", ЭтаФорма);
	
		
	ПараметрыНаФорму = Новый Структура;
	ПараметрыНаФорму.Вставить("ПараметрыСекции", "");
    ПараметрыНаФорму.Вставить("Ссылка", Объект.Ссылка); 

    ПараметрыНаФорму.Вставить("НомерПроката", ?(Объект.Цвета.Количество() = 0, 1, ПолучитьМаксимумНомераПроката()));	

	

	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыНаФорму ,ЭтаФорма,,,,ОбработкаЗакрытия);

КонецПроцедуры 

 

&НаКлиенте
Процедура РедактироватьПрокатЦвета(Команда)

	Если Не ЗначениеЗаполнено(Объект.Площадка) Тогда
		Сообщить("Необходимо заполнить поле ""Площадка""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	
	Если ТекСтр = Неопределено Тогда 
		Сообщить("Не выбрана строка для редактирования", СтатусСообщения.Важное);
		Возврат;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		Сообщить("Необходимо заполнить поле ""Рабочий центр""", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;   
	
	ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат
	КонецЕсли;  
	
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
	
		
	ПараметрыНаФорму = Новый Структура;
	ПараметрыНаФорму.Вставить("Площадка", Объект.Площадка);  
	ПараметрыНаФорму.Вставить("Ссылка", Объект.Ссылка); 
	ПараметрыНаФорму.Вставить("НомерПроката", ТекСтр.НомерПроката);	
	ПараметрыНаФорму.Вставить("РабочийЦентр", ТекСтр.РабочийЦентр);  
	
	текТЗСекции = ПолучитьТаблицуДляПередачиДанныхПоПрокатуЦвета(ТекСтр.НомерПроката);

	ПараметрыНаФорму.Вставить("ТЗСекции", текТЗСекции);	
	
		
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииСхемыМашиныЦвета", ЭтотОбъект, "");
			
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.Лико_СхемаМашины", ПараметрыНаФорму ,ЭтаФорма,,,,ОбработкаЗакрытия);   
	
КонецПроцедуры  

 &НаКлиенте
Процедура ПриЗакрытииСхемыМашиныЦвета(ВозвращенноеЗначение, ДопПараметры) Экспорт
	
	Если ВозвращенноеЗначение = Неопределено Тогда 
		Возврат
	КонецЕсли;   
	
	РЦ = ВозвращенноеЗначение.РабочийЦентр;
	НомерПроката = ВозвращенноеЗначение.НомерПроката; 

	НайденныеСтроки = Объект.цвета.НайтиСтроки(новый структура("РабочийЦентр, НомерПроката", РЦ, НомерПроката));

	Для каждого ТекСтр из НайденныеСтроки Цикл
		Объект.цвета.Удалить(ТекСтр); 
	КонецЦикла;    
		
	ДесериализованныйМассив = ДесериализоватьМассив(ВозвращенноеЗначение.МассивПараметровСекций); 
	сч = 0;
	Для каждого стр из ВозвращенноеЗначение.МассивПараметровСекций Цикл 
		новаяСтрока = Объект.Цвета.Добавить();	 
		ЗаполнитьЗначенияСвойств(новаяСтрока, ДесериализованныйМассив[сч]); 
		
		новаяСтрока.РабочийЦентр = РЦ;   
		новаяСтрока.НомерПроката = НомерПроката; 
        сч = сч + 1;
	КонецЦикла;  
	
	
КонецПроцедуры 

Функция ПолучитьТаблицуДляПередачиДанныхПоПрокатуЦвета(НомерПроката) 
	
	МассивДанныхПроката = новый массив;
			
	РеквизитыЦвета = ПолучитьМассивРеквизитовТЧ();
		
	НайденныеСтроки = Объект.Цвета.НайтиСтроки(Новый Структура("НомерПроката", НомерПроката)); 
	Для каждого стр из НайденныеСтроки Цикл 
		
		СтруктураТЧЦвета = Новый Структура;

		Для каждого рек из РеквизитыЦвета Цикл  
			СтруктураТЧЦвета.Вставить(рек, стр[рек]); 	
		КонецЦикла;  
		МассивДанныхПроката.Добавить(СтруктураТЧЦвета);
		
	КонецЦикла;
	
	Возврат МассивДанныхПроката
	
КонецФункции

&НаКлиенте
Процедура ПроизводствоНарезкаРазмерПриИзменении(Элемент)
	ПроизводствоЭтикетокЗасчитаноПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоКартаРасходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого стр из Объект.КартаПерерасхода Цикл
		СписокВыбора.Добавить(стр.НомерКарты);
	КонецЦикла;	
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяТЧ", "Производство");
	ДопПараметры.вставить("ИмяРеквизита","КартаПерерасходаНомер"); 
	ОписаниеОповещения = Новый ОписаниеОповещения("КартаСнятияРасходаВыборИзСпискаЗавершение", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоКартаСнятияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого стр из Объект.КартаСнятия Цикл
		СписокВыбора.Добавить(стр.НомерКарты);
	КонецЦикла;	
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяТЧ", "Производство");
	ДопПараметры.вставить("ИмяРеквизита","КартаСнятияНомер"); 
	ОписаниеОповещения = Новый ОписаниеОповещения("КартаСнятияРасходаВыборИзСпискаЗавершение", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантыДопусковПриИзменении(Элемент)
	
	Если ВариантыДопусков <> 0 Тогда 
		Если ВариантыДопусков = 1 Тогда
			Объект.ДопускМинус = 1;
			Объект.ДопускПлюс = 0;
		ИначеЕсли ВариантыДопусков = 2 Тогда
			Объект.ДопускМинус = 0.5;
			Объект.ДопускПлюс = 0.5;
		ИначеЕсли ВариантыДопусков = 3 Тогда
			Объект.ДопускМинус = 0;
			Объект.ДопускПлюс = 1;
		КонецЕсли;
	Иначе	
		Объект.ДопускМинус = 0;
		Объект.ДопускПлюс = 0;
	КонецЕсли;
	Если Объект.ВидВырубки = 18 ИЛИ Объект.ВидВырубки = 19 Тогда	
		Заказ = Объект;
		ЗаполнитьПараметрыПечати(Заказ, Объект.ВидВырубки);	
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ПоказатьDFMПриИзмененииНаСервере()
	  DFMСервер.УстановитьВидимость(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьDFMПриИзменении(Элемент)
	ПоказатьDFMПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭтПоДлинеПечатиПриИзменении(Элемент)
	ТекВидВырубки = Объект.ВидВырубки;
	Если ТекВидВырубки = 3 Тогда
		ЗаполнитьЭтикеткиПечати(ТекВидВырубки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаЗаказМатериалаПриИзменении(Элемент)
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.ЗаказМатериала) Тогда
		Если НЕ ПроверитьНаПолуфабрикатНаСервере(текстр.ЗаказМатериала) Тогда
			текстр.ЗаказМатериала = Неопределено;
		КонецЕсли;
		текстр.Материал = ВыходноеИзделиеЗаказаНаСервере(текстр.ЗаказМатериала);
	Иначе
		текстр.Материал = ПустаяСсылка("Номенклатура");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаЗаказМатериалаОткрытие(Элемент, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.Цвета.ТекущиеДанные;	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЗаказМатериала) Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ДопПараметры = Новый Структура("ОсновнойМатериал", Ложь);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСозданииЗаказаМатериала", ЭтаФорма,ДопПараметры);
		ПоказатьВопрос(Оповещение, "Создать Заказ на материал?", Режим,0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаРабочийЦентрОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТД = Элементы.Цвета.ТекущиеДанные; 
	ТекущееЗначениеРЦ=ТД.РабочийЦентр;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаТипКраскиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	
	Если текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор")  Тогда 
		ВыполняемаяОбработка = НайтиВПФ("Обработка ""лк СхемаМашины""");
		
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
			
		СтандартнаяОбработка = ложь;
		
		текПараметрыВыбора = Новый Структура;		
		текПараметрыВыбора.Вставить("ВидТМЦ", ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Чернила"));	
		текПараметрыВыбора.Вставить("Площадка", Объект.Площадка);	
		текПараметрыВыбора.Вставить("ВидСекции", ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Нумератор"));
		текПараметрыВыбора.Вставить("ЭлементИмя", "ТипПродукта"); 
		текПараметрыВыбора.Вставить("ТипНумератора", ТекСтр.ТипНумератора); 
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораЦГ", ЭтаФорма);                      	
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаВыбораЦГ", текПараметрыВыбора, ЭтаФорма,,,,ОбработкаВыбора);
		
		
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВидОснасткаПриИзменении(Элемент)

	стр = Элементы.Цвета.ТекущиеДанные;
	Если ТипЗнч(стр.ВидОснастка) = Тип("СправочникСсылка.Лико_ВидыТМЦ") И ЗначениеРеквизита(стр.ВидСекции,"ИспользоватьВидТМЦ") И ЗначениеЗаполнено(стр.ВидОснастка) Тогда 
    	стр.ВидТМЦ = стр.ВидОснастка;
		стр.Оснастка = Неопределено;
	
		реквизитыТЧ = ПолучитьМассивРеквизитовТЧ();
		//очистка строки
		для Каждого текРек из реквизитыТЧ цикл
			
			Если текРек = "РабочийЦентр" ИЛИ текРек = "Номерработы" ИЛИ текРек = "ВидПечати" ИЛИ  текРек = "ВидСекции" ИЛИ текРек = "ВидТМЦ" ИЛИ  текРек = "КлючСтроки" ИЛИ  текРек = "НомерПроката" ИЛИ  текРек = "НомерВарианта" Тогда 
				Продолжить;
			Иначе
				стр[текРек] = неопределено;
			КонецЕсли;
			//Если текРек = "Вал" ИЛИ текРек = "Форма" Тогда
			//	Стр.ВалФорма = стр[текРек];
			//КонецЕсли;
		КонецЦикла;
		
		ВидЗаливки = ПолучитьВидЗаливкиПоУмолчанию(стр.ВидСекции, стр.ВидТМЦ);
		
		стр.ВидЗаливки = ВидЗаливки;
		стр.ТипЗаливка = ВидЗаливки;
		
	ИначеЕсли ТипЗнч(стр.ВидОснастка) = Тип("СправочникСсылка.Номенклатура") И ЗначениеРеквизита(стр.ВидСекции,"Оснастка") И ЗначениеЗаполнено(стр.ВидОснастка) Тогда
		стр.Оснастка = стр.ВидОснастка;
		стр.ВидТМЦ = Неопределено;
		ДобавитьУсловноеОформлениеЦветаВидОснастка();
		ЗаписатьЦветаВРаботы();
		ЗаполнениеПараметровОснастки(); 
	Иначе
		стр.ВидОснастка = Неопределено;
		стр.Оснастка = Неопределено;  
		стр.ВидТМЦ = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦветаВидОснасткаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекСтр.ВидСекции) Тогда
		Если ЗначениеРеквизита(ТекСтр.ВидСекции,"Оснастка") Тогда   
			Обработка = НайтиВПФ("Обработка ""Штампер""");
			Если Обработка <> Неопределено Тогда 
				ПараметрыОткрытия = Новый Структура;
				ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
				ПараметрыОткрытия.Вставить("ВидРабот",ЗначениеРеквизита(текстр.ВидСекции, "ВидРабот"));
				Если ЗначениеЗаполнено(текстр.Рабочийцентр) Тогда 
					ПараметрыОткрытия.Вставить("РабочийЦентр", текстр.Рабочийцентр);
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.Площадка) Тогда 
					ПараметрыОткрытия.Вставить("Площадка", Объект.Площадка);
				КонецЕсли;
				Если ЗначениеЗаполнено(текстр.Оснастка) Тогда 
					ПараметрыОткрытия.Вставить("Оснастка",текстр.Оснастка );
				КонецЕсли;
				ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
				ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаУпр", ПараметрыОткрытия,Элементы.ЦветаОснастка ,,,, Новый ОписаниеОповещения("ВыборЗавершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;	
		ИначеЕсли ЗначениеРеквизита(ТекСтр.ВидСекции,"ИспользоватьВидТМЦ") Тогда    
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Лак")); 
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Клей"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Праймер"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.БесцветнаяМасса"));
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Чернила"));
		ИначеЕсли НЕ ЗначениеРеквизита(ТекСтр.ВидСекции,"Оснастка") И НЕ ЗначениеРеквизита(ТекСтр.ВидСекции,"ИспользоватьВидТМЦ") Тогда
			ТекСтр.ВидОснастка = Неопределено;
		КонецЕсли;  
	Иначе
		Сообщить("Заполните Вид работ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВалФормаПриИзменении(Элемент)
	
	стр = Элементы.Цвета.ТекущиеДанные;
	Если ТипЗнч(стр.ВалФорма) = Тип("СправочникСсылка.Лико_Формы") И ЗначениеЗаполнено(стр.ВалФорма) Тогда 
		стр.Форма = стр.ВалФорма;
	ИначеЕсли ТипЗнч(стр.ВалФорма) = Тип("СправочникСсылка.Номенклатура") И ЗначениеЗаполнено(стр.ВалФорма) Тогда
		стр.Вал = стр.ВалФорма;
	Иначе
		стр.ВалФорма = Неопределено;
		стр.Вал = Неопределено;  
		стр.Форма = Неопределено;
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВалФормаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтр.ВидСекции) Тогда
		Если (ЗначениеРеквизита(ТекСтр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая")
			ИЛИ ТекСтр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.БессольвентнаяЛаминация")) И НЕ ЗначениеЗаполнено(ТекСтр.ВалФорма) Тогда   
			ТекСтр.ВалФорма = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");	
		ИначеЕсли НЕ (ЗначениеРеквизита(ТекСтр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая")
			ИЛИ ТекСтр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.БессольвентнаяЛаминация")) И ТекСтр.ВалФорма <> Неопределено Тогда
			СтандартнаяОбработка = Ложь; 
			ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеФорм", ЭтотОбъект);
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.Лико_Формы"));
			ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Выбор форм'"));
			Массив= Новый Массив;
			НайденныеСтроки = Объект.Формы.НайтиСтроки(Новый Структура("КлючСтроки", ТекСтр.КлючСтроки));
			Для каждого стр из НайденныеСтроки Цикл
				Массив.Добавить(стр.Значение);
			КонецЦикла;	
			ПараметрыФормы.Вставить("Значения", Массив);
			ОткрытьФорму("ОбщаяФорма.РедактированиеСпискаЗначений", ПараметрыФормы , , , , , ОписаниеОповещения);
		ИначеЕсли ТекСтр.ВалФорма = Неопределено Тогда
			ТекСтр.ВалФорма = ПредопределенноеЗначение("Справочник.Лико_Формы.ПустаяСсылка");	
		КонецЕсли;  
		//Если НЕ (ЗначениеРеквизита(ТекСтр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая")
		//	ИЛИ ТекСтр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.БессольвентнаяЛаминация")) И ТекСтр.ВалФорма = Неопределено Тогда
		//	ТекСтр.ВалФорма = ПредопределенноеЗначение("Справочник.Лико_Формы.ПустаяСсылка");	
		//КонецЕсли;
	Иначе
		Сообщить("Заполните Вид работ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВалФормаОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.ВалФорма) = Тип("СправочникСсылка.Лико_Формы") Тогда
		УдалитьСписокЗначений("Формы", ТекущиеДанные.КлючСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаВалФормаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	Если НЕ (ЗначениеРеквизита(ТекущиеДанные.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая")
		ИЛИ ТекущиеДанные.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.БессольвентнаяЛаминация")) Тогда   
		Если ЗначениеЗаполнено("Текст") Тогда 
			СпрФорма = ПолучитьФормуНаСервере(Текст);
			Если ЗначениеЗаполнено(СпрФорма) Тогда 
				УдалитьСписокЗначений("Формы", ТекущиеДанные.КлючСтроки);
				стр = Объект.Формы.Добавить();
				стр.Значение = СпрФорма;
				стр.КлючСтроки = ТекущиеДанные.КлючСтроки;
				текущиеДанные.Форма = СпрФорма;
				текущиеДанные.ВалФорма = СпрФорма;
				ДобавитьУсловноеОформлениеЦветаВалФорма();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Форма) Тогда
		ДатаГлубокихФорм = ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм"),"ЗначениеПараметра");
		Если ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() И ЗначениеРеквизита(ТекущиеДанные.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.Глубокая") Тогда
			Грамматура = ЗначениеРеквизита(ТекущиеДанные.Форма,"Грамматура");
			ПроцентЗаливки = ЗначениеРеквизита(ТекущиеДанные.Форма,"ПроцентЗаливки");
			Если ЗначениеЗаполнено(Грамматура) Тогда
				ТекущиеДанные.Грамматура = Грамматура * 0.5;
			Иначе
				
			КонецЕсли;
			Если ЗначениеЗаполнено(ПроцентЗаливки) Тогда
				ТекущиеДанные.ПроцентЗаливки = ПроцентЗаливки;
			Иначе
				
			КонецЕсли;
			ВалСвязанныйСФормой = ПолучитьВалСвязанныйСФормой(ТекущиеДанные.Форма); 
			Если ЗначениеЗаполнено(ВалСвязанныйСФормой) И ТипЗнч(ВалСвязанныйСФормой) = Тип("СправочникСсылка.Номенклатура") Тогда
				ТекущиеДанные.Вал = ВалСвязанныйСФормой;
				Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
			ИначеЕсли ЗначениеЗаполнено(ВалСвязанныйСФормой) И ТипЗнч(ВалСвязанныйСФормой) = Тип("Массив") Тогда
				ПараметыФормы = Новый Структура("Заголовок,ФормаОтбор","Выберие Вал",ТекущиеДанные.Форма);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВала", ЭтаФорма);
				ОткрытьФорму("РегистрСведений.Лико_ВалыФормы.Форма.ФормаВыбораВала",ПараметыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущиеДанные.ФормаНомерЛинкс = Неопределено;	
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалСвязанныйСФормой(ФормаСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лико_ВалыФормыСрезПоследних.Период КАК ДатаПрихода,
	//|	Лико_ВалыФормыСрезПоследних.Вал.Артикул КАК ВалАртикул,
	//|	Лико_ВалыФормыСрезПоследних.Вал КАК Вал
	//|ИЗ
	//|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(, Форма = &Форма) КАК Лико_ВалыФормыСрезПоследних";
	"ВЫБРАТЬ
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВалыПерегравировкаВсе
	|ИЗ
	|	РегистрНакопления.Лико_ЗаявкиНаГравировкуВалов.Остатки КАК Лико_ЗаявкиНаГравировкуВаловОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.Помещение.Лико_ПомещениеБрака) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ЗаявкиНаГравировкуВаловОстатки.Вал = ТоварыВЯчейкахОстатки.Номенклатура
	|ГДЕ
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(3999, 12, 31) КАК ДатаПрихода,
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.Вал.Артикул КАК ВалАртикул,
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВалыПерегравировка
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.Помещение.Лико_ПомещениеБрака) КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗаявкиНаГравировкуВалов.Остатки(, Форма = &Форма) КАК Лико_ЗаявкиНаГравировкуВаловОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = Лико_ЗаявкиНаГравировкуВаловОстатки.Вал
	|ГДЕ
	|	Лико_ЗаявкиНаГравировкуВаловОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ВалыФормыСрезПоследних.Период КАК ДатаПрихода,
	|	Лико_ВалыФормыСрезПоследних.Вал.Артикул КАК ВалАртикул,
	|	Лико_ВалыФормыСрезПоследних.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВалы
	|ИЗ
	|	РегистрСведений.Лико_ВалыФормы.СрезПоследних(, Форма = &Форма) КАК Лико_ВалыФормыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				НЕ Ячейка.Помещение.Лико_ПомещениеБрака
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								ВТВалыПерегравировка.Вал КАК Вал
	|							ИЗ
	|								ВТВалыПерегравировка КАК ВТВалыПерегравировка)
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								ВТВалыПерегравировкаВсе.Вал КАК Вал
	|							ИЗ
	|								ВТВалыПерегравировкаВсе КАК ВТВалыПерегравировкаВсе)) КАК ТоварыВЯчейкахОстатки
	|		ПО Лико_ВалыФормыСрезПоследних.Вал = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ВалыФормы.СрезПоследних КАК Лико_ВалыФормыСрезПоследнихТекущаяФорма
	|		ПО Лико_ВалыФормыСрезПоследних.Вал = Лико_ВалыФормыСрезПоследнихТекущаяФорма.Вал
	|ГДЕ
	|	Лико_ВалыФормыСрезПоследних.Форма = Лико_ВалыФормыСрезПоследнихТекущаяФорма.Форма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВалы.ДатаПрихода КАК ДатаПрихода,
	|	ВТВалы.ВалАртикул КАК ВалАртикул,
	|	ВТВалы.Вал КАК Вал
	|ПОМЕСТИТЬ ВТВсеВалы
	|ИЗ
	|	ВТВалы КАК ВТВалы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТВалыПерегравировка.ДатаПрихода,
	|	ВТВалыПерегравировка.ВалАртикул,
	|	ВТВалыПерегравировка.Вал
	|ИЗ
	|	ВТВалыПерегравировка КАК ВТВалыПерегравировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТВсеВалы.ДатаПрихода КАК ДатаПрихода,
	|	ВТВсеВалы.ВалАртикул КАК ВалАртикул,
	|	ВТВсеВалы.Вал КАК Вал
	|ИЗ
	|	ВТВсеВалы КАК ВТВсеВалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПрихода";
	
	Запрос.УстановитьПараметр("Форма", ФормаСсылка);
	
	ТЗВалы = Запрос.Выполнить().Выгрузить();
	
	МассивВалы = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗВалы);
	Если МассивВалы.Количество() = 1 Тогда
		Возврат МассивВалы[0].Вал;
	ИначеЕсли МассивВалы.Количество() > 1 Тогда
		Возврат МассивВалы;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
					
КонецФункции

&НаКлиенте
Процедура ПослеВыбораВала(Результат, Параметры) Экспорт  
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если Результат <> Неопределено И текстр <> Неопределено Тогда 
		текстр.Вал = Результат;
		Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
	Иначе
		Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеЦветаВалФорма();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаГрамматураАвтоПодбор(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.ВидСекции) Тогда
		Если текстр.ВидСекции = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ТрафаретнаяПечать") Тогда 
			СтандартнаяОбработка = Ложь;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораГр", ЭтаФорма);
			ОткрытьФорму("Справочник.Лико_ТрафаретныеСетки.ФормаВыбора", ,ЭтаФорма , , , , ОписаниеОповещения);
		ИначеЕсли ЗначениеРеквизита(текстр.ВидСекции,"Родитель") = ПредопределенноеЗначение("Справочник.Лико_ВидыСекций.ЦифровойМодуль") Тогда
			СтандартнаяОбработка = Ложь;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораГр", ЭтаФорма);
			ОткрытьФорму("Справочник.Лико_ГрамматураНаРЦ.ФормаВыбора", ,ЭтаФорма , , , , ОписаниеОповещения);
		КонецЕсли;
	Иначе
		Сообщить("Заполните Вид работ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГр(Результат, Параметры) Экспорт  
	
	текстр = Элементы.Цвета.ТекущиеДанные;
	Если Результат <> Неопределено И текстр <> Неопределено Тогда 
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_ТрафаретныеСетки") ТОгда 
			текстр.ТрафаретнаяСетка = Результат;
			текстр.Грамматура = ЗначениеРеквизита(Результат,"Грамматура");
			Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
		ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.Лико_ГрамматураНаРЦ") Тогда
			текстр.ГрамматураНаРЦ = Результат;
			текстр.Грамматура = ЗначениеРеквизита(Результат,"Грамматура");
			Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
		КонецЕсли;
	Иначе
		Элементы.Цвета.ЗакончитьРедактированиеСтроки(Ложь);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСШагом(Команда)
	
	Если Объект.РасчетТиражей.Количество() > 0 И Объект.РасчетТиражей[0].Тираж > 0 Тогда
		Обработка = НайтиВПФ("Отчет ""Расчет доходности тиражей заказа""");
		Если Обработка <> Неопределено Тогда 
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Количество",Объект.РасчетТиражей[0].Тираж);
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
			ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ЗапросДанныхУПользователя", ПараметрыОткрытия,ЭтаФорма,,,,Новый ОписаниеОповещения("ЗаполнитьСШагомЗавершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	Иначе
		Сообщить("Не заполнен тираж в строке 1");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСШагомЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 	
			Если ЭтаФорма.Модифицированность Тогда
				Сообщить("Необходимо записать документ");
				Возврат
			КонецЕсли; 
		иначе  
			Сообщить("Необходимо записать заказ");
			Возврат	
		КонецЕсли;
		ТиражПредыдущейСтроки = Объект.РасчетТиражей[0].Тираж;
		ОбновитьРасчетТиражейНаСервере(Истина);
		Для КоличествоСтрок = 1 По (РезультатЗакрытия.До - РезультатЗакрытия.От) / РезультатЗакрытия.СШагом Цикл
			НС = Объект.РасчетТиражей.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Объект.РасчетТиражей[0]);
			НС.Тираж = ТиражПредыдущейСтроки + РезультатЗакрытия.СШагом;
			РасчетТиражейПересчет(НС);
			ТиражПредыдущейСтроки = НС.Тираж;
		КонецЦикла
	КонецЕсли;
    
КонецПроцедуры   

&НаКлиенте
Процедура РасчетТиражейЦена(Команда)
	
	Если Объект.РасчетТиражей.Количество() > 0 Тогда
		ЦенаПервойСтроки = Объект.РасчетТиражей[0].Цена;
		Для каждого Стр Из Объект.РасчетТиражей Цикл
			Если Стр.НомерСтроки <> 1 Тогда
				Стр.Цена = ЦенаПервойСтроки;
				ПараметрыРасчетаПересчитатьДанные(Стр);
			КонецЕсли;
		КонецЦикла
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасчетТиражейДоходность(Команда)
	
	Если Объект.РасчетТиражей.Количество() > 0 Тогда
		ДоходностьПервойСтроки = Объект.РасчетТиражей[0].Доходность;
		Для каждого Стр Из Объект.РасчетТиражей Цикл
			Если Стр.НомерСтроки <> 1 Тогда
				Стр.Доходность = ДоходностьПервойСтроки; 
				Стр.Доход = Стр.Доходность*Стр.Время; 
				Стр.Стоимость = (Стр.Доход+Стр.Себестоимость)/К_Дох;
				Стр.Цена = Стр.Стоимость/Стр.Тираж; 
				Стр.ЦенаБезНДС = Стр.Цена *100/122; 
				Если ЗначениеЗаполнено(Стр.МетражКВМ) Тогда 
					Стр.ЦенаМ2 = Стр.Стоимость/Стр.МетражКВМ;
				КонецЕсли;
				Стр.Рентабельность = Окр(Стр.Доход/Стр.Стоимость*100,2);
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетТиражейРентабельность(Команда)
	
	Если Объект.РасчетТиражей.Количество() > 0 Тогда
		РентабельностьПервойСтроки = Объект.РасчетТиражей[0].Рентабельность;
		Для каждого Стр Из Объект.РасчетТиражей Цикл
			Если Стр.НомерСтроки <> 1 Тогда
				Стр.Рентабельность = РентабельностьПервойСтроки;
				Стр.Стоимость = Стр.Себестоимость / (К_Дох - Стр.Рентабельность / 100);	
				Стр.Цена = Стр.Стоимость/Стр.тираж; 
				Стр.ЦенаБезНДС = Стр.Цена*100/122;	
				Если ЗначениеЗаполнено(Стр.МетражКВМ) Тогда 
					Стр.ЦенаМ2 = Стр.Стоимость/Стр.МетражКВМ;
				КонецЕсли;
				
				Стр.Доход = Стр.Стоимость*К_Дох - Стр.Себестоимость;   
				Если ЗначениеЗаполнено(Стр.Время) Тогда 
					Стр.Доходность = Стр.Доход/Стр.Время;
				КонецЕсли;  
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаппортПриИзменении(Элемент)
	
	текВидВырубки = ?(Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка"),19,18);
	
	Объект.ДлинаПечати = ЗначениеРеквизита(Объект.Раппорт, "ДлинаПечати") / 1000;
	Если текВидВырубки = 19 Тогда
		Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ДлинаЭтикетки/1000));
	ИначеЕсли текВидВырубки = 18 Тогда
		Объект.КоличествоЭтПоДлинеПечати = Окр(Объект.ДлинаПечати/(Объект.ШиринаЭтикетки/1000)); 
	КонецЕсли;

	ЗаполнитьПлощадьКлишеНаСервере(текВидВырубки);
	Объект.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечатиНаСервере(текВидВырубки);
	Объект.РаппортМеняли = Истина;

КонецПроцедуры

&НаСервере
Функция ОмегаСНумератором()
	
	текНайденныеСтрокиНумератор = Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.Нумератор));
	Для Каждого ТекСтрока Из текНайденныеСтрокиНумератор Цикл
		Если ВидРЦОмега(ТекСтрока.РабочийЦентр) Тогда
        	Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором(иЭтМЭР = Неопределено) 
	
	Объект.ЭтМЭР = ?(ЗначениеЗаполнено(иЭтМЭР),иЭтМЭР,0.4826 / Цел(0.4826/(Объект.ШиринаЭтикетки / 1000 + 0.0027)));
	Если ЗначениеРеквизита(Объект.РабочийЦентр,"ВидРабочегоЦентра") = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Indigo") Тогда
		Объект.ЭтикетокНаЛистеИндиго = Объект.КоличествоЭтПоДлинеПечатиИндиго * Объект.РучьиПечатиИндиго;
		Объект.ДлинаПечатиИндиго = Объект.КоличествоЭтПоДлинеПечатиИндиго * Объект.ЭтМЭР
	ИначеЕсли Объект.Ручьи <> 0 Тогда
		Объект.ЭтикетокНаЛистеПечати = Объект.ЭтикетокНаЛисте * Объект.РучьиПечати/Объект.Ручьи;
	КонецЕсли;
	Объект.ШагПечати = Объект.ЭтикетокНаЛисте / Объект.Ручьи * Объект.ЭтМЭР;
	Объект.ПлощадьКлише = (Объект.ШагПечати*100 + 2)*(ЗначениеРеквизита(Объект.Нарезка,"Размер")/10 + 2);
    РасчитатьТиражМетраж();
	
КонецПроцедуры

&НаКлиенте
Процедура РучьиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ШтампВырубной) И Объект.ВидВырубки = 0 И ОмегаСНумератором() Тогда
		ЗаполнитьПараметрыПечатиИВырубкиОмегаСНумератором();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУпаковкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Площадка = ГлЛико_Площадки.ИксПак ИЛИ Объект.Площадка = ГлЛико_Площадки.Ликофлекс Тогда    
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.СтрейчПленка"),"Стрейч пленка");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.Коробки"),"Коробки"); 
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.ПакетыКоробки"),"Пакеты + Коробки");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.БезКоробокНаПаллет"),"Без коробок на паллет");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.УпаковкаНаПаллетПодСтрейчПленку"),"Упаковка на паллет под стрейч пленку");
	Иначе
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.СтрейчПленка"),"Стрейч пленка");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.Коробки"),"Коробки"); 
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.ПакетыКоробки"),"Пакеты + Коробки");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.СтрейчПленкаКоробка"),"Стрейч пленка + Коробки");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.ТермопленкаКоробки"),"Термопленка + Коробки");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.СтрейчПленкаПрокладкаРебраЖесткостиКоробка"),"СтрейчПленка+Прокладка+РебраЖесткости+Коробка");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.БезКоробокНаПаллет"),"Без коробок на паллет");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.УпаковкаНаПаллетПодСтрейчПленку"),"Упаковка на паллет под стрейч пленку");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.Лико_ВидыУпаковки.ВкладышТермопленка"),"Вкладыш + термопленка");
	КонецЕсли;			
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьВалыНаСервере()
	
	БылиИзмененияВалАртикул = Ложь;
	Для Каждого Стр Из Объект.Цвета Цикл
		Если Стр.ВидСекции.Родитель = Справочники.Лико_ВидыСекций.Глубокая И ЗначениеЗаполнено(Стр.Вал) И СтрДлина(СокрЛП(Стр.Вал.Артикул)) > 6 Тогда	
			ВалОбъект = Стр.Вал.ПолучитьОбъект();
			ВалОбъект.Артикул = Сред(ВалОбъект.Артикул,1,6);
			//Проверка на существование номенклатуры с таким наименованием и артикулом из 6 цифр, добавляем "0" к артикулу, если находим
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Наименование = &Наименование
			|	И Номенклатура.Артикул = &Артикул";
			
			Запрос.УстановитьПараметр("Артикул", ВалОбъект.Артикул);
			Запрос.УстановитьПараметр("Наименование", ВалОбъект.Наименование);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ВалОбъектДляПереименования = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(); 
				ВалОбъектДляПереименования.Артикул = ВалОбъектДляПереименования.Артикул + "0";
				ВалОбъектДляПереименования.ОбменДанными.Загрузка = Истина;
				ВалОбъектДляПереименования.Записать();
			КонецЦикла;
			ВалОбъект.ОбменДанными.Загрузка = Истина;
			ВалОбъект.Записать();
			БылиИзмененияВалАртикул = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	Если БылиИзмененияВалАртикул Тогда
		ДобавитьУсловноеОформлениеЦветаВалФорма();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьВалы(Команда)
	
	ДатаГлубокихФорм = ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм"),"ЗначениеПараметра");
	Если ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() Тогда
		АктуализироватьВалыНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФормы(Команда)
	
    СоздатьФормыНаСервере();
	ДобавитьУсловноеОформлениеЦветаВалФорма();

КонецПроцедуры

&НаСервере
Процедура СоздатьФормыНаСервере()
	
	стрТовары = Объект.Товары[0];
	СоздатьТолькоТрафарет = Ложь;
	Если ЗначениеЗаполнено(стрТовары.ВерсияНоменклатуры) Тогда 
		Артикул = Прав(стрТовары.ВерсияНоменклатуры.АртикулНоменклатуры,4) + Формат(стрТовары.ВерсияНоменклатуры.Версия,"ЧЦ=2; ЧН=; ЧВН=");
		ФормаНайти = Справочники.Лико_Формы.НайтиПоРеквизиту("КодЛинкс",Артикул);	
		Если ЗначениеЗаполнено(ФормаНайти) Тогда			
			Если Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",справочники.Лико_ВидыСекций.ТрафаретнаяПечать)).Количество() <> 0 Тогда	
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Лико_Формы.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Лико_Формы КАК Лико_Формы
				|ГДЕ
				|	НЕ Лико_Формы.ПометкаУдаления
				|	И Лико_Формы.КодЛинкс = &КодЛинкс
				|	И Лико_Формы.ВидСекции = &ВидСекции";
				
				Запрос.УстановитьПараметр("ВидСекции", справочники.Лико_ВидыСекций.ТрафаретнаяПечать);
				Запрос.УстановитьПараметр("КодЛинкс", Артикул);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Сообщить("Формы для выбранной версии номенклатуры уже существуют"); 
					Возврат;
				КонецЦикла; 
				СоздатьТолькоТрафарет = Истина;
			Иначе
				Сообщить("Формы для выбранной версии номенклатуры уже существуют"); 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Номенклатура = Объект.Товары[0].Номенклатура;  
		сч = 1;
		Для каждого стр из Объект.Цвета Цикл 
			ВидПечати = стр.ВидСекции.ВидПечати;
			Если ВидПечати = справочники.Лико_ВидыПечати.Флексо ИЛИ ВидПечати = справочники.Лико_ВидыПечати.Трафарет Тогда 
				Если Не ЗначениеЗаполнено(стр.Форма) И стр.Цветоделение = Ложь И (стр.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Краска или стр.ВидЗаливки = Перечисления.Лико_ВидЗаливки.НеСплошная) Тогда 
					Если (СоздатьТолькоТрафарет И ВидПечати = справочники.Лико_ВидыПечати.Трафарет) ИЛИ НЕ СоздатьТолькоТрафарет Тогда
						НоваяФормаЦвета = Справочники.Лико_Формы.СоздатьЭлемент(); 
						НоваяФормаЦвета.Контрагент = Объект.Контрагент; 
						НоваяФормаЦвета.Заказ = Объект.Ссылка;
						НоваяФормаЦвета.ВидПечати = ВидПечати; 
						НоваяФормаЦвета.ВидСекции = стр.ВидСекции;
						НоваяФормаЦвета.ТипЦвета = стр.ТипЦвета1; 
						НоваяФормаЦвета.ТипКраски = стр.ТипКраски; 
						НоваяФормаЦвета.Название = стр.Название;
						НоваяФормаЦвета.Наименование = ?(ЗначениеЗаполнено(стр.ТипЦвета1), Строка(стр.ТипЦвета1)+ " ", "") + ?(ЗначениеЗаполнено(стр.ТипКраски), Строка(стр.ТипКраски)+ " ", "") + ?(ЗначениеЗаполнено(стр.Название), Строка(стр.Название), "");
						НоваяФормаЦвета.Площадка = Объект.Площадка;
						НоваяФормаЦвета.Организация = Объект.Площадка.Организация;
						
						стрЭт = НоваяФормаЦвета.Этикетки.Добавить();
						стрэт.Номенклатура =  Номенклатура;
						Если СоздатьТолькоТрафарет Тогда
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_Формы.Ссылка) КАК Ссылка
							|ИЗ
							|	Справочник.Лико_Формы КАК Лико_Формы
							|ГДЕ
							|	Лико_Формы.КодЛинкс = &КодЛинкс";
							
							Запрос.УстановитьПараметр("КодЛинкс", Артикул);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								сч = ВыборкаДетальныеЗаписи.Ссылка + 1;
							КонецЦикла;
						КонецЕсли;
						НоваяФормаЦвета.Код = Артикул + Формат(сч,"ЧЦ=2; ЧВН=");
						НоваяФормаЦвета.КодЛинкс = Артикул;
						
						НоваяФормаЦвета.Записать();  
						стр.форма =  НоваяФормаЦвета.ссылка;
						сч = сч + 1;
						ЭтаФорма.Модифицированность = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СвязатьНаСервере()
	
	Для Каждого Стр Из Объект.Цвета Цикл
		Если Стр.ВидСекции.Родитель = Справочники.Лико_ВидыСекций.Глубокая И ЗначениеЗаполнено(Стр.Вал) И ЗначениеЗаполнено(Стр.Форма) Тогда
			//Регистратор - последний документ прихода формы
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ВозвратТоваровТовары.Ссылка КАК Ссылка,
			|	Лико_ВозвратТоваровТовары.Ссылка.Дата КАК Дата
			|ПОМЕСТИТЬ ВТ_ПоследнийПриход
			|ИЗ
			|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
			|ГДЕ
			|	Лико_ВозвратТоваровТовары.Номенклатура = &Вал
			|	И Лико_ВозвратТоваровТовары.Ссылка.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПриходныйОрдерНаТоварыТовары.Ссылка,
			|	ПриходныйОрдерНаТоварыТовары.Ссылка.Дата
			|ИЗ
			|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
			|ГДЕ
			|	ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен
			|	И ПриходныйОрдерНаТоварыТовары.Номенклатура = &Вал
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВТ_ПоследнийПриход.Ссылка КАК Ссылка
			|ИЗ
			|	ВТ_ПоследнийПриход КАК ВТ_ПоследнийПриход
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВТ_ПоследнийПриход.Дата УБЫВ";
			
			Запрос.УстановитьПараметр("Вал", Стр.Вал);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
				Сообщить("Не удалось связать Вал " + Стр.Вал.Артикул + " с формой " + Стр.Форма.Код + " из строки " + Стр.НомерСтроки + ". Не найден документ прихода по Валу " + Стр.Вал.Артикул);	
			КонецЕсли;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				НаборЗаписей = РегистрыСведений.Лико_ВалыФормы.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
				НаборЗаписей.Прочитать();
				ОбновитьСуществующуюЗапись = Ложь;
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.Вал = Стр.Вал Тогда
						ОбновитьСуществующуюЗапись = Истина;
						Запись.Форма = Стр.Форма; 
					КонецЕсли;
				КонецЦикла;
				Если НЕ ОбновитьСуществующуюЗапись Тогда
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Регистратор = ВыборкаДетальныеЗаписи.Ссылка;
					НоваяЗапись.Период = ВыборкаДетальныеЗаписи.Ссылка.Дата;
					НоваяЗапись.Вал = Стр.Вал;
					НоваяЗапись.Форма = Стр.Форма;
					НоваяЗапись.Заказ = Объект.Ссылка;
				КонецЕсли;
				
				НаборЗаписей.Записать();
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Готово");
	
КонецПроцедуры

&НаКлиенте
Процедура Связать(Команда)
	
	ДатаГлубокихФорм = ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм"),"ЗначениеПараметра");
	Если ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() Тогда
		Если ЭтаФорма.Модифицированность Тогда
			Сообщить("Необходимо записать заказ!");
			Возврат;
		КонецЕсли;
		СвязатьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаНовыйВалПриИзменении(Элемент)
	
	ДатаГлубокихФорм = ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм"),"ЗначениеПараметра");
	Если ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() Тогда
		ТекСтр = Элементы.Цвета.ТекущиеДанные;   
		Если ТекСтр.НовыйВал Тогда
			ТекСтр.Вал = Неопределено;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказатьФормыГлубокой(Команда)
	
	ДатаГлубокихФорм = ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм"),"ЗначениеПараметра");
	Если ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() Тогда
		Если ЭтаФорма.Модифицированность Тогда
			Сообщить("Необходимо записать заказ!");
			Возврат;
		КонецЕсли;
		ПараметрыОткрытия = Новый Структура("Основание",Объект.Ссылка);
		ОткрытьФорму("Документ.Лико_ЗаявкаНаГравировкуВалов.ФормаОбъекта",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьВалНаСервере(РЦ,АртикулНовогоВала,Площадка)
	
	ВидРЦентра = РЦ.ВидРабочегоЦентра;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка,
		|	ПОДСТРОКА(Номенклатура.Артикул, 1, 6) КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Номенклатура.Ссылка = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""ОснасткаВид"")
		|			И (НоменклатураДополнительныеРеквизиты.Значение = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОснастки.Вал))
		|ГДЕ
		|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
		|	И Номенклатура.Артикул ПОДОБНО ""[0-9][0-9][0-9][0-9][0-9][0-9]%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Артикул УБЫВ";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оснастка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйВалОбъект = ВыборкаДетальныеЗаписи.Ссылка.Скопировать();
		Для Каждого Стр Из НовыйВалОбъект.ДополнительныеРеквизиты Цикл
			Если Стр.Свойство.Имя = "ОснасткаВидРЦ_bd9a610a9b884053add3f931c692aa10" Тогда
				Стр.Значение = ВидРЦентра;	
			КонецЕсли;
			Если Стр.Свойство.Имя = "ОснасткаПлощадка" Тогда
				Стр.Значение = Площадка;	
			КонецЕсли;
		КонецЦикла;
		Если АртикулНовогоВала = "" Тогда
			НовыйВалОбъект.Артикул = Строка(Формат(Число(ВыборкаДетальныеЗаписи.Артикул) + 1,"ЧГ="));
		ИначеЕсли ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СокрЛП(АртикулНовогоВала))) Тогда
			Возврат "Вал с Артикулом " + СокрЛП(АртикулНовогоВала) + " уже существует";
		Иначе
			НовыйВалОбъект.Артикул = СокрЛП(АртикулНовогоВала);
		КонецЕсли;
		НовыйВалОбъект.Наименование = "Вал для глубокой печати " + Строка(ВидРЦентра);
		НовыйВалОбъект.Записать(); 
		Возврат НовыйВалОбъект.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура СоздатьВал(Команда)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтр.РабочийЦентр) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаАртикулаВала",ЭтаФорма); 
		ПоказатьВводСтроки(ОписаниеОповещения,,"Введите нужный Артикул нового Вала или нажмите ОК");
	Иначе
		Сообщить("Не заполнен рабочий центр");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаАртикулаВала(РезультатФормы, ПараметрыФормы) Экспорт
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	Если РезультатФормы <> Неопределено Тогда
		НовыйВал = СоздатьВалНаСервере(ТекСтр.РабочийЦентр,РезультатФормы,Объект.Площадка);	
		Если ТипЗнч(НовыйВал) = Тип("Строка") Тогда
			Сообщить(НовыйВал); 
		Иначе
			ТекСтр.Вал = НовыйВал; 
			ДобавитьУсловноеОформлениеЦветаВалФорма(); 
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказатьВыделенные(Команда)
	
	ДатаГлубокихФорм = ЗначениеРеквизита(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаГлубокихФорм"),"ЗначениеПараметра");
	Если ЗначениеЗаполнено(ДатаГлубокихФорм) И ДатаГлубокихФорм < ТекущаяДата() Тогда
		Если ЭтаФорма.Модифицированность Тогда
			Сообщить("Необходимо записать заказ!");
			Возврат;
		КонецЕсли;
		МассивВалФорма = Новый Массив;
		Для Каждого СтрЦвета Из Элементы.Цвета.ВыделенныеСтроки Цикл
			СтрокаЦвета = Элементы.Цвета.ДанныеСтроки(СтрЦвета);
			СтруктураВалФорма = Новый Структура("Вал,Форма",СтрокаЦвета.Вал,СтрокаЦвета.Форма);
			МассивВалФорма.Добавить(СтруктураВалФорма);
		КонецЦикла;
		
		ПараметрыОткрытия = Новый Структура("Заказ,ВалФорма",Объект.Ссылка,МассивВалФорма);
		ОткрытьФорму("Документ.Лико_ЗаявкаНаГравировкуВалов.ФормаОбъекта",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветаФормаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
    
    ПараметрыОткрытия = Новый Структура("Ключ,Заказ", ТекСтр.Форма,Объект.Ссылка);
    
    Обработчик = Новый ОписаниеОповещения("ФормаЗавершениеОткрытия", ЭтотОбъект);
    
    ОткрытьФорму("Справочник.Лико_Формы.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, , , , Обработчик,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ФормаЗавершениеОткрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ТекСтр = Элементы.Цвета.ТекущиеДанные;
	
	Если ТекСтр.Грамматура <> ЗначениеРеквизита(ТекСтр.Форма,"Грамматура") ИЛИ ТекСтр.ПроцентЗаливки <> ЗначениеРеквизита(ТекСтр.Форма,"ПроцентЗаливки") Тогда
		
		ТекСтр.Грамматура = ЗначениеРеквизита(ТекСтр.Форма,"Грамматура") * 0.5;
		ТекСтр.ПроцентЗаливки = ЗначениеРеквизита(ТекСтр.Форма,"ПроцентЗаливки");
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НомерПовторЗаказаПриИзмененииНаСервере()
	
	Модифицированность = Истина;
	
	Если НЕ ЗначениеЗаполнено(ПовторЗаказаНомер) Тогда
		Объект.ПовторЗаказа = Неопределено;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.НомерБезПрефикса = &НомерБезПрефикса";
	
	Запрос.УстановитьПараметр("НомерБезПрефикса", ПовторЗаказаНомер);
	
	УстановитьПривилегированныйРежим(Истина);

	ЗаказСуществует = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		ЗаказСуществует = Истина;
	Иначе
		Сообщить("Не найден заказ с номером " + ПовторЗаказаНомер);
		ПовторЗаказаНомер = Неопределено;
		Объект.ПовторЗаказа = Неопределено;
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Объект.ПовторЗаказа = Выборка.Ссылка;
	Иначе
		Сообщить("У вас нет доступа к заказу с номером " + ПовторЗаказаНомер);
		ПовторЗаказаНомер = Неопределено;
		Объект.ПовторЗаказа = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НомерПовторЗаказаПриИзменении(Элемент)
	НомерПовторЗаказаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура НомерПовторЗаказаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ПовторЗаказа) Тогда
		ПоказатьЗначение(, Объект.ПовторЗаказа);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура НомерПовторЗаказаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	эОтбор.ПравоеЗначение = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ГруппаФизическихЛицВодители.ЗначениеПараметра");
	эОтбор.Использование = Истина;
	
	ПараметрыОтбора = Новый Структура;    
	//ПараметрыОтбора.Вставить("ФиксированныеНастройки", фиксНастройки);
	ПараметрыОтбора.Вставить("РежимВыбора", Истина);
	Если ЗначениеЗаполнено(Объект.ПовторЗаказа) Тогда
		ПараметрыОтбора.Вставить("ТекущаяСтрока", Объект.ПовторЗаказа);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора", ПараметрыОтбора,,,,, Новый ОписаниеОповещения("ВыбранПовторЗаказа", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранПовторЗаказа(Результат, ДопПараметры) Экспорт
	
	Модифицированность = Истина;

	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПовторЗаказа = Результат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ПовторЗаказа) Тогда
		ПовторЗаказаНомер = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ПовторЗаказа, "НомерБезПрефикса");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьФормы(Команда)
	
	Если Объект.ВидЗаказа <> ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.НовыйССохранениемФорм") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаНомераЗаказаДляКопированияФорм",ЭтаФорма); 
		ПоказатьВводСтроки(ОписаниеОповещения,ПовторЗаказаНомер,"Введите номер заказа для копирования форм");
		Возврат;
	КонецЕсли;

	КопироватьФормыНаСервере();
	Модифицированность = Истина;
	ДобавитьУсловноеОформлениеЦветаВалФорма();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераЗаказаДляКопированияФорм(РезультатФормы, ПараметрыФормы) Экспорт
	
	Если РезультатФормы <> Неопределено И РезультатФормы <> "" Тогда
		КопироватьФормыНаСервере(РезультатФормы);
		Модифицированность = Истина;
		ДобавитьУсловноеОформлениеЦветаВалФорма();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КопироватьФормыНаСервере(НомерЗаказаДляКопированияФорм = Неопределено)

	НомерЗаказаДляКопированияФормСсылка = Неопределено;
	Если НомерЗаказаДляКопированияФорм <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.НомерБезПрефикса = &НомерБезПрефикса
		|	И ЗаказКлиента.Дата >= ДАТАВРЕМЯ(2024, 1, 1, 0, 0, 0)";
		
		Запрос.УстановитьПараметр("НомерБезПрефикса", НомерЗаказаДляКопированияФорм);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НомерЗаказаДляКопированияФормСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Если НомерЗаказаДляКопированияФормСсылка <> Неопределено ИЛИ НомерЗаказаДляКопированияФорм = Неопределено Тогда
		Лико_Планирование.КопироватьФормыНаСервере(Объект.Цвета, НомерЗаказаДляКопированияФормСсылка, Объект.ВидЗаказа);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьФормыГлубокой()
	
	СтрокиГлубокаяПечать = Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.ГлубокаяПечать));
	СтрокиГлубокаяЛаминация = Объект.Цвета.НайтиСтроки(Новый Структура("ВидСекции",Справочники.Лико_ВидыСекций.ГлубокаяЛаминация));
	Если СтрокиГлубокаяПечать.Количество() = 0 И СтрокиГлубокаяЛаминация.Количество() = 0 Тогда
		Элементы.ФормыГлубокой.Видимость = Ложь;
	Иначе
		Элементы.ФормыГлубокой.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьАналоги(Команда) // <-- Начало Лико Яцун С. В. 18.03.2024
	//УстановитьПараметрыОстатковКлиент();
	
	Обработка = НайтиВПФ("лк Список рулонных материалов");
	Если Обработка <> Неопределено Тогда
		Если ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
			СвойстваМатериала = ПолучитьСвойстваМатериала(ЗначениеРеквизита(Объект.ОсновнойМатериал,"ОсновнаяНоменклатура"),Объект.Площадка);
		Иначе
			СвойстваМатериала = ПолучитьСвойстваМатериала(Объект.ОсновнойМатериал,Объект.Площадка);
		КонецЕсли;
		BRC = СвойстваМатериала.BRC;
		BRC_ДатаКарантина = СвойстваМатериала.BRC_ДатаКарантина;
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка")); 
		СписокЗначений.Добавить(Объект.Партнер);
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(Обработка);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Дата", Объект.Дата);
		ПараметрыОткрытия.Вставить("ПартнерОтбор", СписокЗначений);
		ПараметрыОткрытия.Вставить("Партнер", Объект.Партнер);  
		ПараметрыОткрытия.Вставить("Заказ", Объект.Ссылка);  
		ПараметрыОткрытия.Вставить("BRC", BRC);
		ПараметрыОткрытия.Вставить("BRC_ДатаКарантина",BRC_ДатаКарантина);
		ПараметрыОткрытия.Вставить("АртикулОтбор", Неопределено);
		ПараметрыОткрытия.Вставить("КодНоменклатурыОтбор",Неопределено);
		ПараметрыОткрытия.Вставить("НарезкаОтбор", Неопределено);
		ПараметрыОткрытия.Вставить("НаименованиеОтбор", Неопределено);
		ПараметрыОткрытия.Вставить("ГруппаМатериаловОтбор", СвойстваМатериала.ГруппаМатериаловОтбор);
		ПараметрыОткрытия.Вставить("ГруппаМатериаловОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПсевдонимОтбор", СвойстваМатериала.ПсевдонимОтбор);
		ПараметрыОткрытия.Вставить("ПсевдонимОтборИспользовать", Ложь);
		ЛицевойМатериалОтбор = Новый  СписокЗначений;
		Если ЗначениеЗаполнено(СвойстваМатериала.ЛицевойМатериалОтбор) Тогда
			ЛицевойМатериалОтбор.Добавить(СвойстваМатериала.ЛицевойМатериалОтбор);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ЛицевойМатериалОтбор", ЛицевойМатериалОтбор);
		ПараметрыОткрытия.Вставить("ЛицевойМатериалОтборИспользовать", Ложь);
		ПокрытиеОтбор = Новый  СписокЗначений;
		Если ЗначениеЗаполнено(СвойстваМатериала.ПокрытиеОтбор) Тогда
			ПокрытиеОтбор.Добавить(СвойстваМатериала.ПокрытиеОтбор);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ПокрытиеОтбор", ПокрытиеОтбор);
		ПараметрыОткрытия.Вставить("ПокрытиеОтборИспользовать", Ложь);
		ПодложкаОтбор = Новый  СписокЗначений;
		Если ЗначениеЗаполнено(СвойстваМатериала.ПодложкаОтбор) Тогда
			ПодложкаОтбор.Добавить(СвойстваМатериала.ПодложкаОтбор);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ПодложкаОтбор", ПодложкаОтбор);
		ПараметрыОткрытия.Вставить("ПодложкаОтборИспользовать", Ложь);
		//ПараметрыОткрытия.Вставить("КодКлеяОтбор", КодКлеяОтбор);
		//ПараметрыОткрытия.Вставить("КодКлеяОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ВидКлеяОтбор", СвойстваМатериала.ВидКлеяОтбор);
		ПараметрыОткрытия.Вставить("ВидКлеяОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ТипКлеяОтбор", СвойстваМатериала.ТипКлеяОтбор);
		ПараметрыОткрытия.Вставить("ТипКлеяОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭтикерованияОтбор", СвойстваМатериала.МинимальнаяТемператураЭтикерованияОтбор);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭтикерованияОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭксплуатацииОтбор", СвойстваМатериала.МинимальнаяТемператураЭксплуатацииОтбор);
		ПараметрыОткрытия.Вставить("МинимальнаяТемператураЭксплуатацииОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("МаксимальнаяТемператураЭксплуатацииОтбор", СвойстваМатериала.МаксимальнаяТемператураЭксплуатацииОтбор); 
		ПараметрыОткрытия.Вставить("МаксимальнаяТемператураЭксплуатацииОтборИспользовать", Ложь);
		//ПараметрыОткрытия.Вставить("КлейДляЛаминацииОтбор", КлейДляЛаминацииОтбор);
		//ПараметрыОткрытия.Вставить("КлейДляЛаминацииОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("НаличиеПраймераОтбор", СвойстваМатериала.НаличиеПраймераОтбор);
		ПараметрыОткрытия.Вставить("НаличиеПраймераОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("КольеИлиМаленькийРадиусОтбор", СвойстваМатериала.КольеИлиМаленькийРадиусОтбор);
		ПараметрыОткрытия.Вставить("КольеИлиМаленькийРадиусОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ЭтикеткаОтбор", СвойстваМатериала.ЭтикеткаОтбор);
		ПараметрыОткрытия.Вставить("ЭтикеткаОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПЕФлаконОтбор", СвойстваМатериала.ПЕФлаконОтбор);
		ПараметрыОткрытия.Вставить("ПЕФлаконОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ПослеЗаморозкиОтбор", СвойстваМатериала.ПослеЗаморозкиОтбор);
		ПараметрыОткрытия.Вставить("ПослеЗаморозкиОтборИспользовать", Ложь);
		ПараметрыОткрытия.Вставить("ЧестныйЗнакОтбор", СвойстваМатериала.ЧестныйЗнакОтбор);
		ПараметрыОткрытия.Вставить("ЧестныйЗнакОтборИспользовать", Ложь);
		Если ЗначениеЗаполнено(Объект.ОсновнойМатериал) И ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
			ПараметрыОткрытия.Вставить("ЦеноваяГруппаОтбор", Объект.ОсновнойМатериал);
			ПараметрыОткрытия.Вставить("ПоЦенновойГруппеОтбор", Ложь);
			ПараметрыОткрытия.Вставить("НоменклатураОтбор", ЗначениеРеквизита(Объект.ОсновнойМатериал,"ОсновнаяНоменклатура"));
			ПоставщикОтбор = Новый  СписокЗначений;
			Если ЗначениеЗаполнено(ЗначениеРеквизита(ЗначениеРеквизита(Объект.ОсновнойМатериал,"ОсновнаяНоменклатура"),"Производитель")) Тогда
				ПоставщикОтбор.Добавить(ЗначениеРеквизита(ЗначениеРеквизита(Объект.ОсновнойМатериал,"ОсновнаяНоменклатура"),"Производитель"));
			КонецЕсли;
			ПараметрыОткрытия.Вставить("ПоставщикОтбор", ПоставщикОтбор);
			ПараметрыОткрытия.Вставить("ПоНоменклатуреОтбор", Ложь);
		ИначеЕсли ЗначениеЗаполнено(Объект.ОсновнойМатериал) И ТипЗнч(Объект.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") Тогда
			ПараметрыОткрытия.Вставить("ЦеноваяГруппаОтбор", ЗначениеРеквизита(Объект.ОсновнойМатериал,"ЦеноваяГруппа"));
			ПараметрыОткрытия.Вставить("ПоЦенновойГруппеОтбор", Ложь);
			ПараметрыОткрытия.Вставить("НоменклатураОтбор", Объект.ОсновнойМатериал);
			ПоставщикОтбор = Новый  СписокЗначений;
			Если ЗначениеЗаполнено(ЗначениеРеквизита(Объект.ОсновнойМатериал,"Производитель")) Тогда
				ПоставщикОтбор.Добавить(ЗначениеРеквизита(Объект.ОсновнойМатериал,"Производитель"));
			КонецЕсли;
			ПараметрыОткрытия.Вставить("ПоставщикОтбор", ПоставщикОтбор);
			ПараметрыОткрытия.Вставить("ПоНоменклатуреОтбор", Ложь);
		Иначе
			ПараметрыОткрытия.Вставить("ЦеноваяГруппаОтбор", Неопределено);
			ПараметрыОткрытия.Вставить("ПоЦенновойГруппеОтбор", Ложь);
			ПараметрыОткрытия.Вставить("НоменклатураОтбор", Неопределено);
			ПараметрыОткрытия.Вставить("ПоставщикОтбор", Неопределено);
			ПараметрыОткрытия.Вставить("ПоНоменклатуреОтбор", Ложь);
		КонецЕсли;
		//ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
		ПараметрыОткрытия.Вставить("Организация", ЗначениеРеквизита(Объект.Площадка,"Организация"));
		ПараметрыОткрытия.Вставить("Площадка", ЗначениеРеквизита(Объект.Площадка,"Организация"));
		ПараметрыОткрытия.Вставить("НаНастройку", Ложь);  
		ПараметрыОткрытия.Вставить("ПроизводственноеПомещениеОтбор", Неопределено);
		ПараметрыОткрытия.Вставить("ИзЗаказа", Истина); 
		ПараметрыОткрытия.Вставить("Лико_Площадка", Объект.Площадка);


		ПараметрыОткрытия.Вставить("ТекстЗапросаОстаткиНоменклатуры", Неопределено);
		ПараметрыДляОткрытия = Новый Структура("ДанныеЗаполненияОтборов",ПараметрыОткрытия);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораАналогаМатериала", ЭтаФорма);  
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаПодбораАналогаМатериала",ПараметрыДляОткрытия,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//ОткрытьФорму("Обработка.Лико_СписокРулонныхМатериалов.Форма.ФормаПодбораАналогаМатериала",ПараметрыДляОткрытия,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 18.03.2024 

&НаКлиенте
Процедура ПослеВыбораАналогаМатериала(Результат, Параметры) Экспорт // <-- Начало Лико Яцун С. В. 25.04.2024    
	
	Если Результат <> Неопределено Тогда
		Если Результат.ВыбраннаяСтрока <> Неопределено Тогда
			Объект.ОсновнойМатериал = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ВыбраннаяСтрока.Номенклатура,"ЦеноваяГруппа");
			ПоказатьКодМатериала();
		КонецЕсли;
		СвойстваМатериалаДляХранилища = Новый Структура("МассивОтборовСвойствМатериалов",Результат.МассивОтборовСвойствМатериалов);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры // <-- Конец Лико Яцун С. В. 25.04.2024 

&НаСервереБезКонтекста
Функция ПолучитьСвойстваМатериала(НоменклатураМатериала,Площадка)
	
	СвойстваМатериала = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_СвойстваМатериала.Ссылка КАК Ссылка,
		|	Лико_СвойстваМатериала.ВерсияДанных КАК ВерсияДанных,
		|	Лико_СвойстваМатериала.ПометкаУдаления КАК ПометкаУдаления,
		|	Лико_СвойстваМатериала.Код КАК Код,
		|	Лико_СвойстваМатериала.Наименование КАК Наименование,
		|	Лико_СвойстваМатериала.Номенклатура КАК Номенклатура,
		|	Лико_СвойстваМатериала.ГруппаМатериалов КАК ГруппаМатериалов,
		|	Лико_СвойстваМатериала.Псевдоним КАК Псевдоним,
		|	Лико_СвойстваМатериала.ЛицевойМатериал КАК ЛицевойМатериал,
		|	Лико_СвойстваМатериала.КодКлея КАК КодКлея,
		|	Лико_СвойстваМатериала.КлейДляЛаминации КАК КлейДляЛаминации,
		|	Лико_СвойстваМатериала.ПокрытиеРулонногоМатериала КАК ПокрытиеРулонногоМатериала,
		|	Лико_СвойстваМатериала.НаличиеПраймера КАК НаличиеПраймера,
		|	Лико_СвойстваМатериала.КольеИлиМаленькийРадиус КАК КольеИлиМаленькийРадиус,
		|	Лико_СвойстваМатериала.Этикетка КАК Этикетка,
		|	Лико_СвойстваМатериала.ПЕФлакон КАК ПЕФлакон,
		|	Лико_СвойстваМатериала.ПослеЗаморозки КАК ПослеЗаморозки,
		|	Лико_СвойстваМатериала.ЧестныйЗнак КАК ЧестныйЗнак,
		|	Лико_СвойстваМатериала.Примечание КАК Примечание,
		|	Лико_СвойстваМатериала.Подложка КАК Подложка,
		|	Лико_СвойстваМатериала.Предопределенный КАК Предопределенный,
		|	Лико_СвойстваМатериала.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.Лико_СвойстваМатериала КАК Лико_СвойстваМатериала
		|ГДЕ
		|	Лико_СвойстваМатериала.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураМатериала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		СвойстваМатериала.Вставить("ГруппаМатериаловОтбор",ВыборкаДетальныеЗаписи.ГруппаМатериалов);
		СвойстваМатериала.Вставить("ПсевдонимОтбор",ВыборкаДетальныеЗаписи.Псевдоним);
		СвойстваМатериала.Вставить("ЛицевойМатериалОтбор",ВыборкаДетальныеЗаписи.ЛицевойМатериал);
		СвойстваМатериала.Вставить("ПокрытиеОтбор",ВыборкаДетальныеЗаписи.ПокрытиеРулонногоМатериала);
		СвойстваМатериала.Вставить("ПодложкаОтбор",ВыборкаДетальныеЗаписи.Подложка);
		СвойстваМатериала.Вставить("ВидКлеяОтбор",ВыборкаДетальныеЗаписи.КодКлея.ВидКлея);
		СвойстваМатериала.Вставить("ТипКлеяОтбор",ВыборкаДетальныеЗаписи.КодКлея.ТипКлея);
		СвойстваМатериала.Вставить("МинимальнаяТемператураЭтикерованияОтбор",ВыборкаДетальныеЗаписи.КодКлея.МинимальнаяТемператураЭтикерования);
		СвойстваМатериала.Вставить("МинимальнаяТемператураЭксплуатацииОтбор",ВыборкаДетальныеЗаписи.КодКлея.МинимальнаяТемператураЭксплуатации);
		СвойстваМатериала.Вставить("МаксимальнаяТемператураЭксплуатацииОтбор",ВыборкаДетальныеЗаписи.КодКлея.МаксимальнаяТемператураЭксплуатации);
		СвойстваМатериала.Вставить("НаличиеПраймераОтбор",ВыборкаДетальныеЗаписи.НаличиеПраймера);
		СвойстваМатериала.Вставить("КольеИлиМаленькийРадиусОтбор",ВыборкаДетальныеЗаписи.КольеИлиМаленькийРадиус);
		СвойстваМатериала.Вставить("ЭтикеткаОтбор",ВыборкаДетальныеЗаписи.Этикетка);
		СвойстваМатериала.Вставить("ПЕФлаконОтбор",ВыборкаДетальныеЗаписи.ПЕФлакон);
		СвойстваМатериала.Вставить("ПослеЗаморозкиОтбор",ВыборкаДетальныеЗаписи.ПослеЗаморозки);
		СвойстваМатериала.Вставить("ЧестныйЗнакОтбор",ВыборкаДетальныеЗаписи.ЧестныйЗнак); 
	Иначе
		СвойстваМатериала.Вставить("ГруппаМатериаловОтбор",Неопределено);
		СвойстваМатериала.Вставить("ПсевдонимОтбор",Неопределено);
		СвойстваМатериала.Вставить("ЛицевойМатериалОтбор",Неопределено);
		СвойстваМатериала.Вставить("ПокрытиеОтбор",Неопределено);
		СвойстваМатериала.Вставить("ПодложкаОтбор",Неопределено);
		СвойстваМатериала.Вставить("ВидКлеяОтбор",Неопределено);
		СвойстваМатериала.Вставить("ТипКлеяОтбор",Неопределено);
		СвойстваМатериала.Вставить("МинимальнаяТемператураЭтикерованияОтбор",Неопределено);
		СвойстваМатериала.Вставить("МинимальнаяТемператураЭксплуатацииОтбор",Неопределено);
		СвойстваМатериала.Вставить("МаксимальнаяТемператураЭксплуатацииОтбор",Неопределено);
		СвойстваМатериала.Вставить("НаличиеПраймераОтбор",Неопределено);
		СвойстваМатериала.Вставить("КольеИлиМаленькийРадиусОтбор",Неопределено);
		СвойстваМатериала.Вставить("ЭтикеткаОтбор",Неопределено);
		СвойстваМатериала.Вставить("ПЕФлаконОтбор",Неопределено);
		СвойстваМатериала.Вставить("ПослеЗаморозкиОтбор",Неопределено);
		СвойстваМатериала.Вставить("ЧестныйЗнакОтбор",Неопределено); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УправлениеСвойствами.ЗначениеСвойства(Площадка.Организация,"Лико_УчетНаСкладеПоBRC")) Тогда 
		BRC = УправлениеСвойствами.ЗначениеСвойства(Площадка.Организация,"Лико_УчетНаСкладеПоBRC");
	Иначе
		BRC = Ложь;
	КонецЕсли;
	
	СвойстваМатериала.Вставить("BRC",BRC);
	
	Если BRC Тогда
		BRC_ДатаКарантина = ТекущаяДата() - Справочники.Лико_ПредопределенныеЗначения.BRC_ДлительностьКарантинаЧас.ЗначениеПараметра*60*60;
		СвойстваМатериала.Вставить("BRC_ДатаКарантина",BRC_ДатаКарантина);
	Иначе
		СвойстваМатериала.Вставить("BRC_ДатаКарантина",ТекущаяДата());
	КонецЕсли;
	
	Возврат СвойстваМатериала;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВБЗСебеНаСервере(Заказ)
	
	ВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатная форма ""Внутренний бланк заказа""");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ВПФ);
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Заказ);
	ТабДокумент = ВнешняяОбработкаОбъект.ПечатьВБЗ(МассивОбъектов);
	ИмяФайла = КаталогВременныхФайлов() + "ВБЗ - " + Заказ.НомерБезПрефикса + ".pdf";
	//ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
	ТабДокумент[0].ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	ТекПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Лико_Планирование.ОтправитьПисьмо("", "ВБЗ - " + Заказ.НомерБезПрефикса,ТекПользователь,,,,,ИмяФайла);
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВБЗСебе(Команда)
	ВБЗСебеНаСервере(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ЦветаФормаНомерЛинксОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Цвета.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текст) Тогда
		Текст = СокрЛП(Формат(Число(Текст),"ЧГ=0"));
		СпрФорма = ПолучитьФормуНаСервере(Текст);
		Если ЗначениеЗаполнено(СпрФорма) Тогда 
			УдалитьСписокЗначений("Формы", ТекущиеДанные.КлючСтроки);
			стр = Объект.Формы.Добавить();
			стр.Значение = СпрФорма;
			стр.КлючСтроки = ТекущиеДанные.КлючСтроки;
			текущиеДанные.Форма = СпрФорма;
			ТекущиеДанные.ФормаНомерЛинкс = Текст;
			ДобавитьУсловноеОформлениеЦветаВалФорма();
		ИначеЕсли ПлощадкаЛинкс(Объект.Площадка) И СтрДлина(Текст) <= 3 Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("Идентификатор", ТекущиеДанные.ПолучитьИдентификатор());
			ДопПараметры.Вставить("КодЛинкс", Текст);
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОСозданииНовойФормыЛинкс", ЭтотОбъект,ДопПараметры),"Нет общей формы с таким номером Линкс, создать?",РежимДиалогаВопрос.ДаНет);
			Возврат;
		Иначе
			ТекущиеДанные.ФормаНомерЛинкс = Неопределено;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаЗаказНовойОснасткиПриИзменении(Элемент)
	ЗаписатьЦветаВРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	ВыполняемаяОбработка = НайтиВПФ("Обработка ""Загрузка данных из внешних файлов для заказа""");
	Если ЗначениеЗаполнено(ВыполняемаяОбработка) Тогда
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВыполняемаяОбработка);
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", , ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "ВнешняяОбработка.ЗагрузкаДанныхИзВнешнихФайловЗаказЦвета.Форма.Форма" Тогда
		ПолучитьЗагруженныеДанныеИзХранилища(ВыбранноеЗначение.АдресЦветовВХранилище);
		ЗаписатьЦветаВРаботы();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеДанныеИзХранилища(АдресЦветовВХранилище)
	
	ЦветаИзХранилища = ПолучитьИзВременногоХранилища(АдресЦветовВХранилище);
	
	ОбновитьОтображениеФорм = Ложь;
	
	Для каждого Строка из ЦветаИзХранилища Цикл
		НайденнаяСтрока = Объект.Цвета.НайтиСтроки(Новый Структура("НомерСтроки",Строка.НомерСтроки));
		
		Если НайденнаяСтрока.Количество() = 0 Тогда
			Возврат;
		Иначе
			НоваяСтрока = НайденнаяСтрока[0];	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Название) Тогда
			НоваяСтрока.Название = Строка.Название;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			Если НоваяСтрока.ТипКраски <> НоваяСтрока.Номенклатура.ЦеноваяГруппа Тогда
				НоваяСтрока.ТипКраски = НоваяСтрока.Номенклатура.ЦеноваяГруппа;	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Анилокс) Тогда
			НоваяСтрока.Анилокс = Строка.Анилокс;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ТрафаретнаяСетка) Тогда
			НоваяСтрока.ТрафаретнаяСетка = Строка.ТрафаретнаяСетка;
			ГрамматураСетки = НоваяСтрока.ТрафаретнаяСетка.Грамматура;
			Если ЗначениеЗаполнено(ГрамматураСетки)  Тогда
				НоваяСтрока.Грамматура = ГрамматураСетки;
			КонецЕсли;
		КонецЕсли;
		
		СпрФорма = ?(ЗначениеЗаполнено(Строка.ФормаНомерЛинкс),ПолучитьФормуНаСервере(Строка.ФормаНомерЛинкс),Неопределено);
		Если ЗначениеЗаполнено(СпрФорма) Тогда
			НоваяСтрока.Форма = СпрФорма;	
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ВидСекции) И ЗначениеЗаполнено(Строка.ФормаНомерЛинкс) Тогда
			ВидПечати = НоваяСтрока.ВидСекции.ВидПечати;  
			Если ВидПечати = Справочники.Лико_ВидыПечати.Флексо Тогда 
				НоваяФорма = СоздатьНовуюФорму(НоваяСтрока.ВидСекции, НоваяСтрока.типцвета1, НоваяСтрока.типкраски, НоваяСтрока.название,Строка.ФормаНомерЛинкс);
				НоваяСтрока.форма = НоваяФорма;
				//Необходимо записать значение в табличную часть "Формы"
				стрФ = Объект.Формы.Добавить();
				стрФ.Ключстроки = НоваяСтрока.ключстроки;
				стрФ.Значение = НоваяФорма;  
			КонецЕсли;        		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Форма) Тогда
			ОбновитьОтображениеФорм = Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Если ОбновитьОтображениеФорм Тогда
		ДобавитьУсловноеОформлениеЦветаВалФорма();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомераПовторовНаСервере()
	
	НомераЗаказов = "";
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Стр Из Объект.Товары Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаТовары.Ссылка.НомерБезПрефикса КАК НомерБезПрефикса
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура = &Номенклатура
		|	И ЗаказКлиентаТовары.Ссылка.ДатаОтправкиВРаботу <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
		|	И ЗаказКлиентаТовары.Ссылка <> &Ссылка
		|	И ЗаказКлиентаТовары.Ссылка.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Найти(НомераЗаказов,Выборка.НомерБезПрефикса) = 0 Тогда
				НомераЗаказов = ?(ЗначениеЗаполнено(НомераЗаказов),НомераЗаказов + ", " + Выборка.НомерБезПрефикса,Выборка.НомерБезПрефикса); 
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
	Объект.Комментарий = ?(ЗначениеЗаполнено(Объект.Комментарий),Объект.Комментарий + Символы.ПС + НомераЗаказов,НомераЗаказов); 
	Модифицированность = Истина;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНомераПовторов(Команда)
	ЗаполнитьНомераПовторовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Пантоны(Команда)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ЗначениеОтбора = Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура);
		ПараметрыОткрытияФормы = Новый Структура("Отбор", ЗначениеОтбора);
		ОткрытьФорму("РегистрСведений.Лико_ПантоныНоменклатуры.ФормаСписка",ПараметрыОткрытияФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПантоныНаСервере()
	
	ТЗ = Объект.Товары.Выгрузить(,"Номенклатура");
	ТЗ.Свернуть("Номенклатура");
	МассивНоменклатур = ТЗ.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПантоныНоменклатуры.ВидСекции КАК ВидСекции,
		|	Лико_ПантоныНоменклатуры.Пантон КАК Пантон
		|ИЗ
		|	РегистрСведений.Лико_ПантоныНоменклатуры КАК Лико_ПантоныНоменклатуры
		|ГДЕ
		|	Лико_ПантоныНоменклатуры.Номенклатура В(&Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ПантоныНоменклатуры.ВидСекции,
		|	Лико_ПантоныНоменклатуры.Пантон";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатур);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Объект.Цвета.НайтиСтроки(Новый Структура("Название",ВыборкаДетальныеЗаписи.Пантон)).Количество() = 0 Тогда
			НС = Объект.Цвета.Добавить();
			НС.Название = ВыборкаДетальныеЗаписи.Пантон;
			НС.ВидСекции = ВыборкаДетальныеЗаписи.ВидСекции;
			Если Объект.Цвета.Количество() <> 0 Тогда
				НС.РабочийЦентр = Объект.Цвета[0].РабочийЦентр;
			КонецЕсли;
			НС.НомерПроката = 1;
			НС.НомерВарианта = 1;
			НС.ВидТМЦ = Справочники.Лико_ВидыТМЦ.Краска;
			НС.ТипЦвета1 = Справочники.Лико_ТипыЦвета.Pmc;
			НС.КлючСтроки = Новый УникальныйИдентификатор; 
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЭтаФорма.Модифицированность Тогда
		ЗаполнитьВидОснастка();
		ЗаполнитьТипЗаливка(); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПантоны(Команда)
	ЗаполнитьПантоныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ИмяТЧ = Элемент.Имя;
	МассивСтрок = Новый Массив;
	Если Элементы[ИмяТЧ].ВыделенныеСтроки.Количество() > 0 Тогда
		МассивСтрок = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы[ИмяТЧ].ВыделенныеСтроки);
	ИначеЕсли Элементы[ИмяТЧ].ТекущаяСтрока <> Неопределено Тогда
		МассивСтрок.Добавить(Элементы[ИмяТЧ].ТекущаяСтрока);
	Иначе
		Сообщить("Не выбраны строки для удаления");
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ИмяТЧ,ВыделенныеСтроки", ИмяТЧ, МассивСтрок);
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопросОбУдаленииСтроки", ЭтотОбъект, ДопПараметры), "Вы действительно хотите удалить " + ?(МассивСтрок.Количество() > 1, "строки?", "строку?"), РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Отмена, "Удаление строк");

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбУдаленииСтроки(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для каждого ИдСтроки из ДопПараметры.ВыделенныеСтроки Цикл
			СтрокаДляУдаления = Объект[ДопПараметры.ИмяТЧ].НайтиПоИдентификатору(ИдСтроки);
			Если СтрокаДляУдаления <> Неопределено Тогда
				Если ДопПараметры.ИмяТЧ = "Цвета" Тогда
					УдалитьСписокЗначений("Формы", СтрокаДляУдаления.КлючСтроки);
				КонецЕсли;
				Объект[ДопПараметры.ИмяТЧ].Удалить(Объект[ДопПараметры.ИмяТЧ].Индекс(СтрокаДляУдаления));
				Модифицированность = Истина;
			КонецЕсли; 
		КонецЦикла;
		Если ДопПараметры.ИмяТЧ = "Цвета" Тогда
			ЦветаПослеУдаления();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПлан(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначениеОтбора = Новый Структура("ЗаказКлиента", Объект.Ссылка);
		ПараметрыОткрытияФормы = Новый Структура("Отбор", ЗначениеОтбора);
		ОткрытьФорму("РегистрСведений.Лико_Затраты.ФормаСписка",ПараметрыОткрытияФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПроизводства(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначениеОтбора = Новый Структура("Заказ", Объект.Ссылка);
		ПараметрыОткрытияФормы = Новый Структура("Отбор", ЗначениеОтбора);
		ОткрытьФорму("РегистрСведений.Лико_ПараметрыПроизводстваЗаказа.ФормаСписка",ПараметрыОткрытияФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПричиныЗамены(Команда)
	
	ЭтаФорма.Элементы.ГруппаПричиныЗамены.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыЗаказа(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначениеОтбора = Новый Структура("Заказ", Объект.Ссылка);
		ПараметрыОткрытияФормы = Новый Структура("Отбор", ЗначениеОтбора);
		ОткрытьФорму("РегистрСведений.Лико_ЭтапыЗаказа.ФормаСписка",ПараметрыОткрытияФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПараметрыТипа(Команда)
	
	Если Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка") Тогда
		ЭтаФорма.Элементы.ГруппаТермоусадка1.Показать();
	ИначеЕсли Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Пакеты") Тогда
		ЭтаФорма.Элементы.ГруппаПакеты4.Показать();
	КонецЕсли;       
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПараметрыВида(Команда)
	
	Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Пробник") Тогда
		ЭтаФорма.Элементы.ГруппаПробник1.Показать(); 
	ИначеЕсли Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.Шаблон") Тогда	
		ЭтаФорма.Элементы.ГруппаШаблон.Показать(); 
	КонецЕсли;       
	
КонецПроцедуры

&НаКлиенте
Процедура КнижкаПриИзменении(Элемент)
	Если Объект.Книжка Тогда
		Элементы.КоличествоЛистовКнижки.Видимость = Истина;
	Иначе
		Элементы.КоличествоЛистовКнижки.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКНомеру(Команда)    
	Раздел = "НомерБезПрефикса";	
	ПодключитьОбработчикОжидания("ПерейтиВниз",0.1,Истина); 	
КонецПроцедуры  

&НаКлиенте
Процедура ПерейтиКЭтикеткам(Команда)    
	Раздел = "ВидыЭтикеток";	
	ПодключитьОбработчикОжидания("ПерейтиВниз",0.1,Истина); 	
КонецПроцедуры    

&НаКлиенте
Процедура ПерейтиКМатериалу(Команда)    
	Раздел = "ГруппаМатериал";	
	ПодключитьОбработчикОжидания("ПерейтиВниз",0.1,Истина); 	
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКЦветам(Команда)    
	Раздел = "ГруппаЦвета";	
	ПодключитьОбработчикОжидания("ПерейтиВниз",0.1,Истина); 	
КонецПроцедуры



&НаКлиенте
Процедура ПерейтиКУпаковке(Команда)   
	ТекущийЭлемент = Элементы.ГруппаУпаковка;

	//Раздел = "ГруппаУпаковка";	
	//ПодключитьОбработчикОжидания("ПерейтиВниз",0.1,Истина); 	
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиККомментариям(Команда)
	ТекущийЭлемент = Элементы.Комментарий;
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКПараметрамПечатиИВырубки(Команда)
	Раздел = "ГруппаПараметрыШтампа";	
	ПодключитьОбработчикОжидания("ПерейтиВниз",0.1,Истина); 

КонецПроцедуры  

&НаКлиенте
Процедура ПерейтиВниз() Экспорт
	ТекущийЭлемент = Элементы.Комментарий;
	
	ПодключитьОбработчикОжидания("ПерейтиКРазделу",0.1,Истина); 

КонецПроцедуры 

 &НаКлиенте
Процедура ПерейтиКРазделу() Экспорт
	ТекущийЭлемент = Элементы[Раздел];	
КонецПроцедуры

&НаСервере
Процедура ТоварыНаправлениеПриИзмененииНаСервере()
	текстр = Элементы.Товары.ТекущиеДанные;

	Если ЗначениеЗаполнено(текстр.Направление) Тогда
		
		Если Не текстр.Направление.ФайлКартинки.Пустая() Тогда
			текстр.КартинкаНамотки = НавигационнаяСсылкаКартинки(текстр.Направление.ФайлКартинки, УникальныйИдентификатор);
		Иначе
			текстр.КартинкаНамотки = "";
		Конецесли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаправлениеПриИзменении(Элемент)
	текстр = Элементы.Товары.ТекущиеДанные;
	Если текстр <> Неопределено Тогда 
		Если ЗначениеЗаполнено(текстр.Направление) Тогда 
			Идентификатор = текстр.ПолучитьИдентификатор();
			ПоказатьКартинкуНамотки(Идентификатор); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоКартаСнятияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Производство.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.КартаСнятияНомер = ЗначениеРеквизита(ТекДанные.КартаСнятия,"Номер");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоКартаПерерасходаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Производство.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.КартаПерерасходаНомер = ЗначениеРеквизита(ТекДанные.КартаПерерасхода,"Номер");	
		Если ЗначениеЗаполнено(ТекДанные.КартаПерерасходаПриПечати) Тогда
			ТекДанные.ПодтвержденныйПерерасход = ЗначениеРеквизита(ТекДанные.КартаПерерасхода,"КоличествоПодтверждено") + ЗначениеРеквизита(ТекДанные.КартаПерерасходаПриПечати,"КоличествоПодтверждено");
		Иначе
			ТекДанные.ПодтвержденныйПерерасход = ЗначениеРеквизита(ТекДанные.КартаПерерасхода,"КоличествоПодтверждено");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПроизводствоКартаПерерасходаПриПечатиПриИзменении(Элемент)
	
	ТекДанные = Элементы.Производство.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.КартаПерерасходаПриПечатиНомер = ЗначениеРеквизита(ТекДанные.КартаПерерасходаПриПечати,"Номер");	
		Если ЗначениеЗаполнено(ТекДанные.КартаПерерасхода) Тогда
			ТекДанные.ПодтвержденныйПерерасход = ЗначениеРеквизита(ТекДанные.КартаПерерасхода,"КоличествоПодтверждено") + ЗначениеРеквизита(ТекДанные.КартаПерерасходаПриПечати,"КоличествоПодтверждено");
		Иначе
			ТекДанные.ПодтвержденныйПерерасход = ЗначениеРеквизита(ТекДанные.КартаПерерасходаПриПечати,"КоличествоПодтверждено");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьНоменклатуруGtinКодЭтикеткиЗаказчика(Лико_Gtin,Лико_КодЭтикеткиЗаказчика)
	
	Лико_GtinВНоменклатуре = Объект.Партнер.Лико_GtinВНоменклатуре И ЗначениеЗаполнено(Лико_Gtin);
	Лико_КодЭтЗаказчикаВНоменклатуре = Объект.Партнер.Лико_КодЭтЗаказчикаВНоменклатуре И ЗначениеЗаполнено(Лико_КодЭтикеткиЗаказчика);
	
	Если НЕ Лико_GtinВНоменклатуре И НЕ Лико_КодЭтЗаказчикаВНоменклатуре Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &GtinВНоменклатуре
		|				ТОГДА Номенклатура.Лико_Gtin = &Лико_Gtin
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &КодЭтикеткиЗаказчикаВНоменклатуре
		|				ТОГДА Номенклатура.Лико_КодЭтикеткиЗаказчика = &Лико_КодЭтикеткиЗаказчика
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Лико_Gtin", Лико_Gtin);
	Запрос.УстановитьПараметр("Лико_КодЭтикеткиЗаказчика", Лико_КодЭтикеткиЗаказчика);
	Запрос.УстановитьПараметр("GtinВНоменклатуре", Лико_GtinВНоменклатуре);
	Запрос.УстановитьПараметр("КодЭтикеткиЗаказчикаВНоменклатуре", Лико_КодЭтЗаказчикаВНоменклатуре);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла; 
	
	Возврат Неопределено;
	
КонецФункции


&НаКлиенте
Процедура ТоварыGtinПриИзменении(Элемент)
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеРеквизита(Объект.Партнер, "Лико_GtinВНоменклатуре") И ЗначениеЗаполнено(СокрЛП(ТекСтр.Gtin)) Тогда
		НоменклатураGtinКодЭтикеткиЗаказчика = ПолучитьНоменклатуруGtinКодЭтикеткиЗаказчика(СокрЛП(ТекСтр.Gtin),"");
		
		Если НоменклатураGtinКодЭтикеткиЗаказчика <> Неопределено Тогда
			ДругаяНоменклатура = ТекСтр.Номенклатура <> НоменклатураGtinКодЭтикеткиЗаказчика;
			Если ЗначениеРеквизита(Объект.Партнер, "Лико_КодЭтЗаказчикаВНоменклатуре") Тогда
				ТекСтр.КодЭтикеткиЗаказчика = ЗначениеРеквизита(НоменклатураGtinКодЭтикеткиЗаказчика, "Лико_КодЭтикеткиЗаказчика");	
			КонецЕсли;
			Если ДругаяНоменклатура Тогда
				ТекСтр.Номенклатура = НоменклатураGtinКодЭтикеткиЗаказчика;	
				ТоварыНоменклатураПриИзменении(Неопределено);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКодЭтикеткиЗаказчикаПриИзменении(Элемент)
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеРеквизита(Объект.Партнер, "Лико_КодЭтЗаказчикаВНоменклатуре") И ЗначениеЗаполнено(СокрЛП(ТекСтр.КодЭтикеткиЗаказчика)) Тогда
		НоменклатураGtinКодЭтикеткиЗаказчика = ПолучитьНоменклатуруGtinКодЭтикеткиЗаказчика("",СокрЛП(ТекСтр.КодЭтикеткиЗаказчика));
		
		Если НоменклатураGtinКодЭтикеткиЗаказчика <> Неопределено Тогда
			ДругаяНоменклатура = ТекСтр.Номенклатура <> НоменклатураGtinКодЭтикеткиЗаказчика;
			Если ЗначениеРеквизита(Объект.Партнер, "Лико_GtinВНоменклатуре") Тогда
				ТекСтр.Gtin = ЗначениеРеквизита(НоменклатураGtinКодЭтикеткиЗаказчика, "Лико_Gtin");	
			КонецЕсли;
			Если ДругаяНоменклатура Тогда
				ТекСтр.Номенклатура = НоменклатураGtinКодЭтикеткиЗаказчика;
				ТоварыНоменклатураПриИзменении(Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьРасчетЗаказа1С(Команда)
	ВыполняемаяОбработка=НайтиВПФ("Печатная форма ""Расчет заказа 1С""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ПечатнаяФормаРасчетЗаказа_1С";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия); 
КонецПроцедуры


&НаКлиенте
Процедура РучнойВводНарезкиПриИзменении(Элемент) // <-- Начало Лико Яцун С. В. 22.01.2026
	
	Эл = Элементы.Нарезка;
	ТекШирина = Эл.Ширина; 
	ТекЦвет = Эл.ЦветФона;
	Эл.ТолькоПросмотр = НЕ Объект.РучнойВводНарезки;
	Если Эл.ТолькоПросмотр Тогда
		Эл.Вид = ВидПоляФормы.ПолеНадписи;
		Эл.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
		Эл.Ширина = ТекШирина;
		Эл.ЦветФона = ТекЦвет;
		Элементы.НарезкаРасчет.Гиперссылка = Истина;
	Иначе
		Если Эл.Вид <> ВидПоляФормы.ПолеВвода Тогда
			Эл.Вид = ВидПоляФормы.ПолеВвода;
			Эл.Ширина = ТекШирина;
			Эл.ЦветФона = ТекЦвет;
		КонецЕсли;
		Элементы.НарезкаРасчет.Гиперссылка = Ложь;
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 22.01.2026


&НаКлиенте
Процедура ПоказатьПараметрыЧестногоЗнака(Команда)

	Если Объект.ЧестныйЗнак Тогда
		ЭтаФорма.Элементы.ГруппаЧестныйЗнак.Показать(); 
	КонецЕсли;       

КонецПроцедуры


&НаКлиенте
Процедура ЗаказчикЭмиссииЧЗПриИзменении(Элемент)
	
	Если Объект.ЗаказчикЭмиссииЧЗ <> ПредопределенноеЗначение("Перечисление.Лико_ЗаказчикиЭмиссииЧЗ.Окил") Тогда
		Объект.ЭмитентЧЗ = Неопределено;
		Объект.СтранаТовараЧЗ = Неопределено;
		Объект.ТипКодаЧЗ = Неопределено;
		Объект.ТипМаркировкиЧЗ = Неопределено;
		Элементы.ЭмитентЧЗ.Видимость = Ложь;	
		Элементы.СтранаТовараЧЗ.Видимость = Ложь;	
		Элементы.ТипКодаЧЗ.Видимость = Ложь;	
		Элементы.ТипМаркировкиЧЗ.Видимость = Ложь;	
	ИначеЕсли Объект.ЗаказчикЭмиссииЧЗ = ПредопределенноеЗначение("Перечисление.Лико_ЗаказчикиЭмиссииЧЗ.Окил") Тогда
		Элементы.ЭмитентЧЗ.Видимость = Истина;	
		Элементы.СтранаТовараЧЗ.Видимость = Истина;	
		Элементы.ТипКодаЧЗ.Видимость = Истина;	
		Элементы.ТипМаркировкиЧЗ.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НарезкаРасчетНажатие(Элемент)

	Если ЗначениеЗаполнено(Объект.РабочийЦентр) И НЕ ЗначениеЗаполнено(ВидРЦ) Тогда
		ВидРЦ = ЗначениеРеквизита(Объект.РабочийЦентр,"ВидРабочегоЦентра"); 
	КонецЕсли;
	РасчетнаяНарезкаДанные = ПолучитьРасчетнуюНарезку();
	Объект.НарезкаРасчетная = РасчетнаяНарезкаДанные.РасчетнаяНарезкаСсылка;
	Объект.Нарезка = Объект.НарезкаРасчетная;
	РасчитатьТиражМетраж();
	ПоказатьДоходностьРентабельность();
	Для каждого стр из Объект.Отгрузки Цикл
		стр.КвадратныйМетраж = стр.ПогонныйМетраж* ПолучитьНарезкуНасервере(Объект.Нарезка);
	КонецЦикла;

КонецПроцедуры




