#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура СформироватьЗаписи(Объект,Отказ) Экспорт 
	
УстановитьПривилегированныйРежим(Истина);	
	Результат = Неопределено;
	
	
	Если Справочники.Лико_ПравилаПеремещенияТМЦ.СтартСистемы(Объект.Дата) Тогда
		
		Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(Объект,Отказ,Результат);  
		
		Если ТипЗнч(Результат)=Тип("Структура") И Результат.Свойство("ПроверкаПравил") Тогда
			
			Если ТипЗнч(Результат.ПроверкаПравил)=Тип("ТаблицаЗначений") Тогда
				
				Для каждого Товар Из Результат.ПроверкаПравил Цикл 
					
					НаборЗаписей = РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
					НаборЗаписей.Отбор.Серия.Установить(Товар.Серия); 
					
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество()>0 Тогда
						
						Для каждого Запись Из НаборЗаписей Цикл 
							
							
							ОтправкаСообщения = Запись.ОтправкаСообщения;						
							ЗаполнитьЗначенияСвойств(Запись, Товар);
							Запись.Документ = Объект.Ссылка;
							Запись.Серия = Товар.Серия; 

							
						КонецЦикла; 
					Иначе
						
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, Товар);
						НоваяЗапись.Документ = Объект.Ссылка;
						НоваяЗапись.Серия = Товар.Серия; 

												
					КонецЕсли;
					
					НаборЗаписей.Записать();	
					
					
					
				КонецЦикла;	
				
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

Процедура СформироватьЗаписиЗаявкаНаСклад(Объект,Отказ) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Если ТипЗнч(Объект.Ссылка)<>Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не Справочники.Лико_ПравилаПеремещенияТМЦ.СтартСистемы(Объект.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.НеИспользоватьПравило Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(Объект,Отказ,Результат);  
	
	
	
	Если ТипЗнч(Результат)=Тип("Структура") И Результат.Свойство("ПроверкаПравил") Тогда
		
		Если ТипЗнч(Результат.ПроверкаПравил)=Тип("ТаблицаЗначений") Тогда
			
			Для каждого Товар Из Результат.ПроверкаПравил Цикл 
				
				Если Не ЗначениеЗаполнено(Товар.Правило) Тогда 
					Продолжить;
				КонецЕсли;
				
				
				НаборЗаписей = РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
				НаборЗаписей.Отбор.Серия.Установить(Товар.Серия); 
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество()>0 Тогда
					Для каждого Запись Из НаборЗаписей Цикл
						
						ЗаполнитьЗначенияСвойств(Запись, Товар);
						Запись.НеИспользоватьПравило = Истина;
						
						Если Объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
							
							Запись.АдресХраненияНовый =  Объект.РабочийЦентр.ЛикоЯчейка;
							
						Иначе
							Запись.АдресХраненияНовый = Объект.Адрес;  
						КонецЕсли;
						
						Запись.Стратегия = Запись.Правило.Стратегия; 
						
						Запись.Комментарий = Справочники.Лико_ПравилаПеремещенияТМЦ.ТекстОтменыПравила(Запись.Правило,Запись.Серия.ЯССМ_ОбъектНоменклатуры);	
						
						
					КонецЦикла;
				Иначе
					
					
					НоваяЗапись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, Товар);
					НоваяЗапись.НеИспользоватьПравило = Истина;
					
					Если Объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
						
						НоваяЗапись.АдресХраненияНовый =  Объект.РабочийЦентр.ЛикоЯчейка;
						
					Иначе
						НоваяЗапись.АдресХраненияНовый = Объект.Адрес;  
					КонецЕсли;
					
					
					
					НоваяЗапись.Документ = Объект.Ссылка;
					
					НоваяЗапись.Серия = Товар.Серия;
					
					НоваяЗапись.Стратегия = НоваяЗапись.Правило.Стратегия; 
					НоваяЗапись.Комментарий = Справочники.Лико_ПравилаПеремещенияТМЦ.ТекстОтменыПравила(НоваяЗапись.Правило,НоваяЗапись.Серия.ЯССМ_ОбъектНоменклатуры);	
				КонецЕсли;
				
				
				НаборЗаписей.Записать();
				
				
				
				
			КонецЦикла;	
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура УстановкаПризнакаОтправкиСообщения(ДокументСсылка,Серия)  Экспорт //+--->Лико m.shenderov 02.03.2026
	НаборЗаписей = РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
	НаборЗаписей.Отбор.Серия.Установить(Серия); 
	
	НаборЗаписей.Прочитать(); 
	
	Для каждого Запись Из НаборЗаписей Цикл
		Запись.ОтправкаСообщения=Истина;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры //-<---Лико m.shenderov 02.03.2026





#КонецОбласти

#КонецЕсли