
&НаКлиенте
Процедура Лико_ДбавитьФайлПосле(Команда)
	Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТС_ТипыИнструкцийИТестов.Инструкция") Тогда
		ВыбратьФайлНаКлиенте();	
		ПросмотрКартинки();
		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПриОткрытииПосле(Отказ)
	Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТС_ТипыИнструкцийИТестов.Инструкция") Тогда
		Элементы.ФормаДбавитьФайл.Видимость=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПередЗаписьюВместо(Отказ, ПараметрыЗаписи)
	
	Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТС_ТипыИнструкцийИТестов.Инструкция") Тогда
		Попытка
			
			Если Не ЗначениеЗаполнено(Объект.Код) Тогда
				УстановитьНовыйКод();
			КонецЕсли;
			
			
			Если ТекущийПутьКФайлу<>Объект.ПутьКФайлу Тогда
				
				КорневойАдрес = ПолучитьКорневойАдресНаСервере();
				ПутьПриемник = КорневойАдрес + "\"  ;
				
				Каталог = Новый Файл(ПутьПриемник);
				Если Не Каталог.Существует() Тогда
					СоздатьКаталог(ПутьПриемник);
				КонецЕсли;
				ИмяФайла="";
				Расширение="";
				СА_ПроцедурыСканАрхиваСервер.ПолучитьИмяРасширение(ТекущийПутьКФайлу, ИмяФайла,Расширение);		
				Объект.ПутьКФайлу=ПутьПриемник+СокрЛП(Объект.Код)+"_"+СокрЛП(Объект.Наименование)+"."+Расширение;
				
				КопироватьФайл(ТекущийПутьКФайлу,Объект.ПутьКФайлу);
			КонецЕсли;
			
			
		Исключение
			Отказ=Истина;
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		
		
		
		Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТС_ТипыИнструкцийИТестов.Инструкция")
			и Не ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
			Отказ=Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не указан файл!";
			Сообщение.Поле = "HTML"; //имя реквизита 
			//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли	
КонецПроцедуры

&НаСервере
&Вместо("ПолучитьКорневойАдресНаСервере")
Функция Лико_ПолучитьКорневойАдресНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.СА_Настройки.КаталогСканАрхиваИнструкций.Значение;
	

КонецФункции
