
&НаКлиенте
Функция ОбработатьШтрихКодНеТовара(Штрихкод) Экспорт // --> Начало Лико Ефимов ЕВВ 30.03.2017
	
	Возврат Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(Штрихкод);
	
КонецФункции // <-- Конец Лико Ефимов ЕВВ 30.03.2017 


&НаКлиенте
Процедура ОткрытьДругуюФормуОбработки(ФормаВладелец, ИмяДругойФормы, Модально = Ложь, ДопПараметры = Неопределено, ОписаниеОповещенияОЗакрытии = Неопределено, Уникальность = Ложь, ОтключитьОборудованиеУФормыВладельца = Ложь) Экспорт // --> Начало Лико Ефимов ЕВВ 28.04.2017 
	
	НекийМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФормаВладелец.ИмяФормы, ".");
	СтрокаПрефикс = НекийМассив[0] + "." + НекийМассив[1] + "." + НекийМассив[2] + ".";
	ПутьКДругойФорме = СтрокаПрефикс + ИмяДругойФормы;
	
	Если ОтключитьОборудованиеУФормыВладельца Тогда
		МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ФормаВладелец); // Отключаем, чтобы в открываемой форме отработала процедура Лико_ДополнительноКлиент.РазвернутьОкноФормыНаВесьЭкран(). Иначе сочетание клавиш вниз-вниз-энтер система понимает как считанный штрихкод на сканере, подключенном как клавиатура
	КонецЕсли;
	
	ОткрытьФорму(ПутьКДругойФорме,ДопПараметры, ФормаВладелец, Уникальность,,,ОписаниеОповещенияОЗакрытии, ?(Модально, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс, Неопределено));
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 28.04.2017 

&НаКлиенте
Процедура ОткрытьОбработкуПриНачалеРаботыСистемы() Экспорт // --> Начало Лико Ефимов ЕВВ 05.05.2017 
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат;
	#КонецЕсли
	
	Результат = Лико_Дополнительно.НайтиОбработкиРабочегоМестаДляОткрытияПриНачалеРаботыСистемы();
	Для каждого ВыполняемаяКоманда из Результат Цикл
		Если ТипЗнч(ВыполняемаяКоманда.Ссылка) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
			ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ВыполняемаяКоманда, Неопределено, Неопределено);
		ИначеЕсли ТипЗнч(ВыполняемаяКоманда.Ссылка) = Тип("Строка") Тогда
			ОткрытьФорму("Обработка." + ВыполняемаяКоманда.Ссылка + ".Форма",,, Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 05.05.2017

&НаКлиенте
Процедура ДобавитьВЗаголовокСистемыИмяБазы() Экспорт
	
	//добавим в заголовок системы имя базы
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы(); //Пример: Srvr="test-1c";Ref="erp_demo";
	ДлинаСтроки = СтрДлина(СтрокаСоединения);
	//Отрежем имя базы - справа до второй кавычки
	ИмяБазы = "";
	КолКавычек = 0;
	Для сч=1 По ДлинаСтроки Цикл
		ТекСимвол = Сред(СтрокаСоединения, ДлинаСтроки-сч+1, 1);
		Если КолКавычек = 1 И ТекСимвол <> Символ(34) Тогда
			ИмяБазы = ТекСимвол + ИмяБазы;
		КонецЕсли;
		
		Если ТекСимвол = Символ(34) Тогда
			КолКавычек = КолКавычек + 1;
		КонецЕсли;
		Если КолКавычек = 2 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ИмяБазы <> "" Тогда
		КлиентскоеПриложение.УстановитьЗаголовок(КлиентскоеПриложение.ПолучитьЗаголовок() + " - " + ИмяБазы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОсновногоОкна() Экспорт // --> Начало Лико Ефимов ЕВВ 18.07.2017
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат;
	#КонецЕсли
	
	Режим = Лико_Дополнительно.ПолучитьРежимОсновногоОкна();
	КлиентскоеПриложение.УстановитьРежимОсновногоОкна(Режим);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 18.07.2017 

&НаКлиенте
Процедура ПочиститьШтрихкодыОтЗапрещенныхСимволов(МассивШтрихкодов) Экспорт // --> Начало Лико Ефимов ЕВВ 06.09.2017
	
	Если ТипЗнч(МассивШтрихкодов) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для сч=0 по МассивШтрихкодов.Количество()-1 Цикл
		ЭлементМассива = МассивШтрихкодов[сч];
		Если ТипЗнч(ЭлементМассива) = Тип("Массив") Тогда
			ПочиститьШтрихкодыОтЗапрещенныхСимволов(ЭлементМассива);
		Иначе
			УдалитьИзСтрокиЗапрещенныеСимволы(ЭлементМассива);
		КонецЕсли;
		МассивШтрихкодов.Установить(сч, ЭлементМассива);
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 06.09.2017

&НаКлиенте
Процедура УдалитьИзСтрокиЗапрещенныеСимволы(Строка) Экспорт // --> Начало Лико Ефимов ЕВВ 06.09.2017
	
	Если ТипЗнч(Строка) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗапрещенныхСимволов = Новый Массив;
	МассивЗапрещенныхСимволов.Добавить(Символ(29));
	
	СтрокаБезЗапрещенныхСимволов = "";
	ДлинаСтроки = СтрДлина(Строка);
	Для сч=1 по ДлинаСтроки Цикл
		ТекСимвол = Сред(Строка, сч, 1);
		Если МассивЗапрещенныхСимволов.Найти(ТекСимвол) = Неопределено Тогда
			СтрокаБезЗапрещенныхСимволов = СтрокаБезЗапрещенныхСимволов + ТекСимвол;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	Строка = СтрокаБезЗапрещенныхСимволов;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 06.09.2017

&НаКлиенте
Процедура РазвернутьОкноФормыНаВесьЭкран() Экспорт // --> Начало Лико Ефимов ЕВВ 28.11.2018 
	
	Попытка
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("% ");
		WSHShell.SendKeys("{UP}{UP}{ENTER}");
	Исключение
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 28.11.2018 

&НаКлиенте
Процедура ВосстановитьОкноФормы() Экспорт // --> Начало Лико Ефимов ЕВВ 09.12.2021
	
	Попытка
		СтрокаКоманды = "%+R";
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys(СтрокаКоманды);
	Исключение
	КонецПопытки;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 09.12.2021

//+m.shenderov 16.08.2017
#Область ПечатьЯССМ_Этикеток
&НаСервереБезКонтекста
Функция ПолучитьНарезку (Характеристика)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,"ЯССМ_Нарезка")	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУпаковку(Нарезка)
	Возврат	Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка)
	
КонецФункции


&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);		
КонецФункции 

&НаКлиенте
Процедура ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры,КоличествоЭкземпляров=0,БыстраяПечать=Неопределено,Количество=0,ИнфоКамф="") Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Если БыстраяПечать=Неопределено Тогда
		БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	КонецЕсли;
	КоличествоЭкземпляров=0; 		
	ТабДокумент=Лико_Дополнительно.ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры,,БыстраяПечать,,Количество,ИнфоКамф);
	Если КоличествоЭкземпляров > 0 Тогда
		ТабДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если БыстраяПечать Тогда
		ТабДокумент.Напечатать();
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;  	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСкладскойКарточки(ОбъектНоменклатуры,КоличествоЭкземпляров=0,БыстраяПечать=Неопределено,Количество=0) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Если БыстраяПечать=Неопределено Тогда
		БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	КонецЕсли;
	КоличествоЭкземпляров=0; 		
	ТабДокумент=Лико_ОбщегоНазначенияСервер.ПараметрыПечатиСкладскойКарточкиОбъектаНоменклатуры(ОбъектНоменклатуры,,БыстраяПечать,,Количество);
	Если КоличествоЭкземпляров > 0 Тогда
		ТабДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если БыстраяПечать Тогда
		ТабДокумент.Напечатать();
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;  	
КонецПроцедуры


// Поиск физического лица по введенным цифрам табельного номера
Процедура ПоискФизЛицаПоТабНомеруПриОкончанииВводаТекста(ПолеВвода, Текст, ЗначениеПоляВвода, СтандартнаяОбработка) Экспорт
	
	Попытка
		СтандартнаяОбработка = Ложь;
		
		ТекстЧисло = Число(Текст);
		
		Если ТекстЧисло>0 Тогда
			МассивФиз = Лико_Дополнительно.ОпределитьРаботникаПоТабНомеру(ТекстЧисло, ТекущаяДата());
			ТекстОшибки="";	
			
			Если МассивФиз.Количество() = 1 Тогда
				ЗначениеПоляВвода= МассивФиз.Получить(0);
				
			ИначеЕсли МассивФиз.Количество() = 0 Тогда 		
				ТекстОшибки="Не найден сотрудник с табельным номером "+ТекстЧисло+".";
				
			Иначе
				ТекстОшибки="Найдено "+МассивФиз.Количество()+
				" сотрудников с табельным номером "+ТекстЧисло+
				" нет возможности определить нужного.";
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				СообщениенПользователю= Новый СообщениеПользователю();
				СообщениенПользователю.Текст= ТекстОшибки;
				СообщениенПользователю.Поле=ПолеВвода;
				СообщениенПользователю.Сообщить();
			КонецЕсли; 	
		КонецЕсли;
	Исключение
		СтандартнаяОбработка = Истина;
	КонецПопытки;
	
КонецПроцедуры //ПоискФизЛицаПоТабНомеруПриОкончанииВводаТекста Экспорт


#КонецОбласти
//-m.shenderov 16.08.2017

//a.ivanova 20171121
&НаКлиенте
Функция УстановитьСоединениеССервером(ServerName = "db-sql5", NameDB = "1cimage", ConnectionTimeout = 1240, CommandTimeout = 2000)  экспорт
	ADOConnection = Неопределено;	
	ADOCommand = Неопределено;
	ADORecordset = Неопределено;
	
	//ServerName = ?(ServerName = Неопределено, ФункцияНаСервереПолучитьКонстанту("СерверSQL"), ServerName);
	//NameDB = ?(NameDB = Неопределено, ФункцияНаСервереПолучитьКонстанту("БазаSQL"), NameDB);
	//ConnectionTimeout = ?(ConnectionTimeout = Неопределено, ФункцияНаСервереПолучитьКонстанту("ConnectionTimeOut"), ConnectionTimeout);
	//CommandTimeOut = ?(CommandTimeOut = Неопределено, ФункцияНаСервереПолучитьКонстанту("CommandTimeOut"), CommandTimeOut);
	
	ДанныеДляПодключения = Новый Структура;
	ДанныеДляПодключения.Вставить("ServerName", ServerName);
	ДанныеДляПодключения.Вставить("NameDB", NameDB);
	ДанныеДляПодключения.Вставить("ConnectionTimeout", ConnectionTimeout);
	ДанныеДляПодключения.Вставить("CommandTimeOut", CommandTimeOut);
	
	//ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Подключено = Ложь;
	
	#Если Клиент Тогда
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
			//ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийПользователь.ИдентификаторПользователяИБ);
			//
			//Если ПользовательИБ.АутентификацияОС И ЗначениеЗаполнено(ПользовательИБ.ПользовательОС) Тогда   //Временно для Авантажа
			
			Подключено = Connect(ADOConnection, ADOCommand, ADORecordset, ДанныеДляПодключения);
			
			//КонецЕсли;   //Временно для Авантажа
			
		КонецЕсли;   //Временно для Авантажа
	#КонецЕсли
	
	Если НЕ Подключено Тогда    // nadin //
		//ДанныеДляПодключения.Вставить("SQL_Пользователь", "user1c");
		//ДанныеДляПодключения.Вставить("SQL_Пароль", "user1c");
		ДанныеДляПодключения.Вставить("SQL_Пользователь", "sa");
		ДанныеДляПодключения.Вставить("SQL_Пароль", "SQLTheBest2016");
		
		
		Подключено = Connect(ADOConnection, ADOCommand, ADORecordset, ДанныеДляПодключения);
	КонецЕсли;
	
	
	Если НЕ Подключено  Тогда     //ИЛИ Не СтатусПодключения
		Возврат НеОпределено;
	КонецЕсли;
	
	ADOCommand.CommandTimeout = ?(CommandTimeOut=0,ConnectionTimeout,CommandTimeOut);
	ADOCommand.ActiveConnection = ADOConnection;
	
	ПараметрыСоединения = Новый Структура;	
	ПараметрыСоединения.Вставить("ADOConnection", ADOConnection);
	ПараметрыСоединения.Вставить("ADOCommand", ADOCommand);
	ПараметрыСоединения.Вставить("ADORecordset", ADORecordset);
	
	Возврат ПараметрыСоединения;		
КонецФункции


&НаКлиенте
Функция CreateConnection(ADOConnection)
	Возврат_ = Истина;
	
	Попытка
		ADOConnection = Новый COMОбъект( "ADODB.Connection" );
		
	Исключение
		Возврат_ = Ложь;
		СообщитьДляКлиента("Неудачная попытка создания объекта: ADODB.Connection", СтатусСообщения.Важное);
	КонецПопытки;
	
	Возврат Возврат_;
КонецФункции

&НаКлиенте
Процедура СообщитьДляКлиента(ТекстСообщения, СтатусСообщения="", НадоСоздаватьСобытие=Ложь) Экспорт
	
	#Если Клиент Тогда
		Если СокрЛП(СтатусСообщения) = "" Тогда
			Сообщить(СокрЛП(ТекстСообщения));
		Иначе
			Сообщить(СокрЛП(ТекстСообщения), СтатусСообщения);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция CreateCommand(ADOCommand)
	Возврат_ = Истина;
	Попытка
		ADOCommand = Новый COMОбъект( "ADODB.Command" ); 
	Исключение
		Возврат_ = Ложь;
		СообщитьДляКлиента( "Неудачная попытка создания объекта: ADODB.Command", СтатусСообщения.Важное);
	КонецПопытки;
	Возврат Возврат_;
КонецФункции

&НаКлиенте
Функция CreateRecordset(ADORecordset)
	Возврат_ = Истина;
	Попытка
		ADORecordset = Новый COMОбъект( "ADODB.Recordset" );    
	Исключение
		Возврат_ = Ложь;
		СообщитьДляКлиента( "Неудачная попытка создания объекта: ADODB.Recordset", СтатусСообщения.Важное);
	КонецПопытки;
	Возврат Возврат_;
КонецФункции

&НаКлиенте
Функция Connect(ADOConnection, ADOCommand, ADORecordset, ДанныеДляПодключения)
	ОбъектыСозданы = CreateConnection(ADOConnection) И CreateCommand(ADOCommand) И CreateRecordset(ADORecordset);
	
	Возврат_ = Истина;
	
	Если ОбъектыСозданы И ADOConnection.State=0 Тогда
		
		Если InitConnection(ADOConnection, ДанныеДляПодключения) Тогда
		Иначе
			Возврат_ = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Возврат_;
КонецФункции

&НаКлиенте
Функция InitConnection(ADOConnection, ДанныеДляПодключения)
	Возврат_ = Истина;
	
	source__ = "Provider=SQLOLEDB; SERVER=" + СокрЛП(ДанныеДляПодключения.ServerName)       
	+ "; Database=" + СокрЛП(ДанныеДляПодключения.NameDB) + "; ";
	
	ТекстПользователя = "";				
	
	Если ДанныеДляПодключения.Свойство("SQL_Пользователь") Тогда        // nadin 
		source__ = source__ + "Uid=" + СокрЛП(ДанныеДляПодключения.SQL_Пользователь) + ";";
		source__ = source__ + "Pwd=" + СокрЛП(ДанныеДляПодключения.SQL_Пароль) + ";";
		
		ТекстПользователя = "" + ДанныеДляПодключения.SQL_Пользователь;
	Иначе
		source__ = source__ + "Trusted_Connection=Yes;";
		
		ТекстПользователя = "пользователь операционной системы";
	КонецЕсли;
	
	source__ = source__ + "APP=1CGATE;";
	
	ADOConnection.ConnectionString = source__;
	ADOConnection.ConnectionTimeout = ДанныеДляПодключения.ConnectionTimeout;
	ADOConnection.CommandTimeout = ДанныеДляПодключения.CommandTimeout;
	ADOConnection.CursorLocation = 3;
	
	Попытка
		ADOConnection.Open();
	Исключение
		#Если Клиент Тогда
			//СообщитьДляКлиента( "Неудачная попытка подключения к серверу (пользователь: " + ТекстПользователя + "): " + ОписаниеОшибки(), СтатусСообщения.Важное);
		#КонецЕсли
		//#Если Сервер Тогда
		//	ЗаписьЖурналаРегистрации("Запросы SQL", УровеньЖурналаРегистрации.Ошибка, , , "Неудачная попытка подключения к серверу (пользователь: " + ТекстПользователя + "): "  + ОписаниеОшибки());
		//#КонецЕсли
		Возврат_ = Ложь;
	КонецПопытки;
	
	Возврат Возврат_;
КонецФункции

&НаКлиенте
Процедура ЗакрытьСоединениеССервером(ПараметрыСоединения) экспорт
	ADOCommand = ПараметрыСоединения.ADOCommand;
	ADORecordset = ПараметрыСоединения.ADORecordset;
	ADOConnection = ПараметрыСоединения.ADOConnection;
	
	Если ADORecordset <> Неопределено И ADORecordset.State <> 0 Тогда
		ADORecordset.Close();
	КонецЕсли;
	
	Если ADOCommand <> Неопределено И ADOCommand.State <> 0 Тогда
		ADOCommand.Close();
	КонецЕсли;
	
	Если ADOConnection <> Неопределено И ADOConnection.State <> 0 Тогда
		ADOConnection.Close();
	КонецЕсли;
	
	Попытка
		ADOCommand.УдалитьCOMОбъект();
		ADORecordset.УдалитьCOMОбъект();	
		ADOConnection.УдалитьCOMОбъект();	
	Исключение	
	КонецПопытки;
	
КонецПроцедуры

//a.ivanova 20171121


&НаКлиенте
Процедура ОтправитьZabbix_sender(Параметры=Неопределено) Экспорт  //+Лико m.shenderov 24.09.2019
	#Если не ВебКлиент  Тогда 
		
		Попытка
			WSHShell = Новый COMОбъект("WScript.Shell");
			Путь = "C:\infopad\zabbix_sender.exe";
			Сервер = "zabbix";
			Ключ = "heartbeat";
			Значение = "1";
			Если Параметры=Неопределено Тогда   		
				Параметры = Новый Структура;
				Параметры.Вставить("Путь"		,Путь);
				Параметры.Вставить("Сервер"		,Сервер);
				Параметры.Вставить("Ключ"		,Ключ);
				Параметры.Вставить("Значение"	,Значение);
			Иначе
				Если НЕ Параметры.Свойство("Путь") Тогда
					Параметры.Вставить("Путь",Путь);
				КонецЕсли;
				Если НЕ Параметры.Свойство("Сервер") Тогда
					Параметры.Вставить("Сервер",Сервер);
				КонецЕсли;
				Если НЕ Параметры.Свойство("Ключ") Тогда
					Параметры.Вставить("Ключ",Ключ);
				КонецЕсли;
				Если НЕ Параметры.Свойство("Значение") Тогда
					Параметры.Вставить("Значение",Значение);
				КонецЕсли;
			КонецЕсли;   	
			
			Команда=Параметры.Путь	 +
			" -z "+Параметры.Сервер	 +
			" -s "+ИмяКомпьютера()	 +
			" -k "+Параметры.Ключ	 +
			" -o "+Параметры.Значение;  
			WSHShell.Run(Команда,0);
		Исключение
			//ОписаниеОшибки();
		КонецПопытки;	
	#КонецЕсли 
	
КонецПроцедуры //-Лико m.shenderov 24.09.2019

&НаКлиенте
Процедура ПечатьТабДокИзФормыПечатьДокументов(ТабДок,ИдентификаторПечатнойФормы="ПечатнаяФорма",НазваниеПечатнойФормы="Печатная форма") Экспорт
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		ТабДок.Показать(НазваниеПечатнойФормы);
		ДокументыПечатались = Истина;
		Возврат;
	КонецЕсли;     
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
	ДокументыПечатались = Истина;
КонецПроцедуры

&НаКлиенте
Функция ОтменитьПроверкуСозданияТранспортонойНакладной(Форма)Экспорт//+Лико m.shenderov 17.04.2020
	
	Попытка		
		Если  ТипЗнч(Форма.Объект.Ссылка)=Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
			Возврат Истина;			
		Иначе
			Возврат Ложь; 	
		КонецЕсли;
	Исключение
		Возврат Ложь; 
	КонецПопытки;	
	
КонецФункции //-Лико m.shenderov 17.04.2020

//+Лико o.pukhova 16.07.2020
&НаКлиенте
Процедура РедактированиеРеквизитовСписка(Поле,СписокДляРедактирования,ТекущийДокумент,СтандартнаяОбработка) Экспорт
	
	Структура = Новый Структура;
	
	Если Лико_Дополнительно.РольДоступнаНаСервере("ПолныеПрава") ИЛИ Лико_Дополнительно.РольДоступнаНаСервере("Лико_ДоступКСтатусуПриходаДокументов") Тогда
		Если Найти(Поле.Имя,"Лико_СтатусПриходаДокументов")>0 Тогда
			СтандартнаяОбработка = Ложь;
			Реквизит = "Лико_СтатусПриходаДокументов";
			Подсказка = "Выберите статус прихода документов."
		ИначеЕсли Найти(Поле.Имя,"Лико_КомментарийПоПриходуДокументов")>0 Тогда
			СтандартнаяОбработка = Ложь;
			Реквизит = "Лико_КомментарийПоПриходуДокументов";
			Подсказка = "Введите комментарий по приходу документов.";
		КонецЕсли;
	КонецЕсли;
	
	Если Лико_Дополнительно.РольДоступнаНаСервере("ПолныеПрава") ИЛИ Лико_Дополнительно.РольДоступнаНаСервере("Лико_ДоступКДатеЗакрытияПродаж") Тогда
		Если Найти(Поле.Имя,"Лико_ДатаЗакрытия")>0 Тогда
			СтандартнаяОбработка = Ложь;
			Реквизит = "Лико_ДатаЗакрытия";
			Подсказка = "Введите Дату закрытия документа.";		
		КонецЕсли;
	КонецЕсли;
	
	Если Не СтандартнаяОбработка Тогда 
		Структура.Вставить("Ключ",Реквизит); 
		Структура.Вставить("СписокДляРедактирования", СписокДляРедактирования);
		Структура.Вставить("ТекущийДокумент", ТекущийДокумент);
		ТекущееЗначение = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущийДокумент,Реквизит);
		
		ОписаниеОповещения= Новый ОписаниеОповещения("РедактированиеРеквизитаЗавершение",Лико_ДополнительноКлиент,Структура);
		
		Если Реквизит = "Лико_СтатусПриходаДокументов" Тогда
			ОткрытьФорму("Справочник.Лико_СтатусыПриходаДокументов.ФормаВыбора",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		ИначеЕсли Реквизит = "Лико_КомментарийПоПриходуДокументов" Тогда
			ПоказатьВводСтроки(ОписаниеОповещения,ТекущееЗначение,Подсказка);
		ИначеЕсли Реквизит = "Лико_ДатаЗакрытия" Тогда
			ПоказатьВводДаты(ОписаниеОповещения,ТекущееЗначение,Подсказка);
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРеквизитаЗавершение(РезультатФормы, ПараметрФормы) Экспорт
	Если РезультатФормы=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Лико_Дополнительно.РедактироватьРеквизитСервер(ПараметрФормы.ТекущийДокумент,ПараметрФормы.Ключ,РезультатФормы);
	Если ПараметрФормы.Ключ = "Лико_ДатаЗакрытия"  И  ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ПараметрФормы.ТекущийДокумент, "Лико_ДатаОплаты") Тогда 
		Лико_ДатаОплаты 		= ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрФормы.ТекущийДокумент, "Лико_ДатаОплаты");
		ДатаПолученияДокументов = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрФормы.ТекущийДокумент,"ДатаПолученияДокументов") ;
		Если (РезультатФормы<> Макс(Лико_ДатаОплаты ,ДатаПолученияДокументов) ИЛИ Не ЗначениеЗаполнено(Мин(Лико_ДатаОплаты ,ДатаПолученияДокументов) ))
			И Не ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрФормы.ТекущийДокумент , "Лико_РучнаяКорректировкаДатыЗакрытия")  Тогда  
			Лико_Дополнительно.РедактироватьРеквизитСервер(ПараметрФормы.ТекущийДокумент,"Лико_РучнаяКорректировкаДатыЗакрытия",Истина);
		КонецЕсли;
	КонецЕсли;
	ПараметрФормы.СписокДляРедактирования.Обновить();	
КонецПроцедуры


//-Лико o.pukhova 16.07.2020

//Процедура НачатьОтправкуСообщения(СсылкаНаДокумент, Место, Пользователь, Макет) Экспорт //++ kit:mih web 16.07.21
//	
//	СтруктураДляЗаполненя = Лико_Дополнительно.ПолучитьДанныеДляОтправкиПисьмаЗаброковкиМатериалов(СсылкаНаДокумент);
//	
//	Если НЕ СтруктураДляЗаполненя = Неопределено Тогда		
//		Лико_Дополнительно.ЗаполнениеТабличногоДокументаПисьмаИОтправка(СтруктураДляЗаполненя, Место, Пользователь, Макет);		
//	КонецЕсли;	
//		
//КонецПроцедуры //++ kit:mih web 16.07.21

