
&НаКлиенте
Процедура Лико_ТоварыХарактеристикаПриИзмененииПосле(Элемент)
	//+m.shenderov 10.07.2017 
	////Лико_СкладыКлиент.ЗаполнениеУпаковкиПоХарактеристики (ЭтаФорма,Элемент);
	////КоличествоУпаковокПриИзменении(Элемент);
	//-m.shenderov 10.07.2017	
	ПриВвводеРоликов();
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПриОткрытииПосле(Отказ)
	ПроставитьПМ();
	ЗаполнитьВалютуЦГВтоварахСервер();
	Если BRC Тогда
		Элементы.Лико_ВидКонтактаСПищевойПродукцией.Видимость=Истина;
	КонецЕсли;
	ПорверкаМенеджера(); 
	
	Лико_УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыПриИзмененииПосле(Элемент)
	ПроставитьПМ();
	Лико_ДопРасходыПриИзмененииНаСервере();
	ЗаполнитьВалютуЦГВтоварахСервер();
КонецПроцедуры





&НаКлиенте
Процедура ПроставитьПМ()
	Для каждого Товар Из Объект.Товары  Цикл
		Нарезка=ПолучитьНарезкуСервер(Товар.Характеристика);
		Если  Нарезка<>0 Тогда 
			Товар.КоличествоПМ=Товар.КоличествоУпаковок/(Нарезка/1000);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНарезкуСервер(Характеристика) //+Лико m.shenderov 11.12.2017
	Если ЗначениеЗаполнено(Характеристика.ЯССМ_Нарезка.Размер) Тогда
		Возврат Характеристика.ЯССМ_Нарезка.Размер;
	КонецЕсли;
	Возврат 0;
КонецФункции  //-Лико m.shenderov 11.12.2017

&НаКлиенте
Функция ПриВвводеРоликов() //+Лико m.shenderov 14.12.2017 
	
	Нарезка=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.Товары.ТекущиеДанные.Характеристика,"ЯССМ_Нарезка");
	
	//Если Нарезка <> ПредопределенноеЗначение("Справочник.ЯССМ_Нарезки.ПустаяСсылка") Тогда
		
		Если ЗначениеЗаполнено(Нарезка) Тогда

		
		Если Не ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Лико_Втулка) Тогда
			Элементы.Товары.ТекущиеДанные.Лико_Втулка=ВтулкаСервер76();
		КонецЕсли;
		
		
		КоличествоПГ = 0;
		КоличествоКВ = (Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Нарезка,"Размер")/1000) *
		Элементы.Товары.ТекущиеДанные.Лико_Намотка * 
		Элементы.Товары.ТекущиеДанные.Лико_КолРоликов;
		
		Элементы.Товары.ТекущиеДанные.КоличествоУпаковок = КоличествоКВ;
		КоличествоУпаковокПриИзменении("ПриВвводеРоликов");	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции  //-Лико m.shenderov 14.12.2017

&НаСервереБезКонтекста
Функция ХарактеристикаЯССМ_НарезкаСервер(Характеристика) //+Лико m.shenderov 14.12.2017
	
	
КонецФункции  //-Лико m.shenderov 14.12.2017



&НаКлиенте
Процедура Лико_ТоварыЛико_ВтулкаПриИзмененииПосле(Элемент)
	ПриВвводеРоликов();
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыЛико_НамоткаПриИзмененииПосле(Элемент)
	ПриВвводеРоликов();
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыЛико_КолРоликовПриИзмененииПосле(Элемент)
	ПриВвводеРоликов();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ВтулкаСервер76() //+Лико m.shenderov 15.12.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Втулки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Втулки КАК Лико_Втулки
	|ГДЕ
	|	Лико_Втулки.Размер = 76";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
КонецФункции  //-Лико m.shenderov 15.12.2017


&НаСервере
Процедура Лико_Лико_Цена1ПослеНаСервере()
	Индекс =0;

	Для каждого Товар Из Объект.Товары Цикл
		
		
		СтруктураЦены=Лико_ОбщегоНазначенияСервер.СтруктураЦеныПоЦенновойГрупе(Товар.Номенклатура.ЦеноваяГруппа,Объект.Организация);
		
		Если Не ЗначениеЗаполнено(СтруктураЦены.ВалюТаЦеныПоставщика) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Цена поставщика ЦГ номенклатуры: ""(%1) %2"" не установлена!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура);
			Сообщение.Поле = СтрШаблон("Объект.Товары[%1].Номенклатура",Индекс); //имя реквизита 

			
	ИначеЕсли Объект.Валюта<>СтруктураЦены.ВалюТаЦеныПоставщика Тогда 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Валюта документа :%1 не соответсвует валюте ЦГ: %2 (номенклатура: ""(%3)%4"")!",
			Объект.Валюта,
			СтруктураЦены.ВалюТаЦеныПоставщика,
			Товар.Номенклатура.Код,
			Товар.Номенклатура);
			Сообщение.Поле = СтрШаблон("Объект.Товары[%1].Номенклатура",Индекс); //имя реквизита 
			//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
			Сообщение.Сообщить();
		Иначе
			Товар.Цена=СтруктураЦены.ЦенаПоставщика;
			СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);	
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Товар, СтруктураДействий, Неопределено);
        РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

			
			
		КонецЕсли;
		
		 Индекс = Индекс+1;
				
		
	КонецЦикла;
	Объект.РегистрироватьЦеныПоставщика=Ложь;	
КонецПроцедуры


&НаКлиенте
Процедура Лико_Лико_Цена1После(Команда)
	Лико_Лико_Цена1ПослеНаСервере();
	
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();

КонецПроцедуры

#Область ЗакрытиеЗаказа

&НаКлиенте
Процедура Лико_ЗакрытьЗаказЗавершение(РезультатКоманды,ПараметрыКоманды) Экспорт //+Лико m.shenderov 22.05.2018
	Если РезультатКоманды = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЗаказПоставщику Из ПараметрыКоманды.ПараметрКоманды Цикл
		ЗакрытьЗаказНаСервере(ЗаказПоставщику);		
	КонецЦикла;
	
	
	ОбновитьСостояниеСервер();
	
	
	//Исключение
	//ОписаниеОшибки()
	//КонецПопытки;
	
КонецПроцедуры //-Лико m.shenderov 22.05.2018



&НаСервере
Процедура ЗакрытьЗаказНаСервере(ЗаказПоставщику)
	Лико_Склады.ЗакрытьЗаказНаСервере(ЗаказПоставщику);
	
КонецПроцедуры

&НаСервере
Процедура Лико_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма,"ТоварыХарактеристика1");
		
 Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Лико_ДопРасходы1КросКурс.Имя);
	
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Лико_ДопРасходы.РучнойВводКурса");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);


	Если Параметры.Свойство("лкСтрТовары") Тогда
		ТзТовары=Объект.Товары.Выгрузить();
		ТзТовары.Очистить();
		тзЛико_РезервПодЗаказКлиента=Объект.Лико_РезервПодЗаказКлиента.Выгрузить();
		Для каждого Товар Из Параметры.лкСтрТовары Цикл
			НовыйТовар=ТзТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
			НовыйЗаказ=тзЛико_РезервПодЗаказКлиента.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЗаказ,Товар);
		КонецЦикла;
		ТзТовары.Свернуть("Номенклатура,Характеристика,Лико_Намотка,Лико_Втулка,Лико_КолРоликов","Количество,КоличествоУпаковок");
		тзЛико_РезервПодЗаказКлиента.Свернуть("ЗаказКлиента");
		Объект.Лико_РезервПодЗаказКлиента.Загрузить(тзЛико_РезервПодЗаказКлиента);
		Для каждого Товар Из ТзТовары Цикл
			
			Нарезка=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Характеристика,"ЯССМ_Нарезка");		
		Если ЗначениеЗаполнено(Нарезка) Тогда  
			Товар.Лико_Намотка=2000;
			Товар.Лико_Втулка=ВтулкаСервер76();  			
			Ролик = (Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Нарезка,"Размер")/1000) *Товар.Лико_Намотка; 
			Товар.Лико_КолРоликов=Цел(Товар.Количество/Ролик)+?(Товар.Количество%Ролик=0,0,1);  			
			
			КоличествоПГ = 0;
			КоличествоКВ = (Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Нарезка,"Размер")/1000) *
			Товар.Лико_Намотка * 
			Товар.Лико_КолРоликов;
			
			Товар.КоличествоУпаковок = КоличествоКВ;
			Товар.Количество = КоличествоКВ;					
			
		КонецЕсли;	

			
			
	КонецЦикла;
	Для каждого СтрТовар Из ТзТовары Цикл
		НовыйТовар=Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйТовар,СтрТовар);
		ЛкТоварыНоменклатураПриИзменении(НовыйТовар);
	КонецЦикла;
		
		
	КонецЕсли;
	BRC=?(ЗначениеЗаполнено(Объект.Организация),УправлениеСвойствами.ЗначениеСвойства(Объект.Организация,"Лико_УчетНаСкладеПоBRC"),Ложь);
	
	ВалютаУУ=Константы.ВалютаУправленческогоУчета.Получить();
	
	
	//+ ---> Лико m.shenderov 18.11.2024 
	
	УстановитьОформлятьПредзакзыПоставщикам();
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Лико_Основание.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Лико_ОформлятьПредзакзыПоставщикам");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина); 
	
	
	
	//- <--- Лико m.shenderov 18.11.2024
	
  
	Если Не  ЗначениеЗаполнено(Параметры.Ключ) И ЗначениеЗаполнено(Объект.Лико_ДатаКурса) Тогда 
		  Объект.Лико_ДатаКурса = Неопределено;
		  Лико_ДопРасходыПриИзмененииНаСервере();
		  
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Процедура ЛкТоварыНоменклатураПриИзменении(ТекущаяСтрока)
	
	//ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
	СтруктураДействий.Вставить("ПроверитьСтатьюАналитикуРасходов", ТекущаяСтрока.Номенклатура);
	СтруктураДействий.Вставить(
		"ПроверитьЗаполнитьСклад",
		ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(
			Объект,
			СкладГруппа));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	Если ИспользоватьСоглашенияСПоставщиками И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияЗакупок", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
	КонецЕсли;
	
    СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата,Организация", Объект.НалогообложениеНДС, Объект.Дата,Объект.Организация));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	//
	Если КонтролироватьАссортимент Тогда
		СтруктураПроверкиАссортимента = АссортиментКлиентСервер.ПараметрыПроверкиАссортимента();
		СтруктураПроверкиАссортимента.Ссылка = Объект.Ссылка;
		СтруктураПроверкиАссортимента.Склад = Объект.Склад;
		СтруктураПроверкиАссортимента.Дата = ?(ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления), Объект.ЖелаемаяДатаПоступления, Объект.Дата);
		СтруктураПроверкиАссортимента.ТекстСообщения = НСтр("ru = 'Товар %1 не включен в ассортимент магазина. Заказывать его не рекомендуется.';
															|en = 'Goods %1 are not included in the shop assortment. It is not recommended that you close it.'");
		СтруктураПроверкиАссортимента.ИмяРесурсаАссортимента = "РазрешеныЗакупки";
		СтруктураПроверкиАссортимента.ПровереноМожноДобавлять = Истина;
		СтруктураПроверкиАссортимента.РазрешатьДобавление = Истина;
		//
		СтруктураДействий.Вставить("ПроверитьАссортиментСтроки", СтруктураПроверкиАссортимента);
	КонецЕсли;
	НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	Если ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Или
		ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Или 
		ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор")
			Или ЗначениеЗаполнено(ТекущаяСтрока.Назначение) Тогда
		ТекущаяСтрока.СписатьНаРасходы = Ложь;
		ТекущаяСтрока.СтатьяРасходов = ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
		ТекущаяСтрока.АналитикаРасходов = Неопределено;
		ТекущаяСтрока.Подразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
	ИначеЕсли ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		ТекущаяСтрока.СписатьНаРасходы = Истина;
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	

	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ОрганизацияПриИзмененииПосле(Элемент)
	ПоределитьОрганизациюBRC();
	Если BRC Тогда
		Элементы.Лико_ВидКонтактаСПищевойПродукцией.Видимость=Истина;
	Иначе
		Элементы.Лико_ВидКонтактаСПищевойПродукцией.Видимость=Ложь;

	КонецЕсли;

КонецПроцедуры

Процедура ПоределитьОрганизациюBRC()
	BRC=?(ЗначениеЗаполнено(Объект.Организация),УправлениеСвойствами.ЗначениеСвойства(Объект.Организация,"Лико_УчетНаСкладеПоBRC"),Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ПорверкаМенеджера()	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Менеджер=Объект.Автор;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура Лико_ПартнерПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика. 
	ПорверкаМенеджера();
	УстановитьОформлятьПредзакзыПоставщикам(); 
КонецПроцедуры

&НаКлиенте
Процедура Лико_КонтрагентПриИзмененииПосле(Элемент)
	ПорверкаМенеджера();
КонецПроцедуры

&НаКлиенте
Процедура Лико_НалогообложениеНДСПриИзмененииПосле(Элемент)
	
	Если Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС") Тогда
		Объект.ЦенаВключаетНДС=Ложь;
	КонецЕсли;
	
КонецПроцедуры




#КонецОбласти  

#Область Рачсчет_цены

&НаКлиенте
Процедура Лико_УстановитьВидимость() //+Лико m.shenderov 10.11.2023
	
	//Если Объект.Лико_УстановкаЦен Тогда
	
	ВалютаРасчета = ?(ЗначениеЗаполнено(Объект.Лико_ВалютаРасчета),Объект.Лико_ВалютаРасчета,Объект.Валюта);
	
		Элементы.Лико_ДопРасходы.Видимость=Истина;
	    Элементы.ТоварыЛикоДопРасходы.Видимость=Истина; 
		Элементы.Лико_ДопРасходы1СуммаВВалютеДокумента.Заголовок=СтрШаблон("Сумма (%1)",Объект.Лико_ВалютаРасчета);
		Элементы.ТоварыЛико_ЦенаИтого.Заголовок=СтрШаблон("Цена итого (%1)",Объект.Лико_ВалютаРасчета);
		Элементы.ТоварыЛико_ЦенаВВалютеУУ.Заголовок=СтрШаблон("Цена итого (%1)",ВалютаУУ);
		Элементы.ТоварыЛико_СуммаИтого.Заголовок=СтрШаблон("Сумма итого (%1)",Объект.Лико_ВалютаРасчета);
		Элементы.ТоварыЛико_СуммаВВалютеУУ.Заголовок=СтрШаблон("Сумма Итого (%1)",ВалютаУУ); 
		
		Элементы.ТоварыЛико_ЦенаИтого1.Заголовок=СтрШаблон("Цена итого (%1)",Объект.Лико_ВалютаРасчета);
		Элементы.ТоварыЛико_ЦенаВВалютеУУ1.Заголовок=СтрШаблон("Цена итого (%1)",ВалютаУУ);
		Элементы.ТоварыЛико_СуммаИтого1.Заголовок=СтрШаблон("Сумма итого (%1)",Объект.Лико_ВалютаРасчета);
		Элементы.ТоварыЛико_СуммаВВалютеУУ1.Заголовок=СтрШаблон("Сумма Итого (%1)",ВалютаУУ);  
		
		Элементы.ТоварыЛико_ЦенаВВалютеРасчета.Заголовок = СтрШаблон("Цена (%1)",ВалютаРасчета); 

	//Иначе
	//	
	//	Элементы.Лико_ДопРасходы.Видимость=Ложь;
	//	Элементы.ТоварыЛикоДопРасходы.Видимость=Ложь;

	//	
	//КонецЕсли;
	

	
КонецПроцедуры //-Лико m.shenderov 10.11.2023

&НаКлиенте
Процедура Лико_Лико_УстановкаЦенПриИзмененииПосле(Элемент)
	УстановкаНДСДляДопРасходовСервер();
	ЗаполнитьДопРасходыПоОрганизацииСервер(); 
	УстановитьКоэффКонвертацииСервер();
	Лико_УстановитьВидимость();  
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДопРасходыПоОрганизацииСервер() //+Лико m.shenderov 13.11.2023
//Если Не Объект.Лико_УстановкаЦен Тогда
//		   Возврат;
//	КонецЕсли;
	
	Объект.Лико_ДопРасходы.Очистить();
    Объект.Лико_ДатаКурса=Объект.Дата;
	Объект.Лико_ВалютаРасчета=Объект.Валюта;
	
	//Если Объект.Лико_УстановкаЦен Тогда 
		
		Если Не ЗначениеЗаполнено(Объект.Лико_ДатаКурса) Тогда
			Объект.Лико_ДатаКурса=ТекущаяДата();
		КонецЕсли;
		
		Объект.Лико_ДопРасходы.Загрузить(Справочники.Лико_ВидыДопРасходовНаПоступлениеМатериалов.РасходыПоВиду(Объект.Организация,Объект.Лико_ВидДопРасхода));
		
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Лико_ДопРасходыНаПоступлениеМатериаловОрганизации.Валюта КАК Валюта,
		//|	Лико_ДопРасходыНаПоступлениеМатериаловОрганизации.Ссылка КАК Расход
		//|ИЗ
		//|	Справочник.Лико_ДопРасходыНаПоступлениеМатериалов.Организации КАК Лико_ДопРасходыНаПоступлениеМатериаловОрганизации
		//|ГДЕ
		//|	Лико_ДопРасходыНаПоступлениеМатериаловОрганизации.Организация = &Организация";
		//
		//Запрос.УстановитьПараметр("Организация",Объект.Организация );
		//
		//Объект.Лико_ДопРасходы.Загрузить( Запрос.Выполнить().Выгрузить());
		
		
	//КонецЕсли;
	
КонецПроцедуры  //-Лико m.shenderov 13.11.2023



&НаСервере
Процедура РасчетЦенПоКурсуДопРасходовСервер() //+Лико m.shenderov 15.11.2023
	
	
	
	Для каждого Расход Из Объект.Лико_ДопРасходы Цикл
		    Если Не Расход.РучнойВводКурса Тогда
			Расход.КросКурс=0; 
			КонецЕсли;
			
			Расход.СуммаВВалютеДокумента=0;

		
			Если Не ЗначениеЗаполнено(Объект.Лико_ВалютаРасчета) 
				Или Не ЗначениеЗаполнено(Расход.Валюта) 
				Или Не ЗначениеЗаполнено(Расход.Сумма) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Расход.Валюта=Объект.Лико_ВалютаРасчета Тогда 
			Расход.КросКурс=1;
			Расход.СуммаВВалютеДокумента=Расход.Сумма;
			
		Иначе 
			
					
			Если Не Расход.РучнойВводКурса Тогда
				
				Расход.СуммаВВалютеДокумента
				=	РаботаСКурсамиВалют.ПересчитатьВВалюту(Расход.Сумма, Расход.Валюта,Объект.Лико_ВалютаРасчета, ?(ЗначениеЗаполнено(Объект.Лико_ДатаКурса),Объект.Лико_ДатаКурса,ТекущаяДата()));
				
				Если Расход.Валюта.Лико_Рейтинг>=Объект.Лико_ВалютаРасчета.Лико_Рейтинг Тогда
					Расход.КросКурс=Расход.Сумма/Расход.СуммаВВалютеДокумента;
				Иначе
					Расход.КросКурс=Расход.СуммаВВалютеДокумента/Расход.Сумма;	
				КонецЕсли;  
			Иначе
								
				Если Расход.Валюта.Лико_Рейтинг>=Объект.Лико_ВалютаРасчета.Лико_Рейтинг Тогда
					Расход.СуммаВВалютеДокумента=Расход.Сумма/Расход.КросКурс;
				Иначе
					Расход.СуммаВВалютеДокумента=Расход.КросКурс*Расход.Сумма;	
				КонецЕсли; 
				

				
			КонецЕсли;
		
			
		КонецЕсли;
		
			
		
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 15.11.2023

&НаСервере
Процедура РасчетЦеныПолныйСервер() //+Лико m.shenderov 15.11.2023
	//Если Не Объект.Лико_УстановкаЦен Тогда
	//	   Возврат;
	//КонецЕсли;
	

	СуммаДоп=Объект.Лико_ДопРасходы.Итог("СуммаВВалютеДокумента");
	ОбщиеДопРасходы=0;
	ОбщиеДопРасходыДляНДС=0; 
	СуммаИтог=Объект.Товары.Итог("Сумма"); 
	Если СуммаИтог=0 Тогда
		Возврат;
	КонецЕсли;
	
	
	Для каждого Расход Из Объект.Лико_ДопРасходы Цикл
		
		Если Расход.Расход.БазаДляНДС Тогда
			ОбщиеДопРасходыДляНДС=ОбщиеДопРасходыДляНДС+Расход.СуммаВВалютеДокумента;
		Иначе
			ОбщиеДопРасходы=ОбщиеДопРасходы+Расход.СуммаВВалютеДокумента;
		КонецЕсли;
		
	КонецЦикла;
	ОбщиеДопРасходыОстаток=ОбщиеДопРасходы;
	ОбщиеДопРасходыДляНДСОстаток=ОбщиеДопРасходыДляНДС;
	сч=Объект.Товары.Количество();
	ДатаРасчета = ?(ЗначениеЗаполнено(Объект.Лико_ДатаКурса),Объект.Лико_ДатаКурса,Объект.Дата);
	РазнаяВалютаУчета = Объект.Валюта
	<>?(ЗначениеЗаполнено(Объект.Лико_ВалютаРасчета),Объект.Лико_ВалютаРасчета,Объект.Валюта);
	
	Для каждого Товар Из Объект.Товары  Цикл
		Если Товар.Количество=0 Тогда
			Продолжить;
		КонецЕсли;
		
		сч=сч-1;
		
		
		
		Коэффициент=Товар.Сумма/СуммаИтог;
		Если сч<>0 Тогда
			
			ДопРасходы=ОбщиеДопРасходы*Коэффициент;
			ДопРасходыДляНДС=ОбщиеДопРасходыДляНДС*Коэффициент;
			
			ОбщиеДопРасходыОстаток=ОбщиеДопРасходыОстаток-ДопРасходы;
			ОбщиеДопРасходыДляНДСОстаток=ОбщиеДопРасходыДляНДСОстаток-ДопРасходыДляНДС;
		Иначе
			ДопРасходы=ОбщиеДопРасходыОстаток;
			ДопРасходыДляНДС=ОбщиеДопРасходыДляНДСОстаток;
			
			ОбщиеДопРасходыОстаток=0;
			ОбщиеДопРасходыДляНДСОстаток=0;		
			
		КонецЕсли;
		ТаможеннаяПошлина=?(Товар.Лико_ТаможеннаяПошлина=0,1,Товар.Лико_ТаможеннаяПошлина);
		НДС=1+Число(Товар.Лико_СтавкаНДС)/100;
		ТоварЦена = ?(Объект.ЦенаВключаетНДС,Товар.Цена/НДС,Товар.Цена); 
		
		Если РазнаяВалютаУчета Тогда		
			Товар.Лико_ЦенаВВалютеРасчета = РаботаСКурсамиВалют.ПересчитатьВВалюту(Товар.цена,Объект.Валюта, Объект.Лико_ВалютаРасчета, ДатаРасчета); 
		Иначе
			Товар.Лико_ЦенаВВалютеРасчета = Товар.Цена;
		КонецЕсли;
		Товар.Лико_СуммаВВалютеРасчета=Товар.Лико_ЦенаВВалютеРасчета*Товар.Количество;
		
		ТоварЦена = ?(Объект.ЦенаВключаетНДС,Товар.Лико_ЦенаВВалютеРасчета/НДС,Товар.Лико_ЦенаВВалютеРасчета);

		
		Товар.Лико_ДопЦена=ДопРасходы/Товар.Количество;
		Товар.Лико_ЦенаИтого
		=(ТоварЦена+ДопРасходыДляНДС/Товар.Количество)
		*ТаможеннаяПошлина
		*НДС
		+ТоварЦена*Товар.Лико_КонвертацияВалюты
		+Товар.Лико_ДопЦена;
		Товар.Лико_СуммаИтого=Товар.Лико_ЦенаИтого*Товар.Количество;
		
		ВалютаУУ=Константы.ВалютаУправленческогоУчета.Получить();
		
		Товар.Лико_ЦенаВВалютеУУ
		=	РаботаСКурсамиВалют.ПересчитатьВВалюту(Товар.Лико_ЦенаИтого, Объект.Лико_ВалютаРасчета,ВалютаУУ, ДатаРасчета);
		Товар.Лико_СуммаВВалютеУУ=Товар.Лико_ЦенаВВалютеУУ*Товар.Количество;
		
		
		
		
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 15.11.2023




&НаСервере
Процедура Лико_ДопРасходыПриИзмененииНаСервере()
	УстановкаНДСДляДопРасходовСервер();
	РасчетЦенПоКурсуДопРасходовСервер();
	РасчетЦеныПолныйСервер();
КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ДопРасходы1ПриИзмененииПосле(Элемент)
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура Лико_ВалютаПриИзмененииПосле(Элемент)
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Лико_ДатаПриИзмененииПосле(Элемент)
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ДатаКурсаПриИзмененииПосле(Элемент)
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура Лико_ОбновитьЦеныПосле(Команда)
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура Лико_Лико_ВалютаРасчетаПриИзмененииПосле(Элемент)
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();

КонецПроцедуры


Процедура УстановкаНДСДляДопРасходовСервер() //+Лико m.shenderov 14.12.2023
	
	СтавкаНДС=Лико_ОбщегоНазначенияСервер.СтавкаНДСНаДату(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	
	Для каждого Товар Из Объект.Товары Цикл
		   
		   //СтавкаНДС=Число(Товар.СтавкаНДС.Ставка);
		   
		   Если ЗначениеЗаполнено(СтавкаНДС) И Не ЗначениеЗаполнено( Товар.Лико_СтавкаНДС) Тогда
			   
			   Товар.Лико_СтавкаНДС=СтавкаНДС;
			   
		   КонецЕсли; 
		   
		   
	   КонецЦикла;
		
КонецПроцедуры //-Лико m.shenderov 14.12.2023

&НаКлиенте
Процедура Лико_Лико_КонвертацияВалютыПриИзмененииПосле(Элемент)
УстановитьКоэффКонвертацииТЧСервер();
Лико_УстановитьВидимость();

КонецПроцедуры

 Функция ЭтоВалютаРегламентированногоУчетаСервер(Валюта) //+Лико m.shenderov 18.12.2023
	 
	 Возврат Валюта=Константы.ВалютаРегламентированногоУчета.Получить();
	 
 КонецФункции //-Лико m.shenderov 18.12.2023 
 
 
 &НаСервере
 Процедура УстановитьКоэффКонвертацииСервер() //+Лико m.shenderov 18.12.2023
	 
	 Если ЭтоВалютаРегламентированногоУчетаСервер(Объект.Лико_ВалютаРасчета) Тогда
		 
		 Объект.Лико_КонвертацияВалюты=0;
	 Иначе
		 
		 Объект.Лико_КонвертацияВалюты=0.05;

		 
	 КонецЕсли;
	 
 	УстановитьКоэффКонвертацииТЧСервер();
	
 КонецПроцедуры  //-Лико m.shenderov 18.12.2023
 
 
  &НаСервере
  Процедура УстановитьКоэффКонвертацииТЧСервер () //+Лико m.shenderov 18.12.2023
	  
	  Для каждого Товар Из Объект.Товары Цикл
	  	  Товар.Лико_КонвертацияВалюты=Объект.Лико_КонвертацияВалюты;
	  КонецЦикла;
	  
  	Лико_ДопРасходыПриИзмененииНаСервере();
	
  КонецПроцедуры  //-Лико m.shenderov 18.12.2023
  
  &НаСервереБезКонтекста
  Функция ОрганизацияЛикофлексСервер() //+Лико m.shenderov 27.03.2024
	  
	  Возврат Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра;
  	
  КонецФункции  //-Лико m.shenderov 27.03.2024
  
  &НаСервереБезКонтекста
  Функция УказыватьДопРасходы(ХозяйственнаяОперация)
	  
	  Массив = РегистрыСведений.Лико_АвтоРасчетЦенЦГ.ХозяйственныеОперации();
	  Индекс = Массив.Найти(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	  
	  Если Индекс<>Неопределено Тогда 
		  Массив.Удалить(Индекс);
	  КонецЕсли;
	  
	  
	  Возврат Массив.Найти(ХозяйственнаяОперация)<>Неопределено;
	  
  КонецФункции 
  
  
  
  &НаКлиенте
  Процедура Лико_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	  
	  Если НЕ Объект.Лико_Предзаказ 
		  И УказыватьДопРасходы(Объект.ХозяйственнаяОперация) 
		  И Объект.Организация=ОрганизацияЛикофлексСервер()
		  И Объект.Лико_ДопРасходы.Итог("Сумма")=0 Тогда 
		  
		  Для каждого Товар Из Объект.Товары Цикл 
			  
			  Если Не АвтоРасчетЦеныСервер(Товар.Номенклатура) Тогда
				  Продолжить;
			  КонецЕсли;
			  
			  Отказ=Истина;
			  Сообщить("Не заведены доп. расходы!"); 
			  Возврат;
			  
			  
		  КонецЦикла;
		  
	  КонецЕсли;
	  
	  
	  Если НЕ Объект.Лико_Предзаказ И
		  //Объект.Лико_УстановкаЦен И 
		  Не Лико_РазрешениеЗаписи Тогда
		  
		  ЗаполнитьВалютуЦГВтоварахСервер();
		  Для каждого Товар Из Объект.Товары Цикл 
			  
			  Если Не АвтоРасчетЦеныСервер(Товар.Номенклатура) Тогда
				  Продолжить;
			  КонецЕсли;
			  
			  Если  Товар.Лико_ВалютаЦГ<>Объект.Лико_ВалютаРасчета Тогда
				  Отказ=Истина;
				  
				  Если Не ЗначениеЗаполнено(Товар.Лико_ВалютаЦГ) Тогда
					  
					  Текст=СтрШаблон("Не установлена валюта учета для ценовой группы: ""(%1) %2"".",Товар.Лико_КодЦГ,Товар.Лико_ЦеноваяГруппа);
					  
				  Иначе
					  Текст=СтрШаблон(" Валюта расчета в документе - ""%3"", не соответсвует валюте - ""%4"", установленной  для ценовой группы ""(%1) %2""."
					  ,СокрЛП(Товар.Лико_КодЦГ)
					  ,Товар.Лико_ЦеноваяГруппа
					  ,Объект.Лико_ВалютаРасчета
					  ,Товар.Лико_ВалютаЦГ);
					  
				  КонецЕсли;
				  
				  
				  Сообщить(Текст);
				  
				  
			  КонецЕсли;
			  
			  
		  КонецЦикла;
		  
		  Если Отказ Тогда 
			  ПолучитьРазрешениеНаЗапись(ПараметрыЗаписи);
			  Возврат; 
		  КонецЕсли;
		  
		  
	  КонецЕсли;  
	  
	  
	  	  
	  Если НЕ Объект.Лико_Предзаказ 
		  И Не Лико_ЦеныПроверены 
		  И Не Отказ Тогда 
			
			ПоказатьРазницуВЦенеСЦеновойГрупой(Отказ,ПараметрыЗаписи);
		
		Если Отказ Тогда 
			
			ПолучитьРазрешениеНаЗаписьПроверкаЦен(ПараметрыЗаписи);

			
		КонецЕсли;
		
		
	    КонецЕсли;


	  
	  
  КонецПроцедуры
  
  
    &НаСервере
  Процедура ПоказатьРазницуВЦенеСЦеновойГрупой(Отказ,ПараметрыЗаписи) //+Лико m.shenderov 14.08.2024
   ТаблицаЦен= РегистрыСведений.Лико_СтоимостьЦеновыхГрупп.ПоказатьРазницуВЦенеСЦеновойГрупой(Объект.Организация,
		  Объект.Дата,
		  Объект.Лико_ВалютаРасчета,
		  Объект.Товары.Выгрузить()); 
		  
		  Если ТаблицаЦен.Количество()>0 Тогда
			Отказ = Истина;
						
			Для каждого СтрЦен Из ТаблицаЦен  Цикл 
		НомерСтроки = СтрЦен.НомерСтроки-1;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(" Цена номенклатуры:""%1"" отличается на: %2%% (текущая цена:%3 %4.)",СтрЦен.Номенклатура,СтрЦен.РазницаПроцент,СтрЦен.ЦенаЦГ,СтрЦен.ВалютаЦГ);
		Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита 
		Сообщение.УстановитьДанные(Объект); //Ссылка на объект ИБ
		Сообщение.Сообщить();
	 	
	 КонецЦикла;

			
		  КонецЕсли;
		  
  	
  КонецПроцедуры  //-Лико m.shenderov 14.08.2024
  

  
  
  
  &НаКлиенте
  Асинх Процедура ПолучитьРазрешениеНаЗапись(ПараметрыЗаписи) //+Лико m.shenderov 18.12.2023
  		  
	 Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(СтрШаблон
	  ("Валюта расчета в документе - ""%1"" -  не соответсвует установленной валюте для ценовой группы.",Объект.Лико_ВалютаРасчета), Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	Лико_РазрешениеЗаписи=Истина;
	Записать(ПараметрыЗаписи);
	  
  КонецПроцедуры //-Лико m.shenderov 18.12.2023
  
  &НаКлиенте
Асинх Процедура ПолучитьРазрешениеНаЗаписьПроверкаЦен(ПараметрыЗаписи)
	
		
	  Режим = РежимДиалогаВопрос.ДаНет;
	  Ответ = Ждать ВопросАсинх(СтрШаблон
	  ("Есть отличие от текущих цен!"), Режим, 0);
	  
	  Если Ответ = КодВозвратаДиалога.Нет Тогда
		  
		  Возврат;
		  
	  КонецЕсли;
	  
	  Лико_ЦеныПроверены	=	Истина;
	  Записать(ПараметрыЗаписи);   
	  
	  
КонецПроцедуры 


  
  
  &НаСервере
  Функция АвтоРасчетЦеныСервер(Номенклатура) //+Лико m.shenderov 14.02.2024  
	//УстановитьПривилегированныйРежим(Истина);  
	//  Возврат Номенклатура.ЦеноваяГруппа.Лико_АвтоРасчетЦены; 
	
	 Возврат РегистрыСведений.Лико_АвтоРасчетЦенЦГ.Установлен(
			Объект.Организация,
			Номенклатура.ЦеноваяГруппа,
			Объект.Дата); 

	  
  КонецФункции  //-Лико m.shenderov 14.02.2024
  
  


#КонецОбласти

 

Процедура ЗаполнитьВалютуЦГВтоварахСервер() //+Лико m.shenderov 20.12.2023
	//Если Объект.Лико_УстановкаЦен Тогда
		Соответствие=РегистрыСведений.Лико_СтоимостьЦеновыхГрупп.ПолучитьВалютуЦеновойГруппыПоНоменклатуре(Объект.Организация
		,Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
		
		Для каждого Товар Из Объект.Товары Цикл
			Товар.Лико_ВалютаЦГ=Соответствие[Товар.Номенклатура];
			Товар.Лико_ЦеноваяГруппа=Товар.Номенклатура.ЦеноваяГруппа;
			Товар.Лико_КодЦГ=Товар.Номенклатура.ЦеноваяГруппа.Код;
		КонецЦикла;
	//КонецЕсли;	
		
КонецПроцедуры //-Лико m.shenderov 20.12.2023

&НаКлиенте
Процедура Лико_Лико_ВидДопРасходаПриИзмененииПосле(Элемент)
		УстановкаНДСДляДопРасходовСервер();
	ЗаполнитьДопРасходыПоОрганизацииСервер(); 
	УстановитьКоэффКонвертацииСервер();
	Лико_УстановитьВидимость(); 
КонецПроцедуры

&НаКлиенте
Процедура Лико_ЦенаВключаетНДСПриИзмененииПосле(Элемент)
	Лико_ДопРасходыПриИзмененииНаСервере();
	Лико_УстановитьВидимость();

КонецПроцедуры


&НаСервере
Процедура УстановитьОформлятьПредзакзыПоставщикам() //+Лико m.shenderov 18.11.2024
	
	Лико_ОформлятьПредзакзыПоставщикам = Объект.Партнер.Лико_ОформлятьПредзакзыПоставщикам;
	
КонецПроцедуры  //-Лико m.shenderov 18.11.2024




