
&НаСервере
&Вместо("ЗаполнитьПредставления")
Процедура Лико_ЗаполнитьПредставления(Вариант)

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА НЕ ИзКонфигурации.Наименование ЕСТЬ NULL
	|			ТОГДА ИзКонфигурации.Наименование
	|		КОГДА НЕ ИзРасширений.Наименование ЕСТЬ NULL
	|			ТОГДА ИзРасширений.Наименование
	|		ИНАЧЕ Пользовательские.Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(Пользовательские.Описание, 1, 1) <> """"
	|			ТОГДА Пользовательские.Описание
	|		КОГДА НЕ ИзКонфигурации.Описание ЕСТЬ NULL
	|			ТОГДА ИзКонфигурации.Описание
	|		КОГДА НЕ ИзРасширений.Описание ЕСТЬ NULL
	|			ТОГДА ИзРасширений.Описание
	|		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(1000))
	|	КОНЕЦ КАК Описание, 
	|	&Мультиязычность
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК Пользовательские
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов КАК ИзКонфигурации
	|		ПО ИзКонфигурации.Ссылка = Пользовательские.ПредопределенныйВариант
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетовРасширений КАК ИзРасширений
	|		ПО ИзРасширений.Ссылка = Пользовательские.ПредопределенныйВариант
	|ГДЕ
	|	Пользовательские.Ссылка = &Вариант";

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда

	//	ТекстЗапросаМультиязычныеРеквизиты = "ВЫБОР
	//	|		КОГДА НЕ ИзКонфигурации.НаименованиеЯзык1 ЕСТЬ NULL
	//	|			ТОГДА ИзКонфигурации.НаименованиеЯзык1
	//	|		КОГДА НЕ ИзРасширений.НаименованиеЯзык1 ЕСТЬ NULL
	//	|			ТОГДА ИзРасширений.НаименованиеЯзык1
	//	|		ИНАЧЕ Пользовательские.НаименованиеЯзык1
	//	|	КОНЕЦ КАК НаименованиеЯзык1,
	//	|	ВЫБОР
	//	|		КОГДА НЕ ИзКонфигурации.НаименованиеЯзык2 ЕСТЬ NULL
	//	|			ТОГДА ИзКонфигурации.НаименованиеЯзык2
	//	|		КОГДА НЕ ИзРасширений.НаименованиеЯзык2 ЕСТЬ NULL
	//	|			ТОГДА ИзРасширений.НаименованиеЯзык2
	//	|		ИНАЧЕ Пользовательские.НаименованиеЯзык2
	//	|	КОНЕЦ КАК НаименованиеЯзык2,
	//	|	ВЫБОР
	//	|		КОГДА ПОДСТРОКА(Пользовательские.ОписаниеЯзык1, 1, 1) <> """"
	//	|			ТОГДА Пользовательские.ОписаниеЯзык1
	//	|		КОГДА НЕ ИзКонфигурации.ОписаниеЯзык1 ЕСТЬ NULL
	//	|			ТОГДА ИзКонфигурации.ОписаниеЯзык1
	//	|		КОГДА НЕ ИзРасширений.ОписаниеЯзык1 ЕСТЬ NULL
	//	|			ТОГДА ИзРасширений.ОписаниеЯзык1
	//	|		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(1000))
	//	|	КОНЕЦ КАК ОписаниеЯзык1,
	//	|	ВЫБОР
	//	|		КОГДА ПОДСТРОКА(Пользовательские.ОписаниеЯзык2, 1, 1) <> """"
	//	|			ТОГДА Пользовательские.ОписаниеЯзык2
	//	|		КОГДА НЕ ИзКонфигурации.ОписаниеЯзык2 ЕСТЬ NULL
	//	|			ТОГДА ИзКонфигурации.ОписаниеЯзык2
	//	|		КОГДА НЕ ИзРасширений.ОписаниеЯзык2 ЕСТЬ NULL
	//	|			ТОГДА ИзРасширений.ОписаниеЯзык2
	//	|		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(1000))
	//	|	КОНЕЦ КАК ОписаниеЯзык2";
	//Иначе
		ТекстЗапросаМультиязычныеРеквизиты  = "ИСТИНА";
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Мультиязычность", ТекстЗапросаМультиязычныеРеквизиты );

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Вариант", Вариант);

	Выборка = Запрос.Выполнить().Выгрузить();

	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(Объект, Выборка[0]);

КонецПроцедуры
