
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
		Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТабельныйНомер = Число(Прав(Объект.Сотрудник.Код, 10));
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	ПредыдущийТипДокумента = Объект.ТипДокумента;
	
	УстановитьВидимостьДоступностьЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ИзготовлениеФорм.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы;
	Элементы.ЗасветкаStork.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ЗасветкиStork;
	Элементы.ТрафСетки.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ТрафаретныеСетки;
	
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ДополнительныеПраваНачальникаФормногоУчастка")) Тогда
		Если Объект.Проведен Тогда
			Если Объект.Дата < ТекущаяДата() - 86400 Тогда
				ТолькоПросмотр = Истина;
			КонецЕсли;
			Элементы.ТабельныйНомер.ТолькоПросмотр = Истина;
		КонецЕсли;
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Сотрудник.Доступность = Ложь;
		Элементы.ОстаткиПоЗатратам.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	Если ПредыдущийТипДокумента <> Объект.ТипДокумента И ПроверитьНеобходимостьЗадаватьВопрос() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОНеобходимостиИзмененияТипаДокумента", ЭтотОбъект), "По предыдущему типу документа (" + ПредыдущийТипДокумента + ") уже есть введенные данные. При изменении они будут очищены." + Символы.ПС + "Вы уверены, что хотите изменить тип документа?", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ПредыдущийТипДокумента = Объект.ТипДокумента;
		УстановитьВидимостьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТабельныйНомерПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.Сотрудник = Неопределено;
	Если НЕ ЗначениеЗаполнено(ТабельныйНомер) Тогда
		Возврат;
	КонецЕсли;
	Объект.Сотрудник = Лико_Дополнительно.ОпределитьСотрудникаПоТабНомеру(ТабельныйНомер);
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТабельныйНомер = Формат(Число(Прав(Объект.Сотрудник.Код, 10)), "ЧГ=0");
		//УстановитьПривилегированныйРежим(Истина);
		Объект.Организация = Объект.Сотрудник.ГоловнаяОрганизация;
		//УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабельныйНомерПриИзменении(Элемент)
	
	ТабельныйНомерПриИзмененииНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьЗадаватьВопрос()
	
	Если (ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы И Объект.ИзготовлениеФорм.Количество() > 0)
		ИЛИ (ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ЗасветкиStork И Объект.ЗасветкаStork.Количество() > 0)
		ИЛИ (ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ТрафаретныеСетки И Объект.ТрафСетки.Количество() > 0) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтветНаВопросОНеобходимостиИзмененияТипаДокумента(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если ПредыдущийТипДокумента = Объект.ТипДокумента Тогда
			Возврат;
		Иначе
			// Чистим ТЧ
			ПочиститьТЧВЗависимостиОтТипа();
		КонецЕсли;
	Иначе
		// Возвращаем тип
		Объект.ТипДокумента = ПредыдущийТипДокумента;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПочиститьТЧВЗависимостиОтТипа()
	
	Если ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы Тогда
		Объект.ИзготовлениеФорм.Очистить();
	ИначеЕсли ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ЗасветкиStork Тогда
		Объект.ЗасветкаStork.Очистить();
	ИначеЕсли ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ТрафаретныеСетки Тогда
		Объект.ТрафСетки.Очистить();
	КонецЕсли;
	ПредыдущийТипДокумента = Объект.ТипДокумента;
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

//&НаСервере
//Функция ПроверитьВозможностьВыбораЗаказа(Заказ)
//	
//	Если Заказ.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда
//		Возврат Ложь;
//	Иначе
//		Возврат Истина;
//	КонецЕсли;

//КонецФункции

//&НаКлиенте
//Процедура ТаблицаЗаказОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	Если НЕ ПроверитьВозможностьВыбораЗаказа(ВыбранноеЗначение) Тогда
//		Сообщить("Данный заказ уже закрыт, его нельзя выбрать");
//		СтандартнаяОбработка = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТабельныйНомер = Число(Прав(Объект.Сотрудник.Код, 10));
	Иначе
		ТабельныйНомер = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//Начало изменений Иванова Анна 20181106 
&НаСервере
Процедура  ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор, НомерПроката= Неопределено, РабочийЦентр= Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	текстр = Объект[ИмяТЧ].НайтиПоИдентификатору(Идентификатор);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", текстр.Заказ);
	Если ЗначениеЗаполнено(НомерПроката) ТОгда 		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
		|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ
		|ИЗ
		|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|	И ЗаказКлиентаВидыРабот.НомерПроката = &НомерПроката";
		Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		текстр.рабочийцентр = Результат.РабочийЦентр;
	ИначеЕсли ЗначениеЗаполнено(Рабочийцентр) ТОгда  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 0) КАК НомерПроката
		|ИЗ
		|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|	И ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра = &ВидРЦ";
		Запрос.УстановитьПараметр("ВидРЦ", РабочийЦентр.ВидРабочегоЦентра);
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		текстр.номерпроката = результат.номерпроката;
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЦвета.Ссылка КАК Заказ,
		|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Заказ
		|	И ВЫБОР
		|			КОГДА &ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыДокументовОтчетФормногоУчастка.Формы)
		|				ТОГДА ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Флексо)
		|						ИЛИ ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Офсет)
		|			ИНАЧЕ ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаЦвета.НомерПроката,
		|	ЗаказКлиентаЦвета.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
		|	ВТ.НомерПроката КАК НомерПроката
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|		ПО ВТ.Заказ = ЗаказКлиентаВидыРабот.Ссылка
		|			И ВТ.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаВидыРабот.Ссылка,
		|	ВТ.НомерПроката,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка))";
		Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Количество() = 1 Тогда 
			Результат.Следующий();
			текстр.рабочийцентр = Результат.РабочийЦентр;
			текстр.номерпроката = Результат.НомерПроката;
		КонецЕсли;

	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура НомерПрокатаПриИзменении(Элемент)
	ИмяТЧ = Элемент.Родитель.Имя;
	текстр = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.НомерПроката) И ЗначениеЗаполнено(текстр.Заказ) Тогда 	
		//Если Не ЗначениеЗаполнено(стр.РабочийЦентр) ТОгда 
			Идентификатор = текстр.ПолучитьИдентификатор();
			ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор, текстр.НомерПроката);
		//КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РабочийЦентрПриИзменении(Элемент)
	ИмяТЧ = Элемент.Родитель.Имя;
	текстр = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.РабочийЦентр) И ЗначениеЗаполнено(текстр.Заказ) Тогда 	
		Если Не ЗначениеЗаполнено(текстр.НомерПроката) ТОгда 
			Идентификатор = текстр.ПолучитьИдентификатор();
			ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор, ,текстр.рабочийЦентр);
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ИмяТЧ = Элемент.Родитель.Имя;
	текстр = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.Заказ) Тогда 
		Идентификатор = текстр.ПолучитьИдентификатор();
		ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор,);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзготовлениеФормШиринаПриИзменении(Элемент)
	текстр = Элементы.ИзготовлениеФорм.ТекущиеДанные;
	текстр.площадь = текстр.ширина*текстр.длина;
КонецПроцедуры

&НаКлиенте
Процедура ИзготовлениеФормДлинаПриИзменении(Элемент)
	текстр = Элементы.ИзготовлениеФорм.ТекущиеДанные;
	текстр.площадь = текстр.ширина*текстр.длина;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.ВидПечати) Тогда 
		Сообщить("Необходимо указать вид форм: офсет или флексо");
		Отказ = Истина;
	КонецЕсли;
	Отказ = ПроверитьПлощадьКлишеНаСервере()
КонецПроцедуры

&НаСервере
Функция ПроверитьПлощадьКлишеНаСервере()
	Если Объект.ВидПечати = Справочники.Лико_ВидыПечати.Флексо Тогда
		Для Каждого Стр из Объект.ИзготовлениеФорм Цикл
			Если Не ЗначениеЗаполнено(стр.Заказ) Тогда 
				Сообщить("Необходимо указать заказ в строке "+стр.номерстроки);
				Возврат Истина;
			Иначе
				Если Не ЗначениеЗаполнено(стр.Заказ.ПлощадьКлише) Тогда 
				    Сообщить("Не указана площадь клише "+стр.номерстроки);
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
						

//КонецИзменений Иванова Анна 20181106

