
&НаСервере
&Вместо("ЗаполнитьСчетНапредоплатуНаСервере")
Процедура Лико_ЗаполнитьСчетНапредоплатуНаСервере(ДанныеФормы, СписокЗаказов)
		ДокСчет = Документы.Лико_СчетНаОплатуКлиенту.СоздатьДокумент();
    ДокСчет.Дата = ТекущаяДата();  
	ДокСчет.Менеджер = ПараметрыСеанса.ТекущийПользователь;  
	ПервыйЗаказ = СписокЗаказов[0].Значение;
	ДокСчет.Организация = ПервыйЗаказ.Организация;
	ДокСчет.Партнер = ПервыйЗаказ.Партнер; 
	ДокСчет.Контрагент = ПервыйЗаказ.Контрагент;
    ДокСчет.ЦенаВключаетНДС  = ПервыйЗаказ.ЦенаДляДокументовВключаетНДС;
    ДокСчет.Валюта  = ПервыйЗаказ.ВалютаДляДокументов;  
	ДокСчет.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;


   	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА ЗаказКлиентаТовары.Цена
	|					ИНАЧЕ ЗаказКлиентаТовары.Цена * 100 / (100 + ЕСТЬNULL(ЗаказКлиентаТовары.СтавкаНДС.Ставка, 0))
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ КАК Цена,
	|	ЗаказКлиентаТовары.ЦенаДляДокументов КАК ЦенаДляДокументов,
	|	ЗаказКлиентаТовары.Ссылка.ВалютаДляДокументов КАК ВалютаЦены,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&СписокЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.ЦенаДляДокументов,
	|	ЗаказКлиентаТовары.СтавкаНДС,
	|	ЗаказКлиентаТовары.Ссылка.ВалютаДляДокументов,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.ЦенаДляДокументов = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаДляДокументовВключаетНДС
	|						ТОГДА ЗаказКлиентаТовары.Цена
	|					ИНАЧЕ ЗаказКлиентаТовары.Цена * 100 / (100 + ЕСТЬNULL(ЗаказКлиентаТовары.СтавкаНДС.Ставка, 0))
	|				КОНЕЦ
	|		ИНАЧЕ ЗаказКлиентаТовары.ЦенаДляДокументов
	|	КОНЕЦ"; 
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	СтруктураКурсов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУпр,  ТекущаяДата());
	Если СтруктураКурсов.Курс = 0 Тогда
		СтруктураКурсов.Курс = 1;
	КонецЕсли;
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	Пока Выборка.Следующий() Цикл
		нстр = ДокСчет.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нстр, выборка, , "Цена"); 
		Если ЗначениеЗаполнено(выборка.ЦенаДляДокументов) Тогда
			//Если нстр.Лико_ВалютаДляДокументов = Объект.Валюта Тогда
				нстр.Цена = Выборка.ЦенаДляДокументов;
			//Иначе
			//	Если Объект.Валюта = ВалютаРегл Тогда
			//		нстр.Цена = Строка.ЦенаДляДокументов * СтруктураКурсов.Курс;
			//	Иначе
			//		нстр.Цена = Строка.ЦенаДляДокументов / СтруктураКурсов.Курс;
			//	КонецЕсли;
			//КонецЕсли;
		Иначе
			Если Выборка.ВалютаЦены = ВалютаРегл Тогда
				нстр.Цена = Выборка.Цена * СтруктураКурсов.Курс;
			Иначе
				нстр.Цена = Выборка.Цена;
			КонецЕсли;
		КонецЕсли;
        СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", Новый Структура("ЦенаВключаетНДС,СтавкаНДС", ДокСчет.ЦенаВключаетНДС, нстр.СтавкаНДС));
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураДействий.ПересчитатьСуммуНДС);
		СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(нстр, СтруктураДействий, КэшированныеЗначения);

		
	КонецЦикла;
	
	
	ЗначениеВДанныеФормы(ДокСчет,ДанныеФормы);

КонецПроцедуры

&НаСервере
&Вместо("ПолучитьТекстЗапросаСпискаЗаказовСервер")
Функция Лико_ПолучитьТекстЗапросаСпискаЗаказовСервер()
	Возврат 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        	|	ЗаказКлиентаДок.Дата КАК Дата,
	        	|	ЗаказКлиентаДок.НомерБезПрефикса КАК Номер,
	        	|	ЗаказКлиентаДок.Ссылка КАК Ссылка,
	        	|	ЗаказКлиентаДок.Версия КАК Версия,
	        	|	ЗаказКлиентаДок.ПовторЗаказа.НомерБезПрефикса КАК НомерПовторЗаказа,
	        	|	ЗаказКлиентаДок.Состояние КАК Состояние,
	        	|	ЗаказКлиентаДок.ТипЗаказа КАК ТипЗаказа,
	        	|	ЗаказКлиентаДок.ВидЗаказа КАК ВидЗаказа,
	        	|	ЗаказКлиентаДок.Этикетки КАК Этикетки,
	        	|	ЗаказКлиентаДок.Партнер КАК Партнер,
	        	|	ЗаказКлиентаДок.Тираж КАК Тираж,
	        	|	ЗаказКлиентаДок.ЦенаСредняя КАК Цена,
	        	|	ЗаказКлиентаДок.ЦенаДляДокументовСредняя КАК ЦенаДляДокументов,
	        	|	ЗаказКлиентаДок.Валюта КАК Валюта,
	        	|	ЗаказКлиентаДок.СуммаДокумента КАК СуммаДокумента,
	        	|	ЗаказКлиентаДок.МетражПМ КАК МетражПМ,
	        	|	ЗаказКлиентаДок.МетражКВМ КАК МетражКВМ,
	        	|	ЗаказКлиентаДок.ШтампВырубной.Артикул КАК ШтампВырубной,
	        	|	ЗаказКлиентаДок.ДлинаЭтикетки КАК ДлинаЭтикетки,
	        	|	ЗаказКлиентаДок.ШиринаЭтикетки КАК ШиринаЭтикетки,
	        	|	ЗаказКлиентаДок.Нарезка КАК Нарезка,
	        	|	ЗаказКлиентаДок.ОсновнойМатериал КАК Материал,
	        	|	ЗаказКлиентаДок.ЦветаСтрокой КАК Цвета,
	        	|	ЗаказКлиентаДок.Менеджер КАК Менеджер,
	        	|	ЗаказКлиентаДок.Тиснение КАК Тиснение,
	        	|	ЗаказКлиентаДок.Ламинация КАК Ламинация,
	        	|	ЗаказКлиентаДок.Конгрев КАК Конгрев,
	        	|	ЗаказКлиентаДок.ШтампыСтрокой КАК Штампы,
	        	|	ЗаказКлиентаДок.РабочийЦентр КАК РабочийЦентр,
	        	|	ЗаказКлиентаДок.Площадка КАК Площадка,
	        	|	ЗаказКлиентаДок.СтоимостьОснастки КАК СтоимостьОснастки,
	        	|	ЗаказКлиентаДок.Регион КАК Регион,
	        	|	ЗаказКлиентаДок.НомераКонтрактов КАК НомераКонтрактов,
	        	|	ЗаказКлиентаДок.ФормыСтрокой КАК Формы,
	        	|	ЗаказКлиентаДок.ОригиналМакет КАК ОригиналМакет,
	        	|	ЗаказКлиентаДок.Сканы КАК Сканы,
	        	|	ЗаказКлиентаДок.ДоходностьПлан КАК Доходность,
	        	|	ЗаказКлиентаДок.ЕстьЗаявкаНаОтгрузку КАК ЕстьЗаявкаНаОтгрузку,
	        	|	ЗаказКлиентаДок.СчетНаПредоплату КАК СчетНаПредоплату,
	        	|	ЗНАЧЕНИЕ(Справочник.Лико_ЭтапыВыполненияЗаказа.ПустаяСсылка) КАК Этап,
	        	|	"""" КАК КомментарийЭтапа,
	        	|	"""" КАК ПричинаБлокировки,
	        	|	ЗаказКлиентаДок.Артикулы КАК Артикулы,
	        	|	ЗаказКлиентаДок.ДоходПлан КАК Доход,
	        	|	ЗаказКлиентаДок.РентабельностьПлан КАК Рентабельность,
	        	|	ЗаказКлиентаДок.МетражПланКВМ КАК МетражПланКВМ,
	        	|	ЗаказКлиентаДок.МетражПланПМ КАК МетражПланПМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа КАК РезультатЗаказа,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ТиражВыпуск КАК ТиражВыпуск,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.МетражВыпускКВМ КАК МетражВыпускКВМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.МетражФактКВМ КАК МетражФактКВМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ПерерасходКВМ КАК ПерерасходКВМ,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ОсновнойМатериал КАК ОсновнойМатериал,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ДопМатериалы КАК ДопМатериалы,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Глубокая КАК Глубокая,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Флексо КАК Флексо,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Офсет КАК Офсет,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Трафарет КАК Трафарет,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Инкджет КАК Инкджет,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Индиго КАК Индиго,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Клики КАК Клики,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Оснастка КАК Оснастка,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ФормыЗасветки КАК ФормыЗасветки,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Прочее КАК Прочее,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Упаковка КАК Упаковка,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.СебестоимостьТабаш КАК Себестоимость,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.Стоимость КАК Стоимость,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ДоходТабаш КАК ДоходФакт,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.РентабельностьТабаш КАК РентабельностьФакт,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.ПроцентОтгрузки КАК ПроцентОтгрузки,
	        	|	ЗаказКлиентаДок.РезультатЗаказа.КоличествоОстаток КАК КоличествоОстаток
	        	|ИЗ
	        	|	Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	        	|ГДЕ
	        	|	ВЫБОР
	        	|			КОГДА &ПоказыватьАннулированные = ЛОЖЬ
	        	|				ТОГДА ЗаказКлиентаДок.Состояние <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаказов.Аннулирован)
	        	|			ИНАЧЕ ИСТИНА
	        	|		КОНЕЦ";
КонецФункции
