#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имя СКД базы распределения. СКД располагается в макетах этого объекта.
// Параметры:
//	БазаРаспределения - ПеречислениеСсылка.НаправлениеРаспределенияПоПодразделениям - база распределения.
// Возвращаемое значение:
//	Строка - имя СКД.
Функция ИмяСхемыБазыРаспределения(БазаРаспределения) Экспорт
	
	Возврат "НаправлениеРаспределения";
	
КонецФункции

#КонецОбласти

#КонецЕсли
