
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	УстановитьПривилегированныйРежим(Истина);
	
	Дата = НачалоДня(Дата);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;

	// Проверим, что на эту дату больше нет документов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_УстановкаРазмераОплатыСделкиУпаковщиков КАК Лико_УстановкаРазмераОплатыСделкиУпаковщиков
		|ГДЕ
		|	Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Ссылка <> &Ссылка
		|	И Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Дата = &Дата
		|	И Лико_УстановкаРазмераОплатыСделкиУпаковщиков.Площадка = &Площадка
		|	И Лико_УстановкаРазмераОплатыСделкиУпаковщиков.ПроизводственноеПомещение = &ПроизводственноеПомещение";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("ПроизводственноеПомещение", ПроизводственноеПомещение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		Отказ = Истина;
		Сообщить("На дату " + Дата + " уже есть документ """ + ВыборкаДетальныеЗаписи.Ссылка + """");
	КонецЕсли;

КонецПроцедуры
