
//&Вместо("ВыполнитьРасчетЭтапов")
//Процедура Лико_ВыполнитьРасчетЭтапов(ПараметрыЗапуска) // --> Маковеева А.Ю. 03.07.2024
//													   
//	УстановитьПривилегированныйРежим(Истина);
//	
//	ТаблицаЭтапы 	 = ПараметрыЗапуска.СтруктураДанных.ТаблицаЭтапы;
//	ПараметрыРасчета = ПараметрыЗапуска.СтруктураДанных.ПараметрыРасчета;
//	
//	РегистрыСведений.НастройкаБлокировкиОтИзменений.ПроверитьБлокировкиПередЗапускомРасчета(
//		ПараметрыРасчета.МассивОрганизаций,
//		ПараметрыРасчета.ПериодРегистрации);
//	
//	НомерПоследнейСтрокиДляРасчета = ТаблицаЭтапы.Индекс(ТаблицаЭтапы.Найти(ПараметрыЗапуска.ПоследнийЭтапДляРасчета, "Код"));
//	
//	Если ЗначениеЗаполнено(ПараметрыЗапуска.РассчитатьТолькоОдинЭтап) Тогда
//		НомерПервойСтроки 	 = ТаблицаЭтапы.Индекс(ТаблицаЭтапы.Найти(ПараметрыЗапуска.РассчитатьТолькоОдинЭтап, "Код"));
//		НомерПоследнейСтроки = НомерПервойСтроки;
//	Иначе
//		НомерПервойСтроки 	 = 0;
//		НомерПоследнейСтроки = НомерПоследнейСтрокиДляРасчета;
//	КонецЕсли;
//	
//	Для НомерСтроки = НомерПервойСтроки По ТаблицаЭтапы.Количество() - 1 Цикл
//		
//		// Действие с текущей строкой.
//		ВыполнениеПересчетаСтроки = (НомерСтроки <= НомерПоследнейСтроки);
//		ПоискСледующейСтрокиТребующейПересчета = НЕ ВыполнениеПересчетаСтроки И (НомерСтроки <= НомерПоследнейСтрокиДляРасчета);
//		АктуализацияСостоянияСтроки = НЕ ВыполнениеПересчетаСтроки И НЕ ПоискСледующейСтрокиТребующейПересчета И (НомерСтроки <= ТаблицаЭтапы.Количество() - 1);
//		
//		ТекущаяСтрока = ТаблицаЭтапы[НомерСтроки];      
//		
//		// --> Маковеева А.Ю. 25.03.2024
//		Если ТекущаяСтрока.Код = Перечисления.ОперацииЗакрытияМесяца.ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов Тогда     
//		 	Продолжить;
//		КонецЕсли;
//		// <-- Маковеева А.Ю. 25.03.2024
//		
//		// Пропускаем этапы, которые не выполняются при предварительном закрытии месяца.
//		Если ПараметрыЗапуска.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие
//		 И НЕ ТекущаяСтрока.ВыполняетсяПриПредварительномЗакрытииМесяца Тогда
//		 	Продолжить;
//		КонецЕсли;
//		
//		// При необходимости сначала актуализируем состояние этапа.
//		Если ПараметрыЗапуска.ПроверятьСостояниеДоРасчета
//		 ИЛИ ПоискСледующейСтрокиТребующейПересчета ИЛИ АктуализацияСостоянияСтроки Тогда
//			
//			ПараметрыЗапускаОбновленияСостояния = ИнициализироватьПараметрыЗапускаДляЗаполненияСостоянияЭтапов(
//				ПараметрыЗапуска.СтруктураДанных,
//				,
//				ТекущаяСтрока.Код,
//				ПараметрыЗапуска);
//			
//			ПараметрыЗапускаОбновленияСостояния.ВыполнятьПроверкиДоЭтапа 	   = Истина;
//			ПараметрыЗапускаОбновленияСостояния.ФормироватьОписаниеОрганизаций = Ложь;
//			
//			ЗаполнитьСостоянияЭтапов(ПараметрыЗапускаОбновленияСостояния);
//			
//		КонецЕсли;
//		
//		Если АктуализацияСостоянияСтроки Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		Если ВыполнениеПересчетаСтроки
//		 ИЛИ (ПоискСледующейСтрокиТребующейПересчета 
//		 	  И НЕ ЗакрытиеМесяцаСервер.ТребуетсяПересчетЭтапа(ТекущаяСтрока)) Тогда
//			  
//			// Очистим результаты прошлого расчета этапа.
//			ОчиститьРезультатыПроверокПередРасчетом(ТекущаяСтрока.Код, ПараметрыРасчета);
//			
//		КонецЕсли;
//		
//		Если ПоискСледующейСтрокиТребующейПересчета Тогда
//			Если ЗакрытиеМесяцаСервер.ТребуетсяПересчетЭтапа(ТекущаяСтрока) Тогда
//				Прервать;
//			Иначе
//				Продолжить;
//			КонецЕсли;
//	 	КонецЕсли;
//		
//		// Этап пересчитываем только если с ним есть проблемы.
//		Если НЕ ЗакрытиеМесяцаСервер.ТребуетсяПересчетЭтапа(ТекущаяСтрока) Тогда
//			Продолжить;
//	 	КонецЕсли;
//		
//		// Инициализируем обработчик расчета этапа.
//		ПараметрыОбработчика = ИнициализироватьПараметрыОбработчикаЭтапа(
//			ПараметрыЗапуска.СтруктураДанных,
//			ТекущаяСтрока,
//			ПараметрыЗапуска);
//		
//		Если ЗначениеЗаполнено(ПараметрыЗапуска.ИдентификаторРасчета) Тогда
//			ПараметрыОбработчика.ИдентификаторРасчета = ПараметрыЗапуска.ИдентификаторРасчета;
//		КонецЕсли;
//		
//		МассивПараметров = Новый Массив;
//		МассивПараметров.Добавить(ПараметрыОбработчика);
//		
//		ОписаниеВыполненияЭтапа = Новый Структура;
//		ОписаниеВыполненияЭтапа.Вставить("Операция",   ТекущаяСтрока.Код);
//		ОписаниеВыполненияЭтапа.Вставить("ДатаНачала", ТекущаяДатаСеанса());
//		
//		НачалоРасчета 	  = ТекущаяУниверсальнаяДатаВМиллисекундах();
//		БылаОшибкаРасчета = Ложь;
//		
//		// Выполним обработчик расчета этапа.
//		Попытка
//			
//			Если ЗначениеЗаполнено(ТекущаяСтрока.ДействиеВыполнить)
//			 И ЗначениеЗаполнено(ТекущаяСтрока.ДействиеВыполнить.Обработчик) Тогда
//				ОбщегоНазначения.ВыполнитьМетодКонфигурации(
//					ТекущаяСтрока.ДействиеВыполнить.Обработчик,
//					МассивПараметров);
//			КонецЕсли;
//			
//		Исключение
//			
//			БылаОшибкаРасчета = Истина;
//			
//			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru = 'При выполнении операции ""%1"" произошла ошибка:
//					|%2';
//					|en = 'An error occurred when performing operation ""%1"":
//					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
//				СокрЛП(ТекущаяСтрока.Наименование),
//				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//				
//			Если СтрНайти(ТекстОшибки, ЗакрытиеМесяцаСервер.СлужебныйСимвол_ИсключениеУжеОтработаноВЭтапеРасчета()) = 0 Тогда
//				// Ошибка не была отработана при выполнении этапа.
//				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(ПараметрыОбработчика, ТекстОшибки);
//			КонецЕсли;
//			
//		КонецПопытки;
//		
//		Если БылаОшибкаРасчета И ТранзакцияАктивна() Тогда
//			// Если в методе расчета этапа по каким-то причинам не была закрыта транзакция, то сделаем это здесь,
//			// чтобы гарантировать нормальное выполнение следующих этапов.
//			ОтменитьТранзакцию();
//		КонецЕсли;
//		
//		ЗавершитьПодчиненныеЗаданияЭтапаРасчета(ПараметрыОбработчика.ИдентификаторРасчета);
//		
//		// Зарегистрируем ошибки, обнаруженные в ходе расчета.
//		Для Каждого ОписаниеОшибки Из ПараметрыОбработчика.ТаблицаПояснения Цикл
//			
//			ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемыРасчета(
//				ТекущаяСтрока.Код,
//				?(ЗначениеЗаполнено(ОписаниеОшибки.Организация),
//					ОписаниеОшибки.Организация,
//					ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций),
//				ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации);
//				
//			ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемуВыполненияРасчета(
//				ПараметрыРегистрации,
//				Перечисления.ВажностьПроблемыУчета.ШаблонТекстаПроблемыОшибкаВыполненияКода(ОписаниеОшибки.Состояние),
//				ОписаниеОшибки.Состояние,
//				ОписаниеОшибки.Наименование,
//				ОписаниеОшибки.РасшифровкаОшибки);
//			
//		КонецЦикла;
//		
//		// Проверим наличие ошибок расчета (могут быть зарегистрированы в ходе расчета этапа).
//		ЭтапРассчитан = НЕ ЗакрытиеМесяцаСервер.ЕстьОшибкиВыполненияРасчета(
//		    ТекущаяСтрока.Код,
//			ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций,
//			ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации);
//			
//		// Сохраним сведения о выполненном расчете.
//		ОписаниеВыполненияЭтапа.Вставить("ДатаОкончания", ТекущаяДатаСеанса());
//		ОписаниеВыполненияЭтапа.Вставить("Длительность",  ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоРасчета);
//		
//		РегистрыСведений.ВыполнениеОперацийЗакрытияМесяца.СохранитьСведенияОВыполненииЭтапа(
//			ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций,
//			ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации,
//			ОписаниеВыполненияЭтапа,
//			НЕ ЭтапРассчитан);
//		
//		// Обновим состояние этапа после расчета.
//		ПараметрыЗапускаОбновленияСостояния = ИнициализироватьПараметрыЗапускаДляЗаполненияСостоянияЭтапов(
//			ПараметрыЗапуска.СтруктураДанных,
//			,
//			ТекущаяСтрока.Код,
//			ПараметрыЗапуска);
//		
//		ПараметрыЗапускаОбновленияСостояния.ВыполнятьПроверкиПослеЭтапа    = НЕ БылаОшибкаРасчета;
//		ПараметрыЗапускаОбновленияСостояния.ФормироватьОписаниеОрганизаций = Ложь;
//		
//		ЗаполнитьСостоянияЭтапов(ПараметрыЗапускаОбновленияСостояния);
//		
//		// Обновим состояние предшествующих этапов.
//		Для Каждого ОбновитьЭтап Из ТекущаяСтрока.ОбновитьСостояниеЭтапов Цикл
//			
//			ПараметрыЗапускаОбновленияСостояния = ИнициализироватьПараметрыЗапускаДляЗаполненияСостоянияЭтапов(
//				ПараметрыЗапуска.СтруктураДанных,
//				,
//				ОбновитьЭтап,
//				ПараметрыЗапуска);
//			
//			ПараметрыЗапускаОбновленияСостояния.ВыполнятьПроверкиДоЭтапа 	   = Истина;
//			ПараметрыЗапускаОбновленияСостояния.ФормироватьОписаниеОрганизаций = Ложь;
//			
//			ЗаполнитьСостоянияЭтапов(ПараметрыЗапускаОбновленияСостояния);
//			
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	Если ЗначениеЗаполнено(ПараметрыЗапуска.АдресХранилища) Тогда
//		
//		// Запущено как фоновое задание - вернем данные не через параметр, а через временное хранилище.
//		ПоместитьВоВременноеХранилище(ПараметрыЗапуска.СтруктураДанных, ПараметрыЗапуска.АдресХранилища);
//		
//	КонецЕсли;
//	
//	// Оповестим об окончании расчета.
//	Если ЗначениеЗаполнено(ПараметрыЗапуска.ИдентификаторРасчета) Тогда
//		РегистрыСведений.ВыполнениеОперацийЗакрытияМесяца.УстановитьПризнакОкончанияРасчета(ПараметрыЗапуска.ИдентификаторРасчета);
//	КонецЕсли;
//	
//КонецПроцедуры  // <-- Маковеева А.Ю. 03.07.2024
