
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьВидимостьСервер();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТрудозатратыИзЧислаВоВремяКлиент();
	ВремяРаботыСтанкаИзЧислаВоВремяКлиент();
	УстановитьНазаваниеРаботы();

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	      ЗаполнитьПолеЭтикеткиПоЗаказуСервер();
		  ЗапуститьПланированиеСервер();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаправитьВРаботу(Команда)
	
	НаправитьВРаботуКлиент();
	
КонецПроцедуры


&НаКлиенте
Процедура ТрудозатратыЧасПриИзменении(Элемент)
	Модифицированность=Истина;
	ТрудозатратыИзВремениВЧислоКлиент();
КонецПроцедуры


&НаКлиенте
Процедура ТрудозатратыПриИзменении(Элемент)
	ТрудозатратыИзЧислаВоВремяКлиент();
КонецПроцедуры


&НаКлиенте
Процедура ВремяРаботыСтанкаЧасПриИзменении(Элемент)
	Модифицированность=Истина;

	ВремяРаботыСтанкаИзВремениВЧислоКлиент();

КонецПроцедуры


&НаКлиенте
Процедура ВремяРаботыСтанкаПриИзменении(Элемент)
	ВремяРаботыСтанкаИзЧислаВоВремяКлиент();
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НаправитьВРаботуНаСервере()
	
	НачатьТранзакцию();	
	Если Объект.СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан Тогда		
		Статус=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование;
		Этап=Справочники.Лико_ЭтапыВыполненияЗаказа.Программирование;
	ИначеЕсли Объект.СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование Тогда 
		Статус=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.ГотовКГравировке;
		Этап=Справочники.Лико_ЭтапыВыполненияЗаказа.ГотовКГравировке;
		
	КонецЕсли;	
	ЗаписатьСтатусВЗаказСервер(Объект.Ссылка,Статус);
	
	Лико_ОбщегоНазначенияСервер.ЗаписатьРСЛико_ЭтапыЗаказа(
															Объект.Ссылка,
															Объект.Площадка,
															Этап,
															ТекущаяДата(),
															Новый Структура("Ответственный,Количество",Пользователи.ТекущийПользователь(),1)	
														  );
	
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьСтатусВЗаказСервер(Заказ,Статус) //+Лико m.shenderov 01.09.2021
	
	ДокОбъект=Заказ.ПолучитьОбъект();
	ДокОбъект.СтатусЗаказаНаПроизводствоОснасткиОснастки=Статус;
	ДокОбъект.ОбменДанными.Загрузка=Истина;
	ДокОбъект.Записать(); 
	Если Статус<>Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование Тогда 
		Документы.Лико_ЗаказОснастки.ОснасткаСоздатьСообщение(Заказ);
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 01.09.2021


//+ Лико m.shenderov 02.09.2021
&НаСервереБезКонтекста
Процедура ОснасткаСоздатьСообщение(Заказ) //+Лико m.shenderov 02.09.2021
	УстановитьПривилегированныйРежим(Истина);	
	Если Заказ.СтатусЗаказаНаПроизводствоОснасткиОснастки=Перечисления.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование  Тогда		
		ЗаголовокСообщения="готов к программированию.";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ПрограммированиеОснастки;		
	Иначе
		ЗаголовокСообщения="готов к гравировке.";
		ТипСообщения=Справочники.Лико_ТипыСообщений.ГотовКГравировкеОснастки;		
	КонецЕсли;
	
	Текст =  СтрШаблон("Заказ N %1 %2",Заказ.НомерБезПрефикса,ЗаголовокСообщения);
	
	Тема  = Текст;
	Текст=Текст+ Символы.ПС+ "Ссылка : "+Символы.ПС+Символы.ВК+ПолучитьНавигационнуюСсылку(Заказ.Ссылка);
	Для каждого Товар  Из Заказ.Товары  Цикл
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+ "        Номенклатура :  "+ СокрЛП(Товар.Номенклатура.Артикул)+" "+Строка(Товар.Номенклатура.Наименование);			
	КонецЦикла;	
	Текст=Текст+Символы.ПС+Символы.ВК;
	Текст=Текст+Заказ.Комментарий+Символы.ПС+Символы.ВК;
	
	
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Заказ.Площадка); 		
	
	Лико_Планирование.ОтправитьПисьмо(Текст, Тема, Адресат,,"textBody"); 
	
	
	
КонецПроцедуры //-Лико m.shenderov 02.09.2021


&НаСервере
Процедура УстановитьНазаваниеРаботы() //+Лико m.shenderov 31.08.2021
	
	Элементы.ФормаНаправитьВРаботу.Видимость=Истина;
	
	Если Объект.СтатусЗаказаНаПроизводствоОснасткиОснастки=ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан") ТОгда
		Элементы.ФормаНаправитьВРаботу.Заголовок="Взять в работу";
		Элементы.Разработчик.АвтоОтметкаНезаполненного        =Истина;
		Элементы.ТрудозатратыЧас.АвтоВыборНезаполненного      =Ложь;
		Элементы.ТрудозатратыМин.АвтоВыборНезаполненного      =Ложь;
		
		Элементы.ВремяРаботыСтанкаЧас.АвтоВыборНезаполненного =Ложь;
		Элементы.ВремяРаботыСтанкаМин.АвтоВыборНезаполненного =Ложь;


	ИначеЕсли Объект.СтатусЗаказаНаПроизводствоОснасткиОснастки=ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование") ТОгда
		
		Элементы.ФормаНаправитьВРаботу.Заголовок="Готов к гравировке";
		Элементы.Трудозатраты.АвтоОтметкаНезаполненного      =Истина;
		Элементы.Разработчик.АвтоОтметкаНезаполненного       =Истина;
		Элементы.ВремяРаботыСтанка.АвтоОтметкаНезаполненного =Истина;
		Элементы.ЗаготовкаРазмер1.АвтоОтметкаНезаполненного  =Истина;
		Элементы.ЗаготовкаРазмер2.АвтоОтметкаНезаполненного  =Истина;
		
		//Элементы.ТрудозатратыЧас.АвтоВыборНезаполненного     =Истина;
		//Элементы.ТрудозатратыМин.АвтоВыборНезаполненного     =Истина;
		//
		//Элементы.ВремяРаботыСтанкаЧас.АвтоВыборНезаполненного =Истина;
		//Элементы.ВремяРаботыСтанкаМин.АвтоВыборНезаполненного =Истина;

	Иначе
		Элементы.ФормаНаправитьВРаботу.Видимость              =Ложь;
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 31.08.2021


&НаСервере
Функция ПроверкаЗаполненияПолей() //+Лико m.shenderov 28.04.2021
	Результат=Истина;
	Если Объект.СтатусЗаказаНаПроизводствоОснасткиОснастки=ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан") Тогда
	
		СообщитьПользователю(Объект.Разработчик,"Объект.Разработчик","Разработчик",Результат);
			КонецЕсли;
	Если Объект.СтатусЗаказаНаПроизводствоОснасткиОснастки=ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказаНаПроизводствоОснастки.Программирование") Тогда
		СообщитьПользователю(Объект.Трудозатраты,"ТрудозатратыЧас","Трудозатраты",Результат);
		СообщитьПользователю(Объект.Разработчик,"Объект.Разработчик","Разработчик",Результат);
		СообщитьПользователю(Объект.ВремяРаботыСтанка,"ВремяРаботыСтанкаЧас","Время работы станка",Результат);
		СообщитьПользователю(Объект.ЗаготовкаРазмер1,"Объект.ЗаготовкаРазмер1","Ширина заготовки",Результат);
		СообщитьПользователю(Объект.ЗаготовкаРазмер2,"Объект.ЗаготовкаРазмер2","Высота загатовки",Результат); 	
	КонецЕсли;

	Возврат Результат;	
КонецФункции //-Лико m.shenderov 28.04.2021 


&НаСервере
Процедура СообщитьПользователю(Поле,РеквизитПоля,Текст,Результат)
	Если Не ЗначениеЗаполнено(Поле) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не заполнено: %1",Текст);
		Сообщение.Поле = РеквизитПоля; //имя реквизита 
		//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
		Сообщение.Сообщить(); 		
		Результат=Ложь;	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьСервер() //+Лико m.shenderov 01.09.2021
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.СтатусЗаказаНаПроизводствоОснасткиОснастки.ТолькоПросмотр=Истина;
	КонецЕсли;
	Если Не РольДоступна("ПолныеПрава") И  РольДоступна("Лико_Разработчик3dМоделей") Тогда
		
		Элементы.Дата.ТолькоПросмотр				=Истина;
		Элементы.Партнер.ТолькоПросмотр				=Истина;
		Элементы.Склад.ТолькоПросмотр				=Истина;
		Элементы.ДатаОтправкиВРаботу.ТолькоПросмотр	=Истина;
		Элементы.Подразделение.ТолькоПросмотр		=Истина;
		Элементы.ТипЗаказа.ТолькоПросмотр			=Истина;
		Элементы.ВидЗаказа.ТолькоПросмотр			=Истина;
		Элементы.Менеджер.ТолькоПросмотр			=Истина;
		Элементы.Площадка.ТолькоПросмотр			=Истина;		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 01.09.2021


&НаСервере
Процедура ЗаполнитьПолеЭтикеткиПоЗаказуСервер() //+Лико m.shenderov 02.09.2021
Если Объект.Товары.Количество()>0 И  ЗначениеЗаполнено(Объект.Товары[0].Заказ) Тогда 		
		Объект.Этикетки=Объект.Товары[0].Заказ.Этикетки; 		
	КонецЕсли;

	
КонецПроцедуры  //-Лико m.shenderov 02.09.2021

&НаСервере
Процедура ЗапуститьПланированиеСервер() //+Лико m.shenderov 02.09.2021
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВремяРаботыСтанка<>Объект.Ссылка.ВремяРаботыСтанка Тогда
		ПересчитатьПлан=Истина;	
	КонецЕсли;
	
КонецПроцедуры  //-Лико m.shenderov 02.09.2021

&НаСервере
Функция ПолучитьРабочийЦентрЗаказВПланеСервер() //+Лико m.shenderov 02.09.2021  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
	|		ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
	|	КОНЕЦ КАК ЗаказКлиента
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Выполнено = 0
	|	И НЕ ПооперационноеРасписание2_2.Моделирование
	|	И НЕ ПооперационноеРасписание2_2.Этап.ПометкаУдаления
	|	И НЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
	|				ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
	|			ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
	|		КОНЕЦ = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ПооперационноеРасписание2_2.РабочийЦентр,
	|	ВЫБОР
	|		КОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование
	|		ИНАЧЕ ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование.Лико_ЗаказКлиента
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("ЗаказКлиента",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	     Возврат Выборка.РабочийЦентр;
	КонецЦикла; 
	
	
	
	
КонецФункции  //-Лико m.shenderov 02.09.2021


&НаКлиенте
Асинх Процедура НаправитьВРаботуКлиент() //+Лико m.shenderov 07.09.2021
	 Отказ=Ложь;
	Отказ=Не ПроверкаЗаполненияПолей();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если ЭтаФорма.Модифицированность Тогда
			//Сообщить("Необходимо записать документ!");
			//Возврат;
			Записать();
		КонецЕсли;
		
		//Вопрос
		Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Выполнен")  ИЛИ Объект.Состояние= ПредопределенноеЗначение("Перечисление.Лико_СостоянияЗаказов.Закрыт") Тогда
			Сообщить ("Данный заказ уже выполнен!");
			Возврат;
		КонецЕсли; 		
		
		ЕСли Объект.СтатусЗаказаНаПроизводствоОснасткиОснастки=ПредопределенноеЗначение("Перечисление.Лико_СтатусыЗаказаНаПроизводствоОснастки.ВключенВПлан") Тогда
			ТекстВопроса="Взять в работу заказ?";
		Иначе
				ТекстВопроса="Заказ готов к гравировке?";
		КонецЕсли;
		
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;  	
			
		
		Режим = РежимДиалогаВопрос.ДаНет;
		
		Ответ = Ждать ВопросАсинх(НСтр(СтрШаблон("ru = '%1'",ТекстВопроса)), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		НаправитьВРаботуНаСервере();
		
	Иначе
		Сообщить("Необходимо записать заказ!");
		Возврат;
	КонецЕсли;
	Если Не Отказ Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры //-Лико m.shenderov 07.09.2021

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ПересчитатьПлан Тогда 
	ПересчитатьПлан=Ложь;	
	РабочийЦентПланирования=ПолучитьРабочийЦентрЗаказВПланеСервер();
		Если ЗначениеЗаполнено(РабочийЦентПланирования) Тогда
			Массив = Новый Массив();
			Массив.Добавить(РабочийЦентПланирования);
			Лико_Дополнительно.ПересчитатьМассивРЦВПлане(Массив);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыИзВремениВЧислоКлиент() //+Лико m.shenderov 20.09.2021
	
	Объект.Трудозатраты=ТрудозатратыЧас+ТрудозатратыМин/60;
	
КонецПроцедуры //-Лико m.shenderov 20.09.2021

&НаКлиенте
Процедура ТрудозатратыИзЧислаВоВремяКлиент() //+Лико m.shenderov 20.09.2021
	
	ТрудозатратыЧас=Цел(Объект.Трудозатраты);
	ТрудозатратыМин=(Объект.Трудозатраты*60)%60;
	
КонецПроцедуры //-Лико m.shenderov 20.09.2021



&НаКлиенте
Процедура ВремяРаботыСтанкаИзВремениВЧислоКлиент() //+Лико m.shenderov 20.09.2021
	
	Объект.ВремяРаботыСтанка=ВремяРаботыСтанкаЧас+ВремяРаботыСтанкаМин/60;
	
КонецПроцедуры //-Лико m.shenderov 20.09.2021


&НаКлиенте
Процедура  ВремяРаботыСтанкаИзЧислаВоВремяКлиент() //+Лико m.shenderov 20.09.2021
	
	 ВремяРаботыСтанкаЧас=Цел(Объект. ВремяРаботыСтанка);
	 ВремяРаботыСтанкаМин=(Объект. ВремяРаботыСтанка*60)%60;
	
КонецПроцедуры //-Лико m.shenderov 20.09.2021



#КонецОбласти





