
&После("ОбработкаУдаленияПроведения")
Процедура Лико_ОбработкаУдаленияПроведения(Отказ)
		// --> Начало Лико Ефимов ЕВВ 09.04.2018
	Лико_Дополнительно.ОчиститьРегистрРезервыТоваровОрганизацийПоРегистратору(Ссылка);
	// <-- Конец Лико Ефимов ЕВВ 09.04.2018 
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	ИсправлениеДокументов.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ВнутреннееПотреблениеЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	//++ НЕ УТ
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВПроизводство И НЕ ПометкаУдаления Тогда
		ТекстСообщения = НСтр("ru = 'Запись документа запрещена, т.к. операция ""Передача в производство"" больше не используется.
		|Передача материалов оформляется в форме ""Производство - Получение и возврат материалов"".';
		|en = 'It is prohibited to save the document because operation ""Transfer to production"" is not used.
		|Material transfer is recorded in form ""Production — Receipt and return of materials"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
	КонецЕсли;

	//-- НЕ УТ

	ТМЦВЭксплуатацииСервер.ВнутреннееПотребление_ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	Для Каждого ДанныеСтроки Из Товары Цикл
		Если ПотреблениеПоЗаказам 
			И ЗначениеЗаполнено(ЗаказНаВнутреннееПотребление) 
			И Не ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаВнутреннееПотребление) Тогда

			// Если передача по заказу, то нужно заполнить пустой заказ
			ДанныеСтроки.ЗаказНаВнутреннееПотребление = ЗаказНаВнутреннееПотребление;

		ИначеЕсли Не ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаВнутреннееПотребление)
			И ДанныеСтроки.ЗаказНаВнутреннееПотребление <> Неопределено Тогда

			ДанныеСтроки.ЗаказНаВнутреннееПотребление = Неопределено;

		КонецЕсли;
	КонецЦикла;

	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(
	ЭтотОбъект,
	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ВнутреннееПотребление));

	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;

	Документы.ВнутреннееПотребление.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);

	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
	ЭтотОбъект,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);

	// Выбор статей и аналитик.
	ПараметрыВыбораСтатейИАналитик = Документы.ВнутреннееПотребление.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);

	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "Товары");

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЗаполнитьАналитикиУчетаНоменклатурыВТабличныхЧастяхТоваров();
		ЗаполнитьВидыЗапасов(Отказ);
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Не ВидыЗапасовУказаныВручную Тогда
			ВидыЗапасов.Очистить();
		КонецЕсли;
	КонецЕсли;

	//++ НЕ УТ

	// Настройка счетов учета.
	НастройкаСчетовУчетаСервер.ПередЗаписью(ЭтотОбъект,
	Документы.ВнутреннееПотребление.ПараметрыНастройкиСчетовУчета(ХозяйственнаяОперация));
	//-- НЕ УТ

	//+ Лико m.shenderov 15.02.2018
	//ПодборСерий
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда 
		Если Не ЗначениеЗаполнено(Статус) Тогда
			Статус=Перечисления.СтатусыВнутреннихПотреблений.Принято;
		КонецЕсли;
		
		Серии.Очистить();
		Для каждого Товар Из Товары  Цикл
			Товар.СтатусУказанияСерий=0;				
		КонецЦикла; 
	КонецЕсли;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию И
		Лико_ВидОперации=Перечисления.Лико_ВидыОпераций_Списание.ПередачаВЭксплуатацию Тогда
		//Если ЗначениеЗаполнено(Лико_Распоряжение) Тогда
		Серии.Очистить();
		Для каждого Товар Из Товары  Цикл
			Товар.СтатусУказанияСерий=8;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
			|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
			|	ТоварыНаСкладахОстатки.Серия КАК Серия,
			|	ТоварыНаСкладахОстатки.Склад КАК Склад,
			|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
			|	МИНИМУМ(ТоварыНаСкладах.Период) КАК Дата
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
			|				&МомВрем,
			|				Склад = &Склад
			|					И Номенклатура = &Номенклатура
			|					И Характеристика = &Характеристика) КАК ТоварыНаСкладахОстатки
			|		ПО ТоварыНаСкладах.Склад = ТоварыНаСкладахОстатки.Склад
			|			И ТоварыНаСкладах.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
			|			И ТоварыНаСкладах.Характеристика = ТоварыНаСкладахОстатки.Характеристика
			|			И ТоварыНаСкладах.Серия = ТоварыНаСкладахОстатки.Серия
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыНаСкладахОстатки.ВНаличииОстаток,
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.Характеристика,
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Серия
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			Если ЗначениеЗаполнено(Дата) Тогда
				Если ЗначениеЗаполнено(Ссылка) ТОгда
					Запрос.УстановитьПараметр("МомВрем", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
				Иначе
					Запрос.УстановитьПараметр("МомВрем", Дата);
				КонецЕсли;
			Иначе
				Запрос.УстановитьПараметр("МомВрем", ТекущаяДата());
			КонецЕсли;
			Запрос.УстановитьПараметр("Склад",Склад );
			Запрос.УстановитьПараметр("Номенклатура",Товар.Номенклатура );
			Запрос.УстановитьПараметр("Характеристика",Товар.Характеристика );
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			ОсталосьПодобратьСерии=Товар.Количество;
			Пока Выборка.Следующий() Цикл
				Списать=Мин(ОсталосьПодобратьСерии,Выборка.Количество);
				ОсталосьПодобратьСерии=ОсталосьПодобратьСерии-Списать;
				НоваяСтрокаСерии=Серии.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСерии,Выборка,,"Количество");
				НоваяСтрокаСерии.Количество=Списать;
				Если ОсталосьПодобратьСерии=0 Тогда
					Прервать;
				КонецЕсли; 		
			КонецЦикла; 
		КонецЦикла;
		//КонецЕсли;
	КонецЕсли;
	//- Лико m.shenderov 15.02.2018    

КонецПроцедуры
