
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЗаполнитьОбщийВесКоробок();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешеноМенятьЗакрытуюЗаявку", Истина);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзменитьИнформациюОПеревозчике", Истина);
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент);
	АдресПредставление = "";
	АдресЗначениеПолей = "";
	Если ИмяРеквизитаИВладельцаАдресаДоставки.ПолныйПутьКСтрокеТЧ Тогда
		Выполнить("АдресПредставление = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита);
		Выполнить("АдресЗначениеПолей = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей");
		ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
		    Элемент,
			АдресПредставление,
			АдресЗначениеПолей);
		Выполнить(ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + " = АдресПредставление");
		Выполнить(ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей = АдресЗначениеПолей");
	Иначе
		ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
		    Элемент,
			Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита],
			Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяРеквизита + "ЗначенияПолей"]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	АдресДоставкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяРеквизитаИВладельцаАдресаДоставки = ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент);
	
	Владелец = Неопределено;
	Если ИмяРеквизитаИВладельцаАдресаДоставки.ПолныйПутьКСтрокеТЧ Тогда
		Выполнить("Владелец = " + ИмяРеквизитаИВладельцаАдресаДоставки.ИмяВладельца);
	Иначе
		Владелец = Объект[ИмяРеквизитаИВладельцаАдресаДоставки.ИмяВладельца];
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Сообщить("Не заполнен грузополучатель");
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", Владелец);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьАдресЗавершение", ЭтотОбъект, ИмяРеквизитаИВладельцаАдресаДоставки);
	ОткрытьФорму("ОбщаяФорма.Лико_ФормаВыбораАдреса", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОписаниеОповещения);

	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Если ДополнительныеПараметры.ПолныйПутьКСтрокеТЧ Тогда
			Выполнить(ДополнительныеПараметры.ИмяРеквизита + " = Результат.Представление");
			Выполнить(ДополнительныеПараметры.ИмяРеквизита + "ЗначенияПолей = Результат.ЗначенияПолей");
		Иначе
			Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат.Представление;
			Объект[ДополнительныеПараметры.ИмяРеквизита + "ЗначенияПолей"] = Результат.ЗначенияПолей;
			Если ДополнительныеПараметры.ИмяРеквизита = "АдресДоставки" Тогда
				Объект.ДополнениеКАдресуДоставки = Результат.Комментарий;
			КонецЕсли;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Водитель) Тогда
		ВодительПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	
	// Попробуем найти грузоперевозчика и машину
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТранспортныеСредстваЛико_Водители.Ссылка КАК Машина,
		|	ТранспортныеСредстваЛико_Водители.Ссылка.Лико_Грузоперевозчик КАК Диспетчер
		|ИЗ
		|	Справочник.ТранспортныеСредства.Лико_Водители КАК ТранспортныеСредстваЛико_Водители
		|ГДЕ
		|	ТранспортныеСредстваЛико_Водители.Водитель = &Водитель
		|	И НЕ ТранспортныеСредстваЛико_Водители.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортныеСредстваЛико_Водители.Ссылка.Код УБЫВ";
	
	Запрос.УстановитьПараметр("Водитель", Объект.Водитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	эОтбор.ПравоеЗначение = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ГруппаФизическихЛицВодители.ЗначениеПараметра");
	эОтбор.Использование = Истина;
	
	ПараметрыОтбора = Новый Структура;    
	ПараметрыОтбора.Вставить("ФиксированныеНастройки", фиксНастройки);
	ПараметрыОтбора.Вставить("РежимВыбора", Истина);
	ПараметрыОтбора.Вставить("Лико_РежимПросмотра", ОтображениеТаблицы.Список);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыОтбора,,,,, Новый ОписаниеОповещения("Лико_ВыбранВодитель", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ВыбранВодитель(Результат, ДопПараметры) Экспорт // --> Начало Лико Ефимов ЕВВ 27.12.2017
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.Водитель = Результат;
	КонецЕсли;
	ВодительПриИзменении(Неопределено);
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 27.12.2017

&НаКлиенте
Функция ПолучитьИмяРеквизитаИВладельцаАдресаДоставки(Элемент)
	
	Результат = Новый Структура("ПолныйПутьКСтрокеТЧ,ИмяРеквизита,ИмяВладельца", Ложь, "", "");
	Если СтрНайти(Элемент.Имя, "АдресГрузоотправителя") > 0 Тогда
		Результат.ИмяРеквизита = "АдресГрузоотправителя";
		Результат.ИмяВладельца = ПолучитьИмяГрузоотправителя();
	ИначеЕсли Элемент.Имя = "ЗаказыНаОтгрузкуАдресДоставки" Тогда
		// Получим полный путь к строке ТЧ
		Результат.ПолныйПутьКСтрокеТЧ = Истина;
		ИдСтроки = Элементы.ЗаказыНаОтгрузку.ТекущаяСтрока;
		ПутьКСтрокеТЧ = "Объект.ЗаказыНаОтгрузку.НайтиПоИдентификатору(" + ИдСтроки + ").";
		Результат.ИмяРеквизита = ПутьКСтрокеТЧ + "АдресДоставки";
		Результат.ИмяВладельца = ПутьКСтрокеТЧ + "Контрагент";
	Иначе
		Результат.ИмяРеквизита = "АдресДоставки";
		Результат.ИмяВладельца = "Контрагент";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяГрузоотправителя()
	Если ЗначениеЗаполнено(Объект.Грузоотправитель2) Тогда
		ИмяГрузоотправителя = "Грузоотправитель2";
	ИначеЕсли ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
		ИмяГрузоотправителя = "Грузоотправитель";
	Иначе
		ИмяГрузоотправителя = "Организация";
	КонецЕсли;
	
	Возврат ИмяГрузоотправителя;
КонецФункции

//&НаСервере
//Процедура ОбщаяСтоимостьДоставкиПриИзмененииНаСервере()
//	
//	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
//	РеквизитОбъект.РассчитатьСтоимостьДоставки();
//	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбщаяСтоимостьДоставкиПриИзменении(Элемент)
//	ОбщаяСтоимостьДоставкиПриИзмененииНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура СтоимостьДоставкиЗаКгПриИзмененииНаСервере()
//	
//	Объект.ОбщаяСтоимостьДоставки = Объект.СтоимостьДоставкиЗаКг * ОбщийВесКоробок;
//	ОбщаяСтоимостьДоставкиПриИзмененииНаСервере()	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СтоимостьДоставкиЗаКгПриИзменении(Элемент)
//	СтоимостьДоставкиЗаКгПриИзмененииНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьОбщийВесКоробок()
//	
//	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
//	ОбщийВесКоробок = РеквизитОбъект.РассчитатьОбщийВесКоробок();
//	
//КонецПроцедуры
