
&НаСервере
Процедура Лико_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	//+ Лико m.shenderov 09.11.2017
	Если Параметры.Свойство("Характеристика") Тогда
		Если ЗначениеЗаполнено(Параметры.Характеристика.ЯССМ_Нарезка) Тогда
			УпаковкаИзДокумента=Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Параметры.Характеристика.ЯССМ_Нарезка)
		КонецЕсли; 		
		Если Параметры.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал и Не ЗначениеЗаполнено(УпаковкаИзДокумента) Тогда
			Отказ=Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Необходимо заполнить характеристику.'"));
		КонецЕсли;	
	КонецЕсли;	
	//- Лико m.shenderov 09.11.2017 	
КонецПроцедуры
