
&Вместо("ПередЗаписью")
Процедура Лико_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	
	Если Не Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда

		ПередЗаписьюБезРегионов(Отказ, РежимЗаписи, РежимПроведения);

		Возврат;

	КонецЕсли;


	НомерСтроки=0;

	Для каждого Товар Из Товары Цикл
		ОбъектНоменклатуры=Товар.Серия.ЯССМ_ОбъектНоменклатуры;


		Если ОбъектНоменклатуры.Уникальный И 
			ОбъектНоменклатуры.Резерв <> Резерв И 
			ЗначениеЗаполнено(ОбъектНоменклатуры.Резерв) И 
			ЗначениеЗаполнено(Резерв) Тогда
			Отказ=Истина; 			



			ОбъектНоменклатуры_Резерв=ОбъектНоменклатуры.Резерв;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Материал: №%3 (%1) - %2 - #%4, необходимо снять с резерва: ""%5""!",
			Товар.Номенклатура.Код,
			Товар.Номенклатура,
			НомерСтроки+1,
			Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
			ОбъектНоменклатуры_Резерв);
			Сообщение.Поле = "Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();  				

		КонецЕсли;	
		НомерСтроки=НомерСтроки+1;

	КонецЦикла;


	Если Отказ Тогда
		Возврат;
	КонецЕсли;


	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	Для каждого Товар Из Ссылка.Товары Цикл

		Если Товар.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда

			НоваяСтрТз						=	ТЗ.Добавить();			 
			НоваяСтрТз.ОбъектНоменклатуры	= 	Товар.Серия.ЯССМ_ОбъектНоменклатуры;

		КонецЕсли;		
	КонецЦикла;

	ДополнительныеСвойства.Вставить("ТЗ_ОбъектыНоменклатуры",ТЗ); 

	ДополнительныеСвойства.Вставить("ОтменаРезерва",
	(Режимзаписи=РежимЗаписиДокумента.ОтменаПроведения И Ссылка.Проведен) Или 
	(Режимзаписи=РежимЗаписиДокумента.Проведение И Не ЗначениеЗаполнено(Резерв) И ЗначениеЗаполнено(Ссылка.Резерв)));


КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура Лико_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	
	Если ДополнительныеСвойства.ОтменаРезерва Тогда

		НаписатьПисьмоОтменаРезерва(); 

	КонецЕсли;

КонецПроцедуры
