
&Вместо("ЗаполнитьЭтапыОплатыДокументаПоШаблону")
Процедура Лико_ЗаполнитьЭтапыОплатыДокументаПоШаблону(ЭтапыГрафикаОплаты, ПараметрыЗаполнения)

	РаспределеннаяСуммаОплаты = 0;
	РаспределеннаяСуммаЗалога = 0;
	ТекущийЭтап               = 0;

	ШаблонГрафика             = ПараметрыЗаполнения.ШаблонГрафика;
	Календарь                 = ПараметрыЗаполнения.Календарь;
	СуммаОплатыКРаспределению = ПараметрыЗаполнения.СуммаОплаты;
	СуммаЗалогаКРаспределению = ПараметрыЗаполнения.СуммаЗалогаЗаТару;

	ДатаЗаказа                     = ПараметрыЗаполнения.ДатаЗаказа;
	ДатаСогласования               = ПараметрыЗаполнения.ДатаСогласования;
	СрокПереходаПраваСобственности = ПараметрыЗаполнения.СрокПереходаПраваСобственности;

	ЕстьТара = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты.Добавить(),"СуммаЗалогаЗаТару");
	ЕстьСуммаВзаиморасчетов = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты.Добавить(),"СуммаВзаиморасчетов");
	ЭтапыГрафикаОплаты.Очистить();

	Если ВзаиморасчетыКлиентСервер.ЭтоТабличнаяЧасть(ЭтапыГрафикаОплаты) Тогда
		НовыеЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты.Скопировать();
	Иначе
		НовыеЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты.Выгрузить();
	КонецЕсли;

	Если ТипЗнч(ПараметрыЗаполнения.ДатаОтгрузки) = Тип("Дата") Тогда
		ТаблицаОтгрузок = Новый ТаблицаЗначений();
		ТаблицаОтгрузок.Колонки.Добавить("ДатаОтгрузки");
		ТаблицаОтгрузок.Колонки.Добавить("СуммаПлатежа");
		ТаблицаОтгрузок.Колонки.Добавить("СуммаЗалогаЗаТару");
		НовСтр = ТаблицаОтгрузок.Добавить();
		НовСтр.ДатаОтгрузки = ПараметрыЗаполнения.ДатаОтгрузки;
		НовСтр.СуммаПлатежа = ПараметрыЗаполнения.СуммаОплаты;
		НовСтр.СуммаЗалогаЗаТару = ПараметрыЗаполнения.СуммаЗалогаЗаТару;
	Иначе
		ТаблицаОтгрузок = ПараметрыЗаполнения.ДатаОтгрузки;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаСогласования) Тогда
		ДатаСогласования = ДатаЗаказа;
	КонецЕсли;

	КоличествоЭтапов = ШаблонГрафика.Количество();

	// Определим последний незалоговый этап
	ПоследнийНезалоговыйЭтап = КоличествоЭтапов;
	Пока ПоследнийНезалоговыйЭтап <> 0 И ШаблонГрафика[ПоследнийНезалоговыйЭтап-1].ПроцентПлатежа = 0 Цикл
		ПоследнийНезалоговыйЭтап = ПоследнийНезалоговыйЭтап - 1;
	КонецЦикла;

	// Определим последний залоговый этап
	ПоследнийЗалоговыйЭтап = КоличествоЭтапов;
	Пока ПоследнийЗалоговыйЭтап <> 0 И ШаблонГрафика[ПоследнийЗалоговыйЭтап-1].ПроцентЗалогаЗаТару = 0 Цикл
		ПоследнийЗалоговыйЭтап = ПоследнийЗалоговыйЭтап - 1;
	КонецЦикла;

	// Если накладная вводится по всей сумме заказа, то и суммы в этапах следует взять из закаказа.
	КопироватьСуммуПлатежа = Ложь;
	КопироватьСуммуЗалогаЗаТару = Ложь;
	Если КоличествоЭтапов > 0 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШаблонГрафика[0],"СуммаПлатежа") Тогда
		Если ШаблонГрафика.Итог("СуммаПлатежа") = СуммаОплатыКРаспределению Тогда
			КопироватьСуммуПлатежа = Истина;
		КонецЕсли;
		Если ШаблонГрафика.Итог("СуммаЗалогаЗаТару") = СуммаЗалогаКРаспределению Тогда
			КопироватьСуммуЗалогаЗаТару = Истина;
		КонецЕсли;
	КонецЕсли;

	// Заполним этапы в соответствии с графиком оплаты
	Для Каждого Этап Из ШаблонГрафика Цикл

		ТекущийЭтап                     = ТекущийЭтап + 1;

		Если НЕ (СуммаОплатыКРаспределению <> 0 И Этап.ПроцентПлатежа <> 0
			ИЛИ СуммаЗалогаКРаспределению <> 0 И Этап.ПроцентЗалогаЗаТару <> 0) Тогда
			Продолжить;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Этап, "Календарь") Тогда
			Календарь = Этап.Календарь;
		КонецЕсли;

		Если Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа 
			Или Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования Тогда

			ЭтапГрафикаОплаты               = НовыеЭтапыГрафикаОплаты.Добавить();
			ЭтапГрафикаОплаты.ВариантОплаты  = Этап.ВариантОплаты;
			Если НЕ ПараметрыЗаполнения.ЭтоЗаказ 
				И (НЕ ПараметрыЗаполнения.НакладнаяПоЗаказам ИЛИ ПараметрыЗаполнения.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным)
				И (НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.ГрафикИсполненияДоговора) ИЛИ ПараметрыЗаполнения.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным) Тогда

				Если ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг
					ИЛИ ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг
					ИЛИ ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки
					ИЛИ ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления Тогда
					ЭтапГрафикаОплаты.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
				Иначе
					ЭтапГрафикаОплаты.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ДоДатыОтгрузки;
				КонецЕсли;
				ЭтапГрафикаОплаты.Сдвиг          = 0;

				Если ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения Тогда
					ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки;
				КонецЕсли;

				Если ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения Тогда
					ЭтапГрафикаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления;
				КонецЕсли;

				СтруктураПараметров = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
				СтруктураПараметров.ВариантОтсчета                 = ЭтапГрафикаОплаты.ВариантОтсчета;
				СтруктураПараметров.Сдвиг                          = ЭтапГрафикаОплаты.Сдвиг;
				СтруктураПараметров.ДатаЗаказа                     = ДатаЗаказа;
				СтруктураПараметров.ДатаСогласования               = ДатаСогласования;
				СтруктураПараметров.ДатаОтгрузки                   = ПараметрыЗаполнения.ДатаОтгрузки;
				СтруктураПараметров.ДатаПереходаПраваСобственности = ПараметрыЗаполнения.ДатаПереходаПраваСобственности;
				СтруктураПараметров.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
				СтруктураПараметров.Календарь                      = Календарь;

				Если ЗначениеЗаполнено(Календарь)  Тогда
					ЭтапГрафикаОплаты.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(СтруктураПараметров);
				Иначе
					ЭтапГрафикаОплаты.ДатаПлатежа = ЭтапыОплатыКлиентСервер.ДатаПлатежаБезКалендаря(СтруктураПараметров);
				КонецЕсли;

			Иначе
				ЭтапГрафикаОплаты.Сдвиг          = Этап.Сдвиг;
				ЭтапГрафикаОплаты.ВариантОтсчета = Этап.ВариантОтсчета;

				СтруктураПараметров = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
				СтруктураПараметров.ВариантОтсчета                 = ЭтапГрафикаОплаты.ВариантОтсчета;
				СтруктураПараметров.Сдвиг                          = ЭтапГрафикаОплаты.Сдвиг;
				СтруктураПараметров.ДатаЗаказа                     = ДатаЗаказа;
				СтруктураПараметров.ДатаСогласования               = ДатаСогласования;
				СтруктураПараметров.ДатаОтгрузки                   = Дата(1,1,1);
				СтруктураПараметров.ДатаПереходаПраваСобственности = Дата(1,1,1);
				СтруктураПараметров.СрокПереходаПраваСобственности = 0;
				СтруктураПараметров.Календарь                      = Календарь;

				Если ЗначениеЗаполнено(Календарь)  Тогда
					ЭтапГрафикаОплаты.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(СтруктураПараметров);
				Иначе
					ЭтапГрафикаОплаты.ДатаПлатежа = ЭтапыОплатыКлиентСервер.ДатаПлатежаБезКалендаря(СтруктураПараметров);
				КонецЕсли;
			КонецЕсли;

			Если КопироватьСуммуПлатежа Тогда 
				СуммаЭтапаОплаты                      = Этап.СуммаПлатежа;
			Иначе
				СуммаЭтапаОплаты                      = СуммаЭтапаОплаты(Этап, СуммаОплатыКРаспределению)
			КонецЕсли;
			ЭтапГрафикаОплаты.СуммаПлатежа        = ?(ТекущийЭтап = ПоследнийНезалоговыйЭтап, СуммаОплатыКРаспределению - РаспределеннаяСуммаОплаты, СуммаЭтапаОплаты);
			ЭтапГрафикаОплаты.ПроцентПлатежа      = ?(СуммаЭтапаОплаты <> 0, Этап.ПроцентПлатежа, 0);
			РаспределеннаяСуммаОплаты             = РаспределеннаяСуммаОплаты + ЭтапГрафикаОплаты.СуммаПлатежа;

			Если ЕстьТара Тогда

				Если КопироватьСуммуЗалогаЗаТару Тогда
					СуммаЭтапаЗалога                      = Этап.СуммаЗалогаЗаТару;
				Иначе
					СуммаЭтапаЗалога                      = СуммаЭтапаОплаты(Этап, СуммаЗалогаКРаспределению, Истина);
				КонецЕсли;

				ЭтапГрафикаОплаты.СуммаЗалогаЗаТару   = ?(ТекущийЭтап = ПоследнийЗалоговыйЭтап, СуммаЗалогаКРаспределению - РаспределеннаяСуммаЗалога, СуммаЭтапаЗалога);
				ЭтапГрафикаОплаты.ПроцентЗалогаЗаТару = ?(Этап.ПроцентЗалогаЗаТару > 0,Этап.ПроцентЗалогаЗаТару, 
				?(СуммаЗалогаКРаспределению<>0 И ЭтапГрафикаОплаты.СуммаЗалогаЗаТару <> 0,
				(Окр(ЭтапГрафикаОплаты.СуммаЗалогаЗаТару/СуммаЗалогаКРаспределению,2,РежимОкругления.Окр15как20))*100,
				0));
				РаспределеннаяСуммаЗалога             = РаспределеннаяСуммаЗалога + ЭтапГрафикаОплаты.СуммаЗалогаЗаТару;
			КонецЕсли;
		Иначе

			Если КопироватьСуммуПлатежа Тогда
				СуммаЭтапаОплатыКРаспределению = Этап.СуммаПлатежа;
			ИначеЕсли ТекущийЭтап = ПоследнийНезалоговыйЭтап Тогда
				СуммаЭтапаОплатыКРаспределению = СуммаОплатыКРаспределению - РаспределеннаяСуммаОплаты;
			Иначе
				СуммаЭтапаОплатыКРаспределению = СуммаЭтапаОплаты(Этап, СуммаОплатыКРаспределению)
			КонецЕсли;

			Если КопироватьСуммуЗалогаЗаТару Тогда
				СуммаЭтапаЗалогаКРаспределению = Этап.СуммаЗалогаЗаТару;
			ИначеЕсли ТекущийЭтап = ПоследнийЗалоговыйЭтап Тогда
				СуммаЭтапаЗалогаКРаспределению = СуммаЗалогаКРаспределению - РаспределеннаяСуммаЗалога;
			Иначе
				СуммаЭтапаЗалогаКРаспределению = СуммаЭтапаОплаты(Этап, СуммаЗалогаКРаспределению, Истина);
			КонецЕсли;

			РаспределеннаяСуммаОплатыЭтапа = 0;
			РаспределеннаяСуммаЗалогаЭтапа = 0;
			Для Каждого СтрокаДатыОтгрузки Из ТаблицаОтгрузок Цикл

				Если НЕ ЗначениеЗаполнено(СтрокаДатыОтгрузки.ДатаОтгрузки) Тогда
					ДатаОтгрузки = ПараметрыЗаполнения.ДатаЗаказа;
				Иначе
					ДатаОтгрузки = СтрокаДатыОтгрузки.ДатаОтгрузки;
				КонецЕсли;

				СтруктураПараметров = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
				Если Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПереходаПраваСобственности
					И НЕ ПараметрыЗаполнения.ЕстьДатаПереходаПраваСобственности
					ИЛИ НЕ ЗначениеЗаполнено(Этап.ВариантОтсчета) Тогда
					СтруктураПараметров.ВариантОтсчета                 = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
				Иначе
					СтруктураПараметров.ВариантОтсчета                 = Этап.ВариантОтсчета;
				КонецЕсли;
				СтруктураПараметров.Сдвиг                          = Этап.Сдвиг;
				СтруктураПараметров.ДатаЗаказа                     = ДатаЗаказа;
				СтруктураПараметров.ДатаСогласования               = ДатаСогласования;
				СтруктураПараметров.ДатаОтгрузки                   = ДатаОтгрузки;
				СтруктураПараметров.ДатаПереходаПраваСобственности = ПараметрыЗаполнения.ДатаПереходаПраваСобственности;
				СтруктураПараметров.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
				СтруктураПараметров.Календарь                      = Календарь;

				Если ЗначениеЗаполнено(Календарь)  Тогда
					ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(СтруктураПараметров);
				Иначе
					ДатаПлатежа = ЭтапыОплатыКлиентСервер.ДатаПлатежаБезКалендаря(СтруктураПараметров);
				КонецЕсли;

				Если (Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения
					Или Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления
					Или Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения
					Или Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки)
					И ЗначениеЗаполнено(ДатаОтгрузки)
					И ДатаПлатежа > ДатаОтгрузки Тогда
					ДатаПлатежа = ДатаОтгрузки;
				КонецЕсли;

				ЭтапГрафикаОплаты               = НовыеЭтапыГрафикаОплаты.Добавить();
				ЭтапГрафикаОплаты.ВариантОплаты = Этап.ВариантОплаты;
				ЭтапГрафикаОплаты.Сдвиг         = Этап.Сдвиг;
				ЭтапГрафикаОплаты.ВариантОтсчета = СтруктураПараметров.ВариантОтсчета;
				ЭтапГрафикаОплаты.ДатаПлатежа   = ДатаПлатежа;
				// <-- Начало Лико Яцун С. В. 12.11.2025
				Если ЭтапГрафикаОплаты.Сдвиг <> 0
					И ПараметрыЗаполнения.Свойство("Соглашение")
					И ТипЗнч(ПараметрыЗаполнения.Соглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами")
					И ЗначениеЗаполнено(ПараметрыЗаполнения.Соглашение.Лико_ФормулаРасчетаДатыПлатежа)
					И ПараметрыЗаполнения.Свойство("ОбъектЗаполнения")
					Тогда
					ОбъектЗаполнения = ПараметрыЗаполнения.ОбъектЗаполнения;
					Попытка
						ВЫПОЛНИТЬ("ЭтапГрафикаОплаты.ДатаПлатежа = " + ПараметрыЗаполнения.Соглашение.Лико_ФормулаРасчетаДатыПлатежа);
					Исключение
					КонецПопытки;
				КонецЕсли;
				// <-- Конец Лико Яцун С. В. 12.11.2025
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапГрафикаОплаты,"ДатаОтгрузки") Тогда
					ЭтапГрафикаОплаты.ДатаОтгрузки  = СтрокаДатыОтгрузки.ДатаОтгрузки;
				КонецЕсли;

				ЭтапГрафикаОплаты.СуммаПлатежа        = ?(СтрокаДатыОтгрузки = ТаблицаОтгрузок[ТаблицаОтгрузок.Количество()-1] ИЛИ СуммаЭтапаОплатыКРаспределению = 0,
				СуммаЭтапаОплатыКРаспределению - РаспределеннаяСуммаОплатыЭтапа,
				СуммаЭтапаОплатыКРаспределению * (СтрокаДатыОтгрузки.СуммаПлатежа/СуммаОплатыКРаспределению));
				РаспределеннаяСуммаОплатыЭтапа         = РаспределеннаяСуммаОплатыЭтапа + ЭтапГрафикаОплаты.СуммаПлатежа;
				РаспределеннаяСуммаОплаты              = РаспределеннаяСуммаОплаты + ЭтапГрафикаОплаты.СуммаПлатежа;

				Если ЕстьТара Тогда
					ЭтапГрафикаОплаты.СуммаЗалогаЗаТару   = ?(СтрокаДатыОтгрузки = ТаблицаОтгрузок[ТаблицаОтгрузок.Количество()-1] ИЛИ СуммаЭтапаЗалогаКРаспределению = 0,
					СуммаЭтапаЗалогаКРаспределению-РаспределеннаяСуммаЗалогаЭтапа,
					СуммаЭтапаЗалогаКРаспределению * (СтрокаДатыОтгрузки.СуммаЗалогаЗаТару/СуммаЗалогаКРаспределению));
					РаспределеннаяСуммаЗалогаЭтапа        = РаспределеннаяСуммаЗалогаЭтапа + ЭтапГрафикаОплаты.СуммаЗалогаЗаТару;
					РаспределеннаяСуммаЗалога             = РаспределеннаяСуммаЗалога + ЭтапГрафикаОплаты.СуммаЗалогаЗаТару;
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;
	КонецЦикла;

	Если ЕстьСуммаВзаиморасчетов Тогда

		ПоследнийНезалоговыйЭтап = 0;
		ПоследнийЗалоговыйЭтап = 0;
		Для Каждого Стр Из НовыеЭтапыГрафикаОплаты Цикл
			Если Стр.СуммаПлатежа <> 0 Тогда
				ПоследнийНезалоговыйЭтап = Стр;
			КонецЕсли;
			Если ЕстьТара И Стр.СуммаЗалогаЗаТару <> 0 Тогда
				ПоследнийЗалоговыйЭтап = Стр;
			КонецЕсли;
		КонецЦикла;

		СуммаВзаиморасчетовКРаспределению = ПараметрыЗаполнения.СуммаВзаиморасчетов;
		СуммаВзаиморасчетовПоТареКРаспределению = ПараметрыЗаполнения.СуммаВзаиморасчетовПоТаре;
		Для Каждого Стр Из НовыеЭтапыГрафикаОплаты Цикл

			Если Стр <> ПоследнийНезалоговыйЭтап И ПараметрыЗаполнения.СуммаОплаты <> 0 Тогда
				Стр.СуммаВзаиморасчетов = Стр.СуммаПлатежа/ПараметрыЗаполнения.СуммаОплаты * ПараметрыЗаполнения.СуммаВзаиморасчетов
			Иначе
				Стр.СуммаВзаиморасчетов = СуммаВзаиморасчетовКРаспределению;
			КонецЕсли;
			СуммаВзаиморасчетовКРаспределению = СуммаВзаиморасчетовКРаспределению - Стр.СуммаВзаиморасчетов;

			Если ЕстьТара Тогда
				Если Стр <> ПоследнийЗалоговыйЭтап И ПараметрыЗаполнения.СуммаЗалогаЗаТару <> 0 Тогда
					Стр.СуммаВзаиморасчетовПоТаре = Стр.СуммаЗалогаЗаТару/ПараметрыЗаполнения.СуммаЗалогаЗаТару * ПараметрыЗаполнения.СуммаВзаиморасчетовПоТаре
				Иначе
					Стр.СуммаВзаиморасчетовПоТаре = СуммаВзаиморасчетовПоТареКРаспределению;
				КонецЕсли;
				СуммаВзаиморасчетовПоТареКРаспределению = СуммаВзаиморасчетовПоТареКРаспределению - Стр.СуммаВзаиморасчетовПоТаре;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	КолонкиИзмерений = "ВариантОплаты, ДатаПлатежа, Сдвиг, ВариантОтсчета";
	КолонкиРесурсов = "СуммаПлатежа,ПроцентПлатежа"
	+ ?(ЕстьТара,",СуммаЗалогаЗаТару,ПроцентЗалогаЗаТару","")
	+ ?(ЕстьСуммаВзаиморасчетов,",СуммаВзаиморасчетов","")
	+ ?(ЕстьСуммаВзаиморасчетов И ЕстьТара,",СуммаВзаиморасчетовПоТаре","");
	НовыеЭтапыГрафикаОплаты.Свернуть(КолонкиИзмерений, КолонкиРесурсов);

	ЭтапыОплатыКлиентСервер.СортироватьТаблицуЭтапов(НовыеЭтапыГрафикаОплаты);
	ЗаполнитьПроцентыПоСуммам(НовыеЭтапыГрафикаОплаты);

	Для Каждого Стр Из НовыеЭтапыГрафикаОплаты Цикл
		ЗаполнитьЗначенияСвойств(ЭтапыГрафикаОплаты.Добавить(),Стр);
	КонецЦикла;

	Если ПараметрыЗаполнения.ЭтоРасчетыСклиентами И ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВПродажах")
		ИЛИ НЕ ПараметрыЗаполнения.ЭтоРасчетыСКлиентами И ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВЗакупках") Тогда
		ПреобразоватьТаблицуЭтаповВДанныеУпрощенногоРежима(ЭтапыГрафикаОплаты, ПараметрыЗаполнения.НетКонтроляПредоплаты);
	КонецЕсли;

КонецПроцедуры
