
&НаКлиенте
&Вместо("Подключаемый_ВыполнитьКоманду")
Процедура Лико_Подключаемый_ВыполнитьКоманду(Команда)

	Если Команда.Имя = "ПодменюПечатьОбычное__АктБрака" И ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		НеобходимыеРеквизиты = Лико_Дополнительно.ПолучитьЗначенияРеквизитовСсылки(Элементы.Список.ТекущаяСтрока, "СотрудникПринявшийРешение,Дефект,ОписаниеДефекта");
		Структура = Новый Структура;
		Структура.Вставить("СсылкаНаОбъект",Элементы.Список.ТекущаяСтрока);
		//Структура.Вставить("ПредседательКомисии",Объект.ЧленКомиссии1) ;
		//Структура.Вставить("ГлавныйТехнолог", НеобходимыеРеквизиты.СотрудникПринявшийРешение);
		//Структура.Вставить("НачальникОтделаЗакупок",Объект.ЧленКомиссии3) ;
		//Структура.Вставить("ОписаниеНедостатков", "" + НеобходимыеРеквизиты.Дефект + ?(ЗначениеЗаполнено(НеобходимыеРеквизиты.ОписаниеДефекта), " (" + НеобходимыеРеквизиты.ОписаниеДефекта + ")", ""));
		ОткрытьФорму("Обработка.ЯССМ__АктБрака.Форма.ОтчетУпр",Структура,,,,,,);
		Возврат;
	КонецЕсли;

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
